{"document": {"bbox": [540.95, 641.02, 712.4, 1433.67], "bbox_id": "3bd39d56b2", "file": "AppomattoxNewspapers_1908-1909a_0039.pdf", "page": 1, "text": "small hephew of the bride, was her train  bearer he wore white satin suit. The maid o honor was Miss Martha Louise Grant, of New York. The bridei maids were, Miâses Doris Wil kins, New York Virginia Per kins, Forrest, Va Hortensia Glmmël, Villamont, Va Char lotte Tiplàdÿ,b Koanoke, Va. Thé best man was a pother of the groom, Mr. Nelson Man ton, o  Boston, Mass. The ushers were Prof. Rolland Partridge, of Dur ham, New Hampshire Mr. Ed ward Crawford, of Manchester N. H  Mr. Eugene Maxam, Con cord, N. H Dr. C. F. James and Mr. Jerry Allen Burke, Appo mattox. During the ceremony Prof. Rolland Partridge, accom panied by. Mr. Edward W. Craw ford, on the piano, rendered two solos. Immediately after the nuptials a delightful reception was tend ered the bridal party and friends at the home of the brides par ents, Dr. and Mrs. William Lyle Ould, The house was beauti fully decorated with palms and cut flowers, the colors used in the decorations - as well as the buffet supper served by a Lynch burg caterer, were pink, green and white. Misses Marion Wag ner, Ruth Clement, Dorothy Evans, Emily Harvey,and Ver nie Oden assisted the hostess. Mrs. Jerry Allen Burke in a lovely go.wn of white embroider- ed georgette presided at th- puno-h bowl. Splendid music was provided. Among the outside guests for the wedding and re ception were Mrs. Robert Man- ton, Boston, Mass Mr. and Mrs. C. M, Franklin, Mi sses Margaret arid Ellen Franklin, of Washing ton, D. C Mrs. F. C. Perkins, and Frank Perkiùs, of Forrest, Va Rev. and Mrs. J. W. Marsh, Bedford, Va Mrs. W. S- Holt and Miss Pheobe Holt, of .Hali fax, Va, Mrs. A G Ballon,- Marguerite and Jason Ballon, of Lynchburg Mr. Ben F. Oden, of Washington Miss Vernie Oden, of Norfolk. Guest from Appo mattox were Mr. and Mrs. C. W Smith, Mrs. Foster, Mrs. Lottie Bledsoe, Mr. Allen H. Clement Miss Ruth Clement, Mr. and Mrs. Will Steele, Miss Eula Mae Burke, Mr. and Mrs, Richard"}, "highlight": {"text": {"matched_tokens": ["Allen", "H", "Clement", "Clement"], "snippet": "Mrs. Lottie Bledsoe, Mr. <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark> Miss Ruth <mark>Clement</mark>, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "H", "Clement", "Clement"], "snippet": "Mrs. Lottie Bledsoe, Mr. <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark> Miss Ruth <mark>Clement</mark>, Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [952.87, 852.53, 1112.94, 1086.96], "bbox_id": "77f3aca0f7", "file": "AppomattoxNewspapers_1898-1902a_0327.pdf", "page": 1, "text": "Resolved, That the thanks of this Conference be tendered to the peo ple of West Appomattox for their generous hospitality whicli has been extended to us during this session. Signed W. A . Christian. Resolved, That this District Con ference congratulate the handful oi ioyui members who have shown sucli zeal and enterprise in building this beautiful house or wursnip. Resolved, 2d, That we pray Gods continued blessing upon all the fam ilies represented, aiuL that tiie aus picious beginning they have made may be but a forecast of great suc cess and usefulness in the future. Signed C. V. Winfree. The following lay delegates were elected to the ensuing annual Con ference, ivhich meets in Norfolk in November W. W. Smith, Allen H. Clement, J. W. Elam, and Captain J. W. Dickinson. AlternatesD."}, "highlight": {"text": {"matched_tokens": ["Allen", "H", "Clement"], "snippet": "November W. W. Smith, <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark>, J. W. Elam, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "H", "Clement"], "snippet": "November W. W. Smith, <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark>, J. W. Elam, and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [298.54, 317.95, 455.03, 400.15], "bbox_id": "394b86f8a9", "file": "AppomattoxNewspapers_1902-1905a_0487.pdf", "page": 1, "text": "Mr. Allen H. Clement, for twelve veajs a highly esteemed and prominent citizen of this county is  candidate for the Legislature from Appomattox County.Am iierst County Progress. What a pity these esteemed friends are not Appomattox voters."}, "highlight": {"text": {"matched_tokens": ["Allen", "H", "Clement"], "snippet": "Mr. <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark>, for twelve veajs a"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "H", "Clement"], "snippet": "Mr. <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark>, for twelve veajs a"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [568.55, 1242.89, 724.19, 1264.39], "bbox_id": "c7cd6aa116", "file": "AppomattoxNewspapers_1898-1902a_0539.pdf", "page": 1, "text": "Messrs. Henry D. Flood, Saml L. Ferguson, and Allen H. Clement are"}, "highlight": {"text": {"matched_tokens": ["Allen", "H", "Clement"], "snippet": "Messrs. Henry D. Flood, Saml L. Ferguson, and <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark> are"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "H", "Clement"], "snippet": "Messrs. Henry D. Flood, Saml L. Ferguson, and <mark>Allen</mark> <mark>H</mark>. <mark>Clement</mark> are"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [540.45, 1229.02, 698.45, 1300.02], "bbox_id": "bca2c40bc3", "file": "AppomattoxNewspapers_1898-1902a_0299.pdf", "page": 1, "text": "Died at her home in this village, at 8 oclock on Wednesday evening, June 6,1900, little Florence Letitia, the infant daughter of Allen H. and Lena Bledsoe Clement, aged thirteen months. Burial to-day at Amherst."}, "highlight": {"text": {"matched_tokens": ["Allen", "H", "Clement"], "snippet": "the infant daughter of <mark>Allen</mark> <mark>H</mark>. and Lena Bledsoe <mark>Clement</mark>, aged thirteen months. Burial"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "H", "Clement"], "snippet": "the infant daughter of <mark>Allen</mark> <mark>H</mark>. and Lena Bledsoe <mark>Clement</mark>, aged thirteen months. Burial"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1446.49, 555.53, 1622.25, 1083.75], "bbox_id": "4694b9bd83", "file": "AppomattoxNewspapers_1926-1933a_0250.pdf", "page": 1, "text": "Virginia is fast becoming the American Mecca for the Tour ist. Each year hundreds of thousands from North, East, South, and West make the pil grimage to the Mother of AAA V a -. m w s u v V  A a O a O lU tU l f iH T 3s D. A. Christian. Mr. Herman Sears, of High Point, N. C., was.a recent guest of relatives here. Miss Gladys Coleman, if Blackstone, is visiting Miss Col leen Coleman. Clarence Agee, Jr., is spend ing some time at the Memorial hospital in Lynchburg. Misses Mildred and Hilda Carter are on a visit to rela tives in Lynchburg. _ Mr. Allen Kent, of Halifax visited Miss Lois Lucado dur ing the week-end. Miss Earle Patterson i s spending some time at Virginia Beach. Miss .Frances Stratten is spending her vacation at her home in Stonewall. Capt. T. A. Walton, who has been sick is able .to be out a gain. Miss Nash Lewis, of Rich mond,- was a guest this week in the hcfme of A. H. Clement. Mrs. J. D. Ferguson and J D. Ferguson, Jr., were visitors to Virginia Beach, this week. Mrs. Schute and son are spending some time at the Beach. Miss Emily Smith is spend ing a part of her vacation in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "the hcfme of A. <mark>H</mark>. <mark>Clement</mark>. Mrs. J. D. Ferguson"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "the hcfme of A. <mark>H</mark>. <mark>Clement</mark>. Mrs. J. D. Ferguson"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [784.54, 447.21, 945.78, 744.34], "bbox_id": "18df994096", "file": "AppomattoxNewspapers_1912-1915a_0040.pdf", "page": 1, "text": "uommissiouers Sale ol Mineral Right in Bjckingtiam County, Virginia. Pursuant to decrees of the Circnlt Court of tbe County of Buckingham, rendered at the May term 1902 and especially at the Septem ber term, 1912, In tbe chancery suit of W. R. A llenvs .lt C. Garnett et als. The under- lgned special commissioners will on the .2TH DAY OF XOVE nBEH, 1912, offer for sale at public auction a t Buckingham Court House all of the mineral rights In and under the following tracts of land mentioned and described as follows, to-wit, in said proceed ings Lot No. 4. allotted to Wm. A. John W. Robert S. aud Emmett Smith, heirs of Mary Smith, deceased, containing 168 acres. Lot No. 3, allotted to Louise C. Guthrie containing 168 acres. Lot No , containing 169 acres, allotted to Johanna B. Wood, Wm. and Thomas Allen heirs of Susan a . Allen, deceased, contain ing 175 acres. Also lot on Court House road, containing  acres, allotted to A. C. Garnett. Also a tract of land known as the Cook f a c t containing 321 acres. The mineral rights will be offered as a whole ail of the surface rights In the said tracts of land beldg expressly reserved. TERMS OF SALEOne-fourth cash aud tbe balance of the purchase money in three equal instalments, payable six, tw elve and eighteen months after date of sale with In terest from date evidenced by the bonds of the purchaser and the title to be retained until the purchase money Is paid In full and a conveyance ordered by tbe court. Bale subject to confirmation by the court. B. W. HUBARD, WM. M. SMITH, A. H. CLEMENT,- Special Commissioners."}, "highlight": {"text": {"matched_tokens": ["H", "CLEMENT"], "snippet": "WM. M. SMITH, A. <mark>H</mark>. <mark>CLEMENT</mark>,- Special Commissioners."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "CLEMENT"], "snippet": "WM. M. SMITH, A. <mark>H</mark>. <mark>CLEMENT</mark>,- Special Commissioners."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.03, 348.17, 1571.34, 1768.65], "bbox_id": "9df558f790", "file": "AppomattoxNewspapers_1926-1933a_0240.pdf", "page": 1, "text": "Mr. Edward Coffman is visit ing his parents here. Mr. and Mrs. C. W. Potts, of Lynchburg, spent the week-end at the home of A. H. Clement. Mr. A. B. Torrence of Prince ton, W. Va., is spending a few days with home folk here. Miss Eula Mae Burke has returned from a visit to Nor folk. I Miss Alice Harwood has ac cepted a position as teacher in a school rear ChrisLansburg. Misses Sadie Re  toldb and Frankie McKinney were visi tors in Farmville last week. Appomattox lost in a game of golf with Crewe, played at the last named place. Mrs. Charles Weaver, of Ok lahoma City, is visiting her sis ter, Mrs. Edward OBrien. Dr. D. N. Twyman visited his brother, Mr. Fred Twyman in Charlottesville this week. Sow rye and turnips now and get the land ready for oats and wheat. Mr. and Mrs. Walter Bryant, of Charlotte, were visitors here yesterday.  Messrs. Crews and Goodman of Hot Springs were business visitors here yesterday. Rube Hudgins and Senator Ferguson are disbursing 2,000 to those who need it for seed. Mr. Harry Hancock, of Lynchburg, was in town Mon day. Mrs. Louella Morris has re turned from a trip to Coving ton. Mrs. C. A. Anderson re turned yesterday from an ex tended visit to her daughter, Mrs. Crabtree, at Tazewell, Va. Appomattox will be able to feed herself and poor old Unc le Sam cant do a thing before Congress meets if then. Dont forget the sale of Le- lia B. Inge property, Saturday, Sept. 27, at 3 P. M. C. W. Smith, Executor. 2t Mr. Harvey Morris, of Rich mond, was a guest this week of his mother, Mrs. Louella Morris. Mr. William Burke, who is studying law at the University of Virginia, left Thursday to take up his work for the year. Mr. Lee Agee and daughter, Miss Marion, have been on a visit to Mr. and Mrs. Whit Agee.. Mrs. Raymond Lawson, Mis- les Hazel and Marion Elliot vere recent guests in the home f Seitator S. L. Ferguson. Mrs. Anna Flood and child ren, Bolling and Eleanor, of Washington, D. C., spent the week-end in Appomattox. Mrs. L. W Bryant and child ren have returned home after ivisiting friends and relatives in fRoanoke, Dublin. and Pulaski. 1 Mr. Allen Gills, of Cleve- larid, Ohio, is spending his vta- ctionwith his parents, Mr nd Mrs. W. P. Gills. Miss Gladys Inge leaves this week for Philadelphia, where ffcrill study to fit herself for Service work. Mrs. Sally Genheimer, of Roanoke, was a recent guest jjn the home of Dr. D. N. Twy- fuan. Miss Mary Grey Sears leic Tuesday for Lynchburg, where ne has enrolled as a freshman it RandolphMacon. Miss Lucy LeGrand left this week for Richmond, where she Iwill resume her studies at IWesthampton college.,- M i s s Eleanor - Harwood leaves this week to enroll as a student in the Atlantic Univer sity at Virginia Bepch. Mr. and Mrs. T. A. Walton have returned home after visit- ing their daughter, Mrs. W. S. Green, at Burkeville. . Mr. and Mrs. W. A. Trent, Mr. and Mrs. Justin Burkey and Mrs. Alma Beatty visited relatives in Buckingham Sun day. Miss Elizabeth McDearmon left Sunday for Columbia, S C., where she will enroll as ta student at the University of South Carolina."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "the home of A. <mark>H</mark>. <mark>Clement</mark>. Mr. A. B. Torrence"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "the home of A. <mark>H</mark>. <mark>Clement</mark>. Mr. A. B. Torrence"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.03, 329.5, 1566.28, 1456.94], "bbox_id": "435ad4304d", "file": "AppomattoxNewspapers_1908-1909a_0240.pdf", "page": 1, "text": "Mr. Edward Coffman is visit ing his parents here. Mr. and Mrs. C. W. Potts, of Lynchburg, spent the week-end at the home of A. H. Clement. Mr. A. B. Torrence of Prince ton, W. Va., is spending a few days with home folk here. Miss Eula Mae Burke has returned from a visit to Noif- olk. I Miss Alice Harwood has ac cepted a position as teacher in a school rear Christiansburg. Misses Sadie Reiolds and Frankie McKinney were visi tors in Farmville last week. Appomattox lost in a game of golf with Crewe, played at the last named place. Mrs. Charles Weaver, of Ok lahoma City, is visiting her sis ter, Mrs. Edward OBrien. Dr. D. N. Twyman visited his brother, Mr. Fred Twyman in Charlottesville this week. Sow rye and turnips now and get the land ready for data hnd wheat. - j  Mr. and Mrs. Walter Bryant, of Charlotte, were visitors here y e s t e r d a y .  i it  Messrs. Crews and Goodman of Hot Springs were, business visitors here yesterday. Rube Hudgins and Senator Ferguson are disbursing 2,000 to those who need it for seed. Mr. Harry Hancock, of Lynchburg, was in town Mon day.  Mrs. Louella Morris has r- turnedC from a trip to Coving ton. Mrs. C. A. Anderson re turned yesterday from an ex tended visit to her daughter, Mrs. Crabtree, at Tazewell, Va. Appomattox will be able to feed herself and poor old Unc le Sam cant do a thing before Congress meets if then. . of Le- lia B. Inge property, Saturday, Sept. 27, at 3 P, M. C. W. Smith, Executor. 2t Mr. Harvey Morris, of Rich mond, was a guest this week of his mother, Mrs. Louella Morris. Mr. William Burke, who is studying law at the University of Virginia, left Thursday to take up his work for the year. Mr. Lee Agee and daughter, Miss Marion have been on a visit to Mr. apd Mrs. Whit Agee.. Mrs. Raymond Lawson, Mis ses Hazel and Marion Elliot pere recent guests in the home of Senator S. L. Ferguson , Mrs. Xnna Flood and child ren, Bolling and Eleanor, of ashington, D. C., spent the eek-end m Appomattox. Mrs. L. W. Bryant and child en have returned home after siting friends and relatives in Jtoanohe, Dublin, and .Pulaski. Mr. Allen Gills, of Cleve- njpfet, Ohio is spending his vta- rtitiorTVith his parents, Mr md Mrs. W. P Gills. Miss Gladys Inge leaves this iweek for Philadelphia, where hSitFiH study to fit herself for Service work Mrs.Sally Genheimer, of m oke, waa ft recent guest .the home of Dr. P. N. Twy- an. Miss Mary Grey Sears left"}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "the home of A. <mark>H</mark>. <mark>Clement</mark>. Mr. A. B. Torrence"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "the home of A. <mark>H</mark>. <mark>Clement</mark>. Mr. A. B. Torrence"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.46, 672.66, 1611.23, 851.7], "bbox_id": "9c33cd8117", "file": "AppomattoxNewspapers_1908-1909a_0324.pdf", "page": 1, "text": "Mr. A. H. Clement entertain ed a few guests last Friday Evening at his home Allen- dale in honor of his daughter,  Mrs. C. W. Potts. Mr. N. A. Wagers is exhi biting his school desk equip- nent at thè Teachers Conven- l ion in Richmond. Mr. and Mrs. C. F. James, Charles James and Mfss Mat- j ie McCain atten4ed the game rtt Richmond today.  ,"}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "Mr. A. <mark>H</mark>. <mark>Clement</mark> entertain ed a few"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "Mr. A. <mark>H</mark>. <mark>Clement</mark> entertain ed a few"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [784.53, 447.34, 948.9, 747.52], "bbox_id": "c2c2d84b4b", "file": "AppomattoxNewspapers_1912-1915a_0044.pdf", "page": 1, "text": "lonimissiouers Sale of Mineral Right in Buckingham County, Virginia. Pursnant to decrees of the Circuit Court of the County of Buckingham, rendered at the May term 1903 and especially at tbe Septem ber term, 1913, In the chancery suit of W. K, Allen vs. K C. G irnett et als. The uuder- ligned special commissioners wUl on the .2TH DAY OF NOVEMBER, 1913, offer lor sale at public auction at Buckingham Court House all ot the mineral rlghtB In and under the following tracts of land mentioned and described as follows, to-wlt, In said proceed i mgs Lot No. 4. allotted to Wm. A.. John W., Robert S. and Emmett Smith, heirs ol Mary Smith, deceased, containing 168 acres. Lot No. 3. allotted to Louise C. Guthrie containing 168acres. . Lot No ti, containing 169 acres, allotted to Johanna B. Wood, Wm. and Thomas Allen, heirs of Susan a . Allen, deceased, contain ing 175 acres. Also lot on Court House road, containing 35 acres, allotted to A. C. Oarnett. Also a tract of land known as the Cook tract containing 331 acres. The mineral rights will be offered as a whole all of tbe surface rights in the said traot 8 of land beidg expressly reserved. TERMS OF SALE -Jue-fourth cash aud tbe balance of the purchase money in three equal instalments, payable six, twelve and eighteen months after date of sale with in terest from date evidenced by the bonds of tbe purchaser and tbe title to be retained until the purchase money Is paid in full aDd a conveyance ordered by the court. Sale subject to confirmation by the court. E. W. HUBARD, WM. M. SMITH, A. H. CLEMENT. Special Commissioners."}, "highlight": {"text": {"matched_tokens": ["H", "CLEMENT"], "snippet": "WM. M. SMITH, A. <mark>H</mark>. <mark>CLEMENT</mark>. Special Commissioners."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "CLEMENT"], "snippet": "WM. M. SMITH, A. <mark>H</mark>. <mark>CLEMENT</mark>. Special Commissioners."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [937.2, 1304.47, 1263.95, 1474.07], "bbox_id": "7a6f45e260", "file": "AppomattoxNewspapers_1939-1943a_0132.pdf", "page": 1, "text": "land owned by Catherine Walker at r it -  j  tiroe of her death and was con- In execution of a Deed of Trust veyed to the said Catherine Walker executed by Emma V. Evans et ala by Deed of record in the Clerks of- of record ,n the Clerks Office of fice of the Circuit Court of Appo- he Circuit Court of Appomattox Co-mattox county, Virginia in Deed unty. Virginia, in Deed Book No. Book No 23 at p  T V l7te 29 at page No. 120, the undersigned 2nd All of that certain tract nr having been substituted in the place parcel of real estate tybig Lid b and stead of A . H . Clement named ing in Clover Hill Dmtrien Truatoe m raid Deed by the Cir- mfttox County V i r S S   L t g  curt C om of Appomattox Va . by  miles North of Pampl n, VirarinU order entered by said Court on Jan- containing 22 acres , la uary 18. 1935, default having been a d j S f f t h e S o H n i J a h f e made in the payment of the debt chell, Allen Hard? and otoSi and herein secured, and having been re-lying on Swanevs   I f 4 ?  if- 4  p ik S  will sell at public auction to the of land a n d hein   - Highest bidder, for cash, at Appo-1 parcels o f real .tot n"}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "and stead of A . <mark>H</mark> . <mark>Clement</mark> named ing in Clover"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "and stead of A . <mark>H</mark> . <mark>Clement</mark> named ing in Clover"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [473.99, 688.49, 665.89, 941.59], "bbox_id": "c7057afe90", "file": "AppomattoxNewspapers_1939-1943a_0331.pdf", "page": 1, "text": "In the Clerks Office of the Cir- t C .uf of Appomattox County, the  day of August., 1041. J. E. Dinwiddie, Admr, of A. i lament, decd., with his Will a-1 zed .......................... Plaintiff ane  zainst Allen B. Clement, Sr., Pauline ! nt Craig, Lena Pauline Steff- .nk G. Craig Jr., and un- .n heirs of A. H. Clement, de- ased., .................. Defendants. The object of this suit is to have Trustee appointed for the Estate of A. H. Clement, under the terms  his WilL nd it appearing by affidavit fil- ..i that Allen B. Clement Sr., Paul- i.ic Clement Craig, Lena Pauline hteffler and Frank G. Craig Jr., are i residents of the State of Vir- and any k own heirs of v H. Clemen.. Decd., they are by required to appear within i days after th due publication hls order and do what is neces- y t protect their interests."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "n heirs of A. <mark>H</mark>. <mark>Clement</mark>, de- ased., .................. Defendants. The"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "n heirs of A. <mark>H</mark>. <mark>Clement</mark>, de- ased., .................. Defendants. The"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.9, 676.51, 2004.81, 926.76], "bbox_id": "5bcdaaf013", "file": "AppomattoxNewspapers_1939-1943a_0336.pdf", "page": 1, "text": "in the Clerks Office of the Cir- nit C u ? of Appomattox County, n the  day of August, 1941. J. E. Dinwiddie, Admr, of A. IJ. ament, decd., with his Will an- xed, ...................... Plaintiff .gainst Allen B. Clement, Sr., Pauline ement Craig, Lena Paulina Steff- f Frank G. Craig Jr., and un own heirs of A. H. Clement, de- -eased., . .................. Defendants.  The object of this suit is to have Trustee appointed for the Estate of A. H. Clement, under the terms r his Will. i nd it appearing by affidavit fil- 4 that Allen B. Clement Sr., Paul- ae Clement Craig, Lena Pauline Jeffler and Frank G. Craig Jr., are  t residents of the State of Vir- inia, and any n. k iwn heirs of H. Clemen!., Decd., they are eby required to appear within i days after, th  due publication th s order and do what is neces- y t protect their interests."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "own heirs of A. <mark>H</mark>. <mark>Clement</mark>, de- -eased., . .................. Defendants.  The"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "own heirs of A. <mark>H</mark>. <mark>Clement</mark>, de- -eased., . .................. Defendants.  The"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.3, 363.32, 1781.27, 613.35], "bbox_id": "b99beeb861", "file": "AppomattoxNewspapers_1939-1943a_0332.pdf", "page": 1, "text": "In the Clerks Office of the Cir- -..it C u of Appomattox County, n the l4 day of August, 1941. J. hi. Dinwiddie, Admr, of A. H. isment, decd., with his Will s  xed, Plaintiff gainst Allen B. Clement, Sr.,  Pauline .cment Craig, Lena Pauline Steff- -, Frank G. Craig Jr., and un- .own heirs of A. H. Clement, de based., ..................... Defendants. The object of this suit is to have Trusteeappointed for the Estate of A. H. Clement, under the terms his Will. .  And it appearing by affidavit fil- .1 that Allen B. Clement Sr., Paul- . 1  Clement Craig, Lena Pauline iteffler and Frank G. Craig Jr., are residents of the State of Vir- r.ia, and any n. k own heirs of H. Clement Decd., they are reby required to appear within .1 days after th- due publication this order and do what is neces- y t protect their interests."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "own heirs of A. <mark>H</mark>. <mark>Clement</mark>, de based., ..................... Defendants. The"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "own heirs of A. <mark>H</mark>. <mark>Clement</mark>, de based., ..................... Defendants. The"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.98, 405.48, 1875.34, 1028.96], "bbox_id": "f676fe76af", "file": "AppomattoxNewspapers_1954-1955a_0030.pdf", "page": 1, "text": "gathering of the descendants of the late William Rosser. Mr. Rosser, a native of Fincastle, who had moved to Appomattox, was engaged in mak ing firearms in Richmond for the Confederacy during the War Be tween the States. At the close of hostilities he returned to Appomat tox. During the following years he had many and varied interests, in cluding a mercantile business, oper ating several farms, and serving as United States Postmaster for Appo mattox Court House. A buffet dinner was served in the house and on the lawn. The home was decorated with varigated sum mer flowers. All members of the family and guests registered on a large scroll provided for the occa sion. They wore white caps, with red decorations, on the front of which was inscribed, Rosser Clan. The surviving daughters of Mr. Rosser, Mrs. Clement A. Hancock of Huntington, West Va., and Mrs. Bessie Ferguson, of Roanoke and Appomattox, were crowned Queens for the day. The following descendants and out-of-town guests were present Mr. and Mrs. Guy Littleton Furr, Miss Mary Catherine Furr, Guy Littleton Furr, Jr., of Roanoke Judge Catherine Clement Dellinger. William Rosser Clement, Newport News Mr. and Mrs. James Pitzer Gills, James Pitzer Jr., Mr. and Mrs. Edmond Theodore Gills, Blue- field, West Va. j Miss Mary Louise Gills, Richmond Braxton LeGrand Hancock, Huntington, West Va.  Mr. and Mrs. George Russell Gim- bert, Miss Evelyn Gimbert, London Bridge Lt. H. Clement Hancock Gimibert, of Fort Belvoir Don F. Drake, of Edmond, Oklahoma Mr. and Mrs. Cameron Winston White Clement Hancock White, St. Peters burg, Florida Mr. and Mrs. Charles Allen Carter, Charles Carter, Glad stone, Va. Mrs. Jennie Johnson Appomattox Mr. and Mrs. H. Har old Bendler, Virginia Beach Mrs., W. Daniel Browning, Richmond  Mrs. Harry P. Davis, Mrs. Mildred Alvis, Miss Patricia Alvis, Miss Kate OBrien, Mrs. Leonard McFadden. Randolph McFadden, Miss Opal Smith, Mr. and Mrs. Thelibert M. Trent, Miss Lina Trent, Mrs. William Benjamin Caldwell."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "Gimbert, London Bridge Lt. <mark>H</mark>. <mark>Clement</mark> Hancock Gimibert, of Fort"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "Gimbert, London Bridge Lt. <mark>H</mark>. <mark>Clement</mark> Hancock Gimibert, of Fort"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.45, 282.59, 897.95, 505.41], "bbox_id": "b53c33c889", "file": "AppomattoxNewspapers_1898-1902a_0307.pdf", "page": 1, "text": "District Conference. The Lynchburg District Confer ence will be held at Appomattox Memorial Church July 17-20. Rev. W. J. Young, D. D., pastor of Court- street Church, will preach the open ing sermon. The following committees have been appointed for the Conference E ntertainment E. W. Taylor, chairman  J. R. Hill, J. H. Stanley, Alien H. Clement, L. J. Seay, J. F. Furdnm. A uxiliary Mrs. Annie Irby, Mrs. S. L. Ferguson, Mrs. Finn ice Walton, Mrs. E. W. Tavlor, Mrs. J. R. Hiil , M .us Kate OConnor, AJ iss Lelia B. Inge. MusicMrs. Allen 11. Clement, Miss Sarah Taylor, Miss Lizzie Irby, Mr. J. R. Hill. P. M. B ell , P. C."}, "highlight": {"text": {"matched_tokens": ["H", "Clement"], "snippet": "J. H. Stanley, Alien <mark>H</mark>. <mark>Clement</mark>, L. J. Seay, J."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Clement"], "snippet": "J. H. Stanley, Alien <mark>H</mark>. <mark>Clement</mark>, L. J. Seay, J."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [631.52, 712.87, 793.22, 1183.77], "bbox_id": "d92b6210f9", "file": "AppomattoxNewspapers_1922-1923a_0036.pdf", "page": 1, "text": "Commissioners Sale APRO VI AT I OX FARM By virtue of a dtc ee entered in the Chance y Cause of the Monongahe- lia City Trust G, guardian, c., vs. Mrs. Maria Rasser, Rebecca and Bartley Connelly, at the April term 1922, of the Circuit Court of Ap pomattox County, I will offer for sale at piblic auction in- front of Appomattox C. H., Va., on Tburs day, June 1 st, 1922, at 12 m. the following real estate in these pro ceedings menUoned, That certain tract of land with the improvements and appurtenance thereto belonging, situated about six miles South of Appomattox C H , adjoining the lauds of C. H. Allen, C H. Godsey, R S. May- ben y and others, containing by survey of W. A. Moses 101 9 acres, which P. W. Connelly died seized and possessed. This is a very de-irable property close to school and church, well lo cated, with water, cleared land, orchard. The buildings consist of 4 room house, barn and other build ings in bad repair. The land is espici.ally adapted to the growth of bright tobacco. Terms One third cash on day of sale, residue on a credit of one aot two years time, deferred payments to bear interest from day of sale and evidenced by bonds of purahas er containing waiver of homestead exemption and title retained until purchase money is fully paid. A H CLEMENT, Gomr., The bond required of ComruiS aioner A. H Clemnc in above s yl e-j cause has been execut-d wish security approved by me. 5-3 3 c C W. SMITH, Cletk"}, "highlight": {"text": {"matched_tokens": ["H", "Allen", "H"], "snippet": "the lauds of C. <mark>H</mark>. <mark>Allen</mark>, C <mark>H</mark>. Godsey, R"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Allen", "H"], "snippet": "the lauds of C. <mark>H</mark>. <mark>Allen</mark>, C <mark>H</mark>. Godsey, R"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [610.55, 718.65, 770.66, 1189.57], "bbox_id": "4dd26c68ac", "file": "AppomattoxNewspapers_1922-1923a_0032.pdf", "page": 1, "text": "Commissioners Sale APPOMATTOX FARM By virtue of a decree entered in the Chancery Cause of the Mohongahe- lia City Trust Co , guardian, c , vs. Mrs. Maria Rasser, Rebecca and Bartley Connelly, at the April term 1922, of the Circuit Court of Ap pomattox County, I will offer for sale at public auction in front of Appomattox C. H., Va., on Tb.urs day, June 1st, 1922, at 12 m. the following real estate in these pro ceedings mentioned. That certain tract of land with the improvements and appurtenances thereto belonging, situated about six miles South of Appomattox C adjoining the lands of C. H. Allen, C. H. Godsey, R S. May beny and others, containing by survey of W. A. Moses 101 9 acres hich P. W. Connelly died seized and possessed. This is a very desirable property, close to school and church, well lo cated, with water, cleared land, orchard. The buildings consist of room house, barn and other build mgs in bad repair. The land is especially adapted to the growth of bright tobacco. Terms One third cash on day of sale, residue on a credit of one and two years time, deferred payments to bear interest from day of sale and evidenced by bonds of purahas containing waiver of homestead exemption and title retained until urcba8e money is fully paid. A. H. CLEMENT, Comr., The bond required of Commis sioner A. H Clement in above syl ed cause has been executd with security approved by me. -3 3t O. W. 8M1TH, Clerk."}, "highlight": {"text": {"matched_tokens": ["H", "Allen", "H"], "snippet": "the lands of C. <mark>H</mark>. <mark>Allen</mark>, C. <mark>H</mark>. Godsey, R"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Allen", "H"], "snippet": "the lands of C. <mark>H</mark>. <mark>Allen</mark>, C. <mark>H</mark>. Godsey, R"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1626.69, 971.37, 1787.51, 1451.83], "bbox_id": "2e4a64ce52", "file": "AppomattoxNewspapers_1922-1923a_0024.pdf", "page": 1, "text": "Commissioners Sale APPOMATlOX FARM By virtue of a decree entered in tbe Gbaocey Cause of the Monongahe- lia City Trust Co , guardian, c , va. Mrs. Maria Basser, Rebecca and Birtley Connelly, at the April term 1922, of the Circuit-. Court of Ap- poim tox County. I will offer for sale- at p oiic auction in front of Appomattox C H . Va , on Tburs day,June lit, 1922 at 12 tn. tbe following real estate in these pro ceding8 nr ntioned That certain Uacv of land with theimorovem n sand appurtenances thereto belonging, situated about . six miles South of Appooittox C. H, adjlining the lands ot C. H. Allen, C II Gidsey R S May berry and other?, containing by survey of Vi A. Wo  lq l 9 icr which P W .. ......... i fid z t and post- aed This is a very de irable property, doee to echool and chnrcb, well lo cated, with water, cleared land, orchard The buildings consist of 4 room house, barn and other build- Dga in bad repair. The land is , e8Pfcially adapted to the growth bright tobacco. Terms One third cash on day of ale, residue on a cr d t of one and two years time, deferred paymeuts I heir interest from day of sale , and evidenced by bonds of pnrahas er containing waiver of homestead tiemption and title retained until Prcha8e money is folly paid. A H. CLEMENT, Comr., The bond required of CommiS toner A. H. Clement in above s yl e Ca08e has been executed with ecurity approved by me. S-d3s 0 W. SMITH, Clerk."}, "highlight": {"text": {"matched_tokens": ["H", "Allen"], "snippet": "the lands ot C. <mark>H</mark>. <mark>Allen</mark>, C II Gidsey R"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Allen"], "snippet": "the lands ot C. <mark>H</mark>. <mark>Allen</mark>, C II Gidsey R"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [385.45, 977.82, 618.35, 1431.07], "bbox_id": "c2db15dcd0", "file": "AppomattoxNewspapers_1922-1923a_0025.pdf", "page": 1, "text": "AFPOMATIOX FARM By virtue of a decree entered in the Chance y Cause of the Monongahe- lia City Trust C o , guardian, c , va. Mrs. Maria Rasatr, Rebecca and Birtlev Gounelly, at the April term  1922 of the Circuit Court of Ap- ! poaaa tox County. 1 will offer for eal at p Dic aucnou in front of Appomattox C H . Va , on Tburs day, June 1 st, 1922 at 12 m. the following real estate in these pro ceilings m ntioned Tbit certain tiae of land with theimorovem 0 sand appurtenances ion held th is thereto belonging, 6 uatd about fix miles South of Appomattox C. H, adj lining the lands oi C. H. Allen, C II Gidaey R S May berry and other, containing bv survey of tV A . M o - l o l 9 ic r which P tv .. ......... -1 -.1  -z 1 and po s- sed This is a very dearable property, claee to school and chnrcb, well lo cated, with water, cleared land, orchard The buildings consist of 4 room house, barn and other build ings in bad repair. The land is especially adapted to the growth of bright tobacco. Terms One third cash on day of sale, residue on a credit of one and two years time, deferred payments to ber interest from day of sale and evidenced by bonds of pnrahas er containing waiver of homestead  exemption and title retained until  purchase money is fullv paid. A H CLEMENT, Comr., bond required of CommiS Bioner A. H Clement in above s yl ed cause has been executed with security approved by me. U a C W. SMITH, Clerk."}, "highlight": {"text": {"matched_tokens": ["H", "Allen"], "snippet": "the lands oi C. <mark>H</mark>. <mark>Allen</mark>, C II Gidaey R"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Allen"], "snippet": "the lands oi C. <mark>H</mark>. <mark>Allen</mark>, C II Gidaey R"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [810.72, 241.45, 972.47, 1526.97], "bbox_id": "1cd9ba65e5", "file": "AppomattoxNewspapers_1898-1902a_0223.pdf", "page": 1, "text": "Appomattox Democrats. The largest political meeting held in Appomattox couuty iu some years was that at this place on Tnursday, when toe Democratic voters of he county to the number of more than 300 met for the purpose of electiiiR delegates to the Eighteenth Distrust Senatorial Convention, and to no.in nate a  floater candidate for the House from Appomattox and Camp- hell. The senatorial convention lie- legation was instructed tor Hon. 11. 1. Flood, and Mr. J . R. Horsley re ceived the floater nomination. Both were inst ructed for Senator Atari in. The meeting was called to order by the county chairman, Mr, S. L. Ferguson, and Dr. J . B. Abbitt was made permanent chairman. Dr. D. Molt Robertson offered the follow - ing resoluliou, which was ui ani- mously adopted  In consideration of the eminent service the Hon. M. D. Flood has rendered this couuty, senatorial dis trict, and State as the representative of the Eigh eeur.h Senatorial District on the floor of the Senate, the abili ty he has displayed wherever ability lias been required, and the face that four years ago, against his own in clinations, he accepiled the almost unanimous call of his party lo i e its nominee for the Senate, we deem it but a simple act of justice, as it is to ns a great pleasure, to endorse his course and reconttnend him as his own successor. Mr. Flood nominated Mr. J . R. Horsley aud Dr. T. B. Rucker nom inated Allen il. Clement for floater delegate to the Houser Hr. Robertson moved that a viva- voce xote be taken, which was unex pected by the Clement people, who hud expected that a dividing line would be ilravui when the vote was taken. Still, not a disuniting voice was heard, aud Air. Horsley was de clared tne nominee. Quite a num ber of the auditors held themselves aloot, and would not participate in the meeting. Although there were many known Tyler men in the audience, none of them had a word to say. Like the Clement followers, ihey appeared, to be merely spectators. Mr. S. P. Coleman offered the fol lowing, which was adopted witnout a dissenting voice  Whereas, the Hon. Thomas S. Martin is the choice of the Demo crats of Appomattox county as his own successor as United States Sen atorfirst, because, owing to his high character, great intellect, and executive ability, he is a worthy col league of Virginias senior Senator, Hon. John W. Daniel second, be cause by his votes, influence, and voice he has aided the great cause of the free and unlimited coinage of silver the struggle which is ev erywhere being made against trusts aud combines, having voted to tax their products has fought the un limited issue of bonds has advocat ed the principles of the income-tax, aud by every act and vote has shown himself to be in perfect accord with the principles of the Virginia De mocracy  third, because of his loyal aud effective services iu his fight against the increase of the tuternal- revenue tax on tobacco fourth, be cause during his entire life he has given much of his time aud means to nnautaiu the supremacy of the Democratic party in Virginia aud in the nation, and has in all of our struggles been particularly helpful to the Democrats of the Black Belt therefore, be it  Resolved, That the delegates to bp appointed to the senatorial and legislative conventions be, and they are hereby, instructed to vote to in struct the nominees of their respect ive con veil  iu 8 to vote for the re- election of the Hon. Thos. S. Mar tin to the United States Senate. The Democratic Executive Com mittee was reorganized as follows Saml L. Ferguson, chairman J . C. Jones, A. H. Howerton, S. J . Lee, J . W. Clark, W. J . Trent, W. H. Ligon, A. B. Thornhill, W. C. Abbitt, S. C. Stratton. R. H. OBrien aud M. F. Kyle were succeeded on the committee by Wm. J . Trent and A. B. Thornhill. There was no opposition to any of the members. After the meeting adjourned, Capt. W. D. Johns spoke for some time iu favor of Governor Tyler for I United States Senator. Supervisor Ligon called for the vote on the fence question and the crowd was asked to separate. The i result was the  no fencers carried the day and the boundary line of  each farm or tract of laud shall hereafter be held to be a lawful fence."}, "highlight": {"text": {"matched_tokens": ["Allen", "Clement"], "snippet": "B. Rucker nom inated <mark>Allen</mark> il. <mark>Clement</mark> for floater delegate to"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "Clement"], "snippet": "B. Rucker nom inated <mark>Allen</mark> il. <mark>Clement</mark> for floater delegate to"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [234.7, 456.0, 664.93, 1022.85], "bbox_id": "282ca09e53", "file": "AppomattoxNewspapers_1908-1909a_0507.pdf", "page": 1, "text": "mæm more were the week-eiid guests of Mr. and Mrs. H. B. Marsh- all. Among those eatilng dinner with E. T. Mitchell on his birth- jnjTr m ________ __ _ ___ day were Col. Joel W. Flood visiting her sister, Mrs. Lovel- j and Messrs. George and Watt la Morris. iAbbitt, of Vera. James Morris, who is now Mr. and Mrs. A. R. Harwood, stationed at Roanoke, spent and daughter, Bessie, plan to Sunday at home. plan this week-end with Mr. W.8. Coming and family re- Ernest Abbitt, of Roanoke and turned to Chicago on Thurs- A. R. Harwood, Jr., of Blacks- day. burg. Miss Ida Tolbert, of Buck-l Misses Mary Taylor, Corn- ingham, is visiting her uncle, elia and Catherine Gills, Miss L. W. Bryant, here. Kathleen Wood and W. T. Miss Isabell OBrien will Smith drove to Charleston, W. spend this week-end in Rich-1 Va., oyer the week-end to meet mon Allen Gills as he returned Master Billy ! Clement, of from Cleveland, Ohio. Newport News,, visited Scott Mr. and Mrs. C. O. McCray Sears last week-end land son Robert Edwin, W. Mm Simpkins, of Mount! H. Furbush and Gerald Mc- Hope, W. Va., is visiting mem- Cray, Mr. and Mrs. Eddie bers of her family here. Schaubach and son, Eddie, Jr, M ihs Florence Gregory spent were the week-end. guests of Saturday with her mother, Mr. and Mm R. E. Caldwell, Mrs A H. Gregory. I Sr. W. W. Burke, of Charlottes- Misses Pearl and Nellie Me ville, spent Saturday and Sun- Fadden and Miss Gladys Bry- day here I ant are visiting their grand- Adfield McCain, of Lynch- mother, Mm Nellie McFadden, burg, spent the week-end with I of Spout Spring, his sister, Mm C. F. James. Miss Gladys Bryant is able Allen Gills, of Cleveland, 0,1 to he out again after a spell of compam is spending some time at his flu home here I Guests in the home om Mm Miss Anna Mann, of Crewe, Wade Ferguson Sunday were spent the weekend with Mr. Misses Nellie and Ruth McFad- and Mm E. T. Mitchell. den, Gladys Bryant, Hop Fer- Senator and Mm. S. L . Fer-lkuson, Jessie Almond, Wesley guson were supper guests in Martin, and Jack McFadden. the home of Mr. and Mm E. T. , Willie Bryant and father and Mitchell Wednesday evening. Warner Carter spent Sunday Mr. and Mm .E. jT. Mitchell with Mr. and Mrs. Moby- Car- and chiidren visited Mr. and I ter, of Buckingham., Mm J. R. Lewis at Hixburgl  ------ ----- 0 ----- Monday. ,, I Home Economics News Dr. H. E. Jones and Mm FVank Coffman, of Roanoke, i  advisory council of thd visited Miss Nina Jones stl Home Economics Club sponsors week. ia pool shower and tea at the"}, "highlight": {"text": {"matched_tokens": ["Allen", "Clement"], "snippet": "week-end to meet mon <mark>Allen</mark> Gills as he returned Master Billy ! <mark>Clement</mark>, of from Cleveland, Ohio."}}, "highlights": [{"field": "text", "matched_tokens": ["Allen", "Clement"], "snippet": "week-end to meet mon <mark>Allen</mark> Gills as he returned Master Billy ! <mark>Clement</mark>, of from Cleveland, Ohio."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [708.0, 321.21, 1028.37, 606.69], "bbox_id": "62efc178c4", "file": "AppomattoxNewspapers_1915-1918a_0173.pdf", "page": 1, "text": "S u b - J u n i o r P l a y Repeated by Request, T h e  W a y f a r e r  SUNDAY, JUNE 4, 8 P. M .f 1916 Song..................................................... . . .. ......... .. .....................Ortomville Prayer.............................................. . , ..................... Rev. R. L. Wingfield Hymn................................................................ .How Firm a Foundation Sermon ............................. by Rev. T. A. Smoot, D. D., Richmond, Va. Hymn...........................................................Softly Now the Light of Day Benediction ............................................................... Rev. C. W. McElroy MONDAY NIGHT. JUNE 5, 8 OCLOCK Admission 10c Contest Between the Washington Society and Lee Society for Banner Given by Mrs. L. H. Crawley Soldiers Chorus.................................... .. ...........................................by all Prayer ............................................... ..................... .. . .by Rev. J. Ci Leps Welcome by the President............................... .. . .......................Guy Rice DebateResolved, That Immigration is Detrimental to the United States. Affirmative Lee Society John Rector, Lila Robert son. Negative Washington Society Francis McDearmon, Adam Clement. Onftion by Wayland Charlton Lee............................Woodrow Wilson Oration by Edward Roach Wash. ..................................... Immigration Reading ......................................................... by Bessie Thornton Wash. Reading..........................  ......................................hy Ruth Allen Lee Musical Recitation ............................................. . .Emmie Walton Lee Musical Recitation............................................Virginia Hancock Wash. Report of Judges. Awarding of Banner. Closing ChorusGoing Home Song .......... . ........... ..................by all"}, "highlight": {"text": {"matched_tokens": ["h"], "snippet": "Repeated by Request, T <mark>h</mark> e  W a y"}}, "highlights": [{"field": "text", "matched_tokens": ["h"], "snippet": "Repeated by Request, T <mark>h</mark> e  W a y"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.44, 1079.55, 821.18, 1673.27], "bbox_id": "f1bd1656d8", "file": "AppomattoxNewspapers_1926-1933a_0540.pdf", "page": 1, "text": "IN THE APPOMATTOX  BUCKINGHAM TIMES August 1, 1906 Parker, Horsley of Bent Creek, died July 21. Buria services were conducted by V S. Reed of the Y. M. C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves His son, Rev. William Abbitt of Kentucky, is visiting him. Master Braxton Hancock en tertained a number of his lit friends in the celebration of his birthday last Tuesday. Mrs. Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon The deceased was formerly Miss Godsey, of Appomattox County. Sam Thornton of Graham was the guest of his sister, Mrs B- T. Gunter, of Evergreen, last week. Miss Bessie Thornhill of Lynchburg is a guest of Miss Fannie Clement. Lightning struck an old oak tree about forty years old in the yard of Mrs. Hubbard Mar tin and tore it to pieces last Friday evening.  Bob Davis, Squire Womack, and Wells Chittenden of Pamp- lin were in the village Monday on business. I Robert Oder has been visit ing in the county for several days. He haspurchased a nice farm here and will, we hope, again make his home among us. A concert will be given in Smiths Hall next Friday night for the benefit of the Metho dist sidwalk fund. Misses Ethel Calhoun a n d Lucy Gills are visiting in Lynch burg. mss Brown, of Crewe is a guest ot Miss Rosa Paris. --------------- 0 ---------------"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- Abbitt improves His son,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- Abbitt improves His son,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1973.05, 1321.48, 2341.99, 1721.03], "bbox_id": "0428045354", "file": "AppomattoxNewspapers_1933-1936a_0196.pdf", "page": 1, "text": "Funeral services were held in the Olive Branch church Sunday morn- ing, April 14, for Mrs. Eugene Gil- iiam and burial was in the church .emetery. Mrs. GilliMii bufiw Y marriage was Miss Eliza Guy Muore ind was the daughter of the late Samuel Moore, of Prospect w d w ti ,5 years old. Beside lier Husband, ibe is survived by four sons Ken- . neth, of Washington Bernard, of Detroit Allen of Portsmouth and Wilson of Prospect three daugh ters Mrs. William Faust, of BeltL more Mrs. L. L. Worrell, of De-. troit and Miss Mabell, of Lynchburg. and three brothers and one sist er J. Stanley, Jeff and Cabell Moore and Mrs. Herman Phillips, of Pros pect. Active pallbearers were Henry Moore, Edward Harvey, and Claud Moorefield, Stewart Coleman, Donald Phillips and Morris Hubbard. Flower bearer were Misses Flossie Rey nolds, Louise Torrence, Edith Vau ghn, Virginia Parks, Gladys _ Swan, Lou Covington, Louise Covington, Allie Showalter and Kva IShowal- ter. Honorary pallbearers were G. C. Clement, W. C Chick, W. A Swan Willie Jack Swan, J. H Wilkerson, W. A. Wilkerson, Claude Chick, Ed gar Coyington, Edwin Fore, Bas- comb Price, David Shreve, J. H. McCue, W. S. Torrence, Garland Tor rence, JSdward Moorefield, W. W. Vaughn, J. A. Covington, J F Cole man, John Covington, B. E. Taylor. Mrs. Gilliam had been a member of the Olive Branch church all of her married life and was an active church worker. Service ______________ ___________ .. ........... were  eon- Kingfish calls another special sea- ducted by her pasteor, Rev. 6 . P. 5 112p sion Louianna legislature. Coffey.  ."}, "highlight": {"text": {"matched_tokens": ["Allen"], "snippet": "Washington Bernard, of Detroit <mark>Allen</mark> of Portsmouth and Wilson"}}, "highlights": [{"field": "text", "matched_tokens": ["Allen"], "snippet": "Washington Bernard, of Detroit <mark>Allen</mark> of Portsmouth and Wilson"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [238.31, 623.25, 506.05, 957.34], "bbox_id": "5451282fad", "file": "AppomattoxNewspapers_1926-1933a_0507.pdf", "page": 1, "text": "day.Miss Ida Tolbert, of Buck ingham, is visiting her uncle, L. W. Bryant, here. Miss Isabell OBrien will spend this week-end in Rich mond. Master Billy ! Clement, of Newport News, visited Scott Sears last week-end. Mrs. Simpkins, of Mount Hope, W. Va., is visiting mem bers of her family here. Mites Florence Gregory spent were the week-end Saturday with her mother, I Mr. and Mrs. R. E Mrs. A. H. Gregory. W. W. Burke, of Charlottes ville, spent Saturday and Sun- day here. Adfield McCain, of Lynch burg, spent the week-end with his sister, Mrs. ,C. F. James. Allen Gills, of Cleveland, O, is spending some time at home here. Miss Anna Mann, of Crewe, spent the week-end with Mr. and Mrs. E. T. Mitchell. Senator and Mrs. S. L. Fer guson were supper guests in the home of Mr. and Mrs. E. T. Mitchell Wednesday evening"}, "highlight": {"text": {"matched_tokens": ["Clement"], "snippet": "Rich mond. Master Billy ! <mark>Clement</mark>, of Newport News, visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Clement"], "snippet": "Rich mond. Master Billy ! <mark>Clement</mark>, of Newport News, visited"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1863.58, 213.25, 2019.7, 1215.23], "bbox_id": "1205441563", "file": "AppomattoxNewspapers_1915-1918a_0310.pdf", "page": 1, "text": "Appomattox Agr. H. S. Honor B oll for December Grade 1Hester Guill, Cor- rinne Hancock, Kate Morris, Frankie McKinney, Richard McDearmon. Grade 2 Al i c e Harwood, Ouida OBrien, Allen Gills, Florence Gregory, Lillian Cald well, Elite Puckett, Elizabeth Smith, Ruby Caldwell, Mary  oss, Eddie Babcock, Elton Callaham, Baker Farrar, Ken- nard Gills, Lawson Fore. Grade 8 Margaret Furbush, Estelle Dickerson, Thelma Fer guson, Rebecca Martin, Lea  Martin, Vara Morris, Pauline lucker, Graoie Morris, Vara Smith, Francis Upton, Edith Thomas, Eunice Gahliar, Joe ferguson, Ivein Farrar, Will- iam Fergus on, Berkeley Gil bert, Teddie Gills, Russell Jam- erson, Hugh Martin, Riohard ! Plunkett, Obie Ferguson. Grade 4Willie Booth, Hes ter Davidson, Hallie Mitchell, Rachel Perdue, Helen Dicker- son, Nellie Callaham, Sears Booth, Randolph OBrien,Dave Cutlip, Howard Inge, Arthur i lobinsón, Billy Trent, Jimmie Wooldridge. Grade 5George Inge, Lyle McDearmon,Eleanor Ferguson, 3essie Harwood, Mary Ruoker, Esther Scheffler, Myrtle Smith, Vivian Wooldridge. Grade 6 B e s s i e Mitchell, E a r l e Patterson, Elizabeth Trent, Burke Steele, Ned Han cock, Lucy Fore, Mabelle Con ner, Ruth Clement, William ! Burke, Ryland Mann. Grade 7C a 11 i e Baocock, Stella Payne, Ressa Evans, Lee Giles, Mattie Gunter, Edgar Howl, Nola Burkey, Reggie Stanley. I High SchoolHettie Wood son, John Perdue, Roselle Han dley, Margaret Gibson, John . fere, Minnie Robertson, Adam Parks, Kathleen Morgan, El aine McDearmon, Mary Ban- ton, Rheda Drinkard, James fersythe, Cornelia Gills, Mary Gills. II H i g h SchoolJessalyn H a n c o c k , Braxton Gordon, Lewis Doss, Clark Caldwell, Georgia W a l t o n , Elizabeth Wagner, Anna Vries, Mildred Trent, Riohard Smith, William Shelton, Bednego Morris, Geo Hubbard, Agsteavidson, El sie Carson, Harry Plunkett, Lougenia Patteson, Gladys ! Patteson, Mortie Morgan, Mil dred McDearmon, Virgie Inge, Virginia Hancock, Nellie Rob ertson, Astatyy Rucker. III High SchoolKathleen Ruoker,Joe Inge, Elliott Cheat ham, Ruth Foster, Edwin May hew, Elsie Payne, Russell Pril- laman, Lilian Evans, Aubrey Webb. IV High SchoolAnnie Han cock, Lila Robertson, Archer Crute, Annie Carson, Merle Da vis, Francis McDearmon, Em ma Hancock, Guy Rice, John Robertson, Ernest Shot well, Harry Shot well, Eiva Stratton, Kathleen Rosser, Annie Alvis"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Appomattox Agr. <mark>H</mark>. S. Honor B oll"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Appomattox Agr. <mark>H</mark>. S. Honor B oll"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
