{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Andrew", "B", "Baker"], "snippet": "W. Johns, Isaac Adams, <mark>Andrew</mark> <mark>B</mark>. <mark>Baker</mark>, John W. Gilliam, Geo."}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "B", "Baker"], "snippet": "W. Johns, Isaac Adams, <mark>Andrew</mark> <mark>B</mark>. <mark>Baker</mark>, John W. Gilliam, Geo."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Andrew", "B", "Baker"], "snippet": "commissioner of reve nue <mark>Andrew</mark> <mark>B</mark>. <mark>Baker</mark>, corroner Before the next"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "B", "Baker"], "snippet": "commissioner of reve nue <mark>Andrew</mark> <mark>B</mark>. <mark>Baker</mark>, corroner Before the next"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["Andrew", "B", "Baker"], "snippet": "commissioner of reve nue <mark>Andrew</mark> <mark>B</mark>, <mark>Baker</mark>, corroner Before the next"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "B", "Baker"], "snippet": "commissioner of reve nue <mark>Andrew</mark> <mark>B</mark>, <mark>Baker</mark>, corroner Before the next"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1784.61, 286.79, 1952.47, 725.24], "bbox_id": "b70d9c9f4a", "file": "AppomattoxNewspapers_1926-1933a_0123.pdf", "page": 1, "text": "While here they attended the wedding of Mr. J. Watson El- liotte and Miss Marretta Allen. Also Mr. Elder took a part in the installation of Rev. W. T. Devane, as pastor of Bethlehem and Douglas churches. Mr. Eld er was a former pastor of these churches and he and his good wife are still much loved by the people here. Mrs. Sam Anderson who has  been so ill at S t Lukes Hospital, Richmond, is said to be muchj better. Mr. and Mrs. Marshall Thack-I ston and wife, of Roanoke, spent the Fourth with relatives here and Drakes Branch. Mr. and Mrs, W. B. Thomas of Evergreen, and Misses Lucille Baker, and Terrell Harvey were recent visitors of Mrs. Thomas sister, Mrs. Sam Thackston. I Mrs.Thomas Garrett is at home after spending the past month  with relatives of N. C. Miss Margaret Garrett left the E past week for Berlin, Germany. She spent the past two years in Cuba. Mrs. Josephine Baker, of Phil, will spend her vacation the latter part of August with her parents, Mr. and Mrs. Andrew  Baker."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "parents, Mr. and Mrs. <mark>Andrew</mark>  <mark>Baker</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "parents, Mr. and Mrs. <mark>Andrew</mark>  <mark>Baker</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [258.51, 280.87, 416.31, 834.65], "bbox_id": "a42c5b6a59", "file": "AppomattoxNewspapers_1902-1905a_0191.pdf", "page": 1, "text": "Venner. The farmers are through curing tobacco and are now planning to strip and try the market The wheat crop has been seeded, and while not as much as iu years past, a good acreage has been seeded some contending, however, that oats are more profitable. Mrs. Pinkney Glenn and her two little nieces, Jessie and Josie Glenn of Prospect, were the guests at the hospitable home of Mr. James Glenn last Saturday and Sunday. Mrs. W. Andrew Baker, of Hamp deu-Sidney, is spending this week with her sister, Mrs. Emma Baker, near Madison ville. Miss Lizzie Reynolds, of Veuner, visited her home people near Pros pect, last Saturday and Sunday. Rev. P. M. Bell conducted a senes of meetings at Fire Forks last week. Weihope that much good was done. Mrs. Wm. Ernest Kosser returned to her home here last Saturday, after a very pleasant visit with relatives in Lynchburg. We are glad to report that Mrs. James Foster, who has been so ill, is improving very fast. Mr. John Baker, of Lynchburg, visited his cousins, Misses Mary and Hattie Baker last Saturday and Sun day. Mr- B. T. Rosser made a flying trip to the Hill City last Thursday Cards are out announcing the marriage of Mr. James D. Carter and Miss Lois Binford, which will take place at Olive Branch, Nov ember 10. A few of the people around here went on a big  Hay Ride last Thursday night. Among those who went from here were, Mr. and Mrs. James Glenn, MissesMary and Hat tie Baker, Lizzie Reynolds, and Messrs. Charlie and Walter Rosser. They report a good time. Mr. Williams, of Brookneal, and Mr. Tompson, of Farmville, are holding a meeting at Spring Creek this week. Much success to A. and B. T imes , Ootober 26, 1903."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "and Sunday. Mrs. W. <mark>Andrew</mark> <mark>Baker</mark>, of Hamp deu-Sidney, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "and Sunday. Mrs. W. <mark>Andrew</mark> <mark>Baker</mark>, of Hamp deu-Sidney, is"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [200.4, 258.46, 366.75, 983.35], "bbox_id": "8be0449bc9", "file": "AppomattoxNewspapers_1902-1905a_0271.pdf", "page": 1, "text": "V m icr. Y  liavr hfn rejoicing in the last few days of pncg-Iiko weahsr. We are sorry to say Mr. William CarwilD, of Gharlote, i quite ill. We hope God will bless ibis nice old lady with a speedy recovery. Mi Mattie Baker, of Madison- viiit, w la-.r week the charming guest of her cousins, Misses Mary L. and Beulah Baker, of this place. Messrs. W. L. Turnes and W. H. Rosser spent several days last week in Appomattox, visiting relatives. Rev. 0. H. Gregory, of Patnplin City, was a visitor at the home of Mr. Robert Baker not long since. Dr. E. E. Walker has left Pamp lin for Snow Hill, N. C., where be will reside iu the near future. He has a wid circle of friends who re gret so much to give him up H will b  missed by he entire commu n ity U p was respected and loved I both as a physician aud as a man. We will gladly welcome him into our homes  any time. ! Mr. and Mrs. James Glenn and I heir two little gn is, Lyudelle and Andrey, and Miss Mary Lizzie 11 Bak r spent Balm day aud Sunday II at the pleasant home of Mr. and I! Mrs. Pinkney Glenn, near Prospect.I Mr. aud Mrs. Samuel Thackston,I of Rough Creek,spent Monday with their sister, Mrs. H. 8. Baker, ofl Madisonville, Miss Lizzie Reynolds spent Sstur- I day and Sunday with her aunt, Mrs. I Ben Abbitt, near Washington I Heights. Mrs. James Cawthorn, of Cub I Creek, is spending this week with I Mrs. Dr. E. E. Walker, of Pamplin. I Mrs. Edward Carwile spent sev-1 eral days 1 tst week with relatives in I Farmville. Rev..P. M. Bell preached a fin sermon at Pamplin Sunday morning. I Miss Bessie Bell, of Prospect, I spent Saturday aud Sunday with I little Mi-scs Jessie May and Lucilel Walker, of Pamplin. Mrs. B. T. Rosser spent several! days with her mother, Mrs. William I Carwile, lnt week. Rev. Mr. Paisley filled his appoint- j mem at Beulah school room Sunday I evening. Walker. Mr. Andrew Baker, of Throck, was a guest her on Saturday last."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "I evening. Walker. Mr. <mark>Andrew</mark> <mark>Baker</mark>, of Throck, was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "I evening. Walker. Mr. <mark>Andrew</mark> <mark>Baker</mark>, of Throck, was a"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [149.05, 321.91, 315.0, 932.63], "bbox_id": "980d04741c", "file": "AppomattoxNewspapers_1902-1905a_0307.pdf", "page": 1, "text": "V e r n ie r . Farm yoik lias been going on l pretty rapidly and there will be gome obacco planted, notwith- standing rumors to the contrary. A few people from this neighbor- hood attended services at centenary Sunday evening. Rev.O. H. Gregory preached a very instructive sermon to a large congregation. Mr. W. E. Rosser, of Newport News spent several days last week with his mother and father, Mr. and  Mrs. B. T. Rosser. Miss Addie Baker returned to her  home yesterday, after a very pleas-  ant visit at the home of Mr. C. 1.  Harris, of Mizdon. Rev. Mr. Williams spent Sunday night at the home of Mr. B. T.  Rosser. Miss Venona Turnes, of Appom attox is the pleasant guest of her  brother, Mr. W. L. Turnes at this place Mr. Jas. Baker of Reardon is  spending this week with relatives in the neighborhood. Mr. Lennie Womack of Lynchburg  is down on a visit to his father, Mr. D. G. Womack. Mr. C. I. Harris, of Mizdon, was  a visitor here Sunday. Mrs. H. I. Baker has been in disposed for several days ,but we are glad to say she is some whr.t better. We are sorry to say that Mrs. W. E. Rosser, of Newport News is quits sick. We hope she may be well  soon. Messrs. Walter Rosser and Billy Carwyle spent Friday in Farmville. Mr. and Mrs. Andrew Baker were I the guests of their sister Saturday and Sunday. Mr. and Mrs. William C.Twyleof I Charlotte, were the guests of their danghter at this place last week. Much success to the Times and  its readers. ____ Statistical comparisons are odious  to the Roosevelt administration."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "Farmville. Mr. and Mrs. <mark>Andrew</mark> <mark>Baker</mark> were I the guests"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "Farmville. Mr. and Mrs. <mark>Andrew</mark> <mark>Baker</mark> were I the guests"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [265.44, 312.81, 421.89, 989.96], "bbox_id": "096e89949e", "file": "AppomattoxNewspapers_1902-1905a_0175.pdf", "page": 1, "text": "V e n n e r . The prolonged cool pell has mau farmers rush ahead cutting tobaco- a little green we expect. But it lm turned much warmer and fion present prospects King Frost ha- postponed his visit for a while. Miss Sallie Hunter and Mr. Jas per Harvey, of lied House, were th charming guests of their cousins. Misses Marie and Hattie Baker Saturday and Sunday last. Lyudelle, the pretty little daugh ter of Mr. James Glenn, returned i her home here last week. She had been visiting her grandparents, near Prospect. Mrs. H. S. Baker, of Madison ville, is spending this week with hr sister, Mrs. W. T, Robertson, o! Lynchburg. Mr. A. N. Harvey, of Evergreen, was the guest of his uncle, Mr. K Baker, last Snnday. Mr. aud Mrs. James Glenn an Miss Hattie Baker and Messrs. Charley aud Walter liosser visitc in the hospitable home of Mr. R. 1 Gleun on Sunday the 20th, which was Mr. Bells day at Olive Brauch and his sertnou was exceptionally good. They were so full of the gospel of our Lord Jesus Christ. It is not always that we hear such good sermons, for some ministers are very apt to feed their people on something else than the bread ol life. We breathe a prayer that thii good man may be sent back aguii next year. Mr. Andrew Baker and wife, oi Hampden-Sidney, visited their sis ter, Mrs. 1L 8. Baker, Jast Sunday The Beulah School will begin to day. Miss Lizzie lienalds will teach. We wish this young lady much suc cess in her work. Mr. Jeff Pauletto visited his aunt, Mrs. Emma Baker, of Madi- son ville, last Sunday. Among those who attended the show at Farmville last Saturday from this place were Messrs. James Glenn, Charlie Rosser, Henry and Leunie Womack. They said that the show was line. Mrs. Wm. Carwile, of Charlotte, spent several days with her daugh ter, Mrs. B. T. Rosser. Mrs Rossei and her little girl, Cassie, accom panied this it ice old lady home. Mrs. Bettie Motley spent last week with her brother, Mr. Theo. Carter. She expects to leave in a few days for Lynchburg, Roanoke, Richmond and other points. With much success to the A. and B. T im e s and it readers 1 close. September 28, 1903."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "aguii next year. Mr. <mark>Andrew</mark> <mark>Baker</mark> and wife, oi Hampden-Sidney,"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "aguii next year. Mr. <mark>Andrew</mark> <mark>Baker</mark> and wife, oi Hampden-Sidney,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.19, 744.19, 1795.17, 1164.08], "bbox_id": "64f39be32e", "file": "AppomattoxNewspapers_1898-1902a_0120.pdf", "page": 1, "text": "tox.  Slight changes occur in theN .  W. schedule. Trains leaving Appo- f tnattox for the west at 245 a. m. and 433 p. m. Mr. aud Mrs. E. W. Taylor, Mrs. ICurtis Taylor and Miss Sarah Tay lor spent a few days in Lynchburg  visiting this week. Dr. Tayloi preached an excellent sermon Sunday and baptized Miss E. V. Hardy, Mrs. Richard Smith and Mr. John Cumby. Dr. Abbitt Sunday School near . Bush Forrest will have a Christmas tree for the childreu on Tuesday after Christmas. Public invited. if Drs. W. H. and J. B. Abbitt have returned from a deer huut in Buck ingham. Jim brought back a fine turkey. The party killed ouly one deer. That clever commercial gentle man. H. G. Smith is spending the holidays with his homefolks here. Hunter is also here toattend the mar riage of Miss Caldwell. Mr. Andrew Baker, of Priuce Ed- waid, was in the yillage Monday on a shopping tour. He said he was to go to Farmville, but was attracted btfre by the tempting offers of our live merchants through the T imes ."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "of Miss Caldwell. Mr. <mark>Andrew</mark> <mark>Baker</mark>, of Priuce Ed- waid,"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "of Miss Caldwell. Mr. <mark>Andrew</mark> <mark>Baker</mark>, of Priuce Ed- waid,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [895.69, 277.09, 1233.26, 376.39], "bbox_id": "bc12c57bf9", "file": "AppomattoxNewspapers_1939-1943a_0249.pdf", "page": 1, "text": "snow, rain bwd Friday sleet. Mr. and Mrs. H. D. Baker and daughter, Nedra, Mrs. -W B Thom as, of Evergreen and Miss Emieue Harvey were visitors of Mrs. Sam m e Appomzragx w n w  Harvey were fisnors oi  will meet Friday, March 14, n trie Anderson on Monday. Also, Mis, home of Mis. Lottie Bledsoe. Mis3 Andrew Baker. Violet Ramsey ill give a book re view."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "Mis. Lottie Bledsoe. Mis3 <mark>Andrew</mark> <mark>Baker</mark>. Violet Ramsey ill give"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "Mis. Lottie Bledsoe. Mis3 <mark>Andrew</mark> <mark>Baker</mark>. Violet Ramsey ill give"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1983.08, 389.2, 2148.51, 1194.64], "bbox_id": "ef20d681c8", "file": "AppomattoxNewspapers_1918-1922a_0070.pdf", "page": 1, "text": "Mr. John Dupey and dangh tors. Misses Annie and Louise, of Norfolk, were week-end guests at the home of Mr. E. B. Towler. Mr. Dupey was raised at this place, and spnt his boyhood days here- He said he had traveled and seen a great deal of thin world, but no place was as dear to him as the hiils of Old Virginia. Mr.Jack Baker has just purchased a nice new Overland car. Mr. John Bagbys stable was struck by lightning and burned dving the storm Monday a. m. lie saved bis team though one mule was badly shocked the loss was right much, as he had a shed adjoining the stable with many things in it. Mrs. Evie Thackston and little son, CurtiB, spant Thurs day afternoon with Miss Sallie Thackston. Masters Purcell hnd Frank lin Carwile, of Petersburg, have been visiting their aunt, Mrs. Willie Thackston. Mrs. Chas Rice is visiting her daughter, Lottie, of Cleve land, Ohio. Those. who went to Norfolk on the excursion last Friday were Mr. and Mrs.. Archer Priddy and sister, Isabel, and Mrs. Andrew Baker Miss Annie Canada, of Hali fax, is the expected guest of her sister, Mrs. O. H. Towler,, Private Hermon Thackston reached home July 2 , from France. . Hermon is looking weR and pan tell many inter- eting things of the beautiful scenery of England and France, be eays-the roads are just fine, with shade trees planted the same distance on both sides. The Pinqipal crops are turnips alid jrye, the stock is fed on tuxnipe .aad--the bread is-made of rye in France. He was stationed near the city of Paris and visited it many times. Misses Katie, Bess and Mary Andeyson, daughters of Rev. C. C. Anderson, of North Caro lina, are visiting friends and relatives in and around here. Mr. Anderson was former pas tor of the Presbyterian church at this place. News reached here last Fri day that another one of our soldier boys had safely arrived"}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "sister, Isabel, and Mrs. <mark>Andrew</mark> <mark>Baker</mark> Miss Annie Canada, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "sister, Isabel, and Mrs. <mark>Andrew</mark> <mark>Baker</mark> Miss Annie Canada, of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [641.77, 1205.33, 801.0, 1613.02], "bbox_id": "bf9b51a141", "file": "AppomattoxNewspapers_1898-1902a_0064.pdf", "page": 1, "text": "Evergreen. A large crowd of onr neighbor- lood people attended the show in the Hill City last Wednesday and reported a splendid time generally. Some of the boys failed to wake up at the different stations on their re turn. Sncb things will occur som t times. We all felt bad yesterday to sec the doors bf our chuich closed at service honrs, the first time for so ong. Miss AUie B. Ingh has again gone on a visit to her sister, Mrs. Hamil ton, of Rice Depot Miss Evie M. Baker, of Prince Edward, was in the village last week visiting her friends. Miss Lillie Martin, ot Richmond, is up on a visit to her parents near here. Mrs. Sne. Harvey continues quite ill, much to the regret of her many friends. Miss Fanny Harveys foot which was scalded about a month ago is improving someshe can walk some now. Mrs. B. S. Thorntons little baby that was quite ill last week, is some thing better, Mr. Andrew Baker was in onr village Sunday on his wheel. M."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "some thing better, Mr. <mark>Andrew</mark> <mark>Baker</mark> was in onr village"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "some thing better, Mr. <mark>Andrew</mark> <mark>Baker</mark> was in onr village"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [835.7, 215.61, 968.82, 373.11], "bbox_id": "e5c75de081", "file": "TimesVirginian_1980a_0112.pdf", "page": 1, "text": "B HONOR ROLL - Beys  Her bert Allen, Joe Brooks, John Caldwell, Bruce Drinkard, Andrew Fratrick. John Jimiaon. Carroll Kanipe, Ken Mason Girls - Barbara Baker, Nancy Beane, Kim Coggins, Karen Covington, Jayne Doss, Dana Ford, Boggy Gobi, Susan Handy, Debbie Lawson, Kathy Lewis, Sabrina Richardson. Susan Shorter, Cindy Sbnpson, Kim Wade. HONORABLE MENTION - Boys  Shane Abernathy, Louis Foster, Ricky Harris, Ned Jennings, Richard Jones, Jonathan Pickett, Roger Walton  Girls  Jane Almond, Kari Anderson, Kim Crabtree, Lorn Coin, Norma Han cock, Debbie Harris, Judy Janierson, Tammy Jamerson, Michelle Martin, Bobbie McFadden, Jackie Pankey, Dana White, Joan Williams."}, "highlight": {"text": {"matched_tokens": ["Andrew", "Baker"], "snippet": "John Caldwell, Bruce Drinkard, <mark>Andrew</mark> Fratrick. John Jimiaon. Carroll Kanipe, Ken Mason Girls - Barbara <mark>Baker</mark>, Nancy Beane, Kim Coggins,"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew", "Baker"], "snippet": "John Caldwell, Bruce Drinkard, <mark>Andrew</mark> Fratrick. John Jimiaon. Carroll Kanipe, Ken Mason Girls - Barbara <mark>Baker</mark>, Nancy Beane, Kim Coggins,"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1676.38, 201.44, 1832.11, 1047.61], "bbox_id": "e9b6de4b35", "file": "TimesVirginian_1978_0083.pdf", "page": 1, "text": "Third Six Weeks FRESHMAN A Honor Roll - Danny i Harvey, Jean Thomas, Cheryl  Walton, Duane Blanks, Kim , Coggins, Phillip Jacob, Nu- j gene Harvey, Richard H. Jones, i Keith Dickerson, Dennis Strat- j ton, Stephanie Ferguson, Cindy j Maxwell and Jayne Doss. B Honor RoU - Kim Wade, Marilyn Randolph, Herbert  Allen, Cindy Simpson, Jane  Almond, Shane Abernathy, Debbie Harris, Andrew Fra trick, Tammy Jamerson, Kurt Greenbaum, Musette Haskins, Karen Johnson, Debbie Law- son, Kathy Lewis, Ellen Lyons, Carroll Kanipe, Allen Smith, Timmy Tolley, Susan Shorter, John Jamison, John Caldwell, i Sherry Maxwell, Karen Cov ington, Dana Ford and Randy Franklin. Honorable Mention Dana White, Joan Williams, Margaret Moore, Sherry Over- ton, Sherry Martin, Janet NeaJly, Barbara Baker, Randy Atkins, Nancy Beane, Karen Basemore, Tommy Williams, Norma Hancock, Paula Hyche, Romano H. Ganneger, Marvin Johnson, Bruce Drinkard, Bridget Franklin, Gina George, William Scott, Donnie Stead man, Sharon Taylor, Joan Robertson, Cheryl Reeves, William Robinson, Kenny Burks, Kim Crabtree and Susan Handy. Sophmores A Honor Roll - Dale Garret, James Hash, Laurie McLean, Yolanda Miller B Honor Roll - Robin Spiggle, Sharon White, Tammy Wo mack, Melinda Davis, Linda Cowan, Phil Paulette, Pam Quill, Janet F. Griffin, John Foxwell, Lori Mitchell, Sandra Ferguson, Rhonda Nash, Bev erly Oxner, Lisa Moore Honorable Mention Linda St. John, Kenny Shorter, Ronnie Robinson, Bar bara Watson, Tony Phelps, Andrew Hall, Sharon Guill, Greg Cheatham, JoHanna Belter, Dickie Beale, Theresa Campbell. Juniors Michelle Tweedy, Jan Cog gins, Sue Lawson, Molly Handy, Benny Harvey and Beth Carter B Honor Roll - Stephen Lipford, Martha Maxwell, Theresa Lively, Theodora McCormick, Mary Dyess, Willis Fleshman, Shelby Dunnam, Kathy Johnson, Barbara Wen ning, Mildred Crews, Andrew Kelso, Nadine Bugg, Sharon Bryant, Lisa White, Dee Ann  Wooten, Dave Williams, Ta mara Nash, Rita Reynold, Chris Johnson, Fred Mitchell,"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "Maxwell and Jayne Doss. <mark>B</mark> Honor RoU - Kim Wade,"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "Maxwell and Jayne Doss. <mark>B</mark> Honor RoU - Kim Wade,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [339.85, 220.05, 499.92, 1098.33], "bbox_id": "7aa0c13685", "file": "AppomattoxNewspapers_1922-1923a_0417.pdf", "page": 1, "text": "THE NEWS OF THE WEEK. Domestic. A bill in equity to secure an ac counting of the financial affairs of Mrs. Mary Baker Glover Eddy, head of the Christian Science Church, was filed in the New Hampshire courts by Mrs. Eddys son, George W. Glover, of Deadwood, S. D., and his daughter, Mrs. Mary Baker Glover, and George W. Baker, a nephew of Mrs. Eddy. The Western section of the Alli ance of Reformed Churches holding the Presbyterian system has sent a letter to the Reformed Churches in France expressing satisfaction over the new religious conditions. Wilhelm Raff, editor of the Illi nois Staats-Zeitung, the oldest Ger man editor in the United States, is dead. The Y. M. C. A. building at Utica, N. Y.. was destroyed by fire, causing a loss of 150,000 to 175,000. Thomas Baldwin, of Colfax. 111., shot and instantly killed Mr. and Mrs. Charles Kennedy, Mr. and Mrs. Eise- man and Miss Eiseman. Baldwin had been indicted for an alleged as sault upon Miss Eiseman. Rev. J. B. Tittle, his father, his wife and baby were killed and two children fatally injured by an ex plosion of dynamite that destroyed his house, at Carnie, 111. Filipinos are alarmed over Japan ese war talk, and a recent exchange of salutes between warships so fright ened many natives that they fled to tho mountains. Andrew Freedman, of New York, recovered judgment in the New York court against the Maryland Casualty Company for 58,046. Paul Morton and ail of the other retiring officers of the Equitable Life Assurance Society were re-elected. The lower house of the California legislature passed a sweeping anti- Japanese and anti-Chinese measure. The Salvation Army will establish antisuicide bureaus in all the large cities of the United States. The Porto Rico Legislative Assem bly adopted a bill providing for the abolition of the death penalty. Hundreds of waterspouts were seen on Nantucket Shoals by officers of the steamer Maine.  Comptroller of the Rock Island Railroad testified in Harriman in vestigation that that road was mort gaged up to the limit and that its treasury was empty. What the Rock Island got in deal with the Harriman interests was brought out. It has been discovered that the 173,000 missing from the Chicago Subtreasury was stolen by a promi nent business man, who used an ordinary ruler to draw the cash from behind the tellers screen. Stuyvesant Fish replies to accusa tions made by E. H. Harriman and declares all transactions in which he engaged will bear the closest scru tiny. Fall of 8 cents a dozen in the price of eggs is reported from Chicago. Supply is said to be inexhaustible and the egg famine at an end. Two firemen were killed and 11 others rendered unconscious by am monia fumes during a fire in New York market. William F. Walker, the missing treasurer of the New Britain Ct. Savings Bank, has been traced to Oregon. The New York State Court of Ap peals sustained the judgment of the lower court that George W. Perkins, as a vice president of the New York Life Insurance Company, was not guilty of larceny in the use of funds of the company for contributions to the Republican campaign fund. In an encounter between Congress man-elect R. N. Hackett and Repre sentative G. G. Bryant, of the North Carolina legislature, on the floor of the House, at Raleigh, the former struck Bryant in the face and the latter drew a knife, but was dis armed."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "affairs of Mrs. Mary <mark>Baker</mark> Glover Eddy, head of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "affairs of Mrs. Mary <mark>Baker</mark> Glover Eddy, head of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [166.11, 329.15, 331.04, 770.62], "bbox_id": "80adf371f4", "file": "AppomattoxNewspapers_1933-1936a_0090.pdf", "page": 1, "text": "o o EVERGREEN I O- -------------- - ------------------ Evergreen, June 6.- Mr. and Mrs. Peyton Harvey and family were ra cent guests of her sister, Mrs. Leo nard Cawthorn, at Red House. Mrs. Emma Thomas is spending the weak with her son and daugh ter near Darlington Heights. Mrs. W. J. Smith, Charles and June and Mrs Newell Smith were guests of Mr. and Mrs. B. W. Har vey Sunday. Vivian, Hazel and John Lawson were also there. Miss Carieen Coleman is on the sick list. Guests of Mr. and Mrs. J. A. Young Sunday were Mr. and Mrs. Frank Cawthorn and son, of Appo mattox Mr. and Mr.,. Lawrence Young and family, of Lynchburg. Mrs. Sue Harvey spent the week end at Pamplin visiting her sister Mrs. Lillie Moses.     Master Claude Edward Farrar was a recent visitor of Fred Smith. Avery and Andrew Chocklett, of Lexington, visit jd their parents here Sunday.  -   The Young Peoples Council met at the home of Mrs. W. H. Smith Monday night. Mrs. Ruth Jennings was a recent guest of Mr. and Mrs. Peyton Har- Vgy, winu- l w Ther will be a lawn party at the Methodist church Saturday, June J, commencing at five P M. Ice cream, cake, pies and sandwiches will be on sale. A recreational program will be conducted by Rev. F. H. Mead. Mr and Mrs. Mott Harvey and family were Sunday guests of Mrs. H. D. Baker. Miss Mabelle Smit.n has returned"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "of Mr. and Mrs. <mark>B</mark>. W. Har vey Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "of Mr. and Mrs. <mark>B</mark>. W. Har vey Sunday."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [851.1, 250.99, 1022.8, 1054.68], "bbox_id": "a19ea4445d", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "Name 258, Frank P Glover 676, Bedford Morris 275, Hal F Clark 564, Jasper Jackson Smith 596, James Edward Alvis 586, John Millard Lucado 126, Peroy B Whitaker 107, William Samuel Reynolds 309, Joe Hancock 437, S Guy Smith 604, Charles Lester Carson 43, Archer Wade Gallier 514, Raymond Bell 483, Walter W. 8cott 140, Hallie Dillard 432, Oscar Luther Scheffler 606, Joseph Wadsworth Crews  223, Dean Alpha Pugh 117, James Henry Stanley, jr. 552, William Albert Owen 675, Thomas Edgar Moore 452, Calvin Cbanie Woods 355, Alexander Price 31, Tomie Wiley Ferguson 525, Charles Douglas Doss 56, William Walter Gnnter 5, Arthur Cleveland Almond 54, Leonard Nathaniel Gregory 549, W illiam Douglas McCormick 638, Albert Tucker Scruggs 623, George Lee Jones 269, Leonard Henry 336, Willie Emmett Coleman 493, Thomas Jefferson Spradlin 353, W illie David OKeefe 360, Norman Baker 488, William Walker McCormick 72, Samuel Lee Loomis 128, Larkin Foster Williams 679, Alex. Robertson 6, Bradley Whitney Babcock 327, Cavil Caleb Baldwin, 566, George Wesley Phelps 164, Norman Watt Page 30, Terry Collie Durham 199, Samuel Joel Harvey 608, Henry Alvin Drinkard 588, Hunter Marshall McCoy 642, Charles Clarence Thomas 222, Julian Delaware Pugh 321, Harry Mickle  368, Wiiuam Anthony Jones 320, Russell Mack 656, Charlie Davis  121, Aubrey McCoy Thomas 221, David Grover Pugh 90, William Tunstali Morgan 175, George Elliott Cheatham 336, Ewell Ferguson 212, Rexford Lion Martin 8, Hal Thornhill Baber 305, Howard Thomas Williams 622, James Tazewell Jones 357, George Harrison White 23, William Andrew Day 831, Marcus Case 565, Frank James Smith"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "Millard Lucado 126, Peroy <mark>B</mark> Whitaker 107, William Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "Millard Lucado 126, Peroy <mark>B</mark> Whitaker 107, William Samuel"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [813.37, 946.0, 978.09, 1702.16], "bbox_id": "cd0d859f93", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j 525, Charlee Douglas Doss 56, Wm. Walter Gunter 183, James Oscar Patterson - 350, Alexander Lane 5, Arthur Cleveland Almond 54, Leonard N Gregory 440, Andrew Smith 649, Wm Douglas McOormiek 638, Albert Tuoker Scruggs 623, George Lee Jones 269, Leonard Henry 685, James W Watson 335, Willie Ennett Coleman 493, Thomas J. Spradlin 341, DeWitt Talmage Goin 391, Thomas B. Bryant 363, Willie Davis Okeefe 637, George Wesley Powell  360, Norman Baker 571, Elmore Wiikerson j 488, Wm. Walker MoOormick 72, Samuel Lee Lumis I 112, 0 . W. Smith I 356, Van Buren Webb 679, Alex Robertson 128, Larkin F. Williams 363, Willie Hunter 6, Bradley W. Babcock 327, Carie Cabell Baldwin 93, Lewis S McCormick 664, Nathan Fleshman 345, Walter Alien Heflin 103, E. T. Price  556, George Wesley Phelps 164, Norman W att Page 61, James Barton Goff 30, Terry Colley Durham 388, Edward Irving Bingham 199, 8 amuel Joel Harvey 608, Henry Alvin DriukaM 406, Wade Hampton Fergu- son 619, Harry Leonard Oumby j 392, Eddie Carter j 25, Eddie Dinwiddie  383, Thomas Homer Babcock 588, Herman Marshall McCoy L 576, Winden Blackwell 122 , Bernard Dickerson Tho mas 642, Charles Clarônce Thom ee 222, Julian Delaware Pugh 297, Frank Snyder 321, Harry Miokle . j 368, Wm. Anthony Jones 320, Russell Maok 656, Charles Davis 221, David Grove Pugh 121, Aubrey MeCoy Thomas 292, Emmett Warren Oakes 504, Wm. John Johnson 470, Joseph Preston Coleman 818 Herbert Harri 80, Wm. Tuaatall Morgan"}, "highlight": {"text": {"matched_tokens": ["Andrew"], "snippet": "Leonard N Gregory 440, <mark>Andrew</mark> Smith 649, Wm Douglas"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew"], "snippet": "Leonard N Gregory 440, <mark>Andrew</mark> Smith 649, Wm Douglas"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1906.03, 343.14, 2081.97, 1734.36], "bbox_id": "ff9c0741a5", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "I 679 Robert I Pamplin I 680 Henry I Vera 681 W illie Jordan Kidd,Pam plin 682 Robert Letcher Walker. Pamplin 683 Shirley Walker, Pamplin 684 Samuel Daniel, Pamplin 685 Clifton Woolridge, Pam plin 686 Poindexter Goode, Vera 687 Wm. Spencer Hix, Pam plin 688 Wm. Robt. Allen, Appo mattox 689 Sami Saunders,  ppo- mattox r-f d 2 690 John Baker, Vera ! 691. Joe Lee Jones, Vera 692 Clarence Jones, Vera 693 Wiley Jones, Pamplin 694 Napson Matthews, Pam- lin 695 Berry Walker,Fores Store 696 John Dillard, Pamplin 697 John Brandon, Prospect 698 Rogers Brock, Pamplin 699 Robert Biglhw, Pamplin 700 Louis Vanderbilt David son, Pamplin 1 701 Willie Joseph Walker, Pamplin  702 James Johnson, Pamplin I 703 Washington Jones,Pamp lin 704 Fountain Thornton, Vera 705 Floyd Webb, Vera j 706 A le x a n d e r Patterson, Pamplin  707 Floyd Manuel Walker, ! Pamplin 708 John Ligon, Pamplin 709 Robert Henry Lee, Pamp lin 710 John Henderson Walker, Pamplin j 711 Edgar Brown, Pamplin 712 Raymond Walker, Veia 713 John Edward Gilliam, Pampin 714 James G a r y Gilliam, Pamplin 715 James Lyman Walker, Pamplin 716 Frank Webb, Vera 717 Arthur Saunders, Vera 718 James Jones, Yra 719 Floyd Saunders, Vera 720 G e o r g e Washington Saunders, Fores Stère I 721 John Ferguson, Pamplin 722 Wesley Blglosr, Pamplin 723 George Randolph John, son, Vera 724 James Westmore Lamb I kin, Appomattox r f d 1 I 725 Robert EarnestLee,Ever-  green I 726 John Floyd Austin,Spring  Mills 727 James Board Marshall, I Spring Mills 728 Courtney Russell Wood- son, Spout Spring S 729 Atwill Dewitt Spout Spring 730 Jim B o b Ford, Spring 731 John Lloyd Lewis, Appo mattox 732 Joseph Pastor Lee, Appo mattox 733 Clde Sylvester Frank, Appomattox  734 L o y d Everette Nash, Spout Spring 735 David Glover Marsl all, Spout Spring 736 William Ottoway Pente cost, Spring Mills 737 Curtis Everett Martin, Spout Spring 738 James A b n e r Martin,1 Spout Spring 739 Lacy Blassengame Mar tin, Evergreen 740 Walter Witt Woolridge, Evergreen 741 Samuel Tilden Paulett, Evergreen r f d 1 742 Marshall Wilson Pugb, Appomattox r f d 1 743 Clinton Thornhill Oaw- tboru, Evergreen 744 Charles William Knotts, Appomattox 745 Willie Dewitt Harvey,  Evergreen   746 Robert Jefferson Pauiett,  Evergreen  747 John Thomas Wpolridge,  Appomattox r f d 1 748 Early Willis Thornton, I Spout Spring 749 Charles Elw ard Moses,  Spring Mills 750 Jeter Curry Wooldridge,  Evergreen 751 Andrew Lee Mann, Appo- I mattox 752 Randolph Txavie Lee, Ap- I pomattox  753 Albert Herbert Lee, Ap- I pomattox r f d 1 754 Edd Taylor Elder, Red I House 755 Wilbert Lee Elder, Red I House 756 Joseph Henry Marshall, I Red House 757 Emmet Giles kann, Red I House 758 Johnson Wyatt Mann, I Appomattox r f d 1 I 759 William Thomas Nash, I Appomattox r f d 1 760 James Robert Reed, Ap  pomattox  761 Horace Dillard Baker,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "d 2 690 John <mark>Baker</mark>, Vera ! 691. Joe Lee"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "d 2 690 John <mark>Baker</mark>, Vera ! 691. Joe Lee"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.34, 410.71, 1849.69, 1550.94], "bbox_id": "03b9b992fc", "file": "AppomattoxNewspapers_1926-1933a_0414.pdf", "page": 1, "text": "Happy New Year to the Editor and his many readers. There is a great deal of sick ness and the doctors are kept busy. 72 pupils were absent from school to-day on account of sickness. Mrs. Marietta Guthrie Ander son, wife of the late Chas. Ander son, of Prince Edward County died at the home of her daugh ter, Mrs. Frank Allen, on Sunday December, 30th, age 90 years. She had been in declining health for several years. Her remains were interred i n Bethlehem cemetery on Tuesday, January 1st, where a large concourse of loved ones and friends gathered to pay the last tribute of love and respect to one who will be so sadly missed in the home circle. News also reached here the past week of the death of Mr. Eggleston Dannie of Hopewell, Va He was son of the late Henry Danniel of Prince Edward County. He leaves a wife and one daughter to mourn their loss. Little Reed Dobbins is quite sick at this writing, also John and Dave Anderson. Mr. and Mrs. John P. Baker of Drakes Branch, spent Sunday with their sister, Mrs. Evie Thackston. Little Courtney Whitehead, who had the misfortune to fall and break his leg at school on December 22nd is now suffering with an attack of the flu. Mr. Walter Towler and sister, Miss Josephine, attended the wedding of her brother, James Andrew Towler, to Miss Mary Elizabeth Heath, at Lovingston, V a, on December 26th. Mr. and Mrs. Wallie Daniel were called to the bed side of her daughter, Mrs. Lacy Martin, of Disputana, last week. Mrs. Martin is some better. Mr. D. F. Canada, of Halifax County, spent Sunday with his daughter, Mrs. Oscar Towler. Miss Marietta Bell visited her brother, Richard Bell, near Rich mond. last week. Mr. Bell con tinues very ilk Miss Margaret Bell daughter of Rev. G. F. Bell and her friend Miss Lucy Hockaday of Holland College, N. C., spent the holi days in the home of Miss Bells grandmother, Mrs. Mollie Bell. Miss Mattie Womack was a recent visitor in the home of her cousin, Mr. Sam Anderson. Miss Lucile Baker left January 1st for Memorial Hospital in Lynchburg, whete she will train for a nurse. Little Katie Anderson, of Wythe County, has been visiting her parents, Mr. and Mrs. Frank Anderson. Miss Josephine Baker has re turned to her work at Stuart Circle Hospital Richmond, after spending a few days. with her parents, Mr. and Mrs. W. A. Baker. Born to Mr. and Mrs. Herman Scruggs, a little son. Mr. William Thackston of Bal timore, spent a few days during the holidays with his parents, Mr. and Mrs. J. N. Thackston. Mr. Noah Templeton, had the misfortune to shoot his foot very badly several weeks ago. He is still unable to walk. Miss Josephine Towler left yesterday for her school in W. Va.,after spending the holidays with her father, E. B. Towler."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "and Mrs. John P. <mark>Baker</mark> of Drakes Branch, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "and Mrs. John P. <mark>Baker</mark> of Drakes Branch, spent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1835.23, 640.81, 1984.26, 1164.63], "bbox_id": "09d5113f2d", "file": "TimesVirginian_1978_0083.pdf", "page": 1, "text": "First Semester Honor Roll Seniors A Honor RoU - Marlene Moore, David Eye, Marie Fraley, Darrell Puckett, Mar zetta Hodnett B Honor RoU - Ann McCraw,  Berneta Moore, Bernice Mc- Ivor, Sheryl Martin, Veronic  Franklin, Linda George, Janet j Fitzgerald, Laura Shorter, j Loretta Lettner, Debbie Mott- j ley, Beth Smoak, Robin Moore, Laurie Selz, Nancy Stratton, Cathie Tanner, David Robert- j son, Mike Wooten, Rindy j Lawson, Annette Baker, Judy  Ayers, Penny Cabiness, Brenda j Bowling, Robert Dyess, Connie j Murray, R. L. Harris. Honorable Mention - An thony Johnson, Jay Franklin,  Merry Wright, Jacquetta Jon- j es, Melinda Lee, Rosa Abbitt, j Rose Glenn, HoUy Franklin, i Polly Carter. Juniors A Honor Ron  Jan Coggins, Sue Lawson, Benny Harvey and Beth Carter. B Honor RoU - Martha MaxweU, Theresa Lively, Mary Dyess, Willis Fleshman, Shelby Dunnam, Kathy H. Johnson, Andrew Kelso, Sharon Bryant, Cheryl Conner, Chuck Davis, T.isa White, Dee Ann Wooten, Freddy Mitchell, Tamara Nash, Chris Johnson, Barbara Wenning, Sharon Roach, Wan da Doss, Susan Campbell, Cindy Roach Honorable Mention - Stephen  Lipford, Francis McFadden, Theodora McCormick, Dave Williams, Rita Reynolds, Jua- nite Patterson, Peggy Handy, Susan Smith, Mildred Crews, Donnie Eagle, Gail Doss and"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "Puckett, Mar zetta Hodnett <mark>B</mark> Honor RoU - Ann McCraw,"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "Puckett, Mar zetta Hodnett <mark>B</mark> Honor RoU - Ann McCraw,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2118.46, 282.64, 2280.91, 853.02], "bbox_id": "ebc73b4e03", "file": "TimesVirginian_1978_0307.pdf", "page": 1, "text": "B Hoi or Red - Tim Marshall, Margaret Lyons, Robert Hard-  ing, James Hash, Sandra Ferguson, Pam Ford, Pam Guill, Tim Davidson, Linda Cowan, Melinda Davis, Sara Richardson, Debbie Roach, Tammy Womack, Judy Zim merman, Peter Nealley, Scott Stevens, Pam Shrock, Linda St. John. Honorable Mention - Danette Letterm an, Pam Jefferson, Andrew Hall, Martha Garrett, Janet Griffin, John Foxwell, - Phillip Paulette, Kenneth Shor ter, Robin Spiggle. Freshman A Honor RoB - Stephanie Ferguson, Cindy Maxwell, Sherry Maxwell, Susan Shor ter, Keith Dickerson, John Jimison, Philip Jacobs, Nugene Harvey, Randall Franklin,  Duane Blanks, Kim Coggins, I Jean Thomas, Cheryl Walton. Freshmen B Honor RoU - John CaldweU, Mike Campbell Karen Coving ton, Jayne Doss, Dana Ford, Timmy ToUey, Sharon Taylor, Dennis Stratton, Ralph Totty, Bridget Franklin, Gina George, Kathy Lewis, Richard Jones, I Karen Johnson, Tammy Jamer- son, H erbert Allen, Jane Almond, Cindy Simpson, Dana White, Lisa Wenning, Tommy Williams. Honorable Mention - Kim Crabtree, Sabrina Richardson, William Robinson , Donnie I Steadman, Sandra Reynolds, Allen Smith, Dana McGrath, Shavonne Johnson, Carroll Kanipe, Marvin Johnson, An drew Fratrick, Paula Hyche, Barbara Baker,. Karen Base- more, Ken Mason, MicheUe I Martin, Bobbie McFalen, Sher ry Overton, Marilyn Randolph, Jonathan Pickett, Joan Wil- I liams."}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "<mark>B</mark> Hoi or Red - Tim"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "<mark>B</mark> Hoi or Red - Tim"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.55, 416.05, 1632.3, 1785.1], "bbox_id": "1237840419", "file": "AppomattoxNewspapers_1892-1898a_0291.pdf", "page": 1, "text": "At Eastland, Wls., the boiler in tbe saw mill blew up, killing Mr. Eastland, bis son and Mr. Keith ------ A. C. Probert. mayor, and a well-known banker of Washburnc. Wls. has Leen arrested on a charge of embezzle- ment preferred by Cashier Hutson, ot the Bank of LodL He gave bonds in the sum of 81,600 At Elizabeth, N. J, George Polet- iihleek was fatally stabbed in a drunken fight with Mluhael Morris. Morris alleges that he acted in self-defense. ----- The Wel- lanJ Port Flour Mills, In Welland Port, Ont., were burned to tho ground, with their con tents. Loss 125,000 insurance small. ---- Judge Baker, of tbe Supreme Court In Chi cago, issued a stay In tbe ease of the Meade w- eroft brothers, who were convicted of re ceiving deposits after they knew that their hank was Insolvent. This will result In a new trial ----- R. 8. Williams, clerk of tbe Cirouit Court at Carthage, Tenn., shot and seriously wounded Clarence W. Garrett, a lawyer and Populist poitlcian. ----- Rudolph Muller, a grocer of Louisville, Ky., fired two barrels ol a shotgun into his wifes face be cause she bad filed suit for divorce from him She will die. Their three children witnessed the shooting. ----- Joseph Williams was ar rested on the charge of stealing copper bands from the Ocean View Trolley road. ----- Tho sawmill near Saxs Postofilce, Va., owned by D. C, Jeremy, was destroyed by fire. ___ Three more persons are reported to have lost their lives In Kentucky by the cloud hurst Eight Inches ot snow fell in Colorado. ---- Pbe big dam in the Lehigh River at White Haven, Pa., burst, and property to tbe value o 165,000 was destroyed. ----- Only aeventy- ne out of ninety-eight coal mine operators In the Pittsburg district signed the uniform sate agreement, and if it is not ratified there will be a reduction in wages at several mines, ----- The Clark Mile End Thread Works, In Kearney, near Elizabeth, N. J., shut down, beoause ot a strike ot the plecers and creelers. ----- Alfred Hand was reported to have been murdered by Indians near Wilcox, Arizona. ----- A colony ot Turks in fiaincy, 111., Is securing naturalization papers. ----- The Supreme Court of Missouri approved the sentence of the Taylor brothers, convicted of murdering the Meeks family. ----- The Cutter Silk Manufacturing Company, of West Bethlehem, Pa., failed. ---- Suit has been filed in the United States Circuit Court In Denver, Col., by the Inter state Commerce Commission, invoking the aid of the law to enforce its orders against ten Western railroads. It Is proposed to compel these common carriers to desist from Recriminations In freight rates between long and short hauls. ----- Mrs. M. A. Stockton, who was one of the prominent figures In the recent scandal involving Rev. C. O. Brown, of the First Congregational Ohnrch, In San Francisco, has been expelled from the ehurcb. ----- Mrs. Olga Deuss killed herself and her three children In San Franoisoo. Him Ohio Buehlen, a wealthy orphan of Bellefontaine, Ohio, disappeared from Den ver suddenly. ----- In a row at Carrollton, Mo., Ole Ecton was killed. ----- Fire at Oris- kany Falls, N. Y., destroyed one business block. The Opera House, Union School and Sargent House were badly damaged. Loss 840,000 ----- William Fleming was put iu jail at York on the charge of stealing a horse, oart and harness ----- The store ot W. G. Alther near Woodstook, Va., was burned,- loss 86,000. ----- A score or more of the lead ing steel manufacturers met in New York, and formed an association for protection of their Interests. ----- Fire destroyed a part of the business section of Brunswick, Ga., oauslng an estimated loss of 8500,000, on which there is an Insurance of about 8400, 000. ----- Ms Annie Morton, assistant post mistress at West Newfleld, Maine, pleaded guilty of embezzling postofilce funds. Mrs. Emma F. Browne, aged fifty, was killed by a trolley ear at VI heeling, W. Va. ----- At Montgomery, W. Va., B. W. Moore, a lawyer, and ex-Mayor H O. Montgomery bad a dud in the street Moore was shot twice. Five persons were hurt In a railroad wreck, near Freeport, Pa. ----- By a boiler plosion, near Cincinnati, W. B. Fitzwater and Earnest Martin were killed and Fred Groves, Sam Fitzwater and Milla Fitzwater were badly Injured. ----- Carl Thorn, a notor ious outlaw, was killed at Dover, Oklahoma, by a United States deputy marshal. ----- A man, thought to be Major B. Frank Hen, at Lebanon county, Fa., was found dead near Osbourne, Australia.Adam K. Metz, of Richmond, Ind., was arrested at Lebanon, Pa., oharged with embezzlement. ----- Fire partly destroyed the feed ware house of Henry B. Cassell, Philadelphia. The loss will be 830,000 on stock and build ing. James L Webbs adjoining coal yard was damaged to the extent of 85,000. Both are insured.Northern Wisconsin was awept by a terrible snowstorm. ----- A rain storm did considerable damage in Tennessee and Kentucky. ----- Te eastbound cannon ball train of the 8L Louis and Frisco Rail road was held up near Lebanon, Mo., and the Wells, Fargo  Co jexpress car robbed. Agents of Russlaa patriotic societies are trying to prevent George Krosuow, who was Implicated In a plot that resulted In the as aassinatlon of Czar Alexander II, of Russia in 1881, from leaving this country, he having disappeared from Chicago, and, It is believed offered to enter the Russian secret service and give the government valuable loforma Mon. ----- Sheriff W. O. Gywne was killed and John F. Madden, of Pike county. Ga. wounded, at Concord, a mountain town, by the Deek gang of outlaws. ----- In a cloud burst on Little Sexton Creek, near Boone- ville, Ky., a dozen or more people were drowned. ----- Andrew Gruhter committed nlcldeln Altoona, Pa.-----William Haley eolored, was badly beaten by whiteeops in De Soto county, Miss. ----- A cave-ln caused a wreck on the Baltimore and Ohio near Graf ton. ___ Postmaster Tomllnaon wounded and saptured Charles Flier, whom he detected robbing the postofilce at Shiloh, N. J.- Blohard Ringer, of Friend, Neb., out off his head when he found he had hydrophobia, ___ Herman Kirsehoff, manufacturer builders materials in Chicago, fslled.- Thomaa Wharton dropped from a fourth story window In Philadelphia and was killed ___ Sylvanus Stokes, colored, while working n a pile-driver at Norfolk, Va., fell and broke his neck."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "125,000 insurance small. ---- Judge <mark>Baker</mark>, of tbe Supreme Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "125,000 insurance small. ---- Judge <mark>Baker</mark>, of tbe Supreme Court"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1300.06, 468.37, 1547.95, 773.81], "bbox_id": "24c1022f7e", "file": "AppomattoxNewspapers_1955-1957a_0109.pdf", "page": 1, "text": "- .-    I   o, S  - work in vocational gricuMR1 L Wta,b avM-iSply oi superior to aee Mrs. Andrew William- ability in the local F. F i after being a patient in the ter. Only two per cent of i F. F. A. membership fa 1 -asSfe , , , in any one year may be ,B Cobb returhed from the State Fanner rcn. pitajMunday, and is in the first two degrees mention MgBnd Mrs. Carol Martin, warded by the State Asocii1 State nd  jjfcrs. R. L. Hawkins, of at Blacksburg, Vnginia, the week-end with e,, , m-in-law and daughter, Mr. T a J f?UrtiL8nd highest k  E tin L. Webb, warded by the Future America is that of America Mrs. W. M. Thompson, er, which is . given annualimoawwere dinner guests on national F. F. A. convent? affSning of Dr. and Mrs each. October in Kansas jay- honor 1 h . Trent has returned to in theF. F. A. Virginia Baptist Hos months continuously, must f c efe e ks    outstanding farming progra have earned and investedHfiiy Davis has returned 1000, and have demonstrE ten- day visit with her Standing leadership ability jHBp W. D. Browning, of as have a satisfactory send, record. .Mabel W. Baker, who has"}, "highlight": {"text": {"matched_tokens": ["Andrew"], "snippet": "superior to aee Mrs. <mark>Andrew</mark> William- ability in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Andrew"], "snippet": "superior to aee Mrs. <mark>Andrew</mark> William- ability in the"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1807.46, 243.83, 1968.88, 1263.71], "bbox_id": "b531343034", "file": "AppomattoxNewspapers_1892-1898a_0362.pdf", "page": 1, "text": "Goiu,Saml H , est ....... 703 12.9 Goin, Jas M ................ 10 3 Haycock, Maggie W... 125 1.3! Harvey, Jno F ............ 249 2.61 Hollovan, Mary E ....... 60 1.81 Gull, Otho .................... 60 1.51 Hix, Williams est ..... town 21 4af lot Johnson, Richard est..-store  4.2 house Jones, L D ...... . .......... 300 6.3C  Jennings, Phoebe...... 214 5.63 JoDes. W D ....... ?. ........ 239 3.76 Kyle, Ro R .................. 403 6.39 Lewis, Shedruks est.. 188 3.11 LeGrand, A A e s t ...... 233 3.68 Meadows, Ro P ............ 12 51 Mitchell, B W and 10 2 2.17 Jane. Phelps, Wms est ....... 1 1 1 28 Pauktt, Sarah ............. . 54 2.00 Paris Elijah., ............. 34 57 Riuison, Elizabeth T.. 27 86 Raymond, Sarah J..... 75 2.75 Scruggs, Edward ....... 23 80 Thornhill, Mildred est 10 0 2.63 Thornhill, Eliz ............ 146 3.87 Walker, Wms est ....... 124 2.07 Woodson, Abadiah est 117 1.87 Wingfield, Wm AT.... 55 1.16 Webb, Nancy M ...... 50 1.58 Webb, Merry and H. 200 3.15 Goins est. COLORED. Abbitt, John and 17 38 Elijah Clark. Diuguid, Ch H ............ 2  3.03 Durphey, Dennis...... town 63 lot Elam, Nelsons est ..... 8 78 STONEW ALL DISTRICT. Abbitt, Lucy O ............ 1 2 1  2.06 Barrick, J W T r for 115 4.87 Geo Barncks. Evans, Dr D R ............ 10 28 Foster,M A, C J, M R, 1 Ò 2 1 Eliza and E. A. Pear man. Foster, H J heirs ..... 1 2  28 Harris, Jno est ............ 1  8 Harrison, Wm D ....... 175 5.55 Hundley, Eliza A ..... 1 1  51 Moore, Sampson .......... 801 2.52 Neister, Willis W ....... 60 3.16 Phelps, J C aud wife 6 38 PearmaiijC Rand wife 1 2  28 Reid, Wm. .................  2 10 Shearer, Henry B ....... i 2 1  30 Walton, J C and J W  9 aud S P Vawter, - COLORED. Coleman, Geo ........... . 33 1.05 Moore, Henry .............. 4 63 SOUTHSIDE DISTRICT. Clark fc Collins .......... town 1.58 lot Clayton, Lucy A ....... 125 2.63 Davis, Temple T r for 33 74 S Baldwin. Elliott, Andrew A ..... 149 1.58 Elliott, Jas W .............. 528 5.54 Farrar, M aryW . ........ 30 63 Farrar, Southeys est 1 1 0 1.75 Fore, Reuben est ....... 148 3.89 Farrar, Chas. H ......... 28 49 Farrar, O W ................ 84 1.25 Giles, Josiahs est ..... 12 0 1.58 Jones, Tho J, Ann O 15 59 and G S. Lee, Catherine G ....... 39 1.24 Martin, Chas ................ 69 91 Marshall, J M est ....... 503 13.21 Marshall, Jno W est.. 26 70 McKinney, John ....... 6501 13.70 Meadows, Fannie A... 104 2.75 Morris, Mary R. ....... .  28 Paulett, Presley B est 126 3.99 Ragsdale, Mary E and 460 12.08 children. Smith, Maria B and 108 2.55 others. Stewart, Duncan ....... 124 3.43 Toney, Jno M est ....... 200 2 .10 COLORED. Bakers, Jno est ............ 107 3.40 Cheatham, Lewis ....... 6 31 RECAPITULATION. T otal Southside District.. 81.95 Clover Hill-District 108.03 Stonewall District.. 22.35"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "P ............ 12 51 Mitchell, <mark>B</mark> W and 10 2"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "P ............ 12 51 Mitchell, <mark>B</mark> W and 10 2"}], "text_match": 1731669185798340729, "text_match_info": {"best_field_score": "1116664496128", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669185798340729", "tokens_matched": 3, "typo_prefix_score": 1}}
