{"document": {"bbox": [557.28, 181.96, 705.43, 380.1], "bbox_id": "e45984f6c9", "file": "AppomattoxNewspapers_1971-1973a_0478.pdf", "page": 1, "text": "yards rustling, in Appomat- tox wits led By Billy Guthrie, Nathan Snell, Phillip Goode and Warren Coleman. Nelson out rushed Appo mattox 293 to 131 yards and was penalized on 35 yards to 70 for the Raiders. Appomattox takes o n Brook ville here at Appomattox this Friday night. Nelson 6 7 0 0 - 13 Appomattox - 0 7 0 0 - 7 Appo scoring - Layne, 5 yd. run Goode Kick Nelson scoring - Campbell 1 yd. run pass fail Rose, 50 yd run. Knight kick"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "to 70 for the <mark>Raiders</mark>. <mark>Appomattox</mark> takes o n Brook"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "to 70 for the <mark>Raiders</mark>. <mark>Appomattox</mark> takes o n Brook"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1154.31, 453.16, 1309.12, 1021.64], "bbox_id": "2c33d5ef1d", "file": "TimesVirginian_1978_0504.pdf", "page": 1, "text": "Winners in the Football Contest sponsored by local m erchants have been an nounced by the TIMES-VIR- GINIAN for the contest in the November 2, 1978 edition of this newspaper. Jefferson Forest - William Campbell did not play each other in Friday nights game so we will not count that as one of the contest games. With a possible 22 correct predictions to make in this contest, Raymond W. Bryant of Route 3, Appomattox correctly picked 21 games. He is winner of first place and will receive a check from the TIMES-VIR-  GINIAN in the. amount of 10.00 as first place prize. Correctly picking 20 of the games from the possible 22  games listed in the contest were Nelwyn Morris of Route 3, Robert I. Scott of 510 Virginia Avenue, Leoh Bryant, Jr. of Route 3, and Steve Mitchell of P. 0. Box 132. Going to the tie-breakers for a winner, Steve Mitchell was the only one of the four to pick Air Force to beat Army which was incorrect. Going to the Appo mattox - Amherst game for a winner, Robert I. Scott with an 8 point difference in the game is winner of second place and will receive a check. from the TIMES-VIRGINIAN in the amount of 5.00 as second place prize. Appomattox won over Amherst by only 2 points. As this was the last game of the season for the Seminole District, of which Appomattox Raiders are Champions, the -frxA bottcontegt W itt  k UrtWrt until next season. Congratula tions to all the winners and to the participants in the contest this year. It truly created a great deal of interest."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Seminole District, of which <mark>Appomattox</mark> <mark>Raiders</mark> are Champions, the -frxA"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Seminole District, of which <mark>Appomattox</mark> <mark>Raiders</mark> are Champions, the -frxA"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [354.49, 483.49, 493.2, 649.99], "bbox_id": "910ddb601b", "file": "AppomattoxNewspapers_1974-1975a_0023.pdf", "page": 1, "text": "Using an offense that racked over 400 yards net, the Appomattox Raiders scored twice in the second quarter and three times in the fourth quarter to garner a 34-0 Seminole District football vic tory over winless Staunton River last Friday night. The hapless Eagles were three times victimized by the air strikes of Appomattox quarterback Mac Weaver, and gave up two or more scores to the rushing of Keith Coleman and Dillard Reynolds."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "400 yards net, the <mark>Appomattox</mark> <mark>Raiders</mark> scored twice in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "400 yards net, the <mark>Appomattox</mark> <mark>Raiders</mark> scored twice in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [381.09, 815.31, 734.92, 862.08], "bbox_id": "fdec4c5c47", "file": "AppomattoxNewspapers_1974-1975a_0253.pdf", "page": 1, "text": "ÜHK photo by Joe Vaughan Appomattox Raiders Mile Relay Team"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "ÜHK photo by Joe Vaughan <mark>Appomattox</mark> <mark>Raiders</mark> Mile Relay Team"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "ÜHK photo by Joe Vaughan <mark>Appomattox</mark> <mark>Raiders</mark> Mile Relay Team"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [788.63, 257.87, 933.58, 553.9], "bbox_id": "af6566b1e0", "file": "AppomattoxNewspapers_1971-1973a_0307.pdf", "page": 1, "text": "The Rustburg Red Devils got excellent pitching from Robert G a r n e r last Thursday an d blanked the Appomattox Raiders 3-0 in a Seminole District base ball game. Garner allowed the Raiders six scattered hits and got power from teammate Mike Floyd who had two of Rustburgs five hits and one of them being a two run homer in the seventh. Rustburg took a 1-0 lead whai they push ed a run across in the fourth inning. Jimmy Chandler led the Raid ers in hitting with two hits.Mike Gallier, Ricky Garrett, S t e v e Almond and Dennis Wilkerson had the other Raider hits. The Raiders had runners on base late in the game but could not stage a rally to get them in for a score. The 1 oss gave the Raiders a . 5-3 m ark for the season. Rustburg - 000 100 2 - 3 5 l Appo - 000 000 0 - 0 6 1"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "an d blanked the <mark>Appomattox</mark> <mark>Raiders</mark> 3-0 in a Seminole"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "an d blanked the <mark>Appomattox</mark> <mark>Raiders</mark> 3-0 in a Seminole"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.93, 280.81, 1581.88, 1027.83], "bbox_id": "fff69e294b", "file": "TimesVirginian_1981a_0181.pdf", "page": 1, "text": "The Rev. Dan Menser preached a good message at Central Church on Sunday morning. Mr. DeWitt Harvey conti nues ill. Mrs. Laura Ferguson spent the weekend, in this home. Congratulations to the gra- uates in our community who graduated on Thursday night. They were James Zimmerman, Dana Ford, Sandra Reynolds. M r. and Mrs. Shelby Tucker. visited Mr. and Mbs. Edd Collins and Eric of Lynchburg on Saturday, Mr. and Mrs. Collins and Ericvisited Mr. and Mrs. Tucker on Sunday. . Mr. and Mrs. Ray Layne and daughter, Missy visited Mr. and Mrs. Richard Nash Sunday, Missy Layne is spending this week with Mr. and Mrs, David Carson and chQdren.of Pamplin. Mr. and Mrs. Richard Nash attended a dance concert at Randolph Henry High School Friday night. Susan Carson was in the concert. Mrs. Winifred Nash and Wendy visited Mrs. Nashs mother, Mrs. Emery Dudley Sunday. M rs. Richard Nash and Wendy Nash visited Mr. and M rs. Clarence Gobble of Appomattox Friday. . Keith, Tony and Mike Mann visited Butch Hudson in the home of Mr. and Mrs. Jerry Hudson Sunday afternoon. Mr. and Mrs. Nelson Mann attended, the Appomattox Raiders Baseball banquet on Wednesday night at the United Methodist Church. Congraula- tions to Keith Mann. He was awarded a trophy for the first team all district and a trophy for best defensive player. . Mrs. Mattie Pillow of Phenix, Janie and Heather Franklin of Spout Spring, Kevin and Thomas Torrence of Amherst, T. C. Torrence and Mr. Walter Jordan were supper guest of M r. and M rs. Lankford Torrence Sunday night. Mr. and Mrs. Booker Jones were luncheon guest of Mr. and Mrs. Jimmy Ford and family Sunday, The occasion was to celebrate Michelle Fords bir thday. Miss Lisa Coleman spent some time this weekend with Sharon Davis. M r. Pat Davis left on Thursday for work with the pip line in Alvin, Texas. Mrs. Christine Davis and Share attended the gradua tion at the Appomattox Middle School on Thursday."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Nelson Mann attended, the <mark>Appomattox</mark> <mark>Raiders</mark> Baseball banquet on Wednesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Nelson Mann attended, the <mark>Appomattox</mark> <mark>Raiders</mark> Baseball banquet on Wednesday"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.72, 325.69, 1536.19, 983.67], "bbox_id": "655d966e4b", "file": "TimesVirginian_1976_0477.pdf", "page": 1, "text": "The Raiders had an outstand ing fourth quarter on Tuesday night, Dee. 21, when they scrired 21 points and beat the Altavista Colonels60-55. The game was played at Altavista after the V anity Girls game. The Raiders led the first quarter with twelve points to a Colonel nine. Both teams scored fifteen points in thé second quarter to make thé score at the half, 27 to 24. The Raiders slacked off in scoring during thé third quarter and the Colonels took a one point lead after scoring sixteen pointa. The Raiden only had twelve points in the third quarter and at the beginning of the fourth quarter the score was 40 to 39, Colonels leading. The Raiders scored 21 points in the fourth quarter and cut short the Colbnels hopes for victory. The find score was 55 to 60, the Appomattox Raiders on top. Mitch Eggleston and Bill Shorter scored up in the double figures - Mitch with 17 and Bill with 10. Tom Wingfield had eight points, ftonald Harvey had seven, James Robinson had six, and Gerald Booker had four. Joe Fraley ad Cecil Booker both added three points on the Raider score, and Tony Snell had two. For the Colonels, Tracy Poindexter had 24 points, E rrette Woodruff had 10, and no other Colonel scored in the double figures for the night. The Tuesday night game brought the Raiders to a 2 win, 3 loss situation while the Colonels are now 0 for 6. The Raiders had an excellent night from thé foul line, with a g62 precent average. The  Altavista team had a commen- I dable 44 percent, g The R aiders travel to g Jefferson Forest the 28th of  December for their last game of 76. In overall district stand ings, the Raiders are in 6th place and Jefferson Forest is 7th. Come on out and cheer t Raiders to victory!!!"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "55 to 60, the <mark>Appomattox</mark> <mark>Raiders</mark> on top. Mitch Eggleston"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "55 to 60, the <mark>Appomattox</mark> <mark>Raiders</mark> on top. Mitch Eggleston"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [147.32, 359.5, 317.79, 884.57], "bbox_id": "9ac8b645b0", "file": "TimesVirginian_1983a_0048.pdf", "page": 1, "text": "The Raider varsity basketball team lifted their district record to 10-6 last Tuesday with a 61-50 win over Liberty. The Raiders took the lead in the first quarter, leading 16-12 at the end of that period. In the second period. Liberty outscored the Raiders 16-10 to take a 28-26 lead into the locker room at the half. . The Raiders virtually shut down the Liberty offense in the third quarter, allowing Liberty only four points the entire period, while putting 14 on the board for themselves. Appomattox outscored Liberty 21-18 in the final period of play to ice the victory, 61-50. Rick Caldwell led Raider scorers with 17 points, including 15 in the fourth quarter. Jeff Miller also scored in double figures for the Raiders, with 15 points. M iller also added 12 rebounds to the Appomatox effort. Others scoring for the Raiders were Gary Fergus nine points, Ricky Miller eight points, Darwin Harvey eight points, Bobby Carter and Mike Jackson, with two points each. C arter also had eight rebounds for the Raiders. Appomattox hit 24 field goals and went 13 for 18 from the foul line against Liberty. .Liberty hit 22 field gods and was successful on six of sixffreethrow attempts. High scorers for Liberty -were Marvin Evans 12 points and Clarence Robinson 10 points. The Raiders were scheduled to day Rustburg at home Wednesday ana will travel to Buckingham Friday night. The Seminole District tournament is scheduled to b egin next Tuesday. Feb. 22 and will continue through Saturday. The tournament wOl be played at Rustburg High School."}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "eight rebounds for the <mark>Raiders</mark>. <mark>Appomattox</mark> hit 24 field goals"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "eight rebounds for the <mark>Raiders</mark>. <mark>Appomattox</mark> hit 24 field goals"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [486.95, 263.3, 630.8, 673.63], "bbox_id": "9cbee6bc12", "file": "AppomattoxNewspapers_1971-1973a_0287.pdf", "page": 1, "text": "The R u s tb u rg Red Devils scored a run in the sixth inn- ing to break a 4-4 tie and beat the Appomattox Raiders 5-4 in a Seminole District baseball game last Tuesday at Rustburg. i The loss gave Appomattox a 2- j 1 record. Both teams banged out six hits and made two errors. Ap pomattox scored three runs in the top of the first and Rust burg came back to score two. The Raiders then picked up another one in the second for a 4-2 lead only to see the Red Devils tie it at 4-4 in the bot tom of the second. Ricky Garrett led the Raid ers with three hits and drove in a run. Steve Almond, Jimmy Chandler and Joe Vaughan had the other Appomattox hits. Al mond, Chandler, Sammy Wad dell and Mike Gallier scored the runs and Vaughan, Chandler, and Almond had the other RBIs. Mike Floyd had a two run sin gle for the Red Devils in the second to tie the game. Phillips had two hits and drove in two runs for Rustburg. Robert Gamer was the win ning pitcher as he struck out 10 Raiders in going the distance. Dennis Wilkerson started for Appomattox and gave way to Ricky Garrett in the fourth. Garrett suffered the loss."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "tie and beat the <mark>Appomattox</mark> <mark>Raiders</mark> 5-4 in a Seminole"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "tie and beat the <mark>Appomattox</mark> <mark>Raiders</mark> 5-4 in a Seminole"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [399.09, 307.72, 550.89, 896.36], "bbox_id": "422d43ad00", "file": "AppomattoxNewspapers_1971-1973a_0478.pdf", "page": 1, "text": "The Nelson County Gover nors scored the first time they had the ball and then added another quick score in the sec ond quarter to beat the favor ed Appomattox Raiders 13-7 in a Seminole District football game last Saturday night at Appomattox. The lost gave the Raiders a 3-2 mark overall. Nelson County took the opening kickoff and started on their own 29 yard line and in 13 plays they went the 71 yards for the score, all on the ground. Beany C a m p b e l l scored the touchdown from one yard out with 541 left in the quarter. The extra point try failed and it was 6-0 Nelson. The Raiders took the lead in the second quarter as the  result of a 73 yard drive in six plays with quarterback Bobby Layne going the last five yards for the touchdown. Phillip Goode kicked the extra point  for a 7-6 Raider lead with 844 left in the half. Appomattox kicked off and Nelson returned it to their own 45 yard line. Campbell carried five yards and then Larry Rose on the next play went 50 yards for a score with 739 left in the half and Knight kicked the extra point for a 13-7 lead. Nelson had the ball on the one foot line as the half ended ready to score again but time ran out. The second half was mostly defense as the teams would get a first down or two and then have to punt. Larry Rose was the top ball carrier for Nelson with 154 yards rushing in 20 carries. Campbell had 81 and Ragland 58 to account for the total yards on the ground for them. Mike Gallier and Phillip Goode led the offense for Appomattox with 42 and 41"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "beat the favor ed <mark>Appomattox</mark> <mark>Raiders</mark> 13-7 in a Seminole"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "beat the favor ed <mark>Appomattox</mark> <mark>Raiders</mark> 13-7 in a Seminole"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1043.56, 277.36, 1187.21, 542.99], "bbox_id": "7e24344c77", "file": "TimesVirginian_1978_0462.pdf", "page": 1, "text": "The first place Appomattox Raiders will host the Jefferson Forest Caveliers in the annual homecoming game this Friday at 800 p.m. in Bragg Stadium. The Cavaliers bout a 4 and 2 Seminole District record and will be a tough opponent for the Raiders who are coming off a big win against Brookville last week. Raider Head Coach Stuart Justus is concerned about Jefferson Forest who he describes as big and _ in possession of a fast running back by the name of Jefferson. The Cavaliers have just two seniors in their starting offensive lineup but they cannot be taken lightly. The Raiders, who must win to remain in first place, will be looking for an overflow crowd for file 1978 Homecoming."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The first place <mark>Appomattox</mark> <mark>Raiders</mark> will host the Jefferson"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The first place <mark>Appomattox</mark> <mark>Raiders</mark> will host the Jefferson"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1632.48, 586.28, 1805.18, 1004.31], "bbox_id": "51e9bdfa14", "file": "TimesVirginian_1983a_0190.pdf", "page": 1, "text": "The farmers are busy getting their tobacco planted. Mr. and Mrs. Early Banton visited Mr. and Mrs. Pete Banton and Phillip Saturday night. Sunday visitors of Mr. and Mrs. Pete Banton and Phillip were Mr. and Mrs. Andy Mullins, Mr. and Mrs. Paul Mullins, Mrs. Kathy Evans and girls and Mrs. Garet Bosiger and Dana. Mrs. Henry Allen Garrett visited Mr. and Mrs. Robert Mayberry Wednesday afternoon. Mr. Robert Mayberry is in the hospital at Salem. We wish him a speedy recovery. Mr. and Mrs. Henry Mann visited Mr. and Mrs. Paul May Sunday afternoon. Mr. and Mrs. Nelson Mann and Mr. and Mrs. Jimmy Ford and Jason attended the Appomattox Raiders ball game in Covington Friday. Mrs. Nellie Nash, Lloyd Nash, Dawn Kerr, Cheryl Nash and Mike Mann visited Mr. Harmon Jennings Sunday afternoon. Cheryl Nash, of Lynchburg, spent Saturday night witn Dawn Kerr. Lloyd Nash, Mrs. Elliott Nash., Dawn Kerr and Mike Mann were supper guests of Mr. and Mrs. George D. Nash and family Sunday night of Lynchburg. Mrs. Richard Nash visited Mr. and Mrs. Clarence Gobble, of Appomattox. Sunday afternoon and Mr. and Mrs. Robert Allen.Guill, of RiehnvHid,-werOalso wish tog 4n the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "and Jason attended the <mark>Appomattox</mark> <mark>Raiders</mark> ball game in Covington"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "and Jason attended the <mark>Appomattox</mark> <mark>Raiders</mark> ball game in Covington"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [140.16, 1029.33, 308.44, 1630.7], "bbox_id": "3d85d0fd2d", "file": "TimesVirginian_1983a_0070.pdf", "page": 1, "text": "The basketball season which just ended will be remembered as the year when the Raiders came bsfck. It was a season which started off slowly, one til which the team dealt with adversity throughout the season and one, which, finally lowed a team with character strong enough to bring Appomattox to within a game of the Region HI championship The season started slowly for the Raiders, and at their Christmas break, there were some who lelt the team would not snap out of an early season slump. Appomattox had a 2 - 6 record when the Christmas break began. But! 3ut the first game after the break êtes a turning point forthe Raiders. Appomattox had fad Liberty almost the entire game. Then, with 40 seconds rematafaig, Liberty went ahead. But the Raiders fought back and won the game. The new year had started well for Appomattox. Following a big wht over Nelson County, the KSioors Went on a roll, winning eight in a row to wind up in the district tournament against Gretna the unbeaten regular-season Seminole District champs. The district tournament loss to Gretna was disappointing for the Rfiders. Btft, for the first time in 10 years, Appomattox would go into the Regional IH tournament by virtue of its second place Seminole District tournament finish.. It was a season where we was behind to Start with, hi terms of practice time, noted Raider coach Cdly Dickerson. We lost some toMh games at Ufa start of the semon by one or two points. But the players showed their character. They overcame adversity through out the season. Dickerson told his team to forget thé Seminole District tournament kiss to Gretna. That was behind us and I wanted the team to concentrate on the regionals. The players were tight in the opining gam eof the regionals against Laurel Park and it to d some not-so-subtle halftime prod- from Dickerson to get the"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "a turning point forthe <mark>Raiders</mark>. <mark>Appomattox</mark> had fad Liberty almost"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "a turning point forthe <mark>Raiders</mark>. <mark>Appomattox</mark> had fad Liberty almost"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [282.67, 755.17, 432.04, 1129.95], "bbox_id": "276967f137", "file": "TimesVirginian_1978_0510.pdf", "page": 1, "text": "The Appomattox Raiders will meet Bassett High School, a wild card from the Piedmont District, in the opening game of the Region 3 semi-finals this Friday k t 800 p.m. in Lynchburg City Stadium. Fiel- dale-Collinsville will host Alle ghany High School of the Blue Ridge District in the other semi-final game Saturday at 130 p.m. Tickets for the Appomattox- Bassett game will be 2.00 for adults and students and advance sales will be held at the High School, Friday, 1145 until 115. A win Mgr the Raiders will tate the Bugimi 6  finals on Saturday, November 18. If the opponent is Fieldale-Collinsville they will be the host team, however a game between Appomattox and Alleghany would be playéd in Lynchburg. A state semi-final game between the winners of Region 3 and Region 4 will be played on Saturday, November 25. Make plans now and continue to support the Raiders in their bid for a state Group AA championship."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> will meet Bassett High"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> will meet Bassett High"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1839.29, 302.9, 1993.36, 768.63], "bbox_id": "796e536796", "file": "TimesVirginian_1978_0009.pdf", "page": 1, "text": "The Appomattox Raiders will  play host to the Rustburg Red Devils Friday night and will be looking for the upset that could  start a string of victories for the local team. Coach Ray Archer would like ! to see the stands full for this important Seminole District contest.  Starting for the Raiders will be Captains Joe Fraley and Gerald Booker, along with Larry Kelso. Carl.Watson and Arthur Haskins, who has replaced Marvin Clark in the  starting line-up? Should one of the guards get into foul trouble or need a rest, Archer will call on Byron Roach a sophomore, who Archer calls, his sixth man. After three wins followed by three losses. Archer says, We dont have any changes that we really need to make. JNeve played good ball in every game weve been in. We have matched our opponents in field goals in two of our three losses, but lost the game at the free throw line. We have made simple mistakes, such as a technical fouljtrhich followed a personal foul in the Altavista game and resulted in five quick points and a win for Altavista. ! Coach Archer feels that as the players gain experience and maturity a lot of these mistakes will disappear. One key to the Raiders success or failure in their remaining games will be their"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> will  play host to"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> will  play host to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1358.65, 297.36, 1530.86, 746.09], "bbox_id": "fe32908d47", "file": "TimesVirginian_1983a_0323.pdf", "page": 1, "text": "The Appomattox Raiders we athered a strong second-half comeback by a scrappy Randoiph- Henry team to preserve a 28-22 non-district victory in the Raiders second game of this season Friday night. Raider quarterback Paul Johnson got the Appomattox teams initial six points in the first quarter on a one-yard plunge into the Randoiph- Henry end zone. The point-after touchdown kick by Kevin Kendrick was unsuccessful. The rest of the evenings scoring for the Raiders came compliments of Steve Boo Hamlett, the Raiders lightening-quick tailback. Hamlett scored on runs of three yards and one yard in the second quarter, and on a five-yard scamper in the third qiuurter. The Raiders got two points on a conversion pass from Johnson to Tyrone Abbitt, and two more on conversion kicks by Kendrick. Randoiph-Henry began to battle back, scoring late in the second quarter, and carrying the momen tum of that score with them through half time and into the second half. The Statesmen used a mixture of well-executed pass plays and quick hitting running plays to whittle away at the Appomattox lead. Randoiph-Henry scored twice in the third quarter and appeared on the- way to a fourth score in the final period of play, but the Raider defense utilized opportunities such as fumble recoveries and intercep tions to halt the Statesmens momentum. Appomattoxs offense gained possession after a stalled"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> we athered a strong"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> we athered a strong"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1923.22, 750.54, 2451.81, 851.01], "bbox_id": "ea8e65c1e4", "file": "TimesVirginian_1980a_0268.pdf", "page": 1, "text": "THE APPOMATTOX RAIDERS VARSITY FOOTB ALL TEAM was busy last week preparing for the upcoming fall foot ball Reason. The Raiders season opener is Sept. 5 against Gretna at home. This Friday night fans will get a chance to see Raiders in action as Appomattox will host a Football Jamboree. Amherst. Chatham, Randolph-Henry, and the Raiders will play 30-minute periods against each other, under actual game conditions. The event will start at 7 p.m. at the-Ap pomattox Middle School field and is expected to end at 11 p.m. Admission is 3.tt0. Plans set for tocal MD telethon"}, "highlight": {"text": {"matched_tokens": ["APPOMATTOX", "RAIDERS"], "snippet": "THE <mark>APPOMATTOX</mark> <mark>RAIDERS</mark> VARSITY FOOTB ALL TEAM"}}, "highlights": [{"field": "text", "matched_tokens": ["APPOMATTOX", "RAIDERS"], "snippet": "THE <mark>APPOMATTOX</mark> <mark>RAIDERS</mark> VARSITY FOOTB ALL TEAM"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1337.78, 612.6, 1467.86, 734.94], "bbox_id": "c4b9de5055", "file": "TimesVirginian_1980a_0109.pdf", "page": 1, "text": "The Appomattox Raiders varsity baseball team jost its season opener last week to .the Gretna Hawks, 4-2. The game was a tight pitchere duel with Appo mattox leading 2-1, until the top of the seventh inning, when Gretna scored three unearned runs to ice the game. The"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> varsity baseball team jost"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> varsity baseball team jost"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [134.64, 651.98, 274.77, 982.37], "bbox_id": "5302a6d4ea", "file": "TimesVirginian_1978_0473.pdf", "page": 1, "text": "The Appomattox Raiders treated a large homecoming crowd to one of their best offen sive performances in Bragg Stadium Friday night when they won an important Seminole District contest 49-21. Joe Fraley and Darrell Schrock put on an exciting aerial show as Schrock pulled in seven passes, four for touch downs. Fraley completed twelve of nineteen attempts for 231 yards and five touchdowns. Terry Woods and Andrew Kelso kept the Cavalier defense honest by rushing for 96 and 96 yards respectively. In the first period, Jefferson Forest failed to move the ball and the Raiders blocked a Cavalier punt gaining possession at the Cavalier 23 yard line. Appomattox kept the ball on the ground with Kelso scoring from the eleven yard line with 818 left in the quarter. Thrpe minutes later Fraley hit Schrock with a touchdown pass covering 57 yards. Still in the first period Fraley and Woods teamed on a 40 yard TD pass, Freddie Mitchell kicked two ex tra points and the Raiders led"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> treated a large homecoming"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> treated a large homecoming"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [334.07, 405.66, 482.98, 1060.49], "bbox_id": "447dffcfcf", "file": "AppomattoxNewspapers_1971-1973a_0592.pdf", "page": 1, "text": "The Appomattox Raiders took part in the William Byrd Christmas Invitational Basket ball Tournament last week end in Vinton and came home a winner. The Raiders had to fight back in an overtime period to beat Glenvar in the opening round 76-74 on Thursday night and then took Lord Botetourt 73-47 in the championship game on Friday night. The win Friday night ran the Appomattox record to 7-0 overall. In Thursdays night game  against Glenvar, the Raiders led 21-20 at the end of the first quarter, 42-33 at the half and trailed 55-52 at the end of the third quarter. It was tied at 70-70 at the end of the regulation time. Appomattox led by as much as 13 points in the second quarter, but Glenvar hit on 11 of 15 shots from the floor in the third quarter for 22 points while the Raiders went cold and got only ten points in that quarter. In the first quarter Bobby Layne got 12 of the Raiders 21 points as he hit five for five from the floor and two foul shots. Mark Eggleston, the Raiders sixth man, came off the bench and finished the game with 13 points, nine in the second half, and gave the Raiders a big four point lead in the overtime as he made two foul shots with 15 seconds left in the game. Dennis Totty and Sammy Waddell had the other two baskets in the overtime, both hitting on clutch shots. Layne led the Raiders with 22 points and big Leon Robinson had 19 points and 15 rebounds. Eggleston was next with 13, Sammy Waddell had eight and Dennis Totty had seven along with Kenneth Gafford. Totty also had eight rebounds. In the championship game, it looked like the Raiders had their hands full as it was tied 10-10 after a quarter of play 20-26 at the half and the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> took part in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> took part in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [475.71, 317.25, 620.22, 993.41], "bbox_id": "c7beb31a24", "file": "AppomattoxNewspapers_1971-1973a_0231.pdf", "page": 1, "text": "The Appomattox Raiders shot almost 80 from the floor in the fourth quarter as they scored 35 points to break open what had been a close game at times and beat the Gretna Hawks 87-66 in the semi-finals of the Seminole District basketball tournament last Wednesday night at Lynch burg College. The victory put the Raiders in the championship game against Altavista and also will send them to theregionals. Gretna got off toan 18-15lead in the first quarter as they shot 67 to 33 for the Raiders in the opening quarter. The Hawks jumped to a quick 8-0 lead be fore Appomattox could s c o r e with about five and a half min utes left in the quarter. At the start of the second quarter,Dav id Johnson hit a three-point play to tie it at 18-18. It was tied at 20-20 and then Ricky Garrett got a three point play for a 23-20 as the Raiders then outscored the Hawks 22-9 in the second quarter and took a 37-27 half time lead. Garrett had n in e points in that quarter and John son seven. Gretna outscored the R a i d e r s 20 - 15 in the t h i r d quarter and cut the lead to 52-47 after three quarters. The Hawks came to within two points 45- 43 but the Raiders went back to the five point lead at the end of the period. In the last quarter, Appomattox took command at ! the start, and then powered it on  as Garrett, Johnson, Sammy Waddell and Leon Robinson each hit three field goals and they hit 14 of 18 shots from the floor and scored 35 points in that quarter I to 19 for the Hawks. Ricky Garrett led all scorers as he hit for 21 points coming on eight of 17 shots and five of six free throws. Leon Robinson was next with 19 on eight of 13 and three free throws. Ken Gaf- ford had 18, hitting eight of 17 and David Johnson 17 coming on eight of 12 shots. Gafford, Garrett and Sam Waddell each had five assist. Robinson pulled down 22 rebounds, followed by Garrett with 16 and Gafford 10. Kenny Gaddy led Gretna with 18 points and Tyrone Kelly and Kim Felts had 12 and 10, re spectively. The Raiders hit 51 for the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> shot almost 80 from"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> shot almost 80 from"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [595.23, 298.6, 738.62, 597.58], "bbox_id": "5d47e218f6", "file": "TimesVirginian_1978_0479.pdf", "page": 1, "text": "The Appomattox Raiders moved one step closer to a Seminole District title with a 41-7 victory over Libertys Minutemen on the losers field Friday night. Jefferson Forest dealt Am herst County a heart breaking blow to their title hopes by holding on to defeat the Lancers 27-25. Terry Woods dominated the Appomattox running attack by rushing for 115 yards and two touchdowns. Woods has now passed the 1000 yard mark for the season. Joe Fraley completed 6 of 10 pass attempts for 68 yards and two touchdowns. Darrell Sch- rock was on the receiving end of both TD passes. The Raider offensive line did an outstanding job for Coach Stuart Justus with Chris Johnson, Kevin OBrien, Ron nie Abernathy, Myron McCoy, Gus Paulette and Donald"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> moved one step closer"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> moved one step closer"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [477.3, 1077.96, 621.07, 1329.15], "bbox_id": "46fd2157f3", "file": "AppomattoxNewspapers_1971-1973a_0628.pdf", "page": 1, "text": "The Appomattox Raiders jumped to a 57-25 halftime lead and the reserves continued the rout in the second half as they gunned down the Staunton River Golden Eagles 100-55 in a Seminole District basketball game last Friday night in a game played at Appomattox. The victory gives the Raiders a 11-0 mark in the district and 14-1 overall and Staunton fell to 1-14. The Raiders hopped to a quick 32-10 lead at the end of the first quarter behind the shooting of their two big men, Leon Robinson and Dennis Totty. Robinson had 13 in that quarter and Totty nine. It was 57-25 at the half as Robinson hit for nine more to give him 22 at the half. In their third quarter the reserves did most"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> jumped to a 57-25"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> jumped to a 57-25"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [922.75, 302.18, 1060.52, 924.91], "bbox_id": "9a35e45b7f", "file": "AppomattoxNewspapers_1971-1973a_0635.pdf", "page": 1, "text": "The Appomattox Raiders is one of the finest basketball teams that I have ever seen. To have such a winning season as the Raiders are enjoying there has to be basketball know-how, training, teamwork, skill, and tremendous motiva tion. Their coach has done a good job of injecting all of this into these players week by week. The Raiders train in their gym that is located at Appo mattox County High School. They have viewed films, ex ercised, studied, and practiced the fine art of teamwork. Their basketball experiences are not confined just to that gym. They have to get out into the gyms of this entire area and play the game for real. Our church house is located at 100 Church Street and is a lot like the training area for the Raiders. At the church house we learn how God expects us to serve him as we study the Bible. We learn from others how they are doing the job. We fellowship with other Christians and develop team spirit. Unfortunately, many limit their Christian activity to their experiences only at the church house. They completely misunderstand the work of the church in organizing training, and preparing Christians for their part in the game of life throughout this entire area. If we are to have a success ful season as we play out on the field of life, we must understand what the church house is for take advantage of every opportunity to grow, and then in our homes, schools, our places of work, and our leisure time demonstrate the Christian life in our walk and in our talk. On the church team, lets have a good year and run the Christian race as effectively as the Appomattox Raiders play basketball well into this"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> is one of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> is one of the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [409.2, 293.64, 557.4, 967.61], "bbox_id": "b7981454ab", "file": "AppomattoxNewspapers_1971-1973a_0163.pdf", "page": 1, "text": "The Appomattox Raiders got off to a 15-2 lead in the first quarter and went on to beat the Rustburg Red Devils 49-43 last Tuesday night i n a S e m i n o l e I D istrict basketball game played at Appomattox. The win upped the Raiders record to 4-1 ov erall and 3-1 in the d istrict. Appomattox got off to a 15-2 lead in the first quarter as Ricky  G arrett pumped in seven points. i Rustburg did not get on the scoreboard until about two min utes left in the quarter. They j shot two foul shots with 247 to go, but did not make them. It was 25-9 at the half as L e o n Robinson hit for eight of the Raiders 10 points in the second quarter. The R aiders defense forced 13 turnovers in the first half as they completely proved too much for the Red Devils. In the second half, Rustburg controlled the game by slowing the ball down and playing for the good shot as they outscored Ap- ! pomattox 12-8 in the t h i r d quarter, but Appomattox still j led 33-21. Most all of the Raid- j e rs saw action in the fourth i quarter Rustburg outscored the Appomattox team again 22- j 16. The Raiders hit 19 of 51 shots  from the floor for about 37and  Rustburg hit 16 of 49 for about 33. In turnovers, Appomattox made 14, mostly in the second half and Rustburg made 16, most of theirs in the first half. Appo- I mattox outrebounded Rustburg I 33-26. Leon Robinson led the Raid-  ers in scoring with 17 points and Ricky G arrett was the only ! other Appomattox in double fig ures until 12. Alton Turner was the only Rustburg man to hit double fig ures with 19, 12 coming in the last quarter. Rustburg  2 7 12 22  43 Appomat 15 10 8 16  49 APPO SCORING G F T Robinson 7 3-6 17 G arrett 4 4-7 12 Gafford 2 1-1 5 Waddell 1 1-3 3 Johnson 0 0-2 0 Chambers 1 0-1 2 Austin 1 0-0 2 E ggleston 1 0-1 2"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> got off to a"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> got off to a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [473.5, 365.2, 622.43, 953.39], "bbox_id": "69ac1695db", "file": "AppomattoxNewspapers_1971-1973a_0585.pdf", "page": 1, "text": "The Appomattox Raiders got by a shaky start and had a big second quarter and went on to beat the Staunton River Gold en Eagles 73-64 last Tuesday night in a Seminole District basketball game played at Staunton River. The win gives the Raiders a 5-0 mark overall and 4-0 in the district. Staunton River got off to a 13-12 lead in the first quarter, but a 25 point second quarter for the Raiders gave them a 40-28 halftime lead. Appomat tox made it 59-42 after three quarters and the reserves saw a lot of action then. The Raiders controlled the rebounds as they pulled down 45 to 24 for the Golden Eagles and the Raiders shot a hot 48 from the floor to a not so bad 44 for Staunton River. Bobby Layne led the Raiders in scoring with 18 points and played a good defensive game also. He was followed by Leon Robinson with 14 points and also 14 rebounds and Kenneth Gaffordk had 11 to round out the double figure men for Appomattox. Ricky Morgan led the Golden Eagles and was also game top scorer with 23 points. He was closely followed by Dave Nichols with 22 and Calvin Holdren with 10. Dennis Totty proved to be one of the top rebounders for the Raiders in helping them control the boards. In the shooting, both Robinson and Layne shot over 50 from the floor. The Raiders had 15 turn overs while the Golden Eagles had 12. The Raiders will play December the 28th and 29th in a Christmas Tournament Roanoke at 8 p.m."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> got by a shaky"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> got by a shaky"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [489.08, 265.11, 634.77, 579.9], "bbox_id": "6c738850c9", "file": "AppomattoxNewspapers_1971-1973a_0307.pdf", "page": 1, "text": "The Appomattox Raiders ex ploded for four runs in the sixth inning to break a 2-2 tie and then  went on to beat the William ! Campbell Generals 7-2 in a Seminole District b a s e b a l l game last Monday at William ! Campbell. The win gives the Raiders a 4-2 mark and dropped WC to 2-5. Both teams got runs in the first and fourth innings to be tied a 2-2. The Raiders then loaded the bases in the sixth and Steve Almond tripled to send three home and then scored himself for the fourth run. They then added another in the seventh. It was his second hit of the game. Mike Gallier, Jimmy Chandler and Sammy Waddell also had two hits each. The Raiders got a to tal of 10 hits. Rudder led theWC attack with two of their six hits. A l m o n d was the winning pitcher as he got his third win of the year without a loss. Pur cell was the loser. Appo  100 104 1  7 10 0 WC  100 100 0  2 6 3"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> ex ploded for four"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> ex ploded for four"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1811.26, 880.82, 1950.76, 964.02], "bbox_id": "83a543be88", "file": "AppomattoxNewspapers_1971-1973a_0059.pdf", "page": 1, "text": "The Appomattox Raiders de cisive and shocking, to the ex perts victory over Gretna Fri day night gives the Raiders a 3-1 overall win-loss standing in the Seminole District with a 1-1 standing in Seminole District Conference play."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> de cisive and shocking,"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> de cisive and shocking,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1519.21, 670.59, 2031.0, 1117.46], "bbox_id": "8d6eed5244", "file": "AppomattoxNewspapers_1971-1973a_0619.pdf", "page": 1, "text": "The Appomattox Raiders built up a 10 point first quarter lead and went on to beat the Nelson County Governors by the same margin, 63-53 last Friday night in a Seminole District basketball game play ed at Nelson. The win gives the Raiders a 12-1 mark overall and a 9-0 record in the district. The lost dropped Nelson to 8-6 overall and 7-4 in district. The Raiders got off to a 19-9 lead in the first quarter, but it was 30-24 at the half as Nelson outscored the Raiders 15-11 in that quarter. The Raiders then outscored Nelson 14-7 in the third quarter for a 13 point lead, 44-31, going into the last quarter. William Napper, the districts leading scorer, continued his scoring ways as he ripped the nets for 32 points, 16 in the last quarter, to take game honors. Keith Haywood added 13 as the only other Nelson player to hit in double figures. They conbined for 45 of the Governors points. Dennis Totty, a 6-7 senior, having one of his best nights of the season was high scorer for the Raiders with 18 noints -J"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> built up a 10"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> built up a 10"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [314.15, 326.53, 459.22, 957.91], "bbox_id": "ce8014c8df", "file": "AppomattoxNewspapers_1971-1973a_0615.pdf", "page": 1, "text": "The Appomattox Raiders beat the Gretna Hawks 52-39 last Friday night in a Seminole District basketball game play ed at Appomattox. The victory gives the Raiders a 7-0 mark in the district and 10-1 overall. They lead the district while Gretna dropped to fifth place with a 5-3 league mark and 6-5 overall. The Hawks tried a slow down brand of play and it i seemed to work for the first  half as the score was tied 10-10  after a quarter of play and the I Raiders only led by two, 19 17 at the half. In the second half the slow down game changed a  little as the Raiders made the j Hawks make mistakes and took advantage of them for a 31-23 lead at the end of the third quarter. This led to more Hawk mistakes as they had to play catch-up ball and Appo- mattox kept taking advantage of them and outscored the Hawks 21-16 in the last quarter. Bobby Layne led the Raiders and all scorers with 24 points, 15 in the second half as he hit I seven of nine from the floor,  five of five in the last quarter. Leon Robinson was the only other Raider in double figures with 16, 10 coming in the last quarter as he and Layne com bined to score all 21 of the Raider points. Tyrone Kelly led the Hawks in scoring with 12 points and Ivan Minter had 10, all coming in the last half. The Raiders hit 50 from the floor, 23 of 46 shots to 40 for the Hawks who hit on 17 of 42 attempts. The Appomattox team hauled down 28 rebounds to 12 for the Hawks as Robin son and Layne had nine and eight rebounds respectively. Appomattox had 20 turnovers to 19 for Gretna, but the Raid ers did a better job of taking advantage of the mistakes, and Appomattox had 11 loose ball"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> beat the Gretna Hawks"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> beat the Gretna Hawks"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.62, 312.65, 1727.0, 660.54], "bbox_id": "a9484701e2", "file": "AppomattoxNewspapers_1971-1973a_0317.pdf", "page": 1, "text": "The Appomattox Raiders, be hind the pitching of Dennis Wilkerson and power hitting of Steve Almond, bet the Gretna Hawks 8-1 in a Seminole Dis trict baseball game played at Appomattox last Thursday. The win gave the Raiders a 7-4 mark so for this year. Gretna scored in the top of the first for a 1-0 led, but Appo mattox came back in the bottom of the first to get three as Almond hit a three run homer It was Appomattox from there on as they scored once more in the second, three more in the fourth and the last run coming in the sixth. Wilkerson only allowed one hit to the Hawks and also helped his teammates with the bat as be go t three hits. Almond and Bill Austin followed with two hits each. John Moon had Gretnas only hit as Wilkerson had things pretty much in control except for one other inning when he loaded the bases but worked out of the jam. Gretna - 100 000 0 - 1 1 4 Appo - 310 301 - - 8 12 4"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark>, be hind the pitching"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark>, be hind the pitching"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2225.05, 1191.66, 2364.92, 1371.52], "bbox_id": "45e4f6ef4b", "file": "AppomattoxNewspapers_1974-1975a_0478.pdf", "page": 1, "text": "The Appomattox Raiders - Nelson County High School football game game originally scheduled for 8 p-m. Friday night at Nelson County Athletic Field has been rescheduled and piny will begin at 7 pan., according to an announcement from Jerry Robinson. A CHS Athletic Director. Make plans to attend this important Seminole District game on Friday night and help riioost the Raiders to one more win! Remember  game time is 7 pjn."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> - Nelson County High School"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> <mark>Raiders</mark> - Nelson County High School"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2026.5, 259.65, 2174.69, 832.53], "bbox_id": "58e4b06071", "file": "AppomattoxNewspapers_1974-1975a_0073.pdf", "page": 1, "text": "Some questionable calls from the officials and a couple of poorly executed plays may have cost the Appomattox Raiders third place in the Seminole District football race as they dropped a 14-6 decision to Rustburg Friday night. The Red Devils scored in the second quarter on a 56 yard pass from Kenneth Tweedy to James Trent, and in the fourth quarter Mark Wright threw a six yard scoring strike to Gary Anthony. Wright then passed to Willie Clark for the two point conversion. The Raiders only score came a 58 yard pass from Mac Weaver to Ricky Wingfield on the first play from scrimmage following Rustburgs second touchdown. . Coach Jerry Robinson said, I would just like to have one over. I called a pass play on a second down and three situation. I think the play was but it was not executed very well and Rustburg intercepted. I gave that a lot of thought over the week end and I probably would have called the same play anyway, but I would just like to have the . chance to run it over. Robinson declined to com ment on the role the officials played in the contest, saying only, Both teams were hurt by penalties. I thought there were to many flags thrown all night, but I cant say that we were hurt any more than Rustburg was. Actually there were two very questionable plays. The two point conversion pass caught by Clark left doubt in many fans, Rustburg fans included, as to whether Clark w  u ..... Is when he caught the ball. The senior flanker juggled the ball a number of times before finally dropping it some"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "may have cost the <mark>Appomattox</mark> <mark>Raiders</mark> third place in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "may have cost the <mark>Appomattox</mark> <mark>Raiders</mark> third place in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [770.9, 232.28, 915.67, 594.51], "bbox_id": "9e3d8c55d6", "file": "AppomattoxNewspapers_1971-1973a_0231.pdf", "page": 1, "text": "scored last. Altavista put all five of their starters in double figures with big Mike. Cook getting 22 points to lead his club. He was follow ed by Jerome Pannell with 16, Roney Tanks with 13, Ike Mon roe with 12 and Hoot Peavey with 10. Bobby Layne tied Cook for game scoring honors as he collected 22 points also. Ricky Garrett was next with 15 and Leon Robinson and David John son each got 10. Sammy Wad dell accounted for the other 8. The turning point was the Colonels hot-shooting from the floor as they hit about 52 on 33 of 64 shots. The Raiders had hit better than 50 in the first two tournament games, but managed only about a 37 mark o n 27 of 73 for the championship game. Both teams were at 39 rebounds apiece with Robinson getting 15 for Appo mattox and Garrett and Layne getting 10 and seven respective ly for the Raiders. Appomattox made only 13 turnovers to Altavista 16. Both teams earned a place I in the Western Regionals to be held at Lynchburg College this"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "respective ly for the <mark>Raiders</mark>. <mark>Appomattox</mark> made only 13 turnovers"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "respective ly for the <mark>Raiders</mark>. <mark>Appomattox</mark> made only 13 turnovers"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1834.3, 812.28, 1956.47, 855.43], "bbox_id": "7b407b8458", "file": "TimesVirginian_1976_0322.pdf", "page": 1, "text": "SALE OF APPOMATTOX RAIDERS SEASON FOOTBALL TICKETS CONTINUES"}, "highlight": {"text": {"matched_tokens": ["APPOMATTOX", "RAIDERS"], "snippet": "SALE OF <mark>APPOMATTOX</mark> <mark>RAIDERS</mark> SEASON FOOTBALL TICKETS CONTINUES"}}, "highlights": [{"field": "text", "matched_tokens": ["APPOMATTOX", "RAIDERS"], "snippet": "SALE OF <mark>APPOMATTOX</mark> <mark>RAIDERS</mark> SEASON FOOTBALL TICKETS CONTINUES"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [369.59, 289.29, 511.29, 814.51], "bbox_id": "06f3d4eab5", "file": "AppomattoxNewspapers_1974-1975a_0040.pdf", "page": 1, "text": "Russell Henderson unleashed an air attack against the Appomattox Raiders which carried the Amherst Lancers to a 26-6 Seminole District foot ball win Friday night. The 6-3, 195 pound senior completed 15 of 26 passes for 129 yards and two touchdowns as the Raiders defensive unit refused to yield to the usually potent ground game of the Lancers. The Raiders only score came on a 12 yard pass from Mac Weaver to Ricky Wingfield with just six seconds left to play in the game. Prior to the touchdown drive, Appomattox crossed midfield only once when Weaver passed 15 yards to Wingfield for a first down on the Amherst 48. The drive stalled there as three passes fell incomplete and Mitch Eggleston was forced to punt on the fourth down. Amherst scored with 328 left in the first period when Ricky Simmons was caught in his own end zone by Donnie Sandidge. The Raiders had just piade a goal line stand to deny Amherst a touchdown as Flip Jamersonand Warren Coleman stopped Russell Agnew for a two yard losses on a fourth down and goal to go situation from the one yard line. With 734 left in the half, Amherst finally got its first touchdown when Larry Hughes scampered 20 yards on a double reverse that caught the Appo- mattox defenders moving away from the football. The Raiders defense stiffen ed after the touchdown, but Appomattox could not get an offensive underway. With 109 left in the half, Mike Powell"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "air attack against the <mark>Appomattox</mark> <mark>Raiders</mark> which carried the Amherst"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "air attack against the <mark>Appomattox</mark> <mark>Raiders</mark> which carried the Amherst"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [490.78, 653.9, 630.68, 832.34], "bbox_id": "02c5d17b54", "file": "AppomattoxNewspapers_1971-1973a_0307.pdf", "page": 1, "text": "Ricky G arrett threw a two hitter and struck out 15 batters as the Appomattox Raiders beat the Nelson County Governors 11-3 in a Seminole District baseball game played at Appo mattox last Tuesday. The vict ory gives the Raiders a 5-2 .mark. Steve Almond and Dennis Wil- kerson supplied the h i t t i n g power as each of them hit three run homers. Wilkerson got his in a five run first inning and Al mond connected in a five run third inning. Almond led the Raider attack"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "15 batters as the <mark>Appomattox</mark> <mark>Raiders</mark> beat the Nelson County"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "15 batters as the <mark>Appomattox</mark> <mark>Raiders</mark> beat the Nelson County"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [360.94, 235.34, 2061.11, 618.78], "bbox_id": "8e4466bf99", "file": "AppomattoxNewspapers_1971-1973a_0284.pdf", "page": 1, "text": "Regular preaching was held at the First Baptist Church Smday at 11 a.m. Rev. Murray spoke from the subject He is Risen, - - - The Appomattox Raiders took  advantage of seven Alta vista er rors for a 6-3 win in a Seminole District baseball game last Fri day at Altavista. The win made the Raiders 2-0 and dropped the Colonels to a 0-4 mark for the season. The Raiders scored twice in the second, twice in the third and once in the six and seventh. Altavista got theirs in third as they scored two times and then added another in the fifth. Appomattox collected six hits as six different men got them. They were Ricky Garrett, Bill Austin, Steve Almond, Jimmy Chandler, Dennis Wilkerson, and Bobby Layne. The Raider playedat Appomattox. The I runs were scored by Garrett, Iropped the Generals to a Almond, Chandler, Wilkerson lark for the season. and Layne two times, nnis Wilkerson did the Steve Almondstartedpitching ig for the Raiders and went for the Raiders and got thevic- istance in striking out 13 tory, but needed help from Ricky als and allowing only two Garrett in the fourth. The Raid- He also scored one of the ers led 4-2 after three innings, r runs. but the lead was cut to 4-3 after lomattox scored first in five. Billy Taylor had a two cond and added another in run single in the third for Al- lurthfor a 2-0 lead as Gen- tavista and Poindexter had the srrors were costly in both other RBI. The other Colonel"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "He is Risen, - - - The <mark>Appomattox</mark> <mark>Raiders</mark> took  advantage of seven"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "He is Risen, - - - The <mark>Appomattox</mark> <mark>Raiders</mark> took  advantage of seven"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1583.28, 202.41, 1728.22, 506.63], "bbox_id": "85cb7f736b", "file": "AppomattoxNewspapers_1971-1973a_0241.pdf", "page": 1, "text": "Raiders Beal Addison 63-61, Make Finals The Appomattox Raiders broke a tie in the last 30 seconds of the game and went on to beat Lucy Addison High School 63- 61 In the Semi-finals of the Re gional in, AA basketball tourn- ment at Lynchburg College last Friday night. The win moved the Raiders into the finals against Chatham, who beat Wil liam Byrd in the second game. The first quarter was close all the way as the score was. tied three times Addison ending the quarter with a spurt to take a 15-11 lead. In the second quarter it was all Appomattox as they outscored Addison 24-14 for a 35-29 half time lead as Ricky Garrett drove the length of the floor with four seconds showing for a layup as the buz - zer sounded to give Appomattox"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "63-61, Make Finals The <mark>Appomattox</mark> <mark>Raiders</mark> broke a tie in"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "63-61, Make Finals The <mark>Appomattox</mark> <mark>Raiders</mark> broke a tie in"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [412.1, 322.69, 557.33, 934.17], "bbox_id": "b90de0c49e", "file": "AppomattoxNewspapers_1971-1973a_0510.pdf", "page": 1, "text": "Phillip Goode ran for two touchdowns and Bobby Layne passed for two more to go along with a big 89 yard kickoff re turn by Mike Gallier to give the Appomattox Raiders a 39-20 football win over the Rustburg Red Devils last Friday night at Rustburg. The Raiders are now 5-3 overall and 3-2 in the Semi nole District and Rustburg is 5-3 overall now. The second time Rustburg got the ball in the first quarter they marched from their own 27 yard line for a score. The drive cov ered 73 yards in 12 plays with Gary Garner scoring on a one yard plunage with 243 left in quarter and then kicked the ex tra point for a 7-0 lead. In the second quarter Garner scored on a four yard run with 30 sec onds left in the half for a 13-0 lead as the extra point failed. Rustburg then kicked off and Mike Gallier took it for Appo mattox on their own 11 yard line and went 89 yards for the score behind a lot of key blocks and Glenn Doss ran the extra point with 24 left in the half and Rust burg leading now only 13-8. It was all Appomattox in the second half as they outscored Rustburg 31-7. The R a i d e r s took the kickoff and started on their own 41 yard line and five plays later with 959 left in the quarter Bobby Layne hit Bill Austin, who made a great catch between two Rustburg defend ers, and scored on 37 yard play. Layne run for the two point con version and Appomattox took the lead at 16-i3. The Raider de fense held the Red Devils on the Appomattox 43 and seven plays later Layne hit Glenn Doss on the other end of a 33 yard pass play with 502 still left in the third quarter. Phillip Goode ran the extra point and it was 24-13. The drive covered 57 yards. Rustburg then mounted a 57 yd. scoring drive and with 202 still in the quarter Garner scored his third touchdown of the night"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Gallier to give the <mark>Appomattox</mark> <mark>Raiders</mark> a 39-20 football win"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Gallier to give the <mark>Appomattox</mark> <mark>Raiders</mark> a 39-20 football win"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [760.09, 621.63, 903.44, 964.21], "bbox_id": "747d06bca0", "file": "AppomattoxNewspapers_1974-1975a_0253.pdf", "page": 1, "text": "On April 9, the Appomattox Raiders tied a District Track Meet with Altavisita, 68-68. In the long jump, Reynolds took 2nd place and Lifford had 3rd. Reynolds also took 2nd in the Triple Jump, while Wade took 2nd and Jamerson took 3rd in the shotput. In the High Jump, Ford took 3rd place, in the pole vault he took 1st, and Baxter took 2nd. Simmons came in 2nd throwing the discus, while Baxter took 2nd and T. Wingfield got 3rd in the 120 yd. High Hurdles. In the 100 yd. dash, Simmons tied for 1st place, while Richard Fergu son came in 1st on the mile run. In the 880 Relay, Lipford. Bowers, Reynolds and Ford took first. In the Intermediate Hurdles, Baxter took first and T. Wingfield had 3rd, while in the 440, Simmons took 1st and R. Wingfield took 3rd. In the 880 Richard Ferguson took 2nd, in the 220, Lipford tied for 2nd, and Dennis Thomas ran 1st in the 2 mile. The Mile Relay was won by Tommy Wingfield, David Baxter, Ricky Simmons, and RickyWffigfESHT."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "On April 9, the <mark>Appomattox</mark> <mark>Raiders</mark> tied a District Track"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "On April 9, the <mark>Appomattox</mark> <mark>Raiders</mark> tied a District Track"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.64, 277.85, 1647.53, 444.8], "bbox_id": "380cd75261", "file": "AppomattoxNewspapers_1971-1973a_0059.pdf", "page": 1, "text": "Mike McCormick, a star left halfback for the Appomattox Raiders is this weeks leader in the Seminole District scoring race with a grand total of 42 points, 1 touchdowns. Last week McCormick was ony in third place with 30 points 5 touchdowns. However, tiiis week McCormick gathered a full head of steam when the Raiders defeated the Gretna Hawks, 15-0, in a Seminole game Friday. In this game Mc Cormick scored the two deci sive touchdowns which gave him the lead in the district scoring race."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "left halfback for the <mark>Appomattox</mark> <mark>Raiders</mark> is this weeks leader"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "left halfback for the <mark>Appomattox</mark> <mark>Raiders</mark> is this weeks leader"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [476.14, 975.64, 617.14, 1274.82], "bbox_id": "cf17634dd6", "file": "AppomattoxNewspapers_1974-1975a_0253.pdf", "page": 1, "text": "Last week the Appomattox County Raiders were forced to play four away games. Results are as follows Liberty-6, Appomattox - 0 Nelson - 2, Appomattox -0 Altavisita - 9, Appomattox - 5 Appomattox 14, Gretna -13. In the game against Gretna, the Raiders scored 12 runs in the last two innings to beat the Hawks. David Bohannon hit a grand slam to help win the game, but is now expected to be out for the season with a hairline fracture in his wrist. Also, Danny Hix had a knee injury and is not a sure starter in the next game. The Appomattox Raiders play two home games this week on Thursday and Friday. They need your support as they have been working h a r d even though the weather and a busy schedule has been against them. Statistic for Appomattox In Gretna Game"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "the next game. The <mark>Appomattox</mark> <mark>Raiders</mark> play two home games"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "the next game. The <mark>Appomattox</mark> <mark>Raiders</mark> play two home games"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.58, 331.47, 2119.07, 591.07], "bbox_id": "a17facee1f", "file": "TimesVirginian_1976_0133.pdf", "page": 1, "text": "In a three team golf match played April 6 on the Longwood College golf course in Farm ville, the Appomattox Raiders defeated Central Lunenburg but lost to Nottoway County, thus starting the season with a record of one and one. Medalist for the match was Mike Ligon, Central Lunen burg, who finished with ,an 18 hole score of 79. Roberts lead the Nottoway County team with an 81, while Verser, also Nottoway County, made the round in 84. R. B. Carter and Jerry Conner tied for Raider honors with 84 followed closely by R.L. Harris88. Team scores are determined by adding the scores of the first four players. Nottoway County had 335, Appomattox 359 and Central Lunenburg 365."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "in Farm ville, the <mark>Appomattox</mark> <mark>Raiders</mark> defeated Central Lunenburg but"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "in Farm ville, the <mark>Appomattox</mark> <mark>Raiders</mark> defeated Central Lunenburg but"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [871.2, 441.0, 1310.45, 555.14], "bbox_id": "dc68db55a0", "file": "TimesVirginian_1976_0448.pdf", "page": 1, "text": "I photo by Joe Vaughan 1976 - 77 Appomattox Raiders    Players shown in the photo above are No. 10 -Gerald Booker, N o.-ll Carl Watson, No, 12-Cecil Booker, No.l4-Marvin Clark, No. 15-Joe Fraley, No. 20-Bobby Harris, No. 22 -Larry Kelsp, No. 24-Tbmmy Wingfield, No. 30-Ronald Harvey, No. 82-ffitdi Eggleston, No. 33-James Robinson. No. 34-Manley Ferguson, No. 40-Bill Shorter, No. 42-Kenny Belter, and No. 44-Tony SnelL Co-Captains are Mitch Eggleston and James Robinson. Coach is Ray Archer and Assistant Coach is Qoty Dickerson."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Joe Vaughan 1976 - 77 <mark>Appomattox</mark> <mark>Raiders</mark>    Players shown in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Joe Vaughan 1976 - 77 <mark>Appomattox</mark> <mark>Raiders</mark>    Players shown in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [470.92, 1013.94, 609.02, 1240.73], "bbox_id": "7c3b9f5cdd", "file": "AppomattoxNewspapers_1971-1973a_0607.pdf", "page": 1, "text": "Game Rescheduled The Appomattox Raiders have re-scheduled their basketball game with Jefferson-Forest to January 24 at Forest. The game was to be played Jan. 9, but snow cancelled it. The Raiderettes will also be scheduled to play that night, also. LITTLE LEAGUE BASKETBALL STANDINGS 12-13 YEAR OLDS Won Lost Lakers 2 0 Knicks l i Squires l i Supersonics 0 2 10-11 YEAR OLDS"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Game Rescheduled The <mark>Appomattox</mark> <mark>Raiders</mark> have re-scheduled their basketball"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Game Rescheduled The <mark>Appomattox</mark> <mark>Raiders</mark> have re-scheduled their basketball"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [415.87, 365.43, 566.86, 772.16], "bbox_id": "8c33dfa31f", "file": "AppomattoxNewspapers_1971-1973a_0453.pdf", "page": 1, "text": "First Downs Rushing yds. Passing Yds. Passes Attcom Passes Intercept Fumbles lost by PuntsAve. Penalties -28.9 3-40.3 8-81 6-70 The Appomattox Raiders built up a 27-0 lead at the half and went on to beat the Staunton Riv er Golden Eagles 34-6 last Fri day night in a Seminole District football game played at Staunton River. The Raiders are now 2-0 overall and 1-0 in the district. Staunton River saw their record go to a 1-2 mark overall. The Raiders got on the score- board first with 1004 left in the first quarter as a result of a fumble on a punt attempt when Billy Guthrie recovered the ball in the end zone for a 6-0 lead as the extra point missed. In the second quarter, the Raiders scored three times and Phillip Goode kicked three extra points for their 27-0 lead. Goode scor ed the first touchdown of that quarter with 954 left in the half on a 15 yards run. Bobby Layne, the Raider quarterback came back about four minutes later with 545 to go in the half and hit Bill Austin with a 27 yard pass for a score and with 118 to go 11 he connected with Nathan Snell j ."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "3-40.3 8-81 6-70 The <mark>Appomattox</mark> <mark>Raiders</mark> built up a 27-0"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "3-40.3 8-81 6-70 The <mark>Appomattox</mark> <mark>Raiders</mark> built up a 27-0"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1884.7, 199.34, 2030.38, 935.33], "bbox_id": "cd196b960d", "file": "AppomattoxNewspapers_1971-1973a_0241.pdf", "page": 1, "text": "Chatham Edges Raiders 64-56 In Finals The Chatham Cavaliers broke a 54-54 tie with about four min utes left in the game and went on to beat the Appomattox Raiders 64-56 in the finals of the Group AA, Region III basketball tour nament held at Lynchburg Col lege last Saturday night. The win made Chatham 20-3 as they go to the State tournament and Appomattox finished with a 18-6 record for the season as they got the runner-up trophy for the tournament. The game was tied five times in the first quarter with the Raiders out in front 18-17 as the buzzer sounded. The Raid ers had a 11-7 lead for the big gest spread in that quarter. It was tied three times in the sec ond quarter, the last at 31-31, before Chatham scored at the buzzer for a 33-31 half time lead. Sammy Waddell kept the Raiders in the game in the third quarter as he hit for six points and they tied it at 46-46 going into the last quarter. Chatham built a eight point lead, 43-35, in that quarter but David John son hit with less than a minute in the quarter to tie it a 44-44 before each team scored again. In the fourth quarter, the score was tied at 54-54 with about four minutes left in the game and the Raiders went cold and could not try a basket as Chatham run to a 64-54 lead in that span. The last two Raider points came at the game ending buzzer as Leon Robinson tapped in a missed shot. Chatham hit six f r e e throws in the last of the game as the Raiders fouled to get the ball. Ricky Garrett, a senior play ing his last game for the Raid ers, led them with 15 points and four assist to go along with eight rebounds. He was followed by Leon Robinson and Sammy Wad dell with 12 points each. Robin son had 10 rebounds and hit six of nine from the floor and Wad dell hit six of 10 attempts. Thomas Motley led a scorers with 27 points as most of them came close under the basket. He had 16 in the first half. He was followed by John Waller with 24 as he hit 10 of 15 shot from the floor, mostly outside jumpers."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "on to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 64-56 in the finals"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "on to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 64-56 in the finals"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [371.3, 400.65, 508.74, 983.0], "bbox_id": "7a0e105342", "file": "AppomattoxNewspapers_1971-1973a_0212.pdf", "page": 1, "text": "Caro -i the. f  r,f n- The Willi erals got hot in the fourm qua rter to beat the Appomattox Raiders 72-60 in a Seminole District basketball game played at William Campbell last Fri day night. The victory gave the Generals a 10-5 overall mark and a 7-5 mark in league play. It was the third defeat for the Raiders in 15 games and made them 8-3 in the district. The Raiders got off toaquick lead and led 18-13 at the end of the first quarter, but the Gener als came back in the second quarter to outscore Appomattox 18-12 and carry a 31-30 lead in at the half. After three quarters of play it was 48-45 favor the Generals and in the fourth quar ter they took it going away. The turning point of the game was on the foul line as the Generals hit on 18 of 26 free throws com pared to four of 11 for Appo mattox. The Raiders didnt seem to be able to do anything right as they ran into foul trouble early in the game and the Generals took advantage of it by getting a lot of easy lay - ups. The Raiders hit 28 of 62 from the floor for 45 and the Generals 27 of 59 for 46. The rebounds were very even at 30 apiece as Leon Robinson had nine for the Raiders and Ricky Garrett and Bobby Layne with seven and six apiece. Wayne Lovelace led the Generals with 11 to head them in the re bounding department. Lovelace took game scoring honors also as he ripped the nets for 23 points for the Gen erals. He was followed by Stan Austin with 16, Ricky Purcell with 15 and Chuck Austin with 14. David Johnson led the Raiders in scoring with a 14 point per formance coming from the ben ch. He came in late in the first quarter and started hit ting. He hit on seven of his"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "rter to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 72-60 in a Seminole"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "rter to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 72-60 in a Seminole"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [362.14, 945.66, 513.19, 1512.42], "bbox_id": "813ca90cbd", "file": "AppomattoxNewspapers_1974-1975a_0083.pdf", "page": 1, "text": "by Tommy Pittman On the Appomattox Raiders 1974 football team the starting offensive center and defensive right tackle spots are manned by senior Mike Ramsey, an athlete who is also one of the leading students academically at ACHS. Mike 6-0, 183 was an All-District Honorable Men tion performer last year and seems to be as good, or better, this year. He, along with three1 other local students, was recently named a National i Merit Commended Scholar. Mike also is listed in Whos Who Among High School Students. Ramsey, the son of Mrs. Anne L. Ramsey of Hunter Street, Appomattox, is in his fifth year of Raider football and  third as a varsity starter. He has managed the varsity basketball team in the past and  will do so again this year. As a track man in his third year, Mike is a capable shotputter j and discus thrower. Mike takes an advanced course of study and does very well. His subjects this year are government, English, physics and college math, in which he received two As and two Bs. He also received an A for assisting coaches Bragg and Dickerson in sixth period P.E. Extracurricular activities are very important to Mike. In addition to football, basketball and track, he is president of the Varsity Club and a member of the National Honor Society. Mike has set his goals high, as a student of his ability should he says he plans to major in engineering at either Virginia Tech or Georgia Tech. Like most of the Raider gridders, Mike likes and re spects bis coaches. Of head coach Jerry Robinson, whose chief responsibility is the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Tommy Pittman On the <mark>Appomattox</mark> <mark>Raiders</mark> 1974 football team the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Tommy Pittman On the <mark>Appomattox</mark> <mark>Raiders</mark> 1974 football team the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [566.15, 233.37, 711.58, 717.31], "bbox_id": "0e22c7a9a5", "file": "TimesVirginian_1976_0456.pdf", "page": 1, "text": "By Tamara Nub On Tuesday night, December 7, the Appomattox Raiders traveled to Gretna for their first district game and H ud victorious with a score of 51-47. The Raiders were dominant over the Hawks in the first half as far as scoring went and the score was 26-16 at the half. The Hawks led the Raiders in second-half scoring by scoring 31 points to a Raider 25. Still, the Varsity Raiders held fast and won the game with a four point margin. Co-captain Mitch Eggleston led the Raiders in scoring with 20 points, Ronald Harvey eras second with 11, James Robin son and Bill Shorter each had 8 points, and Joe Fraley and Tommy Wingfield each had 2. Co-captains, Mitch Eggleston and Jam es Robinson and center, Bill Shorter led the team in Rebounds. Eggleston had 14, Robinson and Shorter both had 9 off the boards. The Raiders had a 49 shooting game from the floor. The big Hawks player of the night was 10,. Miller, who scored a total of 23 points, 16 of these points coming in the last half of the game. No other Gretna player scored over 10 points and it was a defeated Hawks team that left their home court Tuesday night. The Raiders are off to a winning season and they need the support of you, so come out and support your 1 Raider team. Be a 1 Raider fan!"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "night, December 7, the <mark>Appomattox</mark> <mark>Raiders</mark> traveled to Gretna for"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "night, December 7, the <mark>Appomattox</mark> <mark>Raiders</mark> traveled to Gretna for"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [331.19, 734.47, 468.09, 1288.99], "bbox_id": "282dba61dc", "file": "AppomattoxNewspapers_1974-1975a_0182.pdf", "page": 1, "text": "by Joe Vaughan The Appomattox Raiders traveled to Nelson last Friday night, only to suffer a defeat, as they were overcome 95-59. Things got off to a bad start for the Raiders, as they could only score six points in the first quarter, opposed to Nelsons 35. Appomattox came back in the second quarter to get 26 points, while Nelson scored 23, but as halftime began, the scoreboard showed Nelson with 58, and Appomattox with 32. In the third quarter, the Raiders were only able to get 12 points. As the third quarter ended Appomattox was behind by a big margin of 34 points, with the score 78-44. The Raiders were held to 15 points in the fourth quarter, which wasnt enough to make ends meet. This was the second loss to Nelson by the Raiders this season. Leading scorer for Appomat tox was Enoch Robinson, who scored 15 points. Following behind him were Mitch Eggles ton with 10, Hal Smith with 9, Dickie Kelso with 7, and Tommy Turkey Wingfield with 6. The Raiders played at home last Saturday night, as they faced Liberty, the number one team in the district. Appomat tox was again overcome by a score of 69-36. In the first quarter, Enoch Robinson got 6 of the Raiders 8 points. Liberty had 20. Half time score was Liberty - 33, Appomattox - 15, as Enoch Robinson added 4 more, James Robinson - 2, and David Franklin - 1. The Raiders were held to a slim 5 points in the third quarter as it ended with Liberty on top, 52-20."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "by Joe Vaughan The <mark>Appomattox</mark> <mark>Raiders</mark> traveled to Nelson last"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "by Joe Vaughan The <mark>Appomattox</mark> <mark>Raiders</mark> traveled to Nelson last"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [626.68, 313.93, 767.65, 770.51], "bbox_id": "29ab0c67a3", "file": "AppomattoxNewspapers_1974-1975a_0176.pdf", "page": 1, "text": "By Joe Vaughan The Appomattox Raiders, hurting with lack of height and experience, gave up three out of their last four games, but have been working hard this week and seem to be getting ready for this Friday nights game, as they take on Nelson. The Raiders were putting up a good fight with Gretna, as the first half ended with Gretna leading by 3, 37-34. In the second half though, the Raiders fell further behind, as Gretna went on to win 87-64. Leading scorers for Appomattox were Hal Smith, 11  David Kelso, 10 and Mitch Eggleston with 9 . The same story seemed to strike the Raiders when they played Amherst, when the half ended 27-25, the Raiders only 2 points behind. Amherst won 65-42. Leading scorers were Enoch Robinson, 10 David Kelso 8  Tommy Turkey Wingfield, a prominant young sophomore, with 5, and Dickie Kelso, also with 5. Luck hit hard again as the Raiders were down by only one point in the Altavisita game, when the 1 st half ended 41-40. Again Appomattox fell behind and lost 81-67. Enoch Robinson lead the socriqg with a big 23 points, while Dickie Kelso had 14. James Robinson, 12  and Hal Smith, 8 . Mitch Eggleston and David Kelso had 4 each. The Staunton River game was a different story. The Raiders had a good lead as the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "By Joe Vaughan The <mark>Appomattox</mark> <mark>Raiders</mark>, hurting with lack of"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "By Joe Vaughan The <mark>Appomattox</mark> <mark>Raiders</mark>, hurting with lack of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [717.35, 970.28, 902.02, 1210.96], "bbox_id": "5d79b389e7", "file": "TimesVirginian_1983a_0346.pdf", "page": 1, "text": "By CECIL JACOBS The 1963-84 year b one full of change for the Appomattox Raiders. New state bws concerning, time in  class rad problems arisbigmvnt. these new rules are making tlm lives of students and the jobs of adminiatratira officiate complicated. For the pant two weeks, and for the rest of the school year, high school students have been, and will be, getting a shorter day. its only five mfoutaa, but it has obviously made a profound difference fo the traffic situaitoo tlb t bus must fora as they foftve from tiip primary school with the last tend Administratira officials made thfo move after a trial period two weeks ago. However, as b often the case, the solutira has created another problem. The State Board of Education h  begun, plating strict emphaab on"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "of change for the <mark>Appomattox</mark> <mark>Raiders</mark>. New state bws concerning,"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "of change for the <mark>Appomattox</mark> <mark>Raiders</mark>. New state bws concerning,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1603.89, 911.01, 1748.89, 1014.8], "bbox_id": "42440e9387", "file": "AppomattoxNewspapers_1971-1973a_0313.pdf", "page": 1, "text": "Brookville scored three runs in the second inning and held on to beat the Appomattox Raiders 3-1 last Friday night in a Se minole D istrict baseball game played at Brookville. The lost made the Raiders 6-4 and went  to 10-3 overall and 9-1 in the district. The Bees got their three runs"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "on to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 3-1 last Friday night"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "on to beat the <mark>Appomattox</mark> <mark>Raiders</mark> 3-1 last Friday night"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [562.31, 677.14, 702.1, 834.68], "bbox_id": "6846438afe", "file": "AppomattoxNewspapers_1971-1973a_0163.pdf", "page": 1, "text": "Bobby Layne and Ricky Gar rett combined for 49 points in leading the Appomattox Raiders to a 86-75 win over the Brook ville Bees in a Seminole Dis- trick basketball game played last Friday night at Appomat tox. The victory now gives the R aiders a 5-1 m ark overall and 4-1 in the district. It was all Layne in the first quarter as he scored 12 points when he hit on six of eight shots from the floor in giving App omattox an 18-10 first quarter"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "points in leading the <mark>Appomattox</mark> <mark>Raiders</mark> to a 86-75 win"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "points in leading the <mark>Appomattox</mark> <mark>Raiders</mark> to a 86-75 win"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [966.5, 715.59, 1110.83, 905.39], "bbox_id": "893060a3e7", "file": "AppomattoxNewspapers_1971-1973a_0101.pdf", "page": 1, "text": "Appomattox Raiders, with a 4-2 conference record and an overall record of 7 wins and 2 losses are tied for third place in the Seminole District with the Altavista Colonels, their rivals for Friday nights Homecoming also tied in the 3rd slot in Dis trict standings. In the district, following Fri days contests win-loss tallies resulted in this line-up of teams in the district First are Brook- ville Bees witha 9-0 overall re cord followed by Gretna, Appo mattox, Altavista, William Campbell, Rustburg, Staunton River, and Nelson."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark>, with a 4-2 conference"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark>, with a 4-2 conference"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.8, 1212.04, 1727.37, 1390.02], "bbox_id": "5e02c2423f", "file": "AppomattoxNewspapers_1971-1973a_0229.pdf", "page": 1, "text": "Appomattox Raiders are still very much in contention for re gional basketball honors. Jerry Robinson, athletic dir ector, Appomattox County High School, announced Monday that the Raiders under Coach Cliff Morris will enter the Regional tournament T h u r s d a y night, March 2nd, continuing March 3 and 4 at Lynchburg College with the winner moving into state championship playoffs begin ning the following Thursday, March 9, 10 and 11. On Thursday, March 2 Appo mattox will open the tourney as"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark> are still very much"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark> are still very much"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2320.96, 1254.69, 2585.19, 1368.83], "bbox_id": "15ad00b87e", "file": "AppomattoxNewspapers_1971-1973a_0221.pdf", "page": 1, "text": "Appomattox Raiders above defeated Staunton River Tues day night in the opener of the Seminole District tourney played here. They were scheduled to play the winner of the Rustburg-Gretna game at Lynchburg College Wed. night with Seminole finals set for Friday night at Lynchburg College. Raiders were 14-4 overall during season play and 10-4 in district victories. Players from left Mark Eg gleston, Sammy Waddell, Milton Chambers, Ricky Garrett, co-capt. Bobby Layne, Leon Robinson, co-capt. Dennis Totty, Bill Austin, Coach Cliff Morris, Rickv Martin and David Johnson. Score Tuesday night was 69-47."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark> above defeated Staunton River"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> <mark>Raiders</mark> above defeated Staunton River"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [405.6, 354.65, 556.85, 975.47], "bbox_id": "87aff059b9", "file": "AppomattoxNewspapers_1971-1973a_0495.pdf", "page": 1, "text": "Appo. Or. First Downs 17 1C Rushing yds. 157 113 Passing Yds. 264 166 Passes AttCom 24-13 18-9 Passes IgU By 5 1 Fumbles loss by 1 1 PuntsAv. 3-30-0 3-33.0 Penalties 8-100 5-45 Bobby Layne, Appomattox quarterback, passed for 264 yards and four touchdowns along with 53 yards rushing for a 317 yard total offense night as he led the Appomattox Raiders to a 34 - 18 win over the O range County Hornets last F r id a y night. It was a non-district win for the Raiders at Appomattox and made them 4-3 overall and they are still 2-2 in the district Orange fell to 2-5 overall. The Raiders did not waste any time getting on the scoreboard as they took the opening kickoff on their own 20 and went 80 yds in 13 plays with Glenn Doss go ing the last five for the touch downs and the kick failed with 624 in the quarter and the Raid ers ahead 6 - 0 . The R a i d e r s made it 14-0 when Bobby Layne threw his first touchdown pass to Nathan Shell with 923 left in the half. It was a six yard toss after Bill Austin and Mike Gal- lier had hauled in passes of 26 and 22 yards to set up the score. Layne threw to Gallier for the two point conversion. Orange did not let that worry them as they came back to score to second quarter touchdowns and closed the gap to 14-12 at the half. Ronnie Whitbeck scor ed from 10 yards out on the first scor e after he was trapped in his own backfield for a lost, he broke loose for the run evading Raider tacklers. The kick for the extra point failed with 710 left in the half. Orange then scored on the last play of the half when Whitbeck threw 13 yards to Robert Williams for the score. The extra point try failed. That second touchdown was set up on a penalty as time ran out and was against the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "as he led the <mark>Appomattox</mark> <mark>Raiders</mark> to a 34 - 18"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "as he led the <mark>Appomattox</mark> <mark>Raiders</mark> to a 34 - 18"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [341.5, 374.01, 488.25, 799.65], "bbox_id": "c97268abfb", "file": "AppomattoxNewspapers_1971-1973a_0287.pdf", "page": 1, "text": "9-1 The Appomattox Raiders went on a slugging spree last Wed- , nesday as they banged out 12  hits in beating the Staunton Ri ver Golden Eagles 9-1 in a Sem in o le District baseball game played at Appomattox. It j was the third victory against j one loss for the Raiders. Mike Gallier, Dennis Wilker- j son and Ricky Garrett each  drove in three runs for Appo-  mattox. Wilkerson led the at- ! tack with three hits, while Gal lier, Garrett and Steve Almond each had two hits. Garrett hit a i three run homer in the fifth for j the big blow and Wilkerson had j a two run homer in the second j after Gallier had cleared the j bases with a three run triple, I just before Wilkerson batted, i Wilkerson got his other RBI in j the sixth when the last Raider j run was scored. Steve Almond, a senior right hander, got the victory as he went the distance. He struck out 11 Golden Eagle batters as he was in control all the way. The j Golden Eagles were shut out for six innings and then Ricky Mor gan singled and scored on Jim my Zimmermans double in the seventh for their only run. Ni chols was the losing pitcher for Staunton River as he went only two innings. R H E"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "9-1 The <mark>Appomattox</mark> <mark>Raiders</mark> went on a slugging"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "9-1 The <mark>Appomattox</mark> <mark>Raiders</mark> went on a slugging"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [489.09, 978.53, 753.68, 1083.07], "bbox_id": "3144b158e5", "file": "AppomattoxNewspapers_1971-1973a_0065.pdf", "page": 1, "text": "4hiilip Goode foreground of Evergreen, is  Lineman of the Week for the Appomattox Raiders with credit for 12 un assisted tackles during Fridays 28-6 victory over Nelson. He also intercepted a pass and now earns a dinner at Mau des. For Mike McCormick right behind him with ball, of Gladstone its a second victory dinner as his  outstanding defense during Fridays game earns him the weeks title. His other dinner award came because of the Buckingham contest. Raiders will meet Rustburg this Friday at 8 here in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "the Week for the <mark>Appomattox</mark> <mark>Raiders</mark> with credit for 12"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "the Week for the <mark>Appomattox</mark> <mark>Raiders</mark> with credit for 12"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1983.85, 281.16, 2137.64, 615.64], "bbox_id": "339e2ce3ac", "file": "TimesVirginian_1976_0322.pdf", "page": 1, "text": "28-0 at the end of three quarters. Early in the 4th quarter, Lewis Martin and Kehny Wayne Carter pulled down the Hawks quarterback in his own eird zone for a safety. The Appomattox defense led by Martin, Tom Hix, Mitch Eggleston, James Robinson, Phil Jamerson and R. L. Harris held Gretna to 5 first downs and 44 yards total offense. The hawks scored late fo the game aided by several key penalties against the Raiders, one a pass interference call which gave the Hawks a 1st down on the Raider 1 yard line. Appomattox Raiders will travel to Naruna Friday night to play William Campbell who defeated Liberty 18-8 in the season opener. They will be back in Bragg Stadium September i7 to entertain Rustburg, a 32-0 winner over Jefferson Forest Friday night. Appomattox 7 7 14 2-30 Gretna 0 0 0 6-6"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Raider 1 yard line. <mark>Appomattox</mark> <mark>Raiders</mark> will travel to Naruna"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Raider 1 yard line. <mark>Appomattox</mark> <mark>Raiders</mark> will travel to Naruna"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [899.48, 315.59, 1048.08, 830.56], "bbox_id": "00221f5852", "file": "TimesVirginian_1981a_0049.pdf", "page": 1, "text": "with 25 points, Ferguson with. 21, Marvin Johnson with 12, mid Rick Caldwell with 11 points. The Raiders jumped into an early lead in the first quarter, which ended with the local team ahead, 20-12. In the second quarter, the Raiders continued their domination iff the game, scoring 20 points to Libertys 11, and the score at the end of the first half stood at 40-23, favor of Appomattox. The Raiders exploded for 25 mqre points  in the third quart, while holding Liberty to 15 points. In the final period of play, the Raiders garnered , 21 moré points, held Liberty to 17 points, and wop the game by 31 points, 86-55. With the Raiders scoring in double figures for the game were Je ff Miller with six points, Ron Carter with five points, Normán Turner with three points, and Jody Williams with three. Shane Abernathy pulled in 17 rebounds for the. Raiders, and the team hit 32 field goals and went 22 for 29 from the foul line for a 75 percent freethrow performance. The Raiders were scheduled to complete their regular season Tuesday night at home against Rustburg, after the Ibues-Virginian deadline. The Raiders have clinched a spot in the Seminole District tourna ment, to be held starting Feb. 24 at E . C. Glass High School in Lynchburg. As of press time, however, the team with which the Raiders would be paired in the opening  round of the tourney had yet to te determined."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "at 40-23, favor of <mark>Appomattox</mark>. The <mark>Raiders</mark> exploded for 25 mqre"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "at 40-23, favor of <mark>Appomattox</mark>. The <mark>Raiders</mark> exploded for 25 mqre"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1342.09, 362.38, 1522.22, 404.58], "bbox_id": "7fd2841f08", "file": "TimesVirginian_1983a_0374.pdf", "page": 1, "text": "When it was over, Saturday nights game against Brookville counted as a loss against the Appomattox vanity Raiders record."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "When it was over, Saturday nights game against Brookville counted as a loss against the <mark>Appomattox</mark> vanity <mark>Raiders</mark> record."}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "When it was over, Saturday nights game against Brookville counted as a loss against the <mark>Appomattox</mark> vanity <mark>Raiders</mark> record."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.02, 220.46, 2153.62, 756.75], "bbox_id": "faac5d2ab8", "file": "TimesVirginian_1980a_0048.pdf", "page": 1, "text": "Twenty-point-phis games by Shane Abernathy and Larry Kelso ted the Appomattox varsity Raiders to a 59.-50 win over Liberty last week, followed by a 77-63 loss to Rustburg Friday in basketball action.  Abernathy scored 24 and Kelso 21 in leading the Raiders to their tenth - victory this season last Tuesday night. The Raiders jumped out to a 17-15 lead in the first quarter, and, played L iberty even throughout the second quarter, with the halftim e score standing at 25-23, favor of Appomattox. Liberty closed the gap in the third quarter, scoring 17 points to .the Raiders 16, and as the  final period of play began, the Appomattox team held out a one-pointmargin. An 18-point fourth quarter, matched by only 10 points from the Liberty squad, iced the game, however, and when the buzzer sounded ending the contest, th eRaiders vhere on top, 59-50. With Abernathy and Kelso, Larry Woods scored in double figures, with 10 points, and David Pankey and Jonathan Pickett each scored two points. The teams played even on field bals, with each squad sinking 21 baskets. The difference was at the foul line, where the Raiders shot 17 for 25 for 68 percent, while liberty shot eight for 17 for 47.1 percent. Shane Abernathy had a perfect night at the freethrow line, sinking ten of ten foul shots. Abernathy also gathered in"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Larry Kelso ted the <mark>Appomattox</mark> varsity <mark>Raiders</mark> to a 59.-50 win"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Larry Kelso ted the <mark>Appomattox</mark> varsity <mark>Raiders</mark> to a 59.-50 win"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [525.62, 342.64, 901.04, 468.84], "bbox_id": "144725cbd8", "file": "TimesVirginian_1984a_0155.pdf", "page": 1, "text": "This week is foe final eek of regular-season play for Appomattox. The Raiders were scheduled to play William Campbell Tuesday at William Campbell. The team will play Brookville at 7 pjn. today Wednesday at Brookville. Thursday foe Raiders Wffl play Nelson County at 90 at Nelson, and Friday foe team will play Tim Appomattox boys tennis team Altavista at 7 p.m. at Altavista. qualified for the district tournament The district tournament is scheduled Monday, defeating Rustburg in a to begin next Thursday at Altavista. playoff at Concord Elementary- School,"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "of regular-season play for <mark>Appomattox</mark>. The <mark>Raiders</mark> were scheduled to play"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "of regular-season play for <mark>Appomattox</mark>. The <mark>Raiders</mark> were scheduled to play"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1578.23, 239.13, 1717.98, 440.67], "bbox_id": "601ac41cec", "file": "AppomattoxNewspapers_1971-1973a_0331.pdf", "page": 1, "text": "The Raiders of Appomattox beat Clifton Forge 11-2 last Friday to advance in the Re gional 2A Baseball Champion ship. The Raiders then lost 4-3 to Tunstall in the championship Saturday in the last inning on an error. The Raiders broke a 2-2 tie against Clifton Forge in the fourth inning when they scored twice and then got four more in the fifth. Dennis Wilkerson got the win going the distance allow ing seven hits. Details were not available on either game. Appomattox - 002 240 3 -1110 0 Clifton Forge 002 000 0 - 2 7 3"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "The <mark>Raiders</mark> of <mark>Appomattox</mark> beat Clifton Forge 11-2"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "The <mark>Raiders</mark> of <mark>Appomattox</mark> beat Clifton Forge 11-2"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [105.85, 294.7, 408.07, 1068.41], "bbox_id": "be7f898621", "file": "TimesVirginian_1981a_0421.pdf", "page": 1, "text": "The Raider varsity basket- Coach Coty Dickerson said he ball squad combined a balanced was pleased with the good job game and a total team effort to Kim Humbles, did of tweaking score, victories in its first three the press against William7 games of the season . last Campbell. Tuesday, Friday and Saturday The Raiders continued their evènings. winning ways Saturday Tuesdays game against evening in a contest which saw Gretna, the team won the four Appomattox players score Seminole District title last in double figures during a 65-60 year, was a close contest which win over Amherst. Appomattox won in the final The first and second quarters seconds of the game, 46-44. were identical for both teams in The Raiders hit 19 field goals terms of points scored, with during the contest, while Appomattox scoring 14 points Gretna scored on 16 field-goal in each quarter, and Amherst attempts. Gretna was hot from scoring 11 points in each period, the foul line, hitting 12 of 13 In the third period, Amherst foul shots, while the Raiders outscored Appomattox by a went eight for 18 from at. the point, 16-15, and the teams foul Une for a 44.4 percent played even in the final period, performance. each scoring 22 points, and .the The game went down to the Raiders recorded the win, wire, and stood tied with less 65-60. than 15 seconds on the clock. Humbles, Caldwell, and Riçk Caldwell drew a foul and Turner scored 17,11 and  11 went to the line, he sank both points, respectively, for the shots and the Raiders held off Raiders, and Greg Mayberry Gretna to ice the win. Gretna scored ten points coming off the hèkl a four-point advantage at bench for Appomattox, the half, and led 31-32 at the Others scoring for the end of the third quarter. Raiders were Ron Carter with Kim Humbles and Ron eight poihts, Jeff Miller with Carter led Raider scorers with four, and Jody lAfiUiams and 12 and ll points, respectively. Mark Kelso with two each- Rick Caldwell and Derwin Appomattox hit 23 field goals Harvey each scored seven and went 19 for 29 from the foul points for the Raiders, Jeff line for a 65.5 percent Miller had six and Norman freethrow performance. Turner scored three  for Coach Çotÿ Dickerson fcited Appomattox. Humbles for hi nine assists, as High scorer for Gretna was well as Mayberry for his Vincent Glass, with 14 points. performance.off the bench. Fridays game against Will- Dickerson also noted that iam Campbell saw four Raiders Caldwell was successful on nine score in double figures during a 0f tep freethrow attempts in 70-56 Appomattox victory. the fourth quarter. In additimi. The Raiders jumped out to an j eff Miller recorded eight early 15-9 lead in thè first rebounds against William quarteri but were outscored by Campbell. -, William Campbell in the Dickerson said after the second quarter, 22d5. The teams first week of play We teams played closely in the are very pleased with the third quarter, but Appo- results of this opening week of mattox exploded for 27 points the season. He added that in the final period while bolding Everyone contributed some William Campbell to 18 points . thing and wé played togbether and recorded the, second as a team. We will continue to victory of their young season, work tpwards a total team 06. effort and prepare ftr each Humbles. Caldwell. Carter game one day at a time. and Miller all scord in double Dickerson added that the figures during the game, with team appréciâtes the support 20,16, 13 and 11 points, of oureommunity as we strive, respectively. to reach our goals.  NH b E Others scoring for the Raiders were Norman Turner The Raiders were scheduled with six points, and Greg to face off against Jefferson Mayberry and Derwin Harvey, Forest Tuesday evening after each with two points. the Times-Virginian deadline. The Raiders scored on 24 Friday night, the Raiders will field-goal attempts and hit 22 of travel to Nelson County for an 8 31 foul shots for a 70.9 percent p.m. game. Next Tuesday Dec. freethrow performance. 15 the Raiders, will play Norman Turner had 10 Altavista at horned Game time"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "foul shots, while the <mark>Raiders</mark> outscored <mark>Appomattox</mark> by a went eight"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "foul shots, while the <mark>Raiders</mark> outscored <mark>Appomattox</mark> by a went eight"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.71, 759.99, 1558.88, 958.18], "bbox_id": "fa95e584b6", "file": "TimesVirginian_1983a_0461.pdf", "page": 1, "text": "The Raider junior varsity basketball team lost 54-33 Friday night to William Campbell, following a close 50-45 loss t Gretna lari Tuesday evehing. Against G retni, the jayvee Raiders toayed good team ball and good .. defense overall, hut we couldnt pull it ft out, Commented coach John Pettyjohn this W66k, ! Jack Baker and Dairen Tolley both scored in double figures for the Raiders, with 20 and 12 points, respectively, and Cleve Jones had eignt prints for the Raiders. The Appomattox squad outscored Gretna by five points in the second half, but toe Gretna team had built up tee nmeh to a lead in the first two quarters for the Raiders to overcome."}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "eignt prints for the <mark>Raiders</mark>. The <mark>Appomattox</mark> squad outscored Gretna by"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "eignt prints for the <mark>Raiders</mark>. The <mark>Appomattox</mark> squad outscored Gretna by"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1081.97, 377.06, 1221.77, 471.04], "bbox_id": "8369e25cd6", "file": "AppomattoxNewspapers_1971-1973a_0088.pdf", "page": 1, "text": "The Junior Varsity Raiders of Appomattox take on Altavista Thursday, October 28 at 400 p.m. at Altavista. Then on Wed nesday, Nov. 3rd they will meet Rustburg, here, in a make-up game. Two victories by the Jr. Raiders will give them a share of the Seminole District JV"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "The Junior Varsity <mark>Raiders</mark> of <mark>Appomattox</mark> take on Altavista Thursday,"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "The Junior Varsity <mark>Raiders</mark> of <mark>Appomattox</mark> take on Altavista Thursday,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.89, 222.1, 1518.91, 300.05], "bbox_id": "39d587bd81", "file": "TimesVirginian_1980a_0027.pdf", "page": 1, "text": "Thé Appomattox varsity Raiders raised their season record to 7-4 in Seminole District play with a 4848 victory over William CampbeU, following a 50-46 loss to Gretna in basketball action tost week."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Thé <mark>Appomattox</mark> varsity <mark>Raiders</mark> raised their season record"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Thé <mark>Appomattox</mark> varsity <mark>Raiders</mark> raised their season record"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [101.74, 436.24, 279.56, 1825.72], "bbox_id": "6d7b7d4f2c", "file": "TimesVirginian_1980a_0060.pdf", "page": 1, "text": "The Appomattox varsity Raiders ended their regular season last week with wins over - Brookviile and Bucking ham, and a loss to undefeated Amherst. Larry Kelso, who carried away game-scoring honors in all three games, stood poised on the brink of the 1,000-career-. points mark as the regular season ended, needing only 17 to break the magic four-figure line. Kelso stormed for 33 points Friday, as the Raiders took an easy 80-59 victory from haplera Brookviile, Kelso was joined In  the doublefigure scoring ranks by Terry Woods, who totaled 17 for the night, and by Shane Abernathy, who had ten points. The Raiders jumped to a 15-8 lead in the first quarter, and 1 never relinquished that ad vantage, leading 37-26 at the  half, 55-42 at the end of the third quarter, and 80-59 when the final buzzer sounded. The Raiders outshot Brook- L .  ville 28 field goals to 19, and hit 24 of 41 freethrows for a 56.5 percent average. W ith Kelso, Woods and A bernathy in the scoring column were Kim Humbles, who scored seven points, Steve Cobb with six points, Marvin Johnson who scored three, and David Pankey and John Simmons, with two points each.   Kelso and Abernathy led rebounders with 15 and 12 respectively, followed -fry Woods, who had 5 grabs. Buckingham was more of a challenge for the Raiders Wednesday night, with the load team holding through a - fourth-quarter rally to take the game, 61-49. Kelsos 19 points marked the games high scoring figure, followed by Buckinghams Marvin Lee 13 points, and Gary Woodson 12 points. Sjteve Cobb and Terry Woods, with 11 and 10 points respectively, rounded out the games double-figuring scoring bracket. The Raiders took a six-point lead in the first quarter, which ended 18-12. Appomattox st - retched that lead to eight points by the end of the first half, when the score stood at. 33-25. A poor third quarter by Buckingham had the Raiders up by 15 with the score 46-31,, but the local team had to stave off an 18-point fourth quarter by Buckingham to perserve the win.  Scoring for Appomattox with Kelso, Cobb and Woods were Marvin Johnson and Shane Abernathy with nine points each, and Kim Humbles with three points. Abernathy led Raider re- boohders with 12 rebounds, followed by Larry Kelso, who brought in eight for the night! The Raiders hit on ,27 field gqal attem pts, and went seven-for-16 from the foul line fqr a 43.8 percent average. Appomattox felt the 20-win power of Amherst in a game Monday night which saw the Raiders trailing from the first quarter, and finally suffering their last defeat of the season, 77-fip. While Larry Kelso and Shane A bernathy were the top scorers in the game with 27 and 16 points respectively, they still could not hold off a lightning- quick Amherst team, which had niaeT players in the scoring column. Appom attox scored only eight points in the first quarter to Amhersts 19, and when the firm half ended the Raiders were behind 37-22. A 27-point third quarter put Amherst even further- ahead, as the Raiders could muster only 18  points for themselves. A 20-point Raider burst in ffeefinal period of play was not enough to stop Amherst, and thje game ended 77-60. Terry -Woods joined Kelso  and Abernathy in the double figure scoring bracket with IQ points, and Steve Cobb with tqur points, Kim Humbles with two, and Alonzo Dillard with a  point rounded out the Raider scoring column. Abernathy led Raider re- bounders with 11 for the night, followed, by Kelso, who recorded nine rebounds, While the Raiders outshone II A m herst at the foul line lA-for-28 for 72 percent 1, compared o seven-tor j.l fur 50 percent, A was the awesome , Am flfww uKttnM  , ,. k"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> varsity <mark>Raiders</mark> ended their regular season"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> varsity <mark>Raiders</mark> ended their regular season"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [102.25, 776.28, 250.53, 1143.16], "bbox_id": "bda5d144fc", "file": "TimesVirginian_1980a_0067.pdf", "page": 1, "text": "The Appomattox varsity Raiders ended their best season in seven years last week on a down note, losing 50-46 to a canny team from Rustburg in the Seminole District tourna ment. The game, which was neck-and-neck to the final buzzer, saw senior eager Larry Kelse-.score his 1,000th career point wee related Storv. Kelsos 20 points were, the gaine high for both teams. He was Joined in the double-figure scoring rank by Shane Aber nathy, with 14 points. Other Raiders scoring were Marvin Johnson seven points, Kim Humbles three points - and Terry Woods two points. The Raiders fell behind early in the game, trailing Rustburg 12-8 at the tad of the first quarter. Rustburg scored 16 points in the second period of play to the Raiders 13, and the score stood at 28-21 as the half ended. The Raiders pulled to within four, by the end of the third quarter, and were virtually knocking on the door of victory in the final period of play, going ahead by a point for a brief period of time before falling"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> varsity <mark>Raiders</mark> ended their best season"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> varsity <mark>Raiders</mark> ended their best season"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [902.87, 246.26, 1053.44, 762.68], "bbox_id": "967d6f0578", "file": "TimesVirginian_1981a_0042.pdf", "page": 1, "text": "The Appomattox Varsity Raiders dropped Altavista last Tqesday, then fell 52-45 to Brookville in Friday evenings, basketball game. Shane Abernathy, with 22 points, led all scorers in Tuesdays game against Alta vista, which saw the Raiders stage a strong second-half comeback after going into the lockerroom behind 28-26 at the half. Abernathys performance was followed closely by Marvin Johnsons, who scored 15 points, Kevin Ferguson with 10, Jeff Miller with six, Rick Caldwell with four, Jody Williams with two and Ron Carter with two. The Raiders fell behind by four at the end of the first quarter, which ended 12-8, favor of Altavista. In the  second period of play, the Raiders scored 18 points to Altavistas 16, to move to within , two points of Altavista as the half ended. Then the Raiders exploded for 16 in the third period, while almost completely shutting down Altavista, which scored but four points in the entire period. In the final period of play, the Raiders reeled off 19 points, as did Altavista, and the game ended 61-51, favor of Appomattox. Coach. Coty Dickerson commended Shane Abernathy for his 16 point second half, and Marvin Johnson, who did a good job of getting the ball down low inside to Shane. The Raiders hit 22 of 45 field goals fo r. a 48.9 percent performance from the floor and hit on 17 of 26 freethrows for a 65.4 percent performance from"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> Varsity <mark>Raiders</mark> dropped Altavista last Tqesday,"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> Varsity <mark>Raiders</mark> dropped Altavista last Tqesday,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [317.31, 310.76, 462.3, 1074.81], "bbox_id": "d2f195cec6", "file": "AppomattoxNewspapers_1971-1973a_0054.pdf", "page": 1, "text": "The Appomattox R a i d e r s  scored in every quarter last j Friday night and beat the Ran-  dolph-Henry Statesmen 34-6 in  a non-district football game  played at Appomattox. The Raiders are now 2-1 overall and Randolph-Henry fell to 0-3. Appomattox got on the score- board with 58 seconds left in  the first quarter when quarter back Bobby Layne passed 14 yards to Wayne Simpson for the score. Jimmy Chandler kicked the extra point for a 7-0 lead. The drive took nine plays and i had started on the Raiders own 49 yard line. In the second quarter, Ran- j dolph-Henry i n t e r c e p t e d a ! Raider pass but the Appomattox j defense tighten up and stopped j the drive on the 16 of Appomat- j tox with 351 left in the first  half. Bobby Layne then went j back to pass eight plays later j and couldnt find a receiver open, so he scampered into the end zone from 22 yards out and j a TO and Chandler again hit the i extra point for a 14-0 lead with j only 40 left in the half. The  big run in that 84 yard drive i was a 32 yard run by Mike Me- , Cormick. Randolph-Henry came out hot in the third quarter as they started on their own 31 yard line. Five plays later with 922 left in the quarter R-H quart erback Trey McKenzie found Kenny Colley on the receiving end of a 49 yard pass play to make it 14-6 as the run for the extra point failed. Appomattox then took the kickoff had it re turned back to the 41 where they started. It took the Raiders 11 plays to cover the 59 yards and then Wayne Simpson passed 18 yards to Mike McCormick for the touchdown and it was 20-6 as the extra point failed. In that drive McCormick had a 12 yard run and caught a 13 yard pass to keep the drive going. In the fourth quarter Appoma ttox drove to the 12 but the R-H defense stiffened and held. They could not move either and had to punt. Robert Thornton then crashed in to block the Ran dolph-Henry punt and the Raid ers ended up with the ball on the Statesmen 28 yard line Mike McCormick then went in from six yards out six plays later with 303 left in the game and Chandler booted the extra point for a 27-6 lead. A little over a minute later the Raiders held on a fourth down and Randy Foster went in from 12 yards out and"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "football game  played at <mark>Appomattox</mark>. The <mark>Raiders</mark> are now 2-1 overall"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "football game  played at <mark>Appomattox</mark>. The <mark>Raiders</mark> are now 2-1 overall"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1886.87, 260.3, 2021.05, 758.23], "bbox_id": "a2f22fc4c4", "file": "TimesVirginian_1980a_0374.pdf", "page": 1, "text": "The Appomattox jayvee Raiders took a 14 6 lead at halftime Thursday and went oh to defeat Buckingham 20 6 to end their season in a deadlock with William Cam  pbell for the district title. Both teams ended the season with 7 1 district records. Appomattox was the junior varsity Seminole .champions last year. The Raiders took the lead in the second quarter on a 10 yard run Thursday, after a scoreless first quarter.. Steve Hamliette recorded the touchdown, followed by a two-point conversion pass from quarterback Paul John son to receiver Jeff Fanny. Later in the second quarter, the Raiders put together a 60 yard drive, capped off by Ricky Turners four-yard scoring run. to put the Raiders up 14 0. Buckingham scored near the end of the first half when Aaron Perkins broke away for a 37-yard run. The haif ended at 14-6. Appomattox. After a. scoreless third quarter, the Raiders again scored on a short pass from Johnson to Ricky Miller. The score was set up when the Raiders had a fourth and three at the Buckingham 40-yard line.from their punt formation, the Raiders sur prised the Knights  by centering the ball to Steve Hamlette who bolted 45 yards to the Buckingham 15-yard line. - This was a most satisfy ing year, and the kids came together much quicker than"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> jayvee <mark>Raiders</mark> took a 14 6"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> jayvee <mark>Raiders</mark> took a 14 6"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [629.31, 614.89, 765.46, 696.44], "bbox_id": "4debeeeb2d", "file": "AppomattoxNewspapers_1974-1975a_0159.pdf", "page": 1, "text": "The Appomattox County Raiders showed good team balance and refused to yield to a fourth quarter onslought by William Campbell as they defeated the Generals, 68-59 in a Seminole District basketball game Friday night."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> County <mark>Raiders</mark> showed good team balance"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "The <mark>Appomattox</mark> County <mark>Raiders</mark> showed good team balance"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1371.83, 348.96, 1560.05, 746.85], "bbox_id": "b6f4745494", "file": "TimesVirginian_1984a_0082.pdf", "page": 1, "text": "tag in the finals of the Region, til nament, and advance to the state Tmmeiit.  Thev Raiders playedi Martinsville cfose in the first half of Thursday Rights game, but a Bulldog préss in the third quarter forced gome Appomattox turnovers thkt allowed Martinsville to puU away to the final minutes of the game.  . The Raiders led 11-8 at the end of the first quarter, bat MettinsviUe heid è one-point advantage, 28-25, at the end of thie first half. Early in the third quarter, Martinsville put their full-court press on, and thats when the Bulldogs began to trike control. Martinsville held a 44-31 lead at the end of th e third  quarter, and even though the Raiders adjusted and etitscored Martinsville 22-20 to the final period, the Bufldog lbad was too nmeh to overcome, and Martinsville icedte game, 6453. Gary Fergusòq and Ricky Miller scored in double fingures for the RaMers, with 14 and 13 prints,  respectively. Mike Jackson scored nine points, Bobby Gftrter seared six, Tyrone A bbitt scored six, Todd Scruggs scored three, and Tim Austin   scored two points for Appomattox. The Raiders finished their season  with a 15-9 record, 15-6 to the Seminole District. Im very proud of the kids and the way they performed this season,"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "scored two points for <mark>Appomattox</mark>. The <mark>Raiders</mark> finished their season  with"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "scored two points for <mark>Appomattox</mark>. The <mark>Raiders</mark> finished their season  with"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [314.14, 283.71, 830.33, 605.5], "bbox_id": "72689ae4fb", "file": "TimesVirginian_1983a_0035.pdf", "page": 1, "text": "start of the fourth quarter, noted while Appomattox scored nine. . X This week, the Raiders were Dickerson. We had a chance to The Raider defense continued t i scheduled tfeilay Altavista at home send the game into overtime, but stifle Nelsons offense in the second Tuesday night after the T in  Vlr the ball rimmed out at the buzzer, half, with Appomattox outscorinf ginian deadline. Friday night, the We played well in the fourth Nelson County in the third quarter team will travel to Brookville for an scoring 25 points. The kids never 15-13 and in the fourth d-9i, way game. Next Tuesday night, quit, and I am proud of them for We played good defense and ran ike Raiders will day Liberty at their efforts on a night when things our offense with patience, com- home. were tough, the coach concluded. mented Dickerson after tile game. Kevin Ferguson and Rick We showed good shot selection and Caldwell scored in double figures for kept down on our turnovers, which Appomattox, with 25 and 10 points, is what you have to do against a respectively. Gary Ferguson scored team like Nelson, that Ukes to run, eight points, Ricky Miller scored he eontihtfedTTt was a big win for four, Bobby Carter and Jody our team, and everyone contribut- Williams scored two each, and Todd ed, the coach concluded. Scruggs scored one for Appomat- Kevin Ferguson led Raider tox. scorers with 17 points against Lfe Layne and Coston Cheatham Nelson County. Rick Caldwell scored in double figures for William followed, with 10, Jeff Miller, Gary Campbell, with 20 and 14 points, Ferguson and Bobby Carter each respectively. scored four, Ricky Miller and Mike The Raiders traveled, to Nelson Jackson scored two, and Todd County Friday night and came away Scruggs scored one point for with their first win against that Appomattox. The Raiders scored 16 team in three years, 44412. field goals and kit on 12 of 18 . The teams played even in the first freethrow attempts, quarter, each scoring eight. The Nelson Countys Daryl Morse Raider defense clamped down on scored 12 points. Nelson hit 15 field Nelsons speed in the second goals and went two-for-six at. the quarter, holding Nelson to one point foul line."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "first win against that <mark>Appomattox</mark>. The <mark>Raiders</mark> scored 16 team in"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "first win against that <mark>Appomattox</mark>. The <mark>Raiders</mark> scored 16 team in"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.84, 325.09, 1591.24, 413.84], "bbox_id": "a0cb8b358c", "file": "AppomattoxNewspapers_1971-1973a_0619.pdf", "page": 1, "text": "Raiders he Appomattox k Jefferson-Forest 75-53 Wednesday in a Seminole rict basketball game play- 8t Jefferson-Forest. The kept the Raiders unde ed in the district with an ecord and an overall mark"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "<mark>Raiders</mark> he <mark>Appomattox</mark> k Jefferson-Forest 75-53 Wednesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "<mark>Raiders</mark> he <mark>Appomattox</mark> k Jefferson-Forest 75-53 Wednesday"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1339.13, 215.97, 1477.87, 572.18], "bbox_id": "b761779cbf", "file": "TimesVirginian_1980a_0365.pdf", "page": 1, "text": "r Eight fumbles and on ott passing attack combined to result in the Appomattox varsity Raiders third strai ght defeat Friday night at the hands of Radford High School, 30-6. It was by far the best game weve played in four or five weeks, said coach Stuart Justus after the game. We beat them everywhere but the score- board. The Raiders fumbled five times within ten yards of the Radford goal line, including three fumbles inside the one-yard line, according to the coach. You just cant joake mistakes like that in a game and win. The Raiders lone score came in the fourth quarter on a nine-yard pass from quarterback Ronnie Carter to Jay W illiams. The conversion attempt failed. Justus statement that the Raiders beat Radford every where but the scoreboard was no exaggeration. Ap- pomattox had a total of 272 yards rushing to Radfords 143, hut the Raiders were"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "to result in the <mark>Appomattox</mark> varsity <mark>Raiders</mark> third strai ght defeat"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "to result in the <mark>Appomattox</mark> varsity <mark>Raiders</mark> third strai ght defeat"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [168.91, 660.26, 311.83, 763.41], "bbox_id": "a7e03707b2", "file": "TimesVirginian_1981a_0298.pdf", "page": 1, "text": "It may not have been a thing of beauty, but Saturday nights season-opening win over Gret na was a win - and thats just the way the 1981 Appomattox varsity Raiders wanted it. The victory came only two days after Kevin Ferguson, slated to start at quarterback for the Raiders, dislocated his"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "the way the 1981 <mark>Appomattox</mark> varsity <mark>Raiders</mark> wanted it. The victory"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "the way the 1981 <mark>Appomattox</mark> varsity <mark>Raiders</mark> wanted it. The victory"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [283.19, 1012.59, 1477.94, 1138.03], "bbox_id": "c519832ac3", "file": "AppomattoxNewspapers_1974-1975a_0500.pdf", "page": 1, "text": "inteed or money back. After a 18-18 tie between the Appomattox JV Raiders and the Rustburg Imps both teams have a record now of 4 wins, 2 losses and 1 tie. After a scorelss first quarter Appomattox with 655 left in the second period of play teamed Mitchell with Vaughan for a 30 yard score on a pass. P.A.T. was no good. minutes later when"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "18-18 tie between the <mark>Appomattox</mark> JV <mark>Raiders</mark> and the Rustburg Imps"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "18-18 tie between the <mark>Appomattox</mark> JV <mark>Raiders</mark> and the Rustburg Imps"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2117.04, 739.57, 2393.73, 996.66], "bbox_id": "bb88ae530c", "file": "AppomattoxNewspapers_1971-1973a_0102.pdf", "page": 1, "text": "Gordon Staples, Captain of the Appomattox County Rescue Squad, is shown above presenting the Homecoming  game ball to Arthur Layne, who held the winning ticket drawn at half-tim e at the Homecoming Football Game played here on Friday night at Bragg Stadium. This project, through the co-operation of Coach Jerry Robinson and his staff, was sponsored by the Appomattox County Rescue Squad and prov ed to be a real winner! The mighty Raiders of Appomattox County High School playing with this football shut out the Colonels from Alta vista by a score of 10 to 0. Our Raiders are real winners! The Rescue Squad members, selling tickets for chances on the  game ball cleared 144.00 on the project. The Rescue Squad definitely came out on the win-side Last but not least, Arthur Layne took home the  game ball autographed by the coaches and the Raiders  Arthur Layne was another real winner! C Of C i Plans Membership Drive"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "real winner! The mighty <mark>Raiders</mark> of <mark>Appomattox</mark> County High School playing"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "real winner! The mighty <mark>Raiders</mark> of <mark>Appomattox</mark> County High School playing"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1753.85, 479.09, 1951.35, 593.03], "bbox_id": "914b5bec0a", "file": "AppomattoxNewspapers_1971-1973a_0183.pdf", "page": 1, "text": "Eighth Grade Raiders of Appomattox Inter mediate School above will play William Campbell Generals Thursday at 415 in an away game followed by another away game on Jan. 18 against Holy Cross with Rustburg, Amherst, Nelson County, Staunton River and Gretna also on the list of opponents in coming weeks. Coach Ken Ferguson far right, says hes really proud of his boys and that students parents and other fans are always invited to the 415 contests both at home and away. Next"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "Eighth Grade <mark>Raiders</mark> of <mark>Appomattox</mark> Inter mediate School above"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "Eighth Grade <mark>Raiders</mark> of <mark>Appomattox</mark> Inter mediate School above"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [149.49, 337.4, 318.04, 941.43], "bbox_id": "900c01d498", "file": "TimesVirginian_1983a_0140.pdf", "page": 1, "text": "Coach Howard Claboughs Raider varsity baseball team won three heart-stoppers last week to lift their record to 8-2, and place the local high school team firmly in first place ta the Seminole District. In a game played ta winter-like conditions Tuesday night, the Raiders defeated Altavista 54 in a game that went an extra inning. Altavista jumped to a 3-0 lead ta the first inning, but the Raiders came back ta the second inning to score two runs on a Greg Mayberry home run, and base hits by Tim Bennett and Alan Edmonds, which drove Paul Johnson across the plate. The Raiders tied the score at 3-3 ta the third inning after Mayberry walked, stole second, advanced to third base on a pass ball, and crossed the plate on Paul Johnsons grounder to short stop. Altavista went back out ta front ta the fourth inning, scoring one run on an error and a sacrifice fly. The Raiders tied the score ta the sixth inning when Tim Bennett walked, Edmonds singled, Jody Williams hit a fly ball to center and Rodney Bryant was hit by a pitch to load the bases. Gary Ferguson then walked, giving Tim Bennett a free pass across home plate. In the top of the eighth inning, the Raiders scored their final run of the game, when Edmonds got to first base on a fielders choice, and Williams hit a single advancing Edmonds to third base. Bryant then hit a sacrifice fly, scoring Edmonds. Altavista was unable to score ta their half of the inning. Leading hitters against Altavista were Edmonds two for four Bryant one for three, Mayberry one for three, one homer, Kevin Ferguson one for three, Bennett one for two and Jody Williams one for four. The Raiders knocked Liberty out of the first place ta the Seminole District ta a come-from-behtad effort Wednesday at Appomattox., The Raiders took the lead 1-0 ta the second inning, when Alan Edmonds hit a home run. In the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "come-from-behtad effort Wednesday at <mark>Appomattox</mark>., The <mark>Raiders</mark> took the lead 1-0"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "come-from-behtad effort Wednesday at <mark>Appomattox</mark>., The <mark>Raiders</mark> took the lead 1-0"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1834.98, 426.04, 1981.36, 774.48], "bbox_id": "3141b98337", "file": "TimesVirginian_1980a_0027.pdf", "page": 1, "text": "but the defense looked a Utile lazy.  , Joining Kelso on the score- card were Shane Abernathy with nine points, Terry Woods, with eight, Kim Humbles with seven points, and M arvin Johnson with four. Abernathy led the Raiders in rebounds with eight. Kelso tallied six rebounds in .the game, as did Johnson. The local team went 18-for-43 from the floor 41.9 percent, and sank seven of l i freethrows for a 63.6 percent record. William CampbeU had two player scoring in double figures, T. Wade with 13 points, and E. Walker with 12. The G enerals w ent three-for-11 from the freethrow line 27.3 percent, and sank 15field goals against Appomattox. The Raiders fought a tough Gretna team down to the last seconds of last Tuesdays game, but when the final buzzer sounded, the-Hawks had bested the local team, 50-46."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "sank 15field goals against <mark>Appomattox</mark>. The <mark>Raiders</mark> fought a tough Gretna"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "sank 15field goals against <mark>Appomattox</mark>. The <mark>Raiders</mark> fought a tough Gretna"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1739.97, 441.66, 2007.67, 546.71], "bbox_id": "d29fb1900c", "file": "AppomattoxNewspapers_1971-1973a_0331.pdf", "page": 1, "text": "Appomattox senior Raiders and coaches above practicing for regional semi-finals on Thursday afternoon May 28 had the pleasure of holding and showing the Seminole District Tournament Trophy, won at Brookville Wednesday night as Raiders blasted out a 22-5 victory over Gretna. From left Coach Jerry Robinson, Steve Almond, Jimmy Chandler, Dennis Wilkerson and Coach Ken Ferguson. The Raiders missed the Regional Championship by the narrowest of scores  4-3 losing in the finals to Tunstall at Covington on Saturday."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> senior <mark>Raiders</mark> and coaches above practicing"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> senior <mark>Raiders</mark> and coaches above practicing"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1824.64, 311.33, 1971.24, 592.77], "bbox_id": "7fa7f2a10b", "file": "TimesVirginian_1976_0133.pdf", "page": 1, "text": "Andy Wingfield had two hits, including a home run, and four RBIs for the Raiders but the Amherst Lancers, with two home runs off the bat of shortstop Lennie Irvin, defeat ed the Appomattox team 17 to 8 in Seminole District baseball played on the Raider field on April 7. Mitch Eggleston was the startin g pitcher for Appomattox, followed by Rob ertson, W ooten and Hix. Season record for Amherst is 4-1 and for the Raiders 1-3. APPOMATTOX STATISTICS ah-r-h-rbi ... D. Harvey 3b 2-2-0-0 Franklin If 2-1-0-0 Wingfield c 4-3-2-4 Mitchell If 4-1-1-0 Hix dh 2-0-0-0 Eggleston p 1-0-0-0 Wagner ss 3-0-0-0 R. Harvey lb 3-0-0-0 Wooten 2b 0-0-Ö-0 Hix p i-0-0-0 Doss ph 1-1-1-0 McFadden ph 1-1-0-0 Bohannon ph 3-1-1-0."}, "highlight": {"text": {"matched_tokens": ["Raiders", "APPOMATTOX"], "snippet": "4-1 and for the <mark>Raiders</mark> 1-3. <mark>APPOMATTOX</mark> STATISTICS ah-r-h-rbi ... D. Harvey"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "APPOMATTOX"], "snippet": "4-1 and for the <mark>Raiders</mark> 1-3. <mark>APPOMATTOX</mark> STATISTICS ah-r-h-rbi ... D. Harvey"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [325.71, 387.43, 478.21, 1174.99], "bbox_id": "66ce2c3ffb", "file": "AppomattoxNewspapers_1971-1973a_0105.pdf", "page": 1, "text": "5-20 . 1 2 ! 71 i The Appomattox R a i d e r s closed out their 1971 football season with a 10-0 win over the Altavista Colonels in a Semi-  nole District game that was the j final game for both teams. It was homecoming for the Raid- ers and gave them a record of I 8-2 overall for the season and  5-2 in the district. The lost j dropped Altavista to a 6-4 over- j all and a 4-2 district mark. It was a hard-hitting contest that saw the Raiders lose the ball three times on fumbles and Altavista turned it over two times that way, also. The Raid ers looked strong in the opening quarter as they took the kickoff and started on their own 30 yard line. They drove to the six yard line of Altavista and fumbled and Franklin recovered the fumble for the Colonels. On the second play the Colonels fumbled and Steve Lawson recovered for the Raiders and Appomattox had the ball on the four with a first down, but a strong colonel d ef ens e, held the Raiders on the one foot line and took over. A strong Raiders defense allowed the Colonels nine yards in three tries and forced them to punt and Appomattox got the ball back at mid-field and started to drive again. They drove to the 13 of Altavista and with 843 left in the second quarter, the kicking specialist for Appomattox Jim my Chandler booted a 30 yard field goal to give Appomattox a 3-0 lead. The rest of the second quarter was an exchange of punts between the two teams as defense became the name of the game. The third quarter was also defense but toward the last of the quarter Appomattox punted and the Colonls started on their own 48. They drove to the 35 of I Appomattox as the quarter ran  out and the Raiders defense held on a fourth down. The Raiders drove 65 yards in eight plans with the aid of a 15 yard penalty as quarterback Bobby Layne swept the end on a two yard touchdown ru n and J i m m y Chandler kicked the point after for a 10-0 lead with 801 left in the game. It was then defense again as neither team could drive thereafter, Mike McCormick led the rushing for the Raiders with 50 yards on 18 carries and Jimmy Chandler had 48 yards on 15 carries, which was below both of their a v e r a g e s in other"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "Lawson recovered for the <mark>Raiders</mark> and <mark>Appomattox</mark> had the ball on"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "Lawson recovered for the <mark>Raiders</mark> and <mark>Appomattox</mark> had the ball on"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.46, 969.16, 2015.56, 1000.56], "bbox_id": "46a5aedbea", "file": "TimesVirginian_1980a_0374.pdf", "page": 1, "text": "THE UNMt VEKSHIN  the Appomattox Junior .Varsity Raiders ended the season last wajeklB a deadlock with William Campbell for-the district title, with a 7-1 Seminole District record."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "THE UNMt VEKSHIN  the <mark>Appomattox</mark> Junior .Varsity <mark>Raiders</mark> ended the season last wajeklB a deadlock with William Campbell for-the district title, with a 7-1 Seminole District record."}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "THE UNMt VEKSHIN  the <mark>Appomattox</mark> Junior .Varsity <mark>Raiders</mark> ended the season last wajeklB a deadlock with William Campbell for-the district title, with a 7-1 Seminole District record."}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1343.04, 237.03, 1526.26, 447.72], "bbox_id": "afccc266c3", "file": "TimesVirginian_1983a_0357.pdf", "page": 1, "text": "The Raider varsity football team lost a hard-fought, physical battle to Buckingham High Schools Knights at Buckingham Friday night, 27-14. ftThe game started well for Appomattox, with the Raiders building 14-0 lead on a 95-yard return of the Opening kickoff by Tyrone Abbitt, and a 33-yard touchdown run by Ron Kelso following a Buckingham fumble Recovery, also in the first quarter, hi But Buckingham quarterback Wfll Gowin scored from eight yards out Biter in the first quarter, and Gowin passed to Luke Davis for a 16-yard touchdown reception in the second quarter. T h e game.then turned into a physical Battle in which four Raider players mere injured and taken from the field."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "game started well for <mark>Appomattox</mark>, with the <mark>Raiders</mark> building 14-0 lead on"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "game started well for <mark>Appomattox</mark>, with the <mark>Raiders</mark> building 14-0 lead on"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [129.84, 366.71, 315.96, 596.1], "bbox_id": "e66cdfbe25", "file": "TimesVirginian_1983a_0351.pdf", "page": 1, "text": "Rustburgs Red Devils dealt the Appomattox varsity football Raiders their second foes of this season last Friday, a 7-41 contest played under  often rainy skies. h The only score of tha game came in - the second quarier, when Rustbuigs Brian Anderson connected on a 24-yard scoring pass play to receiver Bernard Jefferson. The conversion kick hy Gary Stanley generated the final point of the game. Hie Raiders stopped two other serious Red Devil scoring threats, but mounted no sustained scoring threats of their own. Appomattox suffered from injuries and penalties Friday night.Seven Raider starters were injured, mdwfing running bock Steve Hamfott who was the leading scoter in the  district."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "Red Devils dealt the <mark>Appomattox</mark> varsity football <mark>Raiders</mark> their second foes of"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "Red Devils dealt the <mark>Appomattox</mark> varsity football <mark>Raiders</mark> their second foes of"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.96, 707.15, 1515.6, 845.94], "bbox_id": "bc935a6489", "file": "TimesVirginian_1976_0054.pdf", "page": 1, "text": "Liberty Wins The Raiders were not able to stop Vincent Lawry as he shot 33 points to lead the scoring in Libertys win over Appomattox 68-60. The Raiders were led by i David Kelso who scored 14 points and Bobo Trent,11, while Epnoch Robinson added his 10 markers for Appomattox. By halftime, Liberty had"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "in Libertys win over <mark>Appomattox</mark> 68-60. The <mark>Raiders</mark> were led by i"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "in Libertys win over <mark>Appomattox</mark> 68-60. The <mark>Raiders</mark> were led by i"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1417.89, 737.19, 1479.08, 818.84], "bbox_id": "dd7f457846", "file": "AppomattoxNewspapers_1974-1975a_0497.pdf", "page": 1, "text": "four thousand P the ACHS - minole league r. Wow. Unde- are rare in I Appomattox can he Raiders. The team keeps"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "four thousand P the ACHS - minole league r. Wow. Unde- are rare in I <mark>Appomattox</mark> can he <mark>Raiders</mark>. The team keeps"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "four thousand P the ACHS - minole league r. Wow. Unde- are rare in I <mark>Appomattox</mark> can he <mark>Raiders</mark>. The team keeps"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [508.82, 253.69, 691.04, 492.88], "bbox_id": "a35d1d2f42", "file": "TimesVirginian_1983a_0338.pdf", "page": 1, "text": "conversion run by Andre McCoy was good, and the Raiders possessed a 20-0 lead. Liberty got on the scoreboard next, with a 35-yard run and two-point conversion, to close the gap to 20-6. But the elation was shortlived, as Dwayne Patterson took the ensuing kickoff and dashed 90 yards for the Raiders fourth touchdown of the game, apd a 26-8 Appomattox lead. The Raiders final score came in the fourth quarter, when Keith Fanney went seven yards from his fullback slot to score. Fanney added two more points on the ensuing conversion run, and the Raiders held a 34-3 lead. Liberty scored again in the fourth quarter against the Appomattox reserve squad, and following an unsuccessfol conversion attempt, the score stood at 34-14, which was the tally when the gun sounded hiding the"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "game, apd a 26-8 <mark>Appomattox</mark> lead. The <mark>Raiders</mark> final score came in"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "game, apd a 26-8 <mark>Appomattox</mark> lead. The <mark>Raiders</mark> final score came in"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [380.18, 442.24, 534.62, 1238.2], "bbox_id": "efc5705846", "file": "AppomattoxNewspapers_1971-1973a_0475.pdf", "page": 1, "text": "cepted By 1 1 Punts 4-37.7 3-30 Fumbles Lost By 1 2 Penalties 10-60 1-5 Bobby Layne, the Raiders quarterback, only completed three passesxduring the game but two of them were for long yardage ahd touchdowns that gave the Raiders a 20-12 win over the Gretna Hawks last Saturday night. The game was a Seminole District contest played at Grenta and left the Raiders 2-0 in the district and made them 3-1 overall. Glenn Doss got the Raiders on the scoreboard first as he went in from seven yards out  in the first quarter with 125  left in the quarter. Phillip Goode kicked the extra point to give the Raiders a 7-0 lead. The scoring opportunity was set up when Gretna fumbled on their own 43 and Mike Preston recovered the ball for the Raiders. It took Appomattox 11 plays to go the distance as Doss carried the ball 28 of the 43 yards. Neither team could do any damage in the second quarter as Appomattox did not gain a first down and Gretna did most of theirs passing. There was no scoring in the quarter and the Raiders took a 7-0 lead to the dressing room at the half. The Raiders made it 13-0 in the third quarter as they took a Gretna punt and started on their own 30. They moved the 70 yards in seven plays with Bobby Layne hitting Bill Austin with a pass for the last 27 yards and a touchdown. A pass for the two extra points failed and it was 13-0 with 659 left in the third quarter. Gretna came right back with a score with 223 left in the quarter to close tne gap to 13-0 as the extra point missed. Jerry Bond scored on a 7 yard run. At the start of the fourth quarter Layne again went into action as this time he threw a 51 yard scoring strike to Mike Gallier who made a beautiful catch falling and then regain ing his balance and going the rest of the distance untouched for the score. Phillip Goode kicked the point after with 1151 left in the game and it was 20-6. The drive had started in the third quarter on- the Appomattox 24 yard line. Gretna got on the board again with 239 left in the game as Jim Moon passed eight yards to Tyrone Kelly for a score. The extra point was no"}, "highlight": {"text": {"matched_tokens": ["Raiders", "Appomattox"], "snippet": "the ball for the <mark>Raiders</mark>. It took <mark>Appomattox</mark> 11 plays to go"}}, "highlights": [{"field": "text", "matched_tokens": ["Raiders", "Appomattox"], "snippet": "the ball for the <mark>Raiders</mark>. It took <mark>Appomattox</mark> 11 plays to go"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1324.52, 284.09, 1455.52, 1334.98], "bbox_id": "3fc0b76085", "file": "TimesVirginian_1980a_0306.pdf", "page": 1, "text": "By BILL SHERROD Eight years is a long time to wait. Just ask anyone who follows Appo mattox County High School varsity football. But after eight years of playing an opponent, victory is sweet, andit was particularly succulent to the approximately 2,500 assem bled in Bragg Stadium Friday night when the Raiders defeated arch-foe Rustburg, 24-21. Summing up the essence of FridayTs game, coach Stuart Justus says, We outplayed them in the secoid half, thats all there is to it. A tenacious Raider defense held the Red Devils to a total of 30 yards offense in the second half, and the Devils executed only 18 plays on offense in the second half. Rustburg jumped out to an early two-touchdown advantage, and added a third score in the second quarter. But the Raiders narrowed the margin with three scores in the second quarter, on a one-yard plunge by quarterback Ke vin Ferguson, a 47-yard touchdown pass from Fer guson to Ernest Daye, and a 50-yard touchdown pass from Ferguson to Pete Mclvor. The score stood at 2118 as the first half ended. The Raider defense stif fened in the second half, and tailback Dennis Fleshmans 40-yard scamper into the end zone gave the home team the advantage as the game entered the home stretch. But, with time running out in the fourth- quarter, the Raiders let Red Devil Wellington Wheaton get around the right corner of the defense on a punt return, and the speedy Rustburg runner took the ball into the end zone. But alas, football is a game of breaks, and Wheatons scor ing run was canceled by a clipping penalty. I thought the game was pretty even as far as breaks go, Justus said in reference to the recalled touchdown. We did give them a touchdown in the first half the Devils scored one of their three touchdowns on a fumble recovery following a bad snap from center on a punt attem pt deep in Appomattox territory. The Raiders passing game surprised many at Fridays contest. Ferguson went five for 11 and 185 yards, including Ernest Dayes two receptions for 109 yards and a score, and Dennis Fleshmans two catches for 27 yards. Fleshman also led  the Raiders running game, carrying 19 times lor 132 yards. The Raiders got 15 first downs in the game, and Rustburg nine, including three on penalties. Were still making some mistakes, Justus said of his young tem. Penalties, players not being on the field when theyre supposed to be, are two examples. Still, the coach is pleased with the progress of his team. Theyre progressing with each game, which is"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "attem pt deep in <mark>Appomattox</mark> territory. The <mark>Raiders</mark> passing game surprised many"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "attem pt deep in <mark>Appomattox</mark> territory. The <mark>Raiders</mark> passing game surprised many"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.63, 244.83, 1855.23, 380.37], "bbox_id": "f02f300b09", "file": "AppomattoxNewspapers_1971-1973a_0222.pdf", "page": 1, "text": "Appomattox Junior Varsity Raiders won their last game of the season Monday afternoon defeating Gretna 62-61 at Gre tna in a game postponed from Thursday because of snow. Coach Paris Lenon says that the win-loss column could have been better for this year, but another years experience will help the boys next year and that hes proud of the spirit of his team."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> Junior Varsity <mark>Raiders</mark> won their last game"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Raiders"], "snippet": "<mark>Appomattox</mark> Junior Varsity <mark>Raiders</mark> won their last game"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
