{"document": {"bbox": [1563.11, 1202.55, 1834.74, 1428.1], "bbox_id": "717380a1cf", "file": "AppomattoxNewspapers_1939-1943a_0159.pdf", "page": 1, "text": "what do they mean to you? Here at Appomattox, they mean a lot, for, while new war bums Eur opes cities and kills innocent thous ands. work goes on quietly in the peaceful fields around Old Appomat tox Court House, restoring a natio nal shrine of peace, the sacred sites where General Robert E , Lee sur rendered his gallant army to Grant on April 9, 1866.. Ushering in the era of modem America, this event took place in the famous McLean House, long since tom down. fThe National Park Ser vice, which administers the historic area, now known as the Appomattox Court House National Historical Monument, plans a reconstruction of the McLean House, of the old court house itself, pictured herewith, and the repair of historic buildings still held at 11 oclock In- standing. Upon completion of the M.on September 22. project, the village will be not only meeting nour will be"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "now known as the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, plans a reconstruction of"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "now known as the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, plans a reconstruction of"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2210.64, 930.15, 2383.25, 1459.04], "bbox_id": "be222d1e3d", "file": "AppomattoxNewspapers_1943-1947a_0010.pdf", "page": 1, "text": "The office of the Custodian, Ap pomattox Court House National Historical Monument, Appomattox, today announced that title to the North Caiiolina i Monument Tract and Monument on the Appomattox Battlefield has been accepted uy the Secretary of the Interiors Of fice, on behalf of the United States. Donated by the State o f Naîtlr Carolina,the fifty-foot square tract and the granite monument will be included in the area admin istered by the Appomattox Court House National Historical . Monu ment under the jurisdiction of the National Park Service and the Uni ted States Department of the In terior. The North Carolina Monument was erected by the State of North Carolina in 1905 to locate the pos ition of North Carolina troops fir ing the last volley on the morning of April 9, 1865, in the last battle fought by Lees Army of Northern Virginia. A few hours after this action, Lee and Grant met at the McLean House half a mile distant from the scene of the last engage ment and signed the agreement for the. surrender of Lees Confederate forces. The position of North Carolina troops firing the last volley was located and identified by survivors of Coxs North Carolina Brigade on a visit to the battlefield in October, 1904. The story of the visit of these survivors and their location of pos itions held by North Carolina troops is told in a pamphlett pub lished by the North Carolina Liter ary and Historical Society in 1904. The map of the Appomattox Battle field which appears in this pamph lett is one of the few accurate source maps for the last engage ment of the Army of Northern Vir ginia. National Park Service officials stated, in reporting donation of this trac, that as soon as conditions permit thé road leading to the North Carolina Monument would be widened and improved and park ing facilities at the monument would be provided."}, "highlight": {"text": {"matched_tokens": ["Court", "House", "National", "Historical", "Monument", "Appomattox"], "snippet": "the Custodian, Ap pomattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, <mark>Appomattox</mark>, today announced that title"}}, "highlights": [{"field": "text", "matched_tokens": ["Court", "House", "National", "Historical", "Monument", "Appomattox"], "snippet": "the Custodian, Ap pomattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, <mark>Appomattox</mark>, today announced that title"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2364.24, 1027.94, 2530.19, 1082.34], "bbox_id": "3a9adb7b71", "file": "AppomattoxNewspapers_1939-1943a_0441.pdf", "page": 1, "text": "The local National Park Service office announced today the appoint ment of James C. Price, of Appo mattox to fill -the position of Ranger at Appomattox Court House National Historical Monument."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "position of Ranger at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "position of Ranger at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>."}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1533.86, 556.62, 1710.89, 1228.77], "bbox_id": "cd779920f7", "file": "AppomattoxNewspapers_1952-1954a_0379.pdf", "page": 1, "text": "The battle flag of the famous 61st Virginia Infantry Regiment, Army of Northern Virginia, will be pre sented to Appomattox Court House National Historical Monument, as a memorial to Virginias distinguished historian, Dr. Douglas S. Freeman. Exercises marking the donation of this Confederate battle flag will be held at the McLean House, at 400 P. M., October 6. Mrs. Douglas S. Freeman, an nouncing the gift of this trophy to the National Park Service, stated that it was in accordance with the wish of her husband. Dr. Freeman, in his address on the occasion of the dedication of the reconstructed Mc Lean House at Appomattox Court House on April 16, 1950, held this flag in his hand as he brought his speech to a close. His words in this portion of his address are reprinted elsewhere in todays paper. For Dr. Freeman, this fiad had For Dr. Freeman, this flag had ed the cause of the Confedearte States of America under this flag, following the fortunes of the Army of Northern Virginia and General Lee to the surrender at Appomat tox Court House on April 9, 1865. The flag was laid down with the arms of the survivors of the regi ment. It was carried off the field by a Federal officer. Dr. Freeman, sev eral years ago, ran across a refer ence to this- flag and bought it back to Virginia. .... T h e f l a g is 50 x . 37 .in c h e s  m o u n te d I on a hickory sapling 9 feet long, which Dr. Freeman -himself cut in the woods as a flag-staff. The presentation of the flag at the McLean House on October 6 will be part of the program to mark the premiere showing of the DuPont Cavalcade of America film, Sunset at Appomattox. This film already noted as an outstanding documen tary film on American history, will be shown at a luncheon at the Vir ginian Hotel, Lynchburg, on October 6, prior to the exercises at the Mc Lean House. The original print of the film and tbp battle flag of the 61st Virginia  be accepted for the Federal Government by Conrad L. Wirth, Director of the National Park S6rviC6 At the request of Mrs. Freeman, who will be aunble to be present at the exercises, Mr. Elbert Cox, Re gional Director, Region One, Na tional Park Service, Richmond, Va., will make the presentation speech. Distinguished civic leaders invited"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "be pre sented to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, as a memorial to"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "be pre sented to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, as a memorial to"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2179.86, 1558.88, 2347.0, 1667.27], "bbox_id": "46968ecd16", "file": "AppomattoxNewspapers_1952-1954a_0215.pdf", "page": 1, "text": "Rep. W. M. Abbitt this week in troduced a bill in Congress to change tha name of the Appomattox Court House National Historical Monument to the Appomattox Court House National Historical Park. It is beliaved that the word Park would be more descriptive of the National Park Service historical area here than the word Monu ment."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument", "Appomattox", "Court"], "snippet": "tha name of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> to the <mark>Appomattox</mark> <mark>Court</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument", "Appomattox", "Court"], "snippet": "tha name of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> to the <mark>Appomattox</mark> <mark>Court</mark>"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.9, 1063.84, 1836.47, 1748.49], "bbox_id": "9bfe464936", "file": "AppomattoxNewspapers_1939-1943a_0261.pdf", "page": 1, "text": "part of the origin 1 will be saved nd restored and the rest of the om will be painled to conform. In the Jail, a lattice work of strap ten was found under the plaster,  ext to the brick wall. Strap iron was also discovered under the fltmrs nd on top the rafters. The triple ViTed windows and rings in _ the f 00 -s for the more unruly prison- r s combined with all the concealed ron work made this one of the s rongest jails in the antebellum South, no doubt, and more break- m oef than many county lock-ups m Virginia today. Research and study of the various buildings indicates that removals of laror construction will be as necessary as the additions of old portions no longer landing. Most important restoration at the A.ppomattox Court House National Historical Monument will be the re- onstruction of the McLean House. M. E. Dunap purchased the house n 1891 for removal to the Chicago Worlds Fair as a museum exhibit. He later chose Washington, D. C., as the site for the re-erection, but ctually never moved the house at all, though the demolition was com pleted in 1893. C. W Hancock, the ocal contractor hired tc tear the building down, was also to have put it bsck together. He made fairly detailed specifications and employed P. C. Hubard of Lynchburg to draw plans. These plans and specifications purchased from Mr. Hubard and Mr. Hancocks heirs, will form the basis for the reconstruction, along with many wartime and other photo graphs, old drawings, and writings found by the historical staff of the Monument. Mr. Hubard is still a resident of Lynchburg. Archeological investigation at the site of the McLean House has been underway since early spring. The purpose of this investigation is two-j fold to check the Hancock-Hubard I drawings and specifications and to find new facts. The overall dimen sions of the house, as worked out by the archeologist, check almost to the inch with the Hancock-Hu bard data. New finds were to be ex pected because Hancock made the plans for his own infomation and had the actual material to use in the rebuilding and thus naturally eft out certain data. One of the finds was the stone and brick hearth on the ground flood. Also uncovered were remnants of the old wood stringers that supported the ground floor boards, as well as a drainage pit designed to keep the basement dry at all times. After the completion of the arch eological investigation and the draft ing of measured drawings, the act ual reconstruction will begin. It is expected that this will be some"}, "highlight": {"text": {"matched_tokens": ["A.ppomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "important restoration at the <mark>A.ppomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> will be the re-"}}, "highlights": [{"field": "text", "matched_tokens": ["A.ppomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "important restoration at the <mark>A.ppomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> will be the re-"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2189.28, 553.34, 2523.44, 1375.3], "bbox_id": "b8d9ee75c4", "file": "AppomattoxNewspapers_1939-1943a_0254.pdf", "page": 1, "text": "On Friday, April 4, Camp NP28, Appomattox, Va., wil celebrate the occasion of the eighth anniversary of the Civilian Conservation Corps, with an open house at the camp and at Old Appomattox Court House, scene of Lees surrender to Grant, the area which the camp is developing. The Appomattox Court House National Historical Monument, a unit of the National Park Service, commemorates the ending of the Wrr Between the States and the re union of America. Company 1351, Camp NP28, Colored Veterans of the First World War, came to the area, July 22, 1941. National Park Service plans call for the reconstruction of the Mc Lean House, where the famous meet ing of Lee and Grant occurred Ap ril 9, 1865, reconstruction of the old court house builidng, and res toration of existing historis houses.  he old court house burned in 1892. M. E. Dunlap, of Niagga Falls, Y, had the McLean House torn down in 1893 for re-ereetton as a museum in Washington the museum proposal was not carried out, how ever, and the dismantled surrender house mouldered on the ground. After the rebuilding of the court house at a new site, now the town of Appomattox, the old village de clined. One of the first jobs under- aken by the men of Camp NP28 was the removal of honeysuckle and the dense corpses of locust trees that had grown around the de serted village.  Next they began the removal of non-histpric struc tures and the preliminary recondi tioning of the old houses to be res tored. During the coming months more clearing .will be done to ap proximate the 18,5 appearance of he village and further work on the restoration of the historic houses will be undertaken.. Another CCC _ob of importance is fire hazard re duction in the wooded areas of the Monument. In the near future a by-pass road, to be a part of Virginia Highway 24, will be built around the old village in order that the village site can be completely restored to its historic appearance. At present, Highway 24 runs directly through the village. Rock for this by-pass road has been gathered and crush ed by the CCC men and more is to be obtained soon and1 a quarry to be opened on park property. Most interesting of the develop ments at the Old Court House is the excavation of the McLean House siie. Here CCC enrollees are care fully digging out the foundation bounds preparatory to the actual work of reconstruction. An histori cal study of the house and its ap pearance has been completed, based on old writings, photographs, draw ings and plans made at the time of the demolition of the house. P. C. Hubard of Lynchburg drew th e plans for C. W. Hancock, the Appo mattox contractor hired to handle the job in 1893. These plans and Hancocks specifications for the re building were purchased by the Gov ernment last year from the late _ _. __ __ __ ___ _____ Mr. Hancocks sons and Mr. Hu-1 _ v .. burg 8tU1 a reident ,f Lynch 745 P. M. Evening Worship. Co"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "camp is developing. The <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, a unit of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "camp is developing. The <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, a unit of the"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.76, 1074.46, 2180.71, 1209.75], "bbox_id": "5751135646", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "In connection with the Govern ments general policy of shifting CCC forces to essential defense act ivities, Hubert A. Gurney, Superin tendent, Appomattox Court House National Historical Monument, is at tending a Fire and Defense Training School at Rock Creek Park, Wash ington, D.C., M-arch 16-21. This course is given with a view to train ing the personnel of the various Na tional Park agencies in carrying on Defense and Conservation activities under conditions imposed by recent changes."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "A. Gurney, Superin tendent, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, is at tending a"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "A. Gurney, Superin tendent, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>, is at tending a"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1963.88, 536.07, 2135.71, 1355.11], "bbox_id": "9fd940b769", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "In a recent visit to the Old Sur render Grounds, Mrs. Bessie Fergu son and Mrs. Lennie Gills told the National Park Service staff about many of the buildings in the historic vi lage, particularly the homes and business places of their father, Will iam Rosser, and their uncle, John Rosser. Mrs. Fergusons former home is now the office of the Appomattox Court House National Historical Monument. They expressed the belief that Mrs. Mary Ellen Hickok, of San Diego, California, might remember something of the old tavern. Her grandfather, Wilson Hix, was the owner at the time of the surrender. A letter was dispatched to Mrs. Hickok, who answered not only with written information, but also with a detailed map-drawing showing all the tavern  buildings and gsounds in de tail. The tavern was her home until she was fourteen years old. A good deal of the information supplied corroborated previous suppositions and some was entirely new. An ex ample of he value of this informa tion is the question of the wooden wing on the west end of the main tavern building j this wing was known to have existed in 1865 it shows up in a wartime photograph, out he trees and shadows obscure details Mrs. Hickok furnishes the first definite knowledge of this wing. It was used as a dining room, and has long since been removed. De tails of the two brick annexes, which were used as guest houses, are also shown, as well as a wooden ser vants quarters behind the main house. The wooden structure stood until recent years, and the three brick structures still stand. Inform ation such as that supplied by Mrs. Hickok will enable the National Park Service to restore the tavern group to its 1865 condition with perfect fidelity. The tavern, according to old re cords, was built in 1819, by Alexan der Patteson and was an important itage stop on the line between Cum berland! County and Lynchburg, wned by Patteson and his brother, Lilburne. In the middle nineteen hundreds the spot was a thriving place, with coaches hearing such ro mantic names as  The Davy Crock ett, her of the Alamo, plying the ,ild stage route. At the time of the formation of Appomattox County, in 1845, the tavern was the property of Captain John Raine. Clover Hill, the name of the place, attached It self to the county seat which was established there in the 1840s, and the town at the time of Lees sur -  render was known both as Appo mattox Court House and Clover Hill the name Clover Hiil still survives as a magesterial distict Such information as hat supplied by Mis. Hickok, adding to previous knowledge and clarifying many point is always very welcome, Sup- rintendent H. A. Gurney points out. He and his stelf ari always in terested in seeing old photographs nd drawings and are gratified at the interest shown by loca people n the work of restoring the scene of the village where a new United States was born when brothers laid down the sword on April !, 1865."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "the office of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>. They expressed the belief"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "the office of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark>. They expressed the belief"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2164.54, 729.41, 2502.79, 1114.75], "bbox_id": "b92f78d1c2", "file": "AppomattoxNewspapers_1952-1954a_0263.pdf", "page": 1, "text": "delivered by Mrs. Gates at the after noon session, which will convene at 130. Presentation of work by officers, directors and committee chairmen will be heard during the afternoon session. New business matters will be presented and reports will be made by committee chairmen. Invitations for the 1954 meeting will be ex tended. Adjournment will follow the singing of Blest Be the Tie, The host chapter and guests will then go by cars to the Appomattox Court House National Historical Monument and make a guided tour of the battleground area, with Superintendent Hubert A. Gurney and Mrs. E. Carroll Smith as escorts. The social highlight f the day will be a tea given in the spacious dining room on the first floor of the vTnftt Division Other state officers j McLean House. The Appomattox vtrgi  ... , Kif,nJniiAii I Garden Club will iilace flower ar and visiting guests wni be mtioduced th  storei h v Mrs. Crawley. .angemcnis tnrougnour me resioreu by Mrs. Crawley. Mrs. Jerry Allen Burke, historian, Appomattox Chapter, will present the widows of Confederate Veterans of Appomattox County. Following the appointment of committees, Mrs. David E. Goode will render a solp. The secretary, Mrs. Lacy, will call the roll end chapter reports will be UmRwdtb three minutes each. A re port e the Credential Committee will be heard, after which there will be  recess for luncheon. The Presidents Message will be"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "by cars to the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> and make a guided"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "by cars to the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> and make a guided"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2057.05, 528.27, 2231.4, 901.17], "bbox_id": "ff39b28224", "file": "AppomattoxNewspapers_1939-1943a_0084.pdf", "page": 1, "text": "all the land necessary or desirable for the establishment of the said monument is vested in the United States NOW, Therefore, I -Harold L. lekes- Secretary of the interior, un der and by virtue of the authority Conferred Upon fills Secretary of the Interior by he said act of August 13. 1935, dortreby designate the following desbribed land with the structures thereon -Wp be the Ap pomattox Court House National His torical Monument then follows the detailed boundaries of the 970 acre tract, The ottfer closes with this statement The ladiminMtraitioTf, troltedtion, And development of the Appomattox Court House National . Historical Monument shall he exercised under the directionof the Secretary of the Interior by the National Park Service, subject to the provisions of tW Act of August 2B, 1916, entit led An Act to jgtablish a National Park Service, and for othjer purpos es, as amended. Warning iB expressly given to all unauthorised persons nos to appro priate, injure, destroy deface or re move any feature of this national monument. In witness whereof,,.3 have here unto set my hand and caused the official seal of the Department of the Interior to We affixed in the City df Washington, this 10th day of . April, 1940. , Signed Hare Secretary of"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "And development of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> . <mark>Historical</mark> <mark>Monument</mark> shall he exercised under"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "And development of the <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> . <mark>Historical</mark> <mark>Monument</mark> shall he exercised under"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1545.85, 1165.02, 1715.15, 1264.76], "bbox_id": "575d20e891", "file": "AppomattoxNewspapers_1952-1954a_0321.pdf", "page": 1, "text": "A group from the Management and Organization Study Group, from the Secretary of Interior Office in Washington visited the Appomattox .Court House National Historical Monument on Thursday, July 16. In the group were Arthur Jebens, chairman John F. Shanklin, James Beirne, Floyd E. Dominy and Miss Jean McKeever, secretary."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "in Washington visited the <mark>Appomattox</mark> .<mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> on Thursday, July 16."}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical", "Monument"], "snippet": "in Washington visited the <mark>Appomattox</mark> .<mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> <mark>Monument</mark> on Thursday, July 16."}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [875.74, 382.69, 1019.54, 511.73], "bbox_id": "7baf1e90dc", "file": "TimesVirginian_1976_0325.pdf", "page": 1, "text": "HELP WANTED E astern National Park and Monument Asodation, Appomattox Court House National Historical Park is accepting applications for a part-time business manager requiring home bookkeeping, stocking and ordering. Application forms may be obtained from Appom attox Court House National Histori cal Park. _____ ______ 9-2-2t"}, "highlight": {"text": {"matched_tokens": ["Monument", "Appomattox", "Court", "House", "National", "Historical"], "snippet": "astern National Park and <mark>Monument</mark> Asodation, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park is accepting applications"}}, "highlights": [{"field": "text", "matched_tokens": ["Monument", "Appomattox", "Court", "House", "National", "Historical"], "snippet": "astern National Park and <mark>Monument</mark> Asodation, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park is accepting applications"}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [867.08, 394.95, 1011.32, 523.54], "bbox_id": "58ce68f453", "file": "TimesVirginian_1976_0314.pdf", "page": 1, "text": "HELP WANTED E astern National Park, and Monument Asodathm, Appomattox Court House National Historical Park is accepting applications for a part-time business manager requiring some bookkeeping, stocking and ordering. Application forms may be obtained from Appom attox Court House National Histori cal Park. .  - 9-2-2t"}, "highlight": {"text": {"matched_tokens": ["Monument", "Appomattox", "Court", "House", "National", "Historical"], "snippet": "astern National Park, and <mark>Monument</mark> Asodathm, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park is accepting applications"}}, "highlights": [{"field": "text", "matched_tokens": ["Monument", "Appomattox", "Court", "House", "National", "Historical"], "snippet": "astern National Park, and <mark>Monument</mark> Asodathm, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park is accepting applications"}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2487.73, 884.37, 2632.91, 1164.85], "bbox_id": "5572f70f14", "file": "AppomattoxNewspapers_1971-1973a_0229.pdf", "page": 1, "text": "Today visitors to Appomattox Court House National Historical Park journey back into history as they enter the Meeks Coun try Store in the restored vil- lag e of Appomattox Co u rt House. The store has been re furnished in part to its ap pearance during the 1860s. Many items reminiscent of this period are on sale to visitors by the Eastern National Park  Monument Association. One of its store keepers is Winnie Martin of Appomattox pictured above in her period costume. Mrs. Martin along with Mrs. Marion Godsey and several Vol- unteers-In-Parks from Appo mattox have added a historical- touch to the country store in the last few years by appearing in costume. Visitor reactions are very favorable and their visit to the park is greatly en riched by the presence of these gracious ladies of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "Today visitors to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park journey back into"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "Today visitors to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park journey back into"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2234.64, 1507.25, 2409.68, 1787.0], "bbox_id": "d1ff4f04a7", "file": "AppomattoxNewspapers_1952-1954a_0385.pdf", "page": 1, "text": "The Virginia Travel Council is bringing the people who direct travel at Gettysburg, Pennsylvania, includ ing, it is hoped, some of the guides and Ranger Historians of the Na tional Park Service, to see Virginias Civil War points of interest. The group is slated to visit Fred ericksburg National Battlefield Park at 1155 A. M. on October 12 the George Washington National Birth place about 400 P. M. on Oct. 12, Colonial National Historical Park at 200 P. M. on Oct. 13 Richmond National Battlefield Park on Oct. 14 about 345 P. M. the Petersburg National Battlefield Park about 1 1 - 20 A. M. on Oet. 15 Appomattox National Monument about 415 P M. on Oct. 15. The management of the Parkway Motel, Caldwells Tourist Court, and Mauds Hot Shop will entertain this group at dinner at Mauds Hot Shop on the evening of Oct. 15, following their visit to Appomattox Court House National Historical Monu ment."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "following their visit to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Monu ment."}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "following their visit to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Monu ment."}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [512.38, 1061.63, 710.07, 1165.93], "bbox_id": "9b90ba8b0e", "file": "AppomattoxNewspapers_1974-1975a_0017.pdf", "page": 1, "text": "September 23 two new workers arrived at Appomattox Court House National Historical Park having just transferred from George Washington Birthplace National Monument in Westmoreland County. They are both registered Morgan horses with Julianna a four year old mare on the left and Wakefield Denny an 18 month old gelding on the right. Louis Sackett from George Washington Birthplace is holding Julianna and Henry"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "new workers arrived at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park having just transferred"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "new workers arrived at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park having just transferred"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.27, 918.96, 1849.52, 1191.75], "bbox_id": "557d8fc6ad", "file": "AppomattoxNewspapers_1971-1973a_0426.pdf", "page": 1, "text": "R obert R. Madden, 35 Assistant Chief Historian __ Colonial National Historical Park, Yorktown, Virginia, has been appointed Superintendent of Appomattox Court House National Historical Park, it was aniioUilctf  Mo.v.ay by Chester L. Brooks, Director of the National Park Services N ortheast Region. Madden succeeds Frank A. Gould who was named Superintendent of the Lyndon B. Johnson National Historical Site, Texas. A native of Corinth, Missis sippi, Madden received a B.A. degree in history from the University of Southern Missis sippi in 1960. He began his career in the National Park Service in 1963 as a park historian on the Natchez Trace Parkway, Miss.- Tenn.- Ala. Subsequent assignments took him to Fort Frederica National Monument, Georgia, and Great"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "been appointed Superintendent of <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park, it was aniioUilctf"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "been appointed Superintendent of <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park, it was aniioUilctf"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2192.14, 452.57, 2391.67, 641.57], "bbox_id": "7bc758f76b", "file": "AppomattoxNewspapers_1971-1973a_0333.pdf", "page": 1, "text": "Members of the Appomattox Chapter,United Daughters of toe Confederacy, above put on their finest period costumes for Sundays de dication of a monument to Confederate soldi ers which stands near toe graves of Confeder ates and one Union soldier who died at Appo mattox during toe last days of battle before toe surrender of Lee s forces on April 9, 1865. The cemetery is located in Appomattox Court House National Historical Park. Con gressional Representative Watkins M . Abbitt nearest monument on left recalled that both of his grandfathers were Confederate sold iers, that one was with Lee at Appomattox. In his address Sunday he graced the back ground of Virginia s many contributions to toe nation and stated that toe Confederate monu ment was being dedicated in memory of great"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "cemetery is located in <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. Con gressional Representative"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "cemetery is located in <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. Con gressional Representative"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [764.39, 1121.19, 906.49, 1292.48], "bbox_id": "2672f4565f", "file": "TimesVirginian_1978_0076.pdf", "page": 1, "text": "HELP WANTED SALES CLERKBUSINESS MANAGER - FuU time, good pay, and fringe benefits. Person needed to manage and operate smaU book and craft outlet store at Appomattox Court House National Historical Park. Duties involve sales, record keeping, ordering, stocking, and lifting up to 60 lbs. Applications and interviews are being accepted by Eastern National Park  Monument Association 9 -5 , Mon. - Fri. at 352-8782. 2-28-lt"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "craft outlet store at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. Duties involve sales,"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "craft outlet store at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. Duties involve sales,"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.38, 656.1, 1848.62, 814.9], "bbox_id": "789fe1b3b7", "file": "AppomattoxNewspapers_1971-1973a_0330.pdf", "page": 1, "text": "Congressman Watkins M. Abbitt far left was the featured speaker Sunday as the Appomattox Chapter, United Daught ers of the Confederacy, dedicated a monument to Confederate soldiers at the Confederate Cemetery, Appomattox Court House National Historical Park. M rs. Emma Zastrow stand ing next, chapter president and a Real Daughter of the Con federacy, was given special honors in the placing of her name on a bronze plate of the speakers stand. Mrs. Rachel F. Lawson 2nd from right was m istress of ceremonies and Calvin H. Robinson, w riter-historian far right made the presentation speech to honor Mrs. Zastrow. Mrs. Lucille Ferrell not shown introduced Congressman Abbitt. Post 104, American Legion members were also present to assist with a flag ceremony and the 23rd Virginia Infantry, Roanoke Virginia, presented a military salute."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "at the Confederate Cemetery, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. M rs. Emma"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "at the Confederate Cemetery, <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. M rs. Emma"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2247.07, 553.06, 2422.85, 1318.6], "bbox_id": "963a7717ca", "file": "AppomattoxNewspapers_1952-1954a_0544.pdf", "page": 1, "text": "As another April 9. rolls around, Old Appomattox Court House is fast coming to look like the village it was in 1865 when Generals Lee and Grant made peace for America in the home of Wilmer McLean. H. A. Gurney, National Park Serv ice Superintendent at Old Appomat tox, today described progress of the restoration. Restoration of the Peers house should be completed by July 1. The residence was the home of George Peers, county court clerk. New comfort stations, in the re constructed slave quarters at the Old Tavern, will be completed this month and the Tavern itself is being given a handsome reconstruction job. It will be used for National Park Serv ice offices, and will house the enlarg ed museum. New museum exhibits are expect ed to arrive the week of April 18, to add to the many historical relics now on display. The museum has been located in the old Ferguson residence, where there hag not been room for adequate display. A continuous effort goes to ob tain museum items for Appomattox. Many of the items secured during the past year have been sent to Park Service shops to be prepared for ex hibit, and some of these items are now ready for public view. The mu seum in the restored Tavern is ex pected to be a mecca for tourists. Mr. Gurney announced today that 5,800 is now available for buildirg an utility house east of the Peers House. This will furnish storage space, workshop and housing for tools. Work will begin very soon on this project. The program of the Park Serv ice is a restoration of the Old Court Houte Village. The McLean House itself was the top item in the pro gram and-4to dedication brought one of the largest crowds ever in A ddo - mattox. StiH in the making are plans for rebuilding the ojd court house, which was located in the village circle, and was a center of county activity un til it burned in 1892. In Washington this week, final ap proval was voted for a change in the name of the National Park Serv- ice establishment here. The new name will be Appomattox Court House National Historical Park. This replaces the use of the word Monument in the designation, held to be an inadequate descrip tion of the restoration. The bill to change the name was introduced in ttie House by Congressman W. M. Abbitt. It has now passed both the House and Senate. It is of interest to note that the only other National Historical Park in Virginia is Co lonial."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "new name will be <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. This replaces the"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "new name will be <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. This replaces the"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [466.07, 242.46, 616.88, 722.34], "bbox_id": "c199f6419f", "file": "AppomattoxNewspapers_1971-1973a_0033.pdf", "page": 1, "text": "tryside. As Harold notesThe visitors are so taken with the beauty of the landscape and the almost reverent stillness that surrounds the village that it is often easy to take them back to the feeling of those days The Park secured a donation from the Eastern National Park and Monument Association to fi nance the program on an experi mental basis for one summer. Park Superintendent F. A. Gould commented We are quite for tunate to have Harold Howard, j He has an extensive knowledge of the Civil War era and just the right personality to talk with visitors as a man from the I 8  60s. Visitor response has been cxcGllcnt The Park recently received a copy of a letter about John Ho ward written by a visitor from Charlotte, North Carolina to the Secretary of the Interior, Rog-  ers Morton. ! Dear Mr. Morton It is a pleasure for me to take this opportunity to acquaint you  with an extraordinary visit of j our family to Appomattox Court I House National Historical Park. I We met John Howard. John is a Virginia farmer. I  would guess he was born about j 1839. Two years after theWar for Southern Independence, as ! he put it, began, he enlisted in i the Second Virginia Cavalry as a I private soldier. He served Vir ginia at Fredericksburg, Chan- cellorsville, Gettysburg, the Wilderness, Spottsylvania, Pet-  ersburg and surrendered with Lee in April 1865.Followinghis"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "j our family to <mark>Appomattox</mark> <mark>Court</mark> I <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. I We met"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "j our family to <mark>Appomattox</mark> <mark>Court</mark> I <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. I We met"}], "text_match": 3470085063931068537, "text_match_info": {"best_field_score": "5527612358656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085063931068537", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [512.16, 1016.97, 654.57, 1186.06], "bbox_id": "257570cf92", "file": "AppomattoxNewspapers_1971-1973a_0354.pdf", "page": 1, "text": "sites throughout the United States. Along with preserving Indian ruins in the Southwest it also protected historic ob jects on public lands in Amer ica. This act is still a part of our laws today. The historic objects at Appomattox Court House National Historical Park are protected because of this enactment over to proclaim as national monuments any land owned or acquired by the Fed eral government that contained historic landmarks, historic or scientific interest. Eightly -"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "The historic objects at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park are protected because"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "The historic objects at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park are protected because"}], "text_match": 3470085029705547897, "text_match_info": {"best_field_score": "5527595646976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085029705547897", "tokens_matched": 6, "typo_prefix_score": 1}}
{"document": {"bbox": [2347.91, 1022.61, 2492.16, 1725.2], "bbox_id": "506a6fe3f6", "file": "AppomattoxNewspapers_1962-1965a_0235.pdf", "page": 1, "text": "AND increase the county. Chairman of the Board of Supervisors said, I think we have a pecuniary interest in this Centennial plans, and a res ponsibility, though at present we are operating in the red. Offers of Help Centennial chairman William Hubbard read a letter from Rev erend O. D. Moore, head of the local ministerial association, which said the Appomattox min isters were sympathetic to the general aims of the Peace Com memoration, and pledging clergy mans help, if needed. Hubbard also read a letter from C. Lewis McDeaimon, Ap pomattox Oil distributor, with an offer to make property available for a tourists center or other Centennial commemoration use. Said Wescoat Wolfe, historian from Appomattox Court House National Historical Park, Appo mattox is just as important ag Gettysburg  perhaps more so. He gave the opinion that there should be a lot of preliminary activities among local groups be fore April 9, 1965. However, he added, Its not fair to the United States to put the commemoration in the hands of Appomattox alone. This is of national Importance. Mrs. Grey Holland advised the group that the Appomattox Gar den Club has been making plans for a beautification project. Lets not depend entirely on the Park Service, she said, and lets not forget to include teen agers in our plans. Centennial Committee Goals Centennial chairman Hubbard set forth the committees tenta tive goals to the supervisors He said. The committee plans to hold a peace commemoration at the old courthouse on the Sunday fol lowing April 9, 1965, with an appropriate historian as one of the guest speakers. The committee also plans to invite the President of the United States, those U. S. Army generals who have signed a peace treaty and ail former presidents. During the summer of 1965, the committee hopes to sponsor the participation by states hav ing battle groups at Appomattox at the 1865 surrender in some type of commemoration service which would rot result in the placing of statues or monuments. The committee plans to re- the Confederate statue in the local courtyard during the summer of 1964, with the SONS"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "Wescoat Wolfe, historian from <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park, Appo mattox is"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National", "Historical"], "snippet": "Wescoat Wolfe, historian from <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park, Appo mattox is"}], "text_match": 3470085029705547897, "text_match_info": {"best_field_score": "5527595646976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085029705547897", "tokens_matched": 6, "typo_prefix_score": 1}}
{"document": {"bbox": [2042.93, 558.13, 2185.03, 965.78], "bbox_id": "d055828776", "file": "AppomattoxNewspapers_1962-1965a_0187.pdf", "page": 1, "text": "Grover E. Steele has been named Superintendent of Appo mattox Court House National Historical Park Director Conrad L. Wirth of the National Park Service announced today. Steele succeeds Thomas F. Norris, who was recently appointed Superin tendent of Fort Smith National Historic Site in Arkansas. Steele has been Supervisory Park Ranger at Rocky Mountain National Park in Colorado since 1960 During his 16-Vi years with the National Park Service he has also had Ranger assignments at Big Bend National Park in Texas and at Organ Pipe Cactus and Saguaro National Monuments in Arizona. At Appomattox Court House, Virginia, on April 9, 1865, Gener al Robert E. Lee surrendered to General Ulysses S. Grant the most renowned and successful of all Confederate Armies. In April 1940, the Congress author ized establishment of the Natio nal Historical Park to commem- rate the end of the Civil War. The park includes the old village of Appomattox Court House, and Steele will continue the program of restoration and reconstruction of the historic buildings in the village In time for the Centennial observance in April 1965. A native of Texas, Steele serv ed with the U. S. Air Force dur ing World War II. He will be accompanied to Appomattox by his wife, Hazel, and their four children."}, "highlight": {"text": {"matched_tokens": ["National", "Monument", "Appomattox", "Court", "House"], "snippet": "Pipe Cactus and Saguaro <mark>National</mark> <mark>Monument</mark>s in Arizona. At <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark>, Virginia, on April 9,"}}, "highlights": [{"field": "text", "matched_tokens": ["National", "Monument", "Appomattox", "Court", "House"], "snippet": "Pipe Cactus and Saguaro <mark>National</mark> <mark>Monument</mark>s in Arizona. At <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark>, Virginia, on April 9,"}], "text_match": 3470085029302894713, "text_match_info": {"best_field_score": "5527595450368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085029302894713", "tokens_matched": 6, "typo_prefix_score": 1}}
{"document": {"bbox": [1345.93, 905.87, 1507.22, 1552.76], "bbox_id": "1ee7bffa9d", "file": "TimesVirginian_1976_0442.pdf", "page": 1, "text": "Inspector, will be the nefv Appomattox Town Manager. AadCuis E. Garcia Curbele, a native of Puerto Rico and  recently at The Statue of pbdrty National Monument in i I Superintendent at tiTe A ppo mattox Court House National Historical Park. He succeeds H. Gilbert Lusk who is now at Valley Forge National Histori cal Park in Pennsylvania.     I have three volunteer persimmon trees alongside my garden. Do not know how they got there but they have been bearing this year. Have not eaten any, a I just do not care for persimmons.    f And I note that one of my neighbors has two old-fashion ed rabbit box traps set up. Do not know if any rabbits have been caught, but as a boy I caught many a rabbit in my homemade rabbit box. Never had any luck using snares. A piece of apple seems to be the best bait.  MB   The Staunton River Histori cal Society met Sunday afternoon, with a program on The Town of Ridgeway. I am a member but could not attend, to fact, I do not get to many meetings anymore and that is why I really appreciate friends sending me tips for this column.    . Business is good in Appomat- I tox! Crowds at local stores and if markets and they are really I buying. Tobacco is-selling very well and Christmas shopping is peaking. I note that the state I gas tax will pour some 260 I million into the treasury for I 1976. The previous high was I 246.2 million in 1973. The I Bicentennial Year has been a I good one. Now let us wind it up  With everyone having a great a"}, "highlight": {"text": {"matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "tiTe A ppo mattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. He succeeds H."}}, "highlights": [{"field": "text", "matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "tiTe A ppo mattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> Park. He succeeds H."}], "text_match": 3467833264385818745, "text_match_info": {"best_field_score": "4428100861952", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264385818745", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1958.15, 557.04, 2466.81, 645.94], "bbox_id": "181877788f", "file": "AppomattoxNewspapers_1949-1952a_0442.pdf", "page": 1, "text": "Bloodmobile .Visit A flag of truce and a Virginia State battle flag that figured promi nently in the closing battle of the War Between the States and in General Robert E. Lees Surrender . __ were presented to Superintendent Bedford scored in the first quar-nam and giving your address mail! Hubert A. Gurney of Appomattox ter when Appomattox tried to run j the coupon to Mr. Richard D. Robin- j Court House National Historical with the ball on fourth down deepson Blood Recruitment Chairman, j Monument in ceremones at the Mc-"}, "highlight": {"text": {"matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "Richard D. Robin- j <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> with the ball on"}}, "highlights": [{"field": "text", "matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "Richard D. Robin- j <mark>Court</mark> <mark>House</mark> <mark>National</mark> <mark>Historical</mark> with the ball on"}], "text_match": 3467833264385818745, "text_match_info": {"best_field_score": "4428100861952", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264385818745", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2019.11, 473.58, 2160.67, 813.82], "bbox_id": "a94887898f", "file": "AppomattoxNewspapers_1971-1973a_0261.pdf", "page": 1, "text": "Daily entrance and user fe e collection will continue in the National Park System pending congressional action on exten sion of the Golden Eagle Pass port, an annual 10 extrance permit which expired Dec. 31, 1971. The National Park Service has notified park superintend ents that until Congress acts on amendments to the Land and Water Conservation Act, only daily fees will be collected. Pending legislation would pro vide for continuation of public sale of the Golden Eagle annual entrance fee permit. The 1 per car entrance fee at Appomattox Court House Nat ional Historical Park will be collected from April 1 through October 31. Daily entrance fees range from 1 to 3 per car and its occupants at most parks and re  creation areas and user fees from 10? to ride the Washing ton Monument elevator, to 2 -4 for overnight camping in the 86 National Park areas provid ing camping facilities."}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "Historical"], "snippet": "car entrance fee at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> Nat ional <mark>Historical</mark> Park will be collected"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "Historical"], "snippet": "car entrance fee at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> Nat ional <mark>Historical</mark> Park will be collected"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [146.65, 258.5, 603.72, 958.97], "bbox_id": "fcc06443d2", "file": "TimesVirginian_1981a_0220.pdf", "page": 1, "text": "By FRANCIS E. TYLER mission with Lieutenant-Colo- expenditure of 100,000.00 was At the July meeting of the nel L. C. Pope, U.S. Engineers, carried over from he Act of Oakville Ruritan, Club the as Chairman, with Captain 1930. However, no Rinds were members were privileged to Robert Carter representing the actually appropriated, and hear Mr. Jon B. Montgomery, North and Captain Robert A. Congress took no action to Superintendent of the Appo- OBrienof Appomattok County provide funds for acquisition of mattox Court House National as Southern Delegate. They ida Historical Pafk, give a most met several times and submitt- One of the bureaus of the interesting account of the ed their report. National Recovery Program founding and development of On June 13, 1930, the was requested to purchase the the Park from the original idea President Hoover approved a lands felt and by 1939 of a Monument to the present bill, introduced by Congress- all of these had been obtained Mr. Montgomerys remarks man Tuck, which carried out as earmarked by the National were based on years of the Committees recommends- Park Service, research by many individuals tion for a shaft to be erected on On April 10, 1940, 75 years as well as his own, and with the Court House green to mark and one day after the surrender considerable credit.due to Mr. the termination of the War. of Lees Army, Secretary of the Ron Wilson, the present Park This did not meet with local Interior Ickes proclaimed the Historian. approval. establishment of Appomattox It appears that there were To carry out the intent of the Court House National Histori- many obstacles _ that are un- Act of 1930, the W ar cal Monument, with an acreage known today except by a few of Department appointed a five- of 970 acres, the oldest citizens of the man Commission of Architects Historian Hubert A. Gurney, oninty. Those resolved around and Sculptors, and announced a of Fredericksburg and Spotsy- land acquisition, ultimate ob- nation-wide competition for Ivania National Military Park, prejudice vis-a- designs of the Appomattox was tranferred to Appomattox vis Northern prejudice, and of Memorial. as Acting Superintendent, course money.   in October the. Fine Arts Within two months a Civilian H is impossible in an article Commission went to Appomat- Conservation Corps company of of this kind to do full justice to tox with the local Congressman blacks was transferred to the Mr. Montgomery s account, but and the Governor of Virginia, area to undertake work on these are the salient features They reported that a walk clearing of grounds and After the Ww, in April 1865, around the quiet village had stabilization of buildings, while other battlefields were turned the Commission away Coordinated research IbUow- being commemorated, nothing from interest in a new ed. The Historical Staff wasdone here m Appomattox monument It seems to the purchased the 1893 drawings,  i ,nwfr , _ Commission of Fine. Arts that and were involved in a  In 1888 a group of officers the rebuilding of the McLean three-way investigation of tni Grand Army of the House according to the extant History, A rchitecture, and Republic, led by General S. S. plans should be the foundation Archeology,  Burdette, undertook to make of the memorial at Appomat- By the winter of 1941, this area into a memorial, and tox. If this is  not done, working drawings for the m 1889 General Burdette and speculators certainly will seize McLean House were complet- his associate Samuel M. Bryan the opportunity to reproduce ed. During this year construc- moved into the county and the House, It. will be exhibited tioh of a by-pass road south of purchased 1400 acres of land in under private control and will the Village was begun, and around the Court House, become the most important The coming of World War II The following year tile Appo- feature of Appomattox, The caused suspension of nearly all mattox Land Company was Commission feels that it will be of these activities. The only organized. Its purpose was to a m istake to erect at thing of note during the War !e the area the mte of a Appoiriattox a governm ent years was transfer of the North National Lamp Ground of the monument such as those at Carolina Monument, Tablets, Grand Army of the Republic. Jam estown and Yorktown, and access road to Government Tne Company was to build a both of which are obsolete ownership. Hotel and Park, and sell lots, architecturally and lack in- In 1946, stabilization repairs endeavoring the while to- get terest to the public. were made on aU historic Congress to build a monument In 1933, by Executive Order buildings in the Village area, and roads to points of interest. Roosevelt, responsibility for First major product of the The Company was . unable, carrying out the provisions of Postwar program was renova- however, to acquire the the Act of 1930, was tion and repair of the McLean House, evidently be- transferred from the W ar Bocock-Isbell House. Then erase of inability to come to Department tq the National followed the reconstruction of terms with Mr. N. H. Ragland, Park Service. the McLean House in 1949, tb owner. In August 1933, the Appo- completion of the Village In 1891 another group, mattox project was placed sewage disposal system, and headed by Captain Myron under the supervision of B. installation of the Village water Dunlap of Niagara Falls, N. Y., Floyd Flickinger by the supply system, acquired the McLean House for Director of the National Park -T he reconstructed McLean"}, "highlight": {"text": {"matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "for acquisition of mattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> as Southern Delegate. They ida <mark>Historical</mark> Pafk, give a most"}}, "highlights": [{"field": "text", "matched_tokens": ["Court", "House", "National", "Historical"], "snippet": "for acquisition of mattox <mark>Court</mark> <mark>House</mark> <mark>National</mark> as Southern Delegate. They ida <mark>Historical</mark> Pafk, give a most"}], "text_match": 3467833263714730105, "text_match_info": {"best_field_score": "4428100534272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263714730105", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1665.04, 568.94, 2340.03, 855.43], "bbox_id": "c8770c82d0", "file": "AppomattoxNewspapers_1949-1952a_0522.pdf", "page": 1, "text": "Although it is true that of land to the Appomattox Court charge is made for blood used in House National Historical Monu-! transfusions where the American ment. . Red Cross Blood Program is estab- The proposed legislation in routine j Mailed, yet there are the following authorization, being sought by the j charges made in connection with National Park Service so that event- Svn transfusions ually, when funds are available, a I  Average hospital costs within few acres of historical land not now the jurisdiction of the Roanoke Re owned by the government, may be I 8onal Blood Center added to make the monument area Cost of 1st transfusion typing being assisted by T. C. Ligon  of complete. Under present law, there charge, cross matching charge aver- pamplin. Heart-shaped collection is no authority for the acquisition age total cost11.75. j boxes have been distributed and the of more land. The present area in! The total cost of administering public is being urged to help raise the park comprises nearly 1,000 blood transfusions in the hospitals  1,500 for this county, acres, and is virtually all of the land! operating within the jurisdiction of i ,,A . aa t  j with historical association connect- the Roanoke Regional Blood Cen- p ea s ter varies from three hospitals whic charge only 5.00 for the first blood transfusion to one hospital which i noCA , ,, lT charges 17.00 for the first blood ..  . e 0 ,was 745,000. However j p p Carr, District Conservation- transfusion. There are legitimate I  jf .? e?r ope or bearts J he ist, Soil Conservation Service, re scene of the peace-making meeting. reasons for this disparity in the total j . . ias een accomp s e turned today from Atlanta, Georgia, of Generals Lee and Grant. Eventu- j administrative cost of giving trans-j, j. .e pas ouar c1 0  a cen- where he attended the annual meet- ally the entire area will be restored. I fusions of blood that has been given v,   j 18 especia Y mipor an in jng 0f jje Association of Southern free of charge. There is no charge thes days kwhen tremendous de-. Agricultural Workers at the Atlanta for the blood itself. I an,ds are. belng placed .n Biltmore Hotel. Where the American Red Cross, J,  f, 1 1 us rla  Mr. Carr was on the program on Blood Program does not operate, r ,g we df? everything we February 5, and presented a paper can to see that our human resources"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National"], "snippet": "of land to the <mark>Appomattox</mark> <mark>Court</mark> charge is made for blood used in <mark>House</mark> <mark>National</mark> Historical Monu-! transfusions where"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National"], "snippet": "of land to the <mark>Appomattox</mark> <mark>Court</mark> charge is made for blood used in <mark>House</mark> <mark>National</mark> Historical Monu-! transfusions where"}], "text_match": 3467833263446294649, "text_match_info": {"best_field_score": "4428100403200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263446294649", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [659.51, 1015.77, 802.33, 1185.91], "bbox_id": "2f2188e10c", "file": "AppomattoxNewspapers_1971-1973a_0354.pdf", "page": 1, "text": "four national monuments were established under this and other acts by the President. Appomat tox Count House was established as a national historical monu ment in 1935. Later the name was changed to Appomattox Court House National Histori cal Park. Many other national parks were established inthoseform- ative years of the National Park System from 1872-1916 includ ing Grand Canyon, Crater Lake, Wind Cave, and Hot Springs. Those early periods of admini"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "National"], "snippet": "name was changed to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> Histori cal Park. Many"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "National"], "snippet": "name was changed to <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> <mark>National</mark> Histori cal Park. Many"}], "text_match": 3467833230026080377, "text_match_info": {"best_field_score": "4428084084736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833230026080377", "tokens_matched": 6, "typo_prefix_score": 1}}
{"document": {"bbox": [2013.3, 983.65, 2161.36, 1324.58], "bbox_id": "3ec9f5c0d4", "file": "TimesVirginian_1978_0090.pdf", "page": 1, "text": "l i e 1978 Golden EaglS Passport and lifetime Golden Passport, which waive entrance fees to National Parks and other federal recreation area, are now available, according to Superintendent Luis Garcia at Appomattox Court House Nat ional Historical Park.. The Golden Eagle Passport flHmit the permit holder and an accompanying carload of passengers to national parks, monuments and recreation areas. It does not cover use fees such as those charged for mumping or boat launching. Some parks and recreation areas may be entered and used free of charge, however, those who plan to visit several parks that charge fees can save by buying the Golden Eagle Passport for 10 rather than paying individual entrance foes that range from 50 cents per person to 3 per carload, Garcia said. From April 1st through October, Appomattox Court House NHP charges a m e dollar per carload fee. For those who are frequent visitors,"}, "highlight": {"text": {"matched_tokens": ["Appomattox", "Court", "House", "Historical"], "snippet": "Superintendent Luis Garcia at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> Nat ional <mark>Historical</mark> Park.. The Golden Eagle"}}, "highlights": [{"field": "text", "matched_tokens": ["Appomattox", "Court", "House", "Historical"], "snippet": "Superintendent Luis Garcia at <mark>Appomattox</mark> <mark>Court</mark> <mark>House</mark> Nat ional <mark>Historical</mark> Park.. The Golden Eagle"}], "text_match": 3467833229757644921, "text_match_info": {"best_field_score": "4428083953664", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833229757644921", "tokens_matched": 6, "typo_prefix_score": 1}}
