{"document": {"bbox": [1123.9, 1085.39, 1148.96, 1094.39], "bbox_id": "f10d4da681", "file": "AppomattoxNewspapers_1915-1918a_0355.pdf", "page": 1, "text": "Baker."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "<mark>Baker</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "<mark>Baker</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [104.4, 1356.8, 172.74, 1382.8], "bbox_id": "799a8042ac", "file": "TimesVirginian_1981a_0375.pdf", "page": 1, "text": "Baker"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "<mark>Baker</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "<mark>Baker</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [151.2, 258.15, 309.06, 745.78], "bbox_id": "33ec67c403", "file": "TimesVirginian_1978_0316.pdf", "page": 1, "text": "Zack Elliott Cheatham, 82, of Evergreen hid Tuesday, July 4,19TB in Medferi Care Center inIA 6 hhucg HI Bora in Appomattox County, he was a son of the late James Hudson, and MoUy Evans Chetttham. R t v u a farmer and dealer in cattle and horses and member of the Virginia Horse Show Association. He is survived by his wife, Mayme Chocklett Cheatham a son, James Elliott Cheatham of Clearwater, Fla. a daughter, Jeanne C. Stanley of Appomat tox two sisters, Annie C. Bingham of Lynchburg and Alice C. Babcock of Columbia. S.C. four grandchildren, Zack and Nan Cheatham of Clear water, Fla., and Bill and Jan Stanley of Appomattox, and a great-grandson, James Hudson Cheatham of Clearwater, Fla. Besides the immediate fam ily, there were present a niece, Mrs. Anne Branmgan. and husband from California a nephew. Cecil Robbins, and wife from Wilmington, N. O. and a nephew, Huck Babcock, from Columbia, S. C. and many cousins. Funeral services were con ducted at 130 p.m. Friday from Robinson Funeral Home m Appomattox. Burial was m Evergreen Cemetery. Serving as pall bearers were Jack Baker, David Paulette, Kermit Paulette, Edward Har vey, Leslie Goodrich, Jesse Franklin, Herbert Diadmond, and Henry Simmons."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "pall bearers were Jack <mark>Baker</mark>, David Paulette, Kermit Paulette,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "pall bearers were Jack <mark>Baker</mark>, David Paulette, Kermit Paulette,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1706.65, 721.61, 1998.59, 850.2], "bbox_id": "b52e7a31a5", "file": "AppomattoxNewspapers_1954-1955a_0416.pdf", "page": 1, "text": "your boy friend or your husband to be a cook or baker. I can teach him how to give orders, and above all, I can teach him how to take orders. I can teach him discipline, respect and courtesy. All of this I can do right here in Appomattox, or if im desires, at some Regular Army school or post. Best of all, I can give him his military training here at home. I can get him deferred from the draft if he enlists before he is 18 years of age and providing he attends drill regularly and goes to camp for two weeks each summer. I can become his friend. If a national emergency arises, I can serve with him, maybe save his life or have my life saved by him through the training we have had together."}, "highlight": {"text": {"matched_tokens": ["baker"], "snippet": "be a cook or <mark>baker</mark>. I can teach him"}}, "highlights": [{"field": "text", "matched_tokens": ["baker"], "snippet": "be a cook or <mark>baker</mark>. I can teach him"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [168.25, 1046.39, 328.3, 1396.76], "bbox_id": "cf7b15c22a", "file": "AppomattoxNewspapers_1902-1905a_0303.pdf", "page": 1, "text": "Yenner. Up and doing is our motto these days and right well are most of u living up to it especially the farmers who are in an awful rush in order to get in their crop Mis. Irving Baker of Vinceut this week the gnest of her parents of this place. Miss Lula Turner of Hollywood is spending this week with her brother Mr.W. L. Turner Mr. B. L. Rosser spent sever days in Lynchburg last week Mr. G. R. Woodson visited rela tives near here last week. Miss Addie Baker left last week for Mizdon, where she will spend several weeks with her niece, Mr G. 0. Harris. We are glad to say Mrs. James Glenn s out again. Miss Ella Neal Bcoker, of Adelle was the guest of Miss Lottie Wood son Saturday last. The tunny friends of Mrs. Wm Garwile are glad to know she is out again. She spent several days with her daughter, Mrs. B. T. Rosser, not long since."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "their crop Mis. Irving <mark>Baker</mark> of Vinceut this week"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "their crop Mis. Irving <mark>Baker</mark> of Vinceut this week"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.87, 1012.51, 1604.05, 1795.8], "bbox_id": "3f8ddc6afa", "file": "AppomattoxNewspapers_1926-1933a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first, M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third, M F Moon. White potatoes, first, Mrs W A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, H ailey  Inge second, Mrs T H Inge. Mixed peas first, S L Ferguson second, Howard Inge third, T H I Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, Homer Babcock. Potato pumpkin, first, G W Reynolds second, R A Jones third, Miss Annie Caldwell. Watermelon, first, L E Smith second, M F Moon. Three squash, first, Mrs Wi P Gills, Egg plants, first, Mrs E L Smith. Navy beans, first, Mrs R F Jamerson second, Ira Burrell, third, C F Moore. Butter beans, first, Mrs Guy Smith second, Ira Burrell third,  Mrs E M Stratton. ! Lima beans, first, Mrs M C  Smith. Sheaf wheat, first, Willie Moon. Irish potatoes, first, J E Bur nett second, Guy Smith third, M C Smith. Green mountain potatoes, first, F T Cawthorn second, BessieI Gunter. Stalks cane, first, M F Moon, second, RC Jones third, C S  Cawthorn.  Sweepstakes, first, W W Far rar, second. W W Farrar, third, Mrs J R Caldwell. Peanuts, first and second none third, George Carson. Buckwheat, first, Mrs. H B Marshall. Celery, first, Mrs C R Cald- I well, second, Mrs. C R Caldwell. Beets, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith. Stalks corn, first, Stratton Bros. Sheaf of wheat, first, none, second, William Moon. Bale hay, first, E L Smith. Bunch soy beans, first, Mrs 0 L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Inge. Pumpkin, first, Frank <mark>Baker</mark> second, Mrs C M"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Inge. Pumpkin, first, Frank <mark>Baker</mark> second, Mrs C M"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.5, 1003.7, 1592.79, 1423.27], "bbox_id": "961cf33820", "file": "AppomattoxNewspapers_1908-1909a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first 1 M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third. M F Moon- White potatoes, first, Mrs A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, Hafvèy Ipgé second, Mrs, T H Inge. I Mixed peas first, S L Ferguson I second, Howard Inge third, T H  Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, I Homer Babcock. I Potato pumpkin, first, G W Reynolds, second, R A Jones third, Miss Annie Caldwell. Watermelon,..first, L E Smith I second, M F Moon. Three I squash, first, Mrs Wj P Gills. - ?. pi Egg plants, first, -Mrs E L- Smith. . I Navy beans, first, Mrs R F IJamerson second, Ira Burrell, third, C F Moore. Butter beans,  first, Mrs Guy Smith second, Ira Burrell third, Mrs E M Stratton. Lima beans, first, Mrs M C Smith. Sheaf wheat, first. WilMfe."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Inge. Pumpkin, first, Frank <mark>Baker</mark> second, Mrs C M"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Inge. Pumpkin, first, Frank <mark>Baker</mark> second, Mrs C M"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.08, 687.26, 1679.35, 1056.04], "bbox_id": "4671b3564f", "file": "AppomattoxNewspapers_1971-1973a_0098.pdf", "page": 1, "text": "yards on 15 attempts. The R a i d e r defense w as spearheaded by Lee Conner, Phillip Goode, Randy Foster, Steve Lawson, Billy Guthrie and Dennis Wilkerson. Conner had nine tackles and Goode eight as both had quite a few assist also. Following them were R a n d y Foster with six, and Lawson and Wilkerson with five each and three assist. Guthrie knocked down three passes on rushing attempts and had four tackles before leaving the game with an injury. Sam Baker, Jam es Poe and Stan Austin led the WC defense attack as they kept the Raiders completely bottled up in the sec ond half. The Raiders face Altavista Friday night in their final game as homecoming takes place at Appomattox. Appomattox 7 6 0 0 13 W.Campbell 0 0 7 7  14 Appo  M. McCormick - one yd run Chandler kick Appo  M. McCormick  one yd run kick failed W. C. - R. Herndon  34 yd. fumble recovery run Austin kick W. C. F. Layne  one yd. run"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "with an injury. Sam <mark>Baker</mark>, Jam es Poe and"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "with an injury. Sam <mark>Baker</mark>, Jam es Poe and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [179.04, 303.67, 504.08, 660.66], "bbox_id": "6058003aca", "file": "AppomattoxNewspapers_1902-1905a_0572.pdf", "page": 1, "text": "Y enner. It has been some time sine? we have seen anything iu your paper from cur town. ,  , A series of meetings will be held oun a 1011 UP in Centenary M. E. Church the 2nd Quick up-to-date service. Auer Sunday in October. Rev. Ernest I, . _  c , .. 1 1 v, ican plan. Rates 2 per day. Stevens, of the Memorial chuich,i r r Lynchburg, will assist Mr. Fielding. Let as hope their efforts may be  Proprietor, crowned with success A meeting will also begin at I UNIVERSITY OF VIRGINIA. Spring Creek Baptist church thej E1WIN At a l d e r m a n , president. 2nd Monday in October. Rev. Law- Bon, of Buckingham, will be with 1 Letters, Science, Law, Medicine Mr. Williams. I Engineeting. Mr. W. L. Turnes and Mr. Neal Tuition n Academic Department Carwile spent Saturday and Sunday I in Appomattox with his mother, FREE 10 VIRGINIANS. Mrs. Henry Tuiues, who continues Entrance examinations have been quite ill, we are sorry to say. I instituted. Present enrollment larg Miss Mattie Baker came h o m e i n the history of the institution , - , . , I Next session begins Sept. 14th Thursday, after a very pleasant visit   for Catalogu with relatives near Evergieen Mr. and Mrs. James Glenn, oi Prcspect, spent Saturday and Sun day with their mother and father, Mr. and Mrs. Rosser. Mr, Charley Wilkerson and Mr, Berkley Garrett, of Roanoke, made  Y ou w ill be able to pick"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "enrollment larg Miss Mattie <mark>Baker</mark> came h o m"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "enrollment larg Miss Mattie <mark>Baker</mark> came h o m"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1176.46, 188.51, 1317.14, 252.75], "bbox_id": "05c7f9fb61", "file": "TimesVirginian_1978_0077.pdf", "page": 1, "text": "Worship Service at 11 a.. Wednesday night prayer ser vice is held at 730 p.m. Richard B. Baker is pastor. The public is cordially invited to this special service."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Worship Service at 11 a.. Wednesday night prayer ser vice is held at 730 p.m. Richard B. <mark>Baker</mark> is pastor. The public is cordially invited to this special service."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Worship Service at 11 a.. Wednesday night prayer ser vice is held at 730 p.m. Richard B. <mark>Baker</mark> is pastor. The public is cordially invited to this special service."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [534.49, 460.72, 1318.76, 555.48], "bbox_id": "dfc6fc1e69", "file": "AppomattoxNewspapers_1954-1955a_0123.pdf", "page": 1, "text": "WORLD WAR II VETERANS The following veterans of World War II came from the Evergreen public school, which recently cele brated its fiftieth anniversary. Austin, Howard Austin, R0y  Baker, Jack Buckner, Delmos Buck ner, Dennis Carrico, Billy Cheat ham, James E. Chocklett. Anrfr EDITORIAL OPINION"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Austin, Howard Austin, R0y  <mark>Baker</mark>, Jack Buckner, Delmos Buck"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Austin, Howard Austin, R0y  <mark>Baker</mark>, Jack Buckner, Delmos Buck"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.48, 949.72, 1811.38, 1180.25], "bbox_id": "694bb37793", "file": "AppomattoxNewspapers_1912-1915a_0394.pdf", "page": 1, "text": "Working On Panama Exhibit. Land and industrial agents of three railroads of the State held a confer ence at theoffice of Governor Stuart with the exhibits committee of the Panama-Pacific Exposition Commis sion. This committee consists of Cap tain W. W. Baker, of Chesterfield, and Alexander Forward, secretary of the commission. The railroads represent ed wererthe Southern, Norfolk and Western and the Chesapeake and Ohio. Appearing for the roads In the order named wre M. V., Richards, S. .H. La Baume and K. T. Crawley. After some discussion it was agreed to be gin immediately the work of selecting the items to form the Virginia exhibit and the coming exposition to be held In San Francisco. It is expected to complete this work in time to present tbe matter to the Virginia commissicn at a meeting to be called within thT weeks."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Cap tain W. W. <mark>Baker</mark>, of Chesterfield, and Alexander"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Cap tain W. W. <mark>Baker</mark>, of Chesterfield, and Alexander"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [766.55, 638.93, 943.27, 877.18], "bbox_id": "8877a5390e", "file": "AppomattoxNewspapers_1943-1947a_0513.pdf", "page": 1, "text": "Woman Tosses Money Out of Hotel Window NEW YORK.Police and ambu- ! lance attendants, rushing to the sixth floor of the Paramount hotel to in vestigate a report that a woman , was about to jump, found a Cincin- 1 nati, Ohio, matron amiably throw ing money out of a window. Police, who summoned six radio cars and an ambulance to the scene, identified her as Mrs. C. Betzner. Thomas Baker, house officer, said Mrs. Betzner, clad in a back negli gee, had one foot on a window ledge ! when he entered her room and  seized her.  She pushed him away, Baker said, but when an elevator operator ar rived to reinforce him he got her away from the window. Jump out the window? Dont be absurd. I was having lots of fun, Mrs. Betzner told police."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Mrs. C. Betzner. Thomas <mark>Baker</mark>, house officer, said Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Mrs. C. Betzner. Thomas <mark>Baker</mark>, house officer, said Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1230.27, 1223.13, 1381.1, 1355.94], "bbox_id": "3c427acc14", "file": "AppomattoxNewspapers_1918-1922a_0436.pdf", "page": 1, "text": "Woman To The Board Of Health. Two new appointments and one re appointment were made by Governor Davis to membership on the State Board of Health, one of the new ap pointees being a woman. Mrs. Charles Hall Davis, of Petersburg, to serve four years, beginning June 17, 1920, to succeed W. W. Baker. Guy R. Harrison, of Richmond, was reappointed on the board, while E. Howe Miller, of Danville, was appoint ed for four years, beginning July 1, 1920, to succeed Thomas W. Edmunds."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "to succeed W. W. <mark>Baker</mark>. Guy R. Harrison, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "to succeed W. W. <mark>Baker</mark>. Guy R. Harrison, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [331.2, 254.92, 482.25, 1129.62], "bbox_id": "509784a5eb", "file": "AppomattoxNewspapers_1974-1975a_0003.pdf", "page": 1, "text": "With only 10 letterm an returning Willu m Campbell will have a host of freshman and sophomOres i n the starting lineup when tne Seminole District football season opens Sept. 6 and new head coach Ronnie Cox figures they will need some time to mature. Our young players have to come around to plug the gaps, both offensively and defen sively, Cox says, Right now we are concentrating on our first game. We are not even considering the second game of the season. We need time to grow and we will have to play one gameat a time Cox is fortunate that the Genrals do not open when all the other teams in the district see action Friday night. William Campbell has an open date for the first week of the season, which will allow them another week of preparation before they meet Appomattox in its season opener. Cox is returning to the helm of the Generals after an absence of five years. The 10 year coaching veteran led the Generals to two district crowns beofre leaving for a coaching post in Alabama. His most recent coaching duties saw him as an assistant if they are to be successful in a quest for a Seminole District title. Cox will probably have the Generals in a split T offense with either Allen Harper of Kip Burch at quarterback and -William Mitchell and Alvin Younger at running back, i Other candidates for the running back post are Mike M arstin, Ronnie Chambers, Cornelius Adam? Buddy Gar rett and Andy Carr. Ricky Davis or Charles White will man the wingback position while George Smith, Boo Younger and Tony  Herndon are all fighting fore starting assignments at end. ! Paul Ginther and Wayne Claybrook are battling for the  center slot and six players are  waging a battle for the tackle l positons. Seniors Danny Fallin and Sam Baker seem to have the  jnside track, but they are being  pushed hard by Varney Riddle, a junior, and sophomores Glenn Epperson, Ricky Trent and  MattMosby. Mike Coates and Benny Nash are trying to nail down guard posts, but Jimmy Adams, Jim Nichol and Bill Hodges are j making their presence felt. At least five or six of the offensive starters will also see duty on the defensive unit. Cox says, we dont have the depth or the size we would like to have, but we have 40 players on  the junior varsity squad. I don believe in rebuilding years, just want to put my best football players on the field"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Danny Fallin and Sam <mark>Baker</mark> seem to have the"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Danny Fallin and Sam <mark>Baker</mark> seem to have the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [468.69, 540.86, 611.38, 812.25], "bbox_id": "3210483b2b", "file": "AppomattoxNewspapers_1971-1973a_0030.pdf", "page": 1, "text": "Winston Ranson...............Sept. 1 James M artin .................. Sept. 1 Mrs. Leslie Gowin . . . .Sept. 1 Florence Ranson . . . . Sept. 3 Mrs. Dillard Baker . . . Sept. 3 Billy W ebber ................... Sept. 3 Frances Deaner . . . . Sept. 4 Dennis A bbitt ................. Sept. 8 Samuel M artin ..............Sept. 9 Mrs. Claudie Ranson . . . Sept. 9 Mrs. Frank Nash, Jr. .. Sept. 9 Mrs.Charles Richardson Sept. 9 Samuel Dickerson . . . . Sept. 9 Alice Stanley ............... Sept. 8 Sabrina Richardson . . Sept. 10 Kenny W. Richardson .Sept. 10 J. D. G u ill .................... Sept. 12 Chuckie Webber . . . Sept. 15 Mrs. Raymond Stanley.Sept. 13 Connie Webber . . . . Sept. 18 Randy Stanley . . . . Sept. 24 Hazel A bbitt.................Sept. 26 Ora Paulette . . . . Sept. 26 Mrs. Lawrence Webber.Sept.26 Mrs. Lackie Martin .Sept. 28 Edward Jones . . . . Sept. 28"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Sept. 3 Mrs. Dillard <mark>Baker</mark> . . . Sept. 3 Billy W"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Sept. 3 Mrs. Dillard <mark>Baker</mark> . . . Sept. 3 Billy W"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [864.49, 681.57, 1006.51, 1014.36], "bbox_id": "624beb5c9a", "file": "AppomattoxNewspapers_1971-1973a_0526.pdf", "page": 1, "text": "winners are as follows Class 1 radio program - First place, Orrin W. Meyer, Calumet County, Wis. second, Ernest Wrenn, outhampton County, Va. third, C. E. Craver, McKean County, Pa. Class 2 single news photo - First, David E. Baker, Logan County, 111. second, Charles W. Grooms, Obion County, Tenn. third. Jack D. Wise, Clark County, Nev. Class 3 series of colored slides - First, Oliver F. Cook Coffee County, Tenn. second, Allen D. Boettcher, Clark County, Nev. third, Walter H., Schmidt, Sandusky County, Ohio. Class 4 direct mail piece - First, Edward E. Neven, Marshall County, Iowa second, W. J. Corbett, Howard County, Md. third, Austin A. Albert, So. Pueblos County, N. M. Class 5 personal column - First, Larry D. Hendrix, Perkins County, Nebraska second, James A. Smith,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "photo - First, David E. <mark>Baker</mark>, Logan County, 111. second,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "photo - First, David E. <mark>Baker</mark>, Logan County, 111. second,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1535.28, 1586.86, 1690.25, 1872.55], "bbox_id": "ec75147247", "file": "AppomattoxNewspapers_1922-1923a_0097.pdf", "page": 1, "text": "Winchester.W. A. Baker was elected president of the new City Council, succeeding Fred L. G laize, who retired with several other coun- cilmen, yhose terms had expired. Mr. Baker, who Is known in sporting circles as Sandie, manager of the Winchester baseball team, is a son of the late W. H. Baker, chocolate man ufacturer, who served for many years as a councilman and several terms as president. The new president is re garded as a liberal and progressive Democrat. Fredericksburg.  A Republican mass-meeting was held at Spotsyl vania Courthouse Monday, and the following delegates were elected to attend the District and State conven tions M..L. Blaydes, J. R- Evans, C. R. Andrews and Parker Hairfield. James R. Evans was elected county chairman, and M. L. Blaydes, secre tary. Resolutions were offered and approved indorsing the national admin istration, also the State organization and eulogizing Congressman G  Slema. B"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Winchester.W. A. <mark>Baker</mark> was elected president of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Winchester.W. A. <mark>Baker</mark> was elected president of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.44, 1212.67, 2213.7, 1574.51], "bbox_id": "3f3d914423", "file": "AppomattoxNewspapers_1943-1947a_0013.pdf", "page": 1, "text": "Wilson Lynn Paulette, 50, died at his home near here Sunday after noon at 730, following an extend ed illness. Mr. Paulette was born n Appomatox County, the -son of .he late William James and Martha Baker Paulette. He spent his life in the county and was a successful farmer and highly esteemed citizen. He married Miss Corrine Tucker, if Phénix. He is survived by his widow and he following sons Thomas -Lyn wood Paulette, Kansas City, Mo., William Wilson Paulette, N. S. Ar my Roy Baker Paulette, U. S. Ma rines Edwin Tucker Paulette, U. S. Army Gene L. Paulette, and Millard G. Paulette, of Appomat tox. He also leaves two brothers, Robert Jefferson Paulette, and Phillip O. Paulette, of near Appo mattox, and a sister, Mrs. D. R. nge, of Evergreen. I He was a member of the Roks Baptist Church. Funeral services were held at 3 P. M., Tuesday,Aug ust 3, conducted by the Rev. A. C. Lawson. Interment was in the Mr. McDonald points out that ! Evergreen Cemetery. Active pall- war production includes three pha-1 bearers were Jack Paule te, Ashby ses 1 the creation of necessary 1 Paulette, Curtis Paulette, David production capacity 2 the manu- ! Paulette, Toby Inge and Claiborne facture of the huge amounts o f Inge. There were many beautiful equipment required by our armed floral tributes, and the services forces and  3  the job of replac- were attended by a host of friends ing equipment expended by the and relatives, armed forces."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "William James and Martha <mark>Baker</mark> Paulette. He spent his"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "William James and Martha <mark>Baker</mark> Paulette. He spent his"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.61, 1220.7, 1717.42, 1304.6], "bbox_id": "450dcfef85", "file": "AppomattoxNewspapers_1892-1898a_0449.pdf", "page": 1, "text": "Wills, Camp  Co., Lynchburg,  Baker, will offer greater inducements to the j .MartinsMiss Ruth Hannah, public for buying clothing, hai-Sj i Bethanycolored.Mi s Oteha etc., than they have ever done be- Tsbcll. fore. Goto their new house, next  door to old stand, and will see a I model clothing establishment."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Wills, Camp  Co., Lynchburg,  <mark>Baker</mark>, will offer greater inducements"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Wills, Camp  Co., Lynchburg,  <mark>Baker</mark>, will offer greater inducements"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2257.68, 187.47, 2445.28, 951.31], "bbox_id": "d9492ab0ff", "file": "AppomattoxNewspapers_1912-1915a_0286.pdf", "page": 1, "text": "Willis, Kinsey, Hughes, Harry B . Smith, MUMt, TMtonji,- RobertUpni Ferebea Price, Batman,- HU- y -, Finance-A. G. Weever, Spessard, Baker, Brewer, Houston, Pitts, Mom tague, Stearnes, Trrell, Spattg. Jor lan, Owem Gregory, rasty. OUver. Claims  Brown, Barley, Birrelfc Bonlant, Dodson, Cummings, Cousins Crockett. Hartley, Hughes, Johnson, Carman, Flannagan.  .  Militia and PolicrlyaedF, Myers Harvey, Malbon, Horner, Taylor, Boni- ant, Brans comb, Coijslna, Chapman. Dalton, Earman, Flannagan.   Asylums and PrisonsT-Granf, Kept- Rolston, Gregory, Ferebee, Taylor Harris, Huff, Cousins, Harvey, Price, Noland, H. C. Weever. Labor and the PoorLand Tiffany Huff, Jordan, Gordon, John O. Daniel Duke, Lowry, Owen, Philpott, Powell, Lincoln, Branscomb. Public Property  Harvey, Kent, Malbon, Rew, Nelson, Harrison, J. Wil liam Daniel, Franklin, Clemejft, Easley,. Hobson, Hartley, Lewis.  Currency and Commerce-Mi Is toad!, .j Kinsey, Lewis, Powers, Green, Hariri son, Pitts, Toney, Stubbs, Steamesj Stock, Terrell, Tiffany. Agriculture and Mining  Adame  I Kinsey, Lewis, Cawthorn, Harry B. I Smith, Commins, Bonlfant, Stock, I Crockett, Hartley, Johnson, Dodson, I Looney. I Manufactures and Mechanic Arts J Kinsey, Spessard, Williams, Buck Adams, Field, Gregory, Jordan. J. WH Ham Daniel, Grasty! Philpott, LownejV v Page. VJ .Counties, Cities and TownsKent, j Buck, Land, Harvey, Myers, Green, Price, Crockett Tonefy, Dalton, Phil pott, Lowry, Page.  . Officers and Offices,at the Capitol Montague, Dodson, Hobson, Love, a Massie, Reed, White, Willis, Chapman,  Winston, Powers, Looney, Flanagan.   Executive Expenditures  Massie, John O. Banlel, Harris, Noland, Brown, Pennington, Powers, Browning, I Meetze, Chapman, BranSfcomb, H. C. I Weever, Powell. _ I Enrolled Bills-Buck, Owen, Oaw I thorn, Chapman, Crockett Ferebee.  I Dalton, Gordon, Heflin, Gunn, Xlncoln, Branscomb, Franklin Immigration  Clement, Meetze, Ralston, Taylor, Grasty, Oordon, Harris, Hartley, Hobson, Jordan, I W ers, Reed, Philpott. Chesapeake and Itz Tributaries Houston, Malbon, Milstead, Brewer, Woodward, Commtas, Stubbs, j. William Daniel, Duke, Heflin I Nonis, Francis W. Smith.   Appropriations  Brewfr, Baker, I Stock, Gunn, Hobson, Adams, Massie, Pitts, Williams. Spessard, Binell Winston, Lincoln, 4    House Expenses  Spatlg, Gunn. Buck, Grant, Green.  . RulesCox, Williams, Houston, Chalkley, A. G. Weaver,  ConfirmationTerrell, A. G. Weever, Leedy. Browning, Heflin, . libraryStephenson, Stock, Flew, Heed, Myers.   . . PrintingWalton, Land, Houston. Special Private and Local Legisla tionWhite, Stephenson, Browplng, Green, Lowry, Nelson, Easley, v 4"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Finance-A. G. Weever, Spessard, <mark>Baker</mark>, Brewer, Houston, Pitts, Mom"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Finance-A. G. Weever, Spessard, <mark>Baker</mark>, Brewer, Houston, Pitts, Mom"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1299.83, 943.84, 1445.3, 1018.94], "bbox_id": "9ba8697948", "file": "AppomattoxNewspapers_1912-1915a_0263.pdf", "page": 1, "text": "William Rush and Miss Loveiane f Harvey, of Appomattox county, were lurried in Lynchburg by the Rev. R, iM, Chandler, of Centenary Methodist Church. Miss Louise Wingfield, of rCharlotte county, was the maid cf honor, and Oscar Baker, of Lynch- i burg, best man."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "cf honor, and Oscar <mark>Baker</mark>, of Lynch- i burg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "cf honor, and Oscar <mark>Baker</mark>, of Lynch- i burg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1119.38, 1771.88, 1272.99, 1890.33], "bbox_id": "cf2c24d15b", "file": "AppomattoxNewspapers_1918-1922a_0205.pdf", "page": 1, "text": "William R. Williams Made Assistant Secretary Of War. Washington.William R. Williams, of Richmond, Va., has been appointed Assistant Secretary of War, succeed ing Benedict Cromwell, who resigned recently to return to private life. Secretary Baker announced that Mr. Williams would take the oath of offic- immediately. Under the Army Reor ganizatlOB act he will hare charge o i procurement of munition and lod1 trial trgaaUatloa for war,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "to private life. Secretary <mark>Baker</mark> announced that Mr. Williams"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "to private life. Secretary <mark>Baker</mark> announced that Mr. Williams"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.37, 325.58, 2328.44, 369.68], "bbox_id": "0689f6d897", "file": "AppomattoxNewspapers_1939-1943a_0133.pdf", "page": 1, "text": "William Baker, Jr. is visit ing his sister in Florida. Mrs, Mollie Bell, who has been quite sick, continues very feeble."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "William <mark>Baker</mark>, Jr. is visit ing his sister in Florida. Mrs, Mollie Bell, who has been quite sick, continues very feeble."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "William <mark>Baker</mark>, Jr. is visit ing his sister in Florida. Mrs, Mollie Bell, who has been quite sick, continues very feeble."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1541.23, 547.41, 1708.44, 594.15], "bbox_id": "381ca74b33", "file": "AppomattoxNewspapers_1947-1949a_0001.pdf", "page": 1, "text": "William A. Baker, of Aiaxandig, visited his aunt, Mrs. S. G. Ander son, on Sunday P. M. Mr. Baker left on Monday for Chicago, where he has accepted a position."}, "highlight": {"text": {"matched_tokens": ["Baker", "Baker"], "snippet": "William A. <mark>Baker</mark>, of Aiaxandig, visited his aunt, Mrs. S. G. Ander son, on Sunday P. M. Mr. <mark>Baker</mark> left on Monday for Chicago, where he has accepted a position."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker", "Baker"], "snippet": "William A. <mark>Baker</mark>, of Aiaxandig, visited his aunt, Mrs. S. G. Ander son, on Sunday P. M. Mr. <mark>Baker</mark> left on Monday for Chicago, where he has accepted a position."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.36, 1346.45, 833.2, 1465.26], "bbox_id": "f6c517f8c7", "file": "AppomattoxNewspapers_1905-1912a_0516.pdf", "page": 1, "text": "Why a New York Woman Has Sued a Baker For Damages. New York.A mouse, discovered in a loaf of bread, is the cause of a 10,- 000 damage action filed here in the Supreme Court by Mrs. Ida Seligman. She has sued a local bread company for injuries that she claims resulted from her discovery. Mrs. Seligman says that the sight of the mouse caused nausea, loss of sleep and ap petite and constant recurring head aches."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Woman Has Sued a <mark>Baker</mark> For Damages. New York.A"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Woman Has Sued a <mark>Baker</mark> For Damages. New York.A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [590.66, 649.08, 733.43, 798.33], "bbox_id": "6fc0eecf5b", "file": "TimesVirginian_1978_0290.pdf", "page": 1, "text": "White. Honorable Mention - John Caldwell, Kim Crabtree, Sa brina Richardson, D o n n ie Steadman, Sharon Taylor, Dana McGrath, Shavonne John son, Carroll Kanipe, Marvin Johnson. Honorable Metnion - Andrew Fratrick, Paula Hyche, Barbara Baker, Karen Basemore, Sher ry Martin, Janet Neally, Sherry Overton, Marilyn Randolph, LisaWenning. 4"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Fratrick, Paula Hyche, Barbara <mark>Baker</mark>, Karen Basemore, Sher ry"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Fratrick, Paula Hyche, Barbara <mark>Baker</mark>, Karen Basemore, Sher ry"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1295.73, 817.89, 1407.76, 1508.8], "bbox_id": "38a1f4436e", "file": "AppomattoxNewspapers_1915-1918a_0403.pdf", "page": 1, "text": "While these designations n used in official dispatches, jl pointed out that it will nptbelJ fore the news dispatches froulj will tell of the exploits or m the Fifth Marylanders or fij ginians, just like the British id the Fifth London Lancers.  The decision of the War Depul to allow the troops to retiül state designation follows a staid test which has been made apd regular army organization tisil completely the guardsmen m state troops recruited udn selective draft I The system contemplates fill designation in parenthesis vonlM narily be omitted in orders, dlsM or correspondence, aid AijJ General McClain in his reportn retary Baker, but would be f l ized when desired for the m fl local identification and to traditions and local pride. Tfl tional Guard organizations  show in . parenthesis their M state designations. The nation organizations would show in  thesis the state from which H ganization or the bulk o ItS drawn. No parenthesis implies Iar army. As- ordinal nunkfl state abbreviation imply Kfl Guard. A simple state ahhrefl implies national army. It Is it is advisable to localize organ if practicable. The assigns state designations for nations organizations under the shore would be somewhat arbitrary  cases, but, on the whole, the could be worked out quite acafl and with suitable credit to nil Single Series For EachCla In the interests of simplicity fore, and to avoid many errs much confusion in admfiustrz other matters, it is believed to sential that a single series oM be used for each class of wfiH divisions, brigades, ments, engineer regiments, c- no mature thought, and in viH uncertainty with respect to   from time to time constitute combinations, or the moste organization. I now believe be impracticable to organise and brigades permanently9 that will enable one to the regimental number the m m the division and brigade to regiment belongs. Ths should be approximated possible in the initial org strict adherence to the be insisted upon. M This office is of the f J f l the formation of is a mistake. O u r tables ization provide for divisi in a specific manner. this organization and f at the very last moment endless and M e W  JM"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "in his reportn retary <mark>Baker</mark>, but would be f"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "in his reportn retary <mark>Baker</mark>, but would be f"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1784.61, 286.79, 1952.47, 725.24], "bbox_id": "b70d9c9f4a", "file": "AppomattoxNewspapers_1926-1933a_0123.pdf", "page": 1, "text": "While here they attended the wedding of Mr. J. Watson El- liotte and Miss Marretta Allen. Also Mr. Elder took a part in the installation of Rev. W. T. Devane, as pastor of Bethlehem and Douglas churches. Mr. Eld er was a former pastor of these churches and he and his good wife are still much loved by the people here. Mrs. Sam Anderson who has  been so ill at S t Lukes Hospital, Richmond, is said to be muchj better. Mr. and Mrs. Marshall Thack-I ston and wife, of Roanoke, spent the Fourth with relatives here and Drakes Branch. Mr. and Mrs, W. B. Thomas of Evergreen, and Misses Lucille Baker, and Terrell Harvey were recent visitors of Mrs. Thomas sister, Mrs. Sam Thackston. I Mrs.Thomas Garrett is at home after spending the past month  with relatives of N. C. Miss Margaret Garrett left the E past week for Berlin, Germany. She spent the past two years in Cuba. Mrs. Josephine Baker, of Phil, will spend her vacation the latter part of August with her parents, Mr. and Mrs. Andrew  Baker."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Evergreen, and Misses Lucille <mark>Baker</mark>, and Terrell Harvey were"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Evergreen, and Misses Lucille <mark>Baker</mark>, and Terrell Harvey were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [357.35, 427.89, 514.14, 567.44], "bbox_id": "51adbfa738", "file": "AppomattoxNewspapers_1902-1905a_0402.pdf", "page": 1, "text": "Which is the greatest political flunkey of the twoFrank A. Mnn- sey in b i paper praising Theodore Roosevelt in the November issue 1904, of Munseys  picture book, called by him, a magazine, or Roy Stunard Baker, in the November sstie of McClures magazine? As to the definition of flunkey, you con testants are permitted to ute Web- ter, or Worchester or the Century Dictionary if they prefer."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "magazine, or Roy Stunard <mark>Baker</mark>, in the November sstie"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "magazine, or Roy Stunard <mark>Baker</mark>, in the November sstie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.36, 484.03, 1905.58, 1065.97], "bbox_id": "f0db74144e", "file": "AppomattoxNewspapers_1915-1918a_0406.pdf", "page": 1, "text": "Wheat threshing is the order of the day now . Wire hope there will be a large crop m ade and hope tbe speculators w ill not get their clutches on it. The corn and tobacco crops are looking fine. Mrs. Rr W. Paulette and Mrs. Emma Godsey and Miss Mattie Farrar, who have been on tbe sick list for some tim e, are ini-! proving. Mr. C H. Rush, who w as op erated on for appendicitis at the City Hospital in Lynch- m rg, is getting along nicely. 3iB m any friends w ill be glad to welcom e him home. Mrs. 0. H. Rush, who has been at the bedside of her husband, re turned home Sunday. Dr. E. E Walker, who has een visiting his sister in Meck lenburg, is expected home to day. W e are glad he made his stay short, as there are so m any sick ones here. Mr. B. S. Simons and fam ily are visiting their old home in Botetourt. Mr. W. D. Hunter and Mr. R. Paulette have sick children w e hope nothing serious. Mr. and Mrs. Oscar Baker ani baby, of Clifton Forge,was the guest of his mother, Mrs. W hiter Thom as, last week al so . Mr. W illie Robertson, of ynchbnrg. Misses E l s i e and Gladys Fleshm an, of W est Virginia w ere visitin g relatives here ast week. Mr. Baxter Fore, of Rich mond, is visiting his brother, Mr Charlie Fore. Mr. and Mrs. Wills, of Red House, were the guests of Mr. and Mrs. J. J. Farrar on Satur- day."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Mr. and Mrs. Oscar <mark>Baker</mark> ani baby, of Clifton"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Mr. and Mrs. Oscar <mark>Baker</mark> ani baby, of Clifton"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [718.3, 1165.99, 2581.82, 1276.51], "bbox_id": "b710d26b08", "file": "AppomattoxNewspapers_1962-1965a_0054.pdf", "page": 1, "text": "What every smart college girl wants this a Samsonite Beauty Case! 1955 FORD School class ins Inside the jar she packed olp fashioned butter cookies. These were made from a recipe of her husbands, a professional baker. The M. G. Stimipsons were pleased with the gift. They sam pled the cookies, and report that family member also"}, "highlight": {"text": {"matched_tokens": ["baker"], "snippet": "her husbands, a professional <mark>baker</mark>. The M. G. Stimipsons"}}, "highlights": [{"field": "text", "matched_tokens": ["baker"], "snippet": "her husbands, a professional <mark>baker</mark>. The M. G. Stimipsons"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [390.95, 530.24, 552.1, 1100.63], "bbox_id": "8058865619", "file": "AppomattoxNewspapers_1908-1909a_0056.pdf", "page": 1, "text": "Whan toa hurricane struck Florida, with such devastation aad loss of life, toe Red Crots National Headquarters was Just congratulating Itself that a year had passed wKheut a major dls- aeter within toe borders of too coun try. The destruction fat Florida has been tentatively estimated by Direc tor of Disaster Roll Hoary L. Baker, of toe American Red Cross, In tarns of relief work ahead of toe organisa tion. Thla takes Into account all suf ferers who must be cared for. Careful survey by experienced au thorities place toe Injured at 4,000, exclusive of toe stricken Quit Coast cities of Moortoaven and Clewieton. Of thà 1400 injured sent to Miami hospitals, B00 ware suffering with ma jor fractures. Ia two other oast coast communities the Injured numbered nearly 1,000. The hometoaa wars con servatively estimated at 80,000. Such figures sketok daily vaguely towhumnn aad malarial problem which the Amorieaa Red Croon la still dota Its utmost to doive For comparison too other outstand ing recent disaster, toa Midwest tor nado of March 18, ItiS, can be do,, scribed in more detail. In that catas trophe the final cheek showed 100 dead, 8,000 Injured and 8,847 families of approximately 80,000 men, women and children rendered homeless. Th final relief operations of toe Red Oroee were brought to a close March 18, IMS, exactly a year from th day toe tornado truck five tatou. 8 terrible did toe death and de- stnitcloB imprest itself on the experi enced Rad Oroee forces rushed Into Florida that Chairman John Barton Payne did not hesitate to sail for a relief fund from too whole country of  8 , 006 , 904 . The Rod Cross concen trated ovory resource in trained per sonnel -on to stricken region.  - - C Th Now Jersey munitions explo sion, in July, while terrible as a spec tacle, could not compare with either of toes other two disasters la final destructiveness. It gave to Red Cross aa opportunity for servie In which Rod Cross nurses treated M Injured, and during toe height of thé cm, gehey fed between 700 aad 100 pee- pie driven from their homes. More than 000 eases were registered with to Rad Cross after the explosions fell assietanee In regaining their hold on Mf through rehabilitation work. This latter ,1s a regular part ot toa"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Disaster Roll Hoary L. <mark>Baker</mark>, of toe American Red"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Disaster Roll Hoary L. <mark>Baker</mark>, of toe American Red"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2110.09, 369.66, 2266.89, 438.66], "bbox_id": "2b6d3a3879", "file": "AppomattoxNewspapers_1892-1898a_0158.pdf", "page": 1, "text": "were Sir Charles Tupper. Sir Ben jamin Baker, Messrs. Preece and Lamb, the postoffice electricians, Vice-President Clarence Mackey, Messrs. Ward and Bambridge and otoer officials of the company."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "were Sir Charles Tupper. Sir Ben jamin <mark>Baker</mark>, Messrs. Preece and Lamb, the postoffice electricians, Vice-President Clarence Mackey, Messrs. Ward and Bambridge and otoer officials of the company."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "were Sir Charles Tupper. Sir Ben jamin <mark>Baker</mark>, Messrs. Preece and Lamb, the postoffice electricians, Vice-President Clarence Mackey, Messrs. Ward and Bambridge and otoer officials of the company."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [436.54, 717.87, 595.79, 1327.41], "bbox_id": "3656c06522", "file": "AppomattoxNewspapers_1915-1918a_0592.pdf", "page": 1, "text": "Well, as the people have been kept in so closelv, we havent much to w rite about. But we will have to help the Editor keep up the paper. I believe the flu has about subsided around here. We bad several cases, but no very serious ones in this neighbor hood. W e were sorry there coaid be no preaching a t T rinity on Sun day, as we thought th a t would be Mr. Lam bdins last day w ith as before conference. Sadie Ella, infan t daughter of Mr. and Mrs. H enry Dicker- son, died Friday and w a s buried Saturday afternoon at the fam ily burial ground. The funeral was conducted by their pastor, Mr. Hobbs. The little grave was covered w ith beau tiful flowers Mrs. Em m aG odsey is visiting friends and relatives in Chapel neighborhood. Mr. and Mrs. Jam es Baker were the guests of Mrs. W alter Thom as on Sunday. W e were very sorry to hear of the death of Mrs. Willie T. Y oung, who died a t her father- in law s, Mr. Tom Y oung, last Friday. H er rem ains were laid to rest by the side of her hus band, who preceded her only about nine m onths. Much sym pathy is felt for Mr. G. T. F a rra r and fam ily who had their house and all th eir furniture, clothing and smoke house burned. A good m any people have proved their sym pathy. The unfortunate ones appreciated it very much. Mr. Josh H arvey is entitled to another half pound su g ar Now, guess w ho. Mr. and Mrs. J . J . F arrar were the guests of Mr. and Mrs. J. R. Lee on Sunday."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "and Mrs. Jam es <mark>Baker</mark> were the guests of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "and Mrs. Jam es <mark>Baker</mark> were the guests of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [860.66, 548.45, 1026.81, 587.95], "bbox_id": "6d1290fad0", "file": "AppomattoxNewspapers_1952-1954a_0211.pdf", "page": 1, "text": "Week-end guests of Mrs. W. B. Thomas were Mr. and Mrs. Oscar Baker, of Richmond, Mrs. C. 1. Har vey and Mrs. S. G. Anderson."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Week-end guests of Mrs. W. B. Thomas were Mr. and Mrs. Oscar <mark>Baker</mark>, of Richmond, Mrs. C. 1. Har vey and Mrs. S. G. Anderson."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Week-end guests of Mrs. W. B. Thomas were Mr. and Mrs. Oscar <mark>Baker</mark>, of Richmond, Mrs. C. 1. Har vey and Mrs. S. G. Anderson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1876.81, 412.35, 2018.01, 496.05], "bbox_id": "a9638091f8", "file": "AppomattoxNewspapers_1971-1973a_0373.pdf", "page": 1, "text": "Week-end guests in the Paul ette home also included Mr. Hunter Harvey and Mrs. Katie Gunter of Richmond, Mrs. Dil lard Baker of Evergreen, B. B. H u b b a r d and Mr. and Mrs. Bruce Paulette and Traci of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Richmond, Mrs. Dil lard <mark>Baker</mark> of Evergreen, B. B."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Richmond, Mrs. Dil lard <mark>Baker</mark> of Evergreen, B. B."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [651.34, 507.47, 791.96, 947.55], "bbox_id": "b835e3c0d9", "file": "AppomattoxNewspapers_1974-1975a_0014.pdf", "page": 1, "text": "week end with his family. Mrs. R. E. Harris, Mr. Jesse and Melvin Harris and Mr. and Mrs. R. E. Harris, Jr. are camping on Staunton River. Rev. E. W. Terry of Evergreen Baptist Church is having a meeting this week in Kentucky. The Evergreen Ruritans held their regular meeting last Thursday night at the com- mur ity center. Sympathy is extended to the family of Mr. J. A. Burke who was buried Sunday. We are sorry to hear of Mrs. Ruth Clapp breaking her arm in a fall. She is at her daughters, Mrs. Alice Martin. The pastor and deacons and their wives of Evergreen Baptist Church enjoyed supper at the Parkway Restaurant Saturday night. Mr. and Mrs. Wylie Richard son and Mr. Garland Mayberry of Lynchburg was dinner guests of Mrs. Mott Harvey Sunday. Mrs. H. D. Baker and Mrs. David Paulette called in the same home. There will be a call meeting of the Evergreen Cemetery Organization on Tuesday night October 1, 1974 at the community house. Please all members be present and members of Methodist and Baptist Church. Tins meeting will be at 730 p.m. . FMAg and Mrs. Jimmy Wo-"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Sunday. Mrs. H. D. <mark>Baker</mark> and Mrs. David Paulette"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Sunday. Mrs. H. D. <mark>Baker</mark> and Mrs. David Paulette"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [726.25, 345.42, 890.25, 451.42], "bbox_id": "456f9c54d9", "file": "AppomattoxNewspapers_1936-1939a_0053.pdf", "page": 1, "text": "weejk-end giesiis of their mother, Mrs. S.G. Anderson. Mr.and Mrs. R.H. Moore, of Washington, D. C., the foster son of Mrs. Anderson, were visitors in the same home. Mrs. Theo Jernigan and daughter, Barbara Kay, who have been spend ing sorrtet Itimle with her parents, Mr. and Mrs. W .A. Baker, will return to her home in New Smyrna, Florida on Wednesday."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "and Mrs. W .A. <mark>Baker</mark>, will return to her"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "and Mrs. W .A. <mark>Baker</mark>, will return to her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2147.06, 707.92, 2310.55, 1609.59], "bbox_id": "d98c115ee7", "file": "AppomattoxNewspapers_1922-1923a_0371.pdf", "page": 1, "text": "We pay the freight on all orders of S.OO or more within a radius of 80 miles of Lynchburg during this month. Send money by Registered Mal. P. O. Order, Express Order or Bank Check. Best Goods! Lowest Prices! Money Bade If ypu want It.  TEAS 10 per cent discount on 8 lbs. and over. Gunpowder, lb 80 80c and 1.00 Eng. Breakfast, lb. 80 and 1. India and Ceylon 80c. Formosk Oolong 80c. Yotlng Hyson 1.00 Colonial Brand, any kind 80c. Grant Cabin,   80 c. ROASTED COFFEES. 10 per c -nt discount on 10 pounds or over. Arabia Mocha lb. 33c. Old Gov. Java, lb. 35c. Java and Mocha, 35c. I La Guayru 25c. Princess B.end, 25c. Maracaibo, 24c. Najavo Biend, 20c. Rock Bottom Blend, 17c. Strong Rio, 13c.  Postum Cereal I-kg. 13 and 22c, Walker Baker Cocoa, box 25c. Chocolate, cake 18c. Granulated Sugai lb, 5 I -2c. Light Brown Sugar lo., 5c, Cut Loaf Suar, 7 l-2c. Powdered Sugar, 7 I-2c. Crystal Domino Sugar, 5 lb box 40c. Matchless Patent Flour, bbl.  4,75 Bon Ton Straight Flour,  4.00 Black Prunes, 8, 10 and 12 1-2. .Ruby Prunes, 18c. Evaporated Apricots, 28c. EvaporatedPeaches. 1 5c. Evaporated Apples, 12 I-2c, Turkish Layer Figs, i0, 15, 20c Ca. Cooking  lb. 8 I-2c. Persian Dates, pkg. 8c. Cal. Layer Raisms, lb. 12c Box, ?.00 Imported Cluster Raisins, ib. 28c. Seeded Raisms, 12 l-2c. Cleaned Currents, 12c. Shredded Cocoanut, lb 28c Conserved Orange Peel 25c lemon   Citron, 25c Ginger, Ib. 40c Pine Apple, Ib 50c Cherries, Ib 50c Assorted Fruits, tb 50c Oranges, doz 20, 30, and 40c Lemons doz. 30c Cranberries, qt. 15c  English Walnuts, Ib 15 and 20c Almonds 20c Pecans, 20c Filberts, 15 and 20c Brazils, 15 and 20c Mixed Nuts, 15 and 20c Cocoanuts, each 10 and 15c Shelled Almonds, Ib 50c Shelled Eng, Walnuts, Ib 50c Quaker Oats, pkgf 10c Grape Nuts, I2l2c Hominy Griis 10 and Pearl Barley, 10c Tapioca, 10c Sago, 10c Cream of Wheat, 15c Shredded Wheat, 12 1 -2 Egg o  see, 10c, Farina, 10c Puffed Rice, 10c Buckwheat Fiour, Ib 5c Prepared Buckwheat, pkg 15c Queen Olives, 10, 20. 20 and 60c Stuffed Olives, 10 and 25c Tomato Catsup, 10, 16 ar.d 26c Lea  Ps Sauce, 25, 50 and 90c Salad Dressings, 10 and 25c. Mustard Dressing, 15 and 25c Coimans Mustard, 15 and 30c Marachino Cherries. 26 and 50c Pickles, Heinz, Sweet and Sour, in bo 10 15. 20, 25 and 35c Macaroni, pkg. 10c 3 for 25c Imported Macaroni 12 !-2c Swiss Cheese lb 25c Limberger Cheese, Ib 20c Royal Lunch, jar 10, 15 and 25c Edams, each 1 00 Pine App e Cheese, 50c C.eme De Brie, 15c Camebert, 15c. Roquefort, 18c Canned Salmon, 10, 15 and 25c Findon Haddock 25c Kippered Herring 20c Sardines, 5. 8, 10. 15 and 20c Canned Lobster 10. 20 and 35c All prices guaranteed until next Issue of this paper 3 r o s . - Va."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 25c. Chocolate,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 25c. Chocolate,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2126.84, 906.22, 2294.06, 1779.62], "bbox_id": "9700a683b3", "file": "AppomattoxNewspapers_1922-1923a_0366.pdf", "page": 1, "text": "We pay the freight on all orders of 99,00 or mor within a radius of 80 miles of Lynchburg during thi month. Send money by Registered Mall, P.O . Order. Express Order or Bank Check. Best Goods! Lowest Prices! Money Back If you want It. TEAS 10 per cent discount on 9 lbs. and over. Gunpowder, lb 90 80c and 1.00 Eng. Breakfast, lb. 60 and 1. India and Ceyon 90c. Formosa Oolong 80c. Young Hyson 100 Colonial Brand, any kind 80c. Grant Cabin,   80c. ROASTED COFFEES. 1 0 per cent discount on 10 pounds or over. Arabia Mocha lb. 38c. Old Gov. Java, lb. 38c. Java and Mocha, 38c. La Guayra 28c. Princess B.end, 26c. Maracaibo, 24c. Najavo Blend, 20c. Rock Bottom Blend, 17c. Strong Rio, 16c. Postum Cereal Fkg. 13 and 22c, Walker Baker Cocoa, box 28c. Chocolate, cake 18c. Granulated Sugar lb, 6 I- ac . Light Brown Sugar lo., 8c, Cut Loaf Sugar, 7 I-2c. Powdered Sugar, 7 l-2c. Crystal Domino Sugar, 6 lb box 40c. Matchless Patent Flour, bbl. 94.78 Bon Ton Straight Flour,  4.00 Black Prunes, 8, 10 and 12 12. Ruby Prunes, 16c. Evaporated Apricots, 26c. Evaporated Peaches. 16c. Evaporated Apples, 16c. Turkish Layer Figs, 1 0 ,18, 28c. CaL Cooking lb. 8c. Persian Dates, pkg. 8c. Cal. Layer Raisins, lb. 10c Box, 91.76 Imported Cluster Raisins, lb. 26c. Seeded Raisins, 12 1 -2c. Cleaned Currents. 12c. Shredded Cocoanut, lb 26c Conserved Orange Peel 28c lemon   Citron, 28c Ginger, lb. 40c Pine Apple, lb 80c  Cherries, lb 80c Assorted Fruits, lb 80c Oranges, dos 20, 30. and 40c Lemons doz. 30c Cranberries, qt. 16c English Walnuts, lb. 16 and 20c, Almonds, 18 and 20c. Pecans, 18 and 20c Filberts, 18 and 20c Brazils, 18 and 20c Mixed Nuts, 18 and 20c Cocoanuts, each 10 and 16c Shelled Almonds, lb 80c Shelled Eng, Walnuts, lb 80c Quaker Oats, pkg, 10c Grape Nuts,  12 l2c Hominy Grits 10 and l earl Barley, 10c Tapioca, 10c Sago, 10c Lrm of Wheat. 16c Shredded Wheat, I t 1-2 Egg a -see, 10c. Farina, 10c Puffed Rice, 10c Buckwheat Fiour, lb 6c Prepared Buckwheat, pkg 16c Queen Olives, 10, 20, 26 and 60c Stuffed Olives. 10 and 26c Tomato Catsup, 10, 16 and 26c Lea  Ps Sauce, 26, 80 and 90c Salad Dressings, 10 and 28c. Mustard Dress.ng. 16 and 26c Colmans Mustard, 16 and 30c Maracnino Cnerries. 26 and 60c Pickles, Heinz, Sweet and Sour, In bottles, 10, 18, 20, 29 and 38c Macaroni, pkg. 10c 3 for 28c Imported Macaroni 12 l2c Swiss Cheese lb 26c Limberger Cheese, lb 20c Royal Lunh, jar 10, 18 and 26c Edams, each 91 00 Pme App e Cheese, 80c C eme De Brie, 18c Camebert, 16c. Roquefort. 16c Canned Salmon, 10, 18 and 26c. Fipdon Haddock 28c Kippered Herring 20c Sardines, 8. 8, 10, 16 and 20c Canned Lobster 10, 20 and 38c All price! guaranteed until next Issue o  this pgper"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 28c. Chocolate,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 28c. Chocolate,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.85, 910.77, 1791.63, 1806.1], "bbox_id": "4af666703f", "file": "AppomattoxNewspapers_1922-1923a_0377.pdf", "page": 1, "text": "We pay the freight on all orders of 95.00 or more within a radius of 50 miles of Lynchburg during this month. Send money by Registered Mall. P.O. Order, Express Order or Bank Check. Best Goods! Lowest Pricesl Money Back if you want H. TEAS 10 per cent discount on 5 lbs. and over. Gunpowder, lb 50 80c and 1.00 Eng. Breakfast, lb. 50 and 91. India and Ceylon 50c. Formosa Oolong 80c. Young Hyson 9100 Colonial Brand, any kind 50c. Grant Cabin,   80c. ROASTED COFFEES. 1.0per cent discount on 10 pounds or over. Arabia Mocha lb 35c. Old Gov. Java, lb. 35c. Java and Mocha, 35c. La Guayra 25c. Princess Blend, 25c. Maracaibo, 24c. Najavo Blend, 20c. Rock Bottom Blend, 17c. - Strong Rio, 15c. Postum Cereal Pkg. 13 and 22c, Walker Baker Cocoa, box 25c.   Chocolate, cake 18c. Granulated Sugar lb, 5 I -2c. Light Brown Sugar lb., 5c, Cut Loaf Sugar, 7 l-2c. Powdered Sugar, 7 l-2c. Crystal Domino Sugar, 5lb box 40c. Matchless Patent Flour, bbl. 94.76 Bon Ton Straight Flour,  94.00 Black Prunes, 8, 10 and 12 1-2. Ruby Prunes, 15c. Evaporated Apricots, 25c. Evaporated Peaches. 15c. Evaporated Apples, 12 l-2c. Turkish Layer Figs, 10,15, 20c Cak Cooking  lb. 8 l-2c. Persian Dates, pkg. 8c. Cal., Layer Raisins, lb. 12c Box, 92.00 Imported Cluster Raisins, lb. 25c. Seeded Raisins, 12 1 -2c. Cleaned Currents, 12c. Shredded Cocoanut, lb 25c Conserved Orange Peel 25c lemon   Citron, 28c  Ginger, lb. 40c Pine Apple, lb 60c  Cherries, lb 50c . Assorted Fruits, ib 50c Oranges, doz 20, 30, and 40c Lemons doz. 30c Cranberries, it. 18c Engilsh Walnuts, lb 15 and 20c. Almonds 20c Pecans, 20c Filberts, 15 and 20c Brazils, 15 and 20c Mixed Nuts, 15 and 20c Cocoanuts, each 10 and i 5c Shelled Almonds, Ib 50c , Shelled Eng, Walnuts, Ib 50c Quaker Oats, pkg, 1 Oc Grape Nuts,  12 l a2c Hominy Grits 10 and 9 Pearl Barley, 10c Tapioca, 10c Sago, 10c Cream pf Wheat, 15c Shredded Wheat, 12 1-2 Egg o see, 10c, Farina, 10c Puffed Rice, 10c Buckwheat Flour, lb 5c Prepared Buckwheat, pkg 15c Queen Olives, 10, 20, 25 and 50c Stuffed Olives, 10 and 25c Tomato Catsup, 10, 18 and 25c Lea It Ps Sauce, 25, 50 and 90c Salad Dressings, 10 and 25c. Mustard Dress.ng, 15 and 25c Colmans Mustard. 15 and 30c Marachlno Cherries. 25 and 50c Pickles, Heinz. Sweet and Sour, in bo 10, 15.20. 25 and 35c Macaroni, pkg. 10c 3 for 28c Imported Macaroni 12 l-2 c Swiss Cheese lb 25c Limberger Cheese, lb 20c Royal Lunch, jar 10, 15 and 25c Edams, each 91 00 Pine App e Cheese, 60c Geme De Brie, 15c Camebert. 16c. Roquefort, 15c Canned Salmon, 10, 15 and 25c Findon Haddock 25c Kippered Herring 20c Sardines, 5, 8, 10, 15 and 20c Cantytd Lobster 10, 20 and 35c All prices guaranteed until next Issue of this paper T tt q y r o p b r o s . LyrjChbUpg - V a"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 25c.   Chocolate,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "13 and 22c, Walker <mark>Baker</mark> Cocoa, box 25c.   Chocolate,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2141.26, 740.97, 2309.54, 1618.52], "bbox_id": "2d4ab16365", "file": "AppomattoxNewspapers_1922-1923a_0362.pdf", "page": 1, "text": "We pay the freight on all orders of 9,00 or more within a radius of 50 miles of Lynchburg during this month. Send money by Registered Mail. P.O. Order, Express Order or Bank Check. Best Goods! Lowest Pricesl Money Buck if you want, it. TEAS 10 per cent discount on 5 lbs. and over. Gunpowder, lb 50 80c and 1.00 Eng. Breakfast, lb. 50 and 1. India and Ceylon 50c. Formosa Ooleng 80c. t Young Hyson 1.00 Cflonial Brand, any k.nd 50c. Grant Cabin,   80c. ROASTED COFFEES. 10 per cant discount on It pounds or over. Arabia Mocha lb. 35c. Old Gov. Java, ib. 35c. Java and Mocha, 35c. La Guayra 25c. Princess B.end, 25c. Maracaibo, 24c. Najavo Blend, 20c. Rock Bottom Blend, 17c. Strong Rio, 15 c . Postum Cereal Pkg. 13 and 22c. Walker Baker Cocoa, box 25c. Chocolate, cake 18c. Granulated Sugar Ib, 5 1 -2c. Light Brown Sugar I d . , 5c, Cut Loaf Suar, 7 I -2c. Powdered Sugar, 7 I-2c. Crystal Domino Sugar, 5 Ib box 40c. Matchless Patent Flour, bbl. 4.75 Bon Ton Straight Flour,  4.00 Black Prunes, 8, 10 and 12 1-2. Ruby Prunes, 15c. Evaporated Apricots, 25c. Evaporated Peaches, 15c. Evaporated Apples, 15c. Turkish Layer Figs, 10,15, 25c. Cal. Cooking  Ib. 8c. Persian Dates, pkg. 8c. Cal. Layer Raisins, lb. 10c Box, 1.75 Imported Cluster Raisins, ib. 25c. Seeded Raisins, 12 I-2c. Cleaned Currents, 12c. Shredded Cocoanut, Ib 25c Conserved Orange 1 eel 28c lemon  Citron. 28c Ginger, Ib. 40c Pine Apple, Ib 50c  Cherries, Ib 50c Assorted Fruits, ib 80c Oranges, doz 20, 30, and 40c Lemons doz. 30c Cranberries, qt. 15c English Walnuts, Ib. 15 and 20c. Almonds, 15 and 20c. Pecans, 15 and 20c Filberts, ,15 and 20c Brazils, 18 and 20c Mixed Nuts, 18 and 20c Cocoanuts, each 10 and 15c Shelled Almonds, Ib 50c Shelled Eng, Walnuts, Ib 50c Quaker Oats, pkg, 10c Grape Nuts,  12 1 2c Hominy Grits 10 and 20c Pearl Barley, 10c Tapioca, 10c Sago, 10c Cream of Wheat, 15c Shredded Wheat, 12 1-2 Egg o see, 10c, Farina, 10c Puffed Rice, 10c Buckwheat Flour, Ib 5c Prepared Buckwheat, pkg 15c Queen Olives, 10, 20, 25 and 60c Stuffed Olives, 10 and 25c Tomato Catsup, 10, 15 and 25c Lea  Ps Sauce. 26. 50 and 90c Salad Dressings, 10 and 25c. Mustard Dressing, 15 and 26c Oilmans Mustard, 15 and 30c Marachino Cherries, 25 and 60c Pickles, Heinz, Sweet and Sour, in bottles, 10, 15, 20. 25 and 35c Macaroni, pkg. 10c 3 for 25c lmpoited Macaroni 12 l-2c Swiss Cheese ib 25c Limberger Cheese, Ib 20c Royal Lunch, jar 10, 15 and 25c Edams, each 1 00 Pine App e Cheese, 50c C.eme De Brie, 16c Camebert, 16c. Roquefort. 15c Canned Salmon, 10, 15 and 25c. Findon Haddock 26c Kippered Herring 20c Sardines, 5. 8, 10, 18 and 20c Cannd Lobster 10, 20 and 35c. All prices guaranteed until next issue of this paper."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "13 and 22c. Walker <mark>Baker</mark> Cocoa, box 25c. Chocolate,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "13 and 22c. Walker <mark>Baker</mark> Cocoa, box 25c. Chocolate,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.0, 993.81, 1919.8, 1370.35], "bbox_id": "dd5c168c77", "file": "AppomattoxNewspapers_1915-1918a_0565.pdf", "page": 1, "text": "We had a fine fain and crops are looking fine and gardens are booming. Mr. Joe W ilson and daughter were the guests, of Mr. Willie and Miss Carrie Wilson last week. Rev. A. K. Lamdin and Mr. J. J. Farrar are attending thé district conference at Montvale this week. Mrs. Bessie Baker is the guest of her mother-in-law, M r s Walter Thomas, this week. Mr. and Mrs. R. W. Paulett were the guests of Mr. and Mrs. J. J. Farrar Sunday. Master Harry Farrar is con fined to his room with a bad sprained foot. His friends hope to see him out again soon. Mrs. R. H. Taylor, of Ronce verte, W . Va., who has been visiting her mother and father, Mr. and Mrs. J. L. Clark, re turned to her home last week. One of our neighbors is the proud possessor of two cars. Miss Mattie Farrar expects to visit her father in Richmond next week. W e wish for her a pleasant trip."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "this week. Mrs. Bessie <mark>Baker</mark> is the guest of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "this week. Mrs. Bessie <mark>Baker</mark> is the guest of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [867.76, 1100.39, 1185.88, 1560.37], "bbox_id": "027cb60ba5", "file": "AppomattoxNewspapers_1915-1918a_0574.pdf", "page": 1, "text": "We are Something More Than  a Lot of Stomachs Speaking of education re Pamplin I mjnj8 UB Bay that too many Childrens Day exercises were I of our people do not use the held in tbe Baptist churoh I schooling they have. They here on the 3rd Sunday morn-1 learn how to read and then ing- dont read. And to learn how Misses Ruth T. and Irene A. I to read and then fail to read is Young, accompanied by sev-las bad as to prepare land for eral friends from Brookneal, I a crop and then not plant it, motored to Evergreen Saturday I or to plant and then not har- P- m. I vest. We not only ought to Miss Kate Franklin, who has I have a good library in every been taking a course in music school, bat it should be enlarg- at Cornell University, N. Y., is led into a community library, at home. I kept open all the year round. Mrs. Baker, of Darlington The person in charge of this Heights neighborhood, has re-1 community library should be a turned from a short visit to her I real lover of books, interested husband, Cofp. J . T. Baker, at I not only in getting children to Camp Lee I love reading but interested also Dr. E. E. Walker, of the Epi-lin getting every grown person leptic Colony,Madison Heights, I in the community to read the was visiting friends in Pamplin I most wholesome, helpful, and last week. His many friends I inspiring books and papers, are always glad to welcome I And just here we are remind- Mm back to see them. I ed of some striking expressions The Warehouse opened up for I of a thoughtful man who came the season here on Aug. 15th I into our office tbe other day. Miss Geneva Lukin, of Char-1 A house without a pantry or lotte, N. C  has been visiting 1 dinning-roomWould anyone in the home of Dr. F. H. Lukin, call that a home? he exclaim- There was a heavy thunder ed.  And yet a man ought tc storm accompanied by severe I think it just as unreasonable, lightning on Monday night.butj just as much a thing to he not mi ch rain. I ashamed of, to build a house Mr. Henry Booker was in I without a library or reading Lynchburg several days last room as to build one without"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "the year round. Mrs. <mark>Baker</mark>, of Darlington The person"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "the year round. Mrs. <mark>Baker</mark>, of Darlington The person"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [271.2, 217.98, 424.9, 1273.83], "bbox_id": "f6781be4d2", "file": "AppomattoxNewspapers_1974-1975a_0518.pdf", "page": 1, "text": "We are really having nice weather now. Now it is warm and nice enough to go fishing. Mrs. Ruby Almond and Mrs. Phyllis Richardson attended the funeral of Mrs. Mamie Beasley, Webb Hancock at Hollywood Church on Monday afternoon. Also Rev. W. H. Elder had a part in the funeral. The Rocks Homemakers Club had its November meeting with Mrs. Addie Baker on Thursday night with 20 present. No school on Friday. So the children got a rest from school. The Rocks Quartet went to Portsmouth Saturday after noon to present a program of Gospel music at Rev. Virgil Hudsons church that night. Lloyd Richardson and Romie were helping Robert Roach take down tobacco Saturday morning. Little Bob Martin spent the weekend with his grandparents Mr. and Mrs. R. B. Hamlin, Sr. Congratulations are extend ed to Mr. and Mrs. Romie Dawson on the arrival of a daughter, Angela Marie, 7 lbs. 12 oz., born on Nov. 5, at Va. Baptist Hospital. Mr. and Mrs.Kyle Almond of M onterey, Va. spent the weekend here with his parents, Mr. and Mrs. Wilson Almond of Appomattox. Dave Go in went to a doctor at Appomattox on Sunday afternoon. A speedy recovery is wished him. The Rocks Extension Home makers Club had 18 present for the Achievement Day program at A.H.S. on Saturday after noon. Howard White of Victoria was the Gideon speaker at Rocks Sunday morning. Con gratulations to them on the fine work they are doing. Mrs. Romie Dawson and Angela Marie returned home from the hospital Saturday. Congratulations to Mr. and Mrs. R. B. Hamlin, Jr. who won a flower from Superior Trees Nursery on Wednesday on their first anniversary. A speedy recovery is wished Mrs. Ella S. Anderson who was in a car accident last week  broke her collar bone. A number were in Lynch burg shopping one day last week. Mr. and Mrs. Joe Almond and children were dinner guests of her parents, Mr. and M rs. Clarence Richardson Sunday. Mrs. Clara Dudley, aunt of Mrs. W. H. Elder returned back to U niversity Hospital on Sunday. A very speedy recovery is wished her. Rita Inge and some friends of Madison College spent the weekend at Appomattox with her parents, Mr. and Mrs. Claiborne Inge. A number from here were on the A.H.S. Honor Roll. They were Patricia Elder, Susan Hamlin, Mary Jane Smith, Richard Shelton, Melinda Mc Intosh, Richard Guill, Romie Richardson, Steve Letterman, Cindy Roach, and Faith Vaughn. Mr. and Mrs. Lloyd Richard son and boys were visiting her mother, Mrs. Gladys Harvey at Evergreen Sunday. Mrs. Dora Jean Williams of Waynesboro was visiting her parents, Mr. and Mrs. R. E Roach Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "meeting with Mrs. Addie <mark>Baker</mark> on Thursday night with"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "meeting with Mrs. Addie <mark>Baker</mark> on Thursday night with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [348.52, 288.94, 518.78, 665.93], "bbox_id": "4b1350eed8", "file": "AppomattoxNewspapers_1926-1933a_0332.pdf", "page": 1, "text": "We are having a good rair today, it will help wheat. Mr. and Mrs. D. R. Inge spent Sunday with Mr. and Mrs. Philip Paulett. Mr. and Mrs. Dillard Baker and son, Jack, were also visit ors in this home. , Mr. Hubert Martin spent the week-end with Mr. Frank Ransom. Master James Dinkins en tertained quite a number of his little friends at his 8th birthday party Nov. 2. He received a number of useful presents which were very much appreciated. We hope James many more happy birthdays. Mr. and Mrs. S. M. Ransom visited Mr. Calvin Ransom Sunday evening. Mr. and Mrs. Jessie Mead ows, of Roanoke, were visitors in the home of Mr. and Mrs. Jim Ransom. j Miss Ella Epperly, of Lynch burg, is with Mrs. Anderson for a little while."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Mr. and Mrs. Dillard <mark>Baker</mark> and son, Jack, were"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Mr. and Mrs. Dillard <mark>Baker</mark> and son, Jack, were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1086.5, 323.51, 1252.9, 662.06], "bbox_id": "5fb1618042", "file": "AppomattoxNewspapers_1912-1915a_0509.pdf", "page": 1, "text": "WATCH IT GROW. In Phoenix, Ariz., before the Novem ber election, all the liquor places put up a sign to this effect This build ing will be for rent if the dry amend ment carries. After election the sar loon men refused to give up their leases, some of them opening drug tores, some soft drink stands, some restaurants. The law went into effect January 1. The day afterwards every baker and grocer in the city for the first time sold out his stock of bread, and the meat markets sold out their meats. Last year the arrests for drunkenness in Phoenix averaged 12 per day on the day after the saloons closed, for the first time in its his tory the police court had no drunks. Phoenix bankers also have a tale to tell. The day Arizona went dry the Valley bank, which suspended early in November, reorganized and opened up for business stronger than ever. The Citizens bank, established by local capitalists, opened after the saloons were voted out The Central bank, organized by eastern men after the election, filed articles of incorporation three days after the law went into ef fect and now occupies one of the empty buildings. A branch of the Anchor Trust company of Wichita, Kan., was established after the state voted dry. Watch Arizona grow, say Arizonians."}, "highlight": {"text": {"matched_tokens": ["baker"], "snippet": "The day afterwards every <mark>baker</mark> and grocer in the"}}, "highlights": [{"field": "text", "matched_tokens": ["baker"], "snippet": "The day afterwards every <mark>baker</mark> and grocer in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1133.76, 719.35, 1286.31, 1340.6], "bbox_id": "1c7fb72bb3", "file": "AppomattoxNewspapers_1915-1918a_0184.pdf", "page": 1, "text": "Washington.With 1,500 additional regular troops ordered to the Mexican border and reports of the rapid spread of anti-American feeling continuing to pour in from consuls all over North ern Mexico, administration officials made no attempt to disguise their un easiness. It was officially admitted that there Is growing alarm over what the agita tion may produce and tie possibility of an attack on General Pershings ex pedition. No case of attack on the persons of American residents in Mexico has been reported, although there have been one or two attacks on vacant consulates and other American prop erty. Distributed By Raids. Part of the increasing apprehension here is due to the renewed raids in the Laredo region. Several reports dealing with the situation there have been received. Officials declined to re- val details, but they gave the impres sion of having reason to believe a seri ous purpose waR behind the bandit raid on the Coleman ranch. Three raiders were killed and three captured, one re port said, adding that they attempted to burn a railroad bridge near Laredo, but failed. The new force sent to join General Funptons border patrol, Secretary Baker said, was to fill in gaps in the guard, such as that near Laredo. It will be composed of 10 companies of coast artillery and a battalion of engi neers. The artillerymen will be with drawn from fortifications between Portland, Maine, and Sandy Hook, and the engineers go from barracks in this city.1 The Secretary said there was no present intention of calling out addi tional National Guard regiments for border duty. Cavalrymen Fired On. General Mann, commanding at La redo, reported that a patrol of three cavalrymen was fired on during the night of June 10 near the town of Hachita and Private W. L. Saunders, of Troop K, Twelfth Cavalry, slightly wounded. Two mounted Mexicans, who did the firing, escaped. A message from Captain Burrage, commanding the battleship Nebraska at Vera Cruz, said there was consider able unrest in that region, due ap parently, to the currency situation. There were no evidences of unfriendli ness toward Americans, the message said. It added that the Carranza Gov ernment had been sending troops and ammunition inland. Captain Burrage did not know the object of these troops movements."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Funptons border patrol, Secretary <mark>Baker</mark> said, was to fill"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Funptons border patrol, Secretary <mark>Baker</mark> said, was to fill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [945.32, 560.19, 1099.88, 1027.58], "bbox_id": "e41b2899fd", "file": "AppomattoxNewspapers_1918-1922a_0207.pdf", "page": 1, "text": "Washington.With 10 votes short in the House, 6 votes short in the Sen ate, the National Womans Party, one week before the convening of the spe cial session of the Tennessee Legisla ture, is concentrating its full force in Tennessee. Four headquarters have already been opened in the State, with live organizers campaigning in the dis tricts of the members of the legisla ture. Two more members of the Womans Party left for Nashville, Mrs. Mabel Kenton Reber, of New York, and Miss Mary Winsor, of Hav- erford, Pa. Mrs. Abby Scott Baker, political chairman of the party, also left Wash ington for Ohio, where, as fourth member of the ratification committee appointed to consult with the Demo cratic leaders, she will be in constant touch with Governor Cox on the Ten nessee situation. The other members of the ratification committee are Mrs. James Rector, of Columbus, O., mem ber of the Womans party advisory council Miss Anita Pollitizer, legisla tive secretary, and Miss Sue White, of Nashville, Tenn., state chairman of the party. Three thousand dollars was con tributed by Philadelphia members of the Womans , Party for work in the thirty-sixth state. Miss Fanny Coch ran gave 1,000, Miss Mary Burnham another  1 , 000 , and small contribu- tions, including 300 from Mrs. Kath erine Halligan, of Philadelphia, made up the third. In addition to Miss Sue White, Ten nessee chairman of the Womans Party, and the local members of her branch, the campaigners for the Womans Party who are now in the State are Miss Betty Gram, of Port land, Ore. Miss Anita Pollitzer, of Charleston, S. C. Miss Catherine Flanagan, of Hartford, Ct., and Miss Anne Calvert Neely, of Vicksburg, Miss."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Pa. Mrs. Abby Scott <mark>Baker</mark>, political chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Pa. Mrs. Abby Scott <mark>Baker</mark>, political chairman of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [866.42, 548.96, 1023.71, 1014.4], "bbox_id": "aba10fbbf7", "file": "AppomattoxNewspapers_1918-1922a_0333.pdf", "page": 1, "text": "Washington.With 10 votes short in the House, 6 votes short in the Sen ate, the National Womans Party, one week before the convening of the spe cial session of the Tennessee Legisla ture, is concentrating its full force in Tennessee. Four headquarters have already been opened in the State, with five organizers campaigning in the dis tricts of the members of the legisla ture. Two more members of the Womans Party left for Nashville, Mrs. Mabel Kenton Reber, of New York, and Miss Mary Winsor, of Hav- erford, Pa. Mrs. Abby Scott Baker, political chairman of the party, also left Wash ington for Ohio, where, as fourth member of the ratification committee appointed to consult with the Demo cratic leaders, she will be in constant touch with Governor Cox on the Ten nessee situation. The other members of the ratification committee are Mrs. James Rector, of Columbus, O., mem ber of the Womans party advisory council Miss Anita Pollttizer, legisla tive secretary, and Miss Sue White, of Nashville, Tenn., state chairman of the party. Three thousand dollars was con tributed by Philadelphia members of the Womans Party for work in the thirty-sixth state. Miss Fanny Coch ran gave 1,000, Miss Mary Burnham another 1,000, and small contribu tions, including 300 from Mrs. Kath erine Haliigan, of Philadelphia, made up the third. In addition to Miss Sue White, Ten nessee chairman of the..Womans Party, and the local members of her branch, the campaigners for the Womans Party who are now in the State are Miss Betty Gram, of Port land, Ore. Miss Anita Pollitzer, of Charleston, S. C. Miss Catherine Flanagan, of Hartford,..CL, and. Miss J Anne Calvert Neely, of Vicksburg, Miss."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Pa. Mrs. Abby Scott <mark>Baker</mark>, political chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Pa. Mrs. Abby Scott <mark>Baker</mark>, political chairman of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [940.76, 697.82, 1164.62, 1012.11], "bbox_id": "e5417b5d7a", "file": "AppomattoxNewspapers_1915-1918a_0454.pdf", "page": 1, "text": "Washington.While mobilization of the first major increment of the Na tional Army was proceeding through out the country, Secretary Baker and the chiefs of the War Department ap peared before the Senate Appropria tion Committee to present requests for an additional 287,416,000 with which to provide equipment for a total force of 2,300,000 men. Included among the Items is the ordnance equipment for the next -500,- 000 men of the National Army. All Comforts Provided. Dispatches from all parts of the country indicated that mobilization was being carried forward smoothly and amid scenes Qf popular enthusi asm. The National Army men were given a tremendous send-off as they trooped to their trains led by the local the Petrograd I board offifla!a who found them quali fied to join the ranks of the nations defenders. Every essential for the health and comfort of the men has been provided for. They will be fed and sheltered without difficulty, and their arms, uni forms and all the balance of their war equipment will be ready for them as rapidly as they are ready to use it There are busy days ahead at the cantonments. Not only must the men be examined by military doctors and"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "out the country, Secretary <mark>Baker</mark> and the chiefs of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "out the country, Secretary <mark>Baker</mark> and the chiefs of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.26, 616.65, 1784.49, 1349.24], "bbox_id": "8efecbc1e2", "file": "AppomattoxNewspapers_1918-1922a_0145.pdf", "page": 1, "text": "Washington.The Railroad Labor Board, named by President Wilson, will be immediately called upon to consider wage demands of all but a fraction of the 2 , 000,000 railroad work ere of the country. The demands now before the board from the recognised brotherhoods, four in number, and the various craft affiliated with the American Federation of Labor. The board is expected to meet on call of President Wilson. It has power to subpoena witnesses, and could investigate present troubles. The wage demands pending accumu lated during the last eight months of Government operation. With the roads reverted to private control workers and employers met to discuss In creases. They failed to agree and asked that the whole question be put before the Labor Board. Previously President Wilson counseled a waiting policy, arguing that wage Increases would only add to production coats and bring higher prices. He obtained a delay in threatened strikes for 90 days to give the Government an op portunity to lower living costs, which it failed to do. Insurgent elements at that time were insistent on immediate advances, particularly in the shop crafts. Sporadic strikes occurred against the wishes of conservative leaders. Main tenance of way employes, for their opposition, were suspended from the American Federation of Labor. Members Of New Beard. The Railroad Labor Board contains nine members, thme representing the public, three labor and three employ ers. The groups are LaborAlbert Phillips, vlce-preel- dent Brotherhood of Locomotive Fire-  men and Enginemen A. O. Wharton, of Missouri, Railway Employes De partment, American Federation of La bor, and now member of Board of Railroad Wages and Working Condi tions, United States Railroad Admin istration James J. Forrester, president Brotherhood of Railway and Steam ship Clerks, Freight Handlers, Express and Station Employes. Management  Horace Baker, of Ohio J. H. Elliot, of Texas William L. Park, of Illinois. Public GroupJudge R. M. Barton, of Tennessee G. Wallace W. Hanger, of the District of Columbia Henry Hunt, of Ohio, Judge Barton was for many years a Justice of the Tennessee Court of Ap peals. He is probably the oldest ap pointee of the nine and has served on the Tennessee bench for a quarter of a century. Mr. Hunt is a Cincinnati lawyer. He was Mayor of that city for two years. Later he was a member of the board of trustees of the Cincinnati Southern Railway. Mr. Hanger is a native of Virginia. He is a writer on economic and socio logical topics and was formerly chief statistician of the Department of La bor. Since 1913 he has been assistant commissioner of the United States Board of. Conciliation and Mediation."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Station Employes. Management  Horace <mark>Baker</mark>, of Ohio J. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Station Employes. Management  Horace <mark>Baker</mark>, of Ohio J. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [537.06, 432.08, 692.91, 1046.82], "bbox_id": "e75506b408", "file": "AppomattoxNewspapers_1915-1918a_0493.pdf", "page": 1, "text": "Washington.The British drive on Cambrai will be followed up relent- le-ssly by similar offensives along the Western front, in the opinion of offi cers familiar with what is in prospect in France. Authoritative announce ment already has been made abroad that this winter would see no halt in operations and with the return of American divisional commanders from observation tours in France it has be come certain that the, French and British armies will prosecute mid winter campaigns such as never be fore attempted. Secretary Baker said tha,t the re turning officers would proceed to their divisional camps and resume the per sonal direction of the training of their men. So far as known, there will be no general conference of the officers here, but it is quite likely that they will call on Mr. Baker and General Staff officials while enroute to their posts. From these officers it is expected that officials will get graphic reports of the preparations being made for the continuous winter offensive against the Germans. Already the Allied troops have forced their way forward against more serious ob stacles than they will encounter later when the cold has hardened the ground for the passage of troops and artillery- The mud of Flanders has been the greatest barrier to major operations during the last few weeks, but the Cambrai attack was forced home despite it. Meagre official reports of the prog ress of the drive on Cambrai indicate clearly that Col. Byngs forces are aiming at a great encircling move ment. With a wide wedge driven into the Cambrai front, the British com mander apparently is working his way behind the German lines on his left flank. If he succeeds in penetrating deeply in that direction many officers here believe he will force a retire ment by the Germans on a wide front. Meanwhile the British and French pressure further toward the Belgian coast is unceasing. A new offensive effort there is expected as a part of the whole plan on which the Allies are engaged in forcing the Germans back from a long section of the coast, where submarine bases are located. The Cambrai successes have .an Im portant bearing, in the opinion of offi cers here, on this general plan of ac complishing during the winter a de cisive result in the coastal region as the foundation upon which next years offensive campaign can be laid."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "be fore attempted. Secretary <mark>Baker</mark> said tha,t the re"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "be fore attempted. Secretary <mark>Baker</mark> said tha,t the re"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [759.86, 718.76, 916.29, 1221.2], "bbox_id": "60b472c2ba", "file": "AppomattoxNewspapers_1915-1918a_0365.pdf", "page": 1, "text": "Washington.The American cen sorship question was settled when President Wilson created by Executive order a Committee on Public Informa tion, to combine the two functions of censorship and publicity, and named George Creel, a magazine writer and former newspaper man, as Executive Chairman of the committee. The other members of the committee are the Secretaries of State, War, and the Navy, who are authorized to delegate assistants to aid in carrying out the active work of the committee. In a letter sent to the President rec ommending the Btep, and made public at the White House, Secretaries Lan sing, Baker and DaiUels say that Americas needs at present are confi dence, enthusiasm and service, and that these needs will not be met with out the fullest publicity on all the vital facts of national defense. Even though the co-operation of the press has been generous and patriotic, the letter says, there is a steadily developing need for some au thoritative agency to assure the pub lication of all the vital facts of nation al defense. Premature or ill-ad Vised announcements of policies, plans, and specific activities, whether innocent or otherwise, would constitute a source of danger. The decision to vest the functions of press censorship in a committee with a civilian at the head comes as the result of long deliberation over the problem by the Government au thorities and after careful considera tion of foreign experience. They hope, through combining the censor ship with the duties of a publicity committee, with the emphasis on the latter function, to avoid the blunders made by Great Britain in her first efforts to establish satisfactory cen sorship restrictions. Although the Committee on Public Information, just established, will as sume its duties immediately under the terms of the Executive cyder. Ad ministration officials are considering the draft of a simple bill to be recom mended to Congress with the object of giving the committee statutory au thority to carry out its rulings."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "House, Secretaries Lan sing, <mark>Baker</mark> and DaiUels say that"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "House, Secretaries Lan sing, <mark>Baker</mark> and DaiUels say that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [570.66, 827.6, 729.18, 1146.34], "bbox_id": "ad8af3da06", "file": "AppomattoxNewspapers_1918-1922a_0285.pdf", "page": 1, "text": "Washington.Sharp conflicts be- I tween Congress and the War Depart ment over the amount of money to be appropriated this year for the mili tary establishment developed at the initial meeting of the House sub-com- 1 mittee to draft the 1922 Army Appro priation bill. Representative Anthony, of Kansas, chairman of the subcommittee, predict ed that the army appropriation for the coming fiscal year would be cut ap proximately to 300,000,000. He ad vocated restriction of the size of the army to i75,000 enlisted men, abandon ment of half of the camps maintained by the War Department and Immediate sale of the armys surplus supplies. Secretary Baker and Major-General March, chief of staff, appearing before the committee, urged the appropria tion this year of approximately 700,. 000,000 for army expenses. The War Department was allowed 392,000,000 for the present year. Secretary Baker estimated that the War Department would incur a deficit of 60,000,000 during the present year. Of this amount, he said, 38,000,000 will be needed for the pay of enlisted men. Chairman Anthony, however, said members of the committee were con vinced the War Departments deficien cy would total at least 100,000,000."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "armys surplus supplies. Secretary <mark>Baker</mark> and Major-General March, chief"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "armys surplus supplies. Secretary <mark>Baker</mark> and Major-General March, chief"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1148.39, 1142.09, 1307.03, 1311.84], "bbox_id": "022d4d33dd", "file": "AppomattoxNewspapers_1915-1918a_0421.pdf", "page": 1, "text": "Washington.Secretary Baker con firmed that In pursuance of sugges tions growing out of the conferences of American Army officers with Gen erals Joffre and Bridges, tactical units of the National Army will be organized on a basis of about 16,000 men in each in place of 24,000. Generals Joffre and Bridges explain- e? that the smaller and more mobile divisions used In European armies had proved highly satisfactory. Co-opera tion of the American Army with those now fighting in Europe would be sim plified, they declared, if the divisions were reduced. Only minor changes In the lesser unite will b6 made, their personnel of rank remaining virtually the same."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Washington.Secretary <mark>Baker</mark> con firmed that In"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Washington.Secretary <mark>Baker</mark> con firmed that In"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [915.83, 437.64, 1075.53, 1143.33], "bbox_id": "dd33287ff6", "file": "AppomattoxNewspapers_1915-1918a_0323.pdf", "page": 1, "text": "Washington.All precautionary and preparatory steps the military arms ol the Government have been authorized to take are under way, and little re mains to be done n-ow unless actual war should follow the break with Ger many. On the surface the War and Navy Departments fell back to almost the quiet routine of normal times. A few no admittance signs and the etrict enforcement of new rules requiring every person who enters the building to have a pass or be escorted by a watchman were the only visible signs thlat the nation faces a grave interna tional crisis. Below the surface, navy officials were studying out the details of . steps they plan to take under authority of the national appropriation bill, upon which the House labored during the day. The measure is being made the vehicle of extending to the President almost unlimited powers. There will be no delay in the exer cise of some of these as soon as the measure has been passed and ap proved. The navy always must hoax the first shock of a foreign war, and the appropriation bill is expected to carry full authority and ample funds to meet any emergency. To Speed Work On Warship. Technical officials devoted much time to appraising the condition of Government t and private plants for speeding up construction of new naval vessels. Decision as to the types and numbers of submarines and submarine chasers to be ordered a soon as funds and authority are available will be made within a day or so. Plans for the use of the navy in the event of war also have been under discussion, although no official would discuss that subject Additional censorship precautions at radio plants were ordered, and Secre tary Daniels said he would renew his plea to Congress for the establishment of a Government monopoly over all radio plants without delay. Research Committee Meets. The National Research Committee, composed of scientists and army and navy officers, also met for its monthly session. It is understood there was some discussion of the advisability of creating a radio service to include army, navy and commercial plants as a definite governmental agency. The navy favors, however, government monopolization of radio communication under its control. Secretary Baker directed the quar termasters department to restock the armys reserve supply depots, virtually emptied by the National Guard mobili sation. Funds are immediately avail able for very extensive purchases. Ini the event that a war-time army is sum moned it will be necesary to increase the contemplated purchases to such an extent that the productive resources of the nation along some lines will be taxed severely until they have been co ordinated and placed on a war-time footing."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "under its control. Secretary <mark>Baker</mark> directed the quar termasters"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "under its control. Secretary <mark>Baker</mark> directed the quar termasters"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [974.66, 435.92, 1136.97, 1141.17], "bbox_id": "47dece0537", "file": "AppomattoxNewspapers_1915-1918a_0322.pdf", "page": 1, "text": "Washington.All precautionary and j preparatory steps the military arms ol j the Government have been authorized to take are under way, and little re mains to be done now unless actual war should follow the break with Ger many. On the surface the War and Navy Departments fell hack to almost the quiet routine of normal times. A few no admittance signs and the strict enforcement of new rules requiring every person who enters the building to have a pass or be escorted by a watchman were the only visible signs that the nation faces a grave interna tional crisis. Below the surface, navy officials were studying out the details of . steps they plan to take under authority of the national appropriation bill, upon which the House labored during the day. The measure is being made the vehicle of extending to the President almost unlimited powers. There will be no delay in the exer cise of some of these as soon as the measure has been passed and ap proved. The navy always must bear the first shock of a foreign war, and the appropriation bill is expected to carry full authority and ample funds to meet any emergency. To Speed Work On Warships. Technical officials devoted much time to appraising the condition of Government and private plants for speeding up construction of new naval vessels. Decision as to the types and numbers of submarines and submarine chasers to be ordered a soon as funds and authority are available will be made within a day or so. Plans for the use of the navy in the event of war also have been under discussion although no official would discuss that subject Additional censorship precautions at radio plants were ordered, and Secre tary Daniels said he would renew his plea to Congress for the establishment of a Government monopoly over all radio plants without delay. Research Committee Meets. The National Research Committee, composed of scientists and army and navy officers, also met for its monthly session. It is understood there was some discussion of the advisability of creating a radio service to include army, navy and commercial plants as a definite governmental agency. The navy favors, however, government monopolization of radio communication under its control. Secretary Baker directed the quar termasters department to restock the armys reserve supply depots, virtually emptied by the National Guard mobili sation. Funds are immediately avail able for very extensive purchases. In the event that a war-time army is sum moned it will be necesary to Increase the contemplated purchases to such an extent that the productive resources of the nation along some lines will be taxed severely until they have been co ordinated and placed on a war-time footing."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "under its control. Secretary <mark>Baker</mark> directed the quar termasters"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "under its control. Secretary <mark>Baker</mark> directed the quar termasters"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [143.3, 423.81, 313.69, 1110.8], "bbox_id": "6d8152120c", "file": "AppomattoxNewspapers_1912-1915a_0091.pdf", "page": 1, "text": "Washington.A host of suffragettes Stormed the House Committee on Presidential Elections and demanded the submission of an amendment to the Constitution allowing women to Vote for members of Congress. Four hundred of them came to plead their cause. They bombarded the oommitteemen for two hours in the norning, resumed their argument for three hours in the afternoon and, fail ing to finish their presentation of the ease, they appeared at night in an assault upon the present inequality of the American system of voting. Not since the 1,000 equal-suffrage advocates bore down upon the Sixty first Congress, with their hundreds of petitions, two years ago, have the lawmakers at the Capitol been the ob ject of so much suffrage Interest as Was the House Committee Friday. The pleaders asked specifically for the adoption of the bill offered by Representative French, of Idaho, giv ing the women, through an amend ment to the Constitution, the right to vflte for Congressmen. While they were at it, however, the speakers reviewed the whole canse and eloquently appealed to the com mitteemen to see the wrongs of the present suffrage restrictions. From time to time the venturesome Congressmen would indulge in a mild hit of levity. This was instantly frowned upon. The speakers before the committee refused to he led into a discussion of side issues or to be con fused by suggestions that bachelors should be disfranchised to equalize the situation.  ! Mrs. Clara B. Colby, of Portland, j Ore., chief spokesman for the women, pleaded for a constitutional amend ment prohibiting States from disfran chising citizens on account of sex. De claring that the Constitution says the Representatives shall be chosen hy the people of the several States, he asked, Are women people? She added that American women would continue their earnest and dignified efforts to gain political freedom as long as might be necessary to gain their purpose. Representatives Mondell, of Wyom ing Hayden, of Arizona Baker, of California Lafferty, of Oregon, and ethers told the committee of the suc cess of equal suffrage In their States. Representative Tribble, of Georgia, questioned the right of the Federal Government to establish franchise rights in the States and drew a vigor- uov reply from Mrs. Belva Lockwood, who declared that it was not a specu lative question, but an established fact that there was precedent for a Fed eral amendment to the Constitution granting the suffrage to women. Like most of the other women in the room, Mrs. Lockwood was wearing her hat. I will take off my hat to this committee, she said, when it reports out the bill giving the women I the right to vote."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "ing Hayden, of Arizona <mark>Baker</mark>, of California Lafferty, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "ing Hayden, of Arizona <mark>Baker</mark>, of California Lafferty, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [849.85, 714.33, 1004.29, 1337.02], "bbox_id": "c11e6095d0", "file": "AppomattoxNewspapers_1915-1918a_0438.pdf", "page": 1, "text": "Washington.A full statistioal re port on the operations of the draft law will be prepared by the Provost Mar shal Generals office as soon as the mobilization of the first increment of 687,000 men of the National Army has been completed some time early in Oc tober, , Pending the preparation of the re port and careful analysis of the con ditions it discloses, no steps toward calling a second increment to the col ors will be taken. General Crowder said that the call for the second increment never had been considered at any conference at which he was present and that he had no indication that it had been taken up in any way by President Wilson or Secretary Baker. Next Call In Spring. The first increment will fill all the training areas16 National Guard camps and 16 National Army canton mentsto capacity, and there will be a surplus of men beside those assigned to the regular army. The regulars are now 12,000 above full authorized war strength by voluntary enlistment and the National Guard is in a similar si Via tion. Training facilities already are taxed to make ready for the front men now available and It is regarded as very unlikely that organization of an addi tional 500,000 men of the National Army can be begun until the early spring of 1918. Neither quarters nor personnel to train the force will be available before that time. May Amend Regulations. Iniquities of an unavoidable nature will be shown in the statistical report. There probably will be some amended regulations based on actual experience with the first increment, and some amendments in the law may be thought desirable by Congress. It is possible that some provision will be made whereby all the sons of one family will not be taken. A new definition of the status of married men may be one of the things acted upon. President Wilsons recent letter to Senator Weeks is taken by many to indicate a feeling that a more liberal policy may be found desirable. At present, under regulations, a condition of actual dependency must be estab lished to obtain exemption. The con dition of marriage in itself is not con sidered. Another matter to he forked out is the status of aliens. Still another is the status of men who have passed beyond draft age since being drafted and that of those who have become of draft agd in the meantime."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "President Wilson or Secretary <mark>Baker</mark>. Next Call In Spring."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "President Wilson or Secretary <mark>Baker</mark>. Next Call In Spring."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1266.16, 422.42, 1389.15, 1055.67], "bbox_id": "d1ef704196", "file": "AppomattoxNewspapers_1915-1918a_0333.pdf", "page": 1, "text": "Washington. The Arm, Staff Universal Service Bill . mitted to the Senate Military Col tee by Secretary Baker i S J I nite expression by the admiml! either on the general aubWtT special proposal. The Secretary said it J thought that Congress could 11 intricate a problem consid,y the closing days of this seasta l suggested that wide publicity 3 the staff plan to the end than Congress and the War pZl can, in any subsequent consid given to the subject, have the b of an enlightened, thoughtful i opinion upon the needs and i the country. As yet, the letter of trim, continues, I am not prepared L officially for the War Department! the need of the country can rest be said to be for so great an esta ment nor can we yet, without fun study and deliberation, be coal that the means suggested are the! appropriate to the need which ltd be determined wise to foresee. Force Of 4,000,000 Men. I In round numbers the staff S would supply a trained force of 000 men, with one year of ints military instruction, it is estim by the War College that approd ly 500,000 boys in their ninets year would be available for t annually. They would, under theL he liable to call to the colors mbt years of age, passing after the I II months of their training to the 1 reserve for the next four yean I one month, then into the second serve and finally into the unorgi reserve, until they reached the j of 45. The purpose of the bill is to i stitute the first reserve as a Myj ganized and. equipped fighting I with a strength of 1,500,MO rei respond instantly to a call to s The second reserve, of equal site,! only partially equipped, would i some time to take the field. Eveslfl ly there would be 1,000,000 additl trained men ready to fill in gq the front. In addition to these forces I would be a regular army, comp of men choosing military life uj fession, of 24,400 officers and-1 enlisted men. Of these 97,01111 1 form the oversea forces and 29,jl frontier forces, the remainder e ing the permanent training i which could take care of the laid tion of from 49,386 to 654,2911 recruits annually. If the prope of available men for trainWi greater than the figure given tkl manent training force would hwj be proportionately increased."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Col tee by Secretary <mark>Baker</mark> i S J I"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Col tee by Secretary <mark>Baker</mark> i S J I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1108.35, 562.24, 1263.07, 1216.98], "bbox_id": "22901982af", "file": "AppomattoxNewspapers_1898-1902a_0612.pdf", "page": 1, "text": "Washington, D. C., Special. The first step toward accepting Mr. Andrew Carnegies offer of 10,000,000 to the United States Government as an endow ment fund for the promotion of higher education was token here, when articles were filed with the Recorder of Deeds of the District of Columbia for the Car negie Institution. The incorporators are John Hay, Secretory of State, Edward D. White, Justice of the United States Supreme Court. Daniel Coit Gilman, late President of the Johns Hopkins University. Charles D. Walcott, superintendent of the Geological Survey. John S. Billings, ex-Surgeon-General of the Navy. Carroll D. Wright, Commissioner of Labor. The articles fix the name and title of the institution as the Carnegie Institu tion and show that it is organized  for a perpetual term. Its objects are the promotion of study and research, the power to acquire, hold and convey real estate and other property, and to estab lish general and special funds to as sist investigations in science, literature or art to co-operate with governments, universities, colleges, technical schools, learned societies and individuals to ap point committees of experts to direct special lines of research, publish and distribute documents, conduct lectures and hold meetings, acquire and maintain a library, and in general to do and per form all things necessary to promote the objects of said institution. The affairs, funds and property of the corporation will be in general charge of a board of trustees, to consist during the first year of 27, and thereafter not to exceed 30 members, except by a three- quarter vote of the board. . The filing of the papers followed a meeting in the offee of Secretary Hay, which was attended by all of the incor porators and Mr. Baker. It is assumed that from the legal action thus taken, Mr. Carnegie has removed the cause of the objection raised to the securities in which the 10,000.000 endowment was to be made on December 10, it being said that United States Steel Corpora tion bonds were the collateral. It was said that such securities in the posses sion of the United States, the income of which was used for the- promotion of education, might seriously embarrass the Department of Justice in the event of legal action being taken against combi nations or trusts. So Mr. Carnegie was informed their acceptance was impossi ble.  A few days later, Mr. Carnegie ap peared at the White House and dined with the President, after which it was announced Mr. Carnegie had decided to remove all grounds for objection. About the same tinie a sale of Steel Corpora tion securities amounting to about n,- 000,000 was reported in New York, and announced Mr. Carnegie had decided to this, in conection with Mr. Carnegies proposed donor was-the seller. Whether the new offer is in cash or some u n d  iluted bonds was not stated."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "incor porators and Mr. <mark>Baker</mark>. It is assumed that"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "incor porators and Mr. <mark>Baker</mark>. It is assumed that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [204.71, 1331.77, 370.54, 1508.47], "bbox_id": "3d492e31f6", "file": "AppomattoxNewspapers_1922-1923a_0169.pdf", "page": 1, "text": "Washington, D. Ç. Special-. Presi dent Roosevelt set his foot on the propo sition originating at Baker City. Ore., for a popular subscriplion with which to pur chase a wedding present for Miss Alice Roosevelt. In this connection the follow ing statement was made at the White House   The Presidents attention having been  called to the dispatch from Baker City, Ore., to the effect that a subscription was about to be started for a wedding present for Miss Roosevelt, the President stated I that while he deeply appreciated this evi dence of good wilt, he hoped nothing of the kind would be undertaken. In fact, he wished particularly that the pro posed subscription should not be under taken."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "propo sition originating at <mark>Baker</mark> City. Ore., for a"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "propo sition originating at <mark>Baker</mark> City. Ore., for a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [584.9, 230.29, 736.02, 790.17], "bbox_id": "9e46ab8c3f", "file": "TimesVirginian_1976_0393.pdf", "page": 1, "text": "WASHINGTON. D. C. - Fifth D istrict Congressman Dan Daniel was endorsed for re-election today by Americans for Constitutional Action A- CA because of his consistent voting record for constitutional principles. The national, non-partisan organization, with headquar ters here, cited Daniels high-ranking percentage in the ACAs tabulation of voting records of Members of Congress who stand for conservative fiscal policies, sound govern ment and personal initiative 4 rather than bureaucratic inter ference in solving the countrys problems. In the ACA tabulation this year, Daniel was given a 96 per cent and his cumulative rating for his eight years in Congress  is 92 per cent on crucial House votes included in the organi zations INDEX of important national issues. The organization also recent ly honored the Congressman with its annual Distinguished Service Award, presented for outstanding achievement as a member of Congress. Miss J. Charlene Baker, Chairman of ACA, in announc ing the endorsement, said, Congressman Daniel is best judged by his performance during the eight years in which he has served in the House. His legislative record gives factual evidence of his valuable and unselfish service to our nation. If every Member of Congress voted as Mr. Daniel, there would be little or no Federal debt, inflation would not be a problem, óur national military strength would not be in question, and Americans would be paying lower taxes."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Congress. Miss J. Charlene <mark>Baker</mark>, Chairman of ACA, in"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Congress. Miss J. Charlene <mark>Baker</mark>, Chairman of ACA, in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1301.74, 445.64, 1408.93, 799.74], "bbox_id": "b290f14f37", "file": "AppomattoxNewspapers_1915-1918a_0403.pdf", "page": 1, "text": "Washington. 0l j Guardsmen and t h e i j j H he national army to h. 1 der the selective draft a their State Identity U u w .J ization when they   I ,  nouncement of the War rw l The Marylanders, or fort1!  he troops of any other s i j be swallowed up in the  numerical designation generally feared by th,  3 and State militia office,. 1 Plans for numbering the J In the entire army have  I out and approve bySeWe 2  Baker, General Bliss, ehieulS and Adjutant-General tfcCu J Plan provides that the sta tt! whether National Guard, 3 tional army troops, shall h Z l designation in parenthesis J will be easy to keep tab,  J soldier boys. I Under this plan, the m J Guardsmen will be given a u J the regular army to be f f l Parenthesis by its State fad namely Siity-sixth Infantafl Maryland or Thirty-fifth flM tillery Battery A, Marvl u J I state designation of the will be known the same way,3 Two Hundred and Fifth 3 Maryland or Sixty-fifthField lory Maryland. 1"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "and approve bySeWe 2  <mark>Baker</mark>, General Bliss, ehieulS and"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "and approve bySeWe 2  <mark>Baker</mark>, General Bliss, ehieulS and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1173.09, 1640.96, 1333.54, 1722.41], "bbox_id": "85b78db30f", "file": "AppomattoxNewspapers_1915-1918a_0461.pdf", "page": 1, "text": "Washington.  With the time ap proaching to give thought to bringing cheer to the American soldiers and j sailors abroad, Postmaster-General Burleson and Secretaries Baker and Daniels, in a joint statement warn the public that Christmas packages for the I fighting men in Europe must be maiic1. I not later than November 15."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Postmaster-General Burleson and Secretaries <mark>Baker</mark> and Daniels, in a"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Postmaster-General Burleson and Secretaries <mark>Baker</mark> and Daniels, in a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [958.8, 716.04, 1122.31, 1248.24], "bbox_id": "d01050e74d", "file": "AppomattoxNewspapers_1915-1918a_0448.pdf", "page": 1, "text": "Washington.  The Liberty Motor, the airplane engine upon which the United States is relying to establish definite air supremacy over the Ger mans over the battlefields of France, has passed its final test and is a com plete and gratifying success, Secretary Baker announced. In a fifteen-hundred-word announce ment, Secretary Baker told how the best brains and business of American motordom had contributed its secrets  and achievements to the government to produce the Liberty Motor, which is to carry the thousands of American I airplanes over Germany. Probably the war has produced no greater single achievement, the state ment says, and Yelates for the first time the story of tbe design and con struction of the new motor which lias added a thrilling chapter to American  engineering records. Secretary Baker says the motor is I now the main reliance of the United States in the rapid production in large numbers of high-power battle planes for service in the war. In power, speed and serviceability and minimum weight, he continues, the new engine invites comparison with the best that the European war has produced. The engine was brought about through the co-operation of more than a score of engineers, who pooled their skill and trade secrets in the war emergency. For obvious reasons specifications of the motor, details of its perform ance under test and arrangements made for its production in quantity are I withheld. In conclusion, however, Mr. Baker says Progress has already been made toward organizing the industry for the manufacture of the new machines and deliveries will begin in a com paratively short time. Back of that announcement stands the fact that American aviators in high-powered American-built machines will begin to appear in large numbers on the fighting lines early next year. Secretary Baker coupled with his announcement a formal request to the press of the country to refrain from publication of any information regard-  ing the Liberty Motor other than that included in his statement."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "and gratifying success, Secretary <mark>Baker</mark> announced. In a fifteen-hundred-word"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "and gratifying success, Secretary <mark>Baker</mark> announced. In a fifteen-hundred-word"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1188.43, 422.14, 1374.32, 1480.93], "bbox_id": "5131b9e841", "file": "AppomattoxNewspapers_1915-1918a_0475.pdf", "page": 1, "text": "Washington.  The five classifica tions into which men awaiting draft will be divided, under the new regula tions approved by President Wilson, have become public muchi before the time planned by the Provost Marshal Generals office and are here published. It was discovered that what was to have remained an official secret for a week or more was divulged Saturday night at a dinner In New York, which Secretary Baker and Provost Marshal General Crowder attended. The Pro vost Marshal General discussed thè new regulations without intending to make public the classifications, but some members of a New York local exemption board, thinking to elucidate the Generals speech, printed the classification on the back of the menu card. The classifications are as follows, and show every man registered, to which class he belongs and in what order the different classifications will be called to service CLASS I. 1. Single man without dependent rel atives. 2. Married man or widower with children who habitually fails to support his family. 3. Married man dependent on wife for support. 4. Married man or widower with children not usefully engaged, family supported by income Inde pendent of hls labor. 5. Men not included in any other de scription In this or other classes. 6. Unskilled laborer. CLASS II. 1. Married man or father of mother less children, usefully engaged, but family has sufficient Income apart from his dally labor to afford rea sonably adequate support during his absence. 2. Married manno childrenwife can support herself decently and without hardship. 3. Skilled farm laborer engaged in necessary industrial enterprise. 4. Skilled industrial laborer engaged in necessary agricultural enter prise. CLASS III. 1. Man with foster children depend ent on dally labor for support. 2. Man with aged, infirm or Invalid parents or grandparents depend ent on daily labor for support. Man with brothers or sisters in competent to support themselves, dependent on daily labor for sup port. 4. County or municipal officer. 6. Firemen or policemen. 6. Necessary artificers or workmen in arsenals, armories and navy yards. 7. Necessary custom house clerk. 9. Persons necessary in transmission of malls. 9. Necessary employes in service of United States. 10. Highly specialized administrative experts. 11. Technical or mechanical experts in Industrial enterprise. 12. Highly specialized agricultural ex pert In agricultural bureau of state or nation. 13. Assistant or assoolate manager of necessary Industrial enterprise. 14. Assistant or associate manager of necesary agricultural enterprise. CLASS IV. 1. Married man with wife and or children or widower with chil dren dependent on dally labor for support and no other reasonably adequate support available. 2. Mariners in sea service of mer chants or citizens in United States. 3. Heads of necessary industrial en terprises.  4. Heads of necessary agricultural enterprises.  CLASS V., 1. Officers of states or the United States. 2. Regularly or duly ordained min isters. 3. Students of divinity. 4. Persons in military- or naval serv ice. 5. Aliens. 6. Alien enemies. 7. Persons morally unfit. 8.  Persons physically, permanently or mentally unfit. 9. Licensed pilots."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "New York, which Secretary <mark>Baker</mark> and Provost Marshal General"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "New York, which Secretary <mark>Baker</mark> and Provost Marshal General"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1096.29, 416.24, 1262.03, 848.38], "bbox_id": "34c3587596", "file": "AppomattoxNewspapers_1915-1918a_0361.pdf", "page": 1, "text": "Washington.  Ten thousand more troops of the National Guard , were called into active service by Secretary Baker. It is understood that this increment of 10,000 is only the-first of the series, and that there will be additional calls until the whole National Guard of the Jnited States is again in the Federal service. It is believed by members of Con gress that the purpose of calling the National Guard into the Federal serv ice is to afford all young men who care to volunteer ample opportunity to do so before the President proceeds to conscript them under the terms of the  compulsory service act which President Wilson is determined shall become a taw. He has learned that there is in Congress so strong a sentiment for the old volunteer system in prefer ence to conscription that if a vote were taken at this time no conscrip tion bill could pass Congress unless so amended that conscription should become effective only after a call to volunteers had failed to bring a suf-  dent response. It is believed, there- i fore, that the administratloh intends to give the volunteer system a final test before the conscription bill is voted on.  Volunteers For the War. The War Department is about to issue instructions to recruiting officers to call for 500,000 volunteers- to fill up the Regular Army and the various regiments of the National Guard as fast as they are called into the Fed eral service. To make this call for recruits for the Regular Army and Na tional Guards practically a call for vol unteers, for the war with Germany, all men so enlisting will serve only for the period of the war and will be discharged as soon as the war Is over."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "active service by Secretary <mark>Baker</mark>. It is understood that"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "active service by Secretary <mark>Baker</mark>. It is understood that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [380.63, 679.85, 700.51, 1167.5], "bbox_id": "a15af92fac", "file": "AppomattoxNewspapers_1915-1918a_0130.pdf", "page": 1, "text": "Washington.  American troops were ordered across the Mexican bor der by President Wilson to take Fran cisco Villa and his bandits, dead or live. Under the direction, if not actually the leadership, of Major-General Funs Ion, who ended the Philippine ln- srurreclton by taking Aguinaido single- handed, American columns are mov ing into Mexico. They go to meet aboul 11,000 guerrilla troops in a mountainous region from which Car ranza troops have fled. At General Funs tons request, de tails of his orders were suppressed, ao that he may move secretly and swiftly. For military reasons, the War Department declined to make public the number of men to be sent  the expedition. Purely Punitive. Whet her this long deferred armed action, which is purely a punitive measure to clear Northern Mexico of menacing bandit bands over which General Carranza has no control, shall g ro w into a general armed interven tio n or occupation in Mexico depends la a large measure upon General Car r a n z a and the Mexican people. After a conference with President Wilson Secretary of War Baker issued the following statement There is no intention of entering Mexico in force. So soon as the forces of the de facto government can take control of the situation any forces of the United States then remaining in Mexico will, of. course, be withdrawn. The forces of the United States now on the border will be immediately re cruited, but only for the purpose of safeguarding the territory of the j the State Department it was explained United states from further raid. that it was for the citizens themselves Secretary Baker explained that by who took passage on armed ships not recruited, referring to the present entering American waters to deter- border forces, he meant that movement mine whether they were boarding ves- f troops along the border, or of regi-  sels armed defensively or offensively, menls from the interior to supple- ! and the nature of the Instructions incut the border control, were not. to I under which ship captains would act be construed as a mobilization for an in the presence of a submarine. An extensive movement into Mexico. He  offensively armed ship which enters"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Wilson Secretary of War <mark>Baker</mark> issued the following statement"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Wilson Secretary of War <mark>Baker</mark> issued the following statement"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.5, 1292.86, 2189.3, 1477.4], "bbox_id": "40a2bf33c3", "file": "AppomattoxNewspapers_1933-1936a_0019.pdf", "page": 1, "text": "was the week-end guest home folks. Mrs. Norah Glover is sick list. Miss Carrie Warrir Mr. Gibson were united riage by the Rev. R. T, at t h e brides home, afternoon at 230 P. I mediately following tl mony they left for thei home in Washi Mr. and Mrs spent the week Baker, of Abil Mrs. Tot Di Lynchbur"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Mrs spent the week <mark>Baker</mark>, of Abil Mrs. Tot"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Mrs spent the week <mark>Baker</mark>, of Abil Mrs. Tot"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [565.38, 1390.13, 720.97, 1577.42], "bbox_id": "69a8ba471f", "file": "AppomattoxNewspapers_1918-1922a_0285.pdf", "page": 1, "text": "was said by Representative Anthony to be favored by the committee. Secretary Baker was questioned par ticularly as to the present size of the army and in reply said it consisted of approximately 216,000 enlisted men and 14,000 officers. Members of the House Military Com mittee have charged the War Depart- ment with breaking faith with Con gress in recruiting more than the 180,- 000 men for which provision was made In the Army Appropriation bill. This year, said Representative An thony, we will appropriate for an army of not more than 175,000 men and in addition will put a mandatory pro vision in the appropriation bill that the War Department Is not to exceed that number."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "by the committee. Secretary <mark>Baker</mark> was questioned par ticularly"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "by the committee. Secretary <mark>Baker</mark> was questioned par ticularly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [848.39, 1296.96, 1006.24, 1431.22], "bbox_id": "9877a61cfd", "file": "AppomattoxNewspapers_1918-1922a_0583.pdf", "page": 1, "text": "War Secretary Complies With Con gress Request. Washington.Complete cessation of army recruiting was ordered by Secre tary Baker in accordance with the di- i rection of Congress, as embodied in a joint resolution passed over the veto of President Wilson. The War Secre  tary acted to stop recruiting through orders sent all recruiting office withir a few hours after Congress had com pleted adoption of the resolution whic directs cessation of all recruiting unti the army is reduced to 175,000 men."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "ordered by Secre tary <mark>Baker</mark> in accordance with the"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "ordered by Secre tary <mark>Baker</mark> in accordance with the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [752.11, 1272.31, 1059.45, 1367.21], "bbox_id": "93aa517efc", "file": "AppomattoxNewspapers_1918-1922a_0386.pdf", "page": 1, "text": "War Secretary Complies With Con- Chief Of Buffalo District And Nine As- gross Request. sistants. Suspended. Washington.Complete cessation of Buffalo, N. Y.Chief Prohibition En- army recruiting was ordered by Secre- forcement Agent Edwin Waters and j tary Baker in accordance with the di- nine of his assistants were suspended  rection of Congress, as embodied in a by State Prohibition Director Chapin joint resolution passed over the veto as the result pf charges made by Agent of President Wilson. The War Secre John T. Shannon that the local en- tary acted to stop recruiting through forcement office was corrupt and filled orders sent all recruiting offices withiD"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Waters and j tary <mark>Baker</mark> in accordance with the"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Waters and j tary <mark>Baker</mark> in accordance with the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [228.96, 1164.48, 391.23, 1533.93], "bbox_id": "a718130280", "file": "AppomattoxNewspapers_1902-1905a_0082.pdf", "page": 1, "text": "Wampum, Pa. Special. In a battle following an unsuccessful attempt to rob the First National Bank, of this place, one man was killed and another seriously Wounded. The dead man was one of the burglars, smd he has not yet been identified. The wounded man was Henry Willoughby, a baker, who surprised the burglars while at work. His injuries are serious, hut not fatal. Willoughby was passing the bank at an early hour on his way to work, when he was suddenly confronted by a man, who, at the point of a revolver, ordered him to throw up his hands and keep quiet. He did so, but in his right hand was a revolver, and a moment later both men fired at each other. At the report of the revolvers two other men rushed from the bank and took a hand in the shooting. The three-cornered revolver fight aroused some of the people in the vicin ity of the bank, and they were soon at the scene of the battle, but before thei  arrival the burglars fled. While the mer had broken into the banking rooms they had not completed the drilling of the safe, and their attempt at robbery was unsuccessful. The body of one of the burglars was discovered on a vacant lofin the upper end of town. As the bullet wound was near the heart, it is presumed that his compan ions had to drag or drive their dying companion from the bank to where he was found. While he was dressed in only an ordinary suit of clothes, he was not shabbily dressed, and on his body was found a gold watch and. 44 in cash. Willoughby was shot in both legs, and it is supposed he fired the shot that killed the burglar."}, "highlight": {"text": {"matched_tokens": ["baker"], "snippet": "was Henry Willoughby, a <mark>baker</mark>, who surprised the burglars"}}, "highlights": [{"field": "text", "matched_tokens": ["baker"], "snippet": "was Henry Willoughby, a <mark>baker</mark>, who surprised the burglars"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [714.01, 1557.35, 2315.34, 1675.31], "bbox_id": "0c4f901c51", "file": "AppomattoxNewspapers_1960-1962b_0265.pdf", "page": 1, "text": "WALTER CARWILE A WILLIAM ROSS 862 lbs. 28 to 60 5039 R. L. BAKER 1178 lbs. 36 to 52 4539 J. C. DUNNEVANT 4 HENRY HODGE 860 lbs. 36 to 54 4636 Production savings start with people. Today Virginias pleasant, hospitable,  20  of Southside Virginias manpower and , governed communities Write, wu 8096 of its woman power are ready to staff your complete confidence. Plant. Youre on the worlds main line for top J--WA UCTWC row grade coal. And this areas well-managed forest have hard and soft woods in abundance. Ask Clark P. Spellman. Managor-Aroa VEPC0 fpr site and economic data o n Southside Electric Building, Richmond 9, Virginia"}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "60 5039 R. L. <mark>BAKER</mark> 1178 lbs. 36 to"}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "60 5039 R. L. <mark>BAKER</mark> 1178 lbs. 36 to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [718.3, 1386.33, 991.37, 1447.22], "bbox_id": "90986df2e2", "file": "AppomattoxNewspapers_1892-1898a_0462.pdf", "page": 1, "text": "Walter Baker  Co.s Breakfast COCOA"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co.s Breakfast COCOA"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co.s Breakfast COCOA"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [556.1, 1346.72, 827.3, 1405.48], "bbox_id": "48e31e983a", "file": "AppomattoxNewspapers_1892-1898a_0458.pdf", "page": 1, "text": "Walter Baker  Co.s Breakfast COCOA"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co.s Breakfast COCOA"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co.s Breakfast COCOA"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [782.9, 1954.64, 927.44, 1976.43], "bbox_id": "3f48d46062", "file": "AppomattoxNewspapers_1898-1902a_0122.pdf", "page": 1, "text": "WALTER BAKER  CO. Ltd g Dorchester, Maas."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd g Dorchester, Maas."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd g Dorchester, Maas."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [611.06, 1225.98, 820.06, 1235.98], "bbox_id": "e340bc4d4b", "file": "AppomattoxNewspapers_1892-1898a_0395.pdf", "page": 1, "text": "Walter Baker  Co. Ltd., Dorchester, Mass."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd., Dorchester, Mass."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd., Dorchester, Mass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [860.4, 1159.5, 992.18, 1182.6], "bbox_id": "c5353933d8", "file": "AppomattoxNewspapers_1892-1898a_0516.pdf", "page": 1, "text": "WALTER BAKER  CO. Ltd.,  v Dorchester Mass."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd.,  v Dorchester Mass."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd.,  v Dorchester Mass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [254.64, 790.75, 394.68, 814.42], "bbox_id": "3e2abcc852", "file": "AppomattoxNewspapers_1898-1902a_0079.pdf", "page": 1, "text": "WALTER BAKER  CO. Ltd,  Dorchester,1 M ass."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd,  Dorchester,1 M ass."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd,  Dorchester,1 M ass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1175.45, 473.44, 1310.42, 483.94], "bbox_id": "66a90f7115", "file": "AppomattoxNewspapers_1892-1898a_0491.pdf", "page": 1, "text": "WALTER BAKER  CO. Ltd"}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd"}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [606.71, 1127.33, 824.01, 1143.33], "bbox_id": "7a25446402", "file": "AppomattoxNewspapers_1892-1898a_0395.pdf", "page": 1, "text": "Walter Baker  Co. Ltd.,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [602.65, 1561.27, 818.63, 1574.27], "bbox_id": "99364cf62d", "file": "AppomattoxNewspapers_1892-1898a_0391.pdf", "page": 1, "text": "Walter Baker  Co. Ltd.,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Ltd.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [243.59, 803.61, 380.14, 812.65], "bbox_id": "4c173a22b4", "file": "AppomattoxNewspapers_1898-1902a_0087.pdf", "page": 1, "text": "WALTER BAKER  CO. Ltd."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. Ltd."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [638.92, 1165.64, 826.64, 1194.19], "bbox_id": "165c01e50a", "file": "AppomattoxNewspapers_1892-1898a_0445.pdf", "page": 1, "text": "Walter Baker  Co. Limited, Dorchester Mass."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited, Dorchester Mass."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited, Dorchester Mass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [859.93, 1479.83, 1052.02, 1490.83], "bbox_id": "1cd790a9a3", "file": "AppomattoxNewspapers_1892-1898a_0466.pdf", "page": 1, "text": "Walter Baker  Co. Limited,  J"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited,  J"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited,  J"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [561.15, 1266.02, 802.94, 1274.52], "bbox_id": "f396d1a39b", "file": "AppomattoxNewspapers_1892-1898a_0340.pdf", "page": 1, "text": "WALTER BAKER  CO., Limited,  D orchester, floss."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO., Limited,  D orchester, floss."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO., Limited,  D orchester, floss."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [639.85, 1157.81, 790.87, 1169.81], "bbox_id": "b7b1f64c32", "file": "AppomattoxNewspapers_1892-1898a_0450.pdf", "page": 1, "text": "Walter Baker  Co. Limited"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [644.39, 1301.43, 794.86, 1314.43], "bbox_id": "38050bcb59", "file": "AppomattoxNewspapers_1892-1898a_0441.pdf", "page": 1, "text": "Walter Baker  Co. Limited,"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Walter <mark>Baker</mark>  Co. Limited,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [212.67, 1354.81, 353.25, 1363.31], "bbox_id": "48be334d66", "file": "AppomattoxNewspapers_1898-1902a_0095.pdf", "page": 1, "text": "WALTER BAKER  CO. L td , g"}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. L td , g"}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO. L td , g"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [584.88, 1405.6, 810.29, 1417.6], "bbox_id": "4b6beeb2f3", "file": "AppomattoxNewspapers_1892-1898a_0365.pdf", "page": 1, "text": "WALTER BAKER  CO . Ltd., Dorchester, Mass."}, "highlight": {"text": {"matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO . Ltd., Dorchester, Mass."}}, "highlights": [{"field": "text", "matched_tokens": ["BAKER"], "snippet": "WALTER <mark>BAKER</mark>  CO . Ltd., Dorchester, Mass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [354.51, 1129.35, 510.82, 1238.15], "bbox_id": "73582ac657", "file": "AppomattoxNewspapers_1892-1898a_0371.pdf", "page": 1, "text": "..Waiter Baker A Co., of Dorchester, Maaa., y-8- A., have given rears of aludr to the sk.il-  pveration of cocoa and chocolate, and Tare devised ffiaca nerr and systems peculiar o thetr a s tar da of treatment, wherigjy tbe Wsnty.palataaUttx aol highest nutrient char- fterMtra are re la ned. Their preparations re ari.Trwn the world over, end have received  e hgben indorsements from the medical ratunoner. tbe curse, and the Intelligent -ura-ekreper and catarer. There la hardly any od-product which may be so extensively used n he household in combination with other foods as cocoa and chocolate but here again w urge the importance of purity and nutrient  aide, and these important points, we feel ure. may be relied upon in Bakers Cocoa and -hocolate .Dietetic and Hygienic Gazette."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "Waiter <mark>Baker</mark> A Co., of Dorchester,"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "Waiter <mark>Baker</mark> A Co., of Dorchester,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [575.49, 1259.5, 742.74, 1312.09], "bbox_id": "e8e6de3fb4", "file": "AppomattoxNewspapers_1905-1912a_0440.pdf", "page": 1, "text": "Wabash, Ind.Advertising for a j  wife William Riley wasnt at home  when she arrived. He found her cook- i  ing dinner. Will you be mine? he  cried. Taste my pie, said Mabel Baker, now Mrs. Riley."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "my pie, said Mabel <mark>Baker</mark>, now Mrs. Riley."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "my pie, said Mabel <mark>Baker</mark>, now Mrs. Riley."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [428.37, 277.22, 587.82, 981.67], "bbox_id": "381f989718", "file": "AppomattoxNewspapers_1902-1905a_0168.pdf", "page": 1, "text": "W. P. Gamble, United States deputy marshal, who confessed complicity in a plot in San Francisco to substitute old Chinese for young Chinese who had been ordered deported committed sui cide. State Senator George A. Green, of Binghamton, N. Y., was placed under arrest on the charge of conspiriacy and bribery, growing out of the postal in vestigation. He was released on bail. The Mrs. C. M. Schwab Schoolbuild ing, at Wetherly, Pa., the birthplace of Mrs. Schwab, erected at a cost of 100,- 000, a gift from Mr. Schwab, was dedi cated. Will McCullum, who was confined in the Manchester Ky. jail on the charge of murdering Sid Baker, made his escape by cutting through the floor. The paymaster of the American Woolen Company, in Woonsocket, R. I., was held up by three Italians, who robbed him of 3000, and then escaped. Prof. Fred C. Clark, of the Ohio State University, committed suicide in Columbus, O. He made unfortunate investments in mining securities. A negro named Hellen, accused of criminally assaulting two negro girls, was hanged by a mob of negroes at Luxora, Kan. The American Institute of Bank Clerks, in session in Cleveland, decid ed to hold next years convention in St. Louis. Former Police Captain Charles R. Hill, of Minneapolis, was arraigned on the charge of accepting and soliciting bribes. A mob of strikers attacked the dye- works of William Kedward, in Philadel phia, and had an exciting conflict with the police. The United States Government has bought the Hotel de Oriente, in Ma nila, which will be used for an office building. Mrs. Elizabeth Cherry Waltz, the novelist and the literary editor of the Courier Journal, died in Louisville, Ky. President Palma, of Cuba, had an exciting experience in Santiago. While he was delivering an address a rifle in the hands of a guard was discharged, causing a panic, in which several per sons were injured. The Cameron and Luke Fidler col lieries. near. Shamokin, Pa., owned by the Mineral Railroad and Mining Com pany, employing 2500 men and boys, closed down indefinitely on account of the dull coal trade. The yacht Red Dragon, of Atlantic City, was wrecked, and it is believed four men and a woman and children perished. The body of Capt. J. Clark has been washed ashore. Ex-Congressman Edward Overton, aged 67, who was colonel of the Fifti eth Pennsylvania Volunteers during the Civil War, died at Tonawanda, Pa. Thomas P. Baker and Miss Marie Wells were married by telephone, the bride being at Glenwood, Pa., and the groom at Buffalo, N. Y. The survivors of Wilders Brigade commemorated the fortieth anniver sary of the Battle of Chickamauga on that battlefield. The Russian consul general at New York has declared that Seraphin, the self-styled metropolitan of America, is an impostor. Talbot J. Taylor  Co., the New York brokers, have arranged a settle ment with their creditors."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "charge of murdering Sid <mark>Baker</mark>, made his escape by"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "charge of murdering Sid <mark>Baker</mark>, made his escape by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [241.45, 593.7, 405.61, 1172.23], "bbox_id": "0dfa3efefb", "file": "AppomattoxNewspapers_1902-1905a_0128.pdf", "page": 1, "text": "W orking N ight A nd Day. The busiest and mightiest litfclt thing that ever was made is Dr. j Kings New Life Fills. These pills i change weakness into strength, list- leness into energy, brain-fag into I mental power. Jheyro wonderful  in building up be health. Only 25c per box. Sold by R. J. Carter,  Prospect, and J. R Atwood, West Appomattox. Ve nner. As your regular correspondent is absent, I will try and give you a few items. The farmers are very busy work ing crops. Some are laying by corn, and all have a good stand of tobacco. Continued showers keep vegeta tion in a state of growth and thrift, and no one can possibly find time or excuse to indulge in a fit of the blues, for there is always some thing to brighten our lots, and we realize there is nothing so rare as a day in Jnne. Mrs. James Caw thorn returned to her home near Evergreen last Satur day, after spending several weeks with her sister, Mrs. Robert Baker, of this place. Mr. and Mrs. Ernest Rosser were the guests of their uncle, Mr. Neal Carwile, of Black Hill, on Saturday and Sunday last. Mis Hattie Baker, of this place, is visiting friends and relatives near Evergreen. Little Audrey, the infant daugh ter of Mr. and Mrs. James Glenn, who has been very Bick, we are glad to say, is much better. Mr. and Mrs, Tommie Baker and children of Campbell county are visiting in the neighborhood this week. Mrs. W. L. Turnes and children, of this place, are the guests of her mother ueur Hollywood. Mr. James Baker, of Hampden- Sidney, was a guest at this place on Saturday and Sunday last. Mr. John Womack, of Throck, was a guest at the hospitable home of Mr. B. II. Woodsou last week. Mrs. B. T. Rosser visited her mother iu Charlotte not lonp since. Jnne 29, 1903."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "her sister, Mrs. Robert <mark>Baker</mark>, of this place. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "her sister, Mrs. Robert <mark>Baker</mark>, of this place. Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1014.96, 1511.33, 1184.94, 1740.47], "bbox_id": "dff63cd423", "file": "AppomattoxNewspapers_1912-1915a_0452.pdf", "page": 1, "text": "W. K. Vanderbilt has given 113,750 j to Columbia University.  The body of Lieutenant General Adna R. Chaffee left Los Angees, Cal., for Washington, where burial will take place in Arlington Cemetery. Gold bullion valued at 25,000,060. the largest single shipment ever made by the United States, arrived in New York from Denver.   The Department of Agriculture placed a quarantine on cattle in Illi nois, Michigan, Indiana, Pennsylvania and Ohio in order to check the spread of the hoof and mouth disease.  Criminal indictments were returned by the United States Grand Jury In New York against 21 directors and former directors of the New York, New Haven and Hartford Railroad Com pany, Including William Rockefeller, Theodore N. Vail, George F. Baker, William Skinner, Charles F. Brooker and John L. Billard."}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "N. Vail, George F. <mark>Baker</mark>, William Skinner, Charles F."}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "N. Vail, George F. <mark>Baker</mark>, William Skinner, Charles F."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1803.34, 1035.8, 1947.69, 1713.99], "bbox_id": "13c39d4aaa", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "W illie David OKeefe George W esley Powell Norm an Baker Elm ore Wilkereon W illiam W alker McCormack Sam uel Lee Loomis Van Buren Webb Claude W Smith L arkin Foster W illiam s Alex Robertson Jerry Allen Burke W illie H unter Bradley Whitney Baboook Corie Cabel Baldwin N athan Fleshm an Lewis Saunders McCormick W alter Allen Heflin Edw ard Tray ham Price George W esley Phelps Norm an W att Page Jam es Burton Goff Terry Colley Durham Samuel Joel H arvey Edw ard Irving Bingham H enry Alvin D rinkard W ade Hampton Ferguson H arry Leonard Cumby Joseph Edwin Dinwiddie Eddie C arter Thom as Homer Babcock H unter MarshallJMcCoy Winden Blackwell Bernard Dickerson Thom as Charles Clarence Thomas Ju lian Deleware Pugh F ran k Snyder H arry Mickle William A nthony Jones Russell Mack Charles Davis Aubrey McCoy Thom as David Grover Pugh Em m ett W arren Oakes W illiam John Johnson Joseph Preston Coleman H erbert H arris William Tunstall Morgan Charley W ashington Tanner William Fletcher G arrett H enry Harrison Williamson Edw ard W atson W illie Wesley M itchell Ciaude Davidson George Elliott Cheatham Allen Thornhill John Wiley Davis H arry Leonard Doss Jam es Clarence Horsley Ewell Ferguson Rexford Lion M artin Alfonso Godsey Hal. Thornhill Baber H ow ard Thomas Williams Thom as Talm age Phelps Jam es Tazewell Jones Samuel Boyd Johnson Colonel Oscar Patterson W ilm er I. Smith Willie Alvin T rent George H arrison White"}, "highlight": {"text": {"matched_tokens": ["Baker"], "snippet": "esley Powell Norm an <mark>Baker</mark> Elm ore Wilkereon W"}}, "highlights": [{"field": "text", "matched_tokens": ["Baker"], "snippet": "esley Powell Norm an <mark>Baker</mark> Elm ore Wilkereon W"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
