{"document": {"bbox": [1359.13, 1257.3, 1479.61, 1312.99], "bbox_id": "8d1372b9e2", "file": "AppomattoxNewspapers_1922-1923a_0279.pdf", "page": 1, "text": "xpected that the handsome of Mr. Bocock will be pre tbe county and bung on t room walls next court, h."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "xpected that the handsome of Mr. <mark>Bocock</mark> will be pre tbe county and bung on t room walls next court, h."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "xpected that the handsome of Mr. <mark>Bocock</mark> will be pre tbe county and bung on t room walls next court, h."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.82, 1593.78, 1506.23, 1648.92], "bbox_id": "62544493ea", "file": "AppomattoxNewspapers_1922-1923a_0434.pdf", "page": 1, "text": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. Thomas S. Bocock Wfts elected Regent."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. Thomas S. <mark>Bocock</mark> Wfts elected Regent."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. Thomas S. <mark>Bocock</mark> Wfts elected Regent."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1908.95, 425.2, 2031.29, 493.92], "bbox_id": "184e49dd7c", "file": "AppomattoxNewspapers_1962-1965a_0284.pdf", "page": 1, "text": "Wins Contract For Bocock- Ishell Stable"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Wins Contract For <mark>Bocock</mark>- Ishell Stable"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Wins Contract For <mark>Bocock</mark>- Ishell Stable"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1290.96, 694.33, 1416.61, 726.31], "bbox_id": "6495154bbf", "file": "AppomattoxNewspapers_1892-1898a_0165.pdf", "page": 1, "text": "Willis Bocock leaves to-day d the James River Associa-  will he absent two weeks."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Willis <mark>Bocock</mark> leaves to-day d the James River Associa-  will he absent two weeks."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Willis <mark>Bocock</mark> leaves to-day d the James River Associa-  will he absent two weeks."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [615.33, 1158.12, 776.73, 1302.38], "bbox_id": "3f538fac8c", "file": "AppomattoxNewspapers_1926-1933a_0017.pdf", "page": 1, "text": "Willis B. Moore Willis Bocock Moore, age 64 died at his home five miles east of Amherst, following an illness of several months. Mr. Moore was a native of Appomattox county, but for more than thirty years had made his home in Amherst. He is sur vived by his widow, who was Miss Lelia Bethel, and the fol lowing children Miss Myrtle"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Willis B. Moore Willis <mark>Bocock</mark> Moore, age 64 died"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Willis B. Moore Willis <mark>Bocock</mark> Moore, age 64 died"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [611.03, 1135.07, 771.95, 1280.86], "bbox_id": "e2fc5fad62", "file": "AppomattoxNewspapers_1908-1909a_0017.pdf", "page": 1, "text": "Willis B. Moore . Willis Bocock Moore, age 64 died at his home five miles east of Amherst, following an illness of several months. Mr. Mofre was a native of Appomattox county, but for more than thirty years had made his home in Amherst. He is sur vived by his widow, who was Miss Leila Bethel, and the fol lowing children Miss Myrtle"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Willis B. Moore . Willis <mark>Bocock</mark> Moore, age 64 died"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Willis B. Moore . Willis <mark>Bocock</mark> Moore, age 64 died"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2535.28, 470.6, 2694.61, 1222.39], "bbox_id": "7cf1812429", "file": "AppomattoxNewspapers_1962-1965a_0624.pdf", "page": 1, "text": "William C. Hubbard, chairman of the Appomattox Civil War Centennial Committee and Mrs. Carrie Gilbert, chairman of the Official Program subcommittee, have made public details of the official program for commemo ration of the 100th anniversary of the Surrender at Appomattox. The afternoons events begin at Appomattox Court House Na tional Historical Park at 140 p.m. with a band concert by the United States Marine Band from Quantico, Virginia. Master of ceremonies for the program to follow at 200 p.m. will be the Honorable John War ren Cooke, chairman, executive committee of the Virginia Civil War Commission. Virginia Military Institute will present colors. An official wel come will be delivered by Gov ernor Albertis S. Harrison, Jr., with the Honorable John War ren Cooke introducing dis tinguished guests. William M. McMillan, Assist ant Postmaster General, will present a Commemorative Stamp Album. Elbert Cox, Regional Direc tor, National Park Service, will introduce Bruce Catton, m a i n speaker for the occasion. A rib bon cutting for the reconstruct ed Court House will follow the 2 p.m. program with Major Gen eral Ulysses S. Grant, HI, and honored guests. Music of Blue and Gray The Appomattox Civic Cho rus is presenting Music of the Blue and Gray on Friday eve ning, April 9, at Appomattox High School. No tickets are be ing sold, but a silver offering will be taken at the door. UDC-American Legion On Saturday, April 10, at 8 p.m. the United Daughters of the Confederacy, American Legion and Legion Auxiliary, will pre sent, a memorial program at the AppqoKUtoElementary School. Em f. otwppomattog map went w a in this county to  SérvW  1 the Abbitt F l o o d , M athew sand Robertson com panies. Names of these men will be read, and thefe will be special solos and band music, according to current plans. Peace Service On Sunday, April 11, at 3 p.m. the Appomattox Ministerial As sociation and the Appomattox County Civil War Centennial Committee will present a Peace Service at Appomattox Court House National Historial Park. Speaker will be the Reverend Walker Bocock Healy, pastor of the First Presbyterian Church, Roanoke, and a great grand son of the first clerk of Appo mattox County. Official programs describing these events will be on sale."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "be the Reverend Walker <mark>Bocock</mark> Healy, pastor of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "be the Reverend Walker <mark>Bocock</mark> Healy, pastor of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [350.13, 205.01, 518.98, 1319.71], "bbox_id": "6bfeda0b33", "file": "AppomattoxNewspapers_1892-1898a_0423.pdf", "page": 1, "text": "which were never answered and! travelling five and seven miles urg ing the Appomattox ladies to join and help them. They were in formed with an indifferent smile, that they had other important du ties and home affairs claiming their time, and their quarters could be better spent elsewhere than on the dead. In one seuse this is true. We have home duties and try not to neglect them, aud the monev ould be possibly more wisely spent While we do this to honor our dead, we try also to impress npo. the minds of the children of the county, hat the Confederate cause was just .ml right and thatthir fathers were not rebellious traitors and to give them a desire to acquire knowledge of the events of their country, and to teach, them to be patriotic aud proud of their South-land and an cestors. The little knowledge, be ginning here may grow in the minds and hearts of each, and be of great benefit to all. The president of the U. D. C. thought last year of giviug up the charter of the Appo mattox Chapter U. D. C. on account of the ladies lack of interest in this county. She wrote the National l D. C. president, and the Virginia president U. D. C. to that effect, stating she would join a chapter in Lynchburg. Letters from the Va. division, S. C. division and Md. di vision came pouring in not to let Appomattox surrender the second time also sending a list of names of prominent ladies who would join among them, Miss Ruth Early, Mrs. James Garnett, Miss M. Amelia Smith, the piesideut of Va. division U. D. C. and the daughter of ex-Gov Wm. Smith of Va., known as Ex tra Billy. The letter expressed surprise at the Appomattox ladies not caring to join one of the largest organizations m the whole south and living in one of the most his torical counties in the world. It is quite a reflection upon the county. We revised the roll and now have ouly eighteen members lu t they say they intend to keep up the or ganization and to be proud they are U. O C. of Appomattox and we shall be more than pleased if Coal ing will forward us the names ot the ladies desiring to join the IT, D. C. or the Memorial Association or any one reading this would like to become a member of either society please forward their name to Mrs. T. A. Smith, president of the Mem orial Association or Mrs. C. W. Hunter, president of U. D. C. West Appomattox. One prominent aim of the U. D. C. is to gather histori cal facts to help the historians of the U. D. 0. historical committee in collecting war experiences, inci dents and reminiscences of the old soldiers, their wives, daughters or any one who can remember during the Civil war. The U. D. C. es pecially requests, Mrs. T. W. Johns to write up hers and Capt. Johns also Mrs. George Miles, Mrs. A. H. Bocock, Major Flood, Mr. Chap Chilton, Drs. Wm. White and Wm. H. Ahbitt, Mrs. Mary Ann Robert son, Mr. Kirk Hannah and any one who will help us, also send us news paper clippings or Magazines or Journals or anything bearing on the war between the states. This is to help in having a correct history of the south. Please dont think yours will not be of service or interest for it may show up the spirit of the times more than you think. A D a u g h t e r ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Miles, Mrs. A. H. <mark>Bocock</mark>, Major Flood, Mr. Chap"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Miles, Mrs. A. H. <mark>Bocock</mark>, Major Flood, Mr. Chap"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.33, 605.91, 1934.11, 743.57], "bbox_id": "821f205411", "file": "AppomattoxNewspapers_1943-1947a_0428.pdf", "page": 1, "text": "We are informed by Mr. N. R. Featherston that plans are being formulated to have a bust of the late Thomas S. Bocock placed in the state capital at Richmond. Mr. Bocock was a prominent leader of the Confederacy. Town Te Get New Light"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the late Thomas S. <mark>Bocock</mark> placed in the state"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the late Thomas S. <mark>Bocock</mark> placed in the state"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.05, 774.05, 1984.55, 1010.1], "bbox_id": "ac6259f3aa", "file": "AppomattoxNewspapers_1902-1905a_0187.pdf", "page": 1, "text": "We are glad to welcome back to our community Mr. and Mrs. John Eldridge, who made quite a lengthy stay in Kentucky at the home of their son, Rev. William Eldridge. Mias Minnie Ellis has returned from a pleasant visit to Lynchburg, Mrs. Tipping, of Louisiana, is a visitor at the home of her nephew Judge A. S. Hall. Mrs. Mary Davis is a guest at the same place. Mr. Wm. Perkins Ellis is a visitor at Afton, the home of his mother, Mrs. N. F. Ellis. Mrs. Octavia Bocock is again at home with her daughter, Mrs. 8. R, Bondurant. She made quite an ex tended visit to relatives and friends in Albemarle and Nelson. The farmers have been quite busy seeding their grain. Some of them are content with small crops, owing to the scarcity of labqr. Cards are Gut forth marriage of"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "F. Ellis. Mrs. Octavia <mark>Bocock</mark> is again at home"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "F. Ellis. Mrs. Octavia <mark>Bocock</mark> is again at home"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1683.09, 372.62, 1853.53, 812.71], "bbox_id": "7612c7ed14", "file": "AppomattoxNewspapers_1943-1947a_0011.pdf", "page": 1, "text": "W. P. end in the home of Mrs. Gills. Friends are sorry to hear of the illness of T. E. Owen, who is a pa tient at the Virginia Baptist Hos pital, Lynchburg. W. P. Bocock is a patient at the douthside Hospital, Farmville. Miss Myrtle ,mith is spending his week in Lynchburg. The Rev. and Mrs. W. M. Thomp on, of West Point, were luncheon uests Tuesday of Mr and Mrs. L. E. Smith. Mrs. E. C. Green, Jr, and child en are spending the month of Vugust in New-Jersey. Miss Marguerite Gilliam is im proving from a recent illness. L. E. Morris, of Norfolk is ex lected Sunday, to spend ten day tt hir home here. Mr. and Mrs. W. E. Hancock ant dell Howerton left today for Cin innati, Ohio to attend a conven ion of rural mail carries as dele fates from the state organization ,The Appomattox Garden Club ill sponsor a lawn party on ichool grounds Saturday evening, August 14. Otey Inge, of Lynchburg is vis ting his sister, Mrs. Eva Caw- .horn. Friends are glad to learn that J N. Caldwell is improving from  recent illness. Mr. and Mrs. Tommie Coving or ,f Lynchburg spent the week end j4ith relatives in the county."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "pital, Lynchburg. W. P. <mark>Bocock</mark> is a patient at"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "pital, Lynchburg. W. P. <mark>Bocock</mark> is a patient at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1044.27, 397.8, 1213.48, 666.04], "bbox_id": "8486762068", "file": "AppomattoxNewspapers_1947-1949a_0072.pdf", "page": 1, "text": "W. P. BOCOCK In the recent death of brother Willis P. Bocock, a faithful member of Liberty Chapel Baptist Church, we feel a great loss has been sus tained. Therefore be it resolved That we bow in humble submis sion to Gods will. That we, the congregation of Lib erty Chapel Baptist Church, realize our loss of a faithful member and a consecrated Christian-. That we extend to his sister and other members of his family our deepest sympathy and commend them to God for His blessings. That a copy of these resolutions be recorded in the minutes, a copy be sent to his sister and a copy sent to the Times-Virginian for publi cation. -Mrs. R. M. Coleman, Mrs. P. A. Garrette, Mrs. B. C. Childers, Committee. Approved by the Church July 20, 1947- W. W. Thornhill, Church Clerk."}, "highlight": {"text": {"matched_tokens": ["BOCOCK"], "snippet": "W. P. <mark>BOCOCK</mark> In the recent death"}}, "highlights": [{"field": "text", "matched_tokens": ["BOCOCK"], "snippet": "W. P. <mark>BOCOCK</mark> In the recent death"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [753.06, 871.27, 922.61, 1208.91], "bbox_id": "5d3ac88de1", "file": "AppomattoxNewspapers_1943-1947a_0606.pdf", "page": 1, "text": "vxRGINIA iii tne clerks Office of the Cir cuit Court of Appomattox County, on the 2Uh day of March, 1947. SalLe B. Roberts, Chas. P. Rey nolds, J udith R. Reynolds, Anne H. F. Finch, A. iyree Finch and Will is P. B ocock , Plaintiffs Against ui. i.-cmas Carey Johnson, Doro thy C. Johnson, Eleanor H. John son, Anne F. Johnson, Willis P. 1O cock , and the unknown and or unbein Heirs at law of Annie H. Bocock, deceased. Defendants. The ob.eet of this suit is to have partition of the tract of land con taining 212.75 acres in Appomattox County, Virginia, described in deed recorded in D. B. No. 12, page 489, in the Clerks Office of Appomattox County, by sale, and or sell the said tract of land and Reinvest the proceeds thereof under the super vision of the Court. And it appearing by affidavit fil ed that there may be unknown or unborn heirs at law of Annie H. Bocock, deceased, they are hereby required to appear within ten days after the due publication of this order arid do what is necessary to protect their in terests. Teste C. W. Smith, Clerk. George Abbitt, Jr., p. q. 3-27-4tc"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "law of Annie H. <mark>Bocock</mark>, deceased. Defendants. The ob.eet"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "law of Annie H. <mark>Bocock</mark>, deceased. Defendants. The ob.eet"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.54, 994.37, 2404.19, 1057.87], "bbox_id": "3f27a94c69", "file": "AppomattoxNewspapers_1936-1939a_0035.pdf", "page": 1, "text": "Virginia members of the United Daughters of the Confedaficy in convention in, Richmond last Thurs day approved an idea for a memorial to IThomas S. B.ocock, famous Ap pomattox citizen, who was a speaker of the Confederate Congress."}, "highlight": {"text": {"matched_tokens": ["B.ocock"], "snippet": "memorial to IThomas S. <mark>B.ocock</mark>, famous Ap pomattox citizen,"}}, "highlights": [{"field": "text", "matched_tokens": ["B.ocock"], "snippet": "memorial to IThomas S. <mark>B.ocock</mark>, famous Ap pomattox citizen,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1272.88, 848.65, 1405.34, 1186.2], "bbox_id": "f694910f8e", "file": "AppomattoxNewspapers_1947-1949a_0001.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of cuit Court of Appomattox  on the 20th day of Sallie B. Roberts, Chas. nolds, Judith R. Reynolds, F. Finch, A. Tyree Finch if P. Bocock, Against Dr. Thomas Carey Johnsoij thy C. Johnson, Eleanor son, Anne F. Johnson, Bocock, and the unknown  unborn Heirs at law of Bocock, deceased. Defl The object of this suit partition of the tract of 1 taining 212.75 acres in Aj j County Virginia, described recorded in D. B- No. 12, In the ClerkS Office of County, by sale,. and on. said tract pf land and fell proceeds thereof under thq vision ,pf the Court. And it appearing by ed that there may be unli unborn heirs at law of Bocock, deceased, they required to appear witWlf after the due publication. order and do what is ned protect their in threats. Teste C. W. Smitl George Abbiit, Jr., p. q. 3-27-4 tc"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Tyree Finch if P. <mark>Bocock</mark>, Against Dr. Thomas Carey"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Tyree Finch if P. <mark>Bocock</mark>, Against Dr. Thomas Carey"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2137.22, 771.83, 2402.93, 925.1], "bbox_id": "157006f838", "file": "AppomattoxNewspapers_1947-1949a_0113.pdf", "page": 1, "text": "VII Jr a.  rk of the I Coa t pf Appomattox County. Thom- as j Bocock solved as Congress- iSSfet- man in the U. S. House of Repre- sentatives prior to ille oiit break of the War Between the States. After r a f f i l i Sectissi on lie was elec ted ropresenta- ti ve to t le Confeder ite liouse of Represen -atives in 1ti oh nond and Spe aker if that body A tablet com- memorating Thomas S. Bococks Named serv ate ice as Hous Speaker of e of Rcpres the enti Confeder- itivos was reel ntly ledicated at the State Cap- i  ilol In Richmond. In 18 5, the Bo-"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "County. Thom- as j <mark>Bocock</mark> solved as Congress- iSSfet-"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "County. Thom- as j <mark>Bocock</mark> solved as Congress- iSSfet-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1504.26, 1241.08, 1662.31, 1261.43], "bbox_id": "e63bb70781", "file": "AppomattoxNewspapers_1905-1912a_0495.pdf", "page": 1, "text": "VI rs. Bocock Slade H onorary P resid en t."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "VI rs. <mark>Bocock</mark> Slade H onorary P resid en t."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "VI rs. <mark>Bocock</mark> Slade H onorary P resid en t."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2008.28, 561.37, 2228.91, 1317.76], "bbox_id": "1ac4d731f5", "file": "AppomattoxNewspapers_1952-1954a_0385.pdf", "page": 1, "text": "Valuable publicity for Appo mattox has been the result of featur ed material in the current issue of Transgas, the splendid monthly magazine of Transcontinental Gas Pipe Line Corporation, with principal offices in Houston, Texas. Ken B. Harper is editor of Transgas. He was in Appomattox recently and gathered pictures and material for the article which will advertise Appomattox over a vast area of Eastern Ameri ca served by Transcontinental. The magazine has high rating as an in dustrial publication. The front cover of the current is sue pictures Otis P. Dewberry, Supt. adjusting one of the big valves on the gas-cooler at Transcos Station 17 at Appomattox. The back cover of the magazine shows the residence of Mrs. F. C. Dresser inAppomattox. Subject of the featured material is,  88 Years Later, referring to the fact that Appomattox is thriving 88 years after the peace made in 1865. The inside front cover shows a full page picture of the McLean House. The historical story begins on Page 5, with a full page drawing of Lee and Grant shaking hands in re- concialation. There follows a well- written account of. the events of the April, 1865 peace-making. Page 8 comes up with a full page of Editor Calvin Robinson in his office at the Times-Virginian .plant, There follow many pages about the operations of Transcontinental in Appomattox and commentary on the thriving economy of the modern community 88 Years Later. Pictures include Engineer Lloyd Bryant at a spotless auxiliary unit a scene of Transco housing at Dewberry Hill  the Patteson - Hix Tavern Farmers National Bank and Bank of Appomax, Mauds Hot Shop, the Bocock - Isbell House Appomattox Garment Co., Inc. R. L. McIntyre runnning a chemical test at Station 17 the New Appomattox Court House A. G. Thompson and Hanley Phelps on a mechanical job at Station 17 5 a view of the Confed erate Cemetery Billy Pettet, radio technician at Station 17 Robert M. Honeycutt, foreman of Crew 3, PL. Dist. 7 and a two-page panoramic picture of Station 17 itself. The read ing material features interviews on modern Appomattox, with W. W. Burke, T. DeWitt Evans, R. B. Hud gins, Editor Robinson and others. Since the issue of Transgas has been received here, local comment has been that it is one of the best prepared and best written features yet to appear on Appomattox. Copies of the issue were given the National Dark Service officials, Major-General U. S. Grant, III, Rev. Richard Lee, and other distinguished guests here ii Tuesday for the premiere of Sunset at Appomattox."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mauds Hot Shop, the <mark>Bocock</mark> - Isbell House Appomattox Garment"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mauds Hot Shop, the <mark>Bocock</mark> - Isbell House Appomattox Garment"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2079.11, 1126.62, 2238.81, 1293.32], "bbox_id": "82f94dc09a", "file": "AppomattoxNewspapers_1912-1915a_0068.pdf", "page": 1, "text": "V irginia Leads Them All. Mrs. Thomas P. Bocock announ oes tb it in the matter of the Ar lington Monnment fund for tbe erection of a memorial to the Con federate dead, the U. D. O. of Vir ginia lead all in the Smonnt of mo ney subscribed. When Mrs. Booock reported 1,662 from Virginia she led all other State by more than 1  1 , 000 . This achievement ie a m atter of to the Virginia Daughters."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "All. Mrs. Thomas P. <mark>Bocock</mark> announ oes tb it"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "All. Mrs. Thomas P. <mark>Bocock</mark> announ oes tb it"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [595.44, 705.98, 762.45, 1040.97], "bbox_id": "5c59243ac6", "file": "AppomattoxNewspapers_1947-1949a_0006.pdf", "page": 1, "text": "v iKGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 20th day of March, 1947. Sallie B. Roberts, Chas. P. Rey nolds, Judith R. Reynolds, Anne H. F. Finch, A. iyree Finch and Will is P. B ocock , Plaintiffs Against Dr. Thomas Carey Johnson, Doro thy C. Johnson, Eleanor H. John son, Anne F. Johnson, Willis P. Bocock, and the unknown and or unborn Heirs at law of Annie H. Bocock, deceased. Defendants. The object of this suit is to have partition of the tract of land con taining 212.75 acres in Appomattox County, Virginia, described in deed recorded in D. B. No. 12, page 489, in the Clerks Office of Appomattox County, by sale, and or sell the said tract of land and Reinvest the proceeds thereof u. der the super vision of the Court. And it appearing by affidavit fil ed that there may be unknown or unborn heirs at law of Annie H. Bocock, deceased, they are hereby required to appear within ten days after the due publication of this order and do what is necessary to protect their in terests. Teste C. W. Smith, Clerk. George Abbitt, Jr., p. q. 3-27-4 tc"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "F. Johnson, Willis P. <mark>Bocock</mark>, and the unknown and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "F. Johnson, Willis P. <mark>Bocock</mark>, and the unknown and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1402.29, 1168.59, 1510.38, 1373.16], "bbox_id": "1058339b5a", "file": "AppomattoxNewspapers_1955-1957a_0219.pdf", "page": 1, "text": "United States Congressmen . within five miles of the McLean House at Old Ap- r  notber spot able to b claim? The four were r Bcck, the statesman of Lf crossroads next to old  Bocock was a member i j? nd came within one . mii  named Speaker just He was then named Confederate Con- FjT  second, was Henry i i o f i eminent political Aff f T n of the House Wor n ommittee at the H War L And- third, Hood served out an un- rm for the old Tenth . And- fourth, the l Representative, Watkins"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "crossroads next to old  <mark>Bocock</mark> was a member i"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "crossroads next to old  <mark>Bocock</mark> was a member i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [368.65, 559.71, 525.45, 593.96], "bbox_id": "3ccb6ac2fc", "file": "AppomattoxNewspapers_1908-1909a_0483.pdf", "page": 1, "text": "Uncle Nelson Bocock died near Rose Bower last night, one of our oldest colored citizens."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Uncle Nelson <mark>Bocock</mark> died near Rose Bower last night, one of our oldest colored citizens."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Uncle Nelson <mark>Bocock</mark> died near Rose Bower last night, one of our oldest colored citizens."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.99, 1606.85, 1887.64, 1733.69], "bbox_id": "e1dbdbf8e6", "file": "AppomattoxNewspapers_1936-1939a_0043.pdf", "page": 1, "text": "two intellectual giants, there was a tie, and for the unprecendented time of eight weeks they continued to tie on each ballot. Then for the good of the country, they each withdrew from the race and Mr. William Pennington, of New Jersey was elected. Mr. Bocock was the leader of his party in Congress as well as leader of Congress, therefore, he was chos en by Congress to deliver an eulogy on Washington at the unveiling of"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Jersey was elected. Mr. <mark>Bocock</mark> was the leader of"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Jersey was elected. Mr. <mark>Bocock</mark> was the leader of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1353.09, 661.97, 2163.59, 996.46], "bbox_id": "e8e393aea3", "file": "AppomattoxNewspapers_1922-1923a_0267.pdf", "page": 1, "text": "Turner SeiSet5flB S l o ,, around the asvi.iViw 16 S h nv.Lolfis  bisP ci. Fair lernor Swanson was the guest Cfcmetery needed pamdn He Jef w , ______________ l.andM rs. J . R. A tw ood last a contrihnH nn th o t  nr ftw tnSSS.?- ONTOON a took all the 1108 to n a 6 Commerce St. Wanted-Large and small boundaries of a co n trib u tio n fo r th a t p u rp o  . We , , uer. CMh p a ld .t once. Address this thank him for his thoughtfulness woth 2  o  m  aSd 8 thmlBfadshaw,and   VffgTnr offlce- town was painted red and and hope Others will by this acc nf 8 hErV.um for h best horsefhere? oSe ZTir ----------------- ----- -- ----------------- Wanted Soapstone Asbestos goii7 last week with the Confeder- of an interested visitor be provok- 2 taogwiti miieWinGbetterThan UNIVERSITY OF VIRGINIA prtle owningdeponltaof above, may And Hors. ed to good works. took first aSi sendT ri atlTeTynJ I HEAD OF STATE PUBLIC SCHOOL SYSTEM  Purchasers by writing A. H. CLEMENT, estimated that Appomattox M4 George A. Armes, of Wash- 1 Le -8. Science, Law, sined about 2000 people last inSton owner of the Appomattox I va. . Taylor, of lay, battlefield, was attending the un- L m. n- .... e - kt  ii veiling of the moaument here Sat- Eddie Dinwiddle, of Norfolk, lirii . a j . , . . . . . . . . , u rtiiy . M ajor A rm es donated to guest at the hom e of M r. and  r n  . . . f  n , .  . . . . th e N . O. V eterans sufficient ground I. R. Caldwell this week.   tor the election of monuments and Is Eddie Hardy, of Pinehusrt, they are now in place. Itis saidth. las been visiting in the county New York Monument Commission eral days. is now considering the proposition j Erwin Chick and Miss Ruby erecl handsome monuments on ard paid this office a pleasant be battlefield. at week. . Among those who came home to 1 Anna Jones, who has been  itnf 88 the nnveiling were Mrs. ng in Bluefield, has returned .  Bocock Richmond Mrs. Da vis, Waidsboro Mrs. Harvey, Lynch- S"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "in Bluefield, has returned .  <mark>Bocock</mark> Richmond Mrs. Da vis,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "in Bluefield, has returned .  <mark>Bocock</mark> Richmond Mrs. Da vis,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [166.79, 1430.3, 494.92, 1608.14], "bbox_id": "a191e45f6e", "file": "AppomattoxNewspapers_1908-1909a_0198.pdf", "page": 1, "text": "to the State to tax land and tan gible personal property.  Mr. Folkes not alone believes  that the segregation amendment im A ,r a  e n t.b u t g M   h d Thonms    ,w cary P rl, of her former mar- procimm to the world t h e  e tH g g ,   Mm. Sallie V aginli nojonger lovioo n of Ctaoe City, M i State tar on to d and U nable  of Wa3hinlton , pyaonal property aa probably  id t broth w ill!. Bocock, of 10 , H onovorconnty.alsoviyob. S tateh u ever had. Mr. Polka. itn A plaM Holly. said further wood cemetery .  Vlrgtal.d. not tmry a State dauh. .fa  on reel eeteto or taogiNe l  s Boeodt fonM tiy"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "t broth w ill!. <mark>Bocock</mark>, of 10 , H onovorconnty.alsoviyob."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "t broth w ill!. <mark>Bocock</mark>, of 10 , H onovorconnty.alsoviyob."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1349.04, 419.71, 1473.0, 749.2], "bbox_id": "c71c72431b", "file": "AppomattoxNewspapers_1926-1933a_0101.pdf", "page": 1, "text": "time at her country home here. voice of the politician is in our land- Oh Promise it r A. Hancock has been in several days looking after me and garden here. s Lucy Smith is improving being under a specialist in bur? for some time. S. J. Evans, and children, last week-end in Hope- isiting relatives Ruther Bocock died a ome Tuesday. She was one jr best colored women.  Bertie Mitchell is spend- vacation with his parents Mr. and Mrs. Holcomb ell. Vt everybody Wednesday . Mav4th. at 8 oclock, at s Theatre to see The of Life."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Hope- isiting relatives Ruther <mark>Bocock</mark> died a ome Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Hope- isiting relatives Ruther <mark>Bocock</mark> died a ome Tuesday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [306.24, 422.48, 454.32, 1760.36], "bbox_id": "e479f14c1d", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "those who know his amiable deportment will admit that none can better deserve them. By Cel. Samuel D. MeDear- men - Gen. Zachary Taylor and his little army As long as our frontier is guarded by such gallant officers and soldiers, as they have proved themselves to be, one may fear no harm, though the Mexicans brag and the British Lion growl. By W. W. Hamner - The memory of Gen. Jackson. By Thomas S. Bocock - John C. Calhoun His transcendent genius, firmness and patriotism have been placed in a clearer light, by his recent course upon the Oregon question - If he is not the next President of the United States, it will be more the Countrys loss than his own. By Thomas 8. Bocock - Genera Taylor, the Hero of the Rio Grande. For his distinguish ed services in the present Mexican Campaign, he de serves the lasting gratitude of his countrymen, and the Presidency of the Union is a civil office and to be bestowed only on those who by a long course of services, show themselves able and faithful. By Thomas I. M. Cheatham - E. James Good May he soar aloft as on the wings of an eagle, in the estimation of his fellow citizens to the highest pinade of fame and pluck therefrom some of those beautiful and never facing wreaths of honor and renown, that has ever adorned the brow of our great, good and intelligent worthies of this our own, our happy America - NousVrons By Lieut. Peter H. Phelps  Wm. C. Rives, the able statesman and accomplished gentleman When will Virginia yea,,, the United States, properly appreciate him? By P B. Pankey  Colonels Benajamin P. Walker and Samuel D. McDearmon As Military Officers equalled by few. As Patriots surpassed by none. By A. H. Cox - The bravery of our soldiers on the plains of Palo Alto and Resaca de la Palma on the eighth and ninth of May prove them the worthy sons of noble sires. By Capt. Richard Perkins an invited Guest - The toast was prefaced by the remark, that it was conceived on approaching the fine barbecue and dinner - - The Whigs and Democrats They united on the Oregon Question to the 49th degree - now let us on this now more important occasion go with 540-40s - the whole hog or none. By R. H. Cox  The Ladies of Appomattox Though not in the, habit of being addressed publicly, their intelligence, modesty and beauty warrant the opinion that they are often addressed privately. By R. J. Wright - America is an island, and should be one and indivisible. By James O. Davidson - May the spirit of liberty which actuated the signers of the Declaration of Independence, be cherished in us and be perpetuated in the hearts of the young generation. By Josiah A. LeGrand - Constitutional liberty May its course be ever onward, till the whole world shall enjoy the blessedness. By John W. West - The Lieut. Col. of the 174th regiment  May his distinguished military talents be duly appreciated by the companies under his command. By Join Sears - Mr. Thomas S. Bocock May he ever continue to shine, a bright star in the affection of his countrymen. By M. C. Porter - The citizens of Appomattox May they ever be united - not consider stage roads, or other highways, as constituting points for divis ions, either in a civil, military or political point of view. By Capt. Wyatt Abbitt - The Fourth of July 1776 The day on which our fathers pledged their lives, their fortunes and their sacred honor for their country. We, this day, feel aware how honorably they redeemed their pledge. By Col. Z. E. Cheatham - The"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Jackson. By Thomas S. <mark>Bocock</mark> - John C. Calhoun His"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Jackson. By Thomas S. <mark>Bocock</mark> - John C. Calhoun His"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [807.35, 470.33, 969.99, 1016.3], "bbox_id": "c5e933d925", "file": "AppomattoxNewspapers_1926-1933a_0206.pdf", "page": 1, "text": "Thomas J. Thornhill, 0 n Thursday, Jan. 8 , passed away  at the home of his sister, Mrs. 3. C. James, in Salem, Va. He was laid to rest in the family jurying ground on the old Thornhill estate near Tower  Hill, Va- He fs survived by the follow- ng brothers and sisters Rev- a. R- Thornhill, a Baptist min ister in Washington, D. C. C. W. Thornhill, o f Appomattox  Jounty, Mrs. D. A. Christian, jf Richmond, Va., and Mrs- E- J- James, of Salem, Va. He was an uncle of Dr. D. A. Christian jf Appomattox. Mr. Thornhill was born in ippomattox County, Va., Oc- ober 8 th, 1849, the son of Al- jert a n d Lucinda Thornhill. After graduating in law h e ormed a partnership with the ate Thomas S- Bocock, with offices at- Buckingham Court .louse- He w as Common wealth- Attorney for Appomat- ,ox County from 1880 to 1883, j resigning from that office to go .0 Kansas City, Mo., to pract ice law, until he returned to lis old home in this County in .ebruary 1929. He was for x number of years secretary of is masonic lodge in Kansas City. 1 Mr- Thornhill was reared in a home of culture and refine ment, and naturally inheriting -hose desireable attainments, e carried them out to the idl est through his life. He wi. genial and hospitable, making I a desirable land pleasan . companion for all who were .ortunate enough to- make his acquaintance. Mr. Thornhill was a member jf the Baptist church in Kan sas City Miouri. He was jtever married."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the ate Thomas S- <mark>Bocock</mark>, with offices at- Buckingham"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the ate Thomas S- <mark>Bocock</mark>, with offices at- Buckingham"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [331.43, 1418.41, 500.26, 1764.46], "bbox_id": "0d9f5848c4", "file": "AppomattoxNewspapers_1926-1933a_0198.pdf", "page": 1, "text": "This estimable lady died last I week in Richmond. She was the I wife of Dr. Johnson of the Pres- I byterian Seminary of that place. I Mrs. Johnson was 65 years old. I She is survived by her husband, I one son, Thomas Cary, tw o daughters, and one son, Thomas! Cary Price, of her former mar riage. Her sisters, Mrs. Salliel B. Roberts, of Chase City, Miss I j Belle Bocock, of Washington and a brother, Willis Bocock, of Hanover county, also survive her. Interment took place in Holly wood cemetery. Mrs. Johnson was the daugh- of Col. Thos. S. Bocock, formerly! of Appomattox county, and who was congressman from this dis trict for 14 years, and who was speaker of the house in the Con- j Congress in Richmond during the Civil War and afterwards practiced law in Appomattox county. She was also the grand daughter of Chas. J. Faulkner one time minister to France from the country."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Miss I j Belle <mark>Bocock</mark>, of Washington and a"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Miss I j Belle <mark>Bocock</mark>, of Washington and a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.18, 1445.4, 1628.84, 1747.74], "bbox_id": "35322d2241", "file": "AppomattoxNewspapers_1922-1923a_0413.pdf", "page": 1, "text": "There is right much sickness in our community at present. Mrs. Mildred Lewis, we are glad to say is improving at this writing. Mrs. Charlie Grow is quite ill. Mr. Thereas Robertson and fam ily are sick. Miss Nannie Smith has gone to Richmi.ua where she will study for trained nurse. We wish this young lady much success. On the 10th of February Mr. J. McFnUden lost by tire hi3 house apd nearly a l l its contents. Very few things were saved as the tire was burning rapidly when .discover ed. This is a great loss as it will be remembered he lost his house and all its contents by fire about sixteen years ago. The house was the properly of Mrs. A. H. Bocock, near Wildway. Mr. Charlie Grow is ail smiles over the arrival of a boy at his house."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Mrs. A. H. <mark>Bocock</mark>, near Wildway. Mr. Charlie"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Mrs. A. H. <mark>Bocock</mark>, near Wildway. Mr. Charlie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1816.79, 691.81, 1983.08, 920.16], "bbox_id": "803b26f0da", "file": "AppomattoxNewspapers_1902-1905a_0036.pdf", "page": 1, "text": "The Southern, and Adams Ex press Companies have assured the Richmond  Chapter Confederate Daughters that they will carry free of charge any articles or packages for the benefit of Bazaar, which will take place the 16tb ofj April, 1903. Each package must not ex ceed 25 pounds. Any and all artic les will be acceptable, as the Bazaar will rail 6 restaurant during the Weeks.! Tie Chapter will be very thankful to Appomattox for any as sistance. Articles should he dis tinctly directed and marked for theBazatfH hare of Mrs. Thos. S. .Bocock. Richmond, Va. They will be carefully handled and reported to the President aud Committee by Mrs. Bocock. !1 r  0 6R EGORS"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Mrs. Thos. S. .<mark>Bocock</mark>. Richmond, Va. They will"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Mrs. Thos. S. .<mark>Bocock</mark>. Richmond, Va. They will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.98, 1005.26, 1974.4, 1089.91], "bbox_id": "08e871afe9", "file": "AppomattoxNewspapers_1962-1965a_0609.pdf", "page": 1, "text": "The -Reverend Walker Bocock Education of , the First, PreJjy- Healy, D.D., pastor of the F irst fcerian Church in Houston, Tex., Presbyterian. Church in Roanoke, and as Pastor in Monticello, and great - greandson of Henry  Arkansas and Hot Springs, Va- Flood Bocock, first clerk of Ap- j and pastor of the First Presby- drtailTbutW what! Pomattox county and builder of terian Church in Fayetteville N. details about w h a t  house in which the Park su- C., before coming to the First perintendent now resides, will be i Church in Roanoke eight years the speaker at the Peace Serv-I The Appomattox County Min-"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "The -Reverend Walker <mark>Bocock</mark> Education of , the First,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "The -Reverend Walker <mark>Bocock</mark> Education of , the First,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.79, 1063.02, 2404.64, 1204.52], "bbox_id": "2256610876", "file": "AppomattoxNewspapers_1936-1939a_0035.pdf", "page": 1, "text": "The proposal for the memorial to Mr. BoCopk was advanced by Mist Anne V, ,Mann, of Petersburg. It provided that the Virginia Division of the United Daughters of the Con federacy make tMs as its next work after completion- of the Jefferson Davis. fund. Mr, Bocock is said to be the only speaker of tho. Confed erate Congress who does not. have a memorial .in the ol dHall of the House of-Delegates. The U . D . C convention elec- ed Mrs. B. C. Baldwin of Lynch burg as president."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Jefferson Davis. fund. Mr, <mark>Bocock</mark> is said to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Jefferson Davis. fund. Mr, <mark>Bocock</mark> is said to be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1579.45, 464.02, 1736.49, 567.11], "bbox_id": "46fbee1823", "file": "AppomattoxNewspapers_1902-1905a_0241.pdf", "page": 1, "text": "The presentation of the crosses of honor at Lee Camp in Richmond last week was a grand affair, and many Confederate Veterans were honored with crosses. Mrs. Annie H. Bocock served with other ladies of tbe Daughters of the Confederacy in pinning on the badges of honor for the old soldiers."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "crosses. Mrs. Annie H. <mark>Bocock</mark> served with other ladies"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "crosses. Mrs. Annie H. <mark>Bocock</mark> served with other ladies"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [416.16, 1484.9, 576.41, 2006.78], "bbox_id": "5e7ce1b7cb", "file": "AppomattoxNewspapers_1898-1902a_0617.pdf", "page": 1, "text": "The P o rtrait o f H on. T . S Bocock. The portrait of Hon. Thomas S, Bocock was presented to the Con federate Museum this morning by Judge Christian, on behalf of Mrs T. S. Bocock. amid an assembly of representaive Virginian Confederates Dr. Smith, chaplain of the Museum being master of ceremonies, in troduemg the speakers. Judge George L. Christian made an instructive and eloquent address, iu which he reviewed the seventy seven years of Speaker Bococks life, In his introduction he said in trying to honor the good and true we honor ourselves, and we are doing that this morning. He commenced from his birth in Buckingham county, and took his audience through the varied scenes of his life, his election to Con gress iu 1847 for seven consecutive terms, duriug which several branches of the Navy were reformed. At th conclusion, Mastor Thomas Bocock Price namesake and oldest grand child, unveiled the portrait. Hon. John Goode accepted the portrait on behalf of the ladies of the Confederate Museum, in au eloquent and patriotic speech, which was frequently interrupted by bursts of applause. In receiving this por trait, he said  Hallowed associations come u from the past, and I see in imagiua tion many familiar faces, which, if they could speak, would tell of this old White House, which is without a blot. Here lived Jefferson Davis bold as a lion heart Robert E . Lee, peerless captain among the sons of men Stonewall Jackson,that thun derbolt of war J . E. B. Stuart, the flower of cavaliers. We would not forget them if we could not if we would, for sufferings of right are grown deep ou the chronicles of nations. As a man he whose portrait"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "H on. T . S <mark>Bocock</mark>. The portrait of Hon."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "H on. T . S <mark>Bocock</mark>. The portrait of Hon."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.39, 1109.63, 1681.7, 1423.77], "bbox_id": "3194ed52dd", "file": "AppomattoxNewspapers_1943-1947a_0145.pdf", "page": 1, "text": "The January meeting of the Ap- pomattox Chapter U. D. C., wich Miss M. Anna Jones as hostess, was well attended. Mrs. L. Crawley ser ved her first time as ti-easurer, suc cessor to Mrs. L, J. Morris, resign ed.  There was a splendid business session and several visitors and honorary members were present. . Mrs. L. Crawley gave an interest- paper on Matthew Fontaine Siflpiry and Mr. N. R. Featherston, county historian, gave a full paper onGen. Stonewall Jackson and his political history of Col. Thos. S. Bocock, speaker of the Confederate House for four years, was read by the president, who is emphasizing the local history of the Confeder- asy. Mrs. S. M. Thornton will give in the future a sketch of the Mc- Dearmon family Mrs. Ola Patte- son will give the part the Torrences andtPattesons played in the mak- ingpf Appomattox County. The February meeting will be held the third Thursday, at 330 P. M. Mesdames C. F. James and L. Crawley will be hostesses. Leaders of the program Mrs. R. C. Moore, the Cabinet Mrs. J. A. Burke, Dip lomatic History of the Confederate States Alexander Stephens and the Hampton Roads Conference, 1865."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Col. Thos. S. <mark>Bocock</mark>, speaker of the Confederate"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Col. Thos. S. <mark>Bocock</mark>, speaker of the Confederate"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.16, 1585.86, 1603.69, 1731.21], "bbox_id": "44af0a5915", "file": "AppomattoxNewspapers_1902-1905a_0446.pdf", "page": 1, "text": "The interior of our lonely court house building is to be put .n nice order and the T imes will head a subscription list for portraits of Genl Robert E, Lee, Chief Justice Fuller and Col. T. 8, Bocock for the walls. Rev. J. O. Babcock, of Gordonj- ville, is at St. Lukes Hospital, Richmond, where he was operated ou for appendicitis. The operation was a success, aud his"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "and Col. T. 8, <mark>Bocock</mark> for the walls. Rev."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "and Col. T. 8, <mark>Bocock</mark> for the walls. Rev."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1883.44, 1173.15, 2057.09, 1734.19], "bbox_id": "821ef3073d", "file": "AppomattoxNewspapers_1936-1939a_0043.pdf", "page": 1, "text": "the Houdon Statue. The speech he delivered on that occasion was a masterpiece in every respect. By this time he had so favorably impressed upon the people of the United States his geniality, his high sense of duty to his people, his cour tesy at all times, his consideration of the rights of others, his firmness in his convictions as to a principle, his brilliantical gifts, his powers iii debate, showed in marked degree -that .fe possessed every lesBenjtial to make him the logical candidate for the high office of President of the United States, that they were ready to place the banner of their party in his hand, which office he was as capable of filling as any man who ever occupied the Presidential chair. That eventful, but fateful, period, the four years from 1861 to 1865, which cast such a gloom over our fair. Southland, blasted, not only the future political success of this brill iant son of the United States, but many others of that period who hap pened to have the honor of residing south of the Mason-Dixon line. While in Congress, Mr. Bocofck was made Chairman of the Com mittee on Naval Affairs, serving a- bout ten years in that capacity, and so reformed and advanced the po licy of the Navy as to bring favor able comment, not only from the United States but from other na tions. During the dark days from 1861 to 1865, when the best brain and talent was essential for the Confed erate Cabinet, Thomas S. Bocock was wisely chosen Speaker of the Con federate Congress, filling that posi tion with great distinction and un surpassed ability during the entire life of the Confederacy. As soon as the War closed a wealthy and leading Democratic poli tician f New York begged Mr. Bo cock to come to New York and prac tice law, guaranteeing him the sum of 20,000.00 per annum -until he could establish himself and return to Congress, but to this and other tempting offers he turned a deaf ear, choosing rather to suffer af fliction with his own people than to enjoy the riches of those who had impoverished them. Soon after the close of the War Between the States, on account of"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "erate Cabinet, Thomas S. <mark>Bocock</mark> was wisely chosen Speaker"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "erate Cabinet, Thomas S. <mark>Bocock</mark> was wisely chosen Speaker"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [187.91, 1450.38, 352.66, 1652.13], "bbox_id": "73c07ab858", "file": "AppomattoxNewspapers_1892-1898a_0348.pdf", "page": 1, "text": "The Hon. H. D. Flood left on Saturday nights train to fill an ap pointment in Augusta. Appomat tox feels proud of her son showing himself equal traditions. For years this county gave to the nation, in the person of the Hon. Thos. S. Bocock a member of the U. S. Congress. During this time Genl. Willis P. Bocock, was Attorney General while this senator ial district was represented by the Hon. Thos. H. Flood, also a son of Appomattox. Harry D. Flood is the equal of any man elected to office from this county and will prove himself, so for his election is assured."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the Hon. Thos. S. <mark>Bocock</mark> a member of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the Hon. Thos. S. <mark>Bocock</mark> a member of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1332.96, 802.74, 1472.37, 946.43], "bbox_id": "105f75f8cf", "file": "AppomattoxNewspapers_1922-1923a_0455.pdf", "page": 1, "text": "The Confederate headquarters ill be at Murphys Hotel, and the urean of Information will be on le bridge in Richmond during the iniou. Large comfortable rooms II be provided. Mrs. Stonewall ickson will be at the headquarters ieday during the reunion to see ir old Confederate friends. All 11 be welcomed. The headquart- f will be in charge of Mrs. Thos. Bocock and her committee."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "charge of Mrs. Thos. <mark>Bocock</mark> and her committee."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "charge of Mrs. Thos. <mark>Bocock</mark> and her committee."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1778.65, 969.17, 1945.8, 1799.26], "bbox_id": "1a935e3864", "file": "AppomattoxNewspapers_1892-1898a_0111.pdf", "page": 1, "text": "The blessed season of Xmastide brings with it a spirit of enjoyment that discovers, in spite of all ob stacles,some manner or some meansof expression and as we gaze npon the days that have just vanished we must regret that such pleasant and happy moments can flit away so swiftly. Itis too,a difficult matter to sum up aud, to describe a succession of pleasures, refined and chaste, that dwell in the mind only as a dream of some sweet bat intangible memory. Hotel Appomattox began the joy ful round by giving on Vm night an entertainment of unusual interest, consisting of games, refreshments and a beautiful display of fireworks, Theyoungpeopleof the villgendof the neighborhood instituted on that occasion a debating society which continued with unabating zea throughout the festive week. They appointed Thursday night for the meeting of the society and selected for discussion the question, Resolved, That it is better to have loved and lost than never to have loved at alL On Tuesday night, at the residence of Mr. J. P. 1 m Fleshman, the mer riment was renewed, and if snch a thing conld be possible, the enjoy- ment was even greater than on the preceding night. Mrs. N. H. Gregory, on Wednesday night, called together the yonng and old to participate in the delights of a candy stew, and her efforts to en tertain met with a foil appreciation from the assembled gnests for with one consent they all. decided that it was the sweetest saccharinely speak ing of times. When Tuesday night arrived, the brilliant gentlemen of the neighbor hood exercised their wits and talents in endeavoring to analyze tbe ques tion of to love or not to love. The debate took place at Hotel Appomat- took and was hotly aryj ably contested. The negative side was victorious and the happy and exultant victors were Messrs. Willis Bocock, S. L. Fergu son and E. Wiley Taylor. The au dience was so highly delighted that they insisted npon a repetition of the debate on the following night, and that leads ns into another charming event. . The- village collected eh masse and storming the home of Mr. C. W. Han cock, rendered Friday night a climax in the way of entertainments. The first thing on the program, w  the debate. The question was, Resolved, That woman should be hewers of wood and drawers of water, and, strange to say, the orators on the affirmative carried the day, notwith standing the fact that the jury con"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "victors were Messrs. Willis <mark>Bocock</mark>, S. L. Fergu son"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "victors were Messrs. Willis <mark>Bocock</mark>, S. L. Fergu son"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [360.51, 1675.01, 520.96, 1794.46], "bbox_id": "5ccd8bb1fc", "file": "AppomattoxNewspapers_1892-1898a_0341.pdf", "page": 1, "text": "That discussion was reported bv the present editor of the News, and he distinctly recalls the terrific re joinder of Mr. Bocock to this mon strous charge of Colonel Camerons, 19 IJUM  iondaJ September 19,1881, at Chatham, Pittsylvania Cameron debated with Mr. Ficklen, of Bnckingham county. The discussion was fully repoited for the News by Judge J. Singleton Diggs. We have referred"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "re joinder of Mr. <mark>Bocock</mark> to this mon strous"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "re joinder of Mr. <mark>Bocock</mark> to this mon strous"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1431.08, 353.5, 1597.02, 1750.43], "bbox_id": "08ce287cab", "file": "AppomattoxNewspapers_1908-1909a_0582.pdf", "page": 1, "text": "Taking a leaf from Appt mattox history. In 1877 Capt N. H. Hàficock ran agains Thomas S. Boccek for th house of delegates from thi county. The vote was as fol lows Court house, Bococ 185, Hancock 35 Walker Church, Bocock 108, Hancoc 65 Tower Hill, Bocock 101 Hancock 50 Bethany, Bococ 66, Hancock 74 Woodlawr Bocock 64, Hancock 89 Oak ville, Bocock 69. Hancock 29 Stonewall, Bocock 77, Hancock 51. In the 1876 presidential elec tion, Hayes g o t 809 votes ir the county and Samuel Tilden got 946. The total vote in thi county in the election was 1,- 755.    And now a word about old Uncle Spiller Trent. Spillei has been in the employ of th Times-Virginian since 1896. H was born a slave and was freed along with the rest by Lincoln He, was a sizable lad when Let surrendered here. Tuesday o this week, Spiller failed b show up for work. His left lej has given out on him the high before and since then he ha been-in bed. Maybe he won be at work anymore. W hope he will get back on th job. Somehow, there is noth ing finer to us in the Sout! than a- real old-time darkey.  have a measure of respect fo thîem. Spiller is one of thi finest types and no one livinj in this county has seen more o its history unfold than t h i i venerable old fellow. Thii paragraph is his. The onlj way I ever beat him to worl of a morning was to stay her all nightfor he got hère be fore the man went around tc blow out de lights.   V Dr. Douglas S. Freeman Richmond editor and orator likes Appomattox ham. Las fall he ivas in Lynchburg anc was served some ham whose flavor lasted. He was told il ame from Appomattox. Si last week he wrote to an Ap pomattox merchant to send him a- 20-pound Appomattox ham. Twas done.     And now as to Herr Adolph Hitler and the war crises ir Europe. One has to give ,onl impressionistic views, because censorship prevents any of ui from knowing what actually i going on. Father Darkleaf i enough of a journalist to know that. So our personal impres sions the anti-Jewish demon trations and persecutions wc read of, I guess to be exagger ated and fed us tô arouse Anti- Hitler sentiment. If the wai lords want you and I to fight Germany again, they will have their artists paint pla cards of Hitlerites butchering innocent cantors and Semetic babes. Further, what right has France to fuss about any body else arming? G man reparations hèlped pay for Frances present bristling arm ies. What would you do if you were German I . .all your neighbors armed a n d waiting an excuse to jump on you . . . and strippedof all means of de fending yourself legally . . , wouldnt you carry a razor in your, sock? I am nqt a Ger man sympathist or apologist, but when Hitler says, It is not wise to rob people of their eco nomic means of existence with out taking into account their right to live and Germany wants nothing she is not will ing to give to others, then I say, these are not bad words.   . THINGUMBOBS The Farm ers Bank has a loan of 20,000 from the R.F.C. The Associ ated Press tells us  J. El Din widdie out riding around the routes with local R.F.D. car riers there was virtually a tie for first honors in t h e Appo mattox graduating class This Madame Risca is really W. A. Baldwins wife saw a street car pushing a big passenger bus for a block in Lynchburg one day this week  theres something sentimental about closing day at school a fea ture at the county fair this year may be a public wedding, providing anybody feels t h a t way  ran off over 20,000 im pressions cm our presses this week heres hoping that some wise guy some day will invent a hose for .ladies that wont run, the present system being nothing short of a nar tional calamity. BBS"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Hancock 35 Walker Church, <mark>Bocock</mark> 108, Hancoc 65 Tower"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Hancock 35 Walker Church, <mark>Bocock</mark> 108, Hancoc 65 Tower"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1437.8, 374.84, 1601.36, 1773.46], "bbox_id": "e3c5d633df", "file": "AppomattoxNewspapers_1926-1933a_0582.pdf", "page": 1, "text": "Taking a leaf from Appi mattox history. In 1877 Capt N. H. Hancock ran agains Thomas S. Boccck for th house of delegates from thi. county. The vote was as fol lows Court house, Bococ 185, Hancock 35 Walker Church, Bocock 108, Hancoc 65 Tower Hill, Bocock 10i Hancock 50 Bethany, Bococ 66, Hancock 74 Woodlawr Bocock 64, Hancock 89 Oak ville, Bocock 69. Hancock 29 Stonewall, Bocock 77, Hancock 51. In the 1876 presidential elec tion, Hayes g o t 809 votes ir the county and Samuel Tilder got 946. The total vote in the county in the election was 1,- 755.    And now a word about old Uncle Spiller Trent. Spillei has been in the employ of the Times-Virginian siBce 1896. He was born a slave and was freed along with the rest by Lincoln He was a sizable lad when Let surrendered here. Tuesday oJ this week, Spiller failed t show up for work. His left lei has given out on him the nigh before and since then he ha been in bed. Maybe he won be at work anymore. W hope he will get back on thf job. Somehow, there is noth ing finer to us in the Soutl than a real old-time darkey.  have a measure of respect fo thiem. Spiller is one of the finest types and no one livinj in this county has seen more o its history unfold than t hi  venerable old fellow. This paragraph is his. The onlj way I ever beat him to worl of a morning was to stay here all nightfor he got here be fore the man went around tc blow out de lights.    Dr. Douglas S. Freeman Richmond editor an d orator likes Appomattox ham. Las fall he was in Lynchburg anc was served some ham whose flavor lasted. He was told il came from Appomattox. Sc last week he wrote to an Ap pomattox merchant to send him a 20-pound Appomattox ham. Twas done.  a a a And now as to Herr Adolph Hitler and the war crises ir. Europe. One has to give onl impressionistic views, because censorship prevents any of uf from knowing what actually h going on. Father Darkleaf i enough of a journalist to know that. So our personal impres sions the anti-Jewish demon trations and persecutions we read of, I guess to be exagger ated and fed us to arouse Anti- Hitler sentiment. If the wai lords want you and I to fight Germany again, they will have their artists paint pla cards of Hitlerites butchering innocent cantors and Semetic babes. Further, what right has France to fuss about any body else arming? Gftman reparations helped pay for Frances present bristling arm ies. What would you do if you were German . . .all your neighbors armed a n d waiting an excuse to jump on you . . . and stripped of all means of de fending yourself legally . . . wouldnt you carry a razor in your sock? I am not a Ger man sympathist or apologist, but when Hitler says, It is not wise to rob people of their eco nomic means of existence with out taking into account their right to live and Germany wants nothing she is not will ing to give to others, then I say, these are not bad words.     THINGUMBOBS The Farm ers Bank has a loan of 20,000 from the R.F.C. The Associ ated Press tells us J. E. Din widdie out riding around the routes with local R. F . D. car riers there was virtually a tie for first honors in t h e Appo mattox graduating class This Madame Risca is really W. A. Baldwins wife saw a street car pushing a big passenger bus for a block in Lynchburg one day this week theres something sentimental about closing day at school a fea ture at the county fair this year may be a public wedding, providing anybody feels t h a t way ran off over 20,000 im pressions on our presses this week heres hoping that some wise guy some day will invent a hose for .ladies that wont run, the present system being nothing short of a na tional calamity."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Hancock 35 Walker Church, <mark>Bocock</mark> 108, Hancoc 65 Tower"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Hancock 35 Walker Church, <mark>Bocock</mark> 108, Hancoc 65 Tower"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [366.51, 290.16, 527.38, 595.16], "bbox_id": "b57f4f4b8e", "file": "AppomattoxNewspapers_1908-1909a_0482.pdf", "page": 1, "text": "t Master Jack Scott, Fredericks burg, Va., nephew of Rev. W. H. Thompson has come to live at the Baptist Pastorium. His mother, Mrs Nancy Scott, sis ter of Mr. Thompson, continues very ill at the Mary Washington Hospital, Fredericksburg, Va. Misses Elaine McDearmon and Elva Stratton delightfully enter tained Wednesday evening at a bridge party at the home of Mr?. C. F. James- Red, white and blue was the color scheme in decorations and other George Washington ideas were most at tractively carried out. Eight tables were playing. Miss Kate Franklin won high score and Miss Bessie Zimmerman won low score prizes. Delightful refreshments were served by the hostesses. Uncle Nelson Bocock died near Rose Bower last night, one of our oldest colored citizens."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the hostesses. Uncle Nelson <mark>Bocock</mark> died near Rose Bower"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the hostesses. Uncle Nelson <mark>Bocock</mark> died near Rose Bower"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [343.9, 1000.51, 506.0, 1309.41], "bbox_id": "ba4c4c7295", "file": "AppomattoxNewspapers_1898-1902a_0432.pdf", "page": 1, "text": "T he tram p of many a busy foot T hat sought th y aisles is oer, Aud m any a weary heart around is still forever more. O! could we call the many back W bove gathered here in vain, vvhove careless roved where we do now, W ho never m eet again How would ou r very souls be stirred To m eet the earnest gaze Of th e lovely and the beautiful. The lights of o th er  v s .  In the grove around old Red Oak the celebiated Washington Artillerv of Northern Virginia parked and abandoned t eir guus, the men, to avoid surrender, going across the river into Amherst. A few miles northwest of Red Oak on the river bills stands Laurel Hill, once the hospitable home of Colonel B. P. Walker, tbe father of Mrs. Sue Bocock, of Bed ford of Misb Maria, Dan T. and Date Walker, of Lynchburg. This piace long u sort of headquarters for the old whigs, with Colonel Walker as chief, has been long noted us a fertil farm, famous for its fine horses. I can recall my uncle mount ed on Florizel or Simon a sor rel and a dun famous for tbe saddle as he would wend along the roads  f the farm, ta,king to himself and gesticulating vehemently over the"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "father of Mrs. Sue <mark>Bocock</mark>, of Bed ford of"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "father of Mrs. Sue <mark>Bocock</mark>, of Bed ford of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [612.6, 1615.6, 770.47, 1856.93], "bbox_id": "03edb73278", "file": "AppomattoxNewspapers_1898-1902a_0068.pdf", "page": 1, "text": "T h e T im e s Rev. P. M. Bell is conducting a protracted meeting at Trinity church. The meeting went on last week and will continue through this week. Rev. L. C. Shearer, of Lynchburg, is expected this week to assist. There have been several professions of religion and right much interest manifested. A number of the Stonewall Dem ocrats Attended Appomattox county court and heard the discussion be tween Judge Quarles and Mr. Yost. The Democrats of Stonewall are Democrats, and it is safe to say they will support the Democratic nomi nee. Miss Sarah Bocock, of Lynchburg, visiting Mrs. W. E. Moore, of taught in"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "nomi nee. Miss Sarah <mark>Bocock</mark>, of Lynchburg, visiting Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "nomi nee. Miss Sarah <mark>Bocock</mark>, of Lynchburg, visiting Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [527.3, 941.2, 686.45, 1029.08], "bbox_id": "080a1f6548", "file": "AppomattoxNewspapers_1892-1898a_0197.pdf", "page": 1, "text": "T  erk .s Office of the C ircuit C ourt of the county of Buckingham, on the 16th day of Novem ber 1894. Wm. A. Moss. J r in bis docdl Ahti i ni i w ! 8?.m  f pit,ie A. Mosele aoc d., A. . Moss, M. S. M atthews, J. R. Mos adm r. of Wm. A. Moss deed., Daisy A MdSi 1 rank it. Moss and C. F. Moss, the last throe named being infants who sue by A. G. Moss th eir b rother and n ex t frien d ............ plaintiffs AGAINST. Wm. A. Cabell adm r. of N. F. Bocook dnnvi Octavia R. Bocock, Henry iiobs and RosS his F r in k J W it?  h  Bv ? 0Ck- S allic P  hock lb rank  . B ocock ,  ictoria E. Curley in her"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Bocook dnnvi Octavia R. <mark>Bocock</mark>, Henry iiobs and RosS"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Bocook dnnvi Octavia R. <mark>Bocock</mark>, Henry iiobs and RosS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.25, 386.22, 1913.12, 526.52], "bbox_id": "4139aa3321", "file": "AppomattoxNewspapers_1902-1905a_0295.pdf", "page": 1, "text": "Spencer  Co. Mr. S. K. Bondurant is at home lor a brief stay from his work in West Virginia. Mrs. Octavia Bocock has eturiu-d io the home of her daughter, Mrs. S. It. Bondurant, after a pleasant visit to friends and relatives in Al bemarle. , It is whispered that Wedding bells will ring in the June roses.- X ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "West Virginia. Mrs. Octavia <mark>Bocock</mark> has eturiu-d io the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "West Virginia. Mrs. Octavia <mark>Bocock</mark> has eturiu-d io the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1635.59, 662.06, 1797.94, 1306.05], "bbox_id": "898490984d", "file": "AppomattoxNewspapers_1892-1898a_0300.pdf", "page": 1, "text": "Spanish Oaks Item s. Spanish Oaks, Va., May, 4th, 1896. We have had fine rains and feel much encouraged at the improved condition of the crops in general is to be earnestly hoped that a eat part of the army of chinch- bugs shared the fate of Pharaohs army. Many of the neighbors are busy day receiving shipments of guano Concord Depot. Tobacco plants are pushing the farmers in their preparations for filling. We greatly appreciate the kind ness done us by Mr. Jos. Button, when in Washington, in securing desirable changes in onr mail route, which enables us to get our mails a day earlier. Mr. T. M. Lewis has qualified as Post Master to succeed Miss Alice Stratton who recently re signed, and be will soon assume charge of the office. At a recent meeting of the Stone wall Improvement Society one of the speakers, in describing a man who could resist feminine charms, com pared him to a bristled swine walk ing on his hind legs and was loudly applauded by the young ladies pres ent, and their escorts also. That speaker might be said to be strictly iu it. Mrs. S. M. Bocock who has been 4B paying a short visit to this neigh borhood, will leave go day for her nome at Hampden Sidney. She is  ust returning from Arkansas where she has been spending some months with her daughter, Rev. Mrs. Wil lis. Mr. E. L. Thornhill returned to Lynchburg last week from paying a visit of several days to his home near heie. We are sorry to note the extreme illness of Mrs, John Scruggs. Her recovery is almost despaired of by Dr. Rice. She has been sick for some months. C o a l in g ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "it. Mrs. S. M. <mark>Bocock</mark> who has been 4B"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "it. Mrs. S. M. <mark>Bocock</mark> who has been 4B"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.35, 911.38, 1895.51, 1353.19], "bbox_id": "5cedaac6d6", "file": "AppomattoxNewspapers_1947-1949a_0054.pdf", "page": 1, "text": "son, of the University of Virginia1 effective pastor of the New nope three granddaughters, Mrs. Tyree1 group of Baptist Churches, recent- Finch, of Chase City and Misses ly tendered his resignation, effec- Eleanor and Anne Faulkner John- live August 1. We understand that son, of Richmond four great-grand- be has accepted a field of churches daughters, Misses Jane and Susan including Reedy Springs, TJnion Johnson, Sally Bocock Finch and Hill, and Ebenezer, southwest of Anne Yates Reynolds. Also present here. At present he is understood was Mr. Bococks nephew, Dr. Will- to be making plans to live just out- is Bocock, of the University of side of Appomattox on the Red Georgia, with Mrs. Bocock and their! House Road, granddaughter, Miss Bessie Bocock,. and Mrs. Henry D. Flood and Boll-   ing Flood, of Washington. I J  O X Mrs. Lewis Littlepage, of Norfolk president of the Virginia Division,1 O 1 1 C ! ___ _ U. D. C., presented the tablet,which D e l l I O U U  C!5 was accepted by Col. E. Griffith ______ Dodson in the absence of the Gov- DROp TW0 ernor. Colonel Dodson reviewed the course of the legislation by which After holding first place in the its erection had been anthorized, Virginia Central League for the and mentioned that the resolution first half of the season, the Appo- had been introduced by Senator mattox Red Sox dropped  to second Charles Mdses, of Appomattox. j piace by losing both games over Mrs. Cabell Flournoy, of Lexing- the week-end. ton, spoke eloquently of Mr Bo- Jn Saturdays game, Hurt edged Spring cocks service to Virginia and to, Appomattox 910 8 in a very close cake, , the nation. She sa a that after the me Hurt coliected 16 hits toA p-and Ui war he received a fla.terng offer pomattoxs 10. Bass arid Guillwere Mr. H to make his home in New York, but on the mound for the Red Sox. the daj like General Lee, he preferred to ancj w share the sufferings and privations Red Sox 350 000 000 8 p0jj0Wj of his felloe Virginian i.  Hurt 201 010 131 9 nolds In conclusion, Miss Mann fead At Miller Park in Lynchburg ville, Mr. Bococks speech accepting the Sunday, Fairview Heights battled Earl  1 position of Speaker of the Confed- the Sox in a ten-mmng game to green 1 erate House of Representatives and win 8 to 7, And to take over the Evergi presented a copy to Mrs. Roberts lead m the Central League. This burg, onbehalf of the committee. was the fourth game between the Reyno. i  two teams, and each team has now noias, Immediately after the ceremonies defeated the other twice. Earl 1 Mrs. Roberts entertained a number"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Springs, TJnion Johnson, Sally <mark>Bocock</mark> Finch and Hill, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Springs, TJnion Johnson, Sally <mark>Bocock</mark> Finch and Hill, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2432.35, 984.31, 2726.03, 1647.45], "bbox_id": "14dfcaa91f", "file": "AppomattoxNewspapers_1962-1965a_0618.pdf", "page": 1, "text": "Snoddy Elected To Party Posts Junior Woman C U and the Home Demonstration CI a b s. are handling the possibilities of guest housing in and around the. Town. of. Appomattox. Due to the limited facilities for overnight, accommoda tions in the town, this has become necessary, and the committee, headed by Mrs. Joyce W. Morris, P e g g y Berger and Mrs. Peggy Layt - , son, is asking that those per sons who have a room or rooms which might be op ened to visitors to please let them know. Also, as a further showing of appreciation to t h e s e visitors for coming to Appomattox, they are asking that these rooms be made available without cost. Plans are being made to place centennial housing guest cards in an information center which will be located at a cen tral point on the western e d g e of Appomattc-x, and which will be manned by a member of one of the clubs in Centennial dress to offer guest cards and give out information. Friday night activity will be a program Music of the Blue and Gray, by the Appomattox Civic Chorus under the direction of the Rev. Thomas A. Waddill, with special guest acts and guest art ists. This will be presented at the high school auditorium at 8 p.m. On Saturday night, t h e United Daughters of th e Confederacy will put on the program at the Elementary School at 8 p.m. honoring  the Confederate veterans of Appomattox County, assist- ed by the American Legion and American Legion Aux iliary Posts here. On Sunday afternoon at 3 p.m., the Appomattox Ministerial As sociation will present a religious service at the Old Court House. Thegpcst minister will be the Rev Walker Bocock Healy, pas tor of First Presbyterian Church, Roanoke. Healy is the great grandson of the first clerk of the Appomattox Court and a native of Lynchburg. The Rev. Forrest S. Wagofior, pastor of Appomat tox Memorial Methodist Church, is chairman of the ministerial association and will preside at this service."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "be the Rev Walker <mark>Bocock</mark> Healy, pas tor of"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "be the Rev Walker <mark>Bocock</mark> Healy, pas tor of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Bocock"], "snippet": "Ferguson. COUNTY CLERKSJohn T. <mark>Bocock</mark>, Henry F. <mark>Bocock</mark>, Geo."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Bocock"], "snippet": "Ferguson. COUNTY CLERKSJohn T. <mark>Bocock</mark>, Henry F. <mark>Bocock</mark>, Geo."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2179.88, 394.62, 2342.25, 842.62], "bbox_id": "c85ac2b9a4", "file": "AppomattoxNewspapers_1902-1905a_0419.pdf", "page": 1, "text": "siance, this small lircuit of Appo mattox would havo reported all finances paid in full, and a net sum of twenty-five hundred dollats raised. Now dont you see? Another good preacher like onr present pastor would have his eye on this circuit, and try to make his arrange ments accordingly. Mrs. E. V. Thornhill and Miss Dora, have dosed the old home and will spend the winter in the Hill City. Wedding bells will ring in the neighborhood of Oakville ere long. Miss Mary Atkioson is visiting ih Lynchburg. Mr. Burge Moore was fortunate enough as to kill five Wild turkeys recently, lie hud turkey for dinner, supper and breakfast, and one graced his table on Thanksgiving. Mr. John LeGraude,  a favorite warehouse man of Lyuchburg, oasts his shadow in the neighborhood of Wildwat uow ond then. We regret very much the depar ture cf Mr. and Mrs. W. P, Bocock. Our community and church have k.s a most useful aud lovable char acter in the death of Miss Lucy. Turner. Hr. Delbert HamerBley and family one of our most popular neighbors lav moved to Roanoke. We wish beni much success in their new wme, hu their places will be bard i fill tier.?."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "and Mrs. W. P, <mark>Bocock</mark>. Our community and church"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "and Mrs. W. P, <mark>Bocock</mark>. Our community and church"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1557.51, 1251.98, 1882.56, 1371.48], "bbox_id": "8f1737850b", "file": "AppomattoxNewspapers_1912-1915a_0010.pdf", "page": 1, "text": "severe attack of Grip, writes J. Watts, Floydada, Texas., and I regained 15 pounds in weight that I had lost.. Quick, safe, reliable and guaranteed.  50c. and 1.00. Ro-1 Trial bottle free at all drnggista Ro- D r. Gov. Colquitt seems determined  Morriss home the past week.  prove that old boast of Texas Mrs. O. R. Bocock has gone!that he could whip Mexioo single  on a visit to her daughter,Mrs.  handed"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Texas Mrs. O. R. <mark>Bocock</mark> has gone!that he could"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Texas Mrs. O. R. <mark>Bocock</mark> has gone!that he could"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2544.7, 1132.08, 2687.28, 1226.03], "bbox_id": "c2e206ff78", "file": "AppomattoxNewspapers_1962-1965a_0623.pdf", "page": 1, "text": "Service at Appomattox Court House National Historial Park. Speaker will be the Reverend Walker Bocock Healy, pastor of the First Presbyterian Church, Roanoke, and a great grand son of the first clerk of Appo mattox County. Official programs describing these events will be on sale."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "be the Reverend Walker <mark>Bocock</mark> Healy, pastor of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "be the Reverend Walker <mark>Bocock</mark> Healy, pastor of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [798.95, 874.85, 1951.46, 958.63], "bbox_id": "c15a580748", "file": "AppomattoxNewspapers_1915-1918a_0019.pdf", "page": 1, "text": "SAW MILLS MÀNUFACTUBING MILLS WATER POWERS OF AMERICAN illness. Throughout V irginia and the South Mrs. Bocock was not.id 1 ior her efficient work in aiding patriotic"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "SAW MILLS MÀNUFACTUBING MILLS WATER POWERS OF AMERICAN illness. Throughout V irginia and the South Mrs. <mark>Bocock</mark> was not.id 1 ior her efficient work in aiding patriotic"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "SAW MILLS MÀNUFACTUBING MILLS WATER POWERS OF AMERICAN illness. Throughout V irginia and the South Mrs. <mark>Bocock</mark> was not.id 1 ior her efficient work in aiding patriotic"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1328.68, 565.21, 1450.48, 642.21], "bbox_id": "0f2bd559a6", "file": "AppomattoxNewspapers_1908-1909a_0101.pdf", "page": 1, "text": "S. J. Evans, and children, last week-end in tfofre- isiting relatives k Buther Bocock dieg Ue Tuesday. She  best colored women"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "S. J. Evans, and children, last week-end in tfofre- isiting relatives k Buther <mark>Bocock</mark> dieg Ue Tuesday. She  best colored women"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "S. J. Evans, and children, last week-end in tfofre- isiting relatives k Buther <mark>Bocock</mark> dieg Ue Tuesday. She  best colored women"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [536.13, 1099.95, 694.23, 1313.1], "bbox_id": "950b937251", "file": "AppomattoxNewspapers_1892-1898a_0201.pdf", "page": 1, "text": "roe A.G. Mo -.-plaintiff! AGAINST. Wra. A. Cabell aimr. of N. F. Bocock decd. ctavia K. Bocock. Henry Gibbs and Rosa hi ife, John N. F. Bocock. Sallie P. Bocock. rank W. Bocock. Victoria E. Curley in her irn rifrbr and as admr. of James S. A lie eed. Mattie Allen. Ben Shaw Allen, Joh lien and James Allen, the last four name eing infants....................................defendant! The object of this suit is to obtain a deed onveying lots Nos. 5 and 6 in the town of Masille in Buckingham county, Va., tc Wm. A. Moss, Jr., A.G. Moss, M. S. Matthew aisy A. Moss. Frank B. Moss and C. F. Mo hey being the parties entitled thereto. And 3 affidavit having been made and filed that the defendant Frank W. Bocock is not a resi- ent of the State of Vinrinia.it is ordered that e do appear here within fifteen days after ue publication hereof, and do what may be eccssary to protect his interest in this suii And it is further ordered that a copy hereof be published once a week for four successive reeks in the A ppom attox and B uckingham D im es , and that a copy be posted at the front loor of the Court House of this county on the irst day of the next term of the county ourt. A copv T este P. A. F o r bes , Clerk. E. W. H ubard , p. q."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Bocock"], "snippet": "aimr. of N. F. <mark>Bocock</mark> decd. ctavia K. <mark>Bocock</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Bocock"], "snippet": "aimr. of N. F. <mark>Bocock</mark> decd. ctavia K. <mark>Bocock</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1659.85, 458.36, 1823.06, 566.25], "bbox_id": "6f13f67ab3", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "?ri? thiiifodeViiie Museum beie. I he ai l ides nil.v hegi veil, dr loaned I r tinee years, wifh llionatne ofj d.tuol itfiirti them, and placed in the nuin of anystate, or in the Solfdj South room, as the sender may de- ire. Any such article may he Bent I to the care of Airs. Thos. S. Bocock, Union Theological Seminary, Rich mond, Virginia, with ihe nam eandl wishes of donor"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Airs. Thos. S. <mark>Bocock</mark>, Union Theological Seminary, Rich"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Airs. Thos. S. <mark>Bocock</mark>, Union Theological Seminary, Rich"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [186.26, 691.38, 343.86, 890.23], "bbox_id": "b8dba6a603", "file": "AppomattoxNewspapers_1902-1905a_0256.pdf", "page": 1, "text": "Rev. W. K. Bocock died in Pbila delphia on the 15tn instant, and his remains ware interred at Lexing ou. Va., on the 20th. Mr. Bocock as the son of an eminent Presbyter.t n divine, the Rev. John H. Bocock. D. D., and nephew of a former t!iJr- ney-general of Virginia, the Hon. Willis P. Bocock, and of the Hon. Thomas S. Bocock, for many years a member of the Federal Congress, and the only Speaker of the Con federate Congress. His mother, Sarah Margaret Kemper, is a sifter of the late General James Lawson Kemper, Governor of Virginia fri.m 1873 to 1877."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Rev. W. K. <mark>Bocock</mark> died in Pbila delphia"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Rev. W. K. <mark>Bocock</mark> died in Pbila delphia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.07, 1159.03, 1826.95, 1341.58], "bbox_id": "c2a0136d8d", "file": "AppomattoxNewspapers_1905-1912a_0495.pdf", "page": 1, "text": "prospect. M iss W illie S tanley, of Ap-1 pom attox, is visiting Miss Je s sie OConnor. M rs, E S. T aylor visited her d au g h ter, C laire, of th e B. F. I. recently. Mr. Jam es C raw ley, of Blaok- stone, h as been vis tin g his In order to oonfer specialhonor parentg M r an d Mr8 T . W . upon the widow of Thomas -8. Bo- C raw ley, of th is place. ,,  ,. . . . . . . ,obck, a member of the Confederate! mi,- , flrmnn nrfthd hv onr a ir ,o t-.dly- t h a t .he d u eled th. 0   g  m _ OIBo, h    r r. l . r h e KrmoD preached b y wr rvicc to b changed to her home. I .. . .  w , IpSOTor Kcv Mr. Hon ton, fttth marred and we P ? i ! !  created Wedneeday DaVig- M em orial 0 h u rch on m a rr-c u  u u w c  Atij u . n D a  l r . i skl , t F ebruary 11th, w as m uch en- nyway she was m   . . .  l and Mr. Bocock elected to fill the ish her happiness and- p r o s p e r ity ,!  for Ufe Mrg   ock ig the"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "m   . . .  l and Mr. <mark>Bocock</mark> elected to fill the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "m   . . .  l and Mr. <mark>Bocock</mark> elected to fill the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [518.11, 1079.11, 689.02, 1579.29], "bbox_id": "86e832fe62", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "PRIVATES. Abbett Geo. Dallas Alvis Ed ward, died in hospital at Mt. Jack- son, 1862 Alvis Wm. M., wounded Bagby Luke, discharged Banton James Bell Wyatt H . Bingham, Jno. S., discharged Bocock, Jno, T., deserted in December 1863 Bragg, Jno. J., transferred Bran ham, George W., from Albemarle county Brown, C. C. Carson, Jno, J. Carson, M. J. Carson M. W. j Cawthorn, Hudson  Cheatham, R, H., wounded at 2nd Manassas, Sept. 22nd 1862 Chick, J. J., captured wounded at Hanes Shop, May 28th, 1864 Chick, E. A . Clock, Cotton  Clock, William Clarke Henry Clarke William Coleman Drury  Coleman Henry, died in hospital Coleman, J. A., captured at Toms Brook, Oct. 9th, 1864 Colemtn Madison Coleman, Schuyler, died pt home 1862 Connelly, Warner Geo. Conner Allen, discharged lb overage Crawley, Richd, trans ferred  Crenshaw, Jno J., captured u Ilanes Shop. May 28th, 1864. Crumby, Frank, died in hospital in Richmond 1862 Davidson Jas II., died Diggs, John Doss, Jos. E. Dunn,put in substitute Elliott, Jno W. died at home in service Elli ott, Thos. wounded at Toms. Brook, Oct. 9th, 1864 Featherston, Jas. H. detailed with Hills, A. P. Signal j corps Ferbush, Henry discharged f Furbush, J. D. killed at Fort Ken- i"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Bingham, Jno. S., discharged <mark>Bocock</mark>, Jno, T., deserted in"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Bingham, Jno. S., discharged <mark>Bocock</mark>, Jno, T., deserted in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.43, 1123.11, 1832.99, 1390.61], "bbox_id": "ab12e5e72b", "file": "AppomattoxNewspapers_1962-1965a_0609.pdf", "page": 1, "text": "ppalling losses at Rich- tersburg, Amelia C.H. here, Lee was desper- ing to reach Danville join with large Con- orces under Johnson in arolina and thus a decisive battle, such ttysburg. He wanted to iierman first and then  tx Civil War Grant in a situation Several of the local min isters will be assisting in the service. The music for the service will be presented by the Appomattox Civic Chorus under the direction of the Rev. Thomas A. Waddill. The Chorus will sing three num bers. The Lords Prayer, Kellers American Hymn, and He Leadeth Me. Dr. Walker Bocock Healy is a native of Lynchburg and the son of Mrs. Huldah Bocock Healy and the late Henry Boyd Healy. He married Miss Adrian Jones Croom, of Wilmington, N.C. and they have three children. Dr. I Healy has served as Asistant"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Leadeth Me. Dr. Walker <mark>Bocock</mark> Healy is a native"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Leadeth Me. Dr. Walker <mark>Bocock</mark> Healy is a native"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1043.47, 279.13, 1210.21, 661.62], "bbox_id": "98e969b79a", "file": "AppomattoxNewspapers_1936-1939a_0045.pdf", "page": 1, "text": "political life. Now as to the social side of his life, you must see that it was fa mous, considering the political life he led. He was no only a most wel come guest, but a most desired one on all occasions, and was perfectly at ease in any gathering, a kind neighbor, and staunch friend, a lover of and beloved by mankind. No un welcome guest ever approached his doorstep. Whoever same, high or low, rich or poor, received a hearty welcome. Mr. Bocock took great pleasure in helping others, and one act he was justly proud of was securing the appointment of General Jeb. Stuart t o West Point. General Stuarts by his brilliant achievement during the War, ranked as one of the greatest cavalry generals of all time. In his later years, when old age began to weigh heavily on him, and that once brilliant light of genius and intellect began to grow dim, that other light which had nut failed bo shine through his life, the light of morality and faith in his God grew brighter, and guided him on the day set by his God for the An gels of Heaven to hover around to bear that noble spirit to the God who gave it. Thus, on the 5 th day of August, 1891, on the farm on which he was born, among the friends and his family he loved so well and who loved him so dearly, Thomas Salem Bocock passed to his glorious re ward."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "a hearty welcome. Mr. <mark>Bocock</mark> took great pleasure in"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "a hearty welcome. Mr. <mark>Bocock</mark> took great pleasure in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.08, 571.86, 1907.51, 597.96], "bbox_id": "c80c0248e3", "file": "AppomattoxNewspapers_1943-1947a_0428.pdf", "page": 1, "text": "PLAN HONOR FOR LATE THOMAS S. BOCOCK"}, "highlight": {"text": {"matched_tokens": ["BOCOCK"], "snippet": "PLAN HONOR FOR LATE THOMAS S. <mark>BOCOCK</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["BOCOCK"], "snippet": "PLAN HONOR FOR LATE THOMAS S. <mark>BOCOCK</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [165.84, 466.23, 312.32, 1762.57], "bbox_id": "0a8502fbfc", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "Palma Let him now take his stand in the front rank of American Heroes. By Maj. Samuel J. Walker - Bartholomew Cyrus the only surviving Revolutionary Sol dier present May his last days behübest. By Bartholomew Cyrus A Revolutionary Soldier - May the feelings which filled the hearts o f the Patriots of the Revolution be justly appreciat ed by the youth of the present day. By Dr. Wm. D. Christian Speedy peace with Mexico continued peace with Great Britian and the world. By Maj. Samuel J. Walker  Gen. Scott and Gen. Gaines The distinguished services of these Generals in the late war, and the blood the one spilt at Lundys Lane and Chippewa, the other at Erie, will protect them against the assualts of President Polk and his Secre tary of War. The American people understand how to estimate these services. By Thomas S. Bocock  Gen Scott We thank him for what be has done for his country and only wish that during the next Presidential term he may take his hasty plate of soup in privacy, without the fear of enemies either in front or rear. By Rkhard Perldiu invited Guest - The County of Appomattox, I hope the hospitality exhibited by her citizens this day Will form a closer alliance with her deserted parents. I was her greatest enemy in war, in peace her best friend. By QBss  Partwood  Henry Claftffie wisp end good May posterity do homage to hie destinguished ability, by implic it acquiescence in the great leading measures of his policy of our Government By Cat Beujamiae P. Walker - John J. Crittenden The unrivalled Orater, accomplish ed Gentleman and able Senator, he deserves the gratitude of his Country for his services on the Oregon Question. By P. B. Pankey - Col. T. H Flood - long the whig tide of Buckingham surely Hot diked by Appomattox. Loci Focoisn. By Capt. J. A. Hamer - General Taylor like a Washing ton and Jackson May he long be remembered by the Ameri can People. By Henry F. Bocock - The ladies  of Appomattox, as patriotic as they are fair. By A. A. LeGrand - The perpetuation of our Republican Government and the just appreciation of the rights of the governed. By G. W. A. Raine - E. J. Goode - Reader of the Declaration of Independence - May a distinction worthy of the intelligence and patriotism of his youth crown his entire manhood with the love and respect of his countrymen. By H. F. Bocock - R. M. T. Hunter A fearless advocate of the rights of the people, regardless of the consequences which may result to himself - May he fill the seat about to be vacated by our distinguished Senator, Wm. S. Archer. By Capt. Thomas W. Johns - Gen. Andrew Jackson The warrior and statesman sleeps with his fathers. His memory will evpr be reversed alike by philanthropists and patriots, his services both in the council chamber and upon the lentel field will be handed down to the latest posterity - and shine as morning lights in his countrys history. By A. A. North - The United States and Texas - Long may this union of the two republics last and long may it continue to disperse its blessing? to the countless millions who in the course of time, are determined to animate its soul. By E. B. le nd - Henry Clay - May his evening sun set as tranquil as was his meridan, bright and luminous. By A, W, Carter - Edmund J. Goode The handsome which he this day delivered, gives us promise of future distinction and usefulness, and"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "services. By Thomas S. <mark>Bocock</mark>  Gen Scott We thank"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "services. By Thomas S. <mark>Bocock</mark>  Gen Scott We thank"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [208.08, 1270.8, 710.81, 1703.69], "bbox_id": "6faeb5f74c", "file": "AppomattoxNewspapers_1915-1918a_0560.pdf", "page": 1, "text": "p wi i 1  H 1 í i 30 Amos Lee Cress Pamplin 20 39 Chas. A. Bocock Vera 21 ujb 25 William Price Martin Appomattox 22 B  g te  12 Lyle Foster Caldwell Spout 8pring 23 ppnd no J R j Jf!j B  1 34 Henry Augustus Tames Appomattox 24 i   , m m t i 2 John McCartney Scott Appomattox 25 S r i a B ! IB B i, 1 46 Add Alvis Washing Branch Pamplin 26 fyiEOcl l A H H j l l p l l 8 Frank Obey Covington Hollywood 27 sjmgii c H lfí Í 2 n lr f  ü 40 George Ferguson Vera 28 1 38 Clarence Fletcher Moore Oakville 29 H n oB fii 7 Bennett Harding Beckham 30 foTphn dMfi  27 Durward Belmont Thomas Appomattox 31 Hoft w sH BF VjL- 1 James R. Alvis Spout Bpring 32 HM. ohH  52 Lucius Ashton Harrison Appomattox 33 D i i H .  jal a 6 Charles Reames Morris Concord Depot 34 24 Doctor Connie Baldwin Evergreen 35  4 j 14 Clarence Burnett Simmons Evergreen 36 19 Silas Paul Cawthon Vera 37 Hem H . 11 j 37 James Leonard Blackwell Appomattox 38 B r K.v 36 Geo. Wesley Tolley Evergreen 89 1 Jff i . 1 BBBBj h yl Vc.-i y  44 Junius D ud gee Spout 8pring 40 16 Jesse Peyton Harvey Evergreen 41 ftSflrai RS 26 Nick Burrell Pamplin 42 IpfMilwjB y Si 31 Allen Howard Mayberry Appomattox 43 B  i H I i B I B K i 63 John Henry Stephens Appomattox 44 43 Thomas Doss Spout Spring 45 23 Melvin Davis Childers Vera 46 H r 22 Joseph Rufus Burnett Stapleton 47 21 Thomas Tyndal Pugh Appomattox 48 IVeg 50 Walter Day Bent Creek 49 É É p ?fl 47 Ossie Watson Evergreen 50 P aaH HpODt jtff -T Jifííg i   Es 9 Emmett Mott Perdieu Spout Spring 61 20 William Ernest Layne Spout Spring 52 H P f  5 Ernest Wightman Harwood Pamplin 63 42 Nelson Harris Spout Spring 54 L ocal B oard A ppomattox C ounty ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1496.89, 976.49, 1671.28, 1508.73], "bbox_id": "14b4348b0a", "file": "AppomattoxNewspapers_1939-1943a_0585.pdf", "page": 1, "text": "P. S. Drinkard, of Blackstone, spent the week-end here. Lafry Young, of Richmond spent several days last week at his home here.   Guests of Judge and Mrs. J. W. Flood Sunday night were Mrs. Will iam A. Roberts, of Chase City, and W. Pa Bocock. . Friends are glad to see W. P. Bo cock out again, after an extended illness. Mr. and Mrs. J. Carlton Price and daughter, Klathleen Hampton, of near Fredo iek-ibv. g, were visi tors in Appomattox Monday. Mr. and Mrs. R. K. Lawson, of Spartansburg, S. C., are spending his week with relatives at Spout Spring and Appomattox. Visitors in the home of Mrs. Mar shall Ferguson Sunday were Royal Ferguson, Mr. and Mrs. Glass and daughters, Mrs. Nicholas and sons, and Miss Nannie Moore, of Lynch burg. Tucker Cheatham, of Madison,  Wise., has been visiting his par-  ents, Mr. and Mrs. J. H. Cheatham 1 at Hotel Appomattox. Mrs. Marshall Ferguson is im- ! proving from a recent illness. Mrs. Ola Furbush is spending this week in Petersburg with her daugh- I ter, Mrs. Jack H. James. Miss Ethelyn Lee, of Richmond, i spent last week-end here. Mr. and Mrs. Charles Crawley of i East Falls Church ire visiting in I Appomattox this week. jI Miss Katie Seay spent the week end with Miss Roberts Gardner re cently. Mr. and Mrs. C. H. Gobble and Miss Rachel Guill, of Washington, spent the past week-end with Mr. and Mrs. W. H. Guill. J. Mott Robertson, of Lynchburg was a visitor in town Monday."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "City, and W. Pa <mark>Bocock</mark>. . Friends are glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "City, and W. Pa <mark>Bocock</mark>. . Friends are glad to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [893.7, 889.7, 1009.24, 1067.49], "bbox_id": "49ee285ba9", "file": "AppomattoxNewspapers_1947-1949a_0221.pdf", "page": 1, "text": "P. L. Thornton Dr. J. R. McDearmon Hon. Thomas S. Bocock S.F. Wright J. W. Flood J. R. Franklin C. T. Plunkett Dr. J. R. Robertson James Couch F.. H. Thornton Wm. H. Trent Dr. R. H. Watkins Spencer Gilliam Wm. B. Farnar Rev. J. H. Cawthorn John Sneed Sfc D. McDearmon Dr. T. P. Mathews."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "McDearmon Hon. Thomas S. <mark>Bocock</mark> S.F. Wright J. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "McDearmon Hon. Thomas S. <mark>Bocock</mark> S.F. Wright J. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [521.99, 1200.06, 683.59, 1968.35], "bbox_id": "498e8c5da7", "file": "AppomattoxNewspapers_1898-1902a_0593.pdf", "page": 1, "text": "P k V N T E R S T O W N . This was the nathe given to an old colonial town situated on the north side of Appoiiattox River, just be low the sire of the Cut Bauk bridge that used to span the river at that place. The town was at the head of what was then flat-bottom boat navi gatiou on Appomattox River, which was made so by the aid of sluice and dam improvement. Under the old British regulation the land was condemned, streets laid off, and the town Incorporated, bin it seems never to have been built up for a warehouse and tavern are tin only buildings of which we have any account. Perhaps the .GlUteU8, like those of old Jamestown, thought tin laud would be more valuable put in tobacco, aud who knows but they were right. Anyhow it was never built up, On the west side of the fown is the Cut Bank road, leading from Hopeville, Buckingham county, to Hurtsville and Hixburg, Appomat ,tox on the north, the elegant old mansion of - William R. Gilliam grandson of old Isham Gilliam, the celebrated fox hunter, who threw off his coat once iu an exciting chase and, finding it a month afterward swore it belonged to a runaway negro, for putting it to Ins nose he said it smelt like one, Th Madame could hardly convince him of his mistake. Here Mr. William R. Gilliam entertains his guests and friends in the most hospitable man ner, Qn the east is Woods Moun tain, which, jjsjpg jp all its majestic grandeur, throws itg shadow over hill aud dale. The mountain road crosses this m o u n ta in , running from Jones Mill road to the Cut Bank road through Pluuterstown, planned by old Mr. John Bocock, comniis sio.ier. Qn this road is the celebrated Rock Spring, gushiug from a rocky bed underneath an immense shelv ing rock, aud descending three or four feet to the reservoir below. It is a place of great resort for level lasses and then beaux, from which they ascend to the grand scenery above. Some eighteeu mouths ago a happy pair lost their way, passed ard repassed the spring without see ing it, although the lady declared she had bee there often before, and I had to pilot them to the place, The lady seemed veiy disconsolate and I had to console her by saying that such thiugs were of common occurrence, as I once myself, under almost similar circumstances, left a broad country road that I had often traveled and turned up in a cow-pen."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "by old Mr. John <mark>Bocock</mark>, comniis sio.ier. Qn this"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "by old Mr. John <mark>Bocock</mark>, comniis sio.ier. Qn this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1974.7, 485.69, 2143.18, 1171.29], "bbox_id": "b0f3c3e75b", "file": "AppomattoxNewspapers_1922-1923a_0229.pdf", "page": 1, "text": "Our old and much reapected neighbor and friend Thomae H. Garnet now 87 year old had ridden horseback oves to hit farm on Will is Mountain and was on his way back to his son Toms, where he makes his home now, wen his horse hied, or stnmbled,  browing him ont of hie saddle to the ground, his left foot bung in tbe stirrup, and his horse started down the hill near Mr. Morrits, bnt the faithful crea ture which be had ridden, for 12 years, seemed to know instantly thi something was wrong with bis-mas ter,tnd soon stood still not dragg ing Mr. Garnet moie than a few yards. Mr. JWtnisson and Mr. Dean were at worlLonm-half a milf off and bearing cries for help,, hurried to his rescue and soon relieved hint f .om hw periled position and put him in a wagon well padded with bed quilts, and oarried him to his son Toms, braised and scratched a little, but no eerions injury But for the sagacity of hie favorite, rid ing horse which stood still about 20 minntea awaiting the help that came he would have undonbtiy been dragged to death, being at, his age too old and infirm to .each pp and grasp the stirrup with bis hand. , Mrs. H. Glen Hebditch of Knox ville Tenn. who came home two weeks ago to attend the marriage of her brother Bocock exptets to leave today for her home. W. B. Spender, lost another ion, Anderson, last week, he goes to join his brothers in West Virginia in their pop factory. The miusrs in West Virginia drink more whiskey and pop than any other cl iss of men that I know. Miss Annie Page Jones is borne again at New Store, she was princi pal of a high school in Augusta, Co. Va., last session. Mrs. Bullard, wife of R-v. Mr. Bullard of Lunenburg Circuit pass ed through Arcautn a few dayt ago enroute to her fathers Mr. E. Van A derton, and by tbe way Uaole Van is tbe most enjoyable corres pondent the T imes has."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "marriage of her brother <mark>Bocock</mark> exptets to leave today"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "marriage of her brother <mark>Bocock</mark> exptets to leave today"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.06, 1348.63, 1664.06, 1430.63], "bbox_id": "1b5d47a083", "file": "AppomattoxNewspapers_1905-1912a_0495.pdf", "page": 1, "text": "Operator Matheny who recently only Confederate woman to be so epted a position here, will movehonored by. the Richmond Oh..ter. ack to Bedford, where he has ac-J An appeal made by Mrg. Thom epted hi old job. Mr. Matheny S. Bocock for a contribution to s a splendid gentleman and we re-wards the Arlington monntnent met ret to give him up, but he a lle g e s  With the warmest sympatl , fto rn hat the double track would throw the Chapter, and it was determii"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "job. Mr. Matheny S. <mark>Bocock</mark> for a contribution to"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "job. Mr. Matheny S. <mark>Bocock</mark> for a contribution to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [204.02, 1454.59, 366.11, 1655.34], "bbox_id": "00eb1fbf40", "file": "AppomattoxNewspapers_1892-1898a_0347.pdf", "page": 1, "text": "on The Hon. H . D. Flood left Saturday nights train to fill an ap pointment in Augusta. Appomat tox feels proud of her son. He is showing himself equal to her traditions. For years this county gave to the nation, in the person of the Hon. Thos. S. Bocock a member o f the U . S. Congress. During this time Gen 1. Willis P. Bocock, was Attorney General while this senator ial district was represented by the Hon. Thos. H . Flood, also a son of Appomattox. Harry D. Flood is the equal of any man elected to office from this county and will prove himself, so for his election is assured."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the Hon. Thos. S. <mark>Bocock</mark> a member o f"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the Hon. Thos. S. <mark>Bocock</mark> a member o f"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [881.96, 880.82, 1046.69, 1273.37], "bbox_id": "b50045d977", "file": "AppomattoxNewspapers_1936-1939a_0045.pdf", "page": 1, "text": "of Virginia, Gilbert C. Walker, of New York, appointed a Mayor for the City of Richmond, and the citi zens of Richmond elected one for the same office. Of course there was a hob fight as to which should serve, and on April 27th, 1879, there was a meeting in the State Capitol to discuss the qustion, and Mr. Bocock was a spectator. The gallery of the building collapsed, known as the Capitol Disaster. Mr. Bocock was one of the many badly injured, his ankle being crushed, causing him to limp through life. The accident caused such a shock that he never fully recovered physically, but that gigantic structure of intellect con tinued to shine and cast its bright ness above his surroundings. Well do I remember Mr. Bocock in he old age, as he would lean on his cane and limp from the effects of the accident. What a striking figure he presented of the true type of the old Virginia gentleman. Went To Huse of Delegate Mr. Bocock was elected bo the House of Delegates of Virginia from Appomattox County in 1877, and was the candidate of the Democratic Party in 1879, but was defeated by James Watkins, the Re-Adjuster candidate, his defeat being caused only by a division in the Democratic ranks as to the settlement of the state debt. There were about as many negro voters in the county as were white voters and the solid negro vote combined with the Demo crats who voted for Watkins o the state debt question defeated Mr. Bo cock, the only defeat lie received during his long and distinguished"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the qustion, and Mr. <mark>Bocock</mark> was a spectator. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the qustion, and Mr. <mark>Bocock</mark> was a spectator. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1360.1, 1452.88, 1483.15, 1549.28], "bbox_id": "3b54cbb5f0", "file": "AppomattoxNewspapers_1922-1923a_0284.pdf", "page": 1, "text": "of the friends of the hstinguished citizen of Ap- t, the life T. S. Bocock 1 the opportunity to be pres- eourtday when a hand- nting will be presented to J by his wife. The paint- ng on the court-room"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "the life T. S. <mark>Bocock</mark> 1 the opportunity to"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "the life T. S. <mark>Bocock</mark> 1 the opportunity to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1456.55, 908.89, 1622.0, 1805.47], "bbox_id": "042e9526d9", "file": "AppomattoxNewspapers_1892-1898a_0111.pdf", "page": 1, "text": "O., had his eyes almost blown from his head. He was standing above the powder endeavoring to drop lighted matches into it and succeeded beyond his most sanguin expectations. Fortunately for the young man there was not sufficient powder to do any great damage or his injuries might have been fatal. As it is he is well on the road to re covery. A P ain fu l Acclffent. On Thursday afternoon of last week little Miss Vara Burke, daughter of Mr. R. F. Burke, while walking up the railroad track between her home and the depot, accidentally stumbled and, falling across the ties, inflicted quite a serious cut on the side of her head. Dr. James Abbitt, who very fortunately was in the village at the time, was summoned to her assist ance and discovered that an artery had been severed. The proper rem edies, however, being applied the young lady sustained no greater in jury than the loss of a large quan tity of blood. She is at the present time reported as almost entirely re covered. An In terestin g M eeting. The Ministers and Laymens meet ing of the Appomattox Association was in session at Liberty Church last Saturday and Sunday. There were present Revs. Wm. Fisher, R. E. Booker, W. R. D. Moncure, W, E. Nichols as visiting ministers. The meeting was full of interest despite the rain on Saturday. Sunday brought out a fairly good crowd, when such questions as Deacons, TheirfOffice and Obligations,Effects of R acing on Character were de bated in short and spicy addresses, The meeting closed with a most excellent sermon by Rev. W. R. D. Moncure, on the vision of John, Rev. VII chapter. These meetings are held in those months that contain fifth Sundays, ______________ A New R ecruit. We were highly gratified last week at receiving a call from Mr. A. E, Miltimore, of Catskill, N. Y., and to learn that he has purchased the tract of land formerly owned, by Col. Willis Bocock, consisting of 19901 acres. It is his intention to make Appomattox his permanent home. He brought with him seven thoroughbred sheep just imported from England, and a mare, half sis ter to that famous trotter, Maud S. He also has a large number of fancy chickens and turkies,with which, we suppose, he intends stocking -his farm. Needless to say, Mr,. Wilti- mores .advent in onr county is an event of importance, and we extend to him our hearty_ good wishes for his future success, knowing he will receive from our people an old Vir ginia welcome."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "owned, by Col. Willis <mark>Bocock</mark>, consisting of 19901 acres."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "owned, by Col. Willis <mark>Bocock</mark>, consisting of 19901 acres."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "by election. John T. <mark>Bocock</mark>, first clerk Thomas S."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "by election. John T. <mark>Bocock</mark>, first clerk Thomas S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Bocock"], "snippet": "th court, John T. <mark>Bocock</mark>f the firs clerk, died and Henry F. <mark>Bocock</mark> his son, was named"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Bocock"], "snippet": "th court, John T. <mark>Bocock</mark>f the firs clerk, died and Henry F. <mark>Bocock</mark> his son, was named"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1173.05, 330.7, 1321.1, 1437.75], "bbox_id": "eb5e201bd7", "file": "AppomattoxNewspapers_1922-1923a_0454.pdf", "page": 1, "text": "nounced that though the month closedthe coldest tory of modern trucking he put back the crops to a largWitJ and brought about unfavoraff ditions with respect to earttol shipments to the North East - West, cloudy conditions to with high winds, saved this to a large extent, leaving  strawberries and fruit in better con tion than in the trucking t e r S south and southwest of V irS where frosts did heavy damage V? as far as Texas. F. A. B. Portman, master u hounds of the Varrenton Hun died there after a brief in pneumonia. His death was expected. He was the son G. Portman, of Thurlbene, Soi! England, and was a native ot- place. He is survived by a wii Mrs. Carrie Luke Portman Charles N. Porter,, aged 19 j Roanoke, who was injured oi - dinky engine on a railway contr at Bocock, Campbell County at. Wednesday night of his injuries The most important step recently taken by the Health Commission W its fight against tuberculosis  made known Thursday, when Dri E. C. Levy, chief health officer, J nounced that a tuberculosis disnes sary will be established in Richmoaf within a short time. The commissi has intrusted the details of the msti ter to a committee composed of d J Carsin and Hoge and Commission James E. Phillips. This commits will meet Dr. Levy, when plans foi the dispensary will be arranged and recommended to the commission for1 approval. The location for the l i pensary is yet to be decided upon. Roy Counts, 19 years old, emploji ed as an operator in the Wester! Union Telegraph office at Bristol, 1 cause his young wife had left him si tempted suicide by taking strychnia! and laudnum. The poisons cousfsj acted each other and this alone u. ed his life. His condition is stil critical. He married a daughter  Hon. Rich Smith, a former Repif sentative of Russell County, in th Legislature. His wife recently r turned to her father. Miss Sallie A. Magrath has hai placed in the Methodist Episcopi Church at Fredericksburg a beantjr ful window in memory of her parent Lewis O. and Mary Frances Magrath both of whom were members of tht church for a number of years. G. Johnson, an ex-Confederatrl soldier, of Spottsylvania County, died suddenly at his home, near Granlti Springs, aged 78 years. He is sw vived by a widow and several chii dren. President Lucius E. Johnson i the Norfolk and Western Railing announced that his company had or dered a 6,000 fire engine which I will present to the Roanoke Fin Department. The engine will bt equipped with three hose connection The railroad company owns mudj property in Roanoke, and often lui borrowed the city fire engines to seal to points along its line of road tt. fight fires. A general mortgage securing 4 500,000 30-year 5 per cent, bonii issue was recorded in the clerks of flees of Roanoke City and Roanohj County. The mortgage is execute by the Roanoke Heat, Light and Power Company to the Girard Truk Company, of Philadelphia. Thebondi have been sold, and the proceeds w  be used in the construction of I modern power plant for supplyl among other things, electrical cm  rent for the entire consumption ne the Ronanoke Railway and EleeWft Company. The plant will be locattf in Roanoke, and its condensing M gines will be supplied with wJ from Roanoke River. Work wil  gin immediately upon the const tion of the plant. While the chain gang was at wort at the rock quarry on the om  skirts of Danville, four ol  prisoners successfully escaped c tody. The refugees were together with shackles attached their waists, from which caaL  nected them with each other- who escaped were Bud Wfllto who had to serve about two m for contempt of court because __ caping from the gang 30aiej , , William Blackwell, who baa  j for disorderly conduct 1U don, 20 days for larceny, other negro, whose name J known. Officer R. M. Gee, mej in charge of the gang, saw  i men running into the wood but, being the only J m ground, could not chase for fear that oth make an attempt to gain jwJ dom. Only a few day ago fl prisoners escaped in a aim Tj"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "a railway contr at <mark>Bocock</mark>, Campbell County at. Wednesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "a railway contr at <mark>Bocock</mark>, Campbell County at. Wednesday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [857.04, 373.4, 1016.33, 436.4], "bbox_id": "41b9cf2705", "file": "AppomattoxNewspapers_1933-1936a_0250.pdf", "page": 1, "text": "News has been received of the death of William A. Roberts of Chase Jity. His wife was Mrs. Sally Bocock, of the famous Bocock family of Ap pomattox county. ,Funeral services were held Monday afternoon.He was 58 years old."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Bocock"], "snippet": "wife was Mrs. Sally <mark>Bocock</mark>, of the famous <mark>Bocock</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Bocock"], "snippet": "wife was Mrs. Sally <mark>Bocock</mark>, of the famous <mark>Bocock</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [583.44, 963.04, 756.45, 1155.19], "bbox_id": "4b2f868cb7", "file": "AppomattoxNewspapers_1939-1943a_0157.pdf", "page": 1, "text": "N R. Featherston, local hiataf- an, who keeps up not only with  on Old Appomattox, but also With former Appomattox citizens, called attention this weak to a very prominent family formerly residing     that of Mr. and Mrs Sam Kay lor. Mr. Taylir was born in 1852 and d.ed in 1927. He lived at Wildway, in the old Bocock home. Originally he came from the Stonewall sec tion of the county. When he died at the age of 75, he was survived by his widow and the following 11 children Jean, Grace, Ethel, Char-  e Maggie, Sam, Sallie, William, Sue. Lizzie and Olive Mr Feather- eton reports that Mrs. Taylor and all of tiie children are all living and"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Wildway, in the old <mark>Bocock</mark> home. Originally he came"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Wildway, in the old <mark>Bocock</mark> home. Originally he came"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.79, 301.52, 1826.44, 489.18], "bbox_id": "226d140c8a", "file": "AppomattoxNewspapers_1902-1905a_0001.pdf", "page": 1, "text": "N o tice . I he Officers aud Ri gents of th. Confederate Museum, Richmond, a take this means.of notifying the pa triotic public, t hat any war relics in Con federate souvenir in the posse, ioil of private individmtls. Would be gratefully received, and exhibited  G  bn,fedeViie .Museum beie lie ai liiaes nit.y be give, Or loaned W three years, with the nutne of null upon them, and placed in tin ooiii of any state, or iu the Solid Bontli room, as the sender may de sire. Any such article may be sent to the care of Mrs. Thos. S. Bocock, Union Theological Beminarv, Rich mond, Virginia, with the name and sites of donor."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Mrs. Thos. S. <mark>Bocock</mark>, Union Theological Beminarv, Rich"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Mrs. Thos. S. <mark>Bocock</mark>, Union Theological Beminarv, Rich"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1662.51, 386.73, 1823.0, 574.53], "bbox_id": "ec50f879a5", "file": "AppomattoxNewspapers_1902-1905a_0002.pdf", "page": 1, "text": "N o tic e .  The Officers and Regents of the Confederate Museum, Richm ond,Ya. take this means.of notifying the pa trio tic public, that any war relics or Confederate souvenirs ill the posses- iort of private itidividmlls. Would be gratefully received, and exhibited if Goiifedeinie Museum beie. l lie an ides tiilVv be gi veil, dr loamal for 1 brie years, with uutiie of dtiiior upoti them, and placed in the uu ol any state, or in the Solid South room, as the sender may de sire. Any such article may be sent to the care of Mrs. Thus. S. Bocock, Union Theological Seminary, Rich mond, Virginia, with the name and wishes of donor."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Mrs. Thus. S. <mark>Bocock</mark>, Union Theological Seminary, Rich"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Mrs. Thus. S. <mark>Bocock</mark>, Union Theological Seminary, Rich"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1707.6, 435.18, 1892.0, 468.93], "bbox_id": "68708bfdc2", "file": "AppomattoxNewspapers_1905-1912a_0406.pdf", "page": 1, "text": "Mrs. Thos. 8 . Bocock, Mrs. Wm. F ri-1 A. Roberts and Miss Anna H. Rey- I nolds, with Ohas. P. Reynolds, are"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Thos. 8 . <mark>Bocock</mark>, Mrs. Wm. F ri-1 A. Roberts and Miss Anna H. Rey- I nolds, with Ohas. P. Reynolds, are"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Thos. 8 . <mark>Bocock</mark>, Mrs. Wm. F ri-1 A. Roberts and Miss Anna H. Rey- I nolds, with Ohas. P. Reynolds, are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1370.88, 421.85, 1697.06, 527.51], "bbox_id": "e92575a7db", "file": "AppomattoxNewspapers_1905-1912a_0338.pdf", "page": 1, "text": "Mrs. Sallie B. Reynolds viaitec May. July, September and November. I. J CumberlandTueeday after the fourth I her mother. Mrs. Bocock. in Bich- Monday iu January, April, September and I . . . . 1 November.  Im o n a th is w eek. Prince EdwardTueaday after the third I m u   i m r F -  September d Mr. G. D. Abbitt has been visit- ling his sisters in Christiansburg,  Roanoke and other Southwestern BUCK INu 11AM. HO. BUVNBTT C.OK DON, JUDOS, Coart meets Tuesday alter the 2nd Monday I towns. Mr. W. O. Abbitt ic November Tuesday utter the 2nd Monday I d Mareh Tueaday at tei the 2nd Monday in May Tueaday after th e  nd Monday in July"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "I her mother. Mrs. <mark>Bocock</mark>. in Bich- Monday iu"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "I her mother. Mrs. <mark>Bocock</mark>. in Bich- Monday iu"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [487.44, 392.83, 659.14, 918.17], "bbox_id": "e90c8d5e33", "file": "AppomattoxNewspapers_1926-1933a_0501.pdf", "page": 1, "text": "Mrs. Martha A. Gills, a for mer resident of Appomattox, died at the home of her daugh ter, Mrs. T. L. Payne, in Crewe, April 11. Mrs. Gills was 93 years of age. She was a daugh ter of the late Captain Wilson Hix, of Appomattox, a leader in the community which play ed so dramatic a part in the War Between the States. Her mother was a sister of Hon. Thomas S. Bocock, of Appo mattox, who was the speaker of the House during the brief re gime of the Confederacy. Mrs. Gills remembered vivid ly the circumstances of the sur render of General Lee at Appo mattox. The surrender took place on a farm owned by her rather, and the terms of sur render were drawn and signed in a building formerly owned by her father, who sold it to Major McLean during the war. General Grant took possession of her fathers home for eight days while the Confederate sol diers were being paroled. When the Union soldiers were beginning to evacuate the village, an officer approached the young daughter of the house and informed her that he had hidden away a barrel of flour and a chicken, so that when they were gone her fami ly might not suffer for provi sions. The gloom of war was bright ened for Mrs. Gills by the ro mantic attachment she felt for her first cousin, Daniel Gills, a young cavalrymen in Fitzhughjj Lees brigade, which after the war culminated in marriage. Her husband, with his six brothers, William, Watt, John, and Edmund"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Hon. Thomas S. <mark>Bocock</mark>, of Appo mattox, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Hon. Thomas S. <mark>Bocock</mark>, of Appo mattox, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [487.2, 370.05, 645.02, 505.65], "bbox_id": "3b1d9e534b", "file": "AppomattoxNewspapers_1908-1909a_0501.pdf", "page": 1, "text": "Mrs. Martha A. Gills, a for mer resident of Appomattox, died at the home of her daugh ter, Mrs. T. L. Payne, in Crewe, April 11. Mrs. Gills was 93 .years of age. She was a daugh ter of the late Captain Wilson Hix, of Appomattox, a leader in the community which play ed so dramatic a part in the War Between the States. Her mother was a sister of Hon. Thomas S. Bocock, of Appo-"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Hon. Thomas S. <mark>Bocock</mark>, of Appo-"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Hon. Thomas S. <mark>Bocock</mark>, of Appo-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.72, 1136.18, 1667.42, 1171.13], "bbox_id": "f87b091677", "file": "AppomattoxNewspapers_1892-1898a_0207.pdf", "page": 1, "text": "Mrs Maggie Bocock of Hampden I manner in which all appeared to dney delighted her many friends I enjoy it fully showed their appreci ire by a short visit last week. I ation."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs Maggie <mark>Bocock</mark> of Hampden I manner"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs Maggie <mark>Bocock</mark> of Hampden I manner"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.54, 518.27, 1863.77, 587.81], "bbox_id": "2dfb308454", "file": "AppomattoxNewspapers_1939-1943a_0527.pdf", "page": 1, "text": "Mrs. John R. Booker hasnt been so well for several days. Miss Lela Mann, of Washington, D. C. visited her mother, Mrs. J. A. Mann recently. We are sorry to hear of the ill ness of Mr. W. P. Bocock."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "of Mr. W. P. <mark>Bocock</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "of Mr. W. P. <mark>Bocock</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1472.41, 235.74, 1638.61, 631.15], "bbox_id": "77ec072aad", "file": "AppomattoxNewspapers_1892-1898a_0217.pdf", "page": 1, "text": "Mrs. IJooocks House Burned. The entire village was startled by the alarm of fire on last Friday. It was soon learned that the alarm was due to the fact that the beauti ful residence of Mrs. Annie H. Bo- cock was on fire. A large crowd soon assembled at the burning build ing ready to do all in their power to save it or its contents, but the fire had gotton too much headway. Only one room could be entered, but for tunately this was the library, which contained the splendid miscellaneous library, one of the best in State collected by the late Hon. Tlios. S. Bocock. The entire library and most of the furniture in the room were saved, but nothing else. The loss to Mrs. Bocock was very heavy. The house was insured, but of course to only three-fourths of  its value, while there was no insur ance at all on the furniture. Mi3. Bococks furniture was veiy handsome, some of it coming from Boydville, the ancestral home of Mrs. Bocock. The alarm was given at 230 p. m. and in twenty five minutes the house was in ashes. Our people deeply sympathize with Mrs, Bocock in her great loss."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "late Hon. Tlios. S. <mark>Bocock</mark>. The entire library and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "late Hon. Tlios. S. <mark>Bocock</mark>. The entire library and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.14, 1427.3, 1509.94, 1592.35], "bbox_id": "784080bab8", "file": "AppomattoxNewspapers_1892-1898a_0219.pdf", "page": 1, "text": "Mrs. Bocock In W asltingaon. The following is clipped from the ra 8 hington Post of Sunday Mrs. ocock, widow of Hon. Thomas S. ocock, of Virginia, is spending a iw days with her sister, Mrs. S. eidleton Fatlkner-Pierce. Mrs. Ocock is a daughter of the late Ion. Charles Jsmes Faulkner, of ie 8 t Virginia, and duriug Mr. Bo- cks long term in Congress, extend- ng over twenty years, was a conspic- ious figure in society, which contiu led to the beginning of the late war."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. <mark>Bocock</mark> In W asltingaon. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. <mark>Bocock</mark> In W asltingaon. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1600.54, 973.4, 1758.46, 1019.39], "bbox_id": "d528343ab9", "file": "AppomattoxNewspapers_1892-1898a_0514.pdf", "page": 1, "text": "Mrs. Annie II. Bocock aud daugb ter, Mrs. Dr. Johnson, of Hainpdem Sidney have been visiting in the countv this week."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Annie II. <mark>Bocock</mark> aud daugb ter, Mrs. Dr. Johnson, of Hainpdem Sidney have been visiting in the countv this week."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Annie II. <mark>Bocock</mark> aud daugb ter, Mrs. Dr. Johnson, of Hainpdem Sidney have been visiting in the countv this week."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [648.52, 631.0, 805.86, 664.5], "bbox_id": "dac5f75638", "file": "AppomattoxNewspapers_1898-1902a_0223.pdf", "page": 1, "text": "Mrs. Annie II. Bocock and hei son Willis are guests at the Hotel Appomattox."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Annie II. <mark>Bocock</mark> and hei son Willis are guests at the Hotel Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Annie II. <mark>Bocock</mark> and hei son Willis are guests at the Hotel Appomattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1527.61, 1348.72, 1688.89, 1466.72], "bbox_id": "c63c3582cf", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "Mrs. Annie H. Bocock, who has been visiting in the county for some days, left this morning for Chase City, where she will stay a few days before returning to her home near Richmond. While here she had a beautiful monument of Vermont marble, plaoed over the grave of her deceased husband. Hon. Thomas Bocock."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark>, who has been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark>, who has been visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.72, 1433.81, 1635.22, 1491.56], "bbox_id": "f74842324b", "file": "AppomattoxNewspapers_1922-1923a_0602.pdf", "page": 1, "text": "Mrs. Annie H. Bocock has been made director for the Arlington Mounment As omation for the State of Virginia. Mrs. Bocock, although quite busy fiuds time to"}, "highlight": {"text": {"matched_tokens": ["Bocock", "Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> has been made director for the Arlington Mounment As omation for the State of Virginia. Mrs. <mark>Bocock</mark>, although quite busy fiuds time to"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> has been made director for the Arlington Mounment As omation for the State of Virginia. Mrs. <mark>Bocock</mark>, although quite busy fiuds time to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1078.34, 755.44, 2275.97, 875.14], "bbox_id": "5ec54d7e0f", "file": "AppomattoxNewspapers_1915-1918a_0019.pdf", "page": 1, "text": "Mrs. Annie H. Bocock Dies. Mrs. Annieo Himes Bocock widow of Thomas S, H as Helped Thousands, Maybe th a t H aitian cyolone blew Bobo away. Bocock, who for a long time was a member of the Federal Con gress at W ashington, and later I Speaker of the Confederate Congress, died Wednesday m orning a t the home of her daughter, Mrs,"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> Dies. Mrs. Annieo Himes"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> Dies. Mrs. Annieo Himes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [386.86, 941.21, 550.8, 988.15], "bbox_id": "6a1d62ee23", "file": "AppomattoxNewspapers_1892-1898a_0515.pdf", "page": 1, "text": "Mrs. Annie H. Bocock and daugh ter, Mrs. Dr. Johnson, of Hainpdem j Sidney have been visiting in the county this week."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> and daugh ter, Mrs. Dr. Johnson, of Hainpdem j Sidney have been visiting in the county this week."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. Annie H. <mark>Bocock</mark> and daugh ter, Mrs. Dr. Johnson, of Hainpdem j Sidney have been visiting in the county this week."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1755.37, 410.64, 1910.52, 515.44], "bbox_id": "8c3145baaa", "file": "AppomattoxNewspapers_1892-1898a_0236.pdf", "page": 1, "text": "Mrs. A. H. Bocock, who has been visiting here and registered at Hotel Appomattox, left Tuesday for her temporary home in Richmond. It will be learned with pleasure that Mrs Bocock will return to West Appomattox and spend the month of July amongst ns. A welcome is ever ready."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. A. H. <mark>Bocock</mark>, who has been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. A. H. <mark>Bocock</mark>, who has been visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.77, 1022.65, 1757.87, 1117.39], "bbox_id": "550172f53b", "file": "AppomattoxNewspapers_1892-1898a_0236.pdf", "page": 1, "text": "Mrs. A. H. Bocock takes this meaus of thanking her friends for the many kindnesses on the occasion of the destruction of her home here in West Appomattox some time since, and for the efforts of all who en deavored to save her house and its contents."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "Mrs. A. H. <mark>Bocock</mark> takes this meaus of"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "Mrs. A. H. <mark>Bocock</mark> takes this meaus of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
