{"document": {"bbox": [122.14, 858.87, 398.59, 904.37], "bbox_id": "9d4c622175", "file": "TimesVirginian_1976_0159.pdf", "page": 1, "text": "ywiffoMdScott Insurance office in the Bryant and -Branch Building, one mile west of Appomattox for your car, homeowners, or business, insurance. We dont sefi you insurance  we help yopbuyiL  . - ,"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "ywiffoMdScott Insurance office in the <mark>Bryant</mark> and -Branch Building, one mile west of Appomattox for your car, homeowners, or business, insurance. We dont sefi you insurance  we help yopbuyiL  . - ,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "ywiffoMdScott Insurance office in the <mark>Bryant</mark> and -Branch Building, one mile west of Appomattox for your car, homeowners, or business, insurance. We dont sefi you insurance  we help yopbuyiL  . - ,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2448.64, 348.34, 2572.34, 684.22], "bbox_id": "65a21373f2", "file": "TimesVirginian_1976_0392.pdf", "page": 1, "text": "your house on fire? Is someone bleeding badly? Has someone had a heart attack? 3. Tell who you are. This is important where the emergency is not obvious from the outside, especial ly in an apartment house. Also, a neighbor is more likely to know your name than your number. OFFICE HOURS Monday thru Friday - 815 am , to 515 pjn. Saturday 800 am . to 1230 p.m. T hii information h os! been brought to you ao a public service by SCOTT INSURANCE, Bryant  Branch Building on Route 460, Appomattox. Phono 352-7443. See Ann Rey nolds. S C O T T IN S U R A N C E"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "service by SCOTT INSURANCE, <mark>Bryant</mark>  Branch Building on Route"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "service by SCOTT INSURANCE, <mark>Bryant</mark>  Branch Building on Route"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [756.29, 1591.77, 1060.06, 1836.12], "bbox_id": "2e13198b67", "file": "AppomattoxNewspapers_1926-1933a_0093.pdf", "page": 1, "text": "You will be served quickly and courteously at the following stations Appomattox Motor Co. R. C. Moores Service Station Moses Motor Co. Sherwil! Mercantile Co. W-T. Cross, Cross Bros., W. E. Drinkard.ConcordDeoot W. E, Dickerson. Spout Spring P E. B. Martin, Oakville T. M. Martin H R. Moore, Beckham E. P. Tanner, Stonewall E. P. Taylor Mrs. Ida Marks A. M. Bryant W. W. Thornhill W. D. Hix  Co., Hixburgv9kS4- R. D- Baldwin a Staple Bros  - Harvey Bros.  Appomattox Hardware .Distributors BH a a m iM n n iH a ra ii I"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Ida Marks A. M. <mark>Bryant</mark> W. W. Thornhill W."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Ida Marks A. M. <mark>Bryant</mark> W. W. Thornhill W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1840.1, 611.45, 1988.12, 1046.94], "bbox_id": "69aa7c347a", "file": "AppomattoxNewspapers_1962-1965a_0615.pdf", "page": 1, "text": "You also must be ready for the Son of man is coming at an hour you do not expect. Matt hew 2444. Mrs. Comer Baldwin visited Mrs. M,ary Sizemore and her patients on Saturday. Visiting in the home of Mrs. Pearl Rand last week were Mrs. Margie Beale and son .Robert, Mr. and Mrs. Robert Tolley, Mr. Irving Bushey, and Mr. and Mrs Sherma nBushey. Mrs. Edith Tolley and Mrs. Clara Cumby visited Mr. Harry Stone in the Lynchburg General Hospital Sunday. Sunday guest in the home of Mr. and Mrs. J. L. Meadows were Mr. and Mrs. Basil Bryant and four daughters, Wanda Sue, Betty Jean, Bonnie Ray, and Lisa Dawn, of Cullen, Mr. and Mrs. John Edwards and three children, Jane, Johnny, an dJan- et, of Charlotte Court House, Miss Peggy Garrette and Mr. Tony Mann. Guests in the home of Mr. and j Mrs. Fred Mathis over the week end were Mr. and Mrs. Duval Brooks and daughter, Cindy, of Woodbridge. Mr. Charlie Williams called in the home of Mr. and Mrs. Mack Coleman and Mr. Dan Woold ridge on Sunday. Visiting hi the home of Mr. and Mrs. Robert Tolley Sunday were Mr. and Mrs. Lester Price,  Mr. and Mrs. Irving Bushey and three daughters, Gloria. Hazel, and Pamelia, all of Richmond,  Mrs. Eva Gqjll and daughter, j Sharon Kay, of Appomattox, Mr. ! and Mrs. Neal Chemault and"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Basil <mark>Bryant</mark> and four daughters, Wanda"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Basil <mark>Bryant</mark> and four daughters, Wanda"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [781.43, 1588.05, 1088.54, 1814.16], "bbox_id": "d29dd780bd", "file": "AppomattoxNewspapers_1908-1909a_0094.pdf", "page": 1, "text": "Yoh will be served quickly and courteously at  the following stations  _ __  Appomattox Motor Ctt. - fi R. C. Moores Service Station fC Moses Motor Co.  uj Sherwil? Mercantile Co.  9 W- T. Cross Cross Bros., W. E. Drinkard.ConcordDepot 9  W.-S, Dickerson. Spout Sprin 7  4 E. B. Martin, Oakville 3h T. M. Martin  H R. Moore, Beckhfc  E. P. Tanner, Stonewall r B. P. T a j i - l o r  Mrs. Ida Marks 4 -  f 5    . A. M. Bryant in W. W. Thornhill -  ,  W. D. Hix  Co., Hixburg ffl .. y A  fow jlgEmXffi.  Dj Staple Bros y , 3 . Haaey Bro.fc 4 . . . . 1 Appomattox Hardware D istributors"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "f 5    . A. M. <mark>Bryant</mark> in W. W. Thornhill"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "f 5    . A. M. <mark>Bryant</mark> in W. W. Thornhill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.43, 231.7, 1811.5, 1257.61], "bbox_id": "825fbf2d7e", "file": "TimesVirginian_1976_0445.pdf", "page": 1, "text": "Yn execution of a certain deed of trust from Spear Mountain Associates, a Virginia limited partnership, to W illiam I. Bandas and Walter F. W itt, Jr., Trustees, either of whom may act, dated October 9,1973, and recorded October 9,1973, in the Clerks Office, Circuit Court of Buckingham County, Virginia, ih Deed Book 91, page 368, and recorded on October 9,1973, in the. Clerks Office, Appomattox Circuit Court, Virginia, in Deed Book 114, page 241, and rerecorded on October 11,1978, in the Clerks Office, Appomat tox Circuit Court, Virginia in Deed Book 114, page 263 default having been made in the payment of the debt therein secured and being required to do so by the noteholder, the undersigned sole acting trus tee, after giving fourteen days due notice to the owners of the real estate of the date, time, place and terms of sale, will offer for sale at public auction a t . the front door of the courthouse of the Circuit Court of Buckingham County, Vir ginia, on December 31,1976, at 1200 Noon, three parcels of real estate, the first being designated as Parcel A on the aforesaid Deed of T rust, containing 752.06 acres as shown on a plat of survey by Carroll Gillispie, C.L.S., S.B.C., dated April 28, 1961 and recorded April 9, 1968, in the Clerks Office, Circuit Court of Buckingham County, Virginia, in Deed Book 70, page 166, and also recorded in the Clerks Office, Circuit Court, Appomat tox County, Virginia, in Deed Book 78, page 24 the second being designated as Parcel B on the aforesaid Deed of Trust, containing 96.2 acres as shown on plat of survey by Carroll Gillispie, C.L.S., S.B.C., dated October 28, 1969 and recorded March 13, 1970, in the Clerks Office, Circuit Court, Bucking ham County, Virginia, in Deed Book 82, page 145 and the third being designated as Parcel C on the aforesaid Deed of Trust, containing 198 acres, more or less, as shown on plat of survey made by Carroll Gillispie, C.L.S., S.B.C., dated September 16 and 20,1970, and March 7,1971, and recorded in the Clerks Office, Circuit Court, Buckingham County, V irginia, with . the deed iecoE i Iped Book 90, page 297 ml of said parcels being more particularly described in the aforesaid deed of trust to which reference is hereby made. This sale is subject to a first deed of trust on Parcel C from Clayton C. Bryant and Virginia W. L. or Lee Bryant, his wife, to W. M. Abbitt and Williams S. Kerr, Trustees, dated Jutoe 4, 1973, and recorded June 14, 1973, in the Clerks Office, Circuit Court, Buckingham County, Va., in Deed Book 90, page 300, in the original amount of 25,000.00 and interest. Terms of Sale Cash A bidders deposit of 10 may be required. This Trustees Auction Sale was previously scheduled to be held at 1200 noon on December 3,1976."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "C from Clayton C. <mark>Bryant</mark> and Virginia W. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "C from Clayton C. <mark>Bryant</mark> and Virginia W. L."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.79, 620.58, 1795.08, 1764.11], "bbox_id": "d5c9631de0", "file": "AppomattoxNewspapers_1905-1912a_0243.pdf", "page": 1, "text": "Yet wbil I am writing this, with I the beautiful flakes of snow fast carpeting the earth, l behold per -1 sons, all covered with the falling I flakes hauling wood for fires. Wei do not all heed the admonition pre- pare for war in time of peac. I  From appearances, at this writing,! by morning next, we will have a I deep snow. A very uncalled for difficulty oc-  enrred between two colored men in this village last Monday morning,! and came near being a very serious affair, as far as the two participants, are concerned. George Jenkins, the I blaeksmith here, complained of his I idmghter, who married Buck ! Neighbors, a driver for Mr. A. O.J Garnett, Jr., for not giving him hie I share in a hog which he claimed to I be the owner of, but which was ini the pen at the home of said Neigh-j I bora, and which Neighbors had I butchered, along with a hog of his I own, about which there was no dia- I pnte, and Jenkins daughter, the I wife of Neighbors, became very I much incensed with her father on I account of hie remonstrance with I 1 her for the way in which she andl I her husband had treated him in rei I I garif to the hog, and sent in postl I b wte over to the home of A. C.l I Garnett, Jr., where Neighbors was! I at work, for him to come and resent I I the wrong. Neighbors undertook j I to take Jenkins to taw, for the way I he talked to his wife, when they Lot into a fiht. Neighbors got se- I verely beat about the head with a 1 pair of horse shoes in the hands of Jenkins, and after being separated bv E. 8 . Lomax, Jenkins threw  rock at Neighbors, striking him over the eye, which pnt him out of I it for a while, although it did not! knock him down. Neighbors swore 1 lout a warrant against Jenkins, ttael result of which Jenkins was fined 10 00 and sentenced to 30 days inj jiil. He app aled to the Circuit Court. Neighbors was incapacitat- I cd for work for several days. I The deer season is over, ard not many pelts are to the credit of tie I hunters hereabouts. Mr. Branch I Rosen and Mr. Charley Rosen, the j two sons of Mr. C. R. Rosen, sac-1 I ceeded in slaying one a piece during! I the season. Mr. Branch Rosen kil-l I ied quite a nice doe on Thanksgiv-1 ling D a y  and Mr. Charley Rosen 1 killed a small fawn several days thereafter. Mr. W. H. Miles killed one and the oldest son of Mr. Willie Sprouse killed one some weeks ago. Theee are all we have heard of be ing killed in this neighborhood. I Rev. John J. Spencer performed the marriage ceremony for the fol lowing parties very redently On Dc. 2nd at Buckingham he united!  Mr. Wingfield A, Hopkins, of  Prinoe Edward Coonty, and Miss  Ethel Harvey on the 4th inst. he  joined Mr. D. P. Harris, of Appo mattox, and Miss Minnie A. Carter, the daughter of the late J. E. Car ter, at Buckingham, and in the evening of the same day he married I ttt the home of the brides parents, near Toga, Va., Mr. Van B. Day I land Miss Nannie L. Bryant, the daughter of Mr. W. J. B yant. I Tmiy these are days like onto those I of the time of the ark building. I They are still marrying and giv- ling in marriage. And it will still I be so when time is merging into I eternity. I Xrs. Dr, Nowlin is making pre- iparaUoos te remove te Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "land Miss Nannie L. <mark>Bryant</mark>, the daughter of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "land Miss Nannie L. <mark>Bryant</mark>, the daughter of Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [305.04, 254.55, 450.04, 925.27], "bbox_id": "c7ca5b4566", "file": "AppomattoxNewspapers_1974-1975a_0495.pdf", "page": 1, "text": "Yes, the Raiders with a 7-0 record after a 33-6 victory over Nelson are 1 in the Seminole district. We saw a lot of action from the Raiders in last Fridays game when they seized their 7 straight win over the Gover nors. Reynolds in the first quarter carried the ball 39 yards for the Raiders and came 1 yard from the score. Nelson held the Raiders from scoring. Both Reynolds  Trent moved the ball into good position for the Raiders  with 251 left in the 2nd period of play Trent went through standing up to make the first score of the game. Coleman making the P.A.T. on a kick, gave the Raiders the first lead of 7-0. All of the Raiders defensive plays helped to shut-out Nelson from scoring in the first half. At halftime the Raiders had 10 first downs and Nelson only had 3. Wouldnt you say the Raiders defense did a terrific job? After a delightful halftime showing by Nelsons Homecom ing activities, it was time once again for football. And football it was When with 637 left in the third quarter, Trent broke through the middle and galloped 67 long yards to set the Raider fans wild! Coleman again split the uprights for the P.A.T. The Raiders were now out front 14-0. It was not long after that when Trent, on the same play, carried the ball 55 yards to score his third TD for the game. Tommy Bryant, the kicker for the Raiders, put his foot into one and backed the Governors receiving team into the end zone. Bryant has done a tremendous job this season for the Raiders. Reynolds would have had the 4th score for the Raiders but a penalty of illegal procedure called the touchdown back. Reynolds played a good game and is a strong link in the Raiders offensive chain."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "for the game. Tommy <mark>Bryant</mark>, the kicker for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "for the game. Tommy <mark>Bryant</mark>, the kicker for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [579.65, 514.31, 723.92, 673.61], "bbox_id": "f7cf242309", "file": "TimesVirginian_1976_0264.pdf", "page": 1, "text": "Yeatts, Josephine Walton, Phyllis Perdieu Robertson, and Shirley Austin Harvey fourth row, left to right, Jimmy Harris, James Slagle, J. C. Lewis, Bobby Phelps, Ray Page and Tandy Harris and on the fifth row, left to right, Bobby Bryant, Malcolm Blackwell, Ralph Smith, Sam Davidsdn, and Marshall Harris. Not available .for picture were Howlette B. Martin, Jr., and Mrs. Frances Cheatham, teach er."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "left to right, Bobby <mark>Bryant</mark>, Malcolm Blackwell, Ralph Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "left to right, Bobby <mark>Bryant</mark>, Malcolm Blackwell, Ralph Smith,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.57, 240.0, 1711.06, 479.94], "bbox_id": "d95a5edbc8", "file": "TimesVirginian_1981a_0071.pdf", "page": 1, "text": "years past. Archer ldtt five high scoreres from last years boys team - Robert Harding, Scott Stevens, Jeff Bryant, Luis Garcia and Kenny shorter. In addition, four high-scoring girls from the R aiderette team Lori Mitchell, Kathy Lewis, Dana White and Vinnie Hubbard - will also be absent from this years team. But the team will have a host of returnees from last years squads, and there are several impressive first-year athletes, as well. Jack Williams mile and two mile and Jeff Fanney hurdles and running events, both freshmen, have been very impressive in practice, accord ing to Archer. He adds that"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Harding, Scott Stevens, Jeff <mark>Bryant</mark>, Luis Garcia and Kenny"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Harding, Scott Stevens, Jeff <mark>Bryant</mark>, Luis Garcia and Kenny"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2062.09, 311.17, 2226.92, 391.97], "bbox_id": "9b4a67c6b7", "file": "AppomattoxNewspapers_1955-1957a_0126.pdf", "page": 1, "text": "Ye ngret to report that Mr. L. V. Bryant passed away last night. He was a patient at McGuire Hos pital, Richmond. We express sympa thy to the bereaved family. Funeral arrangements have not been miade as we go to press,"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "that Mr. L. V. <mark>Bryant</mark> passed away last night."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "that Mr. L. V. <mark>Bryant</mark> passed away last night."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.32, 233.02, 1870.4, 606.16], "bbox_id": "b1e6cfd19f", "file": "AppomattoxNewspapers_1971-1973a_0412.pdf", "page": 1, "text": "Ye Belong to Christ. Mark 941 The week end visitors of Mr. and Mrs. E. B. Wheeler were Mr. and Mrs. J. R. Fer guson, Sr. of Appomattox, Mr. and Mrs. Ben Whe el er and Tommy, Mr. and Mrs. H. B Jones and family, Mr. and Mrs! Laurence Wheeler of Lynchburg Mr. and Mrs. Bob Wheeler, Steve, Linda, and Becky of Rich mond. Mrs. Nina Caldwell and Mrs. Elsie C a l d w e l l were supper guests at a cook out at Mr. and Mrs. Earl Harris Sunday night. She entertained Mr. and Mrs. Don Kaeding, Mrs. James Jordon, Larry and Robert. Miss Kathy Jones spent the week end with Miss Denise Keading at the home of the Wheelers. Mrs. Roy Bryant is in Char lottesville hospital. Mr. and Mrs. Virgil Moore Miss Sue Moore, Mr. Wayne Phelps, j. e . Herndon went on a fishing trip to N. C. Sat urday. The church picnic at Hebron was well a t t e n d e d i Saturday night. Mr. and Mrs. Phil Harrison"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "the Wheelers. Mrs. Roy <mark>Bryant</mark> is in Char lottesville"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "the Wheelers. Mrs. Roy <mark>Bryant</mark> is in Char lottesville"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [431.28, 725.62, 575.59, 1014.0], "bbox_id": "36dd0072ae", "file": "AppomattoxNewspapers_1962-1965a_0418.pdf", "page": 1, "text": "Ye are of God, little children, and have overcome them be cause greater is he that is in you, than he that is in the world I John 44. Week end guest in the home of Mr. and Mrs. J. L. Meadows were Mr. and Mrs. Bob Lewis and two sons, Robbie and Bennie cf Warminister, Penn. Mr. and Mrs. Hurbert Peters and three children, Ricky, Jan, and Ken, Mrs. Linda Peters, of Richmond, Mr. and Mrs. Jack Williams and daughter, Diane, cf Appomattox Mr. and Mrs. Basil Bryant and four daughters, Wanda Sue, Bet- tv Jean, Bennie Ray and Lisa Dawn, Mr. and Mrs. Hugh Bry ant and two children, Chuck and Joanne, all of Cullen Mr. and Mrs. John Edwards and two chil dren, Jane and Johnny, of Char-1 lotte Court House Mr. Clinton,1 Arrington, Mrs. Vester Clifton and son, Tony, Mrs. Walter Wil liams, and Mr. and Mrs. Divalo Garrette and daughter, Peggy. Visiting in the home of Mrs. Clara .Cumby were Mr. Frank"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Basil <mark>Bryant</mark> and four daughters, Wanda"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Basil <mark>Bryant</mark> and four daughters, Wanda"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.52, 753.01, 1822.3, 1056.53], "bbox_id": "d11c767641", "file": "AppomattoxNewspapers_1971-1973a_0110.pdf", "page": 1, "text": "yard pass in the first quarter, hurled the ball to Bob Weather ly who went 65 yards for a crowd -roaring TD. Dillard Reynolds then passed to R.B. Carter for the extra point. Again in the 1st quarter,Dil lard Reynolds passed to Tommy Bryant from 15 yards out and Bryant swung over the goal line. Run for the extra point was no good, but there was no stopping the T-Rebels from then on. In the 2nd quarter it was Tom my Bryant again for a TD from four years out. The run failed. In the 3rd quarter Dillard Reynolds faked a pass, kept the ball, and ran 75 yards for the third TD. Pass effort for extra points failed. Theres just no way to count up the team effort and spirit these boys had. They were up against a bigger team and it was really spirit that counted all evening. Fans helped the team, too, by cheering with the T-Reb"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Reynolds passed to Tommy <mark>Bryant</mark> from 15 yards out"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Reynolds passed to Tommy <mark>Bryant</mark> from 15 yards out"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [536.88, 739.46, 2066.92, 862.56], "bbox_id": "eab2182b6a", "file": "TimesVirginian_1984a_0152.pdf", "page": 1, "text": "X fiS A W h V S fà . G a l i l e e C h u r c h n e w s n o t e s Mir. Bryant Junior Nowlin, and Miss W endy M itchell w ere united in m arriage A p ril 29. A beautiful, v well-attended reception followed In Brookneal 1 4 M rs. Esther Bradley has returned to her lumie after spending t a n time in Richmond with her sister, who is HI there. We continue to pray for the sick and shut-in everywhere."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "t e s Mir. <mark>Bryant</mark> Junior Nowlin, and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "t e s Mir. <mark>Bryant</mark> Junior Nowlin, and Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1342.33, 304.51, 1722.17, 525.05], "bbox_id": "6a0e39e947", "file": "TimesVirginian_1983a_0350.pdf", "page": 1, "text": "x. A number of arts and craftsmen will Baby Bibs Mr. Barry Sauls, Jtegiving demonstrations of their work Appomattox Forging Demonstration - during mis weekends annual Historic Middle School FFA M aking Pokers Appomattox Railroad Festival. Mrs. Joanne Rothemieh, Herbs and  Good Ole Days participants Dried Materials Mr. Marie Evans, include Ms. Elizabeth Strippy, artist Knobbita Root Carvings Mrs. Veras s p r. and Mrs. Jimmy Ellis, Fried Pork Conner, tabs. Thelma Comber, Quilting 3tinds Mr. C. B. Rush, Hand Pressed Mr. Robert Burgess, M aking 17th and .Apple Cider Mrs. Barbara Mont- 18th Century Firearms Mr. Ernest Som ery, Park Service Wives Exhibit Campbell, One lunger gasoline motor in d Table Mrs. Wanda Lively and Barbara McClain, V oddridge Green- -frs. Shelby Tuck, Quilt Making house. Dried Herbs, Potpurri, Make- -Mrs. Pearl Mitchell, Soap Making Your-OwnType Demonstration Mr. Harold Hulbert. Bob Coffee, Music, Saturday, 100 - Basket Weaving Mrs. Dot Paulette, 300 P.M. ZDean Page, Music - Brooms from Broomsedge Mrs. Sarah Saturday 1100 A.M. -100 P.M.Tom Cuccio, Candlewicking and Fabric Shupe - Music- Sunday 100 - 300 Painting Mrs. Patty Loukides Mrs. Mrs. Alva Almond, Fire lighters aind Christine Davis, Chrir Seat Weaving. QuiltiM with Park Service wivesMrs.  Abo Mrs. Charles Baldwin, Lye Kim Moore, Smocking Mr. Curly xoap. Handmade Pillow Cases and Bryant - Music, Saturday 300 - 500"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Handmade Pillow Cases and <mark>Bryant</mark> - Music, Saturday 300 - 500"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Handmade Pillow Cases and <mark>Bryant</mark> - Music, Saturday 300 - 500"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [182.4, 961.65, 392.47, 1004.55], "bbox_id": "47bc7b6317", "file": "TimesVirginian_1981a_0355.pdf", "page": 1, "text": "Wright 8. ry Floyd 4 Clayton Bryant 2. Chulo Bar-Ronnie Wright 8. Copper Bottom-Liny Floyd 4 Mes- quite-Mariise Yeung  Sunny-"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Wright 8. ry Floyd 4 Clayton <mark>Bryant</mark> 2. Chulo Bar-Ronnie Wright 8. Copper Bottom-Liny Floyd 4 Mes- quite-Mariise Yeung  Sunny-"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Wright 8. ry Floyd 4 Clayton <mark>Bryant</mark> 2. Chulo Bar-Ronnie Wright 8. Copper Bottom-Liny Floyd 4 Mes- quite-Mariise Yeung  Sunny-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2267.75, 378.78, 2407.05, 419.98], "bbox_id": "4585f7070e", "file": "AppomattoxNewspapers_1971-1973a_0219.pdf", "page": 1, "text": "WOULD like small children to keep in home while parents work. Mrs. Hal Bryant. 352- 7806. 2-10-2p"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "WOULD like small children to keep in home while parents work. Mrs. Hal <mark>Bryant</mark>. 352- 7806. 2-10-2p"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "WOULD like small children to keep in home while parents work. Mrs. Hal <mark>Bryant</mark>. 352- 7806. 2-10-2p"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [823.21, 1261.02, 962.01, 1302.47], "bbox_id": "24ed3cdbdf", "file": "AppomattoxNewspapers_1971-1973a_0211.pdf", "page": 1, "text": "WOULD like small children to keep in home while parents work. Mrs. Hal Bryant. 352- 7806. 2-10-2p"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "WOULD like small children to keep in home while parents work. Mrs. Hal <mark>Bryant</mark>. 352- 7806. 2-10-2p"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "WOULD like small children to keep in home while parents work. Mrs. Hal <mark>Bryant</mark>. 352- 7806. 2-10-2p"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1907.72, 207.49, 2035.42, 319.78], "bbox_id": "af7adaea07", "file": "TimesVirginian_1980a_0124.pdf", "page": 1, "text": "worthy matron Edward Ranson, worthy patron Eloisè Bryant, associate matron Horace Coleman, associate patron  Virginia Vaughan, secretary Florence Ranson, treasurer Ruth Patterson, conduc tress Lucy Garrett, chaplain  Edith Tolley, marshall Martha"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Ranson, worthy patron Eloisè <mark>Bryant</mark>, associate matron Horace Coleman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Ranson, worthy patron Eloisè <mark>Bryant</mark>, associate matron Horace Coleman,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [493.43, 743.76, 638.48, 1028.05], "bbox_id": "d598064d6f", "file": "AppomattoxNewspapers_1971-1973a_0121.pdf", "page": 1, "text": "worn mantilla style. Miss Jill Kidd of Lynchburg, cousin of the bride, was maid of honor. She wore a slipper len gth gown of jade green chiffon with a mandarin neckline and long, full sleeves. Thehighrise waist was defined by matching embroidered floweets and she wore a short bouffant veil of moline. Von malinej Attendants were Mrs. John P. Alvis, HI, of Concord, sis ter-in-law of the groom Mrs. Owen Davidson, of Christians- burg, cousin of the groom and Mrs. Nelson Harvey of Rust burg, and Mrs, Lewis Bryant Jr., of Lynchburg. Their dres ses were the same as that of the honor attendant. Flower girls were Miss Ann Fletcher of Rustburg, cousin of the groom. Both wore slipper length dresses of candle-light chiffon accented with jade green"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "burg, and Mrs, Lewis <mark>Bryant</mark> Jr., of Lynchburg. Their"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "burg, and Mrs, Lewis <mark>Bryant</mark> Jr., of Lynchburg. Their"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [139.21, 651.29, 424.49, 1165.52], "bbox_id": "ebfff54fc8", "file": "TimesVirginian_1976_0235.pdf", "page": 1, "text": "WORKING DOG CLASS - Dick Bland of Lawaoo Ford, left above, is shownawmrding trophy to Luann Crain, winner in .WerUagk Dog Claes at thé 4-H Dog Show held June 10. Mrs. Nancy Pancoast, judge, looks on. , 4-HDog Show Held Jane Guiiis Promeianian Tiffany was named Best in Show held Thursday evening, June 10 on the Appomattox School Football Field. Janes dog also was top winner in . the Toy Dog Class add received a fifth place ribbon in the Grooming Class. whewrifrW Thirty 4-ITers exhibited dogs in the .show which is sponsored by Lawn Ford. Mr. Dick Bhind. Sàlesl Manager o f Lawson Ford awarded trophies to the top winnersin each of thé twelve différent classes. Rib bons through 5th place were .lsaadhfxledi? etehëfttes. Winders in  each of the classes and other exhibitors were as . follows  Sporting Dsgslst Chad Deavers Ho unds 1st Darrell Moore, 2nd Mike Marshall, 3rd Ed McCo 4th Dawn Rosser Washing D aft! m -rufflhT raih, 2ndf Lori. JMitcheil.. 3rd .John Jimison, 4th Dale Robertson, 5th Bobbie McFaden. Others in Class Mary Everly, Lisa Coleman, Lisa Mitchell, Kim t Maxwell, Dana White, and  Laura Avery. Tey Begs 1st Jane Guill, 2nd Laurie MéLean, 3rd Kelly Moore, 4t Ricky v Mayberry, 5th Tim TJfiOry. Others in class Maria King and Chris Mooris. Terriers 1st Jay Whitehead, 2nd Mary..,Lee Bryant. Neo-Sporting Dogs 1st t Karen Fitzgerald, 2ndt p é"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Jay Whitehead, 2nd Mary..,Lee <mark>Bryant</mark>. Neo-Sporting Dogs 1st t"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Jay Whitehead, 2nd Mary..,Lee <mark>Bryant</mark>. Neo-Sporting Dogs 1st t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1390.48, 1064.95, 1544.33, 1382.5], "bbox_id": "b6c23542ad", "file": "TimesVirginian_1978_0379.pdf", "page": 1, "text": "Workers Needed -ps,  -The Appom attox Junior Womans Club takes care of a great deal of obtaining volun t a r workers for the bloodmo- bile visits. -The list below is for your information. If you have some Üee time and would like to volunteer to help please call any one of these club members listed. If they have enough wqrkers for this visit they will tike your name and telephone number and call you another ttne. Name, Pam Bryant, Duty, , Nurses, 852-8769 Debbie Wil-  lfrma, Typist, 352-8104 Mary Jaggars, Nursery, 352-5665 B etty Jo Sm ith, Canteen, 852-8496 Arlene S tratton, labelers, 352-8493.  Linda Jo Mays is Health Dpt. Chairman and Carolyn Thompson is president of, the Junior Womans Club. Thanks club for doing such a fine job."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "another ttne. Name, Pam <mark>Bryant</mark>, Duty, , Nurses, 852-8769 Debbie"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "another ttne. Name, Pam <mark>Bryant</mark>, Duty, , Nurses, 852-8769 Debbie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2208.53, 1761.36, 2654.78, 1814.11], "bbox_id": "6bb707bbb4", "file": "TimesVirginian_1981a_0112.pdf", "page": 1, "text": "WORKERS AT TllE AMELIA Garment factory In pampHn ere. treated to an Easter egg hunt by plant manager Jinn Webb and George Allen. Winners In the hunt shown above are tfrom left stan ding Sandra Elder, Shelby Bryant, Vivian Jones, Wanda Vaiidergrift, Louise Rqsser, and Nancy Vancerveer. The grand winner in the hunt, shown kneeling in front, was Brenda Brinkley. Webb said more. than 360 eggs were hidden for the 47 employees to hunt. i"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "ding Sandra Elder, Shelby <mark>Bryant</mark>, Vivian Jones, Wanda Vaiidergrift,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "ding Sandra Elder, Shelby <mark>Bryant</mark>, Vivian Jones, Wanda Vaiidergrift,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1383.09, 1262.31, 1760.96, 1334.26], "bbox_id": "30c24cacff", "file": "TimesVirginian_1984a_0142.pdf", "page": 1, "text": "WOODMBI OF THE I I Clayton C. Bryant 1  WORLD  -1   LAW 9 ÇO. I 352-7766"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "WOODMBI OF THE I I Clayton C. <mark>Bryant</mark> 1  WORLD  -1   LAW 9 ÇO. I 352-7766"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "WOODMBI OF THE I I Clayton C. <mark>Bryant</mark> 1  WORLD  -1   LAW 9 ÇO. I 352-7766"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1801.67, 210.0, 2044.73, 1002.73], "bbox_id": "33cf76ba88", "file": "TimesVirginian_1980a_0361.pdf", "page": 1, "text": "Woodall, Greg Woodall, Mrs. Madeline Inge, Mr. Joe Goin, Mr. and Mrs. Kenneth Deaner and family, Mr. and Mrs. Thomas Woodall and Lisa, Rev. Dan Menser, Mr. and Mris. Bill W atson, William and April Watson and Mrs. Mary Bagby. Mr- Benjamin Beasley of Midlothian, Va. visited his mother, Mrs. Virgie Beasley Tuesday. Mr. and Mrs. Lawrence Woodson spent Tuesday with Mr. and Mrs. L. L. Webb and family. Mr. and Mrs. L. L. Webb visited Mr. John Webb and Mrs. Mattie Austin Thursday at the hospitals in Lyncburg, Mr. and Mrs. L. H. Watson Sr. carried Mr. R. G. Austin and Tom to see Mrs. Austin at the B aptist Hospital Thursday. Mrs. Madeline Inge called in the home of Mrs. James Mawyer and family last week, Mr. and Mrs. Henry Covington, Mrs. Thomas Woodall and Mrs. Mary Bagby visited Ms.  Inge Tuesday, Mr. and Mrs. Arnold Childers, Mr. and- Mrs. Frank Inge and daughter, Dana visited Mrs. Inge Sunday. - Mr. Vernon Torrence was a visitor of his mother, Mrs. J. L. Torrence Sunday night. Visiting Mr. and Mrs. Robert Coleman last week and Sunday were Mr. Joe Goin, Mr. Richard Carter, Mr. Orie Millner and Mr. and Mrs. Calvin Smith. Master Keith Webb spent Friday night with Mr. and Mrs. Marshall Goin and family. Mr. Lightfoot .Bryant visited Keith Saturday. Mr. and Mrs. Jim Craft of Fincastle, Va. and Mr. and Mrs. Willie Craft and Krista were visitors Saturday of Mr. and Mrs. Monroe Webb. Mrs. Webb visited Mr. John Webb Friday at the Lyn chburgGeneral Hospital. Mr. and Mrs. Arnold . Childers and Mrs. Madeline Inge were visitors Sunday of Mr. arid Mrs. Henry CATTLE Slaughtered  Processed  Quick frozen BYEXPERIENCED r W a M EAT CUTTERS"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and family. Mr. Lightfoot .<mark>Bryant</mark> visited Keith Saturday. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and family. Mr. Lightfoot .<mark>Bryant</mark> visited Keith Saturday. Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.09, 168.2, 2183.48, 366.84], "bbox_id": "6891ce9210", "file": "AppomattoxNewspapers_1974-1975a_0354.pdf", "page": 1, "text": "Woodall and Lisa spent a couple of day last week in Richmond. Mr. and Mrs. Bennett Gilliam and Mr. and Mrs. Leslie Turns of FarmviUe, and Mrs. W. T. Covington were supper guests of Mr. and Mrs. Robert Coleman recently. ____ Rev. and Mrs. Otis Smith had their grandchildren, Bryan and Heath Smith of North Cardins, spend last week with them. Mr. and Mrs. K enneth Deaner and girls spent the week end in Salem with Mr. and Mrs. Bryant Walker. Mr. and Mrs. L. L. Webb visited Mr. and Mrs. H. W. Jenkins last week."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "with Mr. and Mrs. <mark>Bryant</mark> Walker. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "with Mr. and Mrs. <mark>Bryant</mark> Walker. Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [624.25, 851.06, 763.55, 892.51], "bbox_id": "750d83c690", "file": "AppomattoxNewspapers_1971-1973a_0085.pdf", "page": 1, "text": "WOOD RANGE - Also Floor Furnace -Both in good condi tionSee Alfred Bryant, Vera, Va. 10-21-lp"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "WOOD RANGE - Also Floor Furnace -Both in good condi tionSee Alfred <mark>Bryant</mark>, Vera, Va. 10-21-lp"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "WOOD RANGE - Also Floor Furnace -Both in good condi tionSee Alfred <mark>Bryant</mark>, Vera, Va. 10-21-lp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [195.35, 1369.25, 353.79, 1452.9], "bbox_id": "b3d1d65e0f", "file": "AppomattoxNewspapers_1922-1923a_0466.pdf", "page": 1, "text": "Woman Indicted For Murder. Chattanooga, Tenn. Special.At Cookeville the Grand Jury returned a true bill again W. S. Bryant and Mrs. Sadie Vestal, charging them Jointly with the murder of Chalmers Vestal at Baxter last February. Mrs. Vestal stood high in society in the county before Vestal was killed."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "bill again W. S. <mark>Bryant</mark> and Mrs. Sadie Vestal,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "bill again W. S. <mark>Bryant</mark> and Mrs. Sadie Vestal,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.05, 1073.0, 614.95, 1568.43], "bbox_id": "8b7fe22d2e", "file": "AppomattoxNewspapers_1918-1922a_0620.pdf", "page": 1, "text": "Wm. Garrett, labor _ ____ _ __ _ ___ _ _______ 12733 Fred Doodley, labor ___________ __ _ ____ ____ 788 John Ferguson, la b o r _________ ZZZZZZZZZZZ!  i 5fion Hall Bryant, la b o r _________ _ ___________________ lkoo Hubert Gallaher, la b o r _________ _______________ ZZZZZZZZZZZZZZ 5053 T. S. McNally, road foreman, care of team and incidental expensesZZ 783.56 Buck Wells, labor _ ___________________________________ _ 106.01 H. M. Burge, feed, supplies, A c . ________ ZZZZZZZZZZZZZZZZZ 568 79 D. R. Puckett, blacksmith w o rk _________________________ ZZZZZZ 1900 Appomattox Hardware Company, supplies _________________ _ _ _ 126.31 R. F. Burke, Treasurer, for draft for feed...____________________  13200 Jesse T. Jennings, dragging road _ ________________________ Adams Bros.-Paynes Co., culvert p ip e __________ W. H. Jones, lum ber ___ . . . __ _ _____________ ZZZZZZZZZZZZZZZZZ. Earl Harris, la b o r _____________ _______ ZZZZZ A. W. Jones, work on ro ad _ _ ___ ZZZZZZZZZZZZ Buck Doss, labor _ ___ _ _ _ _ __ ______ ZZZZZZZZZZZZZZZZZZZZZ L. E. Smith A Bro., chop and corn _ _ _ ______ C. A. Flowers, blacksmith account __ of Appomattox, for drafts for feed Z __ Z.ZZZZZZZZZZZZZZZZZZ 4w.   E Smith, salary as member Road B o ard ____________________ 183.00 W. Smith, one-third salary as clerk Road Board _______ ____ Z 3334 I . A. sm ith A Co., heater, and pipe for road cam p _____ 440 Lawson Woodson, labor _ _ __ ____ _____ 11 an Wallace Woodson, labor _ __ _ ___________ ZZZZZZZZZZZ 1140 Curtis Martin, labor _ _______________ - 8,n Bill Hollins, la b o r ___ ____ __ _________ ___ ZZZZZZZZZZZZZZZ 7 50 W. T. Nash, boarding road force, c.__ZZZZZZZZZZZZZZZZZZ__Z 20 00 Leslie T. Morris, road w o rk ___ _ ________ __________  _______   533 rs- T. S. McNally, cooking for road fo rc e __________ __ 3250 M. J. Goin, fe e d ________________________ 9Knn F. T. Puckett, work on ro a d ___________________ ZZZZ 12 00 Epps Johnson, labor _ ___ ______ _ ________________ ZZZZZZZZZZZZZ 24.00 J. A. Sears, Frt. on grader blades _________________ Z ZZZZZZZZ 185 Gallon Iron Works, grader b lad es ______________  40 42 Andrew Pillow, labor _ ______________ _ iq  vk Bill Jamerson, labor __________ 1 oKn G. W. Lewis, fe e d _______________ ZZZZZZZZZZ ---------------------------- 11 nn Willie Smith, la b o r __ _ ____ _ ____________ _  j  aa N. W. Jamerson, la b o r __ _______  14a R. S. Wheeler, lum ber _________________ Z __ ZZZZZZZZZZZZZZZZZZZZ 5007 Hunter Harvey, blacksmith w o rk ___ _ ________ ZZZZZZZZZZZZZZZZ 967 S. P. Coleman, Jr., cutting tree out ro a d _________________ _ 1 00 R. A. Anderson, lu m b er ________________  3750 J. L. Driskill, sills for culvert . . . _____ _ ____ qnn Joe Sell, labor _ __ _ _ _ _____ ________ 525 Mr. Brewer, labor . . . __ _ _______ ZZZZZZZZZZ 3nn Emmett Day, labor - __ _ _______ 81 60 Wiley McNally, labor ____________ ZZZZZZZZZZZZZZZZZZZZZ ------ 3525 C. A. Agee, painting w ag o n ____________________ 1700 Times-Virginian, warrant boo k ________________________ Z-ZZZZZZ 1350 Pomona Terra-Cotta Co., sewer p ip e ___________________________ 4605 Appomattox Garage, for Fordson Tractor and repairs ___________ 731.94 Standard Oil Co., for gasoline and oil _ ____________________ 4588 J. W. Crenshaw, la b o r __________________ __ __ 6400 Rector Bros., supplies ____ _______________  . Bq7 O. F. Cheatham, lum ber ________________ZZZZZZZ 3425 Jim Casey, labor __ _ ________ _ ____  97nn R. C. Mann, la b o r ______________ ZZZZZZZZZZZ ZZ 7 00"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "ZZZZZZZZZZZ!  i 5fion Hall <mark>Bryant</mark>, la b o r"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "ZZZZZZZZZZZ!  i 5fion Hall <mark>Bryant</mark>, la b o r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2201.98, 435.29, 2371.13, 637.53], "bbox_id": "550cb2f22c", "file": "AppomattoxNewspapers_1939-1943a_0244.pdf", "page": 1, "text": "wittiest girl, Jane Dickerson 14. Most athletic boy, Jack Ture man most athletic girl, Edith Har ris 15. Prettiest hair, boy, Julian Hesson girl, Vernelle Almond 16. Best sport, boy, Guy Cabell best sport, girl, Edith Harris 17. Most courteous, boy, Billy Moses girl, Charlene Martin 18. Shortest boy, Fred Smith Shortest girl, Marian Drinkard 19. Tallest boy, Lewis Bryant t allest girl, -Jean Akers 20. Most talented boy, Hiram OBrien. Most talented girl, Edythe Schutte."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "19. Tallest boy, Lewis <mark>Bryant</mark> t allest girl, -Jean"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "19. Tallest boy, Lewis <mark>Bryant</mark> t allest girl, -Jean"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1851.59, 1342.59, 2019.19, 1480.24], "bbox_id": "f585159d34", "file": "AppomattoxNewspapers_1955-1957a_0121.pdf", "page": 1, "text": "with veterans David Trent and Vernell Mitchell. Watt Abbitt prov ed that Washington has not soften ed him u,p, and he says he will be ready to play Friday night.- Stan Stanley and Vernon Bryant are also making strong bids for a place on the team. Sevenal prospective players have not been able to get to practice yet, but among the hope fuls are C. T. Moses Jr., Ivey Hol land, Jerry Miller, Willie Morris, John Cole, Roy Robertson, Richard Vern Toprence, John"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Stan Stanley and Vernon <mark>Bryant</mark> are also making strong"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Stan Stanley and Vernon <mark>Bryant</mark> are also making strong"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.71, 1282.49, 2556.7, 1552.89], "bbox_id": "37f74b9594", "file": "AppomattoxNewspapers_1939-1943a_0169.pdf", "page": 1, "text": "With two straight victories to their credit, the Appomattox high school football boys journey l to morrow to Clarksville to try to make it three in a row. Last Friday, the team played a bang-up game to give the Staunton V. S. D. B . its first defeat in three seasons. The core was 12 to 7. IiLthe quarter, Appo mattox came tu fm behind to mark up the winning tally on a recovered punt fumble, a pass from Tuerman to Cabell and a line buck by Turk man . Tureman turned in a spark ling game in the local backfleld, and the entire Appomattox line played a great game, althought outweighed by Staunton. That Appomattox will have a hard garnT tomorrow is indicated by the fact that Clarksville recently de feated Farmville and lost by only _ one touchdown to Altavista. Several shifts in the line-up may be necessary tomorrow. The mighty atom, Ivanhoe Bryant, is ou. wi n an injured ankle, and R.B. Hudg.ns Jr. and Buck Wallace will fill in  at center for Chuck Lrgon."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "The mighty atom, Ivanhoe <mark>Bryant</mark>, is ou. wi n"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "The mighty atom, Ivanhoe <mark>Bryant</mark>, is ou. wi n"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.07, 963.7, 1839.09, 1027.69], "bbox_id": "45281f2498", "file": "TimesVirginian_1976_0405.pdf", "page": 1, "text": "with this cub scout troop please contact Lawrence Hamlett, Scoutmaster, at 993-2744. 033 all for noh folks, sipi you soon! Faye W. Bryant, reporter"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "with this cub scout troop please contact Lawrence Hamlett, Scoutmaster, at 993-2744. 033 all for noh folks, sipi you soon! Faye W. <mark>Bryant</mark>, reporter"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "with this cub scout troop please contact Lawrence Hamlett, Scoutmaster, at 993-2744. 033 all for noh folks, sipi you soon! Faye W. <mark>Bryant</mark>, reporter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [452.15, 488.07, 889.42, 576.07], "bbox_id": "d6d4cd7dec", "file": "TimesVirginian_1978_0282.pdf", "page": 1, "text": "With softball in the news so much today and at this time of the year, we were asked to print this 1953 picture of the TRANSCO SOFTBALL TEAM. Can you recognize many, or all, of the players? _ . _ _ , , , ,  .jr-,.- _ mu hall On the front row, left to right, are Shearer Robertson, Ed Carter, Bob McIntyre, William Mitchell and Lloyd Bryant and on the back row, left to right, Jim Beamer, Tommy Keesee, Tommy Keesee, TommyPatterson, Harry Ferguson, Jr., Sam Page, and John Oxford. Only three of these men are still working at TRANSCO Station 170 in Appomattox. They are Lloyd Bryant, Tommy Patteson and Harry Ferguson, Jr."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "William Mitchell and Lloyd <mark>Bryant</mark> and on the back"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "William Mitchell and Lloyd <mark>Bryant</mark> and on the back"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1910.19, 911.32, 2080.68, 1354.27], "bbox_id": "bc09153800", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "With only one weeks practice be hind them, but with an impressive list of veteran players, the Appo mattox high school football team journeys to Bedford tomorrow after noon for the opening game on a difficult schedule. Coach Charles A. HHt indicated today that he would test out several combinations during the game, and hoped to make a creditable showing against the strong Bedford eleven. Although five lettermen from last years team are missing due to grad uation, Coach Hilt has enough vet eran material available to start a letter-winner at each position if he so desires. However, several of the new players are showing up so well in practice that several new men may be in the starting line-up. Captain Jack Turman and three other lettermen are available for baclcfield duty. The backfield candi dates include Captain Turman, Har ry Burge, Ivanhoe Bryant, David Christian, Billy Ould, Harold Caw- thorn, William Mitchell, Charles Bryant and James Garrett. At the end position, the coach has Guy Cabell, Buck Wallace, La- than Harvey, Julian Hesson, Her man Dee and Buck Smith. Tackle candidates are Tom Guill, Buster Moore, Robert AHjen Sears, and James Spiggle. At center, Chester Ligon and J. E. Carson Jr. are vieing for the starting nod. Guard aspirants are Sid Conner, Joe Ferrell, Roy Craw ley, Frank Miller, Pete -Evans and Andrew Paulette. New j era ays, helmets, shoes and pants have been purchased, and the blue and white team will have a snappy eappearance. The first home game will not be played until October 13. There is a, possibility that the home games may"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Har ry Burge, Ivanhoe <mark>Bryant</mark>, David Christian, Billy Ould,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Har ry Burge, Ivanhoe <mark>Bryant</mark>, David Christian, Billy Ould,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.34, 612.5, 1759.29, 1040.83], "bbox_id": "6f8b0a7f08", "file": "AppomattoxNewspapers_1971-1973a_0620.pdf", "page": 1, "text": "with her mother, Mrs. Anne C. Smith. Visitors in town for the Williams-Savitz wedding last Saturday night were Mrs. Nancy T. Williams and Em- mette, Richmond, Mrs. Jane Wingfield, Lynchburg, Mr. and Mrs. Bob Perrin and family of Feasterville, Pa., Mr. and Mrs. John Earl Wood and family, Colonial Heights, Va., Mr. Malcolm Inge and Mr. Cliff Welch, V.P.I. Blacksburg, Miss Sally Farrar, Mary Baldwin College, Staunton, Miss Anne Farrar, Stratford College, Danville, Mr. Richard F. Williams, Jr., Newport News, Mr. and Mrs. Isaac Savitz, Mr. Isaac Savitz, Jr., Mr. Ken- Savitz, Columbia, S. C., Mr. and Mrs. Robert Williams, Randalltown, Md., Mr. Charles Abbitt, V.P.I., Mrs. John Rush, Kenbridge, Mr. Gary Lyons, Richmond, Mr. Norman Walk er, W.M. Grandmother Ear- heart, Columbia, S. C. Miss Mary Kinzie, Bridgewater, Va., and Mr. and Mrs. Fred Garick, Columbia, S. C. and Mr. and Mrs. S. Savitz, St. Matthews, S. C. Mr. and Mrs. A. B. Bryant of Severena Park, Md. and their son from V.P.I. spent the week end with her mother, Mrs. C. I. Harvey, Darlington Heights."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and Mrs. A. B. <mark>Bryant</mark> of Severena Park, Md."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and Mrs. A. B. <mark>Bryant</mark> of Severena Park, Md."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.26, 985.48, 1676.31, 1053.82], "bbox_id": "077ba73467", "file": "TimesVirginian_1978_0475.pdf", "page": 1, "text": "Winning contestants at Robert E. Lee Academy, front row, Sissy Knight, Miss Robert E. Lee Academy second row, left to right, Stella Osborne and Mary Lee Bryant, judges third row, left to right, Sarah Morris, Miss Originality  Liz Pierce, 1st run ner-up Pedi Myrick, 2nd runner-up and on back row, left to right, Sandi Morris, Best Sport and Kathi Morris, Miss Congeniality. Not pictured was Lisa Moon, a judge."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Osborne and Mary Lee <mark>Bryant</mark>, judges third row, left"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Osborne and Mary Lee <mark>Bryant</mark>, judges third row, left"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.21, 800.54, 2401.56, 961.39], "bbox_id": "a30b34f6a2", "file": "TimesVirginian_1980a_0177.pdf", "page": 1, "text": "Winners of Oscar Mayer 3 Lb. Caned Hams Clyde Nash, Ethel Stjokn, Alice NcDearmon, Robin Price, Rosa Repass, David Baldwin, Fannie Kern, Cliff Plunkett, Rhonda Jones, Virginia Hunter, Webb Babcock, Gloria Bryant."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Hunter, Webb Babcock, Gloria <mark>Bryant</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Hunter, Webb Babcock, Gloria <mark>Bryant</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1154.31, 453.16, 1309.12, 1021.64], "bbox_id": "2c33d5ef1d", "file": "TimesVirginian_1978_0504.pdf", "page": 1, "text": "Winners in the Football Contest sponsored by local m erchants have been an nounced by the TIMES-VIR- GINIAN for the contest in the November 2, 1978 edition of this newspaper. Jefferson Forest - William Campbell did not play each other in Friday nights game so we will not count that as one of the contest games. With a possible 22 correct predictions to make in this contest, Raymond W. Bryant of Route 3, Appomattox correctly picked 21 games. He is winner of first place and will receive a check from the TIMES-VIR-  GINIAN in the. amount of 10.00 as first place prize. Correctly picking 20 of the games from the possible 22  games listed in the contest were Nelwyn Morris of Route 3, Robert I. Scott of 510 Virginia Avenue, Leoh Bryant, Jr. of Route 3, and Steve Mitchell of P. 0. Box 132. Going to the tie-breakers for a winner, Steve Mitchell was the only one of the four to pick Air Force to beat Army which was incorrect. Going to the Appo mattox - Amherst game for a winner, Robert I. Scott with an 8 point difference in the game is winner of second place and will receive a check. from the TIMES-VIRGINIAN in the amount of 5.00 as second place prize. Appomattox won over Amherst by only 2 points. As this was the last game of the season for the Seminole District, of which Appomattox Raiders are Champions, the -frxA bottcontegt W itt  k UrtWrt until next season. Congratula tions to all the winners and to the participants in the contest this year. It truly created a great deal of interest."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "this contest, Raymond W. <mark>Bryant</mark> of Route 3, Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "this contest, Raymond W. <mark>Bryant</mark> of Route 3, Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [700.54, 177.75, 841.7, 573.68], "bbox_id": "2e19c8145c", "file": "TimesVirginian_1976_0131.pdf", "page": 1, "text": "Winger, of Richmond, aeveral days last week. Dinner guests Sunday in the hflinp of Mrs. Mattie Mott Harvey were Mr. and Mrs. Wylie Richadson, Mr. and Mrs. Garland Mayberry, Mrs. Bill Dudley and daughter, Debbie, Miss Lidna Bryant, aD of Lynchburg, and Mrs. Jessie Carwile, of Appomattox. Congratulation to Mr. and Mrs. Danny Hackett on the birth of their son, Warren David, Fri., April 2. Mis Bonnie Paulette and Mrs. Ethel St. John attended conferences at Eagle Eyrie Baptist Assembly this week end. The Singing C hristians Quinet of Evergreen Baptist Church sang at Union Christian Church Madison Heights, Va. Sunday evening. Mrs. Ayre Paulette showed slides of her trip to Germany in the home of Mrs. Rachel Evans, Saturday evening. Mrs. Mattie Mott Harvey was visiting in this home, too. Mr. Jeff Hodges is a patient in Lynchburg General Hospital. Mr. and M rs. Woodrow Womack, of Buckingham Go., visited his sister, Mrs. Gladys Franklin Monday afternoon."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "daughter, Debbie, Miss Lidna <mark>Bryant</mark>, aD of Lynchburg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "daughter, Debbie, Miss Lidna <mark>Bryant</mark>, aD of Lynchburg, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.24, 666.47, 2012.69, 983.42], "bbox_id": "456c891c81", "file": "AppomattoxNewspapers_1949-1952a_0285.pdf", "page": 1, "text": "win, John M. Blakney, Addie L. Ba ker, W. C. Bell, Grover P. Beasley, Jr. W. V. Bryant, Lloyd M. Bryant, Robert B. Boney, Jr. C. S. Booth, Concretely, Co.el Woodson gave! Berkley H. Guill, W. T. Coleman, consistent bad weather as a reason! Mrs. C. M. Carter, Maude Casey, for the saving of these lives, since John C. Caldwell, Bill J. Covington, during bud weather most drivers! Jr. Mrs. Frances F. Carr, Mr. John make allowances for dangerous con- C. Cole, Mrs. Verna F. Conner, ditions. He stated also that the re-! Chas. F. P. Crawley, H. W. Conner, duction is all the more commend- Wi S. Conner, Joel Carter, Henry able in that bad weather failed to T. Chernault, Jessy J. Chernault, prevent a 1 per cent rise in traf-. Edith L. Drew, T. Hunter Dicker- fic volumes. sun Fleming W. Drinkard, Otis P. n .. . , n , , , Dewberry, J. R. Davidson, Crawford On the other hand, Colonel Wood- L_ Davidson, Annie T. Davidson, son felt that the sterner attitudes 011ie j. Davidson, Curtis L. Eagle, of many Virginia courts coupled claude Elder Robert Englander, with the full realization of Virginias John Thomas Ferguson, Samuel L. disgraceful 19o0 record no doubt FergUSOn, D. J. Franklin, C. R. Fer- had their impacts. guson, Mary S. Fuller, Billy Fergu- At the same time, Colonel Wood-  son Carl Ferguson, Harry Fergu son announced that Virginias 1950 1 0n J -  Tucker Ferguson, George toll had dropped from the first Farrar, Hubert A. Gurney, E. tabulation of 908 to 905 but that j Guill, Georgia Garrett, and late reports quite possibly could  P. A Garrett, Mrs. Edna Gains, bring it even higher than 1908. R. B Gilbert, J. L. Gordon, John W. The reduction was occasioned by! Gunter, Mrs. Peggy M. Harvey, Mrs. an erroneous report from another  Harris, William Frank Hanen- police department which listed two rat, Alma Harris, Lewis Harvey, injured persons as dead and a pe- yiliam C. Hubbard, Mrs. Mary S. destrian death which was ruled of- Hudson, A. R. Harwcod, Jr. Mrs."}, "highlight": {"text": {"matched_tokens": ["Bryant", "Bryant"], "snippet": "Beasley, Jr. W. V. <mark>Bryant</mark>, Lloyd M. <mark>Bryant</mark>, Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "Bryant"], "snippet": "Beasley, Jr. W. V. <mark>Bryant</mark>, Lloyd M. <mark>Bryant</mark>, Robert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [125.06, 573.03, 259.82, 991.26], "bbox_id": "714ad6c12d", "file": "TimesVirginian_1980a_0181.pdf", "page": 1, "text": "Wilton H. Bryant Wilton Haywood Bryant, 71, of Wright Shop Road, Madison Heights, died Wed nesday, May 21, in Lynch burg General Hospital. He was the husband of Mattie Proffit Bryant. Born in Appomattox Co unty, he was a son of the late Floyd Bryant and Nannie Vest Bryant. He was a retired employee of Virginia Greenstone and, at the time of his death, was Employed by Quality Foods, Inc. He was a member of United Pentecostal Church. In addition to his wife, he is survived by five sons, Haywood T. Bxyant of Amherst, Thomas H. Bryan of Rustburg, Howard W. Bryant of Concord, Elwood W. Bryant and Russell L. Bryant, both of Lynchburg two daughters, Frances B. Staten  jn d Sandra F. Bryant, both of Madison Heights a brother! Loyd Bryant of Amherst a sister, Virginia Connelly of Madi son Heights 14 grand children and four great grandchildren. Funeral services Were conducted. 11 a.m. Friday . in Whitten Park Avenue Chapel by Pastor James A. Wolfe. Interment was ip,  Meade .Cemetery."}, "highlight": {"text": {"matched_tokens": ["Bryant", "Bryant"], "snippet": "Wilton H. <mark>Bryant</mark> Wilton Haywood <mark>Bryant</mark>, 71,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "Bryant"], "snippet": "Wilton H. <mark>Bryant</mark> Wilton Haywood <mark>Bryant</mark>, 71,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [737.27, 1579.18, 863.17, 1669.33], "bbox_id": "30962c133d", "file": "TimesVirginian_1983a_0471.pdf", "page": 1, "text": "Wilson Adams Bear Bryant Fleming Drinkard George Duff Timmy Garrett Marion Harwood"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Wilson Adams Bear <mark>Bryant</mark> Fleming Drinkard George Duff Timmy Garrett Marion Harwood"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Wilson Adams Bear <mark>Bryant</mark> Fleming Drinkard George Duff Timmy Garrett Marion Harwood"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [727.9, 636.25, 855.99, 736.42], "bbox_id": "91a8d4799a", "file": "TimesVirginian_1980a_0434.pdf", "page": 1, "text": "Wilson Adams Andy Andersozi Bear Bryant .  . Carey Carson Herbert Chambers Fleming Drinkard"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Wilson Adams Andy Andersozi Bear <mark>Bryant</mark> .  . Carey Carson Herbert Chambers Fleming Drinkard"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Wilson Adams Andy Andersozi Bear <mark>Bryant</mark> .  . Carey Carson Herbert Chambers Fleming Drinkard"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1585.2, 1061.51, 1769.29, 1214.43], "bbox_id": "b5ad5607b1", "file": "TimesVirginian_1983a_0399.pdf", "page": 1, "text": "Willie Millner of Appomattox has been named winner in last weeks Timdb-Virginian Football Contest. MUlner missed accurately predicting only one game in the contest. He will receive a check in the amount of 20 as first.place prize. Tied for second place, missing only two games in the contest, were Doris Bryant, Raymond Bryant, Teresa P. Mayberry, Carolyn Thompson, and Mark Scott, all of Appomattox. In contested elections"}, "highlight": {"text": {"matched_tokens": ["Bryant", "Bryant"], "snippet": "the contest, were Doris <mark>Bryant</mark>, Raymond <mark>Bryant</mark>, Teresa P."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "Bryant"], "snippet": "the contest, were Doris <mark>Bryant</mark>, Raymond <mark>Bryant</mark>, Teresa P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.25, 291.62, 2167.05, 355.82], "bbox_id": "216c22e77d", "file": "AppomattoxNewspapers_1939-1943a_0583.pdf", "page": 1, "text": "Willie Bryant, of Baltimore and friend, Miss Oprel Martin, of Roan oke spent the week-end with his parents, Mr. and Mrs. Dallas Bryant of yera. Mrs. Charlie Bryant, of Sweet Briar whs the guest for the week-end recently in this home."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Willie <mark>Bryant</mark>, of Baltimore and friend,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Willie <mark>Bryant</mark>, of Baltimore and friend,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [710.65, 778.5, 868.1, 1144.89], "bbox_id": "f1789458af", "file": "AppomattoxNewspapers_1905-1912a_0474.pdf", "page": 1, "text": "Willie Brown, Mist. Ark., 124 bush els. 13 cents. Ben Leath, Kensington. Ga.. 214 5-1 bushels. 14 2-9 cents. Arthur Hill, Jakln, Ga., 180 3-5 bush els, 42 cents. Monroe Hill, Oglethorpe, 148 4-25 bushels, 40 cents. Edward Doyle, Elwood, 111. bushels, 12 2-3 cents. Carl Duncan. Rockfield, Ky.. 97 4 6 bushels, 13 7-10 cents. Howard Burge, Rowling Green, Ky., 78 bushels, 21 cents. John H. Henry, Jr., Melrose, La., 150 bushels, 16 3-10 cents. Bennie Beeson, Menticello, Miss, 227 1-16 bushels, 14 cents. Barnie Thomas, Lake Cormorant, Miss., 225 bushels, 34 cents. John Bowen, Grenana, Miss., 221 1-5 bushels, 16 cents. Charles Parker. Jr.. Woodland. N. C., 195 9-10 bushels, 24 cents. Philip Wolf, Kildare, Okla., 8074 bushels, 13 cents Claude McDonad. Hamer, S. C 210 4-7 bushels, 33 1-3 cents. Miller Hudson, Tlmmonsville, S. C., 151 bushels, 41 cents. John V. McKibbon, Culleoka, Tenn., 167 7-10 bushels. 32 cents. Norman Smith, Covington, Tenn., 168 3-10 bushels. 21 cents. Johnnie Bryant, Slocum, Tex., 114 bushels, 18 cents. Lewis Windham, Lott, Tex.. 4S bushels, 24 cents. John A. Johnston, Jr.. Jarratt, Va., 164 3-20 bushels, 34 cents."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "bushels. 21 cents. Johnnie <mark>Bryant</mark>, Slocum, Tex., 114 bushels,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "bushels. 21 cents. Johnnie <mark>Bryant</mark>, Slocum, Tex., 114 bushels,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.94, 665.88, 2049.84, 714.78], "bbox_id": "e0c43d3c0e", "file": "AppomattoxNewspapers_1955-1957a_0282.pdf", "page": 1, "text": "Willie Beale, Sept. 9. Mrs. Louise Megginson, Sept. 13. Miss Ettice Marks, Sept. 5. Robt. Allen Butch Bryant, Sept. 25."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Willie Beale, Sept. 9. Mrs. Louise Megginson, Sept. 13. Miss Ettice Marks, Sept. 5. Robt. Allen Butch <mark>Bryant</mark>, Sept. 25."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Willie Beale, Sept. 9. Mrs. Louise Megginson, Sept. 13. Miss Ettice Marks, Sept. 5. Robt. Allen Butch <mark>Bryant</mark>, Sept. 25."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [758.9, 1054.83, 903.55, 1191.53], "bbox_id": "64ba94a7db", "file": "AppomattoxNewspapers_1954-1955a_0402.pdf", "page": 1, "text": "Willie Beale, Sept. 9. Etice Marks, Sept. 5. Hunt Hamilton, Sept. 13. Dannie Joe Hamilton, Sept. 19. David Hamilton, Sept. 23. Judie Bryant, Sept. 21. Alvin Hamilton, Sept. 14. Louis Megginson, Sept. 13. Elizabeth Hamilton, Sept. 30. Etta Harris, Sept. 23. Mrs. K. E. Coleman, Sept. 15. Hallie Seay, Sept. 29. Mrs. Daphan Seay, Sept. 29."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Hamilton, Sept. 23. Judie <mark>Bryant</mark>, Sept. 21. Alvin Hamilton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Hamilton, Sept. 23. Judie <mark>Bryant</mark>, Sept. 21. Alvin Hamilton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.78, 399.98, 1981.43, 468.96], "bbox_id": "4bf4dc8010", "file": "TimesVirginian_1978_0531.pdf", "page": 1, "text": "Willie and Vivian Bryant visited Essex, Maryland the week end of November llth to help celebrate the 58th wedding an niversary of Mrs. Bryants parents, Mr. and Mrs. William Har tman, shown above.  They received many gifts and wishes of health and happiness, some of which came from friends of our little village of Vera and friends from Appomattox."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Willie and Vivian <mark>Bryant</mark> visited Essex, Maryland the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Willie and Vivian <mark>Bryant</mark> visited Essex, Maryland the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2325.34, 241.53, 2469.31, 354.73], "bbox_id": "5dacb0cc82", "file": "TimesVirginian_1981a_0085.pdf", "page": 1, "text": "Williams, who had walked and moved to second on a fielders choice. .. Clabough said, Bennett pitched a great game, consider ing the weather.  The sopho more pitcher walked only one batter and struck out six in the Glass game. The coack also commended Bryant for leading theoffense"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "The coack also commended <mark>Bryant</mark> for leading theoffense"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "The coack also commended <mark>Bryant</mark> for leading theoffense"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1406.65, 1255.23, 1736.26, 1305.81], "bbox_id": "da7a3a719b", "file": "AppomattoxNewspapers_1974-1975a_0432.pdf", "page": 1, "text": "Williams Real Estate Located in the Branch  Bryant Building,"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Williams Real Estate Located in the Branch  <mark>Bryant</mark> Building,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Williams Real Estate Located in the Branch  <mark>Bryant</mark> Building,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.78, 234.39, 1837.64, 855.16], "bbox_id": "ea3fc85d50", "file": "AppomattoxNewspapers_1962-1965a_0613.pdf", "page": 1, "text": "williams grandmother M rs Phebe Heath of Buckingham. Mr. and Mrs. Carlton Garrett and Chris visited in the home of her parents. Mr. and Mrs. i Wade Ferguson Sunday. Visiting in the same home were Mr. and Mrs. Marie Ferguson, Judy and Jane, of Lynchburg, and Mr. and11 Mrs. Evans Ferguson and Kathy of Appomattox. Mrs. Eddie Carter left Friday to spend a while with her daugh ters, Mrs. Emile Venezio, of Du mont, N.J., and Mrs. Jules DAnna of Fairlawn N.J. Friends are glad to see Mis. Russell Bryant out after being hospitalized for a while. Mrs. Annie H. Garrett and La- Verne visited in the home of Mr. and Mrs. T e r r y Garrett of Lynchburg Sunday night. Mrs. Frank Nuckols visited in the home of Mrs. A. W. Coving ton last Sunday afternoon. Mi. Lewis Twyman, of Miami Florida, visited in the home of Mr. and Mrs. W. L. Amos last Monday night. Mr and Mrs W T Paulette, of Richmond, Mr. Michael Pau lette, of Hampden-Sydney Col lege, and M ss Julie Glass, of Longwood College, visited in the home of Mrs. A. W. Covington last Sunday. Mr. and Mrs. Alton Lucado visited in the home of Mr. and Mrs. Carlton Garrett Saturday. Mr. Walker Webb visited in the home of Mr. and Mrs. T. C. Harvey Sunday. Mrs. Ada Gibson and Mrs. Mildred visited in the home of Mr. and Mrs. T. C. Harvey Mon day. We are sorry to hear that Syl via Carson has the mumps. We hope for her a speedy recovery. Mrs. L. B. IJarvey visited in the home of Mr. and Mrs. T. C. Harvey Monday. Week end guests in the home of Mr. and Mrs. T. C. Harvey were Mr. Allen OBrien, Mrs. Mildred Alvis, Mr. and Mrs. Da vid Repass and Sherry, Mr. and Mrs. Charlie Harvey, Debbie, Becky and Chuck, Mr. and Mrs. Ralph Robinson and Robby. Mr. and Mrs. T. C. Harvey visited in the home of Mr. and Mrs. L. H. Watson on Sunday."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "to see Mis. Russell <mark>Bryant</mark> out after being hospitalized"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "to see Mis. Russell <mark>Bryant</mark> out after being hospitalized"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2042.97, 924.45, 2209.71, 1059.5], "bbox_id": "4cf659793e", "file": "AppomattoxNewspapers_1949-1952a_0182.pdf", "page": 1, "text": "William Walton m.  Armstead. William Walton, J r , of Buck ingham, m. Elizabeth White Chick, daughter of Col. Dick Chick. Had issue 1. James m.  2. John m. ------ 3. Virginia m. Bryant Nowlin 4. Elizabeth m. Dr. Wm. A. Jones 5. Margaret m. John McKinney 6. Mary Frances P nr. Cal. Sam uel McDearmon , I 7. Martha m. Major Samuel J. Walker."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "m. ------ 3. Virginia m. <mark>Bryant</mark> Nowlin 4. Elizabeth m."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "m. ------ 3. Virginia m. <mark>Bryant</mark> Nowlin 4. Elizabeth m."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.74, 812.66, 1869.94, 927.81], "bbox_id": "5fe5c14bf2", "file": "AppomattoxNewspapers_1952-1954a_0088.pdf", "page": 1, "text": "William McFadden, Oct. 13. Mrs. W. Roy Robertson, Oct. 1 Mrs. Claude Jennings, Oct. 4. Mrs. Hal Bryant, Oct. 4. Percy George, Oct. 19. Mrs. Leslie Gordon, Jr., Oct. 4 Miss Nina Barlow, Oct. 4. Mrs. Estelle Moore, Oct. 8. Mrs. R. D. Robinson, Oct. 9. Mrs. W. M. Hancock, Oct. 9. John T. Hall. Oct. 10. Rev. D. M"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Oct. 4. Mrs. Hal <mark>Bryant</mark>, Oct. 4. Percy George,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Oct. 4. Mrs. Hal <mark>Bryant</mark>, Oct. 4. Percy George,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.9, 754.25, 2238.1, 1603.29], "bbox_id": "e887c139dc", "file": "AppomattoxNewspapers_1943-1947a_0267.pdf", "page": 1, "text": "William Irving Ayers Albert C. Baldwin Edward H. Baldwin Norman K. Baldwin Walter M. Bates William C. Bell William T. Bowling Clarence W. Brooks Walter B. Brown Willie W. Brown Curtis H. Bucknam Richard F. Burke, III Richard L. Burke, Jr. Robert T. Burks Robert li. Bryant David C. Carter Hubert H. Caldwell, Jr. Carlton D. Canada Charlie B. Carson Frank Chandler William C. Childers Richard C. Childress Andrew B. Chocklett Walter S. Conner Kelly Crum Twyman E. Curaby Marcus H. Cuneo John R. Crawley, Jr. Harry 0. Cyrus Chap L. Davidson Ernest -Davidson -----  Edward R. Doss Paul S. Drinkard Russell H. Eagle Joseph W. Eddins Joseph E. Ferrell Harry D. Ferguson David M. Franklin Kermit Garrett Tyler Garrett Russell T. Gilbert Theodore R. Gilbert Harry B. Giles Lewellyn Giles, Jr. Lewis H. Gobble Herbert L. Godsey Andrew M. Goin Emmett H. Goin Robert E. Gowin Fred W. Grishaw Harry W. Guill Willie E. Guill Charlie Gunter Howard W. Hancock Richard M. Harris Garland Harding Edward W. Harvey William C. Hollins Richard D. Inge Jesse H. Johnson Herman K. Kirkpatrick Arthur C. Layne _ Robert F. Lynch John R. Lawson Asa T. Martin Glenn 5. Martin Clarence J. Mays Carrington A. McCormick Lewis S. McCormick, Jr. Ivanhoe W. McCormick Thomas A. McCormick Garland J- Morris Lyle E. Moses Jerry B. Myers Samuel L. Nuckols Clem O. OBrien Jesse T. Paulette Havilah E. Phelps Lenwood E. PKelps Garland G. Plunkett Jas. W. Ranson Samuel E. Richardson David T. Robertson James G. Robertson Oscar L. Robertson Paul W. Sarver Russell M. Shelton Ira J. Southall Clarence H. Stanley Samuel L. Stanley Dillard Reed"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "T. Burks Robert li. <mark>Bryant</mark> David C. Carter Hubert"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "T. Burks Robert li. <mark>Bryant</mark> David C. Carter Hubert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.13, 545.85, 1927.97, 1329.88], "bbox_id": "889303af49", "file": "AppomattoxNewspapers_1971-1973a_0573.pdf", "page": 1, "text": "Willard D. Ligon, a native of Appomattox County, general manager of the Bryant division of the Westinghouse Electric corporation, who will retire December 31, 1972, was honored on November 12th, at a reception in the Holiday Inn, Bridgeport, Connecticut. The December, 1972, issue Westinghouse New, Bryant division, was entirely dedicat ed to him and was headed The Ligon Years - A Lasting Legacy. Along side a large picture of Mr. Ligon on the front page of the company newspaper, was the following What A Way To Go - Flags flying, Bands playing and Bryant surpassing all expect- ions! Yes, the Ligon years have been a lasting legacy. A legacy of unparalleled growth and accomplishment. A period of years marked by continued employment and new product development. To Willard Du- puy Ligon, as a testimonial to your 43 year Westinghouse career and its spectacular conclusion at Bryant Electric, we dedicate this issue of the Westinghouse News. Ligon was appointed General Manager of the Bryant Divi sion of the Westinghouse Corporation in 1963, having joined the company in 1929, after graduating from Virginia Polytechnic Institute with a B.S. in industrial engineering. A native of Pamplin, Virginia, he graduated from Blackstone Military Institute prior to attending V.P.I., Blacksburg, Virginia. He is married to the former Mary Brightwell of Pamplin. His first Westinghouse as signment was as a foreman in the Motor Division at East Pittsburg, Pa. He rose to general foreman, assistant superintendent and superin tendent. While in this division, at the end of World War II, Mr. Ligon was moved to Buffalo, New York, along with the division, and served as resident manager and then was appointed manager of the Motor Division. He was named general works manager of the combined Motor and Control Divisions at Buffalo in 1950. In 1951, he moved to Sunnyvale, California, to become project manager at the Westinghouse plant in charge of building"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "general manager of the <mark>Bryant</mark> division of the Westinghouse"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "general manager of the <mark>Bryant</mark> division of the Westinghouse"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [788.93, 1096.45, 944.54, 1676.85], "bbox_id": "87ef430b18", "file": "AppomattoxNewspapers_1898-1902a_0612.pdf", "page": 1, "text": "will be many times when you will want God. You will have questions to decide which will need supernatural impulse. There may be illnesses of the body or per plexities of mind or spiritual exhaustions to be healed and comforted and strength!, ened. During the remaining twenty-six days of this month lay in a supply of faith . and hope and courage for all the days ol the eleven months. Start right, ana you will be apt to keep right. Before the ship captain gets out of the New York Narrows he makes up his mind what sea route he will take. While you are in the narrows of this month make up your mind which way you will sail and unroll your chart and set your compass and have the lifeboats well placed on the davits and be ready for smooth voyage all the way across or the swoop of a Carib bean whirlwind. Rev. Solomon Spaulding was for some time in poor health, and to while away thi time he wrote a preposterous religious ro mance. One Joseph Smith somehow go! hold of that book before it was printed and published it as a revelation of heaven, calling it the Book of Mormon, and from that publication came Mormonism, the monster abomination of the earth, Rev. Solomon Spaulding might have been better engaged than writing that book ol falsehoods. However much time we have, we never have time to do wrong. Harnesi January for usefulness, and it will take thi following months in its train. Oh, hou much you may do for God between now and the 31 st of next December! The beautiful  weeping willow trei was introduced by Alexander Pope intc England from a twig which the poet found in a Turkish basket of figs. He planted that twig, and from it came all the weep ing willows of England and America, and your smallest planting of good many un der God become an influence continental and international. Now that the train of months hai started, let it pass, January followed bj February, with longer days, and March, with its fierce winds and April, with iti sudden showers and May, with its bios soming orchards and June, with its car nival of flowers and July, with its ha vests and August, with its swelterin heats and September, with its drifting leaves and October, with its frosts anc, November, with its Thanksgiving scenes and December, with its Christmas hilarl ties. March on, O battalion of months- in the regiments of the years and the brir gades of the centuries! March on and join, the months and years and centuriel already passed until all the rivers of timt have emptied into the ocean of eternity hut none of all of the host ought to rendel higher thanks to God or take larger com fort or make more magnificent resolve thai this the first month ol the new year. But what fleet foot hath the months and rears! People lightly talk about how the- till time. Alas, it dies soon enough with out killing. And the longer we live thi swifter it goes. William C. Bryant said an old friend of his declared that thi going of time is like the drumming of thi partridge or muffled grouse in the woods falling slow and distinct at first and thej following each other more and more rapid ly till they end at last in a whirring sound But Dr. Young, speaking of . the value ol time, startlingly exclaimed, Aek death"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "it goes. William C. <mark>Bryant</mark> said an old friend"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "it goes. William C. <mark>Bryant</mark> said an old friend"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2200.53, 1231.97, 2343.2, 1326.62], "bbox_id": "dc38b31acb", "file": "AppomattoxNewspapers_1962-1965a_0485.pdf", "page": 1, "text": "will be lepresented, according to District Deputy of the 26th District, Lloyd M. Bryant, of Ap pomattox. The evening will be- pln wHh a dinner at 630 p.m. at the Cedarbrook Restaurant, fol lowed py a meeting at 745 p.m. Farmville Lodge 41 is the host Lodge. District Deputy for the 27th"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "26th District, Lloyd M. <mark>Bryant</mark>, of Ap pomattox. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "26th District, Lloyd M. <mark>Bryant</mark>, of Ap pomattox. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1839.33, 525.25, 2292.47, 777.4], "bbox_id": "955dde14a8", "file": "TimesVirginian_1980a_0009.pdf", "page": 1, "text": "WiBieW. Bryant  Willie Washington Bryant, 66, of Route 3, died early Friday morning, Dec. 21, 1979, in Essex, Md. Twice married, his first wife Mrs. Charles Beaker 8r! thoeTwiriMno iemor- was he late Opal Martin Mrs. Pearl P. Booker, 72, of ui consider Liberty Baptist Bryant and his second wife is Route 2, Gladstone, died S u r S or the A oD o Sto x Vivian Sligh Bryant. Born in Tuesday, Dec. 18.1979, at 1240  H f i d ? Appomattox County, he was a . a.m. in Lynchburg General  son of the late Dallas C. Bryant Hospital after a short illness. arid Maggie Ferguson Bryant. She was the wife of the late Mrp. Phillip Bowling Sr. He was a member of New Hope Charles A . Booker Sr. Minnie Bowling. 96, of Baptist Church and was a Born in Appomattox County, Madison Heights, died Tues- retired carpenter.. she was a daughter of the late day, Dec. 25, 1979, in In addition to his wife, he is John and Mary Pennix. She Lynchburg General Hospital, survived by four stepchildren, was a member of Mount. Airy Born in Nelson County, a Wayne, Rickie, Brenda and Baptist Church in Appomattox, daughter of the late Sally Kenneth Sligh five stepgrand- She is surviviea by four Roberson, she was the wife of children four brothers, Alfred daughters. Miss Marilyn L. the late Phillip Bowling Sr. She J . Bryant, Robert L. Bryant Booker, Miss Phyllis Booker, was a member of Fairmouiit and Lloyd M. Bryant, all of- Mrs. Hazel Evans and Mrs. Baptist Church. Appomattox and Charlie W . Ear-le Hudson, all of Gladstone Survivors- include a son, Bryant of Amherst and three two sons, Bobby Booker and Phillip Bowling Jr . of Madison1 sisters, Mrs. Hattie Ferguson, Charles Booker Jr ., .both of Heights a daughter, Mrs. Ella . .M rs. Gladys Ferguson ana Mrs. Gladstone a sister, Mrs. Ruby Chives of Amherst a brother."}, "highlight": {"text": {"matched_tokens": ["Bryant", "Bryant"], "snippet": "WiBieW. <mark>Bryant</mark>  Willie Washington <mark>Bryant</mark>, 66,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "Bryant"], "snippet": "WiBieW. <mark>Bryant</mark>  Willie Washington <mark>Bryant</mark>, 66,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [378.94, 839.49, 549.82, 1216.42], "bbox_id": "bd4f2399d5", "file": "AppomattoxNewspapers_1892-1898a_0013.pdf", "page": 1, "text": "WHO WILL BE THE LAUREATE? The death of Tennyson raises in literary circles the question of the most fitting man to succeed him as the Laureateof England. From the telegraphic reports it would seem that the English public sentiment points to but three men as at all worthy to aspire to this great digni tySwinburne, Sir Edwin Arnold, and William Morris. The occasion naturally excites the reflection that the death of Tennyson leaves the Ffogliah speaking race, for the first time in the present century at least, without a first class ooet , without a poet of the second lass w hollr pure anti inspiring verse has imbedded itself in the memory and admiration of mankind. The poetic dearth-is particularly notable on thin side.of the Atlantic. There never were but three real poets in AmarfeaPoe, Bryant, and Longfel low. These are all gone. W hittier possessed some measure of poetic in stinct with a certain gift of vivid versification, without being a genuine poet. He, too, hta re cently passed away. Holmes wrote occasional verses but made no claim to a place among . the inspired singers. Our Hall of Poesy is now a silent chamber,"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "real poets in AmarfeaPoe, <mark>Bryant</mark>, and Longfel low. These"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "real poets in AmarfeaPoe, <mark>Bryant</mark>, and Longfel low. These"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [420.96, 577.07, 598.83, 1206.06], "bbox_id": "a9154427e3", "file": "AppomattoxNewspapers_1939-1943a_0524.pdf", "page": 1, "text": "who underwent an operation erday. Corn. Carter is report be in a satisfactory condition Charles Gregory, of the U. S has a ten-day extension on hi 1 lough. Mrs. J. W. St- Clair. of n  and Miss Madian Lee. ton spent the week--re with Mrs. IR. T. Lee. Mrs. H. P. Davis. Mrs. F. C. Dres ser and Mrs. R. T. Lee spent a few days in Richmond last week. Week-end guests of Miss Frances Evans were Miss Pauline Griggs, of  Phoebus and Sg. L. E. Cauley. Guests over the week-end in the home of Mrs. C. M. Evans were Mr. and Mrs. W. F. Ranson, Mr. and  Mrs. J. F. Ranson, Mr. and Mrs. R. O. Ranson, and daughter, j of Pangolin Mr. Mrs. C. S. i Ranson and son William, of Peters burg. Mrs. Jerry Smith visited in this home this week. C. M. Evans will spend the week end at his home here. Mr. and Mrs. Ray Houchens and son, of Petersburg spent Sunday with her parents, Mr. and Mrs. D. A. Conner. Mrs. Ola Willis m d Miss Edith Lucado, of Lynchburg spent Sun day with Mr. and Mrs. J. H. Luca do. Miss Doris Lucado end Dan Ruck er, of Richmond will dpend this week-end with Mr. and Mrs. J. H. Lucado. Mrs. T. U. Conner is visiting her sister, Mrs. W. S. Bryant, of Cullen. Mr. and Mrs. Frank Hanenkrat have moved into their newly com pleted home on Route 2. Miss Constance Fulp, of Rich mond was home last week-end. John Cheatham has returned to Frederick, Md. after spending two weeks in the county. Mrs. W. A. Thornhill, of Blue- held, W. Va. spent the week-end with her sister, Misse Patty Feather- ston. C. K. Hunter was in Blackstone Friday. Mrs. Barry Dahl and G. F. Ab- bitt Jr. weije business visitors in Charlotte Court House Saturday."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "sister, Mrs. W. S. <mark>Bryant</mark>, of Cullen. Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "sister, Mrs. W. S. <mark>Bryant</mark>, of Cullen. Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2007.84, 437.81, 2177.02, 557.75], "bbox_id": "8b8d3972aa", "file": "AppomattoxNewspapers_1954-1955a_0269.pdf", "page": 1, "text": "Who said Appomattox is not a Growing Town! New store building going up next to Hotel Appomattox Mr. and Mrs. Cabell Lewis plan to build a new home on Court St. Mr. and Mrs. Vernon Bryant are building a lovely home on Route 460. Also Mr. and Mrs. George Franklin. And lots more building is going on. And have you noticed the paint job red and white on the Town Fire Engine House?"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Vernon <mark>Bryant</mark> are building a lovely"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Vernon <mark>Bryant</mark> are building a lovely"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2167.14, 201.93, 2294.56, 252.73], "bbox_id": "bc315e27f3", "file": "TimesVirginian_1980a_0134.pdf", "page": 1, "text": "who came in fourth. Tolleys from Pamplin and C. C. Bryant Land Company rounded out the top six teams. Lawson Ford softball"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "who came in fourth. Tolleys from Pamplin and C. C. <mark>Bryant</mark> Land Company rounded out the top six teams. Lawson Ford softball"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "who came in fourth. Tolleys from Pamplin and C. C. <mark>Bryant</mark> Land Company rounded out the top six teams. Lawson Ford softball"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1849.9, 637.27, 2011.63, 727.67], "bbox_id": "5e9181280c", "file": "AppomattoxNewspapers_1933-1936a_0118.pdf", "page": 1, "text": "White Sulphur Springs and Wash ington, - D .. C. Miss Edith OBrien is spending the winter in Boston, Mass. and s taking a course at the Bryant- Stratton School of business. Recent visitors in the home of Mrs. W. W. Godsey were Mrs.Boy- I er and snn Mr. and Mrs. Lee Don- oner ard son, of Washington."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "a course at the <mark>Bryant</mark>- Stratton School of business."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "a course at the <mark>Bryant</mark>- Stratton School of business."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.22, 1117.3, 1969.59, 1225.0], "bbox_id": "bc6c92f7f2", "file": "TimesVirginian_1978_0178.pdf", "page": 1, "text": "WHITE SHINGLE HOUSE ON RT. 24 IN VERA 5 MILES FROM TOWN. LAR6E L. R. WITH WHITE BRICK FIREPLACE, BATH, 2 BR DINING ROOM, REMODELED KITCHEN, PLUS 3 ROOM HOUSE ON BACK OF PROPERTY ALL ON V acre. CALL 352-7525 or 352-7984. W ILLIE BRYANT VERA, VIRGINIA"}, "highlight": {"text": {"matched_tokens": ["BRYANT"], "snippet": "or 352-7984. W ILLIE <mark>BRYANT</mark> VERA, VIRGINIA"}}, "highlights": [{"field": "text", "matched_tokens": ["BRYANT"], "snippet": "or 352-7984. W ILLIE <mark>BRYANT</mark> VERA, VIRGINIA"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.82, 977.6, 1818.45, 1442.12], "bbox_id": "c33e2b7b74", "file": "TimesVirginian_1976_0284.pdf", "page": 1, "text": "white orchid and starburst pom poms. The brides gown was made by her aunt, Mrs. Herbert Handy. Mrs. Benjamin Bryant, sister of the bride, was matron of honor. She wore a floor length gown of pink floral organza over pink satin. Also a white hat trimmed with pink ribbon and carried a long stemmed pom pom mum with satin streamers. Other attendants were Mrs. Keith Martin and Miss Wanda Doss of Appomat tox, cousins of the bride. Their floor-length dresses were iden tical to the matron of honor and they wore pink hats trimmed with pink ribbon. They carried long stemmed mums with satin streamers. Sherri Lynn Doss, sister of the bride, was junior brides maid. She wore a pink floorlength gown similar to the attendants and carried a short stemmed pink mum. Sherry Wallace, niece of the bridegroom and Ginger Bryant, niece ôf the bride, were flower girls. They wore floor-length gowns of white organza over satin trimmed with pink ribbon. They carried white baskets of flower petals. Brian Wallace, nephew of the bridegroom, was ring bearer. Mr. Charles Wallace was his brothers best man and ushers were Mr. Alfred Wallace of Richmond, and Mr. Robert Harris of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Herbert Handy. Mrs. Benjamin <mark>Bryant</mark>, sister of the bride,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Herbert Handy. Mrs. Benjamin <mark>Bryant</mark>, sister of the bride,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [283.43, 416.53, 433.64, 1007.55], "bbox_id": "bc7afa4574", "file": "AppomattoxNewspapers_1974-1975a_0499.pdf", "page": 1, "text": "While substituting at the library last summer, I had several calls for the book, Dog Days at the White House by Traphes Bryant. At that time the library did not have a copy but since then I have been informed that we now have two copies, one of which was sent by mail from Buckingham County with a note but no name signed. Thank you, anonymous donor, whoever you are. Since sixteen new books have been processed in the last two weeks, one would think it easy to find one, but believe it or not, they are all checked out and the readers clamoring for more. I managed to get two, which I read as quickly as possible and took back for others. Remem ber, it is important to do this even tho the time limit is two weeks. Never keep a new book that long if you can possibly read it more quickly, as others are waiting and wishing. The two which I read were Curtain by Agatha Christie and The i Greek Treasure by Irvin g Stone. Curtain was written in the miH 1940s and was intended to be published after her death, but for some reason, she changed her mind and released it for publication this year. This is one of her better books and will probably be classed with such Christie classics as The Murder of Roger Ackroyd The A.B.C. Murders and Ten Little Indians. Henry Schliemann, the hero of The Greek Treasure, had no formal education past his 14th birthday, yet he spoke and wrote 18 languages. The book is a love story, adventure story and archaeology combined. Sophia Mrs. Schliemann was a IT year old Greek beauty who married Schliemann mainly to help her family, financially. She soon found herself admiring"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "White House by Traphes <mark>Bryant</mark>. At that time the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "White House by Traphes <mark>Bryant</mark>. At that time the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [240.51, 310.05, 401.94, 598.03], "bbox_id": "7d9a6e332d", "file": "AppomattoxNewspapers_1908-1909a_0548.pdf", "page": 1, "text": "wheré he has been doing sSme work for the government,  Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were tfie guests ,-of Miss Florence, Smith Sunday. Mr, and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [344.4, 362.84, 501.5, 661.13], "bbox_id": "7700f10fdb", "file": "AppomattoxNewspapers_1926-1933a_0502.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden. Mr. and Mrs. J. L. Guill and"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [243.09, 332.59, 403.71, 621.08], "bbox_id": "fed12197e5", "file": "AppomattoxNewspapers_1926-1933a_0548.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [343.44, 338.59, 500.99, 636.93], "bbox_id": "5a502a4e78", "file": "AppomattoxNewspapers_1908-1909a_0502.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday.  Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Gfeneva Wingfield visited Mrs. Ernest Smith. Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden. Mr. and Mrs. J. L. Guill and"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Misses Hallie and Louise <mark>Bryant</mark> and James and Wesley"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2071.19, 1236.23, 2226.24, 1484.54], "bbox_id": "7f7d4040eb", "file": "AppomattoxNewspapers_1902-1905a_0216.pdf", "page": 1, "text": "When Trees Were Valued. Harry C. Plercy, member of th Republican Club House Committee overheard an amusing conversation at the ladies reception tn the new clut bouse last week. A very pretty glrf was talking to an elderly man. They were standing by the window In th lounging room facing Bryant Park. Oh, Colonel, said the young lady, just look at those trees! Arent they beautiful? Yes, to some extent, replied th old warrior but- Why, dont you like trees? Intec rupted the girl. Indeed I do! There were time when I positively loved themduring the war.New York Times. The Crescent Caie.."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "th lounging room facing <mark>Bryant</mark> Park. Oh, Colonel, said"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "th lounging room facing <mark>Bryant</mark> Park. Oh, Colonel, said"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [541.68, 450.86, 709.71, 1342.85], "bbox_id": "483ec1753f", "file": "AppomattoxNewspapers_1922-1923a_0251.pdf", "page": 1, "text": "When court opened here Monday a large ciowd was present the mat ter of intense interest being the Sears-Ilarvey murder trial. Three Juries and about seventy-five wit nesses had been summoneu by Sher iff McKinney besides these the rel atives and close friends on each side of the unfortunate affair were on hand, and showed as much in terest in the pioceedings as the principals. Mr. Thomas Watkins one of the ablest criminal lawyers of the State has been secured to conduct the case for the Common wealth, who will be aided by that talented young lawyer from Am herst, Mr. Aubrey E. Strode. Con gressman Flood is looking after the defence side of the case. The Grand Jury indicted Sears for murder of Harvey and the prisoner, who was out on bail ap peared in court and answered the indictment. The application for bail was made and the Judge con tinued it until morning on the mo tion of defence, and Sears was plac ed in jail for the night. On Tuesday morning the court beard the evideuce of the defence for the purpose of granting bail, at the conclusion of which the J odge granted bail m the sum of ten thousand dollars for the appear ance of the prisoner on the second day of the next erm of court, which will be the 24th day of July. Sears takes the stand and relates the story of the killing of Harvey, which was substantially as follows I was co lector of taxes my bio- ther was collector, 1 was not old enough, and he qualified and gave me the place he trouble occurred between store and shop 1 first saw Harvey as I was oil my way to col lect some scattering tickets beyond his place I bad collected Harveys ticket 1 was on my way to Dicker- sons I saw Bryant and be told me to come by aud he would pay mt we went together to Rose Bo wet saw Harvey Harvey asked about Woodsons tuxes Harvey asked about bis old ticket and said he hadnt received it I went on and came back to Rose Bower as I ode up Harvey asked if I had seeu Woodson, I said 1 had been toGoiua and would have to get him to send his taxes up to Appomattox he cursed the collector and I told him he was my brother, and he start.-d to nsing oaths again I dropped the matter and inquired the way to Gallegtiers colected Galleghers taxes and cume back to Rote Bow er, and rode up and told Bryant if he was ready we would go up to Vera together. I came back to Rose Bower with"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Dicker- sons I saw <mark>Bryant</mark> and be told me"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Dicker- sons I saw <mark>Bryant</mark> and be told me"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2037.54, 1546.68, 2184.27, 1641.18], "bbox_id": "2b8edb6a5b", "file": "TimesVirginian_1981a_0215.pdf", "page": 1, "text": "When asked if he really took the business of radng seriously or if it was just a passing fancy, Bryant laughed as he commented, Im quite serious about this business of horses and racing, I love - it. If anything, fm afraid I take it more seriously than my work.!"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "just a passing fancy, <mark>Bryant</mark> laughed as he commented,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "just a passing fancy, <mark>Bryant</mark> laughed as he commented,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [544.09, 464.09, 879.91, 762.43], "bbox_id": "7f1fd20510", "file": "AppomattoxNewspapers_1939-1943a_0058.pdf", "page": 1, "text": "Whe haVe Maycr C. S. McDearmon return accepted poeitkms. ed Monday night after a trip to Cadet George Cale, of Fork Un- Jacksonville, Florida ion. spent the week-end here. Jfc,. W. M. Morris and Mrs. Word has been received that Mrs. Collins will return home to- 8.W . Seers, who is in New York, J?10n0W after an extended visit to will undergo an operation there be fore returning to Appomattox. Miss Sadie Reynolds and Lloyd Mrs. E.A. Scott., of Suffolk,and Brdley, of Richmond spent Sunday Mias Eleanor Scott, of S. T C., ere with her parents, Mr. end FarmviUe, spent the week-end with Mrs. W .R. Reynolds. Mrs. J A. Burke - . , _ _ _ Captain P. J. Petterseon, of Camp L. W. Bryant has returned from Holebird, Baltimore, spent the week- th Veterens Facility at Roanoke. end in the home of Mr.and Mrs. w , ... C. F . Langran. Mrs. Pettersen J m I W Coleman is reported lU d daughter, Peggy, of Oklahoma, at the Virginia Baptist hospital. are spending some time in the home Friends ere sorry to bear that f M rand MrSl U n n - Jhr. B.NTwyman is sick.We wish Misa LeFern Doss accompanied for him a speedy recovery. His Miss Barbara Ann Johnson to Lynch- da ugh ter, Miss Virginia Twyman, of burg for the week-end. New, York, has been visiting Dr.  d Mrs. Twyman,  Mrs. Ola Patteson Mr. and Mrs. u . W. S. Bryant, of Cullen and Mrs. , h w. M. T.Shipman, of Williams- L. D. Puckett, of Roxboro, were burg and Miss Zeffner Hobson, of visitors in the home of Mr.and Mrs. Lyuahburg, visited in the homes of Leslie Turnes, of Prospect, Sunday.  D.N. Twyman and Mrs. M. j . H.Lawson over the week-end.  No contract bridge club will w . . meet Friday evening with Mrs.Cal- vaiUoUn Moore, who has accented I vin PAkinaA"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "of Camp L. W. <mark>Bryant</mark> has returned from Holebird,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "of Camp L. W. <mark>Bryant</mark> has returned from Holebird,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1899.81, 249.05, 2047.36, 657.95], "bbox_id": "8a3a65a78b", "file": "AppomattoxNewspapers_1962-1965a_0405.pdf", "page": 1, "text": "Whatever you do, do all to the glory of God. I Cor. 1031. Mr. Marcus Baldwin has come home from the McGuire Hospi tal. He is improving and getting along fine. Visitors in the home of Mr. and Mrs. J. L. Meadows were Mr. and Mrs. Hubert Peters, of Richmond, Mr. and Mrs. John Edwards and two children, of Charlotte Court House Mrs. Shelby Bryant and children, Mrs Retia Bryant and children, all of Cullen, and Mrs. Una Gar- rette and daughter, Peggy. Mr. and Mrs. Dean Roberts and daughter, of Richmond, and Mr. and Mrs. Jesse Lipscomb, of Madison Heights, visited Mrs. Roberts in Siemores Convales cent Home. Mrs. Melvin Arrington and children visited her mother, Mrs Mary Siemore. Those visiting Mrs. Mason were Mrs. Lillie Maddox, and Mr. James Hix, of Evington. Mothers Day guest in the home of Mr. and Mrs. Robert Tolley were Mr. and Mrs. Lester Price, Mr. and Mrs. Jesse Mill- ner and two children, Mr. and Mrs. Irving Bu-key ard children of Richmond, Mr. and Mrs. Earl Tolley, of Farmville, Mrs. Nell Chenault and daughter, Terri, of PrOspect Mrs. Carlton Guill and1 daughter, Sharon Kay, of Appo mattox, and Mr. and Mrs. Pete Tolley ahd son, Roy Allen, of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Court House Mrs. Shelby <mark>Bryant</mark> and children, Mrs Retia"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Court House Mrs. Shelby <mark>Bryant</mark> and children, Mrs Retia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.75, 537.94, 2404.41, 1043.08], "bbox_id": "29635c710c", "file": "AppomattoxNewspapers_1954-1955a_0186.pdf", "page": 1, "text": "Whatever ehance Appomattox County had of going through 1955 without a highway fatality, went glimmering about midnight Satur day. It was undoubtedly one of the worst car wrecks in the history of the county, two youn me met in stant death and two others remain in critical condition, following the crashing of a speeding car over an embankment and into a tree about four miles this side of Bent Creek on Route 26. The dead Cecil Howell -Stephens, 26, of Route 2, Gladstone, and Raymond Edward Jamerson, 29. also of Route 2, Gladstone. At latest reports, two other occu pants of the death car were still un conscious and in a very critical con dition at a Lynchburg hospital. They are Carl Bryant, 19, and Calvin Phelps, 28, both of Route 2, Gladstone. It is understood that Bryant and Phelps have fractures of the skull and leg. The death car plunged over the left side of Route 26, dopvn an em bankment and literally wrapped it self around a tree. The ear jack knifed, badly mangling the victims. After the car was prized from the tree, and brought to Appomattox Sunday morning, large crowds gath ered all during the day to view the wreckage. Other crowds drove to the wreck site on Route 26. State Police who investigated the crash, declared that high speed was the obvious cause of the wreck. These deaths started Appomattox County off into 1955 with no chance of bettering its 1954 highway death toll. Last vear there was only one highway death in the county, and that, too, occurred in January. In 1953. the county also had only one highway death."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "hospital. They are Carl <mark>Bryant</mark>, 19, and Calvin Phelps,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "hospital. They are Carl <mark>Bryant</mark>, 19, and Calvin Phelps,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [139.45, 232.18, 283.65, 1426.57], "bbox_id": "32a87891d0", "file": "TimesVirginian_1980a_0289.pdf", "page": 1, "text": "Wf MARY BAGBY But t say unto you, love your enemies, bless them that curse you, do good to them that hate you, and , pray for them which despltefully use you, and persecute you Matt 544. Friends are better than enemies, a sure way to destroy an enemy is to make him a friend. Rev. Dan Menser preach ed a fine sermon Sunday morning at Hollywood Chur ch, his text was taken from John 12 20-36. We Would See Jesus was the topic. Our hearts were saddened when word came early Sunday morning that Bever ly Ann Coleman, daughter of .Mr. and Mrs. M. J. Coleman of Rt. 2, Appomattox had been killed in a car accident. Our deepest sympathy, love and prayers are with her family and love ones. We are so glad to hear Mrs. Johnnie Bryant . is home from the hospital. We wish her a very speedy recovery. ,w. There will be a Sunday School picnic at Hollywood Church Saturday evening, Sept. 13 at 5 oclock. Come and bring a picnic basket and lets have a good time together. Mr. W. H. Wingfield goes báek to his doctor In Lynchburg today Monday for a check-up. We pray he may soon be feeling better. Mr. and Mrs. Thomas Woodall and Lisa and Mrs. Mary Bagby were visitors Thursday night of Mr. and Mrs. Andy Davis and Robin. Mr. and Mrs. Davis were in Farmvillé Friday night. The occasion was to celebrate Mrs. Davis birthday. Mr. and Mrs. Timothy Rawsdell and son, Jason entertained in honor of Mrs. Rawsdell parents, Mr. and Mrs. Alfred Almond ann iversary Thursday night with a dinner at Long John Silver fish house. Mr. and Mrs. Richard .W ebb and Mr. Walker Webb  were supper guest Sunday night of Mr. and Mrs. David Repass and family,jjiven in honor of Mrs. Repass father, Mr. Richard Webb. Mr. and Mrs. Roger Garlick and family of Arvada, Colorado Mrs. Samada 1 Ingie.. spent SJast week at Emerald Isle, HJC. Visiting Mr. and Mrs. Robert Coleman last week were Mr. Myrt Mann of Gretna, Mr. Calvin Smith and son, Bobby. Mrs.  Mike Lewis was given  stork shower Sunday- afternoon in the home of Mr. and Mrs. James. Conner. She received a lot of nice and useful gifts. Mr. Grover Beasley Jr. visited his mother, Mrs. Virgie Beasley Sunday Visiting in the home of Mr. and Mrs. Monroe Webb and family were Mr. and Mrs. L. L. Webb, Miss Joyce Webb, Mr. Scott Sheets and Mr. and Mrs. Willie Craft and Kristie. Mr. and Mrs. Thomas Woodall and Lisa were over night guest of Mr. and Mrs. Aaron Wilson of Richmond Friday night. They enjoyed the day Saturday at Kings Dominion. Mr. and Mrs. Alfred Almond and Mr. and Mrs. Wayne Smith and family spent Sunday with Mr. .Almonds sister, Mrs. Alma Fortune of Ashland, Va. They also visited Mr. and Mrs. Elwood Smith and family. Mr. and Mrs. Tim Carter and Mr. Myrt Mann visited Mr. W. H. Jenkins Monday. Mr. and Mrs. Kenneth Deaner and family spent the weekend in Newport News"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "to hear Mrs. Johnnie <mark>Bryant</mark> . is home from the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "to hear Mrs. Johnnie <mark>Bryant</mark> . is home from the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [195.07, 1258.4, 873.53, 1361.68], "bbox_id": "d8ca77d7db", "file": "TimesVirginian_1976_0163.pdf", "page": 1, "text": "Western Auto 1 Amelia Dress 1 Oakville 1 Card. C Jamerson Brostl Bryant Tracking 0 Pamplin 0 Merry W right and Sandy Jamerson. Portraits Meke Excellent Mothers Day Presents"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Western Auto 1 Amelia Dress 1 Oakville 1 Card. C Jamerson Brostl <mark>Bryant</mark> Tracking 0 Pamplin 0 Merry W right and Sandy Jamerson. Portraits Meke Excellent Mothers Day Presents"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Western Auto 1 Amelia Dress 1 Oakville 1 Card. C Jamerson Brostl <mark>Bryant</mark> Tracking 0 Pamplin 0 Merry W right and Sandy Jamerson. Portraits Meke Excellent Mothers Day Presents"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [192.23, 483.35, 350.01, 588.44], "bbox_id": "bcfb3f9cb9", "file": "AppomattoxNewspapers_1926-1933a_0544.pdf", "page": 1, "text": "were Sunday before last guests of Mrs. Ossie Ferguson. Miss Mattie Viar, of Lynch burg, visited h e r aunt, Mrs. Emma Bagby, last week- Mr. and Mrs. R. P- Bryant spent Sunday with Mr. and Mrs. C. R. Banton. Misses Rachel and Ruby Ferguson and Mr. Arnold Chil-"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and Mrs. R. P- <mark>Bryant</mark> spent Sunday with Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and Mrs. R. P- <mark>Bryant</mark> spent Sunday with Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [186.68, 461.22, 508.69, 681.51], "bbox_id": "46f3cb7e9d", "file": "AppomattoxNewspapers_1908-1909a_0543.pdf", "page": 1, "text": "were Sunday before last guests of Mrs. Ossie Ferguson. Miss Mattie Viar, of Lynch burg, visited h e r aunt, Mrs. Emma Bagby, last week- Mr. and Mrs. R. P. Bryant spent Sunday with Mr. and Mrs. C. R. Banton. cumbents were elected w i t h Misses Rachel and Riiby II. E- Griffin, Vice-Moderator. Ferguson and Mr. Arnold Chil-1 The body proceeded with the dress, of Lynchburg, visited Regular order of business, dis- Misses Fergusons parents, Mr- posing of all local work the and Mrs- H. W. Ferguson, re-first day. In the absence of re cently. port on Temperance, the Mrs. Johnson and littlesubject was discussed by Revs, -daughter, of Richmond, a n d Burnett,- Sadler and Loving Mrs. Maude Lucado, of Appo-and adopted. Mrs. H. E Grif- mattox, were Wednesday fin made report on Orphan- guests of Mrs. Ossie Ferguson, age which was discussed by Mr. and Mrs. G- P. Beasley, Revs. Henderson, Davis, and J. and children were in FarmvillelS. Cobb, a former member of"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and Mrs. R. P. <mark>Bryant</mark> spent Sunday with Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and Mrs. R. P. <mark>Bryant</mark> spent Sunday with Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.79, 471.39, 1629.78, 519.99], "bbox_id": "c3a4b7c22b", "file": "AppomattoxNewspapers_1960-1962b_0551.pdf", "page": 1, "text": "were so sorry to hear Mrs. Clayton Bryant had to eir baby daughter to the Friday night W e. hope for eedy recovery."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "were so sorry to hear Mrs. Clayton <mark>Bryant</mark> had to eir baby daughter to the Friday night W e. hope for eedy recovery."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "were so sorry to hear Mrs. Clayton <mark>Bryant</mark> had to eir baby daughter to the Friday night W e. hope for eedy recovery."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1467.37, 225.77, 1613.3, 826.37], "bbox_id": "4d97a0926a", "file": "AppomattoxNewspapers_1962-1965a_0344.pdf", "page": 1, "text": "were Mrs. Wilson Scruggs and Nancy. Mr. D. L. Smith and Mr Walker and Martin Webb. Mi. Robert Ducky Childress continues ill in the University Hospital in Charlottesville. We wish for him a speedy recovery. In last weeks news letter the item where a house warming party was given Mi, and Mrs. John Goin and family the name of Mrs. Marvin Glover, Jr. was omitted. It should have been that Mrs. Marvin Glover, Jr. Mrs. M. J. Coleman and Mrs. J. A. Car- son were co-hostess to this party. We are very sorry Master Tye Beasley is sick. We hope hè may soon be well. Mr. and Mrs. Frank Woodall and Mr. and Mrs. W. H. Wing field and family, of Lynchburg, were dinner guests Sunday of Mr and Mis. Charlie Bagby. Friends are glad to hear Mr. Dick OBrien is reported some better. We do hope he may soon be well. Mr. and Mrs. R. M. Webb spent Saturday in Lovingston with Mr. and Mrs. Herman Rob inson and family. Mr. and Mrs. Charlie Bagby called in the home of Mrs. Em ma Lemon Friday. Friends are so glad Mrs. Nona Bryant is able to be out again. She is visiting her daughter and son-in-law, Mr. and Mrs. J. A. Carson. Mr. and Mrs. R. G. Austin and Tommy visited Mr. and Mrs. C. R. Banton Saturday afternoon. M,r. and Mrs. Vernon Beasley and Linda, of Woodbridge, Mr. and Mrs. Benjamin Beasley arid family, of Bedford, and Mr. and Mrs. Grover Beasley, Jr., of Ap pomattox, spent a part of last week in Lynchburg with their mother, Mrs. Grover Beasley, Sr and sister, Miss Dorothy Beasley and to be with their father, Mr. Grover Beasley, Sr. at the hos pital. Our pastor, Rev. W. H. Elder, is teaching the book of Ephes ians this week at Hollywood. Those who dont attend this class will truly miss something. Mr. Elder is a wonderful teacher. Mrs. Robert Coleman and Mrs. W. T. Covington visited Mr. and"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "so glad Mrs. Nona <mark>Bryant</mark> is able to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "so glad Mrs. Nona <mark>Bryant</mark> is able to be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2196.95, 254.83, 2336.91, 385.28], "bbox_id": "92e2d1f13a", "file": "AppomattoxNewspapers_1962-1965a_0224.pdf", "page": 1, "text": "were Mrs. Lillie Dunaway, of Nathlia and Lyle Davidson, of Columbus, Ohio. Mr. and Mrs. Clayton Bryant and family spent several days at Virginia Beach last week with friends. Mr. and Mrs. Black, from Ab- ington visited in the home of Mr. and Mrs. Joe Thornhill last week. Mi, and Mrs. F. T. Duncan., of Faber, were guests of Mr. and Mrs. Paul Thornhill Friday after noon."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Clayton <mark>Bryant</mark> and family spent several"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Mr. and Mrs. Clayton <mark>Bryant</mark> and family spent several"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2160.69, 281.11, 2333.74, 360.96], "bbox_id": "24b649e759", "file": "AppomattoxNewspapers_1955-1957a_0559.pdf", "page": 1, "text": "were Mr. and Mrs. L. H. Watson, Mr. and Mrs. Paul M. Gunter and children, Mr. and Mrs. Roy Gunter and son, Mr. and- Mrs. Doc Spiggle, Mr. and Mrs. Ducky Childress and son, Mr. and Mrs. Howard Rosen and children, Mrs. Johnnie Bryant and children, and Mr. Ben Gunter."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and children, Mrs. Johnnie <mark>Bryant</mark> and children, and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and children, Mrs. Johnnie <mark>Bryant</mark> and children, and Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1372.09, 483.63, 1465.96, 690.62], "bbox_id": "52e2fff97e", "file": "AppomattoxNewspapers_1974-1975a_0114.pdf", "page": 1, "text": "were also presented i and a necklace with being presented long red roses as Chapte heart. Dance decorations around the theme SI and featured a river each of the sweetli captain quarters, showboat for the bi river boats on each candlelight and si suspended from the ce The lucky FFA included Gary Goi Reynolds, Donnie Thd Tommy Bryant. Approximately 350l and guest attended."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Reynolds, Donnie Thd Tommy <mark>Bryant</mark>. Approximately 350l and guest"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Reynolds, Donnie Thd Tommy <mark>Bryant</mark>. Approximately 350l and guest"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2036.61, 540.93, 2184.42, 767.92], "bbox_id": "2b753f9f74", "file": "TimesVirginian_1981a_0402.pdf", "page": 1, "text": "were all named to the second All-Seminole District offensive squad. Trent is a lineman, Ferguson a quarterback and kicker, and Bryant is a running back...,  On defense, Rick Miller, Robert Paulette, and Mark Kelso were named to the second team All-Seminole Dis trict unit last week. Miller is a defensive end, Pajulétte a defensive tackle, and Kelso a defensive back. 2  Receiving honorable mention in the voting for the All Seminole District football team were Mark Kelso split end, Rodney Bryant defensive back and Jeff Miller defensive end."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "quarterback and kicker, and <mark>Bryant</mark> is a running back...,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "quarterback and kicker, and <mark>Bryant</mark> is a running back...,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2227.17, 1009.25, 2349.76, 1475.67], "bbox_id": "f47def05c4", "file": "TimesVirginian_1983a_0267.pdf", "page": 1, "text": "well, Klizabet h Broch ard. Connie Sa ndman. F lien Arment rout and Wanta Daley. Jimdor Cadett,es and Senior Scouts are De- nise Drinkard, Tracy I owdy. Jennifet r Jam- er son . Crystal Alien, Ange la.Harris, J oet rica Humîles. Boxantne Wil- liants,, Ginger Bryant Allis,,n Gilliam, Lucille Lewi-s. Tanya Bnnchard. AlsO, Michelip Car- w ile. Kathy Tórreme, Annetie C a s h w e 1 1, Anne Phennix, Aman da IVanklin, Morlisa Mostoy, Jane Armen t rout and Hattie Wri ght. Brtwnie ScoutIs wert Bobiri Bohertson, Amy Barr, Teresa Ftranklin. Moni,ra Frankliin. Me Ian ie Hudson, Kerri Brochardl Jodi Young blood, Shelia Daley, Jeannie Brochard, Lau ra WiJIiams, Nikki Har ris. Stacy OBrien, Susan Carson, Nikki Hudson. Tracy Gilliam. Jenny Sandman, Mary Kat Wright. Kenya 1  Wooldridge. The Small Fry Unit was composed of Brian Jamerson. J e f f r e y Franklin. M a t t h e w Sandman. Chad Broch ard. Arshay Humbles, Shawn Cashwell. Mich ael Dalev."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Boxantne Wil- liants,, Ginger <mark>Bryant</mark> Allis,,n Gilliam, Lucille Lewi-s."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Boxantne Wil- liants,, Ginger <mark>Bryant</mark> Allis,,n Gilliam, Lucille Lewi-s."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2233.48, 274.99, 2548.45, 397.39], "bbox_id": "8b34b4e977", "file": "AppomattoxNewspapers_1926-1933a_0578.pdf", "page": 1, "text": "well, Evergreen Bernard Car- son Richardson, Appomattox William Williams, Pamplin Willie Washington Bryant, Ap pomattox Frank Eugene Fer guson, Appomattox Robert Eames colored, Appomattox, and Sam Ferguson colored, work under President veils development plan Aulhur"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Williams, Pamplin Willie Washington <mark>Bryant</mark>, Ap pomattox Frank Eugene"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Williams, Pamplin Willie Washington <mark>Bryant</mark>, Ap pomattox Frank Eugene"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2387.47, 264.7, 2545.52, 358.6], "bbox_id": "166f75a5f9", "file": "AppomattoxNewspapers_1908-1909a_0578.pdf", "page": 1, "text": "well, Evergreen Bernard Car- son Richardson, Appomattox William Wilims, Famplin Willie Washington Bryant, Ap pomattox Frank Eugene Fer guson, Appomattox Robert Eames colored, Appomattox, and Sam Ferguson-, colored. Concord Depot."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "well, Evergreen Bernard Car- son Richardson, Appomattox William Wilims, Famplin Willie Washington <mark>Bryant</mark>, Ap pomattox Frank Eugene Fer guson, Appomattox Robert Eames colored, Appomattox, and Sam Ferguson-, colored. Concord Depot."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "well, Evergreen Bernard Car- son Richardson, Appomattox William Wilims, Famplin Willie Washington <mark>Bryant</mark>, Ap pomattox Frank Eugene Fer guson, Appomattox Robert Eames colored, Appomattox, and Sam Ferguson-, colored. Concord Depot."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [407.5, 423.0, 698.23, 452.14], "bbox_id": "388d0d0988", "file": "AppomattoxNewspapers_1962-1965a_0055.pdf", "page": 1, "text": "weighing about 70 lbs. each. I condition. D a n i e l C. Bryant, Percy W. George, Phone 352-3050! Route 3, phone 352-2428. Appo- 11-22-lt I mattox, Va."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "weighing about 70 lbs. each. I condition. D a n i e l C. <mark>Bryant</mark>, Percy W. George, Phone 352-3050! Route 3, phone 352-2428. Appo- 11-22-lt I mattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "weighing about 70 lbs. each. I condition. D a n i e l C. <mark>Bryant</mark>, Percy W. George, Phone 352-3050! Route 3, phone 352-2428. Appo- 11-22-lt I mattox, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [638.08, 925.91, 1399.44, 1047.36], "bbox_id": "a38b6bdf8a", "file": "AppomattoxNewspapers_1955-1957a_0313.pdf", "page": 1, "text": "Weep not that the world changes did it keep A stable, changeless state, Twere cause indeed to weep. Bryant.  ch en l G olden a g e BRAND"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Weep not that the world changes did it keep A stable, changeless state, Twere cause indeed to weep. <mark>Bryant</mark>.  ch en l G olden a g e BRAND"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Weep not that the world changes did it keep A stable, changeless state, Twere cause indeed to weep. <mark>Bryant</mark>.  ch en l G olden a g e BRAND"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1626.68, 216.73, 1765.17, 582.86], "bbox_id": "383b033e7f", "file": "TimesVirginian_1980a_0213.pdf", "page": 1, "text": "week. Mrs. Dan Menser visited relatives in Pennsylvania last week end and attended the Paul Sarner re-union Sunday. We were indeed sorry to hear of the death of Mrs. James Maxwells sister and nephew last week in Oregon and St. Louis. Mrs. Maxwell left Friday byphone for St. Louis, bur. Bui Light of Washington attended his j aunts funeral in Oregon Sunday. Our sincere sym pathy is extended their families and love ones. We are very sorry tp hear Mrs. Artis Maxwells mother, Mrs, Lucy Gfover, is ill in the home of her daughter, Mrs. Calvin Morris and family. We pray she i6ay soon be feeling much better . Mr. and Mrs. L. L. Webb and Miss Joyce Webb visited. Mr. and Mrs. Howard Gilbert Sunday evening. We were very sorry to hear Mrs. Johnnie Bryant  broke her ankle last week. She is at her home from the hospital. We wish for Her A very speedy recovery."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "to hear Mrs. Johnnie <mark>Bryant</mark>  broke her ankle last"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "to hear Mrs. Johnnie <mark>Bryant</mark>  broke her ankle last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.58, 1695.66, 1854.08, 1779.06], "bbox_id": "14994e1fca", "file": "AppomattoxNewspapers_1955-1957a_0228.pdf", "page": 1, "text": "WED AFTER 50 YEARS Costa Mesa, Calif.- Charles Bryant, 82, of Centralia, 111., learn ed that his boyhood sweetheart, now 80, had been widowed. So he drove here and continued the courtship. He and Mrs. Lou McDonald were re cently married."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Costa Mesa, Calif.- Charles <mark>Bryant</mark>, 82, of Centralia, 111.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Costa Mesa, Calif.- Charles <mark>Bryant</mark>, 82, of Centralia, 111.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [428.88, 166.31, 679.01, 193.31], "bbox_id": "5cd8d137d9", "file": "TimesVirginian_1981a_0369.pdf", "page": 1, "text": "Webb, Bryant, Trènt,"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Webb, <mark>Bryant</mark>, Trènt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Webb, <mark>Bryant</mark>, Trènt,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1986.93, 722.43, 2128.18, 816.99], "bbox_id": "922d765fc6", "file": "AppomattoxNewspapers_1971-1973a_0252.pdf", "page": 1, "text": "We would like to thank re latives, friends and neighbors for their every kindness  flowers, prayers, food and cards during our bereavement in the loss of our sister, Miss Nellie Grace Bryant. Bryant Brothers _ _________ 3-16-lt"}, "highlight": {"text": {"matched_tokens": ["Bryant", "Bryant"], "snippet": "sister, Miss Nellie Grace <mark>Bryant</mark>. <mark>Bryant</mark> Brothers _ _________ 3-16-lt"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "Bryant"], "snippet": "sister, Miss Nellie Grace <mark>Bryant</mark>. <mark>Bryant</mark> Brothers _ _________ 3-16-lt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2328.26, 529.59, 2468.75, 641.09], "bbox_id": "6bb1309f34", "file": "AppomattoxNewspapers_1962-1965a_0145.pdf", "page": 1, "text": "We would like to take this op portunity to thank our many friends and relatives for the kindness shown us during Da vids illness while in the Univer sity of Virginia and the Virginia Baptist Hospital and since his return home. Also for cards, gifts, visits and prayers. May God bless each of you. Thank you, Bobby and Mary Frances Bryant 4-11-lc"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Bobby and Mary Frances <mark>Bryant</mark> 4-11-lc"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Bobby and Mary Frances <mark>Bryant</mark> 4-11-lc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2090.9, 872.54, 2233.41, 1008.09], "bbox_id": "edbb2109f6", "file": "AppomattoxNewspapers_1974-1975a_0411.pdf", "page": 1, "text": "We would like to express our sincere appreciation to the friends, relatives, neighbors and ministers for all acta of kindness during the illness and death of Dorothy Bryant, now aid far the past four years Everyone has been so wonder ful it made her sick days easier to bear. May God bless each one of you. Robert, Joey, Frances, Brothers and Sisters"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "and death of Dorothy <mark>Bryant</mark>, now aid far the"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "and death of Dorothy <mark>Bryant</mark>, now aid far the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
