{"document": {"bbox": [1371.06, 793.93, 1425.95, 812.93], "bbox_id": "0ec9f2ddc8", "file": "AppomattoxNewspapers_1960-1962b_0390.pdf", "page": 1, "text": "Button"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "<mark>Button</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "<mark>Button</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1456.38, 402.79, 1597.13, 508.03], "bbox_id": "a1e44916e4", "file": "AppomattoxNewspapers_1962-1965a_0356.pdf", "page": 1, "text": "ZIG-ZAG SEWING MACHINE Lilfe new Cabinet Model Auto matic. Make button holes, sews on buttons, etc. Guarantee still good 10 years. Must have good credit. Take over payments or pay off balance of 48.77. For de- fails write Nationals Credit Manager, Mr. Blackburn, Box 814, Lynchburg, Virginia. 2-20-4t"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Model Auto matic. Make <mark>button</mark> holes, sews on buttons,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Model Auto matic. Make <mark>button</mark> holes, sews on buttons,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.55, 255.79, 1753.47, 362.24], "bbox_id": "3732266788", "file": "AppomattoxNewspapers_1962-1965a_0349.pdf", "page": 1, "text": "ZIG-ZAG SEWING MACHINE Like new Cabinet Model Auto matic. Make button holes, sews cn buttons, etc. Guarantee still good 10 years. Must have good credit. Take over payments or pay off balance of 48.77. For de tails write Nationals Credit Manager, Mr. Blackburn, Box 814, Lynchburg, Virginia. 2-20-4t"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Model Auto matic. Make <mark>button</mark> holes, sews cn buttons,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Model Auto matic. Make <mark>button</mark> holes, sews cn buttons,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.78, 405.29, 1614.89, 490.13], "bbox_id": "870076f26f", "file": "AppomattoxNewspapers_1962-1965a_0337.pdf", "page": 1, "text": "ZIG ZAG SEWING MACHINE Like new Cabinet Model. Makes button holes, Sews on buttons, etc. Take over payments or pay off balance of 51.20. Guarantee still good. Must have good credit. For details write Mr. Parker P. O. Box 2011, Lynchburg, Va. l-23-3t"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "new Cabinet Model. Makes <mark>button</mark> holes, Sews on buttons,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "new Cabinet Model. Makes <mark>button</mark> holes, Sews on buttons,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [367.19, 527.42, 514.26, 611.57], "bbox_id": "44a7f125b4", "file": "AppomattoxNewspapers_1962-1965a_0331.pdf", "page": 1, "text": "ZIG ZAG SEWING MACHINE Like new Cabinet Model. Makes, button holes. Sews on buttons, etc. Take over payments or pay off balance of 5120. Guarantee still good. Must have good credit. For details write Mr. Parker  P. O. Box 2011, Lynchburg. Va. l-23-3t"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "new Cabinet Model. Makes, <mark>button</mark> holes. Sews on buttons,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "new Cabinet Model. Makes, <mark>button</mark> holes. Sews on buttons,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.96, 1101.6, 1803.71, 1354.99], "bbox_id": "5e0f6cb28b", "file": "AppomattoxNewspapers_1892-1898a_0266.pdf", "page": 1, "text": "Zealous for spiritual good of all. Even grieved if one brother fall.  Possessing a heart so noble and true. Proving what the weak I. H. N. can do. We wish the little paper could be in the hands of every invalid iu the country, it is such a comforting, cheering little sheet.,. Mrs. S. D. Saunders of Burke-, ville and Mr. C. Y. Hooper, of New Store, was visiting friends in this neighborhood last week. Farmers are already making preparations for another crop cleaning off their lands, filling up gullies, plowing whenever dry enough. One neighbor has planted his early irish potato crop, as the little Irishman says we bet you a button, our Times will be good in the hands of the new editors. Success to both. K."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "we bet you a <mark>button</mark>, our Times will be"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "we bet you a <mark>button</mark>, our Times will be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1351.9, 712.68, 1489.71, 1004.72], "bbox_id": "4b8b10b64f", "file": "AppomattoxNewspapers_1905-1912a_0479.pdf", "page": 1, "text": "ytìurveyor- 8CHOOL OFFICBltS. Hannab, Snpt.. Appomattox J. O uuuinattox S. J. Lee, Appomattox amilton, Keergreep Joel WatBiaa E DicXeraou, Appomattox U. A , evergreen V. K. Lewta. Vera J .e uout spring, J. O Davidson Appo- SOCTHblDB DISTRICT. rvisorJ. B. Atwood, Appomattox. Ilioit. U. Mann, Appomattox. OommiMlonera. J. Lee, Appomat- -esot tbe Peace-J. T. Lee. Appomat- d W. L. brown, Bveigreen T, w. ttox. Appomattox er Poor-o. O. Harvey, Appou OIOVBB HILL DISTRICT. rvisorC M. Drinkard. Appomattox. DieB. M. Drinimrd, Appomattox. UommlisionerU. K. Pittman, Kver- icesol tbe PeaoeP. H. d F. A. UUnea, Appoi -r ot tbe Puor-D. P. Gilliam, Hlx- aattox. Ferguson. STOMBWALL DISTRICT.. rvisor- M. W. Carson, Spout Spring, tableL. A. Walton, Bent Creek. CommissionerU. U. Harding, ct ul tne PeaceObaa. K. Button ra Ford, F. U. Tborp, Oakville an W. Bavluson, Vera. - aeer ot tbe PoorK. T. Pbelpa UUOK1NUUAM. - urerJames L. Anderson, portoffloe lttce Buek- nam riffLewis Williams, posto obenffD. M. Word, poitetttoe"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "ul tne PeaceObaa. K. <mark>Button</mark> ra Ford, F. U."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "ul tne PeaceObaa. K. <mark>Button</mark> ra Ford, F. U."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1524.49, 527.64, 1682.22, 1723.63], "bbox_id": "184d11101b", "file": "AppomattoxNewspapers_1915-1918a_0341.pdf", "page": 1, "text": "Youve waited one day too long to collect for your strawberry, De Spain, cried Logan shrilly. Youve turned one trick too many on the sinks, young fellow, if the man that put your mark on yJu aint in this room, youU never get him. Which means, I take it, youre going to try to get me, smiled De Spain. No, bellowed Morgan, it means we have got you., You are fooling yourself, Harvey. be Spain addressed the warning to Lo gan. And you, too, Sandusky, he added. Well take care of that, grinned Logan. Sandusky kept silence. You are Jumping into another mans fight, protested De Spain steadily. Sassoons fight is our fight, inter rupted Morgan.   I advise you, said De Spain once more, looking with the words at San dusky and his crony,to keep out of I t Sandusky, yelled Logan to his partner, he advises me and you to keep out of this fight, he shrilly laughed. Sure, assented Sandusky, but with no variation in tone and his eyes on De Spain. Logan, with an oath, leaned over the bar toward Sassoon, and pointed con temptuously toward the end of the bar. Shike! he cried, step through the rail and take that mans gun. De Spain, looking from one to the other of the four faces confronting him, laughed for the first time. vBut he was looking without seeing what he seemed to look at. In reality, he saw only a cut-glass button. He was face to face with taking a mans life or surrendering his own, and he knew the life must be taken In such a way as Instantly to disable Its possessor. These men had chosen their time and place. There was nothing for it but to meet them. Sassoon was stepping toward him, though very doubtfully. De Spain laughed again, dryly this time. Go slow, Sassoon, he said. That gun Is loaded. If you want terms, hand over your gun to Sassoon, cried Logan. Not till Its empty, returned De Spain. Do yon want to try taking It? he demanded of Logan, his cheeks burning a little darker. Logan never answered the question. It was not meant to be answered. For De Spain asked it only to cover the spring he made at that Instant into Sanduskys middle. Catlike though It was, the feint did not take the big fel low unprepared. He had heard once, when or where he could not tell, but he had never forgotten the hint, that De Spain, a boxer, was as quick with his feet as with his hands. The out law whirled. Both men shot from the hip the reports cracked together. Gne bullet, grazing the fancy button, smashed through the gaudy waistcoat  the other, as De Spains free hand struck at the muzzle of the big mans gun, tore into De Spains foot. San dusky, convulsed by the frightful shock, staggered against De Spains arm, the latter dancing tight against him. Logafi, alive to the trick but caught behind his partner, fired over Sanduskys right shoulder at De Spains head, flattened sidewise against the gasping outlaws breast. Hugging his shield, De Spain threw his second shot over Sanduskys left shoulder Into Logans face. Logan, sinking to the floor, never moved again. Supporting with extraordinary strength the un wieldy bulk of the dying butcher, De Spain managed to steady him as a buf fer against organs flre until he could send a slug over Sanduskys head at the instant the latter collapsed. Mor gan fell against the bar. Sanduskys weight dragged De Spain down. For an instant the four men sprawled in a heap. Sassoon, who had not yet got an effective shot across at his agile enemy, dropping his revolver, dodged under the rail to close. De Spain, struggling to free himself from the dying man, saw, through a mist, the greenish eyes and the thirsty knife. He fired from the floor. The bullet shook without stopping his enemy, and De Spain, partly caught under San duskys body, thought, as Sassoon came on, the game was up. With an effort bora of desperation, he dragged him self from under the twitching giant, freed his revolver, rolled away, and, with his sight swimming, swung the gun at Sassoons stomach. He meant to kill him. The bullet whirled the white-faced man to one side, and he dropped, but pulled himself, full of fight, to his knees and, knife in hand, panted forward. De Spain, rolling has tily from him, staggered to his feet, and, running in as Sassoon tried to strike, beat him senseless with the butt of his gun. His own eyes were streaming blood, His head was reeling and he was breathless, but he remembered those p t the gang waiting outside. He still could see dimly the window at the end of the bar. Dashing his fingers through the red stream on his fore head, be ran for the window, smashed through the sash Into the patio and fonnd Sassoons horse trembling at the fusillade. Catching the lines and the"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "saw only a cut-glass <mark>button</mark>. He was face to"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "saw only a cut-glass <mark>button</mark>. He was face to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2359.44, 1714.96, 2516.51, 1754.39], "bbox_id": "d1b397ea8a", "file": "AppomattoxNewspapers_1905-1912a_0338.pdf", "page": 1, "text": "Your Picture on a Button io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block North of Court Green."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block North of Court Green."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block North of Court Green."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [325.48, 1548.42, 481.55, 1587.34], "bbox_id": "477d472410", "file": "AppomattoxNewspapers_1905-1912a_0364.pdf", "page": 1, "text": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block North of Court Green."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block North of Court Green."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block North of Court Green."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2389.44, 1714.05, 2553.99, 1754.25], "bbox_id": "b307b0459f", "file": "AppomattoxNewspapers_1905-1912a_0318.pdf", "page": 1, "text": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block North of Court firnru"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block North of Court firnru"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Your Picture on a <mark>Button</mark> 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block North of Court firnru"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2193.09, 1404.48, 2418.02, 1477.38], "bbox_id": "cf8937f39c", "file": "TimesVirginian_1983a_0404.pdf", "page": 1, "text": "your companys specific requirementscurrent and future. And since we re already servicing your company, were the best ones to do it. Call Continental today and lets talk. The time you spend will be very productive. And he plan we present will be right on the button"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "be right on the <mark>button</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "be right on the <mark>button</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [682.52, 655.55, 858.11, 1024.34], "bbox_id": "823e7ef944", "file": "AppomattoxNewspapers_1943-1947a_0161.pdf", "page": 1, "text": "Youd be surnri-ed at how many boys write in to this cfihimn and complain that theyre being neglect- ed. All right, toys, you asked foi it. Dont say we didnt warn you. Hows your Loaf Life?It s cata clysmic if youre wearing one f j those Don OConnor loafer jackels - J and you probably are! How. do you  feel about the way the gals have  stolen them right off your man y j shoulders? Slick Slacks- -Of course, youre still blinding us with those violent  cords, but its your I new Glen plaids that make your Able Grable I sing,  My Beloved Is Rugged. In the Know About BowsThey tell us that youre wearing your Si natra bowties on your belt buckles. Say it isnt so! Up Your SleevesLots of boys are wearing those leather dog collars as bracelets. As many as five on a wrist, all in different colors! Its brutal. Sweater FavoriteIts an up and coming sweater style with the wolvesthis button front, sleeveless job. Watch out, boys, the gals will steal it from you, just as theyve made away with your argyles arid reindeers, your V necks and your sleeveless pull-ons."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "style with the wolvesthis <mark>button</mark> front, sleeveless job. Watch"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "style with the wolvesthis <mark>button</mark> front, sleeveless job. Watch"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [424.71, 1412.59, 2603.72, 1510.17], "bbox_id": "01601a0f61", "file": "AppomattoxNewspapers_1971-1973a_0239.pdf", "page": 1, "text": "You shouldnt be doing dishes, pots and pans by hand. You can do them all with a push of a button with a brand new KitchenAid dishwasher. Choose from our complete line of built-ins, portables, and 48 dishwasher-sink combinations  all built better, not cheaper. COOKIES VALLEYDALE PURE LB. Grape Juice"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "a push of a <mark>button</mark> with a brand new"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "a push of a <mark>button</mark> with a brand new"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [403.69, 1385.1, 646.04, 1451.95], "bbox_id": "16c9f09a1a", "file": "AppomattoxNewspapers_1971-1973a_0191.pdf", "page": 1, "text": "You shouldnt be doing dishes, pots and pans by hand. You can do them all w ith a push of a button with a brand new KitchenAid dishwasher. Choose from our complete line of built-ins, portables, and 48 dishwasher-sink combinations  all built better, not cheaper."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "a push of a <mark>button</mark> with a brand new"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "a push of a <mark>button</mark> with a brand new"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.44, 1551.18, 1827.56, 1608.68], "bbox_id": "bdcfcb3c3c", "file": "TimesVirginian_1980a_0395.pdf", "page": 1, "text": "You Program the 10 local Public Service Frequencies you wort by pushing a few buttons. Push another button to scan for action. Its at easy as it it exciting. Step into Tomorrow with a Bearcat 210."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "few buttons. Push another <mark>button</mark> to scan for action."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "few buttons. Push another <mark>button</mark> to scan for action."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [437.72, 1413.02, 617.07, 1470.32], "bbox_id": "e3ce9831b3", "file": "TimesVirginian_1980a_0415.pdf", "page": 1, "text": "You Program the 10 local Public Service Frequencies you want by pushing a few buttons. Push another button to man  for action, its m easy as it is txeMrtg. Step into Tomorrow with s Bearcat 210."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "few buttons. Push another <mark>button</mark> to man  for action,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "few buttons. Push another <mark>button</mark> to man  for action,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1928.37, 874.61, 2085.94, 1565.48], "bbox_id": "ca772e6295", "file": "AppomattoxNewspapers_1915-1918a_0142.pdf", "page": 1, "text": "you keep it and want to realize on it at any time before you begin to put the finishing forms on the dam, Ill do this Ill agree to market it for you at par. Now lets quit and go and find Gene. Shell think weve tippled our selves under the table. One moment, said Brouillard. I couldnt Serve as your engineer, Mr. Cortwright, not even in a consulting capacity. Call It prejudice or anything else you please, but I simply couldnt do business in an associate relation with your man Hosford. Cortwright had risen, and he took his guest confidentially by the button hole. Do you know, Brouillard Hosford gets on my nerves, too? Dont lht that influence you Well let Hosford go. We needed him at first to sort of knock things Into shape it takes a man of his caliber in the early stages of a project like ours, you know. But he has outlived his usefulness and weU drop him. Lets go upstairs Late in the evening Brouillard passed out through the cafe of the Metropole on his way to his quarters. There were a few late diners at the tables, and Bongras, Bmug and compla cent in evening regalia, was waddling about among thorn like a glorified head waiter. Holding the engineer for a moment at the street door, T11 been wanting to h-ask you, whispered the French man With a quick-flung glance for the diners at the .nearest of the tables, doz floodwhen she is coming, Msieu Brouillard? i When we get the dam completed. Youll bet money h -011 dat?h-al de money you got? Why should you doubt it? Mol, I dont doubt nottings I make de grass to he cut wile de sun is shine. But Ill been hearing somebody Bay dat maybe-so dis town she grow so fas and so beeg dat de goverment is not going to drown her. Who said that? I dont know it is bruitwhat AOu call rumaire. You hear it h-odfde avenue, in de cafe, h-anywerqs you go. Dont lower your prices on  the strength of any such rumor as that. Poodles. The dam will be built, and the Niquoia will be turned into a lake, with the Hotel Metropole comfortably anchored in the deepest part of it that Is, if it doesnt get gay enough to float. Dats juz what Ill been thinking, smiled the little-man, and be sped the parting guest with a bow that wtfftld hav graced the antechamber ot a Louis le Grand.  , - 1  I I Ml I 1 , 1 1 1  1  ! t Do you believe that Brouillard  1 wilt permit himself to be se-  ? duced by Cortwrights smooth i i form of bribery? Doe3 Brouil-  I lard understand Cortwright?  1 TO B E CON TINUED ."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "guest confidentially by the <mark>button</mark> hole. Do you know,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "guest confidentially by the <mark>button</mark> hole. Do you know,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.22, 953.03, 1625.65, 1010.08], "bbox_id": "6cce377841", "file": "AppomattoxNewspapers_1947-1949a_0497.pdf", "page": 1, "text": "you have done if turned up? thing, he said, NflljBss this little button     B e . The police would H tiuilding in just a few"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "you have done if turned up? thing, he said, NflljBss this little <mark>button</mark>     B e . The police would H tiuilding in just a few"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "you have done if turned up? thing, he said, NflljBss this little <mark>button</mark>     B e . The police would H tiuilding in just a few"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [303.34, 1758.37, 452.91, 1791.42], "bbox_id": "b67340c3ca", "file": "AppomattoxNewspapers_1912-1915a_0251.pdf", "page": 1, "text": "You cant ring the gong success by pushing a button. k"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "You cant ring the gong success by pushing a <mark>button</mark>. k"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "You cant ring the gong success by pushing a <mark>button</mark>. k"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2113.71, 1769.75, 2275.82, 1794.95], "bbox_id": "063891efd1", "file": "AppomattoxNewspapers_1912-1915a_0321.pdf", "page": 1, "text": "You cant ring the gong oi uooees tfjr pushing a button."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "You cant ring the gong oi uooees tfjr pushing a <mark>button</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "You cant ring the gong oi uooees tfjr pushing a <mark>button</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2073.89, 1588.11, 2233.47, 1610.4], "bbox_id": "bc6fadc314", "file": "AppomattoxNewspapers_1912-1915a_0243.pdf", "page": 1, "text": "You can t ring the gong success by pushing a button. of"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "You can t ring the gong success by pushing a <mark>button</mark>. of"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "You can t ring the gong success by pushing a <mark>button</mark>. of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2131.42, 1357.42, 2337.02, 1499.65], "bbox_id": "c691857511", "file": "AppomattoxNewspapers_1949-1952a_0168.pdf", "page": 1, "text": "You can choose between the Bel Air and the Convertible And if its a sports model you want, here s   car! Choose the fleet, fashionable, steel- lopped Bel Air, with extra-wide windows and nayTleather-trimmed upholstery, and have the only car of its kind in the low-price field. Or they equally beautiful Chevrolet Convertible, with automatic top that lifts rJow cn at th touch of a button, and have the finest Con vertible in iU price range. Or choose the all- steel, four-door Station Wagon-smartest in its fieldlisting for 260 less than last year."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "th touch of a <mark>button</mark>, and have the finest"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "th touch of a <mark>button</mark>, and have the finest"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1633.75, 1591.04, 2595.1, 1694.38], "bbox_id": "783f3742b6", "file": "AppomattoxNewspapers_1971-1973a_0366.pdf", "page": 1, "text": "YO UR CHOICE AccuMatic one button tuning. Black Matrix tube. 26,500 volt chassis 100 Solid State. Colonial or Spanish. REG. 338.95 VALUE  H J Q  j"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "YO UR CHOICE AccuMatic one <mark>button</mark> tuning. Black Matrix tube. 26,500 volt chassis 100 Solid State. Colonial or Spanish. REG. 338.95 VALUE  H J Q  j"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "YO UR CHOICE AccuMatic one <mark>button</mark> tuning. Black Matrix tube. 26,500 volt chassis 100 Solid State. Colonial or Spanish. REG. 338.95 VALUE  H J Q  j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1912.78, 459.31, 2406.59, 592.58], "bbox_id": "e54f43d246", "file": "AppomattoxNewspapers_1962-1965a_0309.pdf", "page": 1, "text": "YES. GIVE A MOP Give a dustmop for Christ mas? Why not when theres ore now on the market, equipped with 28 accessories including a horn button for calling the chil dren, dinner bell, air horn to warn pets out of the way, a steering wheel, siren for emer- Indians in a primitive man-1 gency runs down long hallways, ner. They build huge fires at the I a radio and a baby bottle warm- base of the rock and when it er! ED HARVEY Your Frigidaire Dealer APPOMATTOX, VA."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "accessories including a horn <mark>button</mark> for calling the chil"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "accessories including a horn <mark>button</mark> for calling the chil"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [153.1, 1077.05, 307.89, 1109.35], "bbox_id": "b771534ddc", "file": "AppomattoxNewspapers_1902-1905a_0338.pdf", "page": 1, "text": "Xlol. J o Button and T h e T u rn are real Parkerites. Congratula tions Jo."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Xlol. J o <mark>Button</mark> and T h e T u rn are real Parkerites. Congratula tions Jo."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Xlol. J o <mark>Button</mark> and T h e T u rn are real Parkerites. Congratula tions Jo."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [884.17, 264.73, 1042.22, 430.03], "bbox_id": "9cd6775801", "file": "AppomattoxNewspapers_1922-1923a_0007.pdf", "page": 1, "text": "xa a num ber of friends, last 18 years oe has professor of E nguju aud N estern Maryland Oolle-je. Dr Warfield j his wife, who rnoriiago Miss i But oo, aud bj win U ami J vs- and a daughter Warfield. Mr iris ter of Colon d Joseph Button of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "of Colon d Joseph <mark>Button</mark> of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "of Colon d Joseph <mark>Button</mark> of Appomattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.55, 1034.41, 2080.65, 1062.95], "bbox_id": "3fe79d2074", "file": "AppomattoxNewspapers_1908-1909a_0199.pdf", "page": 1, "text": "WS PAT SUU down, lew tnc Oangsiow ap roo a t boma, spars tone., Tbrood furnish ed. So button lofs, end Stamp. CSDAB GARMBWT FACTORY A aS terdia. S  T ."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "WS PAT SUU down, lew tnc Oangsiow ap roo a t boma, spars tone., Tbrood furnish ed. So <mark>button</mark> lofs, end Stamp. CSDAB GARMBWT FACTORY A aS terdia. S  T ."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "WS PAT SUU down, lew tnc Oangsiow ap roo a t boma, spars tone., Tbrood furnish ed. So <mark>button</mark> lofs, end Stamp. CSDAB GARMBWT FACTORY A aS terdia. S  T ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1392.25, 1532.11, 1549.23, 1781.14], "bbox_id": "f04703a143", "file": "AppomattoxNewspapers_1902-1905a_0440.pdf", "page": 1, "text": "Write Morse on the Doorbell. The other afternoon a caller in a Harlem apartment house was sur prised to hear the doorbell ring long and. Intermittently, says the New York Press. She was equally sur prised when her hostess, Instead of complaining about the noise, went to the door-opener and pushed the button for a couple of minutes. Then the ringing began again, with a second re sponse from the button, and the hos tess quietly sat down to chat with her friend.  It was only Harry, she explained. He wanted to know what I wanted brought in for dinner, and I said a steak. He said he would rather have chops, and I said go ahead and get them. Then the visitor remembered that Harry had married his wife when she was an operator In the same telegraph office in which he was employed, and understood that the intermittent ring ing was really Morse code, employed to save the husband a climb of four flights of stairs."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "door-opener and pushed the <mark>button</mark> for a couple of"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "door-opener and pushed the <mark>button</mark> for a couple of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1290.69, 818.22, 1502.49, 902.12], "bbox_id": "dbec2a3631", "file": "AppomattoxNewspapers_1939-1943a_0055.pdf", "page": 1, "text": "Worth 14.00 more, we honestly believe! T j a strong statement but we back it up by ti ing you that this super-fine mattress Las a shall type non-sag unit of 812 barrel ibtpd dividuaUy muslin pocketed coils .  that tlx tempered steel wire for lasting resiliency .. ens of ieyelets keep the mattress sanitised and cant -rip handles enable one to ton easily. Uniform button tufting. Choce of im"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "to ton easily. Uniform <mark>button</mark> tufting. Choce of im"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "to ton easily. Uniform <mark>button</mark> tufting. Choce of im"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1841.3, 1556.67, 2015.15, 1804.07], "bbox_id": "39090c8877", "file": "AppomattoxNewspapers_1939-1943a_0097.pdf", "page": 1, "text": "words, sounds and .ctions. He can feed himself without much spilling, but still needs supervision. He can help considerably with his dressing and undressing and can do a good deal for himself. He can take off his hat anc coat and hang them up, if hooks are placed low enough.He can unbutton his clothes if the but tons are large and within raech, and canriSe learning to button them. He can take off his shoes after they have baen untied, and can put them on. He should be learning to lace his shoes. He can wash his own hands and put the towel back on the rack. He can brush his teeth if he has some help. He should have control of bowels and bladder day and I night. The average child of 3 years j weighs about 30 pounds. Your child I may weigh more or less, depending I on his height. He should weigh from 123 to 40 pounds according to height and age, He should now have all I bis first teeth.. 20 altogether. Ha"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "and canriSe learning to <mark>button</mark> them. He can take"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "and canriSe learning to <mark>button</mark> them. He can take"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.75, 255.31, 2116.2, 445.65], "bbox_id": "831d052250", "file": "AppomattoxNewspapers_1926-1933a_0341.pdf", "page": 1, "text": "WoolridgeGray Artistic arrangement of ferns  and cut flowers lighted only by the flickering flames of many candles effectively arranged jrinia was the dumping ground around the chancel forme?  for any and every type of insur- background for the wedtoig ance company existing in the Lerremony of Ml ,rfd e , IUU ----- ------------ i country. Colonel Button was Gray and James T, Woomttg  q gQ and SUSpended jail unanimously elected the. head yesterday morningat 10  sentence of 30 days, of the new department. He  the Methodist Protestant Axjhrey McCoy Thomas, has held the office for 23 sue- U u rch with Rev. Josepn ii. assault upon his ........... Lynchofficiating. T hebnde   sequent marriage t  daughter of Mr,  4  J L S L rJ l. cessive years since that time. His first term of oeffie was four"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "IUU ----- ------------ i country. Colonel <mark>Button</mark> was Gray and James"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "IUU ----- ------------ i country. Colonel <mark>Button</mark> was Gray and James"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1311.6, 375.35, 1459.44, 480.92], "bbox_id": "c44fd853ba", "file": "TimesVirginian_1978_0533.pdf", "page": 1, "text": "Wonderful WATERFULS The famous Waterfuls toys with the whoosh button that forces water currents. Hours of fun! Choice of games. 8x6x3-in."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Wonderful WATERFULS The famous Waterfuls toys with the whoosh <mark>button</mark> that forces water currents. Hours of fun! Choice of games. 8x6x3-in."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Wonderful WATERFULS The famous Waterfuls toys with the whoosh <mark>button</mark> that forces water currents. Hours of fun! Choice of games. 8x6x3-in."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1732.55, 490.08, 1882.39, 735.69], "bbox_id": "12c4dfc3da", "file": "AppomattoxNewspapers_1922-1923a_0583.pdf", "page": 1, "text": "Womens Gloves Short Kid Gloves .......... 1.00 to 2.35 8-Button Gloves, all staple shades, Including w hite afid black, 3.00 and 2.50 12-Button Gloves, all staple shades, w hite and b la c k .. . . 3.00 and 3.50 16-Button Gloves, all staple shades, w hite and black. . . . 3-50 and 4-00 20 and 24 Button Gloves, w hite and black only .............. 4.00 and 6.00 Fleece-Lined Gloves... 1.60 to3-75 F u r Gloves .................. 2.50 to 12.00 Childrens Gloves Kid Gloves ___ 1.00, 1.36 and 1.60 Fleeoe-Llned G loves.. .1.00 to 1.75 F ur Gloves ...................... 2.50 to 3AO Full line of Automobile Gauntlets, D riving Gloves, Wool Gloves, etc. UMBRELLAS Umbrellas of every description, natural wood and fancy handles In cluded In our assortm ent. Describe style desired and price you wish to payand we can supply you. Womens Umbrellas, In la r g e y a - riety .1,00 to 30,00 Mens Umbrellas, the newest and best ............................ 1-00 to 15.00 Childrens Umbrellas, strong and serviceable .................... 60c to 3.00 Initials engraved free on Umbrellas costing 3.00 and over."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "4-00 20 and 24 <mark>Button</mark> Gloves, w hite and"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "4-00 20 and 24 <mark>Button</mark> Gloves, w hite and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2336.65, 990.23, 2496.92, 1037.97], "bbox_id": "c85042e3aa", "file": "AppomattoxNewspapers_1898-1902a_0716.pdf", "page": 1, "text": "Women J.r.75 ami 2.00 shoe in button or lace, with or without patent tip, every pair sold under a gaarautae, 1.50."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Women J.r.75 ami 2.00 shoe in <mark>button</mark> or lace, with or without patent tip, every pair sold under a gaarautae, 1.50."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Women J.r.75 ami 2.00 shoe in <mark>button</mark> or lace, with or without patent tip, every pair sold under a gaarautae, 1.50."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [143.3, 781.15, 467.2, 919.05], "bbox_id": "4117647197", "file": "AppomattoxNewspapers_1905-1912a_0238.pdf", "page": 1, "text": "Wo solicit your check account! which every body should have-the only Moser wm to do bustnesa Pay with check, and your check will be a egel rec. pt. Ro mlttehow email your account let ua have It and w. guarantee eatlefaotion. naoo vour surplus money with us on Interest account. 8 per sent P  mmaialng 8 months, 1  per cent If remaining 8 months, and 4 per sent If rem Bag 18 months. Patronize your friends and build up your own County. Every famers account wanted. DIRECTORS, J. 0. Jones, Jo. Button. H. D. Flood, . A Atwood,  L. Ferguson, Jno- . Bears, J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J. 0. Jones, Jo. <mark>Button</mark>. H. D. Flood, . A"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J. 0. Jones, Jo. <mark>Button</mark>. H. D. Flood, . A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.55, 512.29, 1822.15, 701.59], "bbox_id": "f25609d17f", "file": "AppomattoxNewspapers_1960-1962b_0454.pdf", "page": 1, "text": "With the Virginia general elec- le. h r- I tion date of Nov. 7, at hand, toe L. to the A. H. S. following satement was issued this Kch Gordon Braggs week by State Senator Chas. T. I Brosville Monday J Moses  fooned game. Score I  n 0 v . 7to. is General Election feattox had its 211 giving all voters in Virginia, time, and hen coast-1 espectaiiy Conservatives and Demo- forrence and G. H. I cratic believers in State Govern ed, but all of the lads I the opportunity to give their I final approval to the Democratic I Conservatives nominated in the July have to walk all I primary Hon. Albertis S. Harrison, L post office to get1 far Governor Senator Mills E. God- Laii on the way. No I wjn jor Lt. Governor Senator Rob- Ineat new receiving I ert Y. Button, for Attorney Gener- I al, to direct, run and keep Virginias government on its conservative ba-  sis."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "receiving I ert Y. <mark>Button</mark>, for Attorney Gener- I"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "receiving I ert Y. <mark>Button</mark>, for Attorney Gener- I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [493.16, 813.78, 746.46, 957.09], "bbox_id": "41335f9574", "file": "AppomattoxNewspapers_1905-1912a_0199.pdf", "page": 1, "text": "with the sole made flexible, is a positive relief for tired and tortured feet. It is as pliable as an old shoe from the very first. It is as stylish as any shoe you ever saw. The top and vamp are of soft kid but tough as horse- hide. W eve taken out all the Stiffness. Weve left in ail the wear and all the style. See this shoe at the Craddock agency in your town. Made in all styles ,and patternsslipperspumps lace and button boots. C R A D D O C K -T E R R Y C O ., LYNCHBURG. VA."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "and patternsslipperspumps lace and <mark>button</mark> boots. C R A"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "and patternsslipperspumps lace and <mark>button</mark> boots. C R A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1829.04, 692.0, 2008.62, 1142.39], "bbox_id": "9cfc581795", "file": "AppomattoxNewspapers_1960-1962b_0460.pdf", "page": 1, "text": "With the general election opining up next Tuesday, Nov 7., Senator iCh-as. T. Moses issued the following appeal to voters this week Dear Friends and voters Nov. 7th-, general election day can have a lot to do with whether you pay more state taxes. You all, and all the officers of Appomattox Cou-nty whose names are signed below, joined with other Democrats of Virginia in the July primary and nominated Albertis S. Harrison for Govern or. The Governor is the one who can recommend new taxes, or high er taxes, and if he does not do eith er, the legislature passes a new tax, or increased tax. He is the man that has to sign the bill .before t becomes law. Out of todays state taxes, except gas, car ar.d truck li censes, the greater part of every dollar goes t schools and welfare costs. If the Voters take a part in the final election of the Democratic primary nominees, you are taking a part in helping to select the state officers that will run your state gov ernment for thg next 4 years. Senator Mills E. Godwin was nom inated for Lt. Governor. He is very close to the Governoi. He qan have much influence with the Governor. Robert Y. Button, for Attorney Generol, the -one who sees that state lawsare properly enforced. Dr. W. A. Pennington for House of. Delegates. The county officers in Appomat tox believe that they the voter should, and would appreciate it if all voters, went to the polls on Tuesday, Nov 7 and voted for the Democratic nominees mentioned a- bove. ?has. T. MoseS."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "the Governor. Robert Y. <mark>Button</mark>, for Attorney Generol, the"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "the Governor. Robert Y. <mark>Button</mark>, for Attorney Generol, the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1222.52, 548.13, 1346.37, 624.28], "bbox_id": "32388780b9", "file": "AppomattoxNewspapers_1971-1973a_0039.pdf", "page": 1, "text": "With Motorolas Insta-Matic Color Tuning, one button automatically bal ances color hue, intensity, contrast, brightness and activates the automatic fine tuning. And it helps keep the color balanced even when scenes change or you change channels. And as long as the little green light Is on, you dont have to worry about the children misadjusting these controls."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Insta-Matic Color Tuning, one <mark>button</mark> automatically bal ances color"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Insta-Matic Color Tuning, one <mark>button</mark> automatically bal ances color"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.68, 925.0, 1884.93, 1031.4], "bbox_id": "4e28728a0c", "file": "TimesVirginian_1983a_0382.pdf", "page": 1, "text": "WITH H EATALATO R VIBRATOR Rg, 79.95 HURRY! Six push button con- trols on this fine set! a m  f m tdoPtus thè Cassette píayür- recorder."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "WITH H EATALATO R VIBRATOR Rg, 79.95 HURRY! Six push <mark>button</mark> con- trols on this fine set! a m  f m tdoPtus thè Cassette píayür- recorder."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "WITH H EATALATO R VIBRATOR Rg, 79.95 HURRY! Six push <mark>button</mark> con- trols on this fine set! a m  f m tdoPtus thè Cassette píayür- recorder."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2200.81, 867.27, 2355.32, 1084.37], "bbox_id": "6f2180c671", "file": "AppomattoxNewspapers_1915-1918a_0365.pdf", "page": 1, "text": "with French tucks. It Is cut after the usual manner of blouses, its seams are hemstitched, sleeves plain and roomy and, so far, all the details of Ita con struction are all like tried old friends with whom we have long been famil iar. But just at this point the 1 creator of thla blouse thought of adding an organdie collar and cuffs made of a fine organdie edging, and of shaping the collar In a new way. Furthermore, the dainty embroidered edge of the organdie la lifted Into prominence by a narrow border of black organdie. The collar Is high at the back and rolls at the front, the wiry texture of the material making this pretty adjust ment to the neck possible. The cuffs are simply lengths of the embroidered organdie, turned back and fastened at the top with a single pearl button. The means by which Its mUker arrived at such good ends in this blouse are the simplest. But the tqucb of sheer black In collar and cuffs is original and fine"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "with a single pearl <mark>button</mark>. The means by which"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "with a single pearl <mark>button</mark>. The means by which"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [962.93, 1348.49, 1988.4, 1436.99], "bbox_id": "245af02c59", "file": "AppomattoxNewspapers_1954-1955a_0437.pdf", "page": 1, "text": "With a finger-tip touch on a button you select your driving range. As easy as flicking a light switch! Then Plymouths fully automatic PowerFlitethe worlds smoothest, most advanced transmission- takes over. Its the ultimate in driving esse snd another Plymouth first in the low-price 3. im i A r . The Associated lubs of Vir-"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "finger-tip touch on a <mark>button</mark> you select your driving"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "finger-tip touch on a <mark>button</mark> you select your driving"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2066.66, 1560.89, 2214.23, 1644.59], "bbox_id": "dde0491d30", "file": "AppomattoxNewspapers_1955-1957a_0024.pdf", "page": 1, "text": "With a finger-tip touch on a button, you select your driving range. As easy as flicking a light switch! Then Plymouths fully automatic Power- Flite  worlds smoothest transmis sion  takes over. Its the ultimate in driving ease."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "finger-tip touch on a <mark>button</mark>, you select your driving"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "finger-tip touch on a <mark>button</mark>, you select your driving"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [573.82, 364.39, 738.32, 927.09], "bbox_id": "e52128344a", "file": "AppomattoxNewspapers_1912-1915a_0522.pdf", "page": 1, "text": "Wipe six tenderloin fillets, two inches thick, and brown on each side quickly in a hot frying pan with butter. Six min utes of cooking, if the pan is smoking hot, will he suffi cient. Arrange on a hot platter, sea son well and sur round with sliced bananas, also sauteed in butter. To the fat in the pan add a fourth of a cupful of water, one- half teaspoonful of beef extract, one tablespoonful of butter and a few dashes of salt. Pour the gravy around themllets and garnish with sprigs of parsley. Hamburg 8take en Casserole. Prepare and season the steak with a daah of cloves and onion juice, with salt and pepper. Make in small cakes and brown on both sides. Place in a casserole with button onions, carrots and potatoes cut in balls cover with stock and cook slowly un til the vegetables are tender. In broiling steak over coals or un der gas or in pan broiling, the steak should be quickly seared on both sides to keep in all the juice, then the cook ing may be prolonged more Blowly un til the degree of rareness Is reached to suit the taste. Steak With Clams or Oysters.Broil a sirloin for five minutes, nearing well, on both sides, remove to a platter, blit ter well and cover with clams from which the tough muscle has been re moved or with fresh oysters. Sprinkle with salt and pepper and dot with bits of butter. Place on the top grate of a hot oven and cook until the shell fish are done. Holiandaise sauce is another to prepare wash a half cupful of butter, and divide it into thirds. Put one piece In a small saucepan or double boiler, dd a tablespoonful of lemon juice amt the yolks of two eggs, stir constantly with a wire whisk while the mixture is cooking when the but ter is melted, add another piece and then the third. Remove from the heat and add salt,, a dash of cayenne and a tablespoonful of finely-minced parsley. If left a minute too long the sauce will separate. Spread this sauce over steak just as it gets to the table."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "in a casserole with <mark>button</mark> onions, carrots and potatoes"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "in a casserole with <mark>button</mark> onions, carrots and potatoes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1920.0, 1673.72, 2006.06, 1704.97], "bbox_id": "433c1e2873", "file": "AppomattoxNewspapers_1952-1954a_0472.pdf", "page": 1, "text": "Windows open or dose at tno touch of a button under each window or on loft front door. Driver may operate any of the four Power-Lift Windows."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Windows open or dose at tno touch of a <mark>button</mark> under each window or on loft front door. Driver may operate any of the four Power-Lift Windows."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Windows open or dose at tno touch of a <mark>button</mark> under each window or on loft front door. Driver may operate any of the four Power-Lift Windows."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [764.15, 1051.85, 928.31, 1193.4], "bbox_id": "10997a524c", "file": "AppomattoxNewspapers_1943-1947a_0219.pdf", "page": 1, "text": "Window Service Flag Can Designate Veteran WASHINGTON.  A family or or ganization service flag may now car ry a symbol to designate an honor ably discharged veteran. The symbol, based on the same design used on the lapel button for a discharged veteran, will replace the blue star which represented a man or woman in service. The design will be in gold color with blue edging to make it stand out on the flags white background."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "used on the lapel <mark>button</mark> for a discharged veteran,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "used on the lapel <mark>button</mark> for a discharged veteran,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.51, 1296.22, 1582.96, 1411.73], "bbox_id": "b74ba598f9", "file": "AppomattoxNewspapers_1898-1902a_0320.pdf", "page": 1, "text": "WILLS PILLSBIB6EST OFFER EVER MIL For only IO lento we will send to anyp. Q.R- dress, 10 days treatment of the be, inedicisia earth, and put you ou the Creek how to make Me ey right at your home. Address all orders to Ti It. if. Wills Medicine Company, 23 Ell both sit. Hagerstown, .lid. Itraneh Offers 1211 Indiana Are., tVnslitnatoii, 1. C. _ B in IIAIICV MADE SELLING AIcXlH- I MUHCT I.EV-BItVAN HUTTOS. SC Different Designs. Illustrated catalogtoui handsome color souvenir button sent free for turn in stamps. Write quick lor agency. I raakf C lark Co. 513W. Bnllo.St.Baltlmere.lM. D R O P S Y new piscoy?Hj!2 ---- Snnlt n tnalimnnik!"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "catalogtoui handsome color souvenir <mark>button</mark> sent free for turn"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "catalogtoui handsome color souvenir <mark>button</mark> sent free for turn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.21, 1605.08, 1697.04, 1774.88], "bbox_id": "6642c4d95e", "file": "AppomattoxNewspapers_1905-1912a_0347.pdf", "page": 1, "text": "William Lyon Phelps tells this story about Robert Louis Stevenson, as Il lustrating the cosmopolitanism of Russian character, which Professor Phelps says is accountable. In a measure, for the international effect and influence of Russian novels. Stevenson, writing from Mentone to his mother, 7 January, 1874, said We have two little Russian girls, with the youngest of whom, a little polyglot button of a three-year-old, 1 had the most laughable scene at lunch today. . . . She said some thing in Italian which made everybody laugh very much . . after some examination, she announced emphat ically t the whole table. In German, that I waa a madchen. . . . This"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "whom, a little polyglot <mark>button</mark> of a three-year-old, 1"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "whom, a little polyglot <mark>button</mark> of a three-year-old, 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1293.85, 778.38, 1440.43, 833.7], "bbox_id": "04efb6c1e6", "file": "AppomattoxNewspapers_1905-1912a_0201.pdf", "page": 1, "text": "WIeengIOKWAH. DI8TBI0T.. Supervisor-M. W. Carson, Spout Spring. ConstableB. A. W alton, Bent Creek. Hold Commissioner  - Justices of the Peaoe-Chas. F . Button, WiSers Ford. F.G. Thorp, Oakville and join W. Davidson. Vera. Otenesr of the Poor -------"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "of the Peaoe-Chas. F . <mark>Button</mark>, WiSers Ford. F.G. Thorp,"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "of the Peaoe-Chas. F . <mark>Button</mark>, WiSers Ford. F.G. Thorp,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [917.05, 777.62, 1070.64, 839.62], "bbox_id": "eb24fb3bf6", "file": "AppomattoxNewspapers_1892-1898a_0464.pdf", "page": 1, "text": "Why They Dont Mourn. Why dont the Bifftons appear to mourning? Wasnt Charley Button, who was drowned last week a member of their fmily? Yes but be rocked the boat. Cleveland Leader."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "to mourning? Wasnt Charley <mark>Button</mark>, who was drowned last"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "to mourning? Wasnt Charley <mark>Button</mark>, who was drowned last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [453.37, 1708.8, 616.42, 1811.4], "bbox_id": "7e209fb0f2", "file": "AppomattoxNewspapers_1912-1915a_0571.pdf", "page": 1, "text": "Why Not Button Spats to Shoes? A woman asks the Scientific Amer ican Why cannot spats be secured to low shoes bv snap buttons, like glove- fasteners? To which that paper re plies The problem will he so to locate the buttons as to exclude them from view when the shoes are used without the spats, and also to secure such arrangement. as will not be un comfortable to the wearer."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Why Not <mark>Button</mark> Spats to Shoes? A"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Why Not <mark>Button</mark> Spats to Shoes? A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [871.2, 1534.23, 1140.96, 1634.39], "bbox_id": "c0b1547e2d", "file": "AppomattoxNewspapers_1908-1909a_0504.pdf", "page": 1, "text": "Who wears a size 14 to 20 or 32 to 36 all wool BLUE CHEVIOT SUITS iir plain or snappy herringbone weave, expertly tailored,, stylish two button coat, fine alpaca lined, with one pair of blue cheviot and one pair of white flannel long length trousers finished with 22 inch bottoms. Exceptionally priced a t .95"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "expertly tailored,, stylish two <mark>button</mark> coat, fine alpaca lined,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "expertly tailored,, stylish two <mark>button</mark> coat, fine alpaca lined,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [515.73, 762.39, 677.61, 1081.68], "bbox_id": "deede482bd", "file": "AppomattoxNewspapers_1902-1905a_0017.pdf", "page": 1, "text": "who had been converted in the meetings, j invited his employer to attend. One eve- 1 ning he was there, and st, just across the I aisle from M Arthur Tanpan. H rn-  neared affected during the rmon. and Mr. ! Tappan keot his eve on him. After the I dismissal. Mr. Taxman stepped ouickh across the aisle, introduced hmself. and invited him to star to the offer-service, j The gentleman tried to excuse b?mclf and get away, but Mr. Tanpan caught hold of the button on his coaf and said. Now. do stay I know you will enjoy it and he was so kind and gentlemanly that the cut lery man could not well refuse. H staved, and was converted. Afterwards he said. An ounce of weight upon my coat-button saved my soul. Two Pictures. It is related that two painters each painted a picture to illustrate his concep tion of rest. The first chose for hs scene a still, lone lake among the far-off moun tains. The second threw on his canvas a thundering waterfall, with a fragile birch tree bending over the foam. At the fork of the branch almost wet with the catar acts sprov. a robin sat on its nest. Henry Drummond, referring to the tw paintings, so unlike in their make-up. I said The first was onlv stagnation the last j wjs rest. Christs life was outwardly ! one of the most troubled lives that was  ever lived tempest and tumult, tumult and tempest, the waves breaking over i all the time, till the worn body was laid in the grave. But the inner life was a sea of glas. The great calm was always there. At am moment vou might have gone to Hin 1 and found rest. And even when His enc mies were dogging Him in th streets o Jerusalem He turned to His dicoiples a 1 offered them as a last legacy. My peace"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "caught hold of the <mark>button</mark> on his coaf and"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "caught hold of the <mark>button</mark> on his coaf and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [625.71, 767.37, 784.39, 1632.9], "bbox_id": "1bb8506bf8", "file": "AppomattoxNewspapers_1922-1923a_0092.pdf", "page": 1, "text": "White Serge Dress Trimmed With Red and Black Leather. of this sort never, in their most san guine moments, dreamed that they would be adopted in such a world wide way, declares a fashion writer In the New York Tribune. Paris Is competing with London and New York In the making of the smart est and most appealing styles In out door clothes. When any type of dress Is exploited from all sides It always means that if the models are pretty OPd becoming a certain number of women will wear them with little sense of fitness. That Is, a so-called pastime hat may be woru with a gown to which It Is entirely unsuited. This is also true of shoes. We have cut adrift from the old standards which governed the selec tion of footwear. The final blow was dealt with the wholesale adoption of patent leather for low-heeled walking shoes. With the flooding of the mar ket with many excellent ideas In dress at one time there always comes a mis application of the best of them. Both sweaters and dresses are made In two or more contrasting colors that Is, of silk or  ool in a plain color patterned In high relief. Among the prettiest of the sweaters are those in lavender brocaded in blue. A new model in these-shgdes which closes down the front like the very old-fashioned coat sweater is long, coming almost to the knees, and has long sleeves which flare at the bot tom. There is a high collar button ing up about the neck.. The sweater itself is lavender and around the bot tom and on the sleeves and the collar are squares knitted In blue. It Is bloused by means of an elastic band placed low on the Inside. White Flannel and Serge. A great demand for any particular type of dress Is a wonderful inspira tion to designers and manufacturers and an incentive to do their best in that particular line. While there is the greatest diversity of color In the outing costume, here as everywhere else, a few colors become the extreme of fashion. In the plain shades brown, gray and white are favorite, while in the brighter hues there ore unusual shades of cerise, purple, yel low and red. Emphasis is placed on yellow and black used in unison. A complete reaction from black in daytime clothes is manifesting itself in the other extreme, white, for street wear, particularly white witli color. And on this wave comes white flannel as well as white serge of an extremely, soft and fine texture woven In part of camels hair, which, mixed wifh the wool, gives a marvelous effect. The kasha serge of Itodier is of this char acter Jeanne Lanvin has been responsible largely for this movement to white serge and flannel with trimmings of embroidery In high colors, a trimming which she always has favored and in which she ever hrs excelled. One of her best models Is in white serge em broidered in a brilliant Chinese red with little flakes of black as a relief. Another interesting model of white serge Is of simple design with slim panels on the bodice and on the skirt. Tills frock is embroidered In red and 6lack in a Jugo-SIav patter. A greut many of Lanvins embroideries are In Russian and Jugo-SIav designs.. There are charming frocks of white serge done with bead embroideries in high colors after Russian motifs. Very often such frocks are In coat styles with the Russian bodice crossing. English women long have recog"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "is a high collar <mark>button</mark> ing up about the"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "is a high collar <mark>button</mark> ing up about the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [647.99, 1141.77, 805.82, 1363.6], "bbox_id": "9767d027a2", "file": "AppomattoxNewspapers_1915-1918a_0396.pdf", "page": 1, "text": "WHITE Alvis, James Edward, Aust in, Henry, Bagby, Samuel Pleasant, Bondurant, James, Burnett, John Elisha, Card- well, Jack Sears, Cardwell, William Littleton, Carson, I Charles Laster, Ooulbourn, Charles Button, Crews, Joseph Wadsworth, Cuneo, Hudson Lewis, Drinkard, Henry Alvin, Drinkard, H a r r y Spurgeon, Drinkard, E a r l Cleaveland, Drinkard, Clayton Thornhill, Eagle, David William, Eagle, Cleveland, Ferguson, Winstbn, Garrett, Charles Bernard, G ar rett, Robert Jackson, Harding, George Wiley, Harris, William"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Charles Laster, Ooulbourn, Charles <mark>Button</mark>, Crews, Joseph Wadsworth, Cuneo,"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Charles Laster, Ooulbourn, Charles <mark>Button</mark>, Crews, Joseph Wadsworth, Cuneo,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1313.96, 582.67, 1473.45, 960.46], "bbox_id": "77e13f1fb0", "file": "AppomattoxNewspapers_1898-1902a_0569.pdf", "page": 1, "text": "While Shamrock led nearly aii the way and actually crossed the finishing line two seconds ahead of Barrs white winged wonder the official measurements compelled her to give the American boat 43 seconds time, and as a result Colum bia won by 41 seconds. The sea was smooth and tiic sun bright, while the air had a keen nip that made the spectators button their coati when the excursion fleet went down to Sandy Hook. Soon both boats were standing out to sea in tow of their re spective tugs. Before the starting gun both went through the usual tactics of jocking about the line. Barr was more watchful than ever. Sycamore, grim and silent, swung the brass machine first on one tack and then another, while the minutes slipped by. The wind held at twelve knots. The excursionists crowded up to see the battle, and silence fell upon the breezy ocean. Shamrock held on to windward and did not set her staysail. Columbia had staysail and jib set and balloon in stops, and as Sycamore show ed a decided intention of not going over first on the leeward run, Barr came to the conclusion that he would try it es pecially as the gun had fired. It was a little different from the usual trial to get the weather berth. This run off before the wind made the windward boat last and in a position to wind her antagonist. They were both standing for the line when the handicap gun fired, the Colum"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "that made the spectators <mark>button</mark> their coati when the"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "that made the spectators <mark>button</mark> their coati when the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [529.89, 1099.65, 689.44, 1545.94], "bbox_id": "1106868d90", "file": "AppomattoxNewspapers_1902-1905a_0362.pdf", "page": 1, "text": "which we did not have some mem ber represented by a proxy. Tin- ght to do this was never question ed, and some of our most import ant meetings have adn ittecl prox ies, concluded Colonel Button. A meeting of thu Tenth die- trie, committee was held at Oliiton Forge on August 18, at which time Captaiu Opias request for reopening the matter of a nomination was laid be fore that body. Every member was present and by unanimous vote it was decided that the meetings held by the committee had been legal and proper. State Chairman Ellyson replying to Mr. Button, under date of August 16, 1904, says with referenc to the matter of the legality of proxies My conclusion is, ther fore, that f, prior to the meeting of the dis trict committee at Clifton Forge, it had been the custom of said com miltee to recoguize proxies, aud that if at this meeting there were a sufli cient number of proxies, together with those who were present in per son, to constitute a quorum, then the meeting and the action taken hereat was both regular -ind bind in _ _ Just what Senator Opie can hope for in the independent political field we cannot understand. It is re ported that he is an independent candidate for Congress front this the tenth district. If true, this will make three entries for the rac?. li will be easy to figure the result Rivercomb and Opie will divide the vote west of the mountain and Flood will carry the east solidly."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "prox ies, concluded Colonel <mark>Button</mark>. A meeting of thu"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "prox ies, concluded Colonel <mark>Button</mark>. A meeting of thu"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1428.69, 486.26, 1622.25, 1585.67], "bbox_id": "940f0ea193", "file": "AppomattoxNewspapers_1912-1915a_0286.pdf", "page": 1, "text": "which hqd of late monopolized Theo dore Van Vechtens fostering care. In the world wf finance and commerbe theirs were names to conjure wth here they were merely lieutenants awaiting their captains pleasure. Well?. Mr. Van Vechten at last broke the silence. Rudolph was brief and to the polnL 1 Last Saturday ended the third week since Paige and Josephine left PariB for London. In a letter mailed just before starting, Paige Informed me that, she expected to remain In Bngland two or three weeksthree ,at the longestahd mentioned a num ber of friende she proposed visiting. Some I know, and some I dont. Since then I have had no word from her have you?  Mr. Van Vechten pressed a button. It might have controlled the door In stead of the clerk, so promptly! did the latter appear. To him he said Have Timmons get out tbe latest Ddvereaux letters, and show them to Mr. Van Vechten when he comes ouL And turning to the young man again I suppose it will be impossible for me to knock oft to meet them. And this uncertainty about a sailing date is disarranging yottr planshm, I see. If you could cable To what address? How would it look to send cables to all our London acquaintances, asking If they know where Paige is? The newspapers would be sure to get hold of iL She and Josephine are. the ones who should be cablingor at the very least, send a card. Well, decided the older man, look at Jos last letters if they dont Contain something definite, go wherever It is you want tojust so It Isnt too far away. . . . By the way, you received notice of a direo I tons meeting next Saturday night, the  ninth? Did I? A good many things come In the mall that Barnicle doesnt let me see. If Barnicle Is faithful to your In terests, commented the Man of Iron, grimly, he had better not hold up anything like that. The notice was mailed to you with the others. I par ticularly desire that yqu be present Van Vechten eyed his uncle curi ously. Saturday night, he repeated at length. My unfamiliarity, with busl- I ness may he to blame, but Isnt that a deuced peculiar time of day for a 1 directors meeting. Uncle Theodore? j j It is a bit unusual, his uncle was 1 agreeing, and Rudolph was surprised- I to observe the thin lips as closely ap- I proximatlng a smile as It was possible for them to achieve hut the occa- I sion will be unusual. You will not re gret canceling anything else and mak ing it a point to attend. The Continentals president now felt called to chime in. It will be a festival occasion. Mr. Rudolph, he said with heavy levity. An exceptionally rich and Juicy mel on will form the piece de resistance. If all the dead and gone Van Vech- tens had materialized in,the flesh and  without warning appeared at that meeting. their advent would have been no more surprising, and scarcely less extraordinary, than what actually was on the cards to happen, It really was too bad that the Man of Iron and his satellitesthe lion and the hy enas, as Rudolph characterized them- _ should not have been vouchsafed soma premonition of the climax they were unwittingly preparing for. I see. said Rudolph after a pause. You chaps have squeezed some poor devil dry, and mean to hold a wake a random surmise that elicited no re sponse. Very welL I dont think, though, I shall want to leave town for a while. Tlmmone can find me either at my club or lodgings. An inspection of Mrs. Devereauxs letters, which Timmons handed him when he emerged from the private of fice, shed no fight upon the two ladies movements or Intentions. Paige wrote only when the spirit moved her, which was Beldom and so her Bilence was in no way remarkable. But It seemed that a woman of Josephine Devereaux mature experience should realize the advisability of keeping him and his uncle better informed. Paige Carew, It may be inferred, was- an orphan she bad been since early childhood. However, he straightway forgot her thought of her no more for about five minutes, when she was brought to mind again in a. most unexpected way."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Van Vechten pressed a <mark>button</mark>. It might have controlled"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Van Vechten pressed a <mark>button</mark>. It might have controlled"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [699.35, 1231.31, 869.75, 1363.76], "bbox_id": "cdde5b2abe", "file": "AppomattoxNewspapers_1943-1947a_0573.pdf", "page": 1, "text": "Where the surroundings are clean, the problem of preparing 1 cows for milking is simplified. With the better barn cleaners, such as the Crown illustrated above, the only hand work required is the walk along the gutter with a scraper and see to it that the manure actual ly gets into the gutter. The cleaner, at the touch of an electric button, removes the ma nure from the gutter and elevates it into a spreader located outside the barn."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "touch of an electric <mark>button</mark>, removes the ma nure"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "touch of an electric <mark>button</mark>, removes the ma nure"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1496.39, 211.75, 1657.28, 530.65], "bbox_id": "d1daabb9e4", "file": "AppomattoxNewspapers_1892-1898a_0294.pdf", "page": 1, "text": "where he had extended interview, with Representative Otev, Senator Martin, and others.Washington Correspondent of the Dispatch. Mr. Button retnrned home on Tuesday. He succeeded in having the mail route from Concord to Mineral changed so as to go from Stapleton to Mineral, so that the patroils of the Mineral post-office will get a daily mail and he had the route from Concord to Spanish Oaks and Karl so changed that the patrons of those offices will get their mail the same day it is received at Concord, instead of the day follow ing as formerly. This is certainly agieat convenience to the residents of that section of the country. Mr. Button also made an effort to secure the establishment of an office on the Appomattox side of the river at Isbells Ferry, and though he was not as successful in that matter as he was in the other, he thinks that he will be able to secure it in the near future."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "of the Dispatch. Mr. <mark>Button</mark> retnrned home on Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "of the Dispatch. Mr. <mark>Button</mark> retnrned home on Tuesday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1408.29, 892.75, 1573.88, 1477.24], "bbox_id": "701f080d31", "file": "AppomattoxNewspapers_1912-1915a_0232.pdf", "page": 1, "text": "When the President pressed the lit tle button on bis desk he gave a sig nal, carried by wire and cable, to Col. George W. Goethals here, the chief builder of the canal. Colonel Goethals gave another signal and in the pres ence of a vast throng giant blasts made, the Gamboa dike a thing of memory. 1,227 Charges of Dynamite. Under tbe dike were placed 1,227 charges of dynamite. Four hundred charges -were, exploded .At once and thè rest were let go later, at intervals. As the great detonation broke the Impressive silence countless tons of earth, were. thrown high. in the air, and even as tbe debris  fell a pro longed cheer arose that was heard from Panama to Colon and for miles into the Interior. Canal Zone Population Attends. The spectacular completion of the canal was witnessed by practically ev ery man, woman and child In the CAnal Zone. Among those who saw tbe event, besides Colonel Goethals, were Lieut. George B. Goethals and Mrs. Goethals Phillip Bunau-Varllla, former Congressman Nicholas Long- worth, of Cincinnati, and Mrs. Long- worth, daughter of Colonel Roosevelt Captain Nilson of Raoul Amundsens Artie ship the Fram all of the divis ion beads except Col. D. D. Gaillard, who is ill at Baltimore, and thousands of othéTs. - Colonel Goethals had the blasts so placed that the 400 discharges on President Wilsons signal blew only the top of the dyke into the air, mak ing a great picture, but only loosen ing tbe barrier. A fleet of-dredges was on hand to attack the debris imme- ditely after the dynamite explosion and the loosened earth was carried away. The other charges were to be set off subsequently and the Gamboa dyke reduced by easy stages. Dredges also will attack tbe Cura- cacba slide as soon as the dyke is gone, and the removal of that ob struction will actually complete the full junction, of the Atlantic and Pa cific and open tbe Panama Canal. Vastness Hard To Conceive. It is bard for those not bere on the scene to appreciate the vastness of this work, despite the volumes that have been written about it,, but the figures., are staggering. Imagine a wall of earth and tough rock three"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "pressed the lit tle <mark>button</mark> on bis desk he"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "pressed the lit tle <mark>button</mark> on bis desk he"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.09, 673.01, 1849.58, 910.06], "bbox_id": "c86b552d40", "file": "AppomattoxNewspapers_1892-1898a_0071.pdf", "page": 1, "text": "What, weeping, dear Eva ? It was a rich, manly voice that uttered the words as its possessor strode through the open French win dow into the room. Eva, jvhogg  Dr. B. O. Owens, Lynchhurg Va. O. H. and J. A Morris, Bucking ham. C. F. Button and Jos. Button,Ap pomattox, G. W. Harvey, J. P. Cawthron, J. B. Cawthroii, S. A. Bagby, J. C. Couch, J . Y. Spence, W. B. Couch, T. W. Harvey, T. B. Scruggs, 8. P. Taylor, J. N. Turner, J. R. Lncado, Thos. Harvey, Jno. D. Richardson, J f R. Adams, J. D. Ferguson, C. T. Moses, Alonza Hamilton, W. W. Statham, Leonard Lyne, J.B.Taylor."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Bucking ham. C. F. <mark>Button</mark> and Jos. Button,Ap pomattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Bucking ham. C. F. <mark>Button</mark> and Jos. Button,Ap pomattox,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1436.41, 1695.52, 1604.23, 1769.07], "bbox_id": "58726bc35b", "file": "AppomattoxNewspapers_1912-1915a_0302.pdf", "page": 1, "text": "What Was Wrong. Grandma, cried am impulsive youngster, hurrying back with his new little jacket, this is a lovely coat and I love it, but youve made an awful mistake. Youve put one button too many at tbe top and one buttonhole j too many at the bottom!"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "mistake. Youve put one <mark>button</mark> too many at tbe"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "mistake. Youve put one <mark>button</mark> too many at tbe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1072.11, 1647.51, 1226.99, 1913.31], "bbox_id": "cd6a473919", "file": "AppomattoxNewspapers_1922-1923a_0072.pdf", "page": 1, "text": "What is a button? A small event that is always coming off.    What is the difference between 100 and 1,000? Nought    What part of a clock reminds yon of Christmastime? The weights waits.    . Why are teeth like verbs? Because they are regular. Irregular, and defec tive.    Why do some people laugh in their sleeves? Because their funny-bone is there.    What word is It to which If you add a syllable it will be shorter? Short shorter.    Use me well and I am everybody scratch my back and I am nobody. A looking glass.    What is that which Adam never saw. never possessed, yet gave two to Ms children? Parents"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "What is a <mark>button</mark>? A small event that"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "What is a <mark>button</mark>? A small event that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1072.1, 1613.77, 1226.97, 1880.77], "bbox_id": "e87956926e", "file": "AppomattoxNewspapers_1922-1923a_0071.pdf", "page": 1, "text": "What is a button? A small event that is always coming off.    What is the difference between 100 and 1,000? Nought    What part of a clock reminds yon of Christmastime? The weight waits.    . Why are teeth like verbs? Because they are regular, Irregular, and defec tive.    Why do some people laugh in their sleeves? Because their funny-bone it there.    What word is it to which if you add a syllable it will be shorter? Short shorter.    Use me well and I am everybody scratch my back and I am nobody. A looking glass.    What is that which Adam never saw. never possessed, yet gave two to his children? Parents"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "What is a <mark>button</mark>? A small event that"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "What is a <mark>button</mark>? A small event that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1427.74, 793.28, 1571.59, 973.15], "bbox_id": "4789995fa1", "file": "AppomattoxNewspapers_1892-1898a_0042.pdf", "page": 1, "text": "whan you whisraers grow long, ft. J. Hunter, who keeps a baitow W. A, Motes A Ooi store. r - Richard Burke, Little Dlok, we im left here Monday on honre r Burkevllle, where he Cxpeots to trotting horse, Button, G. W. Chookley went to Lyneh- hty night.   i H. D. Flood left here Monday bington. J. R. Atwoods children have been !l for the past week, but are now JVing. ty Clerk J. B. Abbitt waa in burg Tuesday.  Flood A Poore went to Rich-, Wednesday to argue the case of - Wi g If- lr -L  4 - 1 i- ."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Cxpeots to trotting horse, <mark>Button</mark>, G. W. Chookley went"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Cxpeots to trotting horse, <mark>Button</mark>, G. W. Chookley went"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1074.0, 1430.59, 1212.86, 1677.92], "bbox_id": "e948ad1414", "file": "AppomattoxNewspapers_1974-1975a_0005.pdf", "page": 1, "text": "Westinghouse n - Heavy Duty Bectric Clothes Dryer with Permanent Press Selections Model DE 500 P  Permanent Press and Auto-Dry  Regular, Low, Air Fluff temperature settings  3 cycle selections on timer  Extra-large opening to drying basket  Handy up-front lint collector  Cross-Vane tumbling  Automatic cool-down period  Safety start button, door safety switch  Stationary drying shelf optional accessory  Backed by Nationwide Sure Service"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "cool-down period  Safety start <mark>button</mark>, door safety switch  Stationary"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "cool-down period  Safety start <mark>button</mark>, door safety switch  Stationary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1048.73, 1427.24, 1182.43, 1702.05], "bbox_id": "b2eabe2510", "file": "AppomattoxNewspapers_1974-1975a_0440.pdf", "page": 1, "text": "Westinghouse L Heavy Duty Electric Clothes Dryer with Permanent Press Selections Model DES00P  Permanent Press and Auto-Dry  Regular, Low, Air Fluff temperature settings  3 cycle selections on timer  Extra-large opening to drying basket  Handy up-front lint collector  Cross-Vane tumbling  Automatic cool-down period  Safety start button, door safety switch  Statjonary drying shelf optional accessory  Backed by Nationwide Sure Service Ranges, Refrigerators, Freezers aad Humidifiers"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "cool-down period  Safety start <mark>button</mark>, door safety switch  Statjonary"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "cool-down period  Safety start <mark>button</mark>, door safety switch  Statjonary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.44, 511.04, 1833.57, 1102.88], "bbox_id": "14d8f1acfc", "file": "AppomattoxNewspapers_1922-1923a_0241.pdf", "page": 1, "text": "West Buckingham Circuit. Trinity2nd Sunday 7 30 A. M. Bethel2nd Sunday 11.00 A. M. Centenary3rd Sunday 11.00 A. M. Glenmore4th Sunday Mi A. M. . . Woodland 1 st Sunday 3. P. M. Mt Tabor 1st Sunday ll.ee A. V, W  p. Pnovw oa. P. C. Buckingham. It is said if a man wants te com mit political snicide he has only to fall out with the newspaper men ant get the newspapers against him, bat as a rule I think newspaper men ail tote fair, so to speak and on the other h tnd they are not accorded as much consideration as wonld be the case if subscribers knew how editors and proprietors of papers often have to struggle to make out expenses, and they would not borrow their neighbors paper to keep from pay ing the small amount of subscrip tion, nor wonld they return the connty paper to the poskoffice marked refused. The editor of the Omulgee I. T. Democrat, after long suffering and perhaps muoh endur ance, comes forward with a compar ison, thus A man may nse the mole on the back of his neck for a collar button, he may ride a freight to save 3 cents a mile, he may light the lamp with a splinter to save matches, he may stop his watch at night to Bave wear, use a period for a semicolon to save ink and pasture iis grandmothers grave to save bay, but a man of this kind is a rcholar and a gentleman compared to a man who will take a newspaper and when asked to pay for it put it back in the postoffice marked Refused. Dr. Lac came and filled his-sp- poiutment here on the 24th night and 25th, preaching two fine ser mons, impressing all with his earn estness and zeal in the Masters cause. Two collections were taken each for the San Francisco suf- up fersrs. In private conversation Dr."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "neck for a collar <mark>button</mark>, he may ride a"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "neck for a collar <mark>button</mark>, he may ride a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [855.84, 1683.66, 1179.81, 1762.08], "bbox_id": "a98697f4d0", "file": "AppomattoxNewspapers_1892-1898a_0419.pdf", "page": 1, "text": "Wens hoes, Misses and Ladies Shoes, Oxford Ties, Umbrellas and Trunks WE LEAD THE MARKET. H A lS, HATS, we arc the people to sell cheap Children S. H. Tan Button Shoesd to 8 35 .-cuts. See our Oxford Ties for Ladies 1.00 and  1 . 2 a Tan aud Black. We invite Appomattox and Buckingham people to give ns a look. We can save you money."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Children S. H. Tan <mark>Button</mark> Shoesd to 8 35"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Children S. H. Tan <mark>Button</mark> Shoesd to 8 35"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [595.45, 411.74, 767.1, 773.57], "bbox_id": "208fef3afa", "file": "AppomattoxNewspapers_1954-1955a_0347.pdf", "page": 1, "text": "welterweight, Oscar Pita, and Gene Poirier, of Niagara Falls, was the most thrilling. Until that fight, some fight fans had seen in Poirer a fu ture welterweight champion. And it still might come to pass. Poirier has more talent than Pita but he doesnt have Pitts chin. The Argentine fighter took it from round one until round eight when he knocked Poirier down and out and won the tense, thrilling fight. Until that time Pita had not decked Poir ier or even come close to decking him. Instead, Poirier had been pound ing the Argentine lad mercilessly. He knocked him down once with a right so savage it must have hurt every member of Pitas family back in Argentina. But the undefeated South Ameri can did not know how to quit. How he was able to continue swinging and trading with Poirier in the con stant flurries is more than the mind can comprehend. But all of a sud den it happened. Oscar clipped Gene on the button. Gene had the fight won at that stage and could have cosated in  on this writers opin ion. But he was out to give it all he had and possibly knock out the Argentine fighter. Poirier must have exhausted him self beating his opponents, but"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "clipped Gene on the <mark>button</mark>. Gene had the fight"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "clipped Gene on the <mark>button</mark>. Gene had the fight"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [929.04, 262.41, 1458.35, 450.75], "bbox_id": "700751b710", "file": "AppomattoxNewspapers_1960-1962b_0487.pdf", "page": 1, "text": "Welcome Refreshment , Helpers Are Raisin Cherryettes With the two elections for July Democratic Primary and th eral Election, it gives me ere ! for all the officers and worker County in thanking each friend a support and work in helping  Primary Hon. Albertis S. Harris Hon. Mills E. Godwin for Lt G Robert Y. Button for Attorney  W. A. Pennington for the Houi tiYM. ___ Each of us wish for you a Me a Happy Prosperous New Year. Again with many thanks for y we remain"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Lt G Robert Y. <mark>Button</mark> for Attorney  W. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Lt G Robert Y. <mark>Button</mark> for Attorney  W. A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2016.71, 1493.36, 2184.16, 1685.59], "bbox_id": "bc283a6449", "file": "AppomattoxNewspapers_1922-1923a_0623.pdf", "page": 1, "text": "Welcome Proposition to Ladies! X t SJ v 2RE5?.YPU KLKOANTLY. IN TH LAT- I MIOPAIBION 8 0  PARIS, LONDON amd I Y2RK at M odedatr C o  t .  1 3110The Vanderbilt waist, w ttIU m tP artrt.B mtoachlnea  T O P M White iher lawn. Dwarf-tucked panel, united by 3   r val. laee inaerfion., combine to laa.   edlim yoke. Sw tu I B b w embroidery of open and blind  n i.U SSr  work, framed In Val. lace Inner- ISffiH ffT T llsA non, oon.tract ride arebra and opaulettea on Uie rtoaUer. Tiny S B M F ilH s L  SthBrlnfo Call from th yoke and Pbdta drop from the f t f l l  g ride., enforcing neat fold, to the    R .Mr full btonae. V a l. lace edini finish the tucked collar and cuffs. 1  pin tu ck . U M t A W k in Kml-Hsure V M . J   v .  Button bock. Hade In Wffivrl  u tA  aiht7ir w u r o n i 7  Prut WAISTS from 1 to SIS ea-Jtu f  w ith ev ery p srch n a e 1 all e h ln brlskt. o le workroom., thtu eliminating all rirts of contagion.  ShouM you not be mtlriled with your norohnae you n a y return sane to as aad tb tihuiw wMch r h U wU1 V refunded to you at once oreoo changed for otter good., which eVer y p u in fe r  V n c  trS t,2"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "V M . J   v .  <mark>Button</mark> bock. Hade In Wffivrl"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "V M . J   v .  <mark>Button</mark> bock. Hade In Wffivrl"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1277.05, 663.07, 1404.15, 1355.87], "bbox_id": "d48d4afb55", "file": "AppomattoxNewspapers_1915-1918a_0393.pdf", "page": 1, "text": "Welcome Ceremonioua 1 The coming of the American J had been kept secret outside ft!i ciai circles and there was u jl gathered at the pier, as w e ll been the case had the toaSlj , been aware of the event J  A, comPany of the Koval J Fusilliers, in neweBt khaki trial polished to the last button, wUM I up In double line facing the steuJ side, with the regimental band i3 A few paces to the front, hi J state and held in leash by a rigid! ate, was a mammoth white godl most famous regimental mascot oil British Army. A group of 10 Bin and American newspaper men uJ few other persons who had com meet passengers completed the f semblage. All the steamers docks were 1 with khaki. The waving of hua chiefs was the only demoutn from the steamer or the pier untOf gangplank had been run op. ill communication had been with the shore, Lieut-Gen. P m Campbell, Admiral Stilemasaodon officials proceeded aboard the eJ and went through the formal introfl tions. j American Anthem Played, j Then the British general ema General Pershing and his peia staff to the dock. The hand pin The Star-Spangled Banner and 1 the military men in sight stood ell tention, while civilians uiconB General Pershing inspected the M of honor, and, walking along  lines of soldiers, talked to sereiM the privates who displayed gilt stfl on their sleeves, signifying wounhi ceived in action. I Then the band played the Britldl them, the English soldiers nmfl smartly away, and the Americas! turned to the ship. I On To London. I A special train carried contliM of the American forces to Londu The arrival of the American ttifl don also was a quiet one, the Ufl edge of the coming of the rein tatives of the newest ally being  I known to the public. There were! military formalities at the ilifl where the party was welcomed hf m Earl of Derby, Minister of War count French, commander of the M ish home forces, and the America dais. M The American residents of tin ! and various British organirationihj prepared an extensive program d tertainment for the American P but it is doubtful if much of It! carried out, as General Pershing J tore being informed of the flaw pressed a desire that there be e n mum of anything in the nature n social character. Z General Pershing announced Mm and his felJow-officers were annona BUU 1110 teiav.. - ------ I, g  get into harness at their France as quickly as possible. fl"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "polished to the last <mark>button</mark>, wUM I up In"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "polished to the last <mark>button</mark>, wUM I up In"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [560.38, 1370.3, 719.9, 1617.41], "bbox_id": "5444cbc37e", "file": "AppomattoxNewspapers_1939-1943a_0218.pdf", "page": 1, "text": "Week-Old Calves I Can Be Dehorned 1 Horns, at one time, were a nec-1 essary part of a cows equipment. I They were necessary for protec- I tion, but under present modern I methods of management, cows do I not need horns. Horns may be I taken off when the calf is a week old without any loss and not too I much discomfort to the calf. Do I the job of dehorning as soon as I the horn button can be found I clip the hair around this tiny I bump and place a ring of vaseline on the lower side to prevent any drainage into the eye itself. Roughen the spot gently where ! the horn is starting with a corn cob or by scraping it. Moisten a stick of caustic potash and rub it on until the skin is a distinct pink. Caution Use gloves on your hands and let no liquid from the caustic stick get into your eyes or the calfs eyesits dangerous."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "as I the horn <mark>button</mark> can be found I"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "as I the horn <mark>button</mark> can be found I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1331.5, 386.92, 1469.6, 543.82], "bbox_id": "06ba00ad91", "file": "AppomattoxNewspapers_1892-1898a_0186.pdf", "page": 1, "text": "Wednesday. pine shoat for sale for cash by p, Black well, ccigw caU fo r Isle of Nijaat W. A- Moses  X r Joseph Button has been in ichburg, attending tlie Fair. Prayermeetiugwill be held at Mr or Martins on Thursday night L L Buck Martin has been em- yed bY the railroad at Mud Hole"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Moses  X r Joseph <mark>Button</mark> has been in ichburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Moses  X r Joseph <mark>Button</mark> has been in ichburg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2068.28, 826.07, 2396.03, 964.06], "bbox_id": "4d6954f7b4", "file": "AppomattoxNewspapers_1912-1915a_0029.pdf", "page": 1, "text": "We solicit your check accounts which everybody should hrre-thi only proper way to do business. Pay with checks and yoar check be a legal receipt. No matter how mall yonr account let ne b fa j  and we guarantee satisfaction. Plade yonr surplus with ns on account, 4 per cent. Patronize your friends and build up your own County Every farmers account wanted.  Hi DIRECTO R S v 1 J f l R.F. Burke, J. C. Jones, Jos. Button 1LD. Ifa  S. L Ferguson, Jno. A. Sears, J. R. Horsety."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J. C. Jones, Jos. <mark>Button</mark> 1LD. Ifa  S. L"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J. C. Jones, Jos. <mark>Button</mark> 1LD. Ifa  S. L"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [127.46, 311.71, 449.03, 447.45], "bbox_id": "a926f89366", "file": "AppomattoxNewspapers_1905-1912a_0204.pdf", "page": 1, "text": "We solicit your check accounts which every body should havethe only roper way to do business Pay with checks and your check will be a legal receipt Ko matter hew small your account let us have It and we guarantee satisfaction. Place vour surplus money with us on Interest account. 8 per cent per annum II remaining 3 mootUs, 3 per cent if remaining 8 months, and 4 per cent if remain ing 12 months. Patronize your friends and build up your own County. Every farmers account wanted. DIRECTORSi t. R Atwood, J. 0. Jones, Jos. Button, H. D. Flood, S. L. Ferguson. Juo A. Sears. J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J. 0. Jones, Jos. <mark>Button</mark>, H. D. Flood, S."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J. 0. Jones, Jos. <mark>Button</mark>, H. D. Flood, S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2118.51, 1614.52, 2460.23, 1752.92], "bbox_id": "37b167951e", "file": "AppomattoxNewspapers_1905-1912a_0097.pdf", "page": 1, "text": "We solicit your check accounts which every body should havethe only I proper way to do business Pay with checks and your check will be a legal receipt.  No matter how small your account let us have It and we guarantee satisfaction. Place your surplus money with us on interest account. 8 per cent per annum it remaining 2 months, pet cent if remaining 6 months, and 4 per cent if remain ing 12 months. Patronize your friends and build up your own County. Every farmers account wanted. DIRECTORS J. R. Atwood. J C. Jones, Jos. Button, H. D. Flood, 8. L. Ferguson, Jno. A. Sears, J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J C. Jones, Jos. <mark>Button</mark>, H. D. Flood, 8."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J C. Jones, Jos. <mark>Button</mark>, H. D. Flood, 8."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.45, 820.15, 2429.61, 958.04], "bbox_id": "2d4d6c095f", "file": "AppomattoxNewspapers_1912-1915a_0099.pdf", "page": 1, "text": "We solicit yonr check accounts which everybody should j only proper way to de business.  Pay with checks and year  be n legal receipt. No matter how small yonr account fa il and we guarantee satisfaction. Place yMr surplus with as onfatansf account 4 per cent Patronize your friends and build up your efwn County  . Every farmar account wanted. r d ir ecto r s  R. F. Burke,  ! J. C, Jones, Jos, Button, H. D. flonl S. L Ferguson, Jao. A. Sears, J. R. Horsely."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J. C, Jones, Jos, <mark>Button</mark>, H. D. flonl S."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J. C, Jones, Jos, <mark>Button</mark>, H. D. flonl S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2082.52, 803.95, 2417.72, 943.65], "bbox_id": "fda396a8e0", "file": "AppomattoxNewspapers_1912-1915a_0103.pdf", "page": 1, "text": "We solicit yonr check accounts which everybody should have-A only preper way to do business. Pay with checks yow becM l he a legal receipt. No matter how small yonr account let ra byig  wo guarantee satisfaction. Place your surplus with as  Msf _ account 4 per cent Patronlza your friartda and build up your Own County Every farmars account wanted., 1 DI RECTORS   R. F. Burke, J.C. Jones, Jo. Button,   JL D. Fleaf S. L Ferguson, Joe. A. Seam, J, R. Harssly."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "Burke, J.C. Jones, Jo. <mark>Button</mark>,   JL D. Fleaf S."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "Burke, J.C. Jones, Jo. <mark>Button</mark>,   JL D. Fleaf S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [173.74, 392.48, 333.79, 581.98], "bbox_id": "4444e3c513", "file": "AppomattoxNewspapers_1892-1898a_0282.pdf", "page": 1, "text": "We re indebted to the FLncastle.. Herald for its information concern- ing the election of Mr. Joseph Bnt- ton to a place on the State commit tee, vice J. T. Coleman, of Nelson, resigned, but its information about Mr. Button being such a good Dem ocrat is rather out of place, for everybody wiio know Joe Button know that he is a 6 taunch Democrat We regard him as one who is in favor of everything that tends to the suc cess of his party and against every thing that will bring defeat. There are Democrats who are differently  constituted.Buchanan Bauner."}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "its information about Mr. <mark>Button</mark> being such a good"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "its information about Mr. <mark>Button</mark> being such a good"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [149.47, 479.07, 474.77, 584.62], "bbox_id": "aae5e16469", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "We publish the demalf Hon. R. Taylor Scott written by his son. Our j their mother survive himreside in this county. Mr. Button was an able and fearless writer, a chnstian gentleman of the highest type and was considered at the time of bis deathor the end of his newspaper career, to be the greatest defender of the principles of Democracy and"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "in this county. Mr. <mark>Button</mark> was an able and"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "in this county. Mr. <mark>Button</mark> was an able and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.15, 1223.7, 1886.25, 1594.05], "bbox_id": "04e8a002a6", "file": "AppomattoxNewspapers_1898-1902a_0709.pdf", "page": 1, "text": "We PAY CASH SweBng salesmen. Outfit free, aqfljflg PaastUl. U. t. ed the horse show , Mr. A. B. CorneMijj spent a few days in this ihood. Miss Sally Scott gmed to I her home near Howii gfter a visit to the Misses H Miss Ida Horsley Dg this week with her aunt, 1 p . Bra dy, near Howardsville Quite a lot of whe geeded in the county last wee 0f the farmers having finishe Mr. Nick Sutton .tijfc at tended the sales of loeo .at Hardware. Mr. J. J. S. Horsley lv at tended the meeting of pu trackmen in Richmond. Mr. Sidney Taylor, of tao, this week visited his son, ,y lor, at Warminster. Miss Helen Davis Woop herst, is this winter teachiM home of Mr. George W. Pt Mrs. Otho Button and spent last week at Island V We are delighted to havt ns once more Miss Virginia Wheeling, West Virginia, Mr. Otho Sntton this"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "W. Pt Mrs. Otho <mark>Button</mark> and spent last week"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "W. Pt Mrs. Otho <mark>Button</mark> and spent last week"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1926.01, 1045.31, 2087.86, 1071.31], "bbox_id": "fdfee0b1d1", "file": "AppomattoxNewspapers_1926-1933a_0199.pdf", "page": 1, "text": "WE PAY 31.20 dozen, sewing bungalow ap rons a t borne. Spare time. Thread furnish ed. No button hole send Stamp. CEDAR GARMENT FACTORY Amsterdam. K. Y."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "WE PAY 31.20 dozen, sewing bungalow ap rons a t borne. Spare time. Thread furnish ed. No <mark>button</mark> hole send Stamp. CEDAR GARMENT FACTORY Amsterdam. K. Y."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "WE PAY 31.20 dozen, sewing bungalow ap rons a t borne. Spare time. Thread furnish ed. No <mark>button</mark> hole send Stamp. CEDAR GARMENT FACTORY Amsterdam. K. Y."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [415.91, 980.52, 762.72, 1322.05], "bbox_id": "a643134890", "file": "AppomattoxNewspapers_1943-1947a_0244.pdf", "page": 1, "text": "We passed a young man barely more than a boy, on the street this week. His left sleeve was emptyand he wore the gold but- WORK OF THE OWI ton which proclaimed him an hon- onarly discharged member of the In the Congressional debate on armed forces of the United States, a new appropriation for the Office All of us need to acquaint our- of War Information, the splendid selves with tiat emblem button, results from activities of this war jt is the mark of our heroes, of agency were brought out. Several those pho placed their talents and Congressmen who had been over- strengh at the command of our seas were able to give first-hand country in its time of test. They testimony of its effectiveness. The are men who served us who stay- j amount of misinformation that ed home in our extermity. They, j get around about a nation is truly the virile and deft, took up the amazing. Attest the lack of acou- sword in a service for which the rate data in this country obout rest of us were too old, too feeble, Russia. j too handicapped or too busy other- It is easy to understand that wise. Their material gains have an inaacurate concept of America been small although their spirit- may be obtained from viewing the j ual rewards must be greater than motion pictures distributed from  anything we stay-at-homs shall Hollywood. American movies are  ever know. shown the world over. Juvenile de-j It seemed we detected an air linquency is not the problem that about that youngster with empty foreigners viewing our movies are sleeve. We hope it was an air of led to believe, and our standards conscious accomplishment and rao- of family and home life are, we dest pride, for he has full right believe, higher than the movies in- to be proud. His empty sleeve is a dicate. And it is amazing what in- badge of honor. And we may not correct ideas of life in modern wear the soaring eagle in gleam- America are gathered by th-sq ing gold needs must feel pride in whose only source of information and gratitude to those who have is the  Wild West Saturday Night earned the right to do so. Movie. We are not a nation of __________ _"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "selves with tiat emblem <mark>button</mark>, results from activities of"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "selves with tiat emblem <mark>button</mark>, results from activities of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [624.25, 744.12, 1569.35, 909.84], "bbox_id": "cb06e14b82", "file": "AppomattoxNewspapers_1943-1947a_0186.pdf", "page": 1, "text": "We offer a comt re- hensive knowledge of atu ance and a ken appreciation of agency service. space for. Its traditional to wear your silver on your left arm and your I.D. Identification! bracelets on your right arm. Its practically compulsory to wear short strings ot graduated pearls with everything. Lend Us Your EarsWe want to put those metal or plastic hoop ear rings on them. Andbow about the drop style earrings? Its a rad ical change from the button types that have been weighing yon dosra. Sentimental SkunkHis name is"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "ical change from the <mark>button</mark> types that have been"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "ical change from the <mark>button</mark> types that have been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.06, 876.27, 1556.74, 955.46], "bbox_id": "2b12e86ec3", "file": "AppomattoxNewspapers_1947-1949a_0062.pdf", "page": 1, "text": "We had a pleasant chat this week with the new high school principal, John E. Peters. He is a member of the Lions Club and wears a one hundred percent attendance button. He is a Baptist. And he has had considerable experience as a referee for athletic contests."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "one hundred percent attendance <mark>button</mark>. He is a Baptist."}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "one hundred percent attendance <mark>button</mark>. He is a Baptist."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2156.62, 861.57, 2491.18, 1002.47], "bbox_id": "e19c9e6f6b", "file": "AppomattoxNewspapers_1905-1912a_0486.pdf", "page": 1, "text": "We foueft your check accounts which every Nbody shy M have-the o ly proper way to do business. Pay with check and your check w ilbea legal receipt No matter how small yoor account lot mi have ft a il w e1 guarantee satisfaction. Place yonr surplus with u on Mr tit 3 per cent per annum if remaining 2 months, 3  per cent If 6 months, u d 4 per cent if redafoing 12 months. 1 Patronise your friends and build up your own County Every farmer account wanted.-  d ir e c t o r s  J R. Atwood, J. C. Jones, Jos. Button, H. D. FlenA S. L Ferguson, Jno. A. Sears, J. R. Horsely"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "J. C. Jones, Jos. <mark>Button</mark>, H. D. FlenA S."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "J. C. Jones, Jos. <mark>Button</mark>, H. D. FlenA S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [533.5, 255.43, 689.4, 383.03], "bbox_id": "f91de29cf7", "file": "AppomattoxNewspapers_1892-1898a_0184.pdf", "page": 1, "text": "We are pleased to annouce that Chairman Button has succeeded in getting Senator Daniel to consent to speak here on next Court day. The Senator is in fine trim, and our people may come expecting to hear a great speech, with that they will not b Wherever lie lias spol campaign, lie has am to the highest state"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "to annouce that Chairman <mark>Button</mark> has succeeded in getting"}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "to annouce that Chairman <mark>Button</mark> has succeeded in getting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2054.4, 945.01, 2364.42, 1098.85], "bbox_id": "e50aaa3629", "file": "AppomattoxNewspapers_1933-1936a_0235.pdf", "page": 1, "text": "Way Off to On Sid A country storekeeper from Mis souri visited New York city recently. On his return, he-w as the center of attraction around the stove In his store the first evening. New York Is some town all right, he told his _ _______ __________ . listeners. Cars Bcootln like light- watches which keep good time and nln, 0Ter yer head, dash-burned long are so small that they can be set In tralng a.divin underground, bulldlns a ring the size of a very small slg- 0 blalned hlgh ye calnt see the tops n et There are cameras, too, small of ,enj mnions o miles o paved enough to be sewn inside the lining gtreetg an autos a-chasln ye all of a coat without making a notice- ovef the gtreet. Its a big town, all able bulge, the projecting lens look- rlght ag j gay but itll never be  Ing like a small button. I gucceBs. Its too fur away. Combining the arts of the cameo-"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Ing like a small <mark>button</mark>. I gucceBs. Its too"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Ing like a small <mark>button</mark>. I gucceBs. Its too"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1201.87, 1556.72, 1519.42, 1780.89], "bbox_id": "281e9ca33c", "file": "AppomattoxNewspapers_1954-1955a_0181.pdf", "page": 1, "text": "water for calcimine and other water-thinned paint turned his face to the wall, and whis pered, I have done my best, but 1 Under the Chestnut Tree jpred, . - ----------- - . Overfire air jets, now popular iB gpess now Ill never be able to worn furnaces and boilers, are based on again. the principle recognized by the oldff Eight months later, Al Hastings time blacksmith who forced a fcpbbled around to the old newspaper stream of air into his fuel bed tc The Boss suggested that he produce a hotter fire and lesi jnst drop by when he could, and smoke. jgst tinker around with his old machine. He even held out that Al Cool Sleeping plight earn some pay by helping to Like cool sleeping? y ttc, -keep the machine in shape. wear a short gown which button  Tne it was not long be down in front, fashioned in cotw  A1 HaaMngs waB in there oper- seersucker or nylon two pi hg maAi full time, again short pajamas or one piece shor J a crippie, and just pajamas shirred and elasticized    ma3tered it! To overcome two great tragedies polio Too-Easy.Reading n then amputation. T , There is danger in trying tc I never saw Al again. But I did teach a child to read too early"}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "a short gown which <mark>button</mark>  Tne it was not"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "a short gown which <mark>button</mark>  Tne it was not"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [936.25, 375.16, 1089.95, 753.56], "bbox_id": "c539e9459e", "file": "AppomattoxNewspapers_1955-1957a_0578.pdf", "page": 1, "text": "WASHINGTONEveryday Life In Early America is portrayed in a new hall opened by the Smithson ian Institution. Filling a gallery 180 by 55 feet, the new hall is a novel installa tion. It provides for the first time in Washington a comprehensive display of the domestic parapher nalia, furnishings, and settings of seaboard America from its initial European settlement to the indus trial revolution. Also for the first time in an exhibition of American cultural history in a large mu seum, it introduces the revolution ary new exhibit techniques which were first applied to exhibits of natural history. In an actual 17th- century house, in four other room interiors, in an early 19th-century schoolroom and in 52 professional ly designed case exhibits, speci mens are used not only to exploit their own intrinsic qualities, but also to illustrate ideas and tell a narrative history. Illustrations, diagrams, models, maps, and narrative labels supple ment specimens, while colorful backgrounds and dramatic light ing help to vary pace and over come museum fatigue. Push button switches, which the visitor can operate to change room lightr ing from daylight to candlelight, and an introductory tape-record ing triggered by the proximity switch add modern dimensions to this hall of antiquities."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "come museum fatigue. Push <mark>button</mark> switches, which the visitor"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "come museum fatigue. Push <mark>button</mark> switches, which the visitor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2255.39, 1089.31, 2427.73, 1301.51], "bbox_id": "a367d36c20", "file": "AppomattoxNewspapers_1912-1915a_0183.pdf", "page": 1, "text": "Washington sud Chsttanooga  . a u .. . Deav Lyaabburg  So. Railway button SGSa. m. tot Bristol . ana the South. Tuilman Bleeper so Now v Orleans. Cale Dining Car. riemphla Special Leave Lynch- ourg 8 o. Ry. Btatlon 0 fiio a.m. for Rnokvllle Ch.ttanooga, Memphis, Nashville, Pullman Bleeper, Dining Car. Nu.n, o m i a. Daily for Lynchburg id Roanoke. Parlor Car  K a BTBOUND. 5.16 p. m. dally lor Petersburg, Rinhud and local station. No.16 , 8218 a.m.dally For etersbnrgjfor. ioiHg JUcflunoml ftou stations of min Petersburg Pulimaa sleepers t Norialk and Richm  .6 No. 6 , uovi a, m. Roanoke Rxpresa. dall lor Farmville, Peters urg, Richmond, Pai- lor Car, and Norfolk. Connects at m èra, ourg lor Norfolk iur lurtuer. mormatlon apply to gent M W. Ry., or W B. hit VILI. Pass. Trail. Mgr. W.C. SAUNDKM, Uanl Pass. Agfa Roanoke, V."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "Deav Lyaabburg  So. Railway <mark>button</mark> SGSa. m. tot Bristol"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "Deav Lyaabburg  So. Railway <mark>button</mark> SGSa. m. tot Bristol"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [459.62, 405.04, 631.69, 1221.43], "bbox_id": "2166a4ca8d", "file": "AppomattoxNewspapers_1947-1949a_0426.pdf", "page": 1, "text": "WASHINGTON, D. C. other tilings, the treasury depart incut is fussing over what to do with one 10 karat collar button and three hairpins. Items such as these are about to crowd the money out of the gov ernments huge vault in the treas ury building basement, Tiie stuff was turned over to the treasury as unclaimed by the state department. For safe keeping. Most of it originally belonged to Americans who were living in for eign countries. W h e n nobody showed up to claim it, it was given to the American diplomatic rep resentatives. They shipped it to the state department. The treasury would like to do something about it, but cant. There is no law which would al low it to hold a public auction on the huge stacks of German marks from before World War I or Rus sian rubles. Secretary Helpless Secretary of the Treasury Sny der is as helpless as the next one. For one thing, he doesnt even know the combination to the safes. W. K. J ulian, the treasurer of the United States, knows how the locks work, but hes not talking. Anyhow, to get back to buttons and hairpins In 1934 the state department sent a small boy over to the treasury under heavy guard with a large envelope, along with a little note stating that the owner could not be located. Ihe treasury people opened the folder and found one pair of horn rimmed spectacles with g o l d mountings in a black case one cuff button one collar button one womans handbag containing a pair of manicure scissors, one gold earring, a gold ring and a Cuban coin worth about a nickel a rusty .22 caliber revolver that wouldnt shoot and a cheap watch, junior size, that wouldnt run. The three hairpins turned up in j another packet, which came from Yokohoma, Japan Articles Pile Jp As the years go on, such tilings pile up and gather dust in the dark, massive vaults. The collection goes back a long way. One letter on file tells of a flock of bonds captured in Louisi ana in 1865 and turned over to the treasury for safe keeping, They are still there. The letter says the bonds, payable to the city of New Orleans, were worth at the time 4,476,980 and were captured at J Shreveport July 12, 1865, by Gen. Philip Sherman. There are a lot of curios in the vaults. One is a gold medal which was supposed to have gone to a man who did a lot of heroic work in fighting an epidemic of yellow fevei in the tropics. The name of the man isnt on the record, but the medal inscribed to An Un sung Hero was turned over to the vault keepers. The buttons and medals and bonds keep coming in. The treas ury is about to throw in the sponge or move to a larger building."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "one 10 karat collar <mark>button</mark> and three hairpins. Items"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "one 10 karat collar <mark>button</mark> and three hairpins. Items"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2443.77, 476.45, 2624.2, 1137.14], "bbox_id": "8454449996", "file": "AppomattoxNewspapers_1939-1943a_0228.pdf", "page": 1, "text": "Wash white chiffon in lukawi, water, slightly soaped and with a tie blueing added. This helps iMfthjK the chiffon from turning yellow. Han dle carefully. Shape out and brng over cloth. When nearly dry, press on wrong side with warm not hoi iron.    A utility box is very helpful fqr storing rubbers, galoshes, bass mitts and similar essential but Mfl. dom used articles when there is op hall closet. Use a large sized, stefei wooden box, hinge the top, lMa  the inside and stain the outride. Yep then have a practical, neat loofiSg piece of furniture. AMoclated NewspapersWNU Sarvl. It Easy for Husband To Fix Own Breakfast A man should not make his pr 3i wife get out of bed to cook his hr fast. All he has to do is to Get a couple of eggs and a of slices of bacon, put the fry pan over the flame and put flic bacon in the pan. t While the bacon ia frying, put  couple of spoonfuls ot coffee into A pot with a couple of cups of water and put the pot over a burner. - A Grab a loaf of bread from tip breadbox and a hreadknife from tip kitchen draper wnd see if he call cut a couple of slices of bread be fore the bacon burns. Leap through the smoke and rescue the bacon Light the burner in the oven and place the bread under It to toast. Rush to the refrigerator for button cream and an orange, and get h a  to the range in time to save what coffee hasnt boiled over. Break the eggs into the frying pan without breaking the yolks, rush tat a knife to cut the orange and squeeze it. Whats that burning? Great heavens! The toast! Dash back and save what is left of the toast, ing off the charred portions, Rush back to the range to turn eggs. Rush back to the toast to 1m ter it. Rush back to the rango save the eggs. Dish the eggs and the bacon and, while they are getting cold, strain the coffee into a cup. It will eithdr be a pale yellow it is so weak, or an inky black it is so strong. Leave everything as it is for wife ! to clean up, put on hat and coat and  go out to breakfast. And there, with no more MU  it takes to make an airplane engine, J he has a breakfast At for a Sing The king it is fit for is probably on-- without a country, refugeeing from the w ar............................."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "to the refrigerator for <mark>button</mark> cream and an orange,"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "to the refrigerator for <mark>button</mark> cream and an orange,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [863.74, 295.14, 1019.26, 378.09], "bbox_id": "5b25141492", "file": "AppomattoxNewspapers_1915-1918a_0038.pdf", "page": 1, "text": "Wash hairbrushes In common bak ing-soda water a teaspoonful to a pint of hot water. Dip the brushes up and down In this until clean, then rinse In clear water and dry, bristle-side down. Buttons will stay on longer if the knot in tbe thread is pnt under the button before beginning to sew it ion."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "is pnt under the <mark>button</mark> before beginning to sew"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "is pnt under the <mark>button</mark> before beginning to sew"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [176.64, 771.43, 493.28, 1041.82], "bbox_id": "66e7dc0810", "file": "AppomattoxNewspapers_1902-1905a_0325.pdf", "page": 1, "text": "was alleged it could be tried by an .inpartial jury, unsurrounded by my possible prejudice, hut Judge Hundley finely refused to grant Col. Jo Button has been to Sain. I he content ion, retain ng the c -se in Louis the Democrat can now meet I Buckingham county, and setting and nominate Judge Parker, Ifthe third M nday in July as the they do, we shake Jo, not the plum I time for the trial, treefor are not we original Parker I The trial of this case brought meD ?  f.irth testimony of iutenss interest iiid developed features that go to novc only more surely than ever lie remarkably sensational character if this knotty case. Prom all sid- s comes the confirm i ion from the citizens, as well as ,rom barristers, that no such myste r ous case has ever been known or heard of in this section of the State before. Mr. V. E. Howard filed the uffi davit of the three prisoners begging ot a change of venire, but a change"}, "highlight": {"text": {"matched_tokens": ["Button"], "snippet": "to grant Col. Jo <mark>Button</mark> has been to Sain."}}, "highlights": [{"field": "text", "matched_tokens": ["Button"], "snippet": "to grant Col. Jo <mark>Button</mark> has been to Sain."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.67, 1407.39, 2214.77, 1454.84], "bbox_id": "3cd3e7ed0a", "file": "AppomattoxNewspapers_1949-1952a_0190.pdf", "page": 1, "text": "Want an automatic top that scoots up or down when you touch a button? Then heres the car for you! And youll find this swank, spirited Chevrolet Convertible as far ahead in performance as it is in styling."}, "highlight": {"text": {"matched_tokens": ["button"], "snippet": "when you touch a <mark>button</mark>? Then heres the car"}}, "highlights": [{"field": "text", "matched_tokens": ["button"], "snippet": "when you touch a <mark>button</mark>? Then heres the car"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
