{"document": {"bbox": [1506.75, 1072.38, 1810.55, 1323.48], "bbox_id": "706ea8e3c2", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "Wm. M. Cabell vs. Susan Johnsons Admi. j o fl slzes a r r  ..Home at Swmp-Root confirmation o i report of sale, and order to collect. W m. H. A bbltt vs. D. E. Wool ridges Admi final decree. C. 1. Rucker vs. Annie U. North, and Annie ii. North vs. R. A. North, c. coufiruiutiou of uummissiouers report, and order to puy cuminuiafiou fur dower. James M. Uolu vs. Sumuel H. Join rule uwarded. - im sintis ul Appomattox circuit, MuthodUt Lpiocupui Church South confirmation of sale, and final deoiee. A. Ii. Clement vs. kettle Carson and others deed sot aside, uud order to rent land. i. Coleman vs. it. G. Gillispie iu junc tion uissolved. J. i. h. Flesh man vs. J. P. H arvey report of sale codfirmed, and order to pay coats, u. J. IC. Hannah, Ac., vs. C. H. Chilton leave to file answer given to defendant. it. P. Puuiett vs. Willis A. Paulett and oth ers  older for partition. , K. J. Binford vs. L. H. and L. C. Gilliam older confirming commissioners report, aud to distribute funds. ,- usjc C. Nowlin vs. W. B. Nowlin, Jr., Ac. sale confirmed, and order for distribution. II. 1. Flood vs. A. H. Clement order for taking accounts."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "IC. Hannah, Ac., vs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> leave to file answer"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "IC. Hannah, Ac., vs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> leave to file answer"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.87, 381.47, 1980.9, 693.66], "bbox_id": "130aac4e50", "file": "TimesVirginian_1976_0308.pdf", "page": 1, "text": "we desire to place before the minds of our representatives the name of Mr. C. H. Chilton, of Appomattox county, who with twenty years or more experience as teacher, and for twelve years Superintendent of Public Schools in Appomattox county, besides for scholarship, holding an A. M. diploma of one of our highest institutions will rank hhw second to none in qualification that may apply. Mr. Chilton, although a cripple, has for several years devoted his entire attention to his farm, being actively engaged in driving the axe, plying the hoe, and guiding the plow, and in this occupation his success will testify of his energy, industry and sldll. A greater reason till is presented to our minds in this, that one so well qualified morally, mentally, socially and politically does not court this or any other office, and hence we think the office would be honored in having such a"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "the name of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, of Appomattox county, who"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "the name of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, of Appomattox county, who"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1926.23, 1030.21, 2093.94, 1786.35], "bbox_id": "d195d3047a", "file": "AppomattoxNewspapers_1912-1915a_0175.pdf", "page": 1, "text": "W ith an apology for our seem ing indifference to T he imks , we will come again, oniyurgent duties have kept your scribe iu silence. A fter the exceedingly hot w eather of last week, the de- ightful cool breeze of today is especially invigorating.  The crops in this section are look ing unusually well. Some of our larm era com plain of the grass and weeds growing so rapidly seem ing to forget th a t nature is no respector of plants, the weed m ust grow if it has a chance as well as the corn, and the invigorating rain m ust fall on all alike. The w heat harvest is over and the faim ers are looking forw ard to a bountiful yield this year, the prospect is speci ally prom ising at present. The whistle of the threshing macu ine is a fam iliar sound at this tim e. Mr. O. F. Cheatham was ex ecting to thresh in this neigh borhood last week, but was de tained by a seem ng very small incident while removing a sm all bucket of berries, wnich was closely covered from the stove, boiling hoi, the pressure of steam forced the top off, and he was badly burned in the face with the hot berries. We are glad to note th at he is much better, and will not lose his eye-sight, as was feared. The m atrim onial idea was carried out last week among one of our young couples the parties being Mr. Willie Lee, of this place, and Miss Annie Fold, daughter of Mr. Laborn Ford, K. F. D. carrier. They were m arried at R ustburg last Sunday both are quite young, W e give them our best wishes The Childrens Day services at Early Chapel were quite success. Many from arouni here were participants of the entertaining features. Miss Louise M orris is spend ing some tim e w ith her grand parents, Mr. and Mrs. C. H, Chilton. Miss Jamie B arkesdale a t tended tha Conven tion a t Mat"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "parents, Mr. and Mrs. <mark>C</mark>. <mark>H</mark>, <mark>Chilton</mark>. Miss Jamie B arkesdale"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "parents, Mr. and Mrs. <mark>C</mark>. <mark>H</mark>, <mark>Chilton</mark>. Miss Jamie B arkesdale"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [393.6, 1430.99, 558.1, 1850.81], "bbox_id": "08b9c7d609", "file": "AppomattoxNewspapers_1898-1902a_0256.pdf", "page": 1, "text": "T n d e pe n d g n t s . We direct your attention to the note of Mr. C. H. Chilton, who claims to be yoor candidate. The note does not answer the charges made by Mr. Flood in hia Concord speech, aud it would not be found in these columns but for the fact that current rumor has it that Mr. Chil ton would take advantage of our invitation to answer the charges through our paper and further to prevent .the cry of unfairness which would certainly be made by the friends of Mr. Chilton upon onr refusal to publish his defense. Is the defense satisfactory to bis most aideut supporters? Independents will you be ridden by this kicker and disappointed office-seeker that his personal, selfish greed for office may be satiateda man who regards so lightly the serious charge of at tempted assassination and who when charged with the crime is satisfied with the yon are auother kind of- defense. What the people looked for Mi. Chilton was a denial of the authorsiup of those anony mous letters. The. people are diaap- pointed in yon. We opine they will not accept yonr avasive answer and that the registered verdict against you ou November 7th will prove i t"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "the note of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, who claims to be"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "the note of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, who claims to be"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1957.3, 457.46, 2117.65, 875.77], "bbox_id": "0a7b4d505c", "file": "AppomattoxNewspapers_1915-1918a_0021.pdf", "page": 1, "text": "Spout Sprint News. MisB Agues Davidson Bpent last week with her aunt, Mrs. Lula Howerton. Miss Lilith Nowlin of Lynch burg spent a few days recently with Mrs. R. W . Nowlin. Miss Mary Robertson is visit ing her grand-mother Mrs. S. G. Carter at James River. Mrs. Walter Carson spent the past week with her parents Mr. and Mrs. G W . Cheatham Miss Ethel Binford of Prince Edward is spending several days with her grand-parents Mr. and Mrs. C. H. Chilton. Mrs. Chauncy Babcock of Lynchburg spent last week with Mr. and Mrs. Bob Cheat ham. Mr. and Mrs. W. B. Ellett, of Roanoke, visited at the home of Dr. D M Robertson last week. Several of the neighborhood people attended the Sunday School Convention at Concord Tuesday Mrs. J. H . Robertson left Tuesday, to attend the W . C.- T. U . Convention which was held at Brookneal. Mr. Warren Nowlin of Lynchburg spent Sunday with Mr. R. W. Nowlin."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "grand-parents Mr. and Mrs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Mrs. Chauncy Babcock of"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "grand-parents Mr. and Mrs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Mrs. Chauncy Babcock of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1595.65, 1205.8, 1859.22, 1342.29], "bbox_id": "8b7ef58972", "file": "AppomattoxNewspapers_1971-1973a_0144.pdf", "page": 1, "text": "School Trustees Electoral Board chairman Stuart McD. Farrar center keeps records of the board meeting in a book almost 100 years old. Meeting for the first time with the board on Saturday morning was Floyd W. Fleshman, Jr. far left Southside representative with Jack Martin, Stone wall representative far right. The minutes book dates back to August 22, 1877. Judge Henry L. Parrish was chairman and C. H. Chilton was secretary. Board chairman Farrar the CloverhiU representative announced the appointment of Mrs. Martin L. Webb, Dr. A. A. Fratrick and Dr. R. H. Gray to the school board. In addition, Farrar has called a meeting of the Trustees Electoral Board for Dec. 30 at 10 a.m. to appoint a member-at- large to the school board."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "Parrish was chairman and <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was secretary. Board chairman"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "Parrish was chairman and <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was secretary. Board chairman"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.44, 1026.21, 572.99, 2006.26], "bbox_id": "0b26d5cbdc", "file": "AppomattoxNewspapers_1898-1902a_0248.pdf", "page": 1, "text": "ot more than one or two m to be Democrats knew ents of the paper. Mr. Hoiwky was nominated by a convention oiSkhf two counties rep resenting the m assif the Democratic voters of these c o u n ts. Mr. Chil ton was placed in the-field by a mass-meeting which met aiChjjcord on August 25th and which, aïfef much riding on the part of Mr. Chil ton in an effort to secure a large turn-out, was composed of but twenty-nine people six from the great county of Campbell and twen ty-three from the county of Appo mattox, but one single one of whom could claim with any sort of truth to be a Democrat. Mr. Chilton was put in the field by the leading Re publicans of Appomattox county and if elected, he will act in the Legisla ture of Virginia not with the temo- cratic party, for he would not be permitted to enter its caucus, but with the Republican party and their allies, the Independents. Mr. Chilton, who is the writer ot the circular to which we refer, al ludes to bossism, ring rule, machine politics, corrupt election work, fraud and deception practised by the po litical tricksters in Appomattox county. We simply desire to say that there is no foundation in truth for any such charges. It is very easy to make a broad assertion of fraud anywhere. The Republican party has been indulging hi such charges against the Democratic party ever since they were whipped from power and the charge made by Mr. Chilton is but a rehash of the charges heretofore made by the Re puhlicaus. ilossism is a stale argument of the outs agaiust the ins, When Mr. C. H. Chilton was one of the ins, he was perfectly willing to submit to the kind of bossism winch he now decries and of all the people iu Appomattox county who have as sent bled at Democratic political meetings there was no louder claeker than C. H. Chilton. Of all the Democratic following of the county, there was no man in it so bitter and abusive of Republicans and1 Inde pendents and Populists as C. H. Chilton was and it was .not until he realized the fact that a number of the prominent member. of the Democratic party in the county were opposed to his re-ap pointment to the position of Super intendent ol schools of the county, hat he discovered, all of a sudden, hat Appomattox was a county of cliques aud bosses. It will he urged in Mr. Chiltons behalf that jieople who are opposed to the present election law should vote for him. This election law was enacted by the Legislature of Virginia at the session of 93 and 94. and went into operation for the first time at the Congressional election of 94  at that time, the Democratic party had no warmer supporter than Mr. C. H. Chilton and the present election law no stronger upholder than be nor from that time to his removal from the office of Superin tendent of schools in 97 was he ever beard to raise his voice against this election law. Who then can believe that his position in regard to it now is due to anything but a de sire to make cheap and false political capital for himself. Mr. Horsley is a man of sterling integrity of character, of à high or der of ability, of fine Business qual ities, and is a Democrat who stands by his party nominees whether they ai his choice or not and whether he"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "the ins, When Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was one of the"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "the ins, When Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was one of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2070.26, 328.72, 2231.42, 901.12], "bbox_id": "ec6e4135c1", "file": "AppomattoxNewspapers_1915-1918a_0431.pdf", "page": 1, "text": "of his wife,who died on the 8th,  ot typhoid fever. Mrs. George Gyrus is ill with fever. There are two in the family of Mr. Jim Goff sick with fever. Also some colored peoplere siding on the tarm of Mrs, Lula Howerton, have been very sick with this dreadful ailment. Mr. and Mrs. R. O. Fleshman and little son, Robert Howard, of Bluefield, W. Ya., were guests at the home of her fa- j ther, Mr. J.H. Morris, recently. Miss Lena Morris is spending some time at her fathers, in our midst. Mr. Street, assisted by Mr. Flanagan, conducted a series of meetings at Reedy Spring recently the meeting was well attended, aud we are hopeful of much good. , Little LouiBe Morris is spend ing some time with her grand- fatLer, Mr. C. H. Chilton. Some of our people are very  much interested in tho can ning business and are putting up vegetables, whioh t h e y would never have thought of keeping in years gone by. The oanning demonstrator, w ho came to Sherwell a few weeks i, left many valuable ideas on the canning subjeot among  those interested in this work. Mr. L. T. Morris.was in Lynchburg recently, ports all merchandise as ever, and country plentiful. Our farmers say they are needing rain again our corn crops are looking well and if it I is seasonable, they will tell you more about their corn orops later."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "her grand- fatLer, Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Some of our people"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "her grand- fatLer, Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Some of our people"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [617.34, 1447.14, 779.44, 1765.28], "bbox_id": "8f7ad11962", "file": "AppomattoxNewspapers_1898-1902a_0246.pdf", "page": 1, "text": "Notice. To IF hom I t M ay C oncern  In u circular being distributed by Mr. C. H. Chilton and to which my name is signed, I find the following VVe also beg leave to say that we are independent Tyler Democrats of the old school and so is Mr. Chil ton, but we and he and a great num ber of our bard working people have become so perfectly disgusted, yea worn out beyond endurance with bossism, cliquisnt, ring-rule, ma chine politics, corrupt election work, fraud and deception practised by political tricksters in Appomattox, that Appomattox Democracy lien now exists only in name and is-bn a shadow of its former self. Y hen I signed the paper presentee to me by Mr. Chilton 1 had no con ception that any such arraignment of the Democratic party of Appo mattox County was in it and if 1 had known it was there, I should never have signed the paper, as I do not believe or cone,ur in the state ments there made. 1 know of other people who signed it under similar circumstances. Respectf u liy, A. H. P ayne ."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "being distributed by Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> and to which my"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "being distributed by Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> and to which my"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.55, 690.45, 1645.42, 747.95], "bbox_id": "daed49c273", "file": "AppomattoxNewspapers_1892-1898a_0362.pdf", "page": 1, "text": "Messrs. J. K. Hannah, C. H Chilton, present incumbent, and Dr. Julian Abbitt are candidates for the appointment of school superin tendent for this county."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "Messrs. J. K. Hannah, <mark>C</mark>. <mark>H</mark> <mark>Chilton</mark>, present incumbent, and Dr. Julian Abbitt are candidates for the appointment of school superin tendent for this county."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "Messrs. J. K. Hannah, <mark>C</mark>. <mark>H</mark> <mark>Chilton</mark>, present incumbent, and Dr. Julian Abbitt are candidates for the appointment of school superin tendent for this county."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1911.56, 340.6, 2067.41, 640.74], "bbox_id": "f33c77bde3", "file": "AppomattoxNewspapers_1915-1918a_0187.pdf", "page": 1, "text": "m an Cheatham . W e learn th a t the little son of Mr. Eldridge Cheatham has diphtheria and is no better. Miss E ith a Morris is at home again w ith her fath er, Mr. J. H. Morris. Miss M ittie N ash entertained some of her young friends on the afternoon of th e 24th. L ittle H ow let M orris, son of Mr. Leslie Morris, is on thesick list. Rev. Mr. Street w as at his post of duty Saturday, He is gaining in popularity among his people and will be a m eans of great good, w e hope. L ittle V irginia Morris is spending some tim e with her grandparents, Mr and Mrs. C. H. Chilton. W e are glad to learn th at Mrs. J . B. C hilton, who has been sick, is convalescent. The inclem ent w eather pre-"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "grandparents, Mr and Mrs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. W e are glad"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "grandparents, Mr and Mrs. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. W e are glad"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2188.14, 253.8, 2335.22, 1235.29], "bbox_id": "f154d4aa0f", "file": "AppomattoxNewspapers_1962-1965a_0371.pdf", "page": 1, "text": "languages, math, English, social subjects and physical education. With a library of more than 5,000 volumes, audio - visual equipment and a growing guid ance program, the school has a bright future. From time to time salaries were discussed. In 1S72 the County Board adopted a salary sohedule A teacher holding a full certi ficate to receive 35 per month. A teacher holding an Inter mediate certificate to receive 25 per month. A teacher holding a Primary certificate to receive 20 per month. Teachers who had no certifi cate received less than 20. Mr. Chilton, as have other county superintendent, made a strong effort to help the teachers im prove their professional prepa ration. At the beginning of the school system in our county our efficient County Superintendent, Capt. C. H. Chilton, organized a County Teachers Institute, which met under a constitution and by-laws adopted by the soc iety for instruction in pedagogics regularly every month. The pro- meter of all school work found here a wide and inviting field. Captain Chilton did a good Work in this direction. Textbooks w e r e regularly studied to recite in these teach ers meetings in connection with recitations on theory and prac tice of teaching. Young teachers found aid and stimulus to their work. The more experienced be- oame more deeply impressed with the dignity, importanoe and responsibility of their avo cation. None but madmen and fools could ever aim to suppress such a helpful institution and adjunct to our admirable sys tem of free education. Gradually Capt. Chilton less ened the number of meetings, unfit an annual Institute was all that necessity seem to him to require. Even then steps to re quire teachers to attend had to be taken. As toe years passed a committee made up of the sup erintendent and teachers plann ed the Institute. The board was foresighted enough to recognize the value to be derived from the Virginia Journal, so in 1907 it was sent to each teacher for six months at the boards expense. The board did this on other occasion also. It was agreed to try to induce all the teachers who could do so to attend the Teach ers Meeting in Roanoke, Octo ber 5, 1907, and to receive their usual pay during the time lost from school.  Many teachers, maybe all, had to go to the Court House each year to take examinations for two days. Those examina tions were far different from what most of us would give to day. The Board granted a 2.50 per month raise in salary to those who attended the State Normals Summer School. The early schools were heated by fireplaces if heated at all. The big boys, and there must have been big boys in every school since the board allowed people up to 25 years of age to attend without paying tuition, went Into near-by woods and either broke up or cut wood which they dragged or brought. As money became available the board hired people to deliver wood to school to be cut. Later cut or sawed wood was deliver- jed. The big Girls swept the one - room sohool. The water  bucket and gourd, later the dipper was a necessary part of"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "efficient County Superintendent, Capt. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, organized a County Teachers"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "efficient County Superintendent, Capt. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, organized a County Teachers"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2040.46, 633.81, 2176.86, 745.6], "bbox_id": "73fca8c7cf", "file": "TimesVirginian_1980a_0296.pdf", "page": 1, "text": "Hannah for .25c. The dates of beginning and ending of the, school sessions for the fourteen-year period are given. C. H. Chilton was appoint - ed the first Superintendent of Appomattox County  Schools when the public schools were begun in 1870, a post he held for almost"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "fourteen-year period are given. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was appoint - ed the"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "fourteen-year period are given. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was appoint - ed the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [351.6, 1365.37, 516.16, 1794.32], "bbox_id": "5d8b4a41d9", "file": "AppomattoxNewspapers_1892-1898a_0394.pdf", "page": 1, "text": "H on . R. T. S cott , A ttorney General of Vir ginia, Richmond, Va, d b a r s ib  In Feb. 1896 the School Board of Appomttos by a unanimous voto allowed Mr. H. D Flood a foe of 150.00 fof the prosecution of four chancery suits he had brought against two Ox-Treasurerof the Cointv and in which lie had recovered a large sura for the school fund  nt the time tills allowance was made Mr. Flood was Attorney for the Jommon- wc ilth of said County, and on that account the Superintendent of Schools.contende-i that he was not ontit ed to a fee. Mr. Flood de clined to accept, the warront unless in your Opinion he was entitled to a fee and at hi sug gestion a committee was appointed to make a statem ent of the facts iu the case to you, The undersigned is the committee. We subm it the attached statem ent signed by the members of the School Board when Mr. Flood was retained, ns a true statem ent of tlife acts of the case and desire your opinion, from these facts, as to whether we had power to allow a fee to Mr. Flood, out of the fund re covered by him in the four chancery suits. That there are bu t three School D istricts n Appomattox and were bu t three in 1890, so there were only nine trustees. Respectfully, T. A. S mith , J. T. M oses , J. W. G ii . i , iam , Committee, To Messrs. .1. T. Moses, T. A. Smith and J. W. Gilliam Committee of the School Board appointed to ascertain the facts in connec tion with allowing a fee to H. D. Flood at the moeting of the School Board of Appo m attox county on February 6 th 1896. We the undersigned desire to state th at we were mombers of tho School Beard of Appo mattox county on the 8 th day of January 1890 and for sometime th ereafter that there was a meeting of sad board on that day for the purpose of having settlem ents with Mr. J. R. Franklin late treasurer of said oounty that anticipating some trouble in securing a set tlem ent with Mr. Franklin and the A ttorney for ihe Commi nwealth of said oounty being W. C. Franklin, esq., the son of Mr. J H Franklin the board a t the instance of Mr c  H. Chilton, superintendent of schools for Ap pomattox county retained Mr. H. D. Flood as their counsel to bring about this settle ment. Mr. Flood was present and a sottie ment was reached by which it was agreed that Air. Franklin should pay 108.47 and th at this should he accepted in full of the amount due by Mr. Franklin and if tins was paid that the question of the 2 percent of the penalty lidded after December 1st In each year should not be raised as to Mr. Franklins term. Sub sequently Mr. Franklin raised some question About this settlem ent and Mr. Flood as the representative ef the Bourd some two years later brought suit fer a new settlem ent, Mr. Hood was isscruetod to investigate Mr! Shearer liability for tile 2 per cent of the 5 p ercen t penalty added after December 1st in"}, "highlight": {"text": {"matched_tokens": ["c", "H", "Chilton"], "snippet": "the instance of Mr <mark>c</mark>  <mark>H</mark>. <mark>Chilton</mark>, superintendent of schools for"}}, "highlights": [{"field": "text", "matched_tokens": ["c", "H", "Chilton"], "snippet": "the instance of Mr <mark>c</mark>  <mark>H</mark>. <mark>Chilton</mark>, superintendent of schools for"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [409.95, 390.53, 570.66, 671.48], "bbox_id": "3dd2469afd", "file": "AppomattoxNewspapers_1912-1915a_0589.pdf", "page": 1, "text": "G lendale After the nice rain of last Sun day Dight the vegetation in our sec tion is much refreshed and the crops are growing again. The general health of o u r people is good. Mrs. R. W. Martin is much improved. Some symptom of fever bnt no developed ctses in onr midst. Mis. Galvin Torrenc1 was in our neighborhood Sunday. We hear from Wren, Charlotte r Mr. Ramsey, son of Mr. Fioyd and Ava Vorrifg Ramsey. Little Miss Virginia Morns is spending some lime wth her grand mother, Mrs. C. H Chilton. Mr. Warner Frankiin is on the sick list. He! en Dickerson will relatives"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "her grand mother, Mrs. <mark>C</mark>. <mark>H</mark> <mark>Chilton</mark>. Mr. Warner Frankiin is"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "her grand mother, Mrs. <mark>C</mark>. <mark>H</mark> <mark>Chilton</mark>. Mr. Warner Frankiin is"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.02, 398.11, 1605.36, 1042.4], "bbox_id": "240ef6d393", "file": "AppomattoxNewspapers_1955-1957a_0014.pdf", "page": 1, "text": "from public taxes. In 1870, this in novation met with considerable op position. Good judgment finally prevaield and the County Public School System was begun on a very modest scale. The first public school in this county was located in a log cabin near the Old Court House. The first teacher in the public school system was J. H. Featherston. The first County Superintendent of Schools was C. H. Chilton, 1870- 1881. He was succeeded by J. B. Bristow, who continued in office un til 1885. Mr. Chilton returned to office in that year and served until 1897. Sucessors in office were J. K. Hannah, 1897-1913 N. R. Feather ston, 1913-1926 and J. A. Burke, 1926 to date, The first public school house built with county funds was erected at Hurtsville. Other school structures were added as fast as funds from school taxes made these accomoda tions possible. Mr. N. R. Featherston, in his his tory of Appomattox County, re ports that the school term in the early days of the system was five months. Teachers average monthly salary was 25.00. In 1908, Professor Lindsay Craw ley was apointed principal of the high school at Appomattox. The frame building housing the high school stood on the lot where the present T. W. Moses residence is located. There were three teachers and 160. students. Funds allocated by the legislature in this year, with matching donations by private citi zens, financed the building of a new high school at the present site. Appomattox High School open ed in September, 1909, with the im posing name of Tenth Congression al District High School. Our public school system has made great advances in the years since 1909. In the past ten years alone, we have seen the construc tion of a new and up-to-date agri cultural vocational building at the high school addition of a hew gym nasium construction of the Carver- Price High School and elementary school for Negroes, and the build ing of the new elementary school in the town of Appomattox. For the current session, total enrollment in county public schools is 2,300 pupils, with 93 teachers."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "Superintendent of Schools was <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, 1870- 1881. He was"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "Superintendent of Schools was <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, 1870- 1881. He was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1549.46, 923.42, 1713.46, 1622.99], "bbox_id": "54291a392a", "file": "AppomattoxNewspapers_1902-1905a_0305.pdf", "page": 1, "text": "E legant W edding. At 530 oclock Tuesday afternoon, May 10th  Green Hill the old and aristocratic home, of exsuperintend ent C. H. Chilton, was the scene of a beautiful marriage ceremony when his daughter Miss MaryBessie, be- cime the bride of Mr. Leslie T. Morriss. As Mendelssohns wedding march was being played by Miss Ava Morfisssister of the groom, the attendants entered the spacious parlor from two doors,on the left came Mr. Caleb C. Harvey and Miss Neva Chilton Mr. Eddie Dickerson and Miss Bessie Shearer Mr. Herbert R. Cheatham and Miss Addie Spen cer, Mr. Lloyd Lewis and Miss Wil lie Hunter, Mr. Norman Cheatham and Miss Ella Cheatham. On the right came Mr. W. 0. Shelton ami Miss Nannie Morris, Mr. Orman Jones and Miss Lena Morriss, Mr E. R. Jones and Miss Lizzie Binfoid Mr. Philips and Miss Annie Jones, Mr. Watkins Nowlin and Miss Etta Bloxton. Each couple passing under a span f flowers and crossing to the oppo site side, forming a semi-circle around i most beautifully improvised altar, decorated with dogwood blos soms and evergreens. Following came two little flower girls, Ethel and Margie Binford, Deices of the bride. Dropping snow- white flowers here and there, making a scene of rare beauty. From the right door came the ride aud maid of honor, her sister. Miss Adrissa Chilton. From the left name the groom and best man, Mr. Elliot Cheatham, who led the way o the altar, where the ceremony was performed by Rev. M. F.Elliot, the Methodist Church. T he bride was radiantly beautiful n a white silk most stylishly aud be comingly madean illusion veil caught gracefully with Lillies of the Valley. Her boquet was of white carnations and maiden-hair ferns. She is one of Appomattoxs most prominent teachers, and is noted for her many Christian graces. The groom is a young man of fine iharacter and sterling business qual ifies. After the wedding a brilliant re ception was tendered at the home of the groom. His four sisters Mrs. R. C. Fleshman. of Bluefield. W. Va., gowned in chainptgne colored cloh with insets of lace Miss Ava Morriss, in black silk and lac"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "home, of exsuperintend ent <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, was the scene of"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "home, of exsuperintend ent <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, was the scene of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [753.81, 772.76, 911.36, 1582.64], "bbox_id": "6d7cb0980c", "file": "AppomattoxNewspapers_1898-1902a_0466.pdf", "page": 1, "text": "Circuit Court. Judge Hundley opened his court here on Alonday afternoon. Alany chancery papers were put into his hands, and several orders entered. The first cases reached ou the law docket were those against C. H. Chilton. Therewere six of them. They are damage suits .under the statut 8 for uttering and publishing defamatory and insulting words. Three of these suits were tried on yesterday, namely, those brought by D. Alott Robertiou, J. H. Robertson, aud J. K. Hannah. In the first of these there was a verdict for 1000, anl in each of the other two for 800. Upon the calling of the first case, that of D. Mott Robertsou, ou Mon day afternoon, Mr. W. G. Franklin entered au appearauce as Counsel for Mr. Chilton, and after entering a plea of not guilty, moved for a change of venue, aud.iu support of his motion offered the affidavit of his client setting forth that there could not he a jury empanelled in Appomattox county that would do him justice that officials of the county were among the plaintiffs, aud their influence would override the cause of justice and that he could not come for fear of bodily harm. The court promptly over ruled the motion for a change of venue but granted the motion for a special jury. Ou Tuesday morning the Robert sou case was taken up, with the fol lowiug special jury J. F. Dicker- son, G. E. Lewis, Milton Isbell, J. E. Chick, W. F. Wright, T. J. Good ing, C. E. Carson, J. N. Turner, T. E. Owen, R. T. Phelps, J. C. Shear er and C. R. Alann. Mr. Franklin made no further appearance in this caee, nor in the two others that were tried. There are three other cases on .he docket against Mr. Chilton of similar char acter, but it is thought that these will probably not be tried at the preseut term. ibe suit of Caskie  Coleman aud Sackett  Jackett agaiust Thomas Harvey to recover fees re sulted iu a verdict tor plaintiffs for 75. The suit of Deaveuports adminis trator agaiust the Norfolk  Wes tern Railroad is set for to-morrow and will probably be tried. The action is brought for damages for the killing of the plaintiffs sou at this depot last year through alleged negligence on part of the defendant."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "docket were those against <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Therewere six of them."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "docket were those against <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. Therewere six of them."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [407.49, 1288.14, 570.5, 1473.64], "bbox_id": "e7c622131d", "file": "AppomattoxNewspapers_1898-1902a_0252.pdf", "page": 1, "text": "Chilton and Driscoll. Mr. J . L. Driscoll and others are. carrying around papers getting the names of people who will vote for C. H. Chilton. It would seem that Mr. Chilton has very little confidence iu the words of those who have promised to support him, if he re quires their bond that they will do so. Chilton claims to be a Tyler Democrat, the fal.-ity of thife claim is shown by the active support he is getting lrom Jim Driscoll and other Republicans of Appomattox aud Campbell counties. X-"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "who will vote for <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. It would seem that"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "who will vote for <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>. It would seem that"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [248.39, 744.09, 409.47, 791.34], "bbox_id": "b58f1ac6cc", "file": "AppomattoxNewspapers_1898-1902a_0260.pdf", "page": 1, "text": "Appomattox and Campbell wil vote for J. R. Horsley for floatei delegate. He is opposed by C. H. Chilton, Independent."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "Appomattox and Campbell wil vote for J. R. Horsley for floatei delegate. He is opposed by <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, Independent."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "Appomattox and Campbell wil vote for J. R. Horsley for floatei delegate. He is opposed by <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, Independent."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [411.85, 246.42, 581.6, 1016.06], "bbox_id": "ea6e3ca65e", "file": "AppomattoxNewspapers_1898-1902a_0248.pdf", "page": 1, "text": "AN ADDRESS. To the People of Campbell County  We, the undersigned constitute, the Democratic Executive Commit ee of Appomattox county Me vere elected after due notice that there, would be a re-organization of the Democratic party at a mass- meeting held at Appomattox Court House, on August 10th, 1899. Ili is was the largest mass meeting hat any of us ever saw assembeld in lie county of Appomattox. It had in it more than half of the white vote of the County. We were elected without a dissenting voice  folding our commissions, therefore, from a meeting which, in size, in intelligence, in integrity and in every good quality that goes to make ip a man, was representative of as splendid a people as inhabit any eourfty in the State of Virginia, we can, with some confidence under take to speak for that people. A few weeks ago a circular was issued by Mr. C. If. Chilton which was signed by sixty-four citizens and voters of Appomattox County, in which grave accusations were made which do injustice to our county, its people, ourselyes, Mr. J. It. Ilorsley, the nominee of the Democratic party for the House of Delegates from Appomattox and Campbell, and others. To this .cir cular, we desire to make the follow ing brief reply  The circular purports to be signed by Independent Tyler Democrats. We dont know any such Democrats Me recognize voters as Democrat who will abide by tne action taker by a majority of their party. The cardinal principle of Democrat is the submission, of the minority li the judgment of the majority. Mr J. It. Horsley secured the delegates from Appomattox county to the convention of Appomattox ant Campbell, which assembled ai Campbell Court House on Sept. 11 from the same meeting whicl elected us to our present positions. The delegation of Campbell county was elected favorable to him withou a dissenting voice at any precinct it the county, so Mr. Horsley i clearly the choice of the Democrats of this legislative district and nt man who puts himself up against Mr. Ilorsley, can claim to be any kind of a Democrat. Again, in this list of sixty-fou voters, there are some persons who for years have been open and avowed Republicans. The Democrats on it, or most of them, signed the pa per presetted to them by Ghiltoi without knowing of the slanderous charges it contained against Their party. The paper was prepared by C. H. Chilton who rode the county getting signatures to it and who represented that it was simply an introduction of him to the people"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "paper was prepared by <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> who rode the county"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "paper was prepared by <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> who rode the county"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1415.99, 1129.32, 1575.94, 1440.47], "bbox_id": "541c850510", "file": "AppomattoxNewspapers_1892-1898a_0088.pdf", "page": 1, "text": "- A Contrast. We are indebted to the courtesy of Mr. C. H. Chilton for a copy of the Lynchburg Virginian of September 17th, 1864. Its price lists and advertising col-, umns furnish a forcible illustration of a currency based on government credit. We give a few examples   SpecieThe market is firm at 23t24 for gold. The rates for silver are nearly the same. Bank notes, 3.50. Flour is quoted at 300 for superfine, 325 for extra and 350 for family. Corn meal 60 per bushel. Bacon dull at 8 per pound. Corn field peas at 30 per bushel and Irish potatoes at 40. Sorgum molasses 25 to 30 per gal lon. Bates at Orange House 5 per meal and same for lodging, The populist platform declared tor a currency based on the credit of the government. What think you of the above experiment in that line."}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "the courtesy of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> for a copy of"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "the courtesy of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> for a copy of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1739.06, 954.87, 1909.69, 1254.77], "bbox_id": "97dfddb2af", "file": "AppomattoxNewspapers_1947-1949a_0200.pdf", "page": 1, "text": "Funeral services for Mrs. Bessie Chilton Morriss, widow of Leslie T. Morriss, who died February 18 near Prospect, were held at the Salem Methodist ,Church, Sout Spring, Friday afternoon, February 20, at 3 P. M. V, Services were con ucted by the Rev. J. W. Inge, and Rev. James Burleigh. Mrs. Morriss was the daughter of the late Chapman H. Chilton and Elizabeth Elliott Chil ton of this county, and was a school teacher for several years before her marriage. She is survived by the following children Mrs. E. L. Eisenman, of Perry, Fla. Mrs. P. B. Meyer, of Richmond Henry H. Morriss, of Fayetteville, N. C.jMiss Louise Morriss and Howlett Mor riss, of Prospect one sister, Mrs. Nena Robertson, of Sugar Grove, Va., one brother, W. C. Chilton, of Appomattox and one gran idaugh- Iter. Active pallbearer included J. G. Redford, Howlett Martin, R. H. Chilton, Jr., C. M. Dickerson, Frederick Dickerson and E. D. Jones."}, "highlight": {"text": {"matched_tokens": ["H", "Chilton", "C"], "snippet": "Redford, Howlett Martin, R. <mark>H</mark>. <mark>Chilton</mark>, Jr., <mark>C</mark>. M. Dickerson, Frederick Dickerson"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton", "C"], "snippet": "Redford, Howlett Martin, R. <mark>H</mark>. <mark>Chilton</mark>, Jr., <mark>C</mark>. M. Dickerson, Frederick Dickerson"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.67, 281.06, 1468.62, 470.36], "bbox_id": "d7aa3b9969", "file": "AppomattoxNewspapers_1939-1943a_0268.pdf", "page": 1, "text": "Albert Newcomb, Frank Marshall, Collier Pugh, Harvey Pugh, J. B. Ford and Oras Clark. Honorary pallbearers were L. S. Shorter, Joe LeGrand, Clarence Puigh, W . T . Jordan, C. T. Caw- thorne, James Caldwell, J. A. Mar, tin, T . H. Ford, W. T . Nash, H. B. Trent, Hunter Harvey, Elliot Cheatham, J .H . Chilton, W . C. Chilton, Z.M . Jones, W .L. Ford, W . B. Hunter and A.R.Harwood! R. L. Burke, H. M. Burge, Dr.D A. Christian, H. W. McKinney, D. A. Conner, C . .. Moses, J . H OBrien, L. E . Smith, W. M. Ab- bitt, O .F . Cheatham, J . P. Mar shall, A . C. Nash, E . R . Ferguson, L. B. Hudson and M .T . Trent."}, "highlight": {"text": {"matched_tokens": ["H", "Chilton", "C", "Chilton"], "snippet": "Harvey, Elliot Cheatham, J .<mark>H</mark> . <mark>Chilton</mark>, W . <mark>C</mark>. <mark>Chilton</mark>, Z.M . Jones, W"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton", "C", "Chilton"], "snippet": "Harvey, Elliot Cheatham, J .<mark>H</mark> . <mark>Chilton</mark>, W . <mark>C</mark>. <mark>Chilton</mark>, Z.M . Jones, W"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2303.49, 738.14, 2473.43, 1163.14], "bbox_id": "6ba690dc7b", "file": "AppomattoxNewspapers_1943-1947a_0336.pdf", "page": 1, "text": "The following persons have been released from the s.rvice The Local Board located in the Dorm itory Building will be glad to in- b rview any veteran wanting in formation regarding his rights or jenefiAs or in securing employ ment. Samuel Richard Woodson Hunt P. Hamilton Roland Sunpscn John Pbndurant Wh-eler John Robertson, Jr. Gilbert R. Wilson Kennon W. Kinney Henry L. Sears Meredith R. Powell Regain Gyder Willis H. Ligon ID Raymond T. Crawley Courney J. Brown Maston A. Nester Pv nneth D. Almond Charles H. Turner t Arnold K. Myers William D. Morris Shirley R. Reynolds Daniel T. GuSU  1 Beatty T. Brown Oharlie S. Austin Nannie S. Chilton .. Douglas H. Totty Kenneth C. Grishaw William D. Phelps Russell A. Chernault John W. Megginson Holmsey H. Ferguson Daniel H. Almond Robert Beasley Joseph B. Watson Carl A Collins, Jr. Boxley C. Wilkes George S. Williams Robert M. Babcock Luther Carlton Godsey"}, "highlight": {"text": {"matched_tokens": ["Chilton", "H", "C"], "snippet": "S. Austin Nannie S. <mark>Chilton</mark> .. Douglas <mark>H</mark>. Totty Kenneth <mark>C</mark>. Grishaw William D. Phelps"}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "H", "C"], "snippet": "S. Austin Nannie S. <mark>Chilton</mark> .. Douglas <mark>H</mark>. Totty Kenneth <mark>C</mark>. Grishaw William D. Phelps"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1813.47, 1574.57, 2112.62, 1655.71], "bbox_id": "df9232264f", "file": "AppomattoxNewspapers_1892-1898a_0188.pdf", "page": 1, "text": "T e a c h e rs 1 11 s t i tiite . Oct, 5th, 1894 the colored teachers j And your dinner and lunch Inistite met in Nebraska School No.2,1 much conducted by county Supt. C. H. Oh, about 7ocents., Chilton. Teachers present 14, After Any other expenses? the opening exercises were conducted  i-wdi, I went to the theater the Sunt, proceeded to call for the"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "conducted by county Supt. <mark>C</mark>. <mark>H</mark>. Oh, about 7ocents., <mark>Chilton</mark>. Teachers present 14, After"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "conducted by county Supt. <mark>C</mark>. <mark>H</mark>. Oh, about 7ocents., <mark>Chilton</mark>. Teachers present 14, After"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2342.44, 1206.24, 2511.29, 1329.09], "bbox_id": "fa6a0818b6", "file": "AppomattoxNewspapers_1912-1915a_0436.pdf", "page": 1, "text": "Gus Turnes. Coxs P ro lific-1st 82.60 W J Covington 2nd T H Babcock., 3rd W C Chilton. Colliers Excelsipr 10 ears 60 T O Davidson. Bweepstakfs 1st 10 T O Davidson! 2nd T H T reat. Best Single E ar  1st Gus Turnes, 2nd J H Turnes."}, "highlight": {"text": {"matched_tokens": ["H", "C", "Chilton"], "snippet": "J Covington 2nd T <mark>H</mark> Babcock., 3rd W <mark>C</mark> <mark>Chilton</mark>. Colliers Excelsipr 10 ears"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "Chilton"], "snippet": "J Covington 2nd T <mark>H</mark> Babcock., 3rd W <mark>C</mark> <mark>Chilton</mark>. Colliers Excelsipr 10 ears"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1944.19, 859.79, 2110.59, 899.04], "bbox_id": "d74cafe4f1", "file": "AppomattoxNewspapers_1952-1954a_0007.pdf", "page": 1, "text": "McDaniel Mr. and Mrs. H and Miss Clarkie C Miss Harriett Chilton in Washington last week."}, "highlight": {"text": {"matched_tokens": ["H", "C", "Chilton"], "snippet": "McDaniel Mr. and Mrs. <mark>H</mark> and Miss Clarkie <mark>C</mark> Miss Harriett <mark>Chilton</mark> in Washington last week."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "Chilton"], "snippet": "McDaniel Mr. and Mrs. <mark>H</mark> and Miss Clarkie <mark>C</mark> Miss Harriett <mark>Chilton</mark> in Washington last week."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1391.06, 1124.64, 1507.43, 1233.24], "bbox_id": "95e7bbd10f", "file": "AppomattoxNewspapers_1955-1957a_0567.pdf", "page": 1, "text": "li Mrs. W. C. Chilton re- Nended the Jamestown Fes- H were among the more t who have registered as pended the Jamestown Ex- In 1907 as well as the cur- pval. Mr. Chilton visited us p, and added interesting J our recent column on the boundaries when Appomat- ty was established."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton", "H"], "snippet": "li Mrs. W. <mark>C</mark>. <mark>Chilton</mark> re- Nended the Jamestown Fes- <mark>H</mark> were among the more"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton", "H"], "snippet": "li Mrs. W. <mark>C</mark>. <mark>Chilton</mark> re- Nended the Jamestown Fes- <mark>H</mark> were among the more"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1535.74, 805.27, 1642.39, 895.67], "bbox_id": "57aa97d396", "file": "AppomattoxNewspapers_1960-1962b_0474.pdf", "page": 1, "text": "ton is survived by her fflliani Chapman. Chilton laughters Mi, B. W. pille, N. C. Mrs. H. A. Atlanta, Ga. Miss Har- ji, Falls Church, Va. Chilton, Miss, Eleanor I Mrs. Lois C, Fantrni, rhburg, Va."}, "highlight": {"text": {"matched_tokens": ["Chilton", "C", "H"], "snippet": "by her fflliani Chapman. <mark>Chilton</mark> laughters Mi, B. W. pille, N. <mark>C</mark>. Mrs. <mark>H</mark>. A. Atlanta, Ga. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "C", "H"], "snippet": "by her fflliani Chapman. <mark>Chilton</mark> laughters Mi, B. W. pille, N. <mark>C</mark>. Mrs. <mark>H</mark>. A. Atlanta, Ga. Miss"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [827.49, 176.04, 992.13, 1083.68], "bbox_id": "7676fbd715", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "Special driving classL. E. Sm ith 1 C. Y. R and 2 F. L. Browning. Class 5 Three year old percheron, 1, J. W. C arter 2, L. E. Sm ith 3, W. T. Nash. One year old, 1, S. G. Smith.  CGASS 6 Mule colt, w eanling 1st C. W. C arter CGASS 7 D raft team s 1st, C. W. C arter. CGASS 9 Ponies 1st, Bolling, Flood 2nd. Gen Smith. CGASS 10 H ackney, 2-year-old  1st. H. D. Flood 2nd, C. Y. R and 3rd, S. G. Smith. CLASS 11 Percheron stallion  1st, W. E. Smith. C attle Jersey bull 1st, L. E. Sm ith 2nd, C. N. Abbitt. Registered heifer 1st, L. E. Smith 2nd, Cabell C arter 3rd, R. C. W agner. G rade Jersey cow 1st, L. E. Smith 2nd, IR. C. W agner. R egistered cow 1st, L. E. Smith 2nd, R. C. W agner. H olstein bull, 2-year-old  1st, Holmsey Smith. H erford, registered  1st, H. D. Flood. Two-year-old bull  1st, H. D. Flood 2nd, D. Flood. Guernsey bull, 1-year-old  C. G. Rand. G rade Guernsey heifer 1st, H. D. Flood 2nd, R. G. R ogers 3rd, H. D, Flood. R egistered G uernsey cow 1st, H. D. Flood 2nd, H. D. Flood. R egistered Guernsey bull  1st, Holmsey Smith 2nd, H. D. Flood. Shorthorn bull 1st, M. C. Sm ith 2nd, J. H. Turner. G rade shorthorn heifer 1st, M. C. Sm ith 2nd, M. C. Smith. Hogs D uroc boar-1st, R andolph OBrien 2nd, M. C. Sm ith 3rd, H. Smith. Poland china sow  1st, F rank H anenkrat. Poland china boar  1st, F rank H anenkrat. B erkshire boar 1st, H. A. Turns 2nd, C. N. Abbitt.  1 Sow and six pigs  1st. Holmsey Smith. i Duroc sow-1st, Albert Lee 2nd, 1 M. C. Smith. F at hog 1st, A lbert Gee. Pure bred gilts 1st, G. A. SKirey 2nd, H. H. Shirey 3rd, Albert Lee. Sweepstake boar  1st, R andolph OBrien 2nd, M. C. Sm ith. Sweepstake sow 1st, F rank H anen k rat 2nd, A lbert Lee. Sweepstake gilts 1st, G. A. Shirey 2nd, H. H. Shirey. Poultry Cookeral W yndotte  1st, W. C. Chilton. Belgian hares 1st, R. C. W agner 2nd, Chas. Crawley. i R. I. cockered 1st, J. H. P ulliam  2nd, Mrs. W. M. Hancock. R. I. pullet 1st, J. D. Johnson 2nd, Mrs. W. L. Brown. R. I. pen 1st, J. D. Johnson 2nd, Mrs. W. L. Brown. H en 1st, Mrs. W. G. Brown 2nd, Mrs. J. A. Stratton. Cock 1st, Mrs. W. L. Brown 2nd, Mrs. J. A. Stratton. R. C. R. I. pen 1st, Mrs. T. H. Inge. R. C. R. I. hen 1st, Mrs. T. H. Inge. B. R. pen 2nd, Airs. S. G. Smith. B. R. cock 1st, Mrs. S. G. Smith 2nd, C. G. Rand. B. R. pullet 1st, E. G. Sm ith 2nd, E. L. Smith. P air B. Rock  1st, Mrs. J. H. Turnes 2nd,Mrs. J. H. Turnes. Best pair buff Orpingtons 1st, Mrs. W. P. Gills. Best pen buff Orpingtons 1st, Mrs. W. P. Gills 2nd, Mrs. W. P. Gills. W hite orphington cock 2nd, Eddie Babcock. W hite orpington hen 2nd, Eddie Babcock. W hite leghorn pen 1st, D. B. D e laney 2nd, D. B. Delaney. W hite leghorn cock 1st, D. B. D e laney. P air guinaes 1st, V irginia Smith. P air ducks 1st, D. B. Dulaney. B antam s 1st, Miss N. W. Jennings 2nd, D. B. Dulaney. Brown leghorn 1st, J. P. M arshall. Turkeys 1st, Cabell C arter. Piegeons 1st, Chas. F. Jam es. Schools E xhibits High School 1, Appomattox high school. Ju n io r high school, 1, V era,h ig h school 2, Stonewall. One room, 1, W oodland school 2, Falling Rive r . _____ , __"}, "highlight": {"text": {"matched_tokens": ["H", "C", "Chilton"], "snippet": "A. Shirey 2nd, H. <mark>H</mark>. Shirey. Poultry Cookeral W yndotte  1st, W. <mark>C</mark>. <mark>Chilton</mark>. Belgian hares 1st, R."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "Chilton"], "snippet": "A. Shirey 2nd, H. <mark>H</mark>. Shirey. Poultry Cookeral W yndotte  1st, W. <mark>C</mark>. <mark>Chilton</mark>. Belgian hares 1st, R."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [530.14, 688.44, 695.69, 1654.27], "bbox_id": "8fa9f68410", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "The Concord Meeting. The Richmond Dispatch publish es the following extract from a let ter from its Apponiatiox correspond ent, of dale September 7th 1 saw iu your correspondence from Pamplius yesterday a statement that C. H. Chiiti n, of this county, is the Tyler Democratic candidate tor the legislature to represent this county and Campbell i had for merly seen a stateuieut in your paper in a letter from Concord to the ef fect that Mr. Chilton was uomiua- t d at a muss-meetiug held at Con- coid, at which 362 voters were pres ent in person or by proxy. 1 have intended for some time to correct the statement contained iu the Concord letter, but not having been present at that meeting, 1 had to wait until J could get my facts accurately, which I give you as fol lows  The meeting was called by people who have for years antagonized the Democratic party. All persons, ir respective of political parties, who favored Governor Tylers election to the United Stater Senate were invi ted to participate in it. It was not a meeting iu the form of a conven tion or one iu u inch the people ton Id be represented by delegates, bufc-was called as a muss meeting. There .ere presett by actual count twenty-nine voters,, twenty-three of whom were from Appomattox and six from Campbell. Turn not post ed as toChe politics of all the Camp bell participants, but I am very fa miliar with the politics of those who attended the meeting from Appo mattox. Only one of themviz., Mr. L. A- Williams, a brother-in-law of Mr. C. H. Chiltonshas been considered a Democrat for the past four years. Some of the most prom inent figures in it were W. C. Frank lin, county chairman of the Repub lican party of Appomattox, who has time and again been the Republican candidate for various offices H. E. Gilliam, a leading Republican F. B. .ones, T. H. A. Cheatham, C. B. Blox ton, and Hut Ferguson colored other prominent Republicans. In justice to Hut, it should be stated that when the resolution was passed by themeeting declaring that no money should be used in the interest of tne nominee, he left in disgust. The meeting in no sense repre sents any DemocVatic sentiment iu Appomattox county. There hasj bean no split in the Democratic par ty here, and 1 do not believe there has been or will be any in Campbell, but I know the Democrats of our county are solid for the regular nom ine, Mr. J. R. Horsley. We think it an injustice not only to our nominee but to our people to characterize a meeting gotten up and dominated by leading Republi- eani as a Democratic meeting, when the other man they nominated if, by any mishap, he should be elected, would not be admitted into a Dem ocratic CUUCU8, Mr. Chilton himself has not voted the Democratic ticket for at least four years, and probably longer. M r. J. R. Horsley was nominated by a Democratic mass-meeting which was the largest meetiug of the kind held in this county in the recollect ion of its oldest inhabitants. It. was fully representative of the wishes of the party. It was held after due uotice and after an active cau vass of the county by Mr, Horsleys fiiends and the friends of I is opponent,"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton"], "snippet": "a brother-in-law of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>shas been considered a Democrat"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton"], "snippet": "a brother-in-law of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>shas been considered a Democrat"}], "text_match": 1736172785157275769, "text_match_info": {"best_field_score": "3315687620608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172785157275769", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [1391.7, 1762.98, 1690.22, 1832.84], "bbox_id": "b1e55bf9e1", "file": "AppomattoxNewspapers_1898-1902a_0201.pdf", "page": 1, "text": "With Supplementary Chapter from Hon. Andrew Carnegie, Senator Hoar, Vest, Allen, White, Qor man, iiacon, hluson, Daniel, Chilton- Butler, MoLuurin, Till man, Money, lirtier. Teller, Edmunds, Clay Hon. H. C. Johnson, Hon. Chas. A. Towne, Hon. Adlat E. Stevenson, --Secretary Oat lisle, Rev. Dr. Van Dyke, Hon. Chas. Francis Adams, Prof. David Starr Jordan, Genl Weaver, Hon. Carl Schurz, Saml Gompers, Prest. Am. Fed. of JLabor, and others THE s e n s a t io n OF CEJITCRY IMPERIALISM ANH ABSOLUTISM DENOUMCIP."}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "Teller, Edmunds, Clay Hon. <mark>H</mark>. <mark>C</mark>. Johnson, Hon. Chas. A."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "Teller, Edmunds, Clay Hon. <mark>H</mark>. <mark>C</mark>. Johnson, Hon. Chas. A."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [692.91, 1029.25, 1200.42, 1327.32], "bbox_id": "84aa901180", "file": "AppomattoxNewspapers_1922-1923a_0028.pdf", "page": 1, "text": "Wholesale  Retail r 7r7beTierkToffloeTfthe Circuit Court or tbe Countyof Appomattox, on the 22na day of Aprit 1922  1 Charles W. Glover, ....... - .................. Plaintiff, against .   _ , George J Glover, Amanda D. Harris and William Harris, her husband, Fannie Har den and william Harden, her husband, Ger- trudeM Willis and Herbert Willis, her bus-1 band, Harry R Glover, Youiha Jones and Ciarenee Jones, her husband, Florence Chilton and others .............. Defendant The object of this suit is to have partition 1 of a tract of land lying In Sbuthslde District Appomattox county, Va.,about 4 miles south of Appomattox C. H.. which Charles Glover died seized and possessed, by one of th e , modes provided by law, containing 101 aores more or less. . . , And an affidavit having been made and filed that the defendants, George J Glover, Amanda D Harris and WllliamHarris.her bus-. band,Fannie Harden and William Harden,her husband.Gertrude Wlilia and HerbertWiUis,1 her husband, Harry R Giover, and Youtha Jones and Clarence Jones, her husband and F l o r e n c e C h i l t o n a r e not residents of the State of Virginia it is ordered that they do appoar here within ten days after the due publica tion hereof, and do what may be necessary to protect their interest in this suit. And W Is further ordered that a copy hereof be published once a week for four successive weeks in the Times Virginian, a newspaper published In the county of Appomattox, and that a copy be posted at the front door of the Court house of this county on or before the 1st day of May 1922, th a t, being the next succeeding rule day after this order was entered. A CopyTeste C.W. SMITH, Clerk. A. H. Clement p q  1"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "miles south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "miles south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [854.41, 1598.59, 1014.11, 1887.6], "bbox_id": "f7607cdde1", "file": "AppomattoxNewspapers_1898-1902a_0291.pdf", "page": 1, "text": "When we asunder part, it elves us inward pain But we shall still be joined in heart. And hope to meet again. Rev. C. H. Galloway preached at Salem Snnday evening. The Ep- worth League appointed delegates Sunday night for the convention in Richmond. Miss Maggie Chilton and Mr. R. W. Nowlin were elected. Mrs. Robert Whitaker continues to be very ill. Rev. P. M. Bell visited friends in this vicinity last week. Mrs. Emily Price, of Buckingham, is visiting her brother Mr. C. N. Garrett. Misses Nannie and Mattie Simms, and Messrs. Loyd Lewis and Gns Wooldridge, ot Chap, were the guests of Miss Lillie Simms Satur day and Snnday last. Doc Hancock, colored, died Satnr- day afternoon. The farmers stuck a goodly num ber of tobacco plants last week. As I fear I have already Written too much Ill close until another time."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "to meet again. Rev. <mark>C</mark>. <mark>H</mark>. Galloway preached at Salem"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "to meet again. Rev. <mark>C</mark>. <mark>H</mark>. Galloway preached at Salem"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1281.59, 715.91, 1607.53, 1029.57], "bbox_id": "b51c77a165", "file": "AppomattoxNewspapers_1955-1957a_0085.pdf", "page": 1, "text": "w   -   A cel of real estate lying and in Southside District of Appi tox County, about four  4  South of Appomattox Court hear Promise Land Church aîÿ ing on the old Chap and Red Road and being on the west si, said road, and known as the George Chilton Tract of land adjoining now or formerly the of Jim Driskall, Edgar Cl Nannie Harvey, Mrs. Adelia C. guson, J. T. Myers and the lei W. H. Stern and A. W. Arri Originally containing 150 more or less, but now conta B5, acres more or less- Ï Paulette acquired said land bj deeds, one from J. R. Poe and of record in the Clerks Offic Appomattox County in Deed 48, at Page 487, and the o th e r W. L. Moore to himself and Poe jointly, which is of recoi said Clerks Office of Appo County in Deed Book 42, at 452. J. H. OBRIEN, Auctioneer. c h a s . f . p. craw   Special Commissi l-12-3tc"}, "highlight": {"text": {"matched_tokens": ["c", "h"], "snippet": "J. H. OBRIEN, Auctioneer. <mark>c</mark> <mark>h</mark> a s . f . p."}}, "highlights": [{"field": "text", "matched_tokens": ["c", "h"], "snippet": "J. H. OBRIEN, Auctioneer. <mark>c</mark> <mark>h</mark> a s . f . p."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [850.53, 957.76, 1011.61, 1497.47], "bbox_id": "d4ae1a8073", "file": "AppomattoxNewspapers_1922-1923a_0087.pdf", "page": 1, "text": "Trustees Sale or Valuable Farm By authority vested is the un designed Trust-e by a deed of trust bearing date October 29, 1920, aDd recorded in Appomattot Clerks Office in Deed Book 21, page 12, default hiving been made m the payment of tbe debt therein secn-ed and at the request of the tenefieiarj I will lifer for sale, at Public Auction, on the premises, on Wed nesday, September 6, 1922, at 4 oclock p m , that certain tract of land in Sto lewall District, Appo mattox Count-, Va., about one mile northeast of Concord Depot, con taining 85 acres, more or le, ad joining tbe lands of J D Ean--, R. A. Staples Estate, Robei Moorm-m an l O h-re. On  hie tr ct of land is situated a comfort- tble retidence and necessary out buildings. Term Cash B. E HUGHES, Trustee. 8 16 3v I N tbe Clerks Office ol tbe Circuit Court of tbe County of Appomattox, ou tbe 21st day of August 1922 Nannie Harvey and C H Harvey _ .Plaintiffs against George J Glover, Amanda D. Harris and William Harris, her husband, Fannie Har den and William Harden, ber husband, Ger trude M Willis and Herbert Willis, her hus band, Harry R Glover, Touiha Jones and Clarence Jones, her husband, Florence Chilton Charles W. Glover,. ......... Defendants The object of this suit is to have partition of a tract of land lying In Southside District Appomattox county, Va.,about 1 miles south of Appomattox C. H which Charles Glover died seized and possessed, by one of the modes provided by law, containing 100 acres more or less. And an affidavit having been made and filed that tbe defendants, George J Glover, Amanda D Harris and WilllamHarriher hus band,Fannie Harden and William H8rden,ber husband,Gertrude w tills and Herbert W ilis, ber husband, Harry K Giover, and Youtha Jones and clarence Jones, her husband Ubas W Glover and F l o r e n c e C h i l t o n are not residents of the State of Virginia it Is ordered that they do apposr here within ten days after tbe uue publica tion hereof, and do what may be necessary to proteit their interest in this suit. And It Is further ordered that a copy hereof be published once a week for four successive weeks in the Times Virginian, a newspaper published in the county of Appomattox, and that a copy be posted at the front door of ihe Court nouse of this county on or before the 21st day of Aug. 1922, that being the next succeeding rule day after this order was entered. A CopyTeste C. W. SMITH, Clerk. A. H. Clement p i"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "1922 Nannie Harvey and <mark>C</mark> <mark>H</mark> Harvey _ .Plaintiffs against George"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "1922 Nannie Harvey and <mark>C</mark> <mark>H</mark> Harvey _ .Plaintiffs against George"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [872.89, 1007.77, 1029.37, 1275.68], "bbox_id": "1e08d7abfc", "file": "AppomattoxNewspapers_1922-1923a_0095.pdf", "page": 1, "text": "TN the Clerks Office of the Circuit Court of the County of Appomattox, on the 21et day of August 1922 Nannie Harvey and C M Harvey.Plaintitrs against George J Glover, am .n ila D. H arris and William Harris, her husband, Fannie Har den and William Harden, her husband, Ger trude M Willis and Herbert Willis, her hus band, Harry K Glover, You.ha Jones aud Clarence Jones, her husband, Florence Chilton Charles W. Glover, ........... Defendants The object of this suit is to have partition of a tract of land lying In Southside Distriot Appomattox county, V a.,about 4 miles south of Appomattox C. H., which Charles Glover died seized and possessed, by one of fchd modes provided by law, containing I 0 U acres more or less. , . . And an affidavit haviug been made and filed that tbe deiemlants, George J Glover, Amanda D H arris and WiIliamHarrihir hus band,Fannie Harden arid William Harden,her husbatid.Gertrude Wi.lis and Herbert W ilts, her husband, Harry KG.over, autl Voutba Jones and  lareuee Jones, her husband Chas W Glover aud F l o r e n c e C h i 1 t o n are not residents of the state of Virginia it is ordered th at they do appear hero .vithin ten days alter the uue publics tion hereof, and do wliat may bo ueecssar.i to protei t their interest in this suit. And it is turtner ordered that, a copy hereof be published once a week for four successive weeks in the Times Virginian, a newspaper published in the county of Appomattox, and that a copy be posted a t the front duor of the Court house of this countv on or before the 21st day of Aug. 1922, that being the next succeeding rule day after this order was entered, A CopyTeste C. W. SMITH, Clerk. A. H. Clement - p q"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "miles south of Appomattox <mark>C</mark>. <mark>H</mark>., which Charles Glover died"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "miles south of Appomattox <mark>C</mark>. <mark>H</mark>., which Charles Glover died"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [402.01, 1171.11, 567.58, 1736.78], "bbox_id": "caee5a9624", "file": "AppomattoxNewspapers_1926-1933a_0250.pdf", "page": 1, "text": "The weather is a little cooler and we are enjoying it. Some of the tobacco is be ing housed, but dont suppose there will be much crop this time. Mr. and Mrs. Frank Wool dridge left Monday, A. SI. for their home in N. C., spending several days with home folk and visiting friends. We are sorry Mrs. Walter Jordan is sick, hope she will soon be out again. Mr. and Mrs. W. C. Lee spent Sunday recently in the home of Mr. Perlie Jones. Mrs. Leslie Morris, of Farm ville, and sister, Miss Maggie Chilton, of Spout Spring, visi ted in the homes of R. W. Mar tin, iT. H. Ford and J. A. Mar tin last week. They, accompa nied by Mrs. T. H. Ford, spent last Thursday in the home of J. W. Davis, at Spring Mill. They had a glad welcome every where and we wish these good people were back in this neighborhood again. Mrs. Fannie Harvey, of Campbell, Mrs. Norman Pugh, Mrs. Sylvester Pugh and their children, of near Charlotte C. H., spent last Sunday in the home of T. H. Ford. Master Thomas Odor is spending a few days with his mother at the home of his grand father, R. W.1 Martin awaiting the arrival of his un cle and aunt, Mr. and Mrs. W.! L. Shield, and sons, of Colum bus, Ohio, who are expected today, Tuesday. j We are glad Mr. II. B. Mar shall is getting alpng nicely after his operation in Lynch burg hospital recently. Mr. Collier Marshall is spending some time with his sister, Mrs. T. H. Ford. Mr. and Mrs. A. D. Marshall were recent visitors to her"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "children, of near Charlotte <mark>C</mark>. <mark>H</mark>., spent last Sunday in"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "children, of near Charlotte <mark>C</mark>. <mark>H</mark>., spent last Sunday in"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1902.59, 239.43, 2044.19, 745.98], "bbox_id": "dea79a9db9", "file": "AppomattoxNewspapers_1962-1965a_0117.pdf", "page": 1, "text": "the past week were Mr. and Mrs. Alias . Thompson, of Ararat, Mr. and Mrs. Rawtoii Layne and little son, from hear Charlotte C.H., and Mr. and Mrs. Kenneth Elder and daughter, Carolyn Gale, of Appomattox. Visitors in the home of Mr. and Mrs. Robert Fore Friday were Mr. Warren R. Ramsey, of Richmond and Mr. C. E. Ram sey. Mrs. H. T. Terry returned home Wednesday p.m. after a six weeks visit In Arlington with her daughter and family. Rev. and Mrs. Irving W. Lindenblad. The little new grandson, Nils Bowling and mother are getting on very nicely at the present time. Visi tors in the home of Mrs. H. T. Terry over-, the week end were Mr. and Mrs. Herman Wingfield, of Richmond, ahd Mrs. Pat Ro binson and son. Lucian, of Char lotte C. H. Jdhnie Canada, a student of Ferrum Junior College, Ferrum spent this past week end at home. Mrs. Maude Canada is visit ing her sister, Mrs. Chilton Bass, in Nathalie. Miss Betsy Williams, a student of R.P.I. Richmond returned to Richmond Sunday p.m. accom panied by her parents aftei spending the week end here. The four Methodist Churches in the Pamplin charge sponsored a supper Saturday night at the P a m p l i n Elementary School, which was a great success. The proceedswill go for the benefit of the parsonage fund. Mrs. Clayton Beale and Mrs. C- W. Slayton spent Friday a.m. in Farmville shopping. Mrs. Clyde Dickerson and Mrs. Willie Price visited Mrs. Clayton Beale Wednesday p.m. Mrs. O. W. Slayton left Mon day a.m. for Washington D.C. for a two weeks visit with her daughter and family, Mr. and"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "Lucian, of Char lotte <mark>C</mark>. <mark>H</mark>. Jdhnie Canada, a student"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "Lucian, of Char lotte <mark>C</mark>. <mark>H</mark>. Jdhnie Canada, a student"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.21, 365.87, 1731.49, 1329.71], "bbox_id": "555ce883e2", "file": "AppomattoxNewspapers_1926-1933a_0079.pdf", "page": 1, "text": "The home of Mr. and Mrs. I Thos. Henry Spencer, of Spout I Spring, was the scene 1 of real old Virginia hospitality I when relatives and friend? from  far and near come to celebrate  with them their golden wedding  anniversary. All but two  I their children were present and 1 quite a number of their graud- I children. The bride and groom I ofifty years ago are enjoying a ll remarkable degree of health and IB heartily welcome to their hospit-IB able board of about seventy-five 1 friends, some of whom were  present fifty years ago at the 11 real wedding. Among this num-ifl ber were Mrs. J. W. Durphy II land Mrs.. Blanch Sweeney, of I Lynchburg, and to speak of a l l half a century ago, Mrs. Durphy I was first waiter, and Mrs.Sween- I ey ast waiter, both position of I honor in the wedding party. I The home was tastefully decorat- 1 ed for the occasion in gold and I white. I A sumptuous dinner, really a I feast was prepared by their twin 1 daughters, Mrs Bates and How-11 erton,- and served under the L skillful hand of Chunk Woody, I of Lynchburg. The wedding, I cake whiph was a work of culi- I nary art was baked by Mrs. I Elizabeth Goodman Smith, of I Ohio, grand-daughter, of Mr. I land Mrs. Spencer. Among the guests present a I were Mr. and Mrs. A. H. How- I erton, Mr. and Mrs. H. S. Whit- laker, Mrs. R. E. Caldwell, Sr., Mrs. W. C. Chilton, Mrs. J. C, Cullop, Mr. and Mrs. B. M. Coleman, Mr. and Mrs. J. E. Dickerson, Mr. and Mrs. W. E- Dickerson, Mr. and Mrs. R. H. Chilton, of Concord, Mr. and Mrs W. T. Spencer, of Lynch burg, Sen. and Mrs. S. L. Fer- Ignson, Mr. and Mrs. I. B- Wheel er, Mr. and Mrs. J. O. Robert son, Mr. R. D. Whitaker, S. W. Alvis. S. P. Coleman, E. P. Car- son, A. W. Jones, M. W. Worley, H. B Marshall, R. W. Smith, I Jr., A. M. Goodman, R. H I Bates, Misses Esther Coleman, Mittie Goodman, Grace Cald well, Rissu Chilton, Ella Jones, Evelyn Cullop,. Catherine Cald well, Lena. Neil, Monk and Lu- cile Bates, Frances Smith. Lu- cile Marshall, Eula Mae Burke, Mrs, W. T. Steele, R. L. Burke, Mr and Mrs. G. E. Cheatham, of Crewe, Mrs. Durphy, Mrs. Sweeney, Mrs. G. M. Bass, M. and Mrs. J. H. Alvis, O. H. Spencer, Miss Bertha Spencer, Dick Darley. Chunk Woody Misses Alberta Terrell, Linda Witt, Mary Mundy, Clarkie and I Hesse Cheatham, Aubrey Cheat- I ham, all of Lynchburg, Mrs. O. I m . Howerton, of Richmond, Mr. and Mrs. W. D. Goodman, of Ohio, Mr. and Mrs. R. S. Spen cer, of Petersburg."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton", "C"], "snippet": "Caldwell, Sr., Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, Mrs. J. <mark>C</mark>, Cullop,"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton", "C"], "snippet": "Caldwell, Sr., Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, Mrs. J. <mark>C</mark>, Cullop,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [409.45, 575.75, 574.68, 1715.47], "bbox_id": "7fc9f2c521", "file": "AppomattoxNewspapers_1926-1933a_0272.pdf", "page": 1, "text": "The good rain came in such good time. Some of the farm ers have finished planting to bacco over the first time, but the weather keeps so cool real ly cold. Plenty frost first  second mornings in June, A rare thing. The wheat crop will soon be ready to harvest. It looks very good in the field. Prof. Wilkins and Mr. Hud gins are giving some splendid talks and information on agri culture at Pettys Fork School House e v e r y Wed. night Everybody should attend. Last Friday was a holiday but I guess the farmers had the hardest day as there was a to bacco season. Mr. G. P. Martin and his mother, Mrs. J. E. Martin, o Roanoke, motored to the home of J. A. Martin last Friday and stayed until I Saturday P. M Then they were accompanied to the home of A. S. Wool dridge by the latter who spent the afternoon. They returned to their home in Roanoke Sun day. Messes Marvin Moses and Ellis Martin, Mrs. ,Edd Moses and little son, Lyle, spent last Sunday in the home of George Thompson, in Campbell. Mr. and Mrs. B. C. Sims and two children, Mr. and Mis Harris Murphy, of Lynchburg spent Saturday night and Sun day in the home of R. W. Mar tin. Mr., and Mrs. W. C. Lee and little Catherine, Mr. and Mrs. W. L. Ford were visitors in this home on Sunday. Mr. B. C. Sims and son, Otis, visited in the home of J. A. Martin last Sunday. Master Thomas Odor left last Sunday morning for his annual visit to the home of his rand-father, T. W. Odor. ---------------------- o --------------- Honor Roll for May 4th. Year Ethel Alvis, John Hesson, Virginia Carson, Bertha Rog ers, Thelma Gunter, Mary Sears, Elizabeth Robertson, Lucile Bates, Alfred Harwood, Sarah Bates, Charles Crawley, Eunice McNally, Madaline Bingham, Nollie Lewis, Lottie Lucado, Annie Gilbert, Vir ginia Chich, Virginia Holt, Lu cy Smith, Henry Pack, Mary Featherston, Gladys I nge, Charles James, Frances Cole man. 3rd Year Mary L. Stratton, Winifred Harvey, George Langran, Sam uel Ford, Lucile Crawley, Jos- hephine LeGrande, Ruby Cole man, Addie Lena Ferguson. 2nd Year Garland Plunket, Ruth Morris, Mandane Anderson, Catherine Lucado, Carrington Beard, Chapman C h i l t o n , Hilda Moore, Weslene Young, Billy H u b b a r d , Lula Drinkard, Clarkie Evans, Christine Paul- et, Claudine OBrien. 1st Year Dojrothy Tweedy, L o u i s e Lewis, Catherine Irby, Eliza beth Crawley, Lynwood Paul ette, James Ford, Ruby- Cole, Herbert Abbitt, Verna Kern, Elliot Turnes, Leilas Davis. 7th Grade John Cole, James Dorton, Hayilah Guill, Jean Anderson, Edith Anderson, Edith Frank lin, Nixie Guill,, Christine Roberts, Manie Smith, Geneva Wingfield, Evelyn Martin, Eleanor Martin, Erna Dicker- son, Helen Marshall, Willie G. Anderson, Virginia Christian, 6th Grade Edith Cole, Hazel Chilton, Nellie Davidson, Ella Mae Dinkins, Marion Giles, Marga ret Gobble, Virginia Eppes Ir- Edith iUicado, Margaret"}, "highlight": {"text": {"matched_tokens": ["C", "h"], "snippet": "Lucado, Carrington Beard, Chapman <mark>C</mark> <mark>h</mark> i l t o"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h"], "snippet": "Lucado, Carrington Beard, Chapman <mark>C</mark> <mark>h</mark> i l t o"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.95, 347.65, 1883.19, 990.75], "bbox_id": "0c37e62dbf", "file": "AppomattoxNewspapers_1908-1909a_0273.pdf", "page": 1, "text": "The following jurors have been drawn for the June term. Criminal JUry2ndCourt ney C. HaiVey, Joel T. Morris, J. W. Coleman, Jr., W. Thos. Caldwell, Frank E. Jennings, Clayton T. Drinkard, John B. Chilton, H. M. Marshall, Thos. A. Guill, Rev. R. E. Redding, Harry W. Jenkins, A. T. Inge, Eldridge G. Cheatham, E- F. Pettinger, E. H. Carson, H. C. Wheeler, J. O, Davidson, Jas. W_ Childers, J. E. Burnette, R. E. Caldwell, Jr., W. J. Le- Grand, J. A. Garrett, Robt. M. Mitchell, S. W. Alvis. Petite Jury 3rd J, B. Wil son, S. T. Megginson, Jr., R. Curtis Haryey, Thos. H. Wright J. O. Robertson, L. J. Hatcher, R. S. Wheeler, Irby B. Wheeler. Grand Jurors 1stSam A. Ferguson, H. C. Babcock, R. F. Jamerson, J. Dillard Morris, T._ W. Odor, L. E. Smith, C. E. Car- son, T. A. King, C. E. Lewis, J. E. Martin, H. H. Stratton, R. W. Abbitt. o ------  Memorial Day Confederate Memorial Ex ercises at Appomatox Con federate Cemetery June 3rd, 330 p.m. Confederate Vete rans, Honary members, and speakers escorted to the dais by the daughters. U. D. C. ritual lead by jthe president of Appomattox chap ter, Mrs. N. A. Wagers. Decoratapn of soldiers, by the daughters. Decoration of graves by children of the confederacy. Salute the Flags, daughters, children, W. W. Veterans. SongBonny Blue Flag. AddressMrs. William Ca bell Flournoy, past president  historian Va. Div. Song, Dixie. Introduction o f oratorJ. A. Burke. Address P r o f . Fitzhugh Flournoy, Washington  Lee University, winner of U. D. C. scholarship Oxford, England 1928. Song, Old Folks at Home. America."}, "highlight": {"text": {"matched_tokens": ["Chilton", "H"], "snippet": "T. Drinkard, John B. <mark>Chilton</mark>, <mark>H</mark>. M. Marshall, Thos. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "H"], "snippet": "T. Drinkard, John B. <mark>Chilton</mark>, <mark>H</mark>. M. Marshall, Thos. A."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1725.64, 368.02, 1888.25, 674.26], "bbox_id": "c6364c2eb7", "file": "AppomattoxNewspapers_1926-1933a_0273.pdf", "page": 1, "text": "The following jurors have been drawn for the June term. Criminal Jtiry 2ndCourt ney C. Harvey, Joel T. Morris, J. W. Coleman, Jr., W. Thos. Caldwell, Frank E. Jennings, Clayton T. Drinkard, John B. Chilton, H. M. Marshall, Thos. A. Guill, Rev. R. E. Redding, Harry W. Jenkins, A. T. Inge, Eldridge G. Cheatham, E. F. Pettinger, E. H. Carson, H. C, Wheeler, J. O. Davidson, Jas, W. Childers, J. E. Burnette, R E. Caldwell, Jr., W. J. Le Grand, J. A. Garrett, Robt. M Mitchell, S. W. Alvis. Petite Jury 3rd J, B. Wil son, S. T. Megginson, Jr., R. Curtis Haryey, Thos. H. Wright J. O. Robertson, L. J. Hatcher, R. S. Wheeler, Irby B. Wheeler, Grand Jurors 1stSam A Ferguson, H. C. Babcock, R. F Jamerson, J. Dillard Morris, T W. Odor, L. E- Smith, C. E. Car son, T. A. King, C. E. Lewis, J E. Martin, H. H. Stratton, R W. Abbitt."}, "highlight": {"text": {"matched_tokens": ["Chilton", "H"], "snippet": "T. Drinkard, John B. <mark>Chilton</mark>, <mark>H</mark>. M. Marshall, Thos. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "H"], "snippet": "T. Drinkard, John B. <mark>Chilton</mark>, <mark>H</mark>. M. Marshall, Thos. A."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [684.51, 180.68, 840.86, 407.92], "bbox_id": "497bd945b5", "file": "AppomattoxNewspapers_1918-1922a_0522.pdf", "page": 1, "text": "terial tudent of bis neighbor hood, and it was very impress ively rendered  Lead Me Gently Home Father and Sometimes We will Under stand. The flower contribu tions were beautiful and were carried by his nieces  Elsie Carter, Louise and Virginia Morris and ADnie Hancock. Mr. Binford is survived by his wife, nee Miss Ana Chilton, of this county, three daughters Ethel, Margie and Reva and one son. Chapman Binford, also one brother, W. B. Binford, and wo sisters, Mrs. C. H. Moore md Mrs J. D Moore, all of Prince Edward county."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "and wo sisters, Mrs. <mark>C</mark>. <mark>H</mark>. Moore md Mrs J."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "and wo sisters, Mrs. <mark>C</mark>. <mark>H</mark>. Moore md Mrs J."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "Statham, L. E. Smith, <mark>H</mark>. <mark>C</mark>. Babcock, E. R. Abbott"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "Statham, L. E. Smith, <mark>H</mark>. <mark>C</mark>. Babcock, E. R. Abbott"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.94, 1119.58, 2557.62, 1561.66], "bbox_id": "d729f72dc6", "file": "AppomattoxNewspapers_1908-1909a_0494.pdf", "page": 1, "text": "si? 0 UT spring , Idne I5ri . Mira Elizabeth .Robertson has returned from a visit to. rria,- d v a ft Lynchburg, j  . Mri and Mrs. , fitton Harvey and faittiy, and J, W. C. Mar tin spent Sunday with Mr. anti Mra H. B.. Martin. The W.M.jLJ. of. Salem church met with Mrs, F. O. Jones Wedr nesday.. , f . Mrs. Hattie Wentright has been visiting Mrs. W. H. Rob ertson. -6 , i r ,,J Little Betty Day is sick. ,  Billy MeDearmon hlis Been visiting in the home of Ruste! Cawthome.  Miss Christine Wheeler  visiting Miss Elizabeth Robert son. Mr. and Mrs. R. Morton, Billy Morton anti Chap Adams were Sunday iniesta in the homeofR.H.Bate. r, Mr! and Mra 7 B.. Martin who have been sick, are im proving. Mrs. W. D. Robertson has re turned from toe hospital. - DRly-Dierron ft home the summer months. Mr, and Mrs. R. K Lawson pent Sunday in the home of W. E, Dickerson. .- 7 . . l z   Nancy Roberts is rick. Miss Nannie Sue Chilton is spending- some time with her parents, M ranti Mra W. C. Chilton.  Mira Eleanor Chilton .is visit- ing in Lynchburg.  ,  .XT 7 T.,..  f"}, "highlight": {"text": {"matched_tokens": ["C", "Chilton", "Chilton"], "snippet": "M ranti Mra W. <mark>C</mark>. <mark>Chilton</mark>.  Mira Eleanor <mark>Chilton</mark> .is"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton", "Chilton"], "snippet": "M ranti Mra W. <mark>C</mark>. <mark>Chilton</mark>.  Mira Eleanor <mark>Chilton</mark> .is"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2223.08, 1465.0, 2388.08, 1581.8], "bbox_id": "d1004c7f9c", "file": "AppomattoxNewspapers_1952-1954a_0158.pdf", "page": 1, "text": "She is survived by three brothers, R. A. Cheatham and R E. Cheatham of Spout Spring and H. R. Cheat ham, of Richmond two sisters, Mrs. Lula Howerton, of Rustburg, and Mrs. W. C. Chilton, of Appomattox, and by ten nieces and three ne phews. Active pallbearers were H. S. Jones, Sr. Floyd Dunn, Odell Howerton Walter Tyree, Richard Harris, and John Nash."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Rustburg, and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, of Appomattox, and by"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Rustburg, and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, of Appomattox, and by"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1856.87, 1396.65, 2025.79, 1756.85], "bbox_id": "7f463a015e", "file": "AppomattoxNewspapers_1949-1952a_0516.pdf", "page": 1, "text": "Schedule of home demonstration club meetings next week The subject for demonstration will be stain and spot removal, and will be given by leaders with the home agent assisting. Tuesday, Feb. 5.- The Lee Home Demonstration Club will meet at 2 P. M. with Mrs. H. A. Torrence. The demonstration will be given by Mrs. Helen Fay Coleman and Mrs. B. J. Lucado. Wed., Feb. 6.- The Glendale Home Demonstration Club will meet at 2 P. M. with Mrs. M. A. Johnson, with Mrs. Martin co-hostess. The demon stration will be given by Mrs. W. C Chilton and Mrs. Raymond Rosser. Thursday, Feb. 7.- The James Riy er Home Demonstration Club will meet at 100 P. M. for luncheon with Mrs. T. M. Cunningham. This is the second in a series of luncheon meet ings the members are sponsoring to raise funds for their club. The dem onstration will be given by Mrs, Cunningham a n d Mrs. W alter Phelps. _ , Thursday, Feb. 7. The Rocks Home Demonstration Club meets at 730 P. M. with Mrs. Toby Inge. The demonstration will be given by Mrs. J. H. Ranson and Mrs. Lowell Flesh- man. Friday, Feb. 8.- 4-H meetings. Saturday, Feb. 9.- District 4-H contests in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "given by Mrs. W. <mark>C</mark> <mark>Chilton</mark> and Mrs. Raymond Rosser."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "given by Mrs. W. <mark>C</mark> <mark>Chilton</mark> and Mrs. Raymond Rosser."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2007.6, 1341.65, 2172.94, 1809.14], "bbox_id": "207a97e585", "file": "AppomattoxNewspapers_1922-1923a_0257.pdf", "page": 1, "text": "S p rin g M ills. The crops of this section a ere so much refreshed by tbe recent rains, and our farmers are busy planting tobacco. The wheat crop has been greatly injured by the drouth. Spout Spring Union No. 2 meets at Falling River June 2, at 4 olock p. m. Many of this section are look ing forward to the unveiling with much pleasure. Fried chicken will be almost unknown to the lunch basket, as there are so few in this neighborhood. Mrs. G. H. Chilton and daughter, Maggie, made a flying trip to see Mrs. L. T. Morris last week. Mr. Eldridge Cheatham left this neighborhood yesterday for Roanoke where he expects to obtain business. He will be missed oy a great man friends. Mr. Ghockolett, accompanied by his little daughter Maggie came to Mr. J. H. Morris Friday afternoon to be at his post of duty Saturday. - Miss Lena Morriss is reported ill, we hope to see her out soon. Miss Eunice Davis is still attend ing her grandmother, Mrs. Dedicar, who is quite ill with paralysis. Mr. and Mrs. C. W. Harvey little girl, Edna, has been ill, bat is improving. The gardens of this section will be late owing to the late frost. Wt"}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "this neighborhood. Mrs. G. <mark>H</mark>. <mark>Chilton</mark> and daughter, Maggie, made"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "this neighborhood. Mrs. G. <mark>H</mark>. <mark>Chilton</mark> and daughter, Maggie, made"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1797.35, 922.6, 1962.8, 1097.7], "bbox_id": "c428a3fd99", "file": "AppomattoxNewspapers_1933-1936a_0430.pdf", "page": 1, "text": "Rev.and Mrs. C. H. Williams were dinner guests of Mr., and Mrs.Wiley Moore Sunday. o Mrs. R . E . Smith and son, Rich ard spent the week end in Lynch burg. o Dinner guests of M r. and Mrs. W .J. Walton Monday night were Misses Edythe Martin, Mary Jamer son Thelma Webb, Hezel Chilton and Vivian Clarke and John Walton, Jessie Hrvey J r . and Curry Har vey joined the guests aider dinl- ner. _  ! i . Q   Miss Mildred Walton is spending this week with her parents.."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "Rev.and Mrs. <mark>C</mark>. <mark>H</mark>. Williams were dinner guests"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "Rev.and Mrs. <mark>C</mark>. <mark>H</mark>. Williams were dinner guests"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [951.58, 634.89, 1113.56, 729.59], "bbox_id": "82b60a305f", "file": "AppomattoxNewspapers_1926-1933a_0007.pdf", "page": 1, "text": "Reet C h i pring Baptist which deceased was a mem ber.! Messrs. F. 0 Jones, V. C i I Chilton, J. B. Chilton, J. A. j Martin,J. W- Coleman, G. W. and Jamerson, acted as pall bearers, interm ent in the church ceme tery."}, "highlight": {"text": {"matched_tokens": ["C", "h"], "snippet": "Reet <mark>C</mark> <mark>h</mark> i pring Baptist which"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h"], "snippet": "Reet <mark>C</mark> <mark>h</mark> i pring Baptist which"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2153.75, 507.73, 2325.84, 1305.94], "bbox_id": "c0ce3d7713", "file": "AppomattoxNewspapers_1922-1923a_0225.pdf", "page": 1, "text": "R o u g h C reek . One of the most enjoyable reoep- I tious of the season was given last Friday night the 23 of March at the hospitable home of Mr. Hamlet Bailey, in honor of the birthdays of Misses Mary Bailey and Mabel Vaughan. Those present were Misses Marionand Bessie Berkley, Irene Harvey, Ola Barnes, Eugene Tooker, Annie Andrews, Bernice .Bailey, Lucie, Bessie and El vie Haiioock, Messrs. Otis Tucker, Frank, Milton, Douglas, Sum, Syl vester and Hugh Pugh, Hunter and .Douglas Hancock, Obey Snell, Charlie Berkley, Clem Morton, Dr. Elliott, Jack Elliott, Cleveland .Price, Luke and Harrison Bailey. Arthur Collie, Anson Elliott, Essie and Barter Brightweli. At a late hour the guests were conducted to the dining louui, where a most de lightful repast was served consist ing, of meats, cream, cukes etc. .Haloing con tin mil until the wee -nuitll hours of the night when the -nappy dancers felt that the time  bad.come too soon tu say that sad I word, good bye. I , Many hearts are made glad to  know that Dr. E. E. Walker has -retorned to Pamplin City. L Miss Marion Berkeley was the pleasant guest of Miss Annie Berk ley recently. Mr. H. A. Andrews spent Friday hd Saturday at Mr. David Malo-  neys near Darlington Heights. Mr. Jack Elliott, of Whi es Chanel visited relatives here this week. Mr. W. H Morgan of onr town was in our neighborhood recently. Mr. 1had Andrews of Lynch- hnrjl spent Friday and Saturday viih bis home people of Madison- ville, Mrs. Einrun Btkernml children were g tests of her sister Mrs, Thftekston la-t week. Mr Chilton Ba a, of Halifax was he guest of Mr. D. E. Hancock Saturday and Sunday, Mr. Charles Clay spent several days in Lynchburg this week on hutineas. Mr. Douglass Pugh spent Satur day and Sunday with Mr. Hunter rfkncook. Mits Bessie Berkley, who has been spending the winter with her is ter, Mrs. Edward Car wile, of Venner, is at her horn here for a few days."}, "highlight": {"text": {"matched_tokens": ["h", "C"], "snippet": "R o u g <mark>h</mark> <mark>C</mark> reek . One of the"}}, "highlights": [{"field": "text", "matched_tokens": ["h", "C"], "snippet": "R o u g <mark>h</mark> <mark>C</mark> reek . One of the"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [341.72, 550.23, 517.68, 1071.42], "bbox_id": "6975d31188", "file": "AppomattoxNewspapers_1943-1947a_0056.pdf", "page": 1, "text": "Mrs. J . H. Hancock spent Sun dry in the home of Mrs. Chap Gar- rette.  r    Guests of Mr, and Mrs. D. P. M on Sunday were Mr. and Mrs. Wesley Martin and son, Jerry, Mr. and Mrs. N J. Webb and child ren, Barry- and- Sandra, Mr. and Mrs. D. J . Moon, Mr. and Mrs. R L. Dean and Mrs. W. H. Hume and daughter, Gwendolyn. Mr. and Mrs. Howard Robertson and daughters, Jean Adair and An- i, i Lee spent1 Sunday with relatives here. fi Mr. Mrs. Theodore Carson r l daughter, .Barbara Anne spent Fun day with relatives here. Mrs. Martha Williams, of Lynch- l  i-g visited in the home of her Reice, Mrs. Mary Collins recently. Little Jimmie Martin is spending this week With his grandmother, M s. Tom Harris, of Pamplin. J. E. Chick, who has been sick, is  ble to be out again.  special service was held at Spout Spring Baptist Church Sun il y, honoring the boys in service from that church. Misses Nannie Sue, Eleanor and Anna Chilton spent Sunday with their mother, Mrs. W. C. Chilton. Cpl Hunter . Dickerson, Ft. Meade, mil Mrs. Dickerson of Appomattox spent Sunday with relatives here. W. E. Martin, who has been sick, i better.  Several from this community at- t uded the-  Memorial services in I ynohlburg . for Major Robert H. Humphrey... Pvt. Dewey Almond recently spent  r 12-day furlough with his par ents. Cpl. Frederick Dickerson, of Fort Meade is spending several days with relative at Snout Soring."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "their mother, Mrs. W. <mark>C</mark>. <mark>Chilton</mark>. Cpl Hunter . Dickerson, Ft."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "their mother, Mrs. W. <mark>C</mark>. <mark>Chilton</mark>. Cpl Hunter . Dickerson, Ft."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [299.29, 248.99, 441.7, 546.23], "bbox_id": "d089c4c86a", "file": "AppomattoxNewspapers_1962-1965a_0539.pdf", "page": 1, "text": "Mrs. B. W. Lance Mrs. Lois Fantini, of Lynch- bui g, has been notified of the death Wednesday, Nov. 18, of her sister, Mrs. Nannie Chilton Lance, of Asheville, N.C. Bom in Appomattox County, she was the daughter of William C. Chilton and Jemima C. Chil ton. Besides her sister, Mrs. Lois Fantini, she is survived by her husband, B. W. Lance, of Ashe ville, a daughter, Mrs. Jimmy Swann, of Ft. Devins, Mass four sisters, Harriett Chilton, of Falls ehurch, Mrs. H. A. McDaniel, of Atlanta, Ava Chilton and Elea nor Chilton, both of Lynchburg arid two grandchildren. Funeral services and burial took place in Asheville. -Beloved, I wish above all things that Thou mayest prosper and be in health, even as thy sjjul prospereth, 3 John 3. We are sorry to hear that Mr.  d Cumby was taken to the Lynchburg General Hospital, Sat-"}, "highlight": {"text": {"matched_tokens": ["C", "Chilton", "C"], "snippet": "the daughter of William <mark>C</mark>. <mark>Chilton</mark> and Jemima <mark>C</mark>. Chil"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton", "C"], "snippet": "the daughter of William <mark>C</mark>. <mark>Chilton</mark> and Jemima <mark>C</mark>. Chil"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1544.4, 1431.11, 1716.64, 1758.95], "bbox_id": "83222f9046", "file": "AppomattoxNewspapers_1908-1909a_0365.pdf", "page": 1, "text": "Mr. John Dickerson is yiait- ing relatives at Spout Spring. - 1 try Dan .and fafll ily spent Sunday with reiatr h 6 r 6  Mrs, J. H. Davidson, Mrs. L. W. Hawthorne and children spent the fourth with Mrs. W- I A. Moon. .  i Miss Erna Dickerson is visit ing Bluefield, W. Va. Mrs. Mary Ford, of Roa noke, is visiting Mr. and Mrs W. A. Moon. Mr. and Mrs. D. H- Cyrus haver moved into their new home here. Mr. Cyrus enter tained some of his friends at a pine chopping Saturday. The Womans Missionary Society of Salem church was delightfully entertained in the home of Mrs. W. C. Chilton Wednesday afternoon. Mr. and Mrs. Elliott are vis iting home people here."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "home of Mrs. W. <mark>C</mark>. <mark>Chilton</mark> Wednesday afternoon. Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "home of Mrs. W. <mark>C</mark>. <mark>Chilton</mark> Wednesday afternoon. Mr. and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.75, 431.43, 1661.88, 824.47], "bbox_id": "7b94f937a1", "file": "AppomattoxNewspapers_1955-1957a_0189.pdf", "page": 1, "text": "Mr. and Mrs. Thomas Edward Moore have announced the birth of _ son, Thomas Edward Moore Jr., born at the Virginia Baptist Hospi tal on Tuesday, May 22. Mr. and Mrs. H. E. Stossel, Mr and Mrs. R. E. Purdum, of Front Royal, and Mr. and Mrs. R. B. Pur dum, of Elkins, W. Va., visited Mrs. J .D. Moses over the week-end, Mr. and Mrs. W. C. Chilton and daughters, Eleanor, Harriett and Ava have returned front a visit with Mrs. Harry McDaniel in At lanta, Ga., and Mrs. B. W. Lance in Asheville, N. C. Ven. Norman E. Taylor, of Nor folk, will be a guest this week-end of Mr. and Mrs. Calvin Robinson. Mr. Taylor will conduct services at St. Anns Episcopal Church on Sun day, with Sermon and Holy Com munion. Mrs. Marvin Reynolds and moth er, Mrs. Florene Phelps, of Liberty Chapel, visted in the home of Mi, and Mrs. Hunter Jamerson and Mr. and Mrs. Kenneth Jamerson Thurs day night. Friends were glad to see Mr. Irby Wheeler in Appomattox yesterday. Mr. Wheeler is recovering from wounds received when attacked by a bull on his farm near here. He was hospitalized for several weeks, but is home now and recovering nicely."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark> and daughters, Eleanor, Harriett"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark> and daughters, Eleanor, Harriett"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1533.85, 358.37, 1701.0, 397.66], "bbox_id": "9996611a20", "file": "AppomattoxNewspapers_1955-1957a_0235.pdf", "page": 1, "text": "Mr. and Mrs. H. R. Cheatham, of Washington, D. C., have been visit ing in the home of Mr. and Mrs. W. C. Chilton."}, "highlight": {"text": {"matched_tokens": ["H", "C", "C", "Chilton"], "snippet": "Mr. and Mrs. <mark>H</mark>. R. Cheatham, of Washington, D. <mark>C</mark>., have been visit ing in the home of Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "C", "Chilton"], "snippet": "Mr. and Mrs. <mark>H</mark>. R. Cheatham, of Washington, D. <mark>C</mark>., have been visit ing in the home of Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [679.43, 487.02, 1023.18, 549.12], "bbox_id": "6d0635e096", "file": "AppomattoxNewspapers_1943-1947a_0178.pdf", "page": 1, "text": "Mr. and Mrs. H. B. Martin anti sons spent Sunday with relatives! noon at Appomattox. I , Mr. and Mrs. Lloyd Hamilton, W. C. Chilton, who has been a Mrs. Percy Thompson and son, patient at a hospital in Lynch- spent Sunday with Mr. and Mrs. burg has returned home. Tom Robertson."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Mrs. Lloyd Hamilton, W. <mark>C</mark>. <mark>Chilton</mark>, who has been a"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Mrs. Lloyd Hamilton, W. <mark>C</mark>. <mark>Chilton</mark>, who has been a"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1599.85, 1097.01, 1923.51, 1206.11], "bbox_id": "4852a6fb80", "file": "AppomattoxNewspapers_1905-1912a_0197.pdf", "page": 1, "text": "Master E llio tt Marshall has bad  Successors L y n c h b u rg F u m i ture Co., Fleenor Furm- a bid throat. Mr, and Mrs. Robert Marshall are on a visit to see  their children in Ohio. It does the old as well as the yoaiig good to have a.little out ing somatimes. Miss Maggie Chilton is spending some time with her sister, Mrs. L."}, "highlight": {"text": {"matched_tokens": ["c", "h"], "snippet": "Successors L y n <mark>c</mark> <mark>h</mark> b u rg F"}}, "highlights": [{"field": "text", "matched_tokens": ["c", "h"], "snippet": "Successors L y n <mark>c</mark> <mark>h</mark> b u rg F"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.61, 821.08, 1860.4, 1512.36], "bbox_id": "336b84f6fd", "file": "AppomattoxNewspapers_1902-1905a_0227.pdf", "page": 1, "text": "M iss Etta B loxton s Stocking P arty. On Wednesday evening, December 30, the hospitable home of Miss Etta Bloxton was the scene of one of the unique and enjoyable social events of the season, twenty-six invited guests being present W. D- Robertson and Miss Annie Jone.-y-E R. Jones and Miss Mary Hunter Jno. Marshall and MissMittie Dick erson, H. R. Cheatham and Miss Willie Hunter, R. W. Nowlin and Mis9 A. Robertson, W.C.Chitton and Miss Ava Morris,R.E.Cheatham and Miss Lena Morris, W. E . Dickerson and Miss Nannie Morris, Leslie Morris and Miss Bessie Chilton, Ormond Jones and Miss Vara How erton, W. H . Spencer and Miss Ella Cheatham, M. H . Hunter, Miss Bessie Glover and Miss Mary Rob ertson. The invitations were very appro priately sent out on stoeking-snaped cards. The hostess received her guests at the door dressed as Miss Santa Clause, who looked quite bewitching in her gray locks and cap. Christmas verses bad been printed on four cards, each of which being cut into six. irregular pieces and distributed among the guests,- the same to be matched so as to read correctly when each groupe of six had been brought together in proper manner, it was planned that each group sh.onld write a short Christmas story, a prize being offered for the best production. The fol owing groups Mis Ella Cheat ham, Mss Annie Robertson, Wm. C. Chilton, Wm. Spencer and Mios Mittie Dickerson captured the prize an automatic toy which afforded much amusement. While this merry-making uas go ing on in the parlor, Miss Santa Clause slipped out, returning a few moments later and announced that light refreshments would be served. Proceeding to the dining 100 m, Christina- candies were found upon the table, which constituted  light refreshments. Before the merry crowd recovered from the joke, they were ushered into an adjoining roohi which contained a beau iful and brilliant lighted tree,on which hung small bright colored, stockings over flowing with goodies and a present for each guest. Dr. Bloxton, of Richmond, a genial brother of the hostess, was present and by his affa bility, contributed much to the pleasures of the evening. Each guest departed declaring Miss Blox ton a complete and most charming success in the role of Miss Santa Claus. And one had only to look"}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Mss Annie Robertson, Wm. <mark>C</mark>. <mark>Chilton</mark>, Wm. Spencer and Mios"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Mss Annie Robertson, Wm. <mark>C</mark>. <mark>Chilton</mark>, Wm. Spencer and Mios"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1481.99, 814.44, 1626.45, 900.98], "bbox_id": "c00da49c61", "file": "AppomattoxNewspapers_1952-1954a_0231.pdf", "page": 1, "text": "lidncwy, April 8-Susan Haar ie DeBnstration Club will meet VSSMwith Mrs. W. C. Chilton. wniIiector and Mrs. S. O. S ja nBrive the demonstration. H H April 9 - Stonewall  Demonstration Club will meet Carson."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "meet VSSMwith Mrs. W. <mark>C</mark>. <mark>Chilton</mark>. wniIiector and Mrs. S."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "meet VSSMwith Mrs. W. <mark>C</mark>. <mark>Chilton</mark>. wniIiector and Mrs. S."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [215.01, 615.36, 387.18, 1373.92], "bbox_id": "57f83395c3", "file": "AppomattoxNewspapers_1908-1909a_0147.pdf", "page": 1, "text": "Judges and registrars of elec tions at Altavista and Lynchs precincts and a number-of other citizens of Campbell county Were witnesses before the grand jury here today which resumed its- in yestigation of r lleged irregulari ties in the August democratic primary in the county and also as to the manner in which a peti tion seeking to contest this elec tion was prepared. M. L. Booth and j. W. Griffin, two members of the grand jury Who also are members of the board of supervisors and were re-elected in the primary this year, were dismissed from the jury at their Own request. Judge Don P. Halsey, who had selected the jury, emphasized that he had no doubt as to tbe honesty of these men or their fitness to serve on the investigating bód 1, bat he recognized that their po sition m ig h t, be embarrassing and allowed them to withdraw, there being seven men left enough to cohform to the require ments of law as to the number of men on a spècial grand jury. The judge also warned the jury, which had reported to him  last week and was told then that its frork had not been s ufficient lythorough, that no perfatTctory investigation would be satisfac tory but that tbe court désired a full report as to what basis, if aaÿ, there might be for the char ges that have been made. Special inquiry was made to day into charges that one man had voted twiceonce at Lynchs and once at Altavistaand it is understood that alleged irregu larities at several other of the nine precinte mentioned in the election contest bill were inquir ed into. v Attthoeô whose namesappear- edo this contest bill and sever al other citizens of the county hâve been summoned to. appear ..before the grand jury when it reconvenes on. Friday morning . -and it, is believed that thé inves -tigation Will be completed time. Both questions of irregu larities in the primary and in the preparation of the petition then will be considered and the report requested by Judge Halsey, in addition to any indictments that may be found, will be submitted at that time covering the work done by thè jury today as well as that still to be done. The grand jury at present is composed of C. R. Blankenship, foreman, and T B Moorman, H H Dinwiddie, John R IVlasón, R H Henderson, R H Chilton. and W L Garbee, Jr.  News, Sept. 27th"}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "R H Henderson, R <mark>H</mark> <mark>Chilton</mark>. and W L Garbee,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "R H Henderson, R <mark>H</mark> <mark>Chilton</mark>. and W L Garbee,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [236.66, 639.16, 403.06, 1397.42], "bbox_id": "976069c728", "file": "AppomattoxNewspapers_1926-1933a_0147.pdf", "page": 1, "text": "Judges and reg istrars of elec tions a t A ltavista and Lynchs precincts and a num ber of other citizens of Campbell county were witnesses before the grand jury here today which resum ed its in vestigation of r lleged irregulari ties in the A ugust democratic prim ary in the county and also as to the m anner in which a peti tion seeking to contest this elec tion was prepared. M. L. Booth and J. W. Griffin, tw o m em bers of th e grand jury who also are m em bers of the board of supervisors and were re-elected in the prim ary this year, were dismissed from the ju ry at th eir own request. Judge Don P. Halsey, who had selected the jury, emphasized th at he had no doubt as to the honesty of these m en or their fitness to serve on the investigating bod , but he recognized th a t their po sition m ight be em barrassing and allowed them to w ithdraw , there being seven men l e f t - enough to conform to the require m ents of law as to the num ber of men on a special grand jury. The judge also w arned, the jury, which had reported to him last week and w as told then th at its work had not been sufficient ly thorough, th a t no perfunctory investigation would be satisfac tory bu t th a t the court desired a full report as to w hat basis, if any, there m ight be for the char ges th at have been made. Special inquiry was m ade to day into charges th a t one man had voted tw iceonce a t Lynchs and once a t A ltavistaand it is understood th a t alleged irregu larities a t several other nine precints m entioned election contest bill were ed into. v AH those whose names appear- ed.on this contestbill and sever al other citizens of the county have been summoned to appear before the grand jury when it reconvenes on Friday m orning -and it,Is believed th at the inves tigation will be completed at tim e. Both questions of irregu larities in the prim ary and in the preparation of the petition then will be considered and the report requested by Judge Halsey, in addition to any indictm ents th at may be found, will be subm itted a t th at tim e covering the work done by the ju ry today as well as th at still to be done. - The grand ju ry at present is composed of C. R. Blankenship, foreman, and T Br Moorman, H H Dinwiddie, John R Mason, R H Henderson, R H Chilton, and W L Gar bee, J r.-N e w s , Sept. 27th."}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "R H Henderson, R <mark>H</mark> <mark>Chilton</mark>, and W L Gar"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "R H Henderson, R <mark>H</mark> <mark>Chilton</mark>, and W L Gar"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [482.65, 323.45, 780.39, 547.28], "bbox_id": "2d9c189231", "file": "AppomattoxNewspapers_1939-1943a_0282.pdf", "page": 1, "text": "Jones. , I Mrs. R. H. Chilton, of Concord l Depot visited triends a t Spout 1 Spring recently. Mr. and Mrs. Floyd Martin and  jon, of Lynchburg spent the week end with her sister, Mri II. C. A1 ! mind. Mr. and Mrs. W. H. Hume, of Monroe visited in the home of D. P. Moon recently. Rev. and Mrs. 0. L. Gilliam were dinner guests in the home of A. M. Goodman Sunday. Glen Millner, smal. son of Mr. and Mrs. J. G. Millner, who was taken to a hospital in Lynchburg, last week for appenditicits, is recov- ering nicely. Business Directory"}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "Jones. , I Mrs. R. <mark>H</mark>. <mark>Chilton</mark>, of Concord l Depot"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "Jones. , I Mrs. R. <mark>H</mark>. <mark>Chilton</mark>, of Concord l Depot"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [970.81, 951.72, 1142.26, 1705.98], "bbox_id": "5cefd37801", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j 229, George Wiley Woolridge 299, Robert James Thornton 410, Joël West Flood 58, John Cleveland Hall 150, Robert Jones 400, A Walker Covington 19, Wm. Patterson Coleman  115, Robert Süppleton Spen- oer j 206, Walker W Jennings i 228, Floyd Erie Trent ! 126, Percy B. Whitaker 328, Lacy Aubrey Baldwin 96, Wm. Pierce Odor 453, Abbitt Henry Woolridge 624, Norman Bradley Lee 507, Samuel Henry Morgan 644, Conrad Moore 188, Edward Henry Chilton 635, Henry Clay Perdieu 91, Joseph Wilson Morris 633, Alex Preston Morris 17, Benjamin Collins Cole 378, Henry Walker i 619, G. Parks Jennings 237, Charlie Matthew Harvey 422, Edward Lucado 344, John Otis Hannah 442, Thomas H Trent 268, Major Alfred  heatham 202 , Josh Walker Harvey   164, Walker Turner  272, Harry Terry Baldwin 693, Frager Robr s m   407, Andrew Jackson Fergu-1 I son   I 262, Samuel Russell Paulett I 581, Pet Ferguson  566, Obie Hamilton Snider  I 311, Joe Cephas -Harvey  124, Wm.Anthony Walton  481, Warren Braxton Jam er- son  682, Wm. Ferguson  240, Charles Erman Marshall 590, Umphrey McCoy  635, Henry Olay Perdieu  ! 499, Randal Goode  I 444, Oscar Russell Tnrnes  6S4, Thomas Moore Martin 11 326, Henry Edward Wheeler I 477, Wm. Fletcher Garrett I  76, John Will Marshall j  672, Walker Wm. Megginsonjl 393, John Arthur Carter 11 158, Earl Patterson f I 187, Robert Junius Elliott ! 1 1, W E Abbitt j I 650 Forrest V. Whitten j 105, H C Pulliam I _ 62, Lloyd Frank Goin 36, Ernest 8 olon Fore 11 418, Thomas Joel Harvey  I  466, Wetley W Woolndg 4 Ml, Hsrriioo Wood Nash"}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "V. Whitten j 105, <mark>H</mark> <mark>C</mark> Pulliam I _ 62, Lloyd"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "V. Whitten j 105, <mark>H</mark> <mark>C</mark> Pulliam I _ 62, Lloyd"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [630.47, 1707.48, 789.5, 1996.73], "bbox_id": "d1248f4f92", "file": "AppomattoxNewspapers_1898-1902a_0457.pdf", "page": 1, "text": "Interesting Marriage at Spout Spring. Old Concord Presbyterian cburch was the scene of a most beautiful wedding on Thursday March 4th the contracting parties being Rev, A. M. Perryman, of Malvern, Ark., and Miss Viola Shearer, daughter of Mr. H. C. Shearer of this county. The ceremony was peformed by Rev. D. P. hogers, pastor of the church. The bridal party entered the church to the Btrains Lohengrins weddiu march, played by Miss Helen Beck ham, in the following order Mr. anu Mrs. R. H. Chilton, Mr. John Overton and Miss Kate Clark, Mr. William Chilton and Mrs. J. P- Moorman, Mr. Elliot Jones and Miss Mollie Withers, and Mr. and Mrs. E. W. Taylor. The. groom entered with bis best man, Mr. James Wat kins, of Lynchburg. Then came the bride with her maid of honor, Miss Bessie Shearer, The brides"}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "Shearer, daughter of Mr. <mark>H</mark>. <mark>C</mark>. Shearer of this county."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "Shearer, daughter of Mr. <mark>H</mark>. <mark>C</mark>. Shearer of this county."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1294.28, 948.76, 1892.0, 1571.05], "bbox_id": "662ece4f01", "file": "AppomattoxNewspapers_1908-1909a_0073.pdf", "page": 1, "text": "inked  t . 87. I Thelma Torrence, bfo -W tfT jfiTlinBii tfcf i j    1  fomiiton   land one great grmnd-son and E  1 b 8L I Ckadè 4 Billy Smith, Qrl HorJ Meàsrs Herman and David B. Shrieves, an adopf- le Hteeiries  Tn, Daniel Carter, Berta Pin-l Marsh, of Lyndiburg, attendedUd flM, and four sisters, Mri. I .1 ,. .J- Imddie, Edith Franklin, ChriB- the funeral of their grandfather, Annie Lewis, of Toga. Mrk pyTway to be tine Caldwell, Cecil Torrence,  jjr.  Doc Davis last week Jlhnnfe Rftihaîwta, Mrs. Sarah time of trial is Erna Dickerson, Willie Guthrie  Mr. Lewis Meadows,, of Roa-1 Charlton, of Dillwyn, and Miss iTv sa  Anderson, Loraine Handy. noke, visited Mr. and Mrs- E. S. Lucy Jones, of Aiderstm, W. V. tcond time from 1 Grade 5, Raymond Jamersoû, 1 l a s t week-end. I All her children and Mr. Dav tend the- same Lawson Moore, ElHcdt Torrence, 1 Mr. Ernest Lowe mid Mr. I Shrieves wore present at. hqr b tore!tot1ôS Harion Agee, Mary Clarke, jRuuch enjoyed a thrilling? triphiurh ixpeiMr. T- R, Grfr f the disciples I Margaret Carter, Mabel Hall,  fr0m Roanoke to Mr. and Mrs. j who ia reeovfriag from a bisme  con- rhelma Morris, Dorothy Price,  e . S. Roachs last weri-end m asevere illness  auri a host of s vvdi lnL Habelle Smith, Dorothy Teewdy. motorçyde. Mr. Robert Roach friends and relatives, he words to the 6 , Mandane Anderson,  visited Mr. and Mrs. D. R lngej Pall bearers W- A- Swan, H- Bilious 4  3 -1 Mellie BkKxton, Annie ChfdnbegB wKll down. JM. Marshall, T. J. Hix, ftwcomb IUrn hoarhad Carrie Jamerson, Hilda M o, P c, 7 RanB has been 8 te y hite,fi.. C. Clements, J. - D. toyai. Thera is Eloise OBrien, Claudine OBrien, Ijjut is better,  Carter. fcg asleep when I gjjjth Robertson, Alice Lee  Mr. Hubert Martin, of Lyndi-I Honary pall bearers J. B. phadheèn pra I Smith, Elizabeth Trent, Gar-jjjurg visited his friends in theMcCue, T. J- Ligon, L. N. Ligop, I hve faiien atieep. j land Plunket, Billy Hubbard. community last week-end Hu-i R. H. Gilliam, W. R. Bjightweil, I p Medei Frajffr j .Grade 7 Evelyn Dickerson, i,ert sure does like this part of HiklgarÇorinjgtpff, W. W. Swap, bm    -li v C kalWr--- Le the world from ali appearances, w. B. Binford. tet that the Lord  Grand, Addie Lena, Ferguson,T Mr- Robert Cawthorn continj Flower bearers Mrs. R. B. sT 0 PaZ   Lucile Blackwell, Betty Bloxton. ue8 jfl. J Spencer, Mrs. Colyer , Parks, ! W prayer ter tho I 4 th year, Frances Ford, Josie Mr. Clem Woodall, it ia re-M.HubOTt Elam, Mrs. J. Ç. I I  .. Jam erson R ichard,JenkinsR i h-ported, can npW w alk from th e lR e d fo rd , M r. S tw tiib n P eam o p ,  w. l ard McDearmon, Corine H an-r to his chair.  Mrg Gspwa JEBlhert, Miji. m iif faith to  cock, Frankie V æ  cas pray I Sfrd y ëar,  M ary Ja m e rso n ,  A p p o m a tto x W a r e h o u s e T o -1 T h a ilb w iiw w e re o f ex q u isite L . rcîmiïîioo i ï ! p e y L eG rande D orothy W ood- b a c c o S a k   Isqn, Samantha Pippin.   J fi sperii mention pf I  2 nd year, Louise Evans, Elea- you may be convinced fl   ite qpr Harwood, Virginia Lee  riiat Appomattox is a good place  pipkjMurnatipni roses. ihompBon, Edith OBrien, Lodise ftp sell your tobacco note foilow-J The funeral services were con-1 Jp pjtwthorn, lora Abbitt. Grace ing sales made at AppomattoxducUri by her pastor the Rev. ! j Burnett Verta Simms, la k ie j     M r p J  Mr. Clark, of Plmspect Circuit,  Chilton-  - n 42 lbs. 3 60 44 lbs 8.50 52 wfcpapok in Pt comforting I i k 1st-year,- Gertrude StewartJ 5 a lbs, 14.75 60 lbe,wwil 0 -those -toll G ia d y r I n ge, M arir G a te S e a rs, 116.50 4 lbs, 18 .00 r i6 1 te , 5Q.00,  b v th e church c h oir .  r -- L ottie L ueado, F a y B abcock, 66 lbs, 33.00. I s t d  -  S pecial solo  S o m etim e W aU 11 ! F ranceaC olem an, V irginia Car-_ ..... . . U n d e rs ta n d by ..Mrs.. C heslpyiB Îàon, M ollieL ew is, C hariesJanm H , a m ena 1 A lfred H anhood, C h arles C raw -  ao 100 19 M r  J  M ia l jlfe 11 J o h n H esson, Ja m e s M orris,  c 4 - j w h it t e n  C a rte r p re sid e d a t th e o rg ap . I Jl Holcomb C  T O t t r V i r ï t a    y      J  I ------- C 88 lb., 8.75rl lb, 14.00 48 tbawmphy tohartndndfmily. IB GOLD HILL SCHOOXr 15.50 58 lbs. 20.00 42 lbs. 18,50 si., jw 1    ÿ 1 ,k  I 7th grade, Beulah White. 421bsl7.0 1061 bs30.Total 91.94. UJÜUtf nrfflU At WpstPUl hn which moves 6 th g rad e, Dolly C arson, A lice  1 1 -------- c . r . üOOM ! - I  W   ! fiftn l   ! fTWHWW l  N iqdinte tearota B row n, U rie l C arso n . 60 lb s. 4.OO2021bs, 7  M i l v Æ 1 to fieUvend. from -iV , n niai Uto 12.00140 lbs. 14.00192 lbs. SchcdoSs Effective Nov. 2f, t9U 11"}, "highlight": {"text": {"matched_tokens": ["c", "h"], "snippet": "v th e church <mark>c</mark> <mark>h</mark> oir .  r -- L ottie"}}, "highlights": [{"field": "text", "matched_tokens": ["c", "h"], "snippet": "v th e church <mark>c</mark> <mark>h</mark> oir .  r -- L ottie"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2107.0, 565.18, 2273.5, 1088.98], "bbox_id": "caa4bb6985", "file": "AppomattoxNewspapers_1902-1905a_0556.pdf", "page": 1, "text": "in this Motion. Onr farmèrs, it seems, are joit as busy as ever. The sound of the threshing machine and the roll of the mill wagons show that onr peo ple are stowing àway thé essentials of life for their familiet. This ia a season of leisure with j onr school girls, and they are snrely eujoying thè privileges of snoh a va cation. Mrs. 0. H. Chilton visited the ! home of Mr. S. T. Morris last week. The gardens in this section are very bountiful this season. The writer does not know as the water melon prosperi is os promising ah it nhnaily is, as there are none about  he tillage yet. Mr. Canada, of Halifax, visited friends in this section last week. A good meeting is repurled from Reedy Spring, conducted by Mr. Cbookolett, who has worked very! faithfully. Prof. Hollens, of Hali fax, bas conducted the musical tide ot the meeting. The infant son of Mr. Hunter Wooldridge and Hester Nash Wool- ridge died last Snnduy at their home, and was buried in the old family graveyard. We all sympa thize with this y ung couple in their sad bereavement. . Mrs. Barkesdale is expecting rela tives and shortly. Miss Jennie Elliott is visiting her toiece, Mrs. 8. T. Morriss. 1 Mrs. R. C . Flehman and two lit tle sons, Raymond and Edwin, are visiting Mr. J . H. Morris. With best wishes to-The Times and its readers,"}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "va cation. Mrs. 0. <mark>H</mark>. <mark>Chilton</mark> visited the ! home of"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "va cation. Mrs. 0. <mark>H</mark>. <mark>Chilton</mark> visited the ! home of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [881.72, 1141.98, 1057.27, 1441.99], "bbox_id": "0cc0b56e82", "file": "AppomattoxNewspapers_1922-1923a_0091.pdf", "page": 1, "text": "IN the Clerks Office of the cirouit Court of -t-the County of Appomattox, on the Slat day of Augnit 19SS Nannie Harvey and C M Harvey.. against George J Glover, am anda D. Harris and William Harris, her husband, Fannie Har den and William Harden, her husband, Ger trude M Willis and Herbert Willis, her hus band, H arry K Glover, You. ha Jones ard Carence Jones, her husband, Florence Chilton Charles W. Glover, ........... Defendants Tbe object of this suit is to have partition of a tract of land lying in Bouthside District Appomattox county. V a.,about 1 miles south ofAppom attox C. H., which Charles Glover died eeized and possessed, by one of tbe modes provided by law, containing 10U acres more or less. . . . I And an affidavit baving been made and filed that tbe detendanta, George 3 Glover, Amanda D Harris and WilllamHarrMher bus- band,Fannie Harden and William HSrden-,ber husband.Gertrude widis and Herbert W ills,. her husband, Harry 11Glover, and Youtna Jones and i lareuce Jones, her husband Chas W Glover and F l o r e n c e C h 11 t o n arc not residents of the titate of Virginia I it is ordered th at they do appear here within ten days after the aue publica tion hereof, and do what may be necessary to protect their interest in this suit. And it is lurther ordered th at a copy hereof be published once a week for four successive weeks in the Times Virginian, a newspaper published in the county of Appomattox, and that a copy be posted a t the front door  of the Court nouse of thiB county on or before the 21st day of Aug. 1922, th at I being the next succeeding rule day after this order was entered. 1 A CopyTeste C. W. SMITH, Clerk. A. H. Clement p i TINNING and PLUMBINGl1-"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "miles south ofAppom attox <mark>C</mark>. <mark>H</mark>., which Charles Glover died"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "miles south ofAppom attox <mark>C</mark>. <mark>H</mark>., which Charles Glover died"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [669.6, 1021.09, 828.32, 1341.22], "bbox_id": "1b0938a07c", "file": "AppomattoxNewspapers_1922-1923a_0024.pdf", "page": 1, "text": "How bout a booster club for Appomattox? r N the Clerks Office ot tne Circuit Court of the Cuuntyof Appomattox, on the 22nd day ot April 1922 Charles W. Glover,.... .................. Plaintiff, against George J Glover, Amanda D. Harris and William Harris her husband, Fannie Har den and William Harden, her husband. Ger trude M Willis and Herbert Willis, her hus band, Harry K Glover, You.ha Jones and Clarence Jones, her husband, Horence Chilton and others- ............ . Defendants The object of this suit is to have partltwn of a tract of land lying in Southside District Appomattox county. Va.,about 4 mies south of Appomattox C. H.. which Charles Glover died seized and possessed, by onerof the modes provided by law, containing 10U acres more or less. . . , Aud an affidavit having been made and filed that, the defendants, George J Glover, Amanda D Harris and WilliamHarris,her hus band, Fannie Harden and William Harden,her busband.Gertrude Wi.lis and Herbert Willis, ber husband, Harry K G.over, and Youtha Jones aud Clarence Jones, her husband and F l o r e n c e C h i l t o n a re not residents of the State of Virginia it is ordered that they do appear here .vitbin ten days after the aue publica tion hereof, and do what may be necessary to prote! t their interest in this suit. And it is further ordered that a copy hereof be published oncera week for four successive weeks in the Times Virginian, a newspaper published In the county of Appomattox, and that a copy be posted at the front door of the Court uouse of this countv on or before the 1st day of May 1922, that being the next succeeding rule day after this order was entered. A CopyTeste C. V- SMITH, Clerk. A. H. Clement p q ,  . 4 26 4w C OMMISSIONBRS OFFICE, Appomattox, Va., April 17,1922"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "mies south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "mies south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1777.46, 1386.62, 1950.91, 1547.37], "bbox_id": "612d269a13", "file": "AppomattoxNewspapers_1943-1947a_0319.pdf", "page": 1, "text": "Funeral services f  Mr. Raleigh H Chilton, Sr. were held at Con cord Depot, Va. November 22,con ducted by Dr. R. U. McNair and Rev. J. W. Inge. Interment was in Concord Cer.ytery. Active pall-, beare were J. 0. Robcrcaon, W. H. Robertson, John D. Johnston, Dudley Johnston, C. R. Carson, J. G. Redford. - Honorary pallbearers v.re W. A. Drinkard, Frank Drinkard,  M. Shirey, T. W. Evans, Herman Cardwell, Dr. R. H. Cross, L. B. Franklin, Sidney Mason. Mr. Chilton was born  Aw mattox County September 19,1869."}, "highlight": {"text": {"matched_tokens": ["H", "Chilton"], "snippet": "services f  Mr. Raleigh <mark>H</mark> <mark>Chilton</mark>, Sr. were held at"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Chilton"], "snippet": "services f  Mr. Raleigh <mark>H</mark> <mark>Chilton</mark>, Sr. were held at"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1250.64, 363.04, 1549.66, 402.09], "bbox_id": "26f929e2a6", "file": "AppomattoxNewspapers_1947-1949a_0246.pdf", "page": 1, "text": "FOR SALE One good used  a c c i d e n t w h S  J Range. One oil stove. Mondav  Mrs. W. C. Chilton, 5-13-ltc Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["c", "c", "h", "C", "Chilton"], "snippet": "FOR SALE One good used  a <mark>c</mark> <mark>c</mark> i d e n t w <mark>h</mark> S  J Range. One oil stove. Mondav  Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, 5-13-ltc Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["c", "c", "h", "C", "Chilton"], "snippet": "FOR SALE One good used  a <mark>c</mark> <mark>c</mark> i d e n t w <mark>h</mark> S  J Range. One oil stove. Mondav  Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, 5-13-ltc Appomattox, Va."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [899.05, 744.13, 1055.73, 955.09], "bbox_id": "06140b9b61", "file": "AppomattoxNewspapers_1922-1923a_0103.pdf", "page": 1, "text": "f N the Clerks Office of the Circuit Court ot Athe County of Appomattox, ou the 21st day of August 192  Plaintiffs Nannie Harvey and C M Harvey. against George J Glover, Amanda D. Harris and William Harris her husband, Fannie Har den and William Harden, her husband, Ger trude M Willis and Herbert Willis. her hus band, Harry R Glover, You.ha Jones a d Carence Jones, her husband, ilorente Chilton Charles W. Glover,.- .......Defendants The object of this suit is to have partition of a tract of land lying in Southside District Appomattox county, Va.,about4 mi.es south of Appomattox C. H.. which Charles Glover died seized and possessed, by one of the modes provided by law, containing 100 acres more or less. , - And an affidavit having been made and filed that the defendants, George J Glover, Amanda D H arris and WilliamHarrisher hus band,Fannie Harden and William Harden,ber husbaud.Gectrude vv tills and Herbert W His, her husband, Harry K Giover, and Youtha Jones and  lareuce Jones, her husband Chas W Glover and F l o r e n c e C h i l t o n are not residents of the State of Virginia it is ordered th at th e  do appear here within ten days after the aue publica tion hereof, and do what may be necessary to prote t their interesc in t lus suit. And it is lurtner ordered th at 9 . copy hereof be published once a week for four successive r . . __ x . . .. i ____ m i M i i i n , . i n i n i i  l i A u r a n a i H l T"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "mi.es south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "mi.es south of Appomattox <mark>C</mark>. <mark>H</mark>.. which Charles Glover died"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1738.53, 1344.64, 2559.48, 1429.99], "bbox_id": "ee8df577dc", "file": "AppomattoxNewspapers_1912-1915a_0486.pdf", "page": 1, "text": "F alling R iver sohool reopen-  m iles from B. R. depot, B. F. ed the 4th. All pnpils and J? L aad r  -,  t  . -------- ,.. _ . ... . ___ . __ i lays well for farm ing. hill reached for it, through mistake I teacher, Miss Maggie Chilton,  or a small he got hold of a bottle of iodine I la mfcd  have spent a pleas- There is a sm all cabin on place. I and as his eyesight i not the best Ian  holiday. This school is  Ä  m e n t s   06 in  W i n c h e s t e r N u r s e r y C o . , W in c h e s te r ,T e u he did not notion his error nntil he  ettinK on and we are annual paym ents. J f m S Ê  Ge I enjoying the privilege of 8uchl172c 19 acres 5001"}, "highlight": {"text": {"matched_tokens": ["c", "h"], "snippet": "in  W i n <mark>c</mark> <mark>h</mark> e s t e"}}, "highlights": [{"field": "text", "matched_tokens": ["c", "h"], "snippet": "in  W i n <mark>c</mark> <mark>h</mark> e s t e"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.35, 935.19, 2030.12, 1262.49], "bbox_id": "4cb0946e77", "file": "AppomattoxNewspapers_1943-1947a_0556.pdf", "page": 1, "text": "Depot visited in the home of Mr. and Mrs. W. H. Robertson recently. Miss Emma Johnston, of Rich mond visited her par. n s, Mr. and Mrs. Dudley Johnston last week. Miss Erna Dickerson is spending the holidays with her parents. Mr. and Mrs. George Tureman recently vis.ted in the home of her parents, Mr. and Mrs. W. E. Oicnerson.  Miss Shirley Walton spent sever al days last week in the home of Mrs. George Carson. Mr. and Mrs. E. H. Frazier and son, of Altavista spent Wednesday with Mr. and Mrs. W. E. Dickerson. Miss Clarkie Cheatham and _________  brother, Auibrey spent Wednesday q ! r . Turnes with their sister, Mrs. W. C. Chil- ton.  Mis. Tilden Lee and children spent Christmas vivh her parents, . Rev. and Mrs. William Moon, of jr. and Mrs. Wash Wheeler, of Halifax and Roy Moi.., of V.P.I., Rustburg. visited Mr. and Mrs. W. A. Moon _ _ _ _ __ _ __ __ ___ last week. Mr. and Mrs. C. L. Carson, Mr. epb Terry, H. T. Terry, J., ,  __ _  , a,nd Mrs. George Henning3 and Ge0rge Abbitt Terry. Mr. and Mrs. W. C. Chilton and sorlj jiss Frances Jennings, Thom as Jennings and Thornhill Carter, Recent guests in the home of and Miss Lee Carter were dinner Mr. and Mrs. J. D. McDearmon guests of Mr. and Mrs. G. P. Jen- were Mr. and Mrs. li. Y. Spencer and daughter, of Appomattox, and"}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark> and sorlj jiss Frances"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark> and sorlj jiss Frances"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2305.67, 371.43, 2478.88, 870.32], "bbox_id": "c531f462eb", "file": "AppomattoxNewspapers_1952-1954a_0027.pdf", "page": 1, "text": "Demonstrations for the month of July will be Tricks with Cakes and Frostings, given by Food Leaders, and Miniature Arrangements of Flowers by Federation Goal Leaders. Program Development leaders in each club will lead a discussion on program planning for the 1953 Club Year. Monday, July 7Radio broadcast WFLO 1030 a. m. The Pamplin Junior and Senior 4-H Club girls will meet at 200 p. m. with Nancy Hall. The demonstration will be Se lection and Making Pocketbooks and Accessories. Tuesday, July 8Clyfer Hill Home Demonstration Club will meet at 200 p. m. with Mrs. Vernelle Mitchell. Mrs. L. N. Herncall will be in charge of demonstration. Lee Home Demonstration Club will meet at 730 p. m. with Mrs. H. A. Gurney. Demonstrations will be given by Mrs. Gurney. Mrs. Leslie Gordon and Mrs. Bennie Beale. Note change in date and hour of meeting. Wednesday, July 9-Susan Harr Home Demonstration Club will meet at 200 p. m. with Mrs. E. R. Fer guson. Demonstrations will be given by Mrs. W. C. Chilton, Mis. John Rector and Mrs. Ferguson. Thursday, July 101Stonewall Home Demonstration Club will meet at 200 p. m. with Mrs. E. M. Strat ton. Demonstrations will be given by Miss Edna Adcock, Miss Verna Harding and Mrs. Martin Krus. The Rocks Home Demonstration Club will meet at 73-0 p. m. with Mrs. Lowell Fleshman. Demonsstrations will be given by Mrs. J. H. Ranson, Mrs. Rhomy Wilson and Mrs. Mildred Inge. Friday, July 11.-Country Lane Home Demonstration Club will meet at 200 p. m. with Mrs. Byron Cole. Demonstrations will be given by Mrs. Lelia Jones,Mrs. John Cole and Mrs. Dean Conner."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "given by Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, Mis. John Rector and"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "given by Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, Mis. John Rector and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1614.96, 1450.79, 1771.28, 1620.09], "bbox_id": "ece03c6188", "file": "AppomattoxNewspapers_1915-1918a_0502.pdf", "page": 1, "text": "D e a t h o f C h a p m a n C h g lt q q . This aged and distinguished cou- tvuun passed ay at his home qear here yesterday iu the 81st year of his age. For ipany years he had been confined to his bed as a result of a fail. He served tbe county as superintendent of public schoos, and was a gentleman of thanv admirable qualities- He is  urv ved by his wife, who was a Miss Elliott, and eight children Raleigh, John, William, Mrs. Leslie Morris. Mrs. Charles Binford, Mrs D. M. Rotertson, Misses Riesa and Maggie Chilton. Remains interred to day at Salem Methodist church."}, "highlight": {"text": {"matched_tokens": ["C", "h"], "snippet": "t h o f <mark>C</mark> <mark>h</mark> a p m a"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h"], "snippet": "t h o f <mark>C</mark> <mark>h</mark> a p m a"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [135.6, 421.44, 326.62, 1078.93], "bbox_id": "ab4c512934", "file": "AppomattoxNewspapers_1902-1905a_0517.pdf", "page": 1, "text": "crop. We have a very flourishing Sab bath School at Falling River school- house and much interest is taken in this good cause. It shows that a effort is being made for Christ. Miss Carrie Barksdale is conttm plating a trip to Halifax. We tre in hopes that her stay there will be of short duration. Mr. Howard Marshall is still j with his home people we are .glad to see his cheery countenance among us again. Miss Jennie Cheatham is still ill we would be so glad to see her well again. Mr. W. C. Chilton visited his sis ter, Mrs. L. T. Morriss last week. Some of the sporting men have beuu quite successful seining recent ly in old Falling. Mr. and Mrs. Bddia Dickerson made a flying trip to see her peopl- last, week. The services at Cen ral wer- largely attended last Sunday. Mr, Hulble seems to be very much be loved by his people. The A. 8 . of E. in this section u still in progress and we are in hope all the farmers will reap some good for the effort which is being mad for the betterment of t ieir Condi tion. Much interest is manif sted in this uuion. Mes-rs J. W. and L. T. Morriss report good prices on tob icco Iasi week. Our gardens are growing nicely, but owing to the cool weather they are ate. How to W ard Off Old Age. The most successful way of ward ing off the approach of old ago  h to maintain a vigorous digestion. This can bo done by eating only- food suited to your age and occup.i tion, and when any disorder of the stomach appears take a dose _ of I Charaborlains Stomach and Liver I Tablets to correct it. If you have I a weak stomach or are troubled I with indigestion, you will find these I Tablets to be just what you need.  For sale by J. R. Atwood,! Appomattox, R. J. Carter, Prospect,  E. F, Glover, Evergreen."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "well again. Mr. W. <mark>C</mark>. <mark>Chilton</mark> visited his sis ter,"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "well again. Mr. W. <mark>C</mark>. <mark>Chilton</mark> visited his sis ter,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [879.13, 493.27, 1042.05, 1411.58], "bbox_id": "32a07cd344", "file": "AppomattoxNewspapers_1898-1902a_0230.pdf", "page": 1, "text": "Concord. A mass-meeting of Independents, composed of citizens of Appomattox and Campoell counties, assembled at this place on Friday last to nom inate a  floater candidate for the House of Delegates for these two counties, in opposition to the regu lar Democratic nominee, Mr. J . K. Horsley, of Appomattox. Mr. C. A. Chilton, of Appomattox, was nomi nate?! by acclamation. The nomi nee was instructed to support Gov ernor Janu-s Hoge Tyler for United States Senator. On Saturday the Democratic pre cincts primary in-, t in Wood-on Hall to elect delegates to tin? Rust- burg convention of the 30tli instant. Mr. Bradley W. Babcock was niad chairman, and Major Jas. 1. Kvat. secretary. Messrs. Watson Caldwell and T. Howard Fisher were elected as delegates to the convention, and Were instructed Itv the primary t support Captain J . J. Feather-ton for tile House of Delegates. The new Salem Methodist Epis copal Church, five miles east of t!  place, will be dedicated on Sunda i next. The pastor, Rev. C. 11. Gal j loway. informed your correspondent ! that the dedicatory sermon will I  preached by Rev. James Cannon j pliucipal of the Black-done Feiiia! Institute. Rev. Mr. Galloway has jusr. closed I a series of meetings at Earlys Cha pel, which resulted in the convei sion of sixteen persons. Miss Sal lie Abbott is critically ill of brain fever at home at Edgewood Drs. Abbott and Onld are constant ly at her bedside. Miss Mollie Ingram, who has beet visiting friends in your village mu , Pamplin City, came home to-dn . Misses Helen Beckham, ot Rich mond. anti Mnmb lorp-r, f 1 as- cade. Va., accompanied bv Mr. Paul Wharton anti Professn- J- G. Kl ber. made a visit on the. 2Hd Mist, to tin- surrender groltnns. The Messrs. Ballou are tli- guests of Dr. Ouhl at this place. Mr. Truman Hubbell, living lear this place, met with a very phinfui accident on Tuesday afternoon. Mi- horse fell with and on him. cnisL ing his right, ankle. Doctor T. W. Evans was called in to render stir gical assistance. Messrs. Wm. Steele and Charlie Cross, knights of the key at Tucker aud Ivor, respectively, were in town for a few days last week. Mr. N . Ii. Wharton returned on Tuesday from Wakefield, where be has been stationed for two months. Misses Ruby Woodson and Grach- Jones, of the Ilill City, ate guest.- of Miss Sullie Arrington. A t a meeting of the school hoard of Rnstbnrg district on Friday last. Miss Martha Evans was elected prin cipal, and Mrs. Evie Haden assist ant, of the Concord Graded School We claim to be t he banner town of Southside Virginia in the sumac- traffic. Mr. George Jones, agent for C. H. Heald  Co., Lynchburg, ha- purchased more than 300.000 -Os This indi stry places in circulation from 500 to 700 per week. Rev. W. F. Fisher, pastor of the Fourth-Street Baptist Church of Portsmouth, returned to that, eiy on Friday last. m Dr. Lyle Onld has purchased thi old parsonage from Mr. Lanier Sta ples. Quin N u n c ."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "George Jones, agent for <mark>C</mark>. <mark>H</mark>. Heald  Co., Lynchburg, ha-"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "George Jones, agent for <mark>C</mark>. <mark>H</mark>. Heald  Co., Lynchburg, ha-"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.5, 1037.84, 2172.74, 1625.32], "bbox_id": "42382b9800", "file": "AppomattoxNewspapers_1949-1952a_0563.pdf", "page": 1, "text": "Carwile, Mr. . T. Moses, MrMes. W. W. Burke, Mr. J. A. Burke, Mr. and Mrs. A. R. Harwood, Jr. Mrs. Calvin Robinson, Mr. and Mrs. Fred Robertson, Mrs. Roger Norfleet. Famplin Mr. Cecil Ligon, chair man Rev. T. L. Simpson, Mrs. Ru by Clark. Hixburg Mrs. E. M. Sears, chair man Mr. Henry Covington, Mr. Emmet Gowin, Mr. John W. Hix. Hurtsville Mr. Edd McPhillips, chairman. Piney Ridge Mrs. Curtis G. Rand, chairman Mrs. Ed -Baldwin, Mrs. Claten Beal, Mrs. Lucy Richardson. Rocks Mrs. John H. Ranson, chairman Miss Cassie Baldwin,Mrs. C. S. Ranson, Mr. Edward Ranson, Mr. Thomas Ranson. Evergreen Mrs. John K. Hamil ton, chairman Mrs. H. C. Staples, Mrs. R. W. Staples,Mrs. W. C. Paul ette, Mrs. Ruth Jennings. Oak Grove Mrs. W. D. Hunter, chairman, Mrs. C. R. Rush. Spring Mill Mrs. F. J. Nash Sr., Mrs. Herman Nash, Mrs. W. W. Overton, Mrs. Raymond Rosser. Nashs Store Mrs. E. R. Fergu son, Miss Lorraine Stanley, Mrs. W. W. Overton. Susan Harr community Miss Ava Chilton, chairman. Spout Springs. Mrs. Ida McCann, Mr. F. O. Jones, Mrs. George C. Collins. Reedy Springs Rev. L. P. Brown, chairman Mrs. Gladys Reynolds, Mr. O. T. Jamerson, Mr. T. E Cheatham. Stonewall Miss Annie T. David son, chairman. Beckham Mrs. Joe Martin, Mrs. Robert Martin. Oakville Mrs. Clark Moore, chair man Mrs. Melvin Drinkard, Mrs. Aubrey Drinkard, Mrs. Ruby Lewis, Mrs. Otha Martin, Jr. Tower Hill Mrs. Malcolm Book er, chairman Mrs. Marvin Reynolds. Hollywood Mrs. Richard Webb. Vera Mrs. Marjorie S. Coving ton, chairman Mrs. A. W. Coving ton, Mr. George F. Abbitt. Route Three Mrs. F. F. Carr, Mrs. H. A. Torrence. Mt. Herman Mrs. Bennie Beale, hairman Mrs. J. B. Lucado."}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "Hamil ton, chairman Mrs. <mark>H</mark>. <mark>C</mark>. Staples, Mrs. R. W."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "Hamil ton, chairman Mrs. <mark>H</mark>. <mark>C</mark>. Staples, Mrs. R. W."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.74, 946.26, 1922.1, 1077.49], "bbox_id": "fdc028a094", "file": "AppomattoxNewspapers_1926-1933a_0194.pdf", "page": 1, "text": "C h ilto n S chool 7th grade  Ernest Durham Chapman Chilton, Archer Webb 5th grade-Robert Chilton. 4th grade-Hazel Chilton, Mar tin Webb, Ruth McFadden. 3rd grade-Lizzie Cyrus, Fran cis Thomas. 2nd Grade-Lardon Thomas John Paris, Lois Chilton, Robert Webb, Edward Cyrus."}, "highlight": {"text": {"matched_tokens": ["C", "h"], "snippet": "<mark>C</mark> <mark>h</mark> ilto n S chool"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h"], "snippet": "<mark>C</mark> <mark>h</mark> ilto n S chool"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.74, 362.2, 620.74, 1795.51], "bbox_id": "c22bc15a56", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "By order of the Electorial Board of Appomattox County, all Regis tration Books in Southside District shall be purged as of October 4 1954. The names listed below have been removed from the Registration Books, Courthouse Precinct, South- side District, Appomattox County Virginia for reasons of death transferred or moved. This action is provided for and ordered under Sec tions 24-94 through 24-107 of the Virginia Election Laws as amend ed. Any one who can prove conclus ively that any of the names listed below have a right to be on the Registration Books of said County of said district, they shall make such information available to the undersigned registrar. JAMES H. LUCADO REGISTRAR. E. B. Abbitt W. A. Agee A. W. Almond Henry C. Almond Leonard Anderson T. F. Akers C. N. Abbitt J. Russell Abbitt J. R. Adams R. M. Almond T. Dyer Almond Daniel Almond Mrs. Patricia Almond Helen West Alvis Vergie L. Almond Mrs. W. M. Almond Mrs. R. F. Akers W. W. Brown J. W. Blackwell F. B. Blackwell Homer W. Blackwell John A. Booth K. V. Barlow H. H. Bazemore Harold W. Babcock George W. .Bass Alfred Bryant D. J. Berger L. I. Bryant Henry H. Beale William Boyce Alfred L. Barlow R. W. Burkey W. L. Brown H. M. Burge George P. Blackwell J. O. Babcock R. H. Bates O. S. Burnett Jerry A. Burke, Jr. P. M. Burton R. F. Burke, II F. E. Babcock R. H. Baber R. B. Boney, Sr. Berkley Brown H. 0. Blackard Jennie L. Blackwell Eula M. Burke Mrs. Myrna S. Bingham Mrs. Sallie Binkley Mrs. Julia A. Burton Mrs. Jessie Fitzgerald Baird Pearl E. Berger Mildred Babcock Mrs. K. V. Barlow Dorothy Buchanan Mrs. Nannie V. Blackwell Mrs. Ila Jean Buettner Miss Ila V. Buchanan Majorie B. Bailey Mrs. Martha A. Baber Mrs. Bertha L. Baber Addie Bates Mrs. Thelma L. Bazemore Katherine Burge Sara Beasley Mrs. Stanley Blystone Mrs. Mozell D. Boyce Mrs. R. B. Boney, Sr. J. W. Baber W. C. Chilton, Jr. Julian M. Campbell William A. Clark Tucker Cheatham J. W. Cawthorn, Jr. J. H. Cheatham L. Crawley J. B. Chilton J. T. Cole J. S. Cyrus E. P. Carson W. P. Coleman James L. Caldwell J. W. Caldwell J. T. Coleman J. M. Clapp Harvey A. Caldwell Wiley Coleman M. Earl Carson T. L. Christian R. L. Carter Archer A. Caldwell N. H. Cheatham E. H. Cawthorn Wilson R. Cole T. A. Clark S. H. Collins Twyman Conner R. E. Clapp Harry P. Clark W. Twyman Coleman P. W. Coleman W. A. Coleman W. W. Carter John L. Cates, Jr. G. A. Chocolate Enid M. Clapp Robert Cawthorn W. L. Coleman H. S. Coleman E. G. Cheatham T. E. Childress J. R. Conner John R. Cheatham Roy Conner D. L. Cawthorn F. T. Cawthorn, Jr. C. C. Cawthorn J. D. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "J. W. Baber W. <mark>C</mark>. <mark>Chilton</mark>, Jr. Julian M. Campbell"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "J. W. Baber W. <mark>C</mark>. <mark>Chilton</mark>, Jr. Julian M. Campbell"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [576.95, 1257.97, 705.39, 1390.61], "bbox_id": "584243846c", "file": "TimesVirginian_1980a_0299.pdf", "page": 1, "text": "BOOK FOR SALE C. H. Chiltons Union Academy Records 1860 - 1874. School was located near Spout Spring. 9Iames of over 250 pupils from the surrounding area are listed. Photo included. Price 7.00 plus 60c postage. Order from Miss Eleanor Chilton, 2Q4 Ver Blvd., Lynchburg, 4501. V 519-18-u"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "BOOK FOR SALE <mark>C</mark>. <mark>H</mark>. Chiltons Union Academy Records"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "BOOK FOR SALE <mark>C</mark>. <mark>H</mark>. Chiltons Union Academy Records"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1969.84, 497.62, 2134.09, 1268.82], "bbox_id": "7c1361ca0a", "file": "AppomattoxNewspapers_1918-1922a_0072.pdf", "page": 1, "text": "B irth d a y P a rty  On Saturday evening from 430 to 730 oclock, Mr. and Mrs. H. B. Marshall celebrated their little girls, Billie Eppes fifth birthday in the presence of her mother, Mrs. Nettie Eppes, of Lynohburg, and a host of friends. Just after the arrival of the guests, the little oues were invited out on the lawn where they were highly entertained by Ifiss Florence E. Caldwell with games and folk dances Miss Nellie Robertson recited, after which music was render ed on the piano by Misses Bernardino Haycook a n d Nellie Robertson, and little Miss Billie Eppes sang a solo. Then most delightful refresh ments of ohicken sandwiches, deviled eggs, pickles, several kinds of cake, lemonade and iQe oream were served in ele gant style. Billie received many nic gifts and among them was a gold braoelet, silver napkin ring, silver mug, several pieces of out glass, a childs .three- piece setknife, fork a n d spoona china tea set and numerous other presents. Those present were Mrs. Nettio Eppes and Evelyn Rob ertson, of Lynohburg Mr. and Mrsi R. L. Haycook and daugh- ter, Bernardine, of Washington, D. O. Mrs.- W. D. Browning, son anddaughter and Juditha Howerton, of Richmond Mrs. J. B. Chilton and daughter, Virginia Mrs. Will Chilton and daughters, Nannie Sue, Elean or and Hallie Mrs. Q. 8. Jones aad daughter, Jane Oneill Mrs. Riohard Smith, daughter and son, Frances and Richard Mrs. C. H. Shields, daughter and sons, Katherine, Sam and Albert Mrs. 8. S. Shields, Billies grandmother Frances and Jack Nowlin Helen, Sarah, Frances and Rachel Dickerson Lena, Lucille, Sarah and William Bates Irene Fur- bush Billy Steele Misses Nellie and Minnie Robertson Florence, Grace and Nannie Caldwell, and Messrs. John Rector and John Robertson, jr. After many pleasant hours"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "Frances and Richard Mrs. <mark>C</mark>. <mark>H</mark>. Shields, daughter and sons,"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "Frances and Richard Mrs. <mark>C</mark>. <mark>H</mark>. Shields, daughter and sons,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.95, 286.67, 562.82, 947.71], "bbox_id": "7eb9b0f336", "file": "AppomattoxNewspapers_1918-1922a_0282.pdf", "page": 1, "text": "At a meeting of the Board held at Cleric office Dec. 8present w H Llgou, L  Smith and 8 E Andenon, the following claim were allowed POOR HOUSE AND PAUPERS G W watgon, board and care of In mate to Dec. 16 80 00 Joe Woolrldge 3 00 Mr Sallie Reger 8 10 Mr Nannie Warner 2 60 C Roach Mann 4 00 Kate Petty for Frank Thornton 2 60 Ann John  60 Mrs Anna B Burton 2 CO Marshy Hancock 2 00 Marla Scruggi 2 00 Lou Conner 8 00 Ella Elliott 2 00 Humphrey North 2 60 Ossie May Flesh man 8 00 John Denni for daughter 6 00 Robert Fleshman 2 60 Sarah Giles, Dec. and Jan. 10 00 Ed Forbes 2 60 CONVICT ROAD MAINTENANCE 18 00 Henry Scruggs, painting bridges C, H. AND YARD D L Martin, cleaning, eto. SCALPS C W Smith to pay for scalps ELECTIONS A H Clement, printing ballots FGiWjLH KILLED Mrs Annie L Robertson, 2 turkeys CLERKS OFFICE . Everett Waddey CL Modern Index Corporation M L Barman, lights Appox Telephone Co T W Odor, kindling wood MISCELLANEOUS C W Smith, making and certifying list of oounty and district officers 8 L Ferguson, legal service regarding county farm B B Anderson, services as spoolal agent of Board L B Smith, same J w Flood, permanent improvements to office COMBS VIEWING ROAD E P Carson, locating road on W J Goodmans land J T Whitten, same J B Chilton, same A H Howerton, same H B Marshall, same 8 B Anderson, agent of the Board to look after the repairing of the flu at Bent creek bridge, made a Anal report to the Board wbioh tbe Board accepted whereas, under the law the Oounty Treas urer b entitled to have an office furnished him, which office la on the northern wing of tbe courthouse and W here as. sinoe Mr. Burkes Incumbency in office as treasurer he has not used this office and the same oas been used p?rt of the time by courtesy of Mr. Burke by H D Flood and was then turned over to 8 L Ferguson by courtesy of Mr. Burke sinoe bis election and Qualification at State senator, wbioh vacated his office as Commonwealths attorney and Whereas, tbe offices in the Clerks office building bad been formerly ooeupled since their completion by H D Flood as Common wealths attorney, and then by Mr. Fergu-"}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "Henry Scruggs, painting bridges <mark>C</mark>, <mark>H</mark>. AND YARD D L"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "Henry Scruggs, painting bridges <mark>C</mark>, <mark>H</mark>. AND YARD D L"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1626.49, 544.63, 1798.46, 971.02], "bbox_id": "e78d7c5628", "file": "AppomattoxNewspapers_1955-1957a_0035.pdf", "page": 1, "text": "Appomattox High School opened its basketball season Monday flight, with a thrilling 56 to 54 victory over Phillips Business College. The game was close all the way. Appo mattox was one point behind after the first quarter, at 16 to 15, and trailed 24 to 23 at the half. At the end of the third period, A. H. S was ahead by one point, 36 to 35 During the final period, .Phillips set a hot pace and at -one time was 13 points out in front. It was at this stage .that the Blue Hornets proved that they could play good basket- bal under pressure Holderman tied the score with 1 minutes to go and Carter made the winning has ket in the last 15 seconds. Bradley Babcock was high scorer for A. H. S., with 22 points. Boots Carter had 19. Coach J. L. Byrd declared, I was very pleased wjth the showing of the team. We made a lot of mis takes, but with more practice and several more games, we will be a more polished team. Box Score G F P T Beale, f. 0 0 0 0 Carter, f. 8 3 0 19 Holderman, f. 1 0 0 2 Conner, F. f. 0 0 0 0 Doss, c. 3 8 2 9 Chilton, c. 0 0 0 0 Beane, c. 0 0 0 0 Ferguson, g. 2 0 2 4 George, g. o. 0 0 0 Babcock,. g. 8 6 4 22 OBrien, g. 0 0 2 0 Conner, B., g. 0 0 1 0 Totals 22 12 11 56"}, "highlight": {"text": {"matched_tokens": ["Chilton", "c"], "snippet": "3 8 2 9 <mark>Chilton</mark>, <mark>c</mark>. 0 0 0 0"}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "c"], "snippet": "3 8 2 9 <mark>Chilton</mark>, <mark>c</mark>. 0 0 0 0"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [570.67, 982.23, 902.66, 1838.39], "bbox_id": "80675a87c4", "file": "AppomattoxNewspapers_1898-1902a_0252.pdf", "page": 1, "text": "Appomattox Chapter, United j Daughters of the Confederacy, has I purchased a handsome new irjjn I eiice for the Confederate Soldiers I Cemetery. It is to be put up at happiest j tlllCe The cemetery will soon haye Semite made one of the speecllCof the.day, which was re-.j he appearance of careful attentio ceived witlKjvpplause. ft was M r. as the head-stones, flowers and ass first appearance before many ! mounds, etc., will be protected by this fence. The Chapter has w orked of this people and it is ,gfe to eay I aS5luou8lx ever since M rs, C. W. that Lynchburg and Campbell will fjunter gave a graphic description have an able and fearless represen-i.uf the dilapidation and utter neg- tative in Mr. Glass. Mr. Glass never was a candidate for political prefer ment, bnt the Democracy of his city recognized his ability and gave him the nomination without a strug- le on his part. Mr. Glass is en tirely a self-made man and lias by his studious habits and strict fidelity dimed the ladder of fame and sne- jess, until his people havp called him to serve them in a public way. The Democracy of Campbell and Lynchburg has honored itself by placing the standard iu Mr. Glass bauds. Senator Floods speech was de voted almost exclusively to the veil tilation of Mr. C. H. Chiltons re cord. who is the independent candi date for floater delegate from Appo mattox and tamp bell. He read anonymous let ers, which he charged Chilton with having written during the spring campaign four years ago these letters Mr. Flood declared were written for the purpose of inspiring a mob to assassinate him. He said he did not cifi-e to say anything against Mr. Chilton, hut the slanderous charges made iu a recent circular against the people of Appomattox should not go unanswered. He re viewed Mr. Chiltons record while superintendent of schools of this county and chaiged him with doc toring and changing the records of the board meetings. Mr. Floods speech was an eye-opener, and sounded the death-knell of the in dependents. Captain Featherstone, the nomi nee for the House from Canfpbell reviewed his record in the Ilous- last session, which appeared t hi satisfactory to himself and hear ere. and contrasted the meetings widen nominated the two candidates Hi charged that Mr. Evans, his oppo nent, was the candidate of tluvi people, that number having voted for him in the mass meeting at Hust- bn re. There was pleuty to eat and even one seemed to enjoy the occasion, and that a grand success and much good was done in the name ol Democracy is the vote of all, whose good fortuue it was to be present."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "veil tilation of Mr. <mark>C</mark>. <mark>H</mark>. Chiltons re cord. who"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "veil tilation of Mr. <mark>C</mark>. <mark>H</mark>. Chiltons re cord. who"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1548.26, 1360.79, 1722.64, 1780.72], "bbox_id": "31d5f5c9d7", "file": "AppomattoxNewspapers_1926-1933a_0365.pdf", "page": 1, "text": "AndrewsChurch Lewis L. Andrews and Miss Dorothy Louise Church, both of Petersburg, were married at Appomattox Circuit Parsonage July 5 by Rev. J. J. Clarke. SPOUT  spr in g Mr. John Dickerson is visit ing relatives at Spout Spring. Mr. Dan Dickerson and fam ily spent Sunday with relatives here. Mrs. J. H. Davidson, Mrs. L. W. Hawthorne and children spent the fourth with Mrs. W. A. Moon. Miss Erna Dickerson is visit ing Bluefield, W. Va. Mrs. Mary Ford, of Roa noke, is visiting Mr. and Mrs. W. A. Moon. Mr. and Mrs. D. H. Cyrus have moved into their new home here. Mr. Cyrus enter tained some of his friends at a pine chopping Saturday. I The Womans Missionary Society of Salem church was delightfully entertained in the home of Mrs. W. C. Chilton Wednesday afternoon. Mr. and Mrs. Elliott are vis iting home people here."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "home of Mrs. W. <mark>C</mark>. <mark>Chilton</mark> Wednesday afternoon. Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "home of Mrs. W. <mark>C</mark>. <mark>Chilton</mark> Wednesday afternoon. Mr. and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.91, 816.86, 1755.86, 1567.37], "bbox_id": "3087c287c7", "file": "AppomattoxNewspapers_1902-1905a_0228.pdf", "page": 1, "text": "Alias E tta B lo x to n s S tocking P a rty . On Wednesday evening, December 30, the hospitable home of Miss Etta Bloxton was the scene of one of the unique and enjoyable social events of the season, twenty-six invited guests being present W. D. Robertson and Miss Annie Jone, E. R. Jones and Miss Mary Hunter, Jno. Marshall and MissMittie Dick erson, H. R. Cheatham aud Miss Willie Hunter, R. W. Nowlin and Miss A. Robertson, W.C.Chitton and Miss Ava Morris,B.E.Cheatham and Miss Lena Morris, W. E. Dickerson and Miss Nannie Morris, Leslie Morris and Miss Bessie Chilton, Ormond Jones and Miss Vara How erton, W. H. Spencer and Miss Ella Cheatham, M. H. Hunter, Miss Bessie Glover and Miss Mary Rob ertson. The invitations were very appro priately sent out on stocking-snaped cards. The hostess received her guests at the door dressed as Miss Sant-a Clause, who looked quite bewitching in her gray locks and cap. Christmas verses had been printed on four cards, each of which being cut iuto six irregular pieces and distributed among the guests,- the same to be matched so as to read correctly when each groupe of eix had been brought together in proper manner, it was planned that each group sh.onld write a short Christmas story, a prize being offered for the best production. The fol lowing groups Mis Ella Cheat ham, Mss Annie Robertson, Wm. C. Chilton, Wm. Spencer ancf Mies Mittie Dickerson captured the prize, an automatic toy which afforded much amusement. While this merry-making Has go ing on in the parlor, Miss Santa Clause slipped out, returning a few moments later and announced that light refreshments would be served. Proceeding to the dining loom, Christina- candies were found upon the table, which constituted  light refreshments. Before the merry Crowd recovered from the joke, they were ushered into an adjoining roota which contained a  beanifuI and brilliant lighted tree,on which hungj small bright colored, stockings over flowing with goodies and a present for each guest. Dr. Bloxton, of Richmond, a genial brother of the hostess, was present and by his affa bility, contributed much to the pleasures of the evening. Each guest departed declaring Miss Blox ton a complete and most charming success in the role of Miss Santa Claus. And one had only to look into their faces to see the sam- light which shone there not many years ago, after a visit from the type of Santa Claus, who came down the chimney and filled the stockings by the mantel."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "Mss Annie Robertson, Wm. <mark>C</mark>. <mark>Chilton</mark>, Wm. Spencer ancf Mies"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "Mss Annie Robertson, Wm. <mark>C</mark>. <mark>Chilton</mark>, Wm. Spencer ancf Mies"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.78, 397.58, 1585.63, 615.72], "bbox_id": "5ac49c14d6", "file": "AppomattoxNewspapers_1908-1909a_0100.pdf", "page": 1, "text": "Afamily reunion was enjoyed at the home of S- E. Roberts Easter Sunday, about forty were present including children, grand children, great grandchildren, friends and neighbors. Mr. W. H. Robertson is much improved at this Writing. Miss Elnor Martin returned I home Sunday after a weeks visit to relatives and friends and relatives in Lynchburg. Mrs. W. C. Chilton, who has been ill for some time is better. Mr. J. B. Chilton, who under went an operation some time  ago is reported better hope he will soon be able to return home."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "in Lynchburg. Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, who has been ill"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "in Lynchburg. Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, who has been ill"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [503.77, 556.42, 665.32, 1415.22], "bbox_id": "b1df1656a9", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "A. iratto n  2, Mrs. T. H. Inge peach eg, 1, .Mrs. M. G. Sm ith 2, Mrs. G. G. Scheiller plume, 1, D. B. Moon qumuee, 1, Meg. M. C. Sm ith pears, 1. Mis. M. C. Sm ith 2, Mrs. J. G. Sm ith grapes, 1, Mrs. O. G. kJchofiler beans, 1, Mrs. H. G. Babcock 2, JL. B. Moon corn, 1, Mrs. G. M. S tratton 2, Mrs, W. J. T rent. JcUics Apple, 1, Mrs. A. H. Gregory cur rant, 1, Mrs. AX. C. Sm ith quince, 1 Mis. J. A. Stratton 2, Mrs. M. C Sm ith grape, 1, Mrs. J. A. S tratton 2, Airs. Bottle B ledsoe pear, 1, U. I n AobiLt 2, Mrs. AX. G. Sm ith plum, 1, Airs. G. ri. Stanley 2, Mrs. G. G. Scneltler sour pickle, 1, Airs. T. H, inge sweet pickle, 1, Mrs. W. A, Muon 2, M rs. T. H. Inge corn salad, i, xiuby Caldwell 2, Airs. K. V. B ar low, pickled onions, 1, Mrs. A. H, Gregory 2, Mrs. T. XI. Inge pickled peppers, X, Mrs. VV. X. Gills 2, Maggie Hix cucum ber pickle, 1, Mrs. H. G, Babcock 2, Mrs. T. H . Inge corn pickle, 1, Mrs. O. 1 m Scheffler 2, Mrs, M. O. Snm h peach pickle, 1, Mrs Bessie F oster 2, Mrs. A. H. Gregory chow chow, X, Mrs. M. C. Sm ith 2 Mrs. G. AX. Stratton soup m ixture, X Mis. M. G. Sm ith 2 , Mrs. Bessie Fo ter catsup, X, Airs. G. AX. Stratton 2 M rs., J. A. Stratton tom ato pickle, 1, Mrs. W. J. T rent 2, Mrs. W. A, Moon w aterm elon, 1, Mrs. W innie B ucaett 2, Mrs. J. A. S tratton Dixie rensh, 2, Mrs. Bessie F oster dried iruits, X, Ih o m as Babcock 2, Mrs, VV. J. T rent soap, X, Mrs. H. G. Bab cool, 2, Mrs. T. H. Inge cider, X, E m m a Goleman 2, Mrs. o . G. Scheif ler grape juice, X, Mrs. A. H. Greg ory 2, Alias Gucy Sm ith sau r k raut, X, F la n k H anenkrat 2, Mrs. it. G. Cald well plum butter, 1, Mrs. W. T. Steele 2, Mrs. W. T. Steele apple butter, I Mrs. K. G. Caldwell. Cooking Cake  F ruit, 1, Mrs. W. G. Brown 2, Airs. H. C. Babcock pound, X, Mrs, H. c . Babcock 2 , Ju lia H ancock sponge, 1, Onarlsey Upton 2, Mrs. J A S tratton angle lood, 2, Mrs. XG C. Babcock carom el, X, Miss Gizzie Irby devil lood, X, Mrs. G. T. Moses 2, Ciijirlsey Upton jelly roll, 1, A lyrtle Sm ith 2 , Mrs. J. A S tratton m arble I, Gizzie H arris 2, F rances Sm ith, chocolate naugate, X, Miss Gizzie Xroy golden, X, F rances Sm ith decorated, X, Mrs. H. C. Babcock ribbon, X, Mrs, G. AX. Stratton. Ides  apple, X, Mrs. G. G. Sm ith 2, Mrs. W. J. T rent peach, 2, Mrs, Bessie F oster chess, I, Mrs. W innie Buckett 2, Mrs. H. B. M arshall po- toia, 1, F rances Sm ith 2, D, B. Moon lemon, X, Mrs. W. G. D ickerson 2, v. Shirey caram el, X, Mrs. W. B. Caldwell chocolate, 1, Frances Sm ith 2, Miss E th ra M orris cocoanut, 1, Mrs. Sam Ferguson 2, Mrs. W . B. Caldwell dougnnuts, X, Gydia .Rog ers 2, Mrs. W. B. Caldwell cream puifs, 1 , liu th Caldwell cookies, 1 rra n e e s Gordon 2, J. K. Pulliam  candy, 1, Gongenia Patterson. Sally Gunn ist, Mrs. Bessie Foster. Breads. Soda Biscuit 1st, Mrs. Bessie F os ter 2nd Sallie Craig, B u tter Biscuit 1st, Mrs. Y. A Sclieffler 2nd, Mrs. W. J. Trent. l-real 1st, Mrs. G. O. Gordon 2nd, W. C. Chilton. Rolls 1st, Evelyn Brow n 2nd, Mrs. Winnie Puckett. Salt B read1st, Mrs. H. C. Babcock 2nd, Mrs. W innie Buckett. B. Biscuit 2nd, Mrs. W. P. Gills. G. Biscuit 1st, Mrs. H. B. M arshall 2nd, Airs. B. Foster. Fancy W ork. D resser set 1st, F rancis W agner 2nd, Mrs. J .S . Plunkett. Bed set 1st, Mrs. N. A W agner 2nd, Mrs. J. S. Plunkett. Gunch set 1st, Mrs. W alter Scott 2nd, Mrs. J. S. Plunkett. Cuff set 1st, Mrs. Joel H ubbard. Side B oard Cover 1st, Mrs. W innie P uckett 2nd Mrs. Jack Caldwell. Centerpiece1st, F rancis W agner 2nd, Mrs. J. B. Chilton. Centerpiece 1st, Mrs. David P lunk ett 2nd, Mrs. G. O. Gordon. Centerpiece 1st, Mrs. Jack Cald well 2nd, Mrs. M. C. Smith. Centerpiece 1st, Mrs. F ran k H an enkrat 2nd, R u th Caldwell. Cover 1st, Mrs. W innie Puckett 2nd, R uby H arris. A pron 1st, F rancis W agner 2nd,"}, "highlight": {"text": {"matched_tokens": ["H", "C"], "snippet": "G. Brown 2, Airs. <mark>H</mark>. <mark>C</mark>. Babcock pound, X, Mrs,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C"], "snippet": "G. Brown 2, Airs. <mark>H</mark>. <mark>C</mark>. Babcock pound, X, Mrs,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1464.51, 414.71, 1627.6, 633.56], "bbox_id": "2440510c6b", "file": "AppomattoxNewspapers_1926-1933a_0100.pdf", "page": 1, "text": "A family reunion was enjoyed at the home of S- E. Roberts aster Sunday, about forty were present including children, grand children, great grandchildren, riends and neighbors. Mr. W. H. Robertson is much improved at this writing. Miss Elnor Martin returned borne Sunday after a weeks visit to relatives and friends and relatives in Lynchburg. Mrs. W. C. Chilton, who has ieen ill for some time is better. Mr. J. B. Chilton, who under went an operation some time ago is reported better hope he will soon be able to return home."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "in Lynchburg. Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, who has ieen ill"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "in Lynchburg. Mrs. W. <mark>C</mark>. <mark>Chilton</mark>, who has ieen ill"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.38, 439.05, 1934.22, 628.06], "bbox_id": "1c963db79e", "file": "AppomattoxNewspapers_1936-1939a_0020.pdf", "page": 1, "text": "1935-1936 rhnCbf rlia Abbitt, Watkins Banton,- Charlie Carter, Spencer Garrett C h n T  dsey Winston Godsey Charles Gregory, -Thomas Kern, Law Luado 0tha Martin, Thomas Martin, Thurman Mayes, Willfsni Moon, Calhoune Moore, Harold Mor- ris, James OBrien, Thomas Odor, BoaId PIette, Alfred Torrence Noten Webb, Margaret Almond, Vir S I  Almond, Mary Carter, Iva Childress, Hazel Chilton, Bess Chris- tian, Henreitta Davidson, Mary Dav idson, Sarah Drinkard, Lorine Fer- guson, Ethel Gardner Margaret Gob- ble, Faye Etta Harvey, Jesse Har vey, Rachel Harvey, Ruth Hesson,  P es d!.nnlngl  Buth Jbe,. Thelma King, Elizabeth. LeGrande,  Edith Martin, Carolyr. Moses, Katie Rey-"}, "highlight": {"text": {"matched_tokens": ["C", "h"], "snippet": "Charlie Carter, Spencer Garrett <mark>C</mark> <mark>h</mark> n T  dsey Winston"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h"], "snippet": "Charlie Carter, Spencer Garrett <mark>C</mark> <mark>h</mark> n T  dsey Winston"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2404.55, 1118.6, 2572.42, 1582.73], "bbox_id": "4e3cc82c0d", "file": "AppomattoxNewspapers_1926-1933a_0494.pdf", "page": 1, "text": "1 SPOUT SPRING I o  --------- o SPOUT SPRING, June 1 5 - Miss Elizabeth Robertson has returned from a visit to rela  tives in Lynchburg. Mr and Mrs. I.itton Harvey and famiy, and J. W. C. Mar tin spent Sunday with Mr, and Mrs. H. B. Martin. The W.M.U. of Salem church met with Mrs. F. O. Jones Wed nesday. Mrs. Hattie Wentright has been visiting Mrs. W. H. Rob ertson. Little Betty Day is sick. . Billy McDearmon has been visiting in the home of Russel Cawthorne. Miss Christine Wheeler is visiting Miss Elizabeth Robert son. Mr. and Mrs. C. R. Morton, Billy Morton and Chap Adams were Sunday guests in the home of R. H. Bates. Mr. and Mrs. L. E. Martin, who have been sick, are im proving. Mrs. W. D. Robertson has re turned from the hospital. Billy Dickerson is home for the summer months. Mr. and Mrs. R. K. Lawson spent Sunday in the home of W. E . Dickerson. . , , Nancy Roberts is sick. Miss Nannie Sue Chilton is spending some time with her parents, Mr. and Mrs. W. C. Chilton.      Miss Eleanor Chilton is visit- ing in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>.      Miss Eleanor <mark>Chilton</mark> is"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton", "Chilton"], "snippet": "Mr. and Mrs. W. <mark>C</mark>. <mark>Chilton</mark>.      Miss Eleanor <mark>Chilton</mark> is"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [189.85, 511.08, 555.32, 630.33], "bbox_id": "abb3a2785d", "file": "TimesVirginian_1976_0179.pdf", "page": 1, "text": ". n  tiv p of Aooomattox. has traveled extensively, spending twenty years fo 166-1975. Through all these years, however, he maintained dose contact with Ms church. Promise Land Baptist C h u r c h , Promise Land. . resides in the home of Mr. and Mrs. Jackson in Spout Spring. o , i hntinn shown above were front row from the. left, Donald Jones, Flrmhmnn Joe Fleshman, Jr., James Fleshman, Mellisa Randolph, Edgar Chilon, as Clyde Randolph, jr., Henry Fleshman, Jr., Gaylord Fleshman, Barbara Rudolph  . 7 on t o b aX m w ,fr ?th e left, were Henry Fleshman, y .! Finshman Mary Fleshman, Frances Randolph, Hilda Chilton, SM  iTwhman, Willie FlesiuMn. S h  n Chilton. CTis Harvey, Austin Nowlin, Eulla Harvey, and George Harvey."}, "highlight": {"text": {"matched_tokens": ["C", "h", "c", "h"], "snippet": "church. Promise Land Baptist <mark>C</mark> <mark>h</mark> u r <mark>c</mark> <mark>h</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "h", "c", "h"], "snippet": "church. Promise Land Baptist <mark>C</mark> <mark>h</mark> u r <mark>c</mark> <mark>h</mark>"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1260.23, 1123.31, 1432.29, 1581.15], "bbox_id": "0083757beb", "file": "AppomattoxNewspapers_1955-1957a_0079.pdf", "page": 1, "text": "The undersigned sole acting SspeiiH Commissioner, pursuant to autho ity vested in me under the terms H a certain decree entered in the D  cember Term of 1955 of the CircuS Court of Appomattox County, ViM ginia in the chancery suit of TkT Bank of Appomattox vs. E. J. Paul ette, et als, will sell to the highel bidder for cash, on L FEBRUARY 1, 1.956, at 2 P. MB in front of the Court House of Ipomattox County, Virginia, th following property, to-wit All of that certain tract or pa cel of real estate lying and bei in Southside District of Appoma1 tox County, about four 4 mil South of Appomattox Court Housi near Promise Land Church and ing on the old Chap and Red Hou Road and being on the west side said road, and known as the 01 George Chilton Tract of land ar, adjoining now or formerly the lan of Jim Driskall,  Edgar. . Chiltoil Nannie- Harvey, Mrs. Adelia C. Fel guson, J. T. Myers and the land c W. H. Stern and A. W. Arrington originally containing 150 acrl teore or less, hut now containinl 65  acres more or less. E. 4 Paulette acquired said land by twj deeds, one from J. R. Poe and wifj of record in the Clerks Office 1 Appomattox County in Deed Bocj 48, at Page 487, and the other fro W. L. Moore to himself and J. Poe jointly, which is of record said Clerks Office of Appomatti County in Deed Book 42, at pa 452. H. OBRIEN, Auctioneer. CHAS. F-. F. CRAWLEY Special Commissioner, l-12-3tc"}, "highlight": {"text": {"matched_tokens": ["c", "H"], "snippet": "Myers and the land <mark>c</mark> W. <mark>H</mark>. Stern and A. W."}}, "highlights": [{"field": "text", "matched_tokens": ["c", "H"], "snippet": "Myers and the land <mark>c</mark> W. <mark>H</mark>. Stern and A. W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1769.73, 174.66, 1935.78, 856.19], "bbox_id": "77861834c0", "file": "AppomattoxNewspapers_1905-1912a_0193.pdf", "page": 1, "text": "T eachers In A ppom attox Schools. Term 1910-11 opening Oct. 3rd. C lo v er H il l D is t r ic t . Pamplins Graded, T. W. White, Principal Maggie Ewing, lt As sistant Minnie Thornton, 2nd As sistant. Martins, Mary Baghy Evergre. n, Sallie B Hunte. Rocks, Mattie J. Drinkard Hixburg, Julia jjuck Hur sville, Hattie A. Drink- ard Gold Hill, Logan Gilliam Browns, Lelia Henley Hollywood, Clem Fergnson Rugby, Be Knick- rbocker Vermillion, Rochet Glenn Harmony. Bara Dawson Roadside, Wm. S. Ilix, Col. Piney Ridge, 0. VI. Hamlet, Col. S ouths  de D istrict . Spout Spring Grad, d Mit-s E z Andersen, Prii Ethel Abbitt, Ass  Reedy Spring, Mrs. Uhathm Fati ng Rive , Louise Serv enU Pettys Fork, Ada OBrien Marshalls, Mag gie V. Chilton Lmg Cri-ek, LZZe Harvey Ha veys Gate, Vlaiy Gi d- aey Bush Forest, Vi-nima S-an Cheathams Angl -, Mattie Caldwell. Appomattox. Maiy E. Patersun, Col Chap, Annie Isbell, Col. S t o n e w a l l D is t r ic t . Airy Hili, Ida May Powers Tower Hill, Mrs. Laura Dernier Liberty t.bappel, Miss Deloca Banton Bent Creek, Mrs. N. R. S. DeWitt James River, Mrs. Geo. Tyree M t, Comfort, Mary Abbiit Mt Zion, Lucy Patterson Hebron, N. I. Foster Stonewall High School, Prof. J. G. Fisher, Prin. Sallie B. Spencer, 1st Asst Kate Duke 2ud Asst Buck Greek, Mary S.eptoe Oakville Graded, M. Frances Moss, Prin Jamie F. Mess, 1st Asst Fannie Taylor, 2nd Assi Garret, Mr. R. H. Wheeler Red Oak, P. W. Callaham, Col. T enth C ongressional H igh school . Prof. L. Crawley, Prin. L na Reekes, 1st Asst. Ida Okesffee, 2nd Asst. Mrs. 8. B. Reynolds, 3rd Asst. Miss Mary Irby 4th Asst. Al i c e Hubbard, 5th Asst. Estelle Thornton, 6 h Asst. Kate Frnxlm, Music."}, "highlight": {"text": {"matched_tokens": ["C", "H"], "snippet": "Callaham, Col. T enth <mark>C</mark> ongressional <mark>H</mark> igh school . Prof. L."}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H"], "snippet": "Callaham, Col. T enth <mark>C</mark> ongressional <mark>H</mark> igh school . Prof. L."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1510.81, 1156.82, 1669.57, 1245.42], "bbox_id": "0325201fd2", "file": "AppomattoxNewspapers_1902-1905a_0001.pdf", "page": 1, "text": "J . K , i-iannah, c., vs. C. Ii. Chilton leuve to Hie answer given to defendant. it. h Puuiett vs. W illis A . P aulett and oth ers older for partition. h . JS. J . Binford vs. L . H . and L , C. Gilliam  older continuing commissioners report, and to distribute funds. rusie C. Nowlin vs. W . B . Nowlin, J r ., c sale continued, and order for distribution. II. 1. Flood vs. A . H . Clem ent order for taking accounts."}, "highlight": {"text": {"matched_tokens": ["C", "Chilton"], "snippet": "K , i-iannah, c., vs. <mark>C</mark>. Ii. <mark>Chilton</mark> leuve to Hie answer"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Chilton"], "snippet": "K , i-iannah, c., vs. <mark>C</mark>. Ii. <mark>Chilton</mark> leuve to Hie answer"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [620.64, 313.41, 759.94, 1794.56], "bbox_id": "55c6b738b3", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "A. T. Coleman T. J. Conner D. W. Cawthorn James J. Case Jannie B. Caldwell Mrs. Bessie S. Christian Mrs. Nultie Cawthorn Mrs. Sallie B. Conner Helen F. Coleman Helen A. Coleman Florence W. Carson Mrs. W. L. Coleman Mildred Collier Christian Virginia Christian Mrs. Catherine C. Christian Mrs. Verna F. Conner Mrs. Cha8. F. P. Crawley Mrs. Harry Clark Mrs. Richard E. Clapp Catherine C. Carter Mrs. Madge Dudley Clark Harriett A. Chilton Mrs. Elizabeth G. Covington Mrs. E. G. Cheatham Mrs. Jemima Sue Chilton Mary C. Coleman Mrs. Mary T. Childress Mrs. M. E. Cheatham Mrs. Mary E. Cawthorne Mrs. Etta Carter Frances Mae Cralle Leonard F. Doss Walter C. Doss James R. Davis R. N. Dawson Twyman Dinkins G. M. Dixon Nevel Dinkins Chas. D. Doss W. T. Davidson F. C. Dresser Terry C. Durham W. E. Dickerson, Jr. Walter E. Durham Gilbert Dinkins Otis P. Dewberry Mrs. Grace B. Dawson Mrs. Otis P. Dewberry Miss Evelyn Dickerson Mrs. W. W. Driskill Nannie Lucille Doss Mrs. Margaret Emrick M. L. Earman C. T. Evans Lewis T. Evans Warren Emerick Meredith Evans Christine Eddins C. M. Evans N. R. Featherston G. T. Farrar Edward Ferguson W. W. Fleshman George W. Farrar James H. Ferguson Willie W. Farrar W. L. Farmer J. D. Ferrell George E. Frasier Harry D. Ferguson Lester C. Furney Sam S. Ferguson G. D. Farrar Morris Ferguson W. P. Ferrell Harpson S. Fleshman Horace Price Ferrell E. H. Ferris James M. Fulcher Mrs. Oreanna D. Farmer Mrs. Sarah T. Ferguson Mrs. Mamie Flowers Mrs. Lucy L. Furney Mrs. M. L. Ferguson Elizabeth Smith Ford Mrs. W. W. Ford, Jr. W W.. Ford, Jr. Lizzie Maude Godsey Ida L. Guill Clyde B. Godsey G. D. Gordon A. M. Goodman Robert Gills Erie R. Glenn A. Z. Gunter A. R, Gobble Chap R. Garrett Clarence H. Gobble D. H. Goin C. F. Gilley A. F. Godsey J. G. Gentry Harry B. Giles James H. Garrett Raymond Godsey James M. Garrett Raymond C. Garrett W. W. Godsey John E. Guthrie J. R. Gunter C. T. Gunter John S. Guill H. W. Guill Otha Godsey Clifford L. Godsey John D. Guill Havilah L. Guill S. L. Gobble H. W. Gallier Joe C. Gallier Herbert L. Godsey Theodore Gilbert James B. Goin Charles N. Gregory Wallace B. Gordon Richard Godsey Mrs. Jennie James Gordon Mrs. Lily C. Gilliam Miss Frances Gordon Margaret Goble Mrs. Carrie G. Gobble Mrs. Clara F. Garrett L. C. Godsey W. L. Godsey Warren Guill R. T. Holycross C. A. Hancock A. R. Harwood L. B. Harvey J. R. Hamilton E. W. Harris Jessie H. Hamlett W. C. Hamlet Frank Hanenkrat, Jr. John T. Hunter L. N. Herncall R. P. Harvey William R. Herndon"}, "highlight": {"text": {"matched_tokens": ["Chilton", "C"], "snippet": "Cheatham Mrs. Jemima Sue <mark>Chilton</mark> Mary <mark>C</mark>. Coleman Mrs. Mary T."}}, "highlights": [{"field": "text", "matched_tokens": ["Chilton", "C"], "snippet": "Cheatham Mrs. Jemima Sue <mark>Chilton</mark> Mary <mark>C</mark>. Coleman Mrs. Mary T."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
