{"document": {"bbox": [1471.45, 955.85, 1612.72, 1208.94], "bbox_id": "4f91c2de95", "file": "AppomattoxNewspapers_1962-1965a_0160.pdf", "page": 1, "text": "Second, Third, Sixth, Seventh and Tenth districts of the state. He said he feels these areas will provide the GOP with the best opportunity of electing members to the General Assembly. McCann iffa former Ussistarit U. S. -Attorney for the Western District of Virginia. He is a mem ber of the Lynchburg Republi can Committee. It has been speculated that McCann might be interested in carrying the GOP banner in the Lynchburg  Campbell County state senate race. Another possi ble GOP candidate in that race is Robert S. Burruss, lumber company executive. B u r r u s s when asked about reports that he has been approached to run tor t h e past, said t h a t he had no comment. The deadline for filing for the GOP is July 16  a week after the Democrats pick their candi dates in the July 9 primary."}, "highlight": {"text": {"matched_tokens": ["lumber", "company"], "snippet": "is Robert S. Burruss, <mark>lumber</mark> <mark>company</mark> executive. B u r"}}, "highlights": [{"field": "text", "matched_tokens": ["lumber", "company"], "snippet": "is Robert S. Burruss, <mark>lumber</mark> <mark>company</mark> executive. B u r"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.11, 1358.43, 1985.73, 1465.17], "bbox_id": "eb52850f14", "file": "AppomattoxNewspapers_1898-1902a_0712.pdf", "page": 1, "text": "Mr. YV. F. Lynn, as the executoi James E. Carruthers, has sold the cedents farm of 1.394 acres, situai in Cumberland county, Virginia, to anoke parties for a game preserve. T price paid was  4 . 000 . A deed recording the transfer property known as Campbell  Max wells wharves, in Norfolk, was record W heavy 6 90a7 25 Sheep, sheèp ed. Mrs. Jessie C. Johnson, of Baiti B0w to lower good to choice more, sold the property to the Eliza-I erg 3 50a4 00 YV estera sheep beth Land and Lumber Company, ollifegQ Norfolk, for  35 , 000 ."}, "highlight": {"text": {"matched_tokens": ["Lumber", "Company"], "snippet": "sheep beth Land and <mark>Lumber</mark> <mark>Company</mark>, ollifegQ Norfolk, for  35"}}, "highlights": [{"field": "text", "matched_tokens": ["Lumber", "Company"], "snippet": "sheep beth Land and <mark>Lumber</mark> <mark>Company</mark>, ollifegQ Norfolk, for  35"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.12, 256.36, 2020.13, 1802.75], "bbox_id": "b8f3f587eb", "file": "AppomattoxNewspapers_1922-1923a_0218.pdf", "page": 1, "text": "A movement is on foot to erect a monument to the memory of the late Benjamin P. Stebbins at Stanley Page County, who in August, 1878, was one of the discoverers of the Luray Caverns, killed the animal Mr. Stebbins was a native of Tompkins County, New York, and died in that county about two months ago. _Mr. Stebbins, in company with Messrs. W. B. and A. J. Campbell, of Luray, were in search of a cave when the discovery was made. Former Justice of the Peace Orville L. Flemming, of Princess Anne County, convicted of killing young Clarence Sny-  der, of Norfolk, while the latter was gun ning on the Fiemming farm and sen tenced to nine years in the penitentiary, has received a conditional pardon. Flem ming was met at the train by his wife and children and they drove to their home in the country. The killing of Clarence Snyder caused intense excite ment five years ago and a mob gathered about the house of Flemming, threaten ing to lynch him. He shot and killed the leader of the mob, supposed to be from Hampton, but whose body was hurried without any public identification. The mob dispersed and Flemming was arrested and convicted. Suit was entered in the Corporation Court of Newport News, by J. W. , Mooney against W. H. L. Kent asking  damages to the amount of 10,000. The 1 action grows out of the death of Re-  gina Mooney, the 13-year-old daughter  of Mr. Mooney, who was bitten by a dog belonging to Mr. Kent and developed a case of hydrophobia, from which she died .suffering violent convulsions. , Bristol was visited by a disastrous fire the other morning, entailing a total loss of 80,000, with less than 27,000 insurance. The plant of J. Wilkinson Lumber Company was destroyed, to gether with a large quantity of lumbei, manufactured articles, machinery, etc, This companys loss is 65,000, with only 12,000 insurance. Adams Bros.  Co., dealers in building material, lost a large quantity of material. Loss, 12,000, cov ered by insurance. Nine freight cars j weer burned. In Fauquier County three colored children were left in the cabin by their parents, William Harry Ball and his wife who went to visit neighbors. The clothes of the oldest boy, 7 years old, took fire from the open fireplace, and he was terribly burned. He threw off his coat and ran out doors.  The boy then discovered that the building was on fire, and, with the skin and fiesh dropping from his body, he rushed back into the house and brought out one child, 3 years old, and ran back into the flames and savtd the youngest child, 18 months old. The boy died from his in juries the following day. P. D. Gwaltney, president of the Amer ican Peanut Corporation, which was chartered at Norfolk, announced that the company will install machinery in the Roper storage warehouse, which they bought recently for 70,000, and will have in operation before next winter a peanut cleaning factory which will em ploy about 500 hands. The warehouse has a storage capacity for 85,000 bags of nuts. The vice president of the company here is P. D. Bain. The Democratic Congressional Com mittee of the Fourth District met- in the Chesterfield Hotel, Petersburg, and de cided to hold the primary on Tuesday, July 31. Each candidate for Congress will be required to place in the hands of the chairman a check for 350 to defray the expenses of the primary. The candi dates are R. S. Southall, of Amelia County Francis Rives Lassiter and Col. William Henry Mann, of this city, and Judge Leonard Yarrell, of Greenesvtlle County. A special meeting of the Suffolk Coun cil authorized its president, Dr. Henry Wood Campbell, to draw a warrant for , 6,000 in payment for Lake Savage,  which will be used as a souce of water supply at the expiration of the towns contract with the Portsmouth, Berkley and Suffolk Water Company. The amount will be paid through Nanse- mond Circuit Court, through which trib unal Suffolk had the lake condemned. Vance Wilson, a young man who had been in jail at Abingdon, for several weeks, was acquitted of a charge of housebreaking and robbery, as the result of a trial by jury in the Hustings Court of Bristol. Wilson is a son of R. A. Wil son, a prominent contractor and one ot the wealthiest men in Bristol. Because repeated troubles of his son the father had declined to go bail for him. E. C. Watts, a brakeman on a Chesa peake and Ohio freight, while crossing the top of the train fell off a short dis tance this side of Coleman Falls and his body was mangled. He was missed by the train crew at Perch and the engine was detached and backed to the scene of the accident. Mr. Fayette Dove, aged 30 years, the son of Mr. Thomas Dove, a prominent merchant of Luckctts, Loudoun County, was drowned in the Limestone creek near Lucketts. Mr. Dove left his home about 2 oclock on a fishng trip, fished in the creek for several hours and was about to return home, when he was suddenly stricken with epilepsy, a dis ease to which he had been subject for several years. He fell headlong into the stream and was drowned before those nearby could render aid. His body was afterward recovered. Veterans of Caroline County have con tracted for a 1,500 Confederate monu-  ment to be finished by May 25. The monument will probably be unvailed August 1. J. L. Luter, of Southhampton County, Virginia, lost by an incendiary fire his dwelling, puthouse. two horses and a lot of farm  products. The trail of Hurri cane Branchs bloodhounds indicated that the firebug is a white man, whose name is withheld pending the securing of other evidence. In a freight wreck at East Switch, Nottoway Station, 27 jumbo coal cars were piled up in a wreck and Edward Morgan, colored, a fireman, was killed. The wreck was caused by the breaking of a flange on one of the car wheels. Passenger traffic was delayed several hours. Jacob I. Richardson, for many years a Norfolk and Western passenger brake- man, dropped dead on the train at Fort Royal while on his run from Hagers town to Roanoke. He was 35 years old and unmarried. Health Collier, son of Superintendent Collier, of the Pocahontas and Virginia Coal and Coke Company, at Coalwood, died at the Miners Hospital at Welch as the result of the injuries he received several weeks ago by a premature ex plosion of a blast at the Coalwood tun nel. He is the third victim, the other two having been blown to pieces. He was a civil engineer."}, "highlight": {"text": {"matched_tokens": ["Lumber", "Company"], "snippet": "plant of J. Wilkinson <mark>Lumber</mark> <mark>Company</mark> was destroyed, to gether"}}, "highlights": [{"field": "text", "matched_tokens": ["Lumber", "Company"], "snippet": "plant of J. Wilkinson <mark>Lumber</mark> <mark>Company</mark> was destroyed, to gether"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1836.23, 703.46, 2000.96, 1789.3], "bbox_id": "c920cb1772", "file": "AppomattoxNewspapers_1892-1898a_0384.pdf", "page": 1, "text": "A Bad Road. Mr. Frank McKinney, a promi nent and well known farmer orAppo- mattox county, who was in the city a few days ago, stated to a reporter of The News that the road over which the farmers of his section had to haul their tobacco and other farm products into Lynchburg, was in a fearful condition and that its use was not only attended by ex traoi din ary dfficulties bnt was actually a menace to the safety of man and beast. The road referred to by Mr. McKinney is the old Richmond turn pike that enters the city by way of Tyreeanna and np the bank of the river. It is nsed by the farmers throughout a large section of the conutry, including tbe entire county f Appomattox, a large part of Camp-, bell, a part of Buckingham, Prince Edward, and other counties still further remote. To Lynchburg the road is probably of as much value as any other that enters the city, hundreds of thousands of pounds of tobacco being brought over it an nually into the city. This road has beén owned and op- perated for years by a company, many of the stockholders of which reside in the North. The heavy rain that occurred last fall caused considerable damage to the road, and in particular rendered the bridges very unsafe for travel. One of the bridges, the one across Beaver creek, was taken down, and although the lumber was hauled there preparatory for its reconstruction, it has not been ebuilt and farmers in hauling their goods to town haye a fearful ravine to cross, and to do this they have to leave the main road and by u tortuous, narrow and to some exteht danger ous road, go consideiahly out of their way around by the Six Mile Bridge. This side road is s  narrow and so steep in places that if two teams should be traversing it at tbe same time ip opposite directions, it would be absolutely impossible for them to pass without running the risk of an accident It is said that many of the farmers n coming to town with heavily loaded wagons are compelled to procure assistance to push their wagons over the bad places in the road. The bridge over Possnm creek, which is about a mile this side of the Six Mile bridge, has been condemmed. but it has not been fixed, and asa consequence the farmers at this point have to cross tbe deep ravine, straining their horses and themselves in climbing the steep banks. Such a condition of things is characterized by the farmers who use the road as outrageous and uni versal indignation is being expressed. Last fall, by the action of the Camp bell county court, the company was compelled to throw open their toll gate, and since that time no tolls have been charged. It is very probable that a move ment will be made by the Campbell authorities to compel the company either to repair the road, as it should be, or abandon their charter. Its present condition is undoubtedly a menace to the safety of the farmer and his teams, and is by no means advantageous to the citys business. It is stated by those in a position to know, that many farmers rather than come over the road are taking their tobacco to other places instead of to Lynchburg.Lynchburg News. Not a few of our farmers testify to the absolute correctness of this statement made by Mr. McKinney, who is probably better acquainted with onr roads  an any other man in tbe county. The fact is we have no road sjstem at all for this county. We shall be glad to hear from those who have systems, and with the proper disenssion and enlight- ment on this important subject we may have a plan adopted which will give general satisfaction."}, "highlight": {"text": {"matched_tokens": ["Campbell", "company"], "snippet": "be made by the <mark>Campbell</mark> authorities to compel the <mark>company</mark> either to repair the"}}, "highlights": [{"field": "text", "matched_tokens": ["Campbell", "company"], "snippet": "be made by the <mark>Campbell</mark> authorities to compel the <mark>company</mark> either to repair the"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1796.4, 279.72, 1956.44, 1504.76], "bbox_id": "67e2487bbf", "file": "AppomattoxNewspapers_1902-1905a_0086.pdf", "page": 1, "text": "Virginia PensionsJames W. Love. Sydnorsville. 6 Addison D. Barrett, Norfolk. 8 John M. K. Anderson, National Soldiers Home, Elizabeth City count-, 8 Fred L. Matteson, Na tional Soldiers Home, Elizabeth .City county, ig Henry L. Cabell, Cedar- ville, 12 Edward W. Goodwyn Mex ican War, .Lunenburg, 12 Christian G. Merritt, Greenville, 12 John Mc- Cartv, Latana, 6 William T.. Clark, Meherrim, 12 Sidney Stout, Luckets.  6  Mrs. Elizabeth C. McKenna died at Charlottesville Wednesday night. A part of the house in which her body ay fell on account of excavations. The workmen narrowly escaped. The observance of .Confederate Me morial Day in Lexington has been set or Saturday. May 23. The chief mar shal will be Col. W. T. Poague, of the Virginia Military Institute. Mrs. Samuel T. Early, wife of S. T. Early, of Alcorn, Miss., died at the ionie of her late father, Mr. Samuel Adair, near New Monmouth, Rock bridge county, aged 40 years. She was martied on Christmas Day. Miss Margater Hockenberry, of Mar- iinsburg, died at the age of 91 years. The old lady arose during the night and began to dress and expired about 30 minutes later. She had retired in her usual health. The engagement of Miss Bena Faun- tleroy Harrison, daughter of Mrs. Pow ell Harrison, of Leesburg, and Mr. Walter H. Taylor, City Engineer at Norfolk, Va., has been announced. The marriage will take place on June 24 at the home of the brides mother. Two large factories owned and oper ated by Suhling  Co., Lynchburg, were destroyed by fife. When the alarm was given flames were issuing from the tops of both structures, and before the firemen got to work all ef forts to save them were hopeless. Many nearby factories were in danger. The Suhling Buildings were connected by an archway of wood, and it is supposed that the fire spread through this. Suh ling  Co. ship annually millions of pounds of tobacco to Germany. The value of the two buildings is about 30,- 300 and of fixtures 10,000. The stock on hand is variously estimated at from 30,000 to 100,000. The loss is about 75,000. While the Messrs. Suhling vould make no statement, it is thought that the loss will be covered by insur- ince. The Norfolk Common Council re fused to approve the action of the Se lect Councils in relieving social clubs tf taxation and adopted Section 152. of the tax ordinance requiring such organ izations to pay at license tax of 250 an nually. The Virginia Club and Board of Trade come within the provisions of ,his section. The Orkney Springs Hotel property, situate at Orkney Springs, Shenan doahcounty, a popular resort, formerly owned b y Mrs. Henrietta Stuart, ol Washington, has been exchanged to Mr. Romaine Dally, of Washington, D. C., for the Imperial Hotel of Pe tersburg. G. T. Alphin has sold his farm near the mouth of Kerrs creek, Rock bridge county, to Frank Brown, of. Lexington, for 2500. It contains about 76 acres. Mr. Alphin has purchased a farm for 3500. News has been received in Lexington of the death by yellow fever of Rev. Charles R. Morton, a missionary in the Southern Presbyterian Church in Brazil. Mr. M. C. Bayless, 52 years old. ? farmer of near Winchester, died Thurs day night. A widow and four children survive him. The capital stock to the Peoples Na tional Bank of Roanoke has been over subscribed by 10,000. More than two- thirds is taken by local merchants ant1 business men. Dr. George H. P. Cole a well-known local capitalist, was slat ed for president. Frost is reported from the Bac Creek pippen belt, but the crop was but slightly injured. The apple prospects in Roanoke, Bedford, Franklin anc Campbell county have never been bet ter. The lumber steamer Francis H. Leg gett sailed for San Francisco. The ves sel has just been completed at New port News, and is for the redwood lum ber trade in California. She takes ou two American locomotives for Japanese consignees, and has also on board a lo of steel rails. The Finance Committee of the Pe tersburg City Council opened the bidt for 190,030 4 per cent. 40-year refund jjig bonds and awarded them to lo cal bidders at an average price of 103.59 The Petersburg Savings and Insurance Company bid par for the entire amount These bonds are issued to refund a likt amount of 8 per cent, bonds due on th first of May. William Englcnian, a farmer o Greenville. Augusta county, was throwr from his horse a few lays ago and i now in a critical condition. Mr. En  glenian wal sitting on his horse whili pouring some feed into a hogpen, wher the horse made a sudden leap. Mr Engleman was thrown headforemost tc the ground and struck, a sharp stake There is little hope of his recovery. The Washington and Southwesterr vestibule limited No. 38 of the Southerr Railroad ran into the rear end of 1 freight train near Lynchburg. The en gine was demolished, two mail and twe freight cars were completely burned and the engineer of the passenger Charley R. Kinney, of Thomasville N. C., was killed. No 38 was goin down a heavy grade at the time. Or seeing the freight ahead of him. Kin ney reversed his engine and jumped As he struck the-ground the front jmi car turned over on him, killing hitr instantly."}, "highlight": {"text": {"matched_tokens": ["Campbell", "lumber"], "snippet": "Roanoke, Bedford, Franklin anc <mark>Campbell</mark> county have never been bet ter. The <mark>lumber</mark> steamer Francis H. Leg"}}, "highlights": [{"field": "text", "matched_tokens": ["Campbell", "lumber"], "snippet": "Roanoke, Bedford, Franklin anc <mark>Campbell</mark> county have never been bet ter. The <mark>lumber</mark> steamer Francis H. Leg"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1928.4, 293.42, 2094.78, 1640.17], "bbox_id": "b6ef6c826e", "file": "AppomattoxNewspapers_1902-1905a_0579.pdf", "page": 1, "text": "There was a disastrous fire in the to- baco factory section of Danville, entail ing a loss closely approximating 100,000, which was only partially insured. The origin of the fire is a mystery. One of the factories destroyed was occupied by John B. Anderson  Co., and the other one jointly by the same firm and Mr. Chalmers Patterson, a leaf dealer. Both buildings, which were brick structures, were destroyed, together with their con tents. The Union warehouse, George E. Coleman  Co., proprietors, was badly damaged. J. B. Anderson  Co. are the heaviest losers by the fire. They had to bacco valued at 75,000 stored in the house and carried 69,000 insurance. Lee BarksdaJe, colored, an escaped prisoner from the chain gang, was shot Danville by Alfred Henderson, colored, who had, als6 escaped from the chain Vang. Barksdales wound, which is in the shoulder, is not considered dangerous. A dynamite explosion at the Clayton mines, operated by the Pulaski Company, near Pulaski, lcilled William Goings, col ored, a blacksmith, and dangerously wounded his 14-year-old son. A third of a box of the explosive had been left in the blacksmith shop, where the men were working. How it was exploded is not known. The shop was blown into kindling wood and all the clothes were blown off of the dead man. He had been at work only a short time when the ex plosion took place. Henry Purden, the 9-year-old son of Captain Purden, of the Seaboard Air Line Railway, Portsmouth, has lockjaw and is likely to die. He fell from a tree several days ago and suffered a com pound fracture of his arm. Both bones were broken and the flesh was badly lacerated. Gangrene has developed and there is little hope of saving the boys life. ,  But for the timely arrival of several men Miss Annie Dixon, who conducts a fashionable hairdressing parlor for la dies on the fifth fl6or of the Law Build ing, on Main Street, Lynchburg, would have been burned to death. Miss Dixon was using an alcohol lamp, which cx-. ploded, throwing the burning fluid over her clothing Instantly she was in a light blaze.. She ran to a nearby bath room, screaming as she went, and en deavored to throw water upon the flames. She returned to her parlor and there she was thrown to the floor and rolled in a rug, which completely extinguished the fire. Miss Dixon was severely injured and all her clothing from her waist up was burned off her. The police authorities of Stephen City are investigating the discovery of a heal thy looking white baby, about 2 weeks old, that was mysteriously placed on the front porch of the residence of John Massie, in the suburbs of that town, while the family were absent. Suspicion is said to point to a woman whose name the police refuse to divulge. At Mountain City, near Bristol,- Jeff Church has been sentenced to 10 years in the penitentiary for the murder of James Campbell. The citizens are said to be indignant over the verdict. The murder was a brutal one, Church having tramped his victims face while the latter was pleading for mercy after he had been shot- -2 times,. Buried for nearly an hour under sev eral tons of lumber was the frightful ex perience of John Haines, a teamster from Hampshire County, West Virginia, in Winchester. He is lat Memorial Hos pital in a precarious condition. A wheel of the wagon which Haines was driving fell off and the lumber wagon upset, pinning Haines under the heavy lad. Two laage sturgeons, one weighing 300 pounds and the other about 200 pounds, were captured in the Rappahan nock river at the foot of the falls above Fredericksburg. Both sturgeons had got ten into shallow water. Roanoke was offered 40,000 for the Gish farm of 10 acres, purchased about two years ago for 10,000 for park pur poses. The offer was made by the Tide water Railway Company, which recently purchased the fair grounds of 30 acres, lying a half mile east of the Gish farm. The offer must be accepted wthin ten days or it will be withdrawn. Roanoke business men say it indicates that Ro anoke is to have the shops of the new road.  Superintendent of Construction J. F. Wrenn, of the Tidewater Railroad, an nounced that Wm. J. Oliver, represent ing Sands  Oliver, of Roanoke, had closed a million-dollar deal with the Southern Railway. The contract calls for the double-tracking of the Southern from Morristown to Knoxville and the building of a branch line from Chatte- nooga to Stephenson, all in Tennessee. Sands  Oliver were recently relieved oi a part of ttheir contract tto build the roadbed for the first tuo miles of the Tidewater. Superintendent Wrenn says the contractors get 2,ooo,oou for build ing a mile-long tunnel between Knoxville and Morristown, which is now being constructed under Lookout Mountain. Wallace W. Hunter, capitalist and for mer treasurer of Norfolk for 12 years, shot himself in the mouth in Elmwood Cemetery. He was found an hour after ward and sent to St. Vincents Hospital. He was conscious, but too weak for an operation. The bullet, came out at the top of his head, and the surgeons, when they had examined the wound, said there was little hope of his living. Mr. Hunter is 68 years of age and has long com plained of ill health. His wife was Miss Grandy, the sister of the wealthy banker, C. Wiley Grandy, and he has a son and daughter, both grown. The only ex planation of the shooting is Mr. Hun ters ill health. He was well educated, popular and of high character. The resignation of Rev. Dr. Robert J. McBridge as rector of Robert E. Lee Memorial Episcopal Church, of Lexing ton, has been accepted by the vestry. Dr. McBridge goes to St. Georges Church, Fredericksburg. For over 22 years Dr. McBridge has been pastor of Lee Memo rial Church, and he is greatly beloved here. Harlie Steele, son of Edward Steele, Df Middletown, lies at his home in a ser ious condition from a gunshot wound in his shoulder, the result of a hunting ac- ident. While on his way home the other barrel of the gun exploded, tearing out he front of his shirt."}, "highlight": {"text": {"matched_tokens": ["Company"], "snippet": "operated by the Pulaski <mark>Company</mark>, near Pulaski, lcilled William"}}, "highlights": [{"field": "text", "matched_tokens": ["Company"], "snippet": "operated by the Pulaski <mark>Company</mark>, near Pulaski, lcilled William"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.92, 782.9, 2441.39, 1166.39], "bbox_id": "3f5525ca74", "file": "AppomattoxNewspapers_1908-1909a_0370.pdf", "page": 1, "text": "the following described real estate and personal property , FIRSTAll of that certain parcel of land, located in he town of PamrpUn, Va containing twej and one-eighth 2-ig acres, as shown by survey mentioned in deed from The Akron Smoking Pipe Co., to C F. Harvey and others, recorded in the clerks office of tho Circuit Court of Appomattox County. Located on said lot is a saw mill shed, work shop, planing mill shod, boiler room and shoring vault, main factory building, packing room and shed, fire cloy smoking pipe kiln, lumber kiln. These buildhsga are in fair condition and most of them are iron-dad. SECONDPersonal property 1 Blaidsell  Co., lathe and tools, 1 H. Bickford power drill end tools, 1 mud mill, 1 pipe-fitting equipment, 7 pipe moulds, 1 78 H. P Ames steam engine, 1 90 H, P, Al len boiler, 1 4 H. P. Frick steam engine, 1 Geiser saw mill and Phenix Wood planer, 1 end trimmer, 1 re saw, 1 rip saw, 1 moulder-machine, 1 three-side planer, 1 grinder and equipment, 1 line-shaft mid drive belt, 1 iron safe, 1 stencil machine 3 lumber trucks, I automobile tfuclc. This machinery is in first dess condition and will be offered in per cels end then as a whole. This manufacturing company is making money end is e going concern end is working overy day, end afford a wonderful opportunity for investors who desire to engage in the manufacturing business. Upon application to any of the undersigned receivers or at the plant in Pampiin, Va., prospective purchasers will be shown over the property before day of sale. TERMS One-fourth cash, the balance in equal installments, payable one, two and three years, pur chaser to execute bond beaming interest at six per cent per amnum, weiring homestead exemption and with the right to antidpate any or all of the deferred payments and pay cash for the property. At to the personal property the.purchaser will be required to pay one-half cash, tho balance, six and twelve months time. Bonds to bear 6 interest fjrom date of sale and containing waiver of homestead exemp tion and ell of the property must be insured in e reasonable amount, and the policies filed with the un dersigned receivers as a further security for the deferred payments. Taxes and insurance pi-grated es date of sale. A. H. CLEMEET, J. V. LEWIS. B. B. CAMPBELL, Comrs. end Receivers. Bond required of Commissioners end ReceiversA. H. Clement end J, V. Lewis in the ebdve cause has been executed before me with approved security. C, W, SMITH, Cleric,"}, "highlight": {"text": {"matched_tokens": ["lumber"], "snippet": "cloy smoking pipe kiln, <mark>lumber</mark> kiln. These buildhsga are"}}, "highlights": [{"field": "text", "matched_tokens": ["lumber"], "snippet": "cloy smoking pipe kiln, <mark>lumber</mark> kiln. These buildhsga are"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.07, 301.37, 2048.63, 1644.32], "bbox_id": "12da4006c8", "file": "AppomattoxNewspapers_1902-1905a_0430.pdf", "page": 1, "text": "Rev. M. D. Robinette, of Scott coun- j ty,-has been arrested by officers of the United States internal Revenue Serv- ce on the charge of conducting an illicit distillery. According to a report made o United States Marshal Frank G. Thompson, in Richmond, when the rev- tnue nicn caught the minister he asked the officers to join him in prayer before they led. him away to imprisonment. Governor Montague has declined to grant a pardon to Harry Long, of Ports mouth, a youth sentenced to serve a rear in jail for killing his one-time friend, Howard Clealon. I find no suffi cient reason for clemency, says the Governor. Frank Jay Gould was elected presi dent of the Old Dominion Iron and Nail Works at Richmond. Mr. Gould nas recently acquired a controlling in terest in the plant. Presence of mind saved Mrs Bar tholomew Marlin, of Richmond, from a terrible death and her house from destruction. In attempting to put out a kerosene lamp she blew down the chim ney. An explosion followed, which scl fire to her clothing. Rushing from the house, she threw herself down in the snow and rolled about until the fire was extinguished. Then, remembering her little child alone in the house, she il led her apron with snow, ran back and put out the flooring, which was ablaze. The senior class of the Virginia Poly technic Institute, which recently gave offense to the faculty, by a circular let- er sent to the parents of members ol the junior, class, held a meeting and prepared another letter, staling that the first had befen sent when the situation was not thoroughly understood. The juniors, xesigned in a body be cause of the expulsion of Cadet Bolling Coulter, said to have been one of those concerned in the hanging in effigy of the cadet commandant. The action ol the seniors was satisfactory to the fac ulty. A number of applications for re- i instatement have been received from the juniors, and a committee of professor? has been given charge of the matter Peace now rcigii 9 at the institute. John Oxford, treasurer and stock holder of the Stuart Manufacturing Company, of Stuart, has been sent tc jail in default of bail bond of  2,000 on the charge of forgery. The charge made against Oxford is that he forged and uttered a 90 -day acceptance of !,- 200 on A. Lobdale  Co., of New York discounting the paper at a Danville bank Oxford is a New Yorker, who wpnt tc j-Stuart about a year ago. lc enjoyed the full confidence of the people there As the Patrick jail was recently burned Oxford will await the action of the grand jury in the Henry county jail at Martinsville. A dispatch received from St. Louif announces the death of Mrs. Albert P Miller, 40 years old, wife of a formei prominent shoe dealer of Winchester She had been taken from her home ai Trenton, Mo., to a St. Louis hospital tc undergo an operation for appendicitis She was Mr. Millers second wife and it survived by hint and one son, Carrol Miller. His first wife was Miss Fowler, daughter of a former State Treasurer oi Maryland. J. E. Wright, alias W. E. Stains, it in jail in Manchester, under three indict ments charging hitn with housebreaking and having burglars toots in his posses sion. In a trunk iu his room was found a collection of watches, diamonds, ear rings, finger rings, stickpins and othci jewelry worth in the aggregate about i,ooo. The inanjis said to be wanted in Wheeling, W. Va., and Lynchburg on charges of burglary and is said to br a fugitive from Tennessee justice. Judge Henry Clay .McDowell,, whe succeeded the late John Paul as judge of the United Stales courts for th Western dirstrict of Virginia, has draft ed a bill, which is to be introduced in Congress by Representative Slemp, fot the creation of another judicial district to be known as the Middle district of Virginia, which will, if passed, abolish the court of that jurisdiction at IJar- risonburg. The new court is proposed to be established at Charlottesville, and these counties will compose the district Frederick, Warren, Shenandoah, Hali fax, Pittsylvania, Henry, Patrick, Char lotte, Campbell, Bedford, Appomattox, Buckingham, Cumberland, Fluvanna, Al- 1 beniarlc, Nelson, Arnhcrst, Rockbridge,  Bath, Highland, Augusta, Rockingham, Greene, Madison, Page aud Rappahan nock. The bill provides that the pres- I ent judge of the Western district shall be the judge of the Middle district, but it is provided that the district attorney and his assistant and the marshal of the Western district shall cpntinue to exercise their duties in that district.  Representatives of 20 mills, controlling I practically the entire output of Virginia and North Carolina pine lumber, decid ed not to make any change in the scale of prices which became effective Novem ber 16 . An invitation from the Secre tary of Agriculture to attend the Ameri can Forest Congress in Washington from January 2 to 6 , 1905 , was accepted and a delegation named to represent the association. Charles Bolden, colored, janitor of the Loyall Street Public School, Danville.  was arrested on the charge of selling 1 liquor to a 12 -ycar-old boy pupil of the institution. The head janitor discovered I the plot in time to keep the liquor out  of the hands of the boy, and it was on his complaint that the arrest was made. Bolden makes no denial of the grave charge, but claims to have been ignorant I of any violation of the law. I Judge Wililam Gordon Robertson, of 1 loanoke, has been retained to defend I Charles Fishburnc, the slayer of Dr. Le- I ew, at Roanoke. Judge A. Phlegar, of I Uontgomery, and Hall, Robertson  Vood, of Roanoke, have also been re amed. The trial is to commence at the I anuary term of the court, j J. Wilton  Sons, hardware merchants, 1 lave closed a contract with Noah Carvci if Baltimore, for the purchase of the ild Carver lot on West Wolfe street Harrisonburg, for  800 . A brick ware- iousc 122 feet by about 88 feet, will le built."}, "highlight": {"text": {"matched_tokens": ["Company"], "snippet": "of the Stuart Manufacturing <mark>Company</mark>, of Stuart, has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Company"], "snippet": "of the Stuart Manufacturing <mark>Company</mark>, of Stuart, has been"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1957.18, 300.02, 2131.57, 1792.41], "bbox_id": "29c3b2a508", "file": "AppomattoxNewspapers_1902-1905a_0545.pdf", "page": 1, "text": "Mr. L. C. Robertson, a Danville man, fell from a lamp-post, sustaining painful but not fatal injuries. He is supposed to have ascended the post with the intention of doing himself harm, having been very despondent since the recent death of his mother. He will probably recover. Charles Leynard, white, who was serv ing a term in the Danville Jail, made a sensational escape from the chain gang. He was closely pursued and jumped into the river to elude capture. Leynard has not been seen since, and it is not defi nitely known whether he got out of the river or was drowned. The gang was employed at a rock quarry near the river. A blast set off by men employed on the Winchester waterworks extension created a panic among East Side resi dents, when large stones were thrown high in the air. One stone, weighing nine pounds, hurled a distance of 30J yards, crashed through the tin roof of John W. Myers residence, knocking a big hole in the ceiling, and fell in the middle of a bed front which his son, Walter Myers, had just risen. A horse driven by Edgar A. Stickley, a prominent Frederick county man, fell in a ditch, and the driver fell under the horse. Before being rescued from his perilous position, Mr. Stickley was se verely kicked in the face by the animal, his nose and several bones being broken. Mrs. W. W. Rule, about 60 years old, of Roanoke, while watting for a trolley car on the Vinton line, was attacked by a young negro, who threw her down, took her handbag from her hand and ran. This is the third case of this kind to occur in five days. The alleged shortage of W. B. Jen kins, money-order clerk of Portsmouth postoffice, is 1,900. He returned 800 to Inspector Bulla, and says he will re store the 1,100 balance if allowed a short time. Third Vice-President George L. Pot ter, of the Baltimore ,and Ohio Rail road, and other officials were at Stras- burg, Shenandoah county, conferring with the municipal authorities regarding the Councils proposed legal steps to compel the railroad company to ruti its trains into the town of Strasburg, in stead of stopping at the junction, as it has for many years, in violation of its charter. It is said that an amicable agreement will be reached. Evelyn Stevens, young daughter of Mr. and Mrs. R. B. Stevens, died at the home of her parents, in Staffor 4 county, of en largement of the brain. Muscoe Russell Pace, Jr., lies dead at his home in Richmond with a bullet in his brain. Whether his death was the result of accident or intent will never be conclusive ly known, but the opinion of the cor oner is that he took his own life. The probable cause of the act is loss of his position as a messenger of the Southern Express Company and the consequent interference with his plans to be mar ried. Mrs. Estelle Townsend Smith, who was recently convicted in the Hustings Court of Manchester of haying whipped to death her son Ralph, is ill in her cell in the Manchester Ja il A five-year term in the penitentiary was the penaAy fixed by the jury. Next week her counsel will ask the judge to set the verdict aside. If he fails to do so the case will go to the Supreme Court of Appeals. The big flouring mills in Carroll county, owned by A. W. Westmoreland and Sons, were destroyed by fire of in cendiary. origin. The Hamburger Tobacco Company, Norfolk, of which S. Hamburger is manager, was forced into bankruptcy, with liabilities amounting to 5,000 and assets not exceeding i,2M. A fire the other morning, starting in the lumber shed of Joseph F. Ravel, of Woodstock, situated in the rear of his furniture factory, practically destroyed the upper part of the building and sev eral thousand feet of molding and lum ber. The loss is 700. The naval tug Hercules has blown up the wreck of the schooner Clara E. Ber gen, off the Carolina coast. The Bergen was run down by a steamer several weeks ago, and since that time has been drifting almost submerged in the path of coastwise shipping. On account of the dangerous nature of the derelict, the Navy Department sent the Hercules tc detroy it. An explosion, which cannot be ac counted for, occurred at the Dixie E x  tract Plant in Bristol, resulting in the death of Noah Hardin, thirty-six years old and married, and in serious injury I to George Wolford, colored. A machine in the chipper room exploded and the room was torn to pieces, pieces of cast ings weighing form three to four hun dred pounds were hurled through the I walls of the building and carried over I a thousand feet away. The property damage is heavy. The machine that ex- I ploded was idle at the time. Manager Bramni barely escaped injury. There is a suspicion that dynamite might have been placed under the machine, but there is no known motive. Roanoke and vicinity has been vis ited by constant rains for the past month, and the wheat crop, the best for many years, is ruined in the shock. The grain j has sprouted, and the shocks are per-  fectly green. The loss to farmers ol the wheat, hay and oat crops on account of the constant rains will reach several hundred thousands of dollars. Tobacco grower of Campbell county met at Lynchburg for the purpose of or ganizing a county branch of the Ameri can Society of Equity. H. B. Sherman national organizer, will attempt to or ganize all of the tobacco-growing coun ties of Virginia and North Carolina in the coming three months. Two employes of the Portsmouth post- office were suspended. Inspector Bulla filed information of irregularities in the accounts of W. D. enkins, money-order clerk, and as to the infractions of time regulation by Amos Williams, a colored carrier. Holland Walker, aged 13 years, was tried before the Circuit Court in Wood- stock upon the charge of breaking into and robbing the store of S. H. Culler at Mauertown. He-was sentenced to five months in jail. This case was tried upon appeal from decision of a justice of the peace, who had sentenced him to the reform school. Rev. James A. Duncan, formerly of Randolph-Macon College, has returned regularly to the ministry, now being pas tor of a church at Birmingham, Ala. State Assessor Edgar F. Thompson has completed the five-year assessment of real estate in Alexandria city. The valuation is 3,892,960- This is an in crease of 23403 over the State assess ment of 1900 and 115,000 over the city assessment of last year. . . . The degree of doctor of divinity has been conferred by Hampden-Sidney Col lege on Prof. R. H. Bennett, of Randolph- Macon College. He is now traveling in Europe with his family."}, "highlight": {"text": {"matched_tokens": ["company"], "snippet": "to compel the railroad <mark>company</mark> to ruti its trains"}}, "highlights": [{"field": "text", "matched_tokens": ["company"], "snippet": "to compel the railroad <mark>company</mark> to ruti its trains"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1868.16, 178.25, 2189.26, 483.2], "bbox_id": "2bea4ff959", "file": "AppomattoxNewspapers_1915-1918a_0125.pdf", "page": 1, "text": "H on. J .C . J o h m T his highly ts eetned citizen passed away at his hme near here last Thursday. He was a remark able man in many respects. W hen Maj. Clement of Campbell called for the pick of the young men of hi i county to join the foroes of Lee Gnap Jones joined the company aud followed the fortunes of the Oofederacy with bravery. He wt many times wounded and with th ej F o r M en W om en and C hild loss of one arm, a troublesome E v ery S hoe S tric tly  wound iu tne leg, he began after!  , me war to rebuild and reestablish Solid .L e a th e r T h ro u g h - hunself along with his shattered  o u t country. He was a merchant, a successful lumber dealer, and served I R em em ber My Stock is Com Appomattox county and his state in  plete in every d ep a rtm en t, the General Assembly, on the school board, tbe electoral board and other publio offices of trust. Kind of heart, painstaking in every duty, devoted to his ohuroh and took a keen interest in everything which elped m up bnilding his oounty"}, "highlight": {"text": {"matched_tokens": ["Campbell"], "snippet": "hen Maj. Clement of <mark>Campbell</mark> called for the pick"}}, "highlights": [{"field": "text", "matched_tokens": ["Campbell"], "snippet": "hen Maj. Clement of <mark>Campbell</mark> called for the pick"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
