{"document": {"bbox": [953.29, 416.24, 993.24, 426.24], "bbox_id": "4bd379d677", "file": "AppomattoxNewspapers_1933-1936a_0404.pdf", "page": 1, "text": "Cawthorn"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "<mark>Cawthorn</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "<mark>Cawthorn</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1480.09, 798.97, 1973.66, 1179.1], "bbox_id": "1a89fccc2e", "file": "AppomattoxNewspapers_1926-1933a_0144.pdf", "page": 1, "text": "You T ake a Long Slim Chance when you drive your car without! Liability and Property Damage Insurance.  This form of insur- ance protects you against dam- ages you have to pay if you hit  the other fellow t r his car. You may be careful but your I i l l . idea of how the accident occured our neighborhood, Miss Nell! thattime on she showed by her might not agree with the judges Cawthorn, as our teacher at Mt.l walk in life that she was trying opinion. . ,. . Zion gchool. Ifc H U m  We regret very much to learn For many months before the end  take this risk for you at a of the death of Mrs. R. E. Cald- she lingered between life nd I moderate cost. Send U3 name well, Jr of Appomattox. Wish I death. She bore her suffering 1 your ear anj engine number. to extend our deepest sympathy!with patient Christian fortitude DO IT NOW! to the family. and pleaded with those out of Mrs, B. H. W. Martin, Miss!Christ to embrace the Christian Ina Moore, and others, made a I religion ere it was too late. She flying trip to Lynchburg last! prayed that there be no death Thursday. I struggles at the end and she Rev. Clarke preached a fine passed away just as a lamp sermon at ML Comfort last Sun- burns out The pall-bearers  day afternoon, text being, God werei W- W. McCormick, H. W. Will Provide. McCormick, Tea McCormick, Mr. and Mrs. T. M. Taylor, Clyde McCormick, George Stan- Mr. Hartwell Burge and Mrs. ley, Harry Stanley. All related Ella Moore were visitors in the to the deceased. The floral de home of Mr. HG. Harding last  signs were beautiful and were"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "agree with the judges <mark>Cawthorn</mark>, as our teacher at"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "agree with the judges <mark>Cawthorn</mark>, as our teacher at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.02, 692.14, 846.89, 1600.13], "bbox_id": "2cf039f5ce", "file": "AppomattoxNewspapers_1933-1936a_0259.pdf", "page": 1, "text": "yn and Martian Lee, Mrs. e, Bert and Hoi-man Lee, week a t V irginia Beach. Mrs. E. W . Padgett  nd son, id I-,. J. Body, of Lynchburg, are siting Mrs R G Moore. Maji Evens and Ruby  It al-l visiting Miss M argaret Allen t Pleasant View, Va. Miss Evelyn, Blackburn, of Roanoke sPep4jng th,V week with Miss Virginia Moses. , Mr. arid Mrs. Em m ett Tuclt, who nave beh here fo r sometime, have returned to- Virgilina. F. T. Cawthoi-n and H. C Pulliam notorctdi to Richmond Tuesday to ttend a F ord mcieting. r M l- !nd Mrs. T E Caldwell, of ynchburg, spent last week with Mrs. Franklin Marshall. There will Ibe preaching at the risbyterian churcji ia,- Evergreen aunday afternoon at 330. ... Miss Della Inge will retu rn om e atuiday -after attending summe- cl- ol at Charlottesville. Mrs. Harrison, of Lynchburg, -pent last week with her sistrir, Mrs. T. J. Lowe. Friends of Mr. and Mrs. Hornsey Smith xkitertaineid a t ,a show.fr re eently in their honor. Moss Lewis, of Roanoke, - sp nt he week slnd with his parents, Mr. md Mrs. Cheriie L w is. Miss Flora Lawson and Mrs. Al fred I.awson hav, returned from a visit with relatives in New York. We are glad to hear th a t Andrrjw ferguson, who was op rated on at Memorial hospital last wgek, is now improving. Mr, and Mrs. S. J. Evans and children, Billy and M arian June have . returned from a visit with her sister Mrs. L. A. M essreau. of Baltimore. Jessie Guill, of W arrington, and Charli j Guill, of W ashington, spent Sunday with their parents, Mr. and Mrs. Fletcher Guill. M utt Cawthorn, of W ashington, ipent soveral days the first of the week with his parents, Mr. and Mrs. F. T. Cawthorn. Mrs. Beatrice Meadows and Miss Mary Smith, of Lvnchburg spent the week end in the Ihonvl of Hornsey Smith. Rev. W. M. Thompson, Mrs Hele.n Welch, Mrs. Loue 11,a Morris and Virginia Lee Thompson m otored to V cxandrin Monday. Mr. and Mrs. Howard Blank., and son,, Howaj-d, Jr., of Lynchburg. I spent the week end with Mr. and Mrs, E. L. Laynet. Guests in the home of Mrs. T. T Lowe for the week  jrid, w ere Mrs. T. A. H ackett and daughters, Ilelan and Dorothy, of Covington. Misses Nan Throckmorton, of New York, andi Mary Francs Pretlow, of Norfolk, are visiting relatives and friends here. Mr. end Mrs. Ed Layne, Mr. and Mrs, Howard Blanks, and Mr. arid Mrs, E. T. Guill and fam ily motored to Spears Mountain recently. Mr. and Mrs. George Babcock from j Florida spent l-.st week with Mrs. I H. C Babcock, en route to Maine and I other northern states. Mrs. Ruth Spilman and son of Pichard, and Miss M ary Kemp, of Florida are spending son time with Mrs. W. M. Morris. . . IWrs. M. C. S nath has retu rn ed from Richmond accompanied by her daughter, Virginia and Mrs. George Mayers who will spend the week in that home.  Harvey Morris and son, Norvall Woodson, Mr. and Mrs. Irving Maekof, of Richmond, Misses Ada were visitors in H arvey during and May Harvey, the home of T.  th 2 week end. Mrs. J. H. Cheatham. Mrs S .V . Munsey, D r.H avilah iVbcock and son, Huck and Jam es Elliot Cheat- ham are spending"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Fletcher Guill. M utt <mark>Cawthorn</mark>, of W ashington, ipent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Fletcher Guill. M utt <mark>Cawthorn</mark>, of W ashington, ipent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.06, 411.44, 1840.21, 640.77], "bbox_id": "f88f4781bb", "file": "AppomattoxNewspapers_1933-1936a_0158.pdf", "page": 1, "text": "YELLOW VALLEY NEWS! O --------------------------------  O Yellow Valley, Feb. 20.- We have just received word of the marriage of Miss Jsssie Richardson and Eddie Cardwell, both of Lynchburg. They were married at Appomattox Satur day night, February 16. We wish them a life of happiness. A surprise- birthday party was given Leonard Carter in his home February 9. Quite a number were present and he received many nice gifts. The hostess served delightful refreshments. Miss Margie Joe Cawthorn, of Lyn chburg, spent the week-end with her parents, Mr. and Mrs. T. J. Caw thorn. Mrs. Ray Baldwin is recoovering from a spell of flu. Miss Josephine Hollycross, of Ap pomattox spent last week-end with her aunt."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "refreshments. Miss Margie Joe <mark>Cawthorn</mark>, of Lyn chburg, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "refreshments. Miss Margie Joe <mark>Cawthorn</mark>, of Lyn chburg, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.89, 1074.2, 1588.69, 1273.39], "bbox_id": "a7bf581ee5", "file": "AppomattoxNewspapers_1926-1933a_0578.pdf", "page": 1, "text": "YELLOW VALLEY, May 3. Mrs. Henry Farley and A. P. Richardson, of Amelia County, and Mrs. H. Carson, of Penn sylvania, were the guests oi Mr. and Mrs. T. R. Richardson Tuesday evening. Mr. a n d Mrs. Lawrence Woodson and Miss Betty Webb of Lynchburg, visited in t h e home of Mr. and Mrs. Tom J. Cawthorn. Miss Mamie Cawthorn had been spending a few days with her parents, accompanied them home. Mamie and Bradley Caw- thorne spent Thursday wi t h Jessie Richardson. Mrs. W. R. Baldwin and son,"}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "and Mrs. Tom J. <mark>Cawthorn</mark>. Miss Mamie <mark>Cawthorn</mark> had"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "and Mrs. Tom J. <mark>Cawthorn</mark>. Miss Mamie <mark>Cawthorn</mark> had"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.49, 374.34, 1753.8, 664.98], "bbox_id": "3b62dcdddc", "file": "AppomattoxNewspapers_1926-1933a_0574.pdf", "page": 1, "text": "YELLOW VALLEY, April 19.Mr. and Mrs. James ilankenship and daughter, Ma le, of Lynchburg, are visiting Mrs. Dewey Cawthorn. Miss Jessie Richardson spent a few days in Lynchburg last week. Jack Cawthorn, Jim Case, vVylie and Thomas Richardson are on a fishing trip over the loliday. Will let you know in .he next issue what they aught. Miss Maymie Cawthorn, of Lynchburg, visited her parents Mr. and Mrs. Tom J. Cawthorn luring the holidays. Henry L o u Covington, Gladys Bill Swan and Talmage oung of Prospect, were visi- ,ors in the home of Mrs. E. A. Jovington and Bradley Caw- ,horn Wednesday evening. The neighborhood children rom here enjoyed an Easter gg hunt with George Ray Baldwin."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "are visiting Mrs. Dewey <mark>Cawthorn</mark>. Miss Jessie Richardson spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "are visiting Mrs. Dewey <mark>Cawthorn</mark>. Miss Jessie Richardson spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1591.69, 310.21, 2077.23, 642.68], "bbox_id": "7e1347f6cc", "file": "AppomattoxNewspapers_1908-1909a_0574.pdf", "page": 1, "text": "Yellow vaiiey James River Uo To I High Mark, BentCreek YELLOW VALLEY, April 19.Mr. and Mrs. James ilankenship and daughter, Ma- ie, of Lynchburg, are visiting Mrs. Dewey Cawthorn. Miss Jessie Richardson spent a few days in Lynchburg last week. Jack Cawthorn, Jim Case, Vylie and Thomas Richardson are on a fishing trip over the loiiday. Will let you know in .he next issue what they caught. Miss Maymie Cawthorn, of jynchburg, visited her parents .Mr. and Mrs. Tom J. Cawthorn luring, the holidays. Henry L o u Covington, Gladys Bill Swan and Talmage oung of Prospect, were visi- ors in the home of Mrs. E. A. Jovington and Bradley Caw- .horn Wednesday evening. The neighborhood children .rom here enjoyed an Easter igg hunt with George Ray Baldwin."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "are visiting Mrs. Dewey <mark>Cawthorn</mark>. Miss Jessie Richardson spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "are visiting Mrs. Dewey <mark>Cawthorn</mark>. Miss Jessie Richardson spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.87, 1012.51, 1604.05, 1795.8], "bbox_id": "3f8ddc6afa", "file": "AppomattoxNewspapers_1926-1933a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first, M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third, M F Moon. White potatoes, first, Mrs W A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, H ailey  Inge second, Mrs T H Inge. Mixed peas first, S L Ferguson second, Howard Inge third, T H I Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, Homer Babcock. Potato pumpkin, first, G W Reynolds second, R A Jones third, Miss Annie Caldwell. Watermelon, first, L E Smith second, M F Moon. Three squash, first, Mrs Wi P Gills, Egg plants, first, Mrs E L Smith. Navy beans, first, Mrs R F Jamerson second, Ira Burrell, third, C F Moore. Butter beans, first, Mrs Guy Smith second, Ira Burrell third,  Mrs E M Stratton. ! Lima beans, first, Mrs M C  Smith. Sheaf wheat, first, Willie Moon. Irish potatoes, first, J E Bur nett second, Guy Smith third, M C Smith. Green mountain potatoes, first, F T Cawthorn second, BessieI Gunter. Stalks cane, first, M F Moon, second, RC Jones third, C S  Cawthorn.  Sweepstakes, first, W W Far rar, second. W W Farrar, third, Mrs J R Caldwell. Peanuts, first and second none third, George Carson. Buckwheat, first, Mrs. H B Marshall. Celery, first, Mrs C R Cald- I well, second, Mrs. C R Caldwell. Beets, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith. Stalks corn, first, Stratton Bros. Sheaf of wheat, first, none, second, William Moon. Bale hay, first, E L Smith. Bunch soy beans, first, Mrs 0 L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "potatoes, first, F T <mark>Cawthorn</mark> second, BessieI Gunter. Stalks"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "potatoes, first, F T <mark>Cawthorn</mark> second, BessieI Gunter. Stalks"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2183.75, 1537.84, 2311.43, 1619.39], "bbox_id": "dbea7075e6", "file": "TimesVirginian_1980a_0326.pdf", "page": 1, "text": "YARD SALE Odds and ends within walking dis tance of the Appomattox Railroad Festival. Ever green Ave. and Cawthorn Streets. Saturday 1230 - 6  00 . 7910-9-ltp"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "YARD SALE Odds and ends within walking dis tance of the Appomattox Railroad Festival. Ever green Ave. and <mark>Cawthorn</mark> Streets. Saturday 1230 - 6  00 . 7910-9-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "YARD SALE Odds and ends within walking dis tance of the Appomattox Railroad Festival. Ever green Ave. and <mark>Cawthorn</mark> Streets. Saturday 1230 - 6  00 . 7910-9-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [752.65, 1547.89, 897.84, 1667.57], "bbox_id": "9f2a8179be", "file": "TimesVirginian_1981a_0186.pdf", "page": 1, "text": "Yard Sale apd Car Wash. Saturday on the corner of Evergreen Ave. and Cawthorn St. Sunday rain date. 796-10-ltp YARD SALE Saturday, June 13, 9 until, Rt. 727, approx. 2 miles passed ACHS, first house on left passed Appomattox Baptist Temple. _ _____________ 796-10-ltc"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "of Evergreen Ave. and <mark>Cawthorn</mark> St. Sunday rain date."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "of Evergreen Ave. and <mark>Cawthorn</mark> St. Sunday rain date."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [461.73, 712.32, 634.38, 952.22], "bbox_id": "96f2cebe69", "file": "AppomattoxNewspapers_1952-1954a_0393.pdf", "page": 1, "text": "y over the week-end.  a third and fourth grades of .vergreei school motored to Red i the home of Patrick Henry, on I ay. They were accompanied by ey M. Keesee and Mrs. Lucie  les and Mrs. J. K. Hamilton. Mr. and Mrs. J. A. Young enter- d a t a buffet luncheon Sunday i V nor of her birthday, and L. R. ung. Those present were Mr. and F rs. H erbert H arrup, of Ja rre tt T r. and Mrs. Otey Inge and Mr. and T ts. L. R. Young, of Lynchbug P s. Eva Cawthorn, T. N. Ransone, r  Appom attox Mr. and Mrs. Ran- 1 11 W ooldridge and daughter, Bar- 1 -a Anne, and Mrs. S. J. Jennings. Mrs. Young received many nice gifts and m any wishes for happy returns c  the day. Mrs. Lena Ferguson is . spending th s week with Mr. and Mrs. C. J. Ferguson."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Lynchbug P s. Eva <mark>Cawthorn</mark>, T. N. Ransone, r"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Lynchbug P s. Eva <mark>Cawthorn</mark>, T. N. Ransone, r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1389.86, 1435.01, 1552.66, 1661.71], "bbox_id": "a6954c6d0e", "file": "AppomattoxNewspapers_1926-1933a_0065.pdf", "page": 1, "text": "Xmas Spirit and a Xmas tree on the night of Wednesday, Dec. 22nd, and the patrons and public in general are invited to come and hear the little folk tell about Santa Claus. We are glad to report th at M r. Robt. Cawthorn is some w hat better at this writing. Mrs. H. M. M arshall and H. M. Jr., have returned home from Lynchburg hospital much to the delight of their friends. Mr. Ira Burrell and daughter, Vergie, spent Tuesday in Lynch burg. Rev. J. W. Wood preached an excellent sermon here last Sun day."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "at M r. Robt. <mark>Cawthorn</mark> is some w hat"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "at M r. Robt. <mark>Cawthorn</mark> is some w hat"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [257.52, 381.77, 728.04, 704.56], "bbox_id": "84efb46e72", "file": "AppomattoxNewspapers_1908-1909a_0250.pdf", "page": 1, "text": "X rirzwATCR, n. p.. m ter of Faculty, Moody Bible Uutttub of CMcfigfi,   M B , Wootors Nowspapw Dolco. Miss Leo Wagel, of New fork, has been visiting in the lome of Mr. and Mrs. T. H. Jpencer. Miss Sarah Bates has been isiting relatives in Lynchburg. Mr. and Mrs. R. D. Wilson pent the week-end in Farm- ille.  Miss Lucille Bates and Miss .Nannie Jones spent last week in Lynchburg. Miss Lena Morris, of Blue- leld, W. Va.,is visiting her sis- er, Mrs. W. E. Dickerson. Miss Dorothy Cawthorn, of Alexandria, is visiting relatives here. Miss Frances Coleman has etumed from a visit to Phila delphia, Pa. Miss Mamie Cullop is at aomc on her vacation, after at- ,ending summer school at East Radford. Miss Elizabeth Robertson las been visiting her grand mother, Mrs. D. A. Bondurant, x t S ix Mile Bridge."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "E. Dickerson. Miss Dorothy <mark>Cawthorn</mark>, of Alexandria, is visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "E. Dickerson. Miss Dorothy <mark>Cawthorn</mark>, of Alexandria, is visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.1, 451.88, 1167.15, 805.31], "bbox_id": "34d84c03ee", "file": "TimesVirginian_1976_0085.pdf", "page": 1, "text": "without aid from the Govern ment. R. A . Cheatham was married on October 24, 1866 to Harriet Nelson CaWthorn, daughter of the Rev. John H. Cawthorn, a Baptist minister. They were the parents of eleven children, the youngest of whom Russell Aubrey Cheatham, served with tMfe Army in Europe during World War I. R . A . Cheatham died Nov. 6,1922 and is buried In the Cheatham Fanhily Cemetery three miles south west .of Appomattox, Va. on State Route 719. - I have always heard that my Grandfather was left on. the battlefield for dead, but an Appomattox soldier passing by found him and took him to the medical tent. They cleansed his chest wound by passing a silk hankerchief through it. His paralyzed left arm was cured by massaging over a period of years. My grandmothers fami ly did not want her to marry him as they did not think a man with only one arm could support her, a problem soldiers of ail wars have had to face."}, "highlight": {"text": {"matched_tokens": ["CaWthorn"], "snippet": "1866 to Harriet Nelson <mark>CaWthorn</mark>, daughter of the Rev."}}, "highlights": [{"field": "text", "matched_tokens": ["CaWthorn"], "snippet": "1866 to Harriet Nelson <mark>CaWthorn</mark>, daughter of the Rev."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2257.68, 187.47, 2445.28, 951.31], "bbox_id": "d9492ab0ff", "file": "AppomattoxNewspapers_1912-1915a_0286.pdf", "page": 1, "text": "Willis, Kinsey, Hughes, Harry B . Smith, MUMt, TMtonji,- RobertUpni Ferebea Price, Batman,- HU- y -, Finance-A. G. Weever, Spessard, Baker, Brewer, Houston, Pitts, Mom tague, Stearnes, Trrell, Spattg. Jor lan, Owem Gregory, rasty. OUver. Claims  Brown, Barley, Birrelfc Bonlant, Dodson, Cummings, Cousins Crockett. Hartley, Hughes, Johnson, Carman, Flannagan.  .  Militia and PolicrlyaedF, Myers Harvey, Malbon, Horner, Taylor, Boni- ant, Brans comb, Coijslna, Chapman. Dalton, Earman, Flannagan.   Asylums and PrisonsT-Granf, Kept- Rolston, Gregory, Ferebee, Taylor Harris, Huff, Cousins, Harvey, Price, Noland, H. C. Weever. Labor and the PoorLand Tiffany Huff, Jordan, Gordon, John O. Daniel Duke, Lowry, Owen, Philpott, Powell, Lincoln, Branscomb. Public Property  Harvey, Kent, Malbon, Rew, Nelson, Harrison, J. Wil liam Daniel, Franklin, Clemejft, Easley,. Hobson, Hartley, Lewis.  Currency and Commerce-Mi Is toad!, .j Kinsey, Lewis, Powers, Green, Hariri son, Pitts, Toney, Stubbs, Steamesj Stock, Terrell, Tiffany. Agriculture and Mining  Adame  I Kinsey, Lewis, Cawthorn, Harry B. I Smith, Commins, Bonlfant, Stock, I Crockett, Hartley, Johnson, Dodson, I Looney. I Manufactures and Mechanic Arts J Kinsey, Spessard, Williams, Buck Adams, Field, Gregory, Jordan. J. WH Ham Daniel, Grasty! Philpott, LownejV v Page. VJ .Counties, Cities and TownsKent, j Buck, Land, Harvey, Myers, Green, Price, Crockett Tonefy, Dalton, Phil pott, Lowry, Page.  . Officers and Offices,at the Capitol Montague, Dodson, Hobson, Love, a Massie, Reed, White, Willis, Chapman,  Winston, Powers, Looney, Flanagan.   Executive Expenditures  Massie, John O. Banlel, Harris, Noland, Brown, Pennington, Powers, Browning, I Meetze, Chapman, BranSfcomb, H. C. I Weever, Powell. _ I Enrolled Bills-Buck, Owen, Oaw I thorn, Chapman, Crockett Ferebee.  I Dalton, Gordon, Heflin, Gunn, Xlncoln, Branscomb, Franklin Immigration  Clement, Meetze, Ralston, Taylor, Grasty, Oordon, Harris, Hartley, Hobson, Jordan, I W ers, Reed, Philpott. Chesapeake and Itz Tributaries Houston, Malbon, Milstead, Brewer, Woodward, Commtas, Stubbs, j. William Daniel, Duke, Heflin I Nonis, Francis W. Smith.   Appropriations  Brewfr, Baker, I Stock, Gunn, Hobson, Adams, Massie, Pitts, Williams. Spessard, Binell Winston, Lincoln, 4    House Expenses  Spatlg, Gunn. Buck, Grant, Green.  . RulesCox, Williams, Houston, Chalkley, A. G. Weaver,  ConfirmationTerrell, A. G. Weever, Leedy. Browning, Heflin, . libraryStephenson, Stock, Flew, Heed, Myers.   . . PrintingWalton, Land, Houston. Special Private and Local Legisla tionWhite, Stephenson, Browplng, Green, Lowry, Nelson, Easley, v 4"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Adame  I Kinsey, Lewis, <mark>Cawthorn</mark>, Harry B. I Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Adame  I Kinsey, Lewis, <mark>Cawthorn</mark>, Harry B. I Smith,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Odel! Howerton, Edmund H. <mark>Cawthorn</mark>, O. Cleveland Paulette. T."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Odel! Howerton, Edmund H. <mark>Cawthorn</mark>, O. Cleveland Paulette. T."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2077.19, 329.76, 2235.28, 601.39], "bbox_id": "1825ce6f17", "file": "AppomattoxNewspapers_1908-1909a_0570.pdf", "page": 1, "text": "WILD WOOD, April 6.- Mr. W. H. Simmons isvery ill. Mr. and Mrs. Howard Glo ver are the proud parents of a baby girl. Visitors in the home of Miss Lillie Cawthorn Sunday were Mr. L. B. Martin arid family, of Lynchburg, and Mr. Good man ,Ransm and family. Mrs. Eliza Cawthorn has re turned home after a visit with relatives in Nelson. Mrs. W. E. Warriner- a n d daughters, v Carry and Lindy,. and Mr. Jamie Gibson visited Mr. Jim Warriner, of Prospect. His condition is no1 better. Mr. and Mrs. Payton Har veys two children are sick. Mr. Jamie Gibson has return ed to Washington after a visit with relatives here. Mr. S. J. Evans, Billy and Myrtle, Mr. and .Mrs. W. L. Brown and Billy Carter, of"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "home of Miss Lillie <mark>Cawthorn</mark> Sunday were Mr. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "home of Miss Lillie <mark>Cawthorn</mark> Sunday were Mr. L."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2081.98, 352.5, 2296.65, 624.64], "bbox_id": "0e5e7cb227", "file": "AppomattoxNewspapers_1926-1933a_0570.pdf", "page": 1, "text": "WILD WOOD, April 6. Mr. W. H. Simmons is very ill. Mr. and Mrs. Howard Glo- Lindy, Mr. ver are the proud parents of a baby girl. Visitors in the home of Miss Lillie Cawthorn Sunday were Mr. L. B. Martin and family, of Lynchburg, and Mr. Good man Ransom and family. Mrs. Eliza Cawthorn has re turned home after a visit with relatives in Nelson. Mrs. W. E. Warriner and daughters,- Carry and Lindy, and Mr. Jamie Gibson visited Mr. Jim Warriner, of Prospect. His condition is no1 better. Mr. and Mrs. Payton Har veys two children are sick. Mr. Jamie Gibson has return ed to Washington after a visit with relatives here. Mr. S. J. Evans, Billy and Myrtle, Mr. and Mrs. W. L. Brown and Billy Carter, of"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "home of Miss Lillie <mark>Cawthorn</mark> Sunday were Mr. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "home of Miss Lillie <mark>Cawthorn</mark> Sunday were Mr. L."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1919.03, 609.81, 2076.59, 821.29], "bbox_id": "f6ea2fc06e", "file": "AppomattoxNewspapers_1926-1933a_0574.pdf", "page": 1, "text": "WILD WOOD, April 19. Mr. W. W. Woolridge is o u t again after being sick. Mrs. E. F. Glover and Mr. G. P. Paulette have been on the sick list for some time Mr. B. W. Harveys children are sick at this writing. Mrs. P. M. Evans is sick. Mr. and Mrs. Lenwood Blackwell and Airs. Jomel Cawthorn, Mrs. S. J. Evans and Marion visited Mrs. J. O. Evans Thursday. Miss Blannie Evans and Jack Hodge visited Mrs. W. E- War- riner Monday. --------------- o- -------------"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Blackwell and Airs. Jomel <mark>Cawthorn</mark>, Mrs. S. J. Evans"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Blackwell and Airs. Jomel <mark>Cawthorn</mark>, Mrs. S. J. Evans"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.9, 399.34, 1766.15, 892.33], "bbox_id": "5496100b8e", "file": "AppomattoxNewspapers_1908-1909a_0136.pdf", "page": 1, "text": "Who said It aint going to rain no more. We are Having plenty rain now. Some say te much, but we are neMitified. M n. Kate Cheatham, of near iustmirg, is visiting relatives near here- Mrs. Bettie Cawthorn is visit ing her son, Mr. Hector Caw- thorp, in Roraoke. Mp, DaniBl Jenniijgs has re- urned from a pleasant trip to loarmke. Mr. j and Mrs Blass Harvey, and ttle son, of W. VA, were 1 he guests of his home people ast Week. Mr. E. G. Godsey, of Roanoke,4 was be guest of Mr, and Mrs. J. J.Parrar, Sunday. Mffih Lonell Hamilton, and Mr. Sam Jennings, are visiting rela tives in Roanoke this week Mr. and Mrs. O. P. Farrar and frs. Austin were week-end visitms at the Beach last week- T h   re p c a  i a fine tiittb. Mp. and Mrs. J, D. Fleenor, and gaby Mrs. H. R. Johnson, and fwo little sons, and Mw,   Myers, of Bristol, Tenn.. are the pests of Mr.and Mrs- W. J. Smith this week. Mr. and Mrs. J. D. Fleenor, and Mr. M..J. Smith motored to Washington Mottdkjf Sn a plea sure trip. Mies Hal lie Burnett, of Vera, was the week-end guest of friends here last week."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "near here- Mrs. Bettie <mark>Cawthorn</mark> is visit ing her"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "near here- Mrs. Bettie <mark>Cawthorn</mark> is visit ing her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.88, 414.95, 1791.0, 907.39], "bbox_id": "143cf31722", "file": "AppomattoxNewspapers_1926-1933a_0136.pdf", "page": 1, "text": "Who said It aint going to rain no more. We are baying plenty rain now.  Soque fay too, much, but we are never ratified.! Mrs. Kate Cheatham, of near Hustbjurg, is visiting relatives! near here. Mrs. Bettie Cawthorn is visit ingherson, Mr. Hector Caw thorn, in Roanoke. Mr, DaniBl Jennings has re turned from a pleasant trip to iloan.oke. Mr.,and Aifrs- Blass Harvey, and little son, of W. Va., were the guests of his home people ast week. Mr. E. G. Godsey, of Roanoke, was the guest of Mr. and Mrs. J. J. Parrar, Sunday. Miss Lonell Hamilton, and Mr. Sam Jennings, are visiting rela tives in Roanoke this week. Mr. and Mrs. O. P. Farrar and Mrs. Austin were week-end visitors at the Beach last week. Théy report a fine time. Mr. and Mrs. J. D. Fleenor, and baby, Mrs. H. R. Johnson, and tWo little sons, and Mrs. S. F. Mjyers, of Bristol, Tenn.. are the guests of Mr. and Mrs. W. J. Smith this week. Mr. and Mrs. J. D. Fleenor, and Mr. W. J. Smith motored, to Washington Motidy on a plea sure trip. Miss Hallie Burnett, of Vera, was the week-end guest of friends here last week."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "near here. Mrs. Bettie <mark>Cawthorn</mark> is visit ingherson, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "near here. Mrs. Bettie <mark>Cawthorn</mark> is visit ingherson, Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.92, 298.08, 1736.77, 864.17], "bbox_id": "7eed589d78", "file": "AppomattoxNewspapers_1926-1933a_0044.pdf", "page": 1, "text": "which was drawn in for her by ittle Miss Frances Caldwell. The first gift was a lovely cor sage of Sweetheart roses from the groom-elect and miniature clothes pins and line. Many landsome gifts of linen were received numbering about 100. The guests enjoyed a contest How to Manage a Husband which was arranged on post cards with the picture of Jiggs attached. The answers to this caused much merriment, Mrs. H. M. Burge winning the prize. Then followed a Jungle Wed ding, prizes being won by Mrs. W. M. Thompson and Mrs. R.W. Jamerson. Delightful refreshments were trved by the hostesses. The following guests were present Mesdames. A. R. larwood, u. H. Lawson, Lottie Bledsoe, M. F. McKinney. Ned Wagers, Harrison Burge, Jerry Burke, Richard Burke, Joe OBrien, Chas. T. M ses. T. W. Moses, Nettie Mann, Arthur Irby, Tom Christian, G. 0. Gor- ion, W. B. Caldwell, J. W. Cawthorn, James Caldwell Jr , Pelham Cook, T. J. Harvey, J. E. Dinwiddie, Oscar Scheffler, T. W. Odor, W. L. Ould, LeRoy Smith, W. M. Thompson, Walter Jamerson, Walter Scott, Justin Burkey, Robert Wagner, Charles Caldwell, Robert Caldwell, Misses Eddie Hardy Nina and Anna Jones, Grace and Florence Cald well, Gladys Smith, Nola Burkey Elaine McDearmon, Jessalyn Hancock, Louise Gills, Elizabeth and Frances OBrien, Emma Hancock, Flora Lawson and Lucille Caldwell."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "B. Caldwell, J. W. <mark>Cawthorn</mark>, James Caldwell Jr , Pelham"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "B. Caldwell, J. W. <mark>Cawthorn</mark>, James Caldwell Jr , Pelham"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.14, 281.43, 1736.25, 846.82], "bbox_id": "e1d07ea760", "file": "AppomattoxNewspapers_1908-1909a_0044.pdf", "page": 1, "text": "which was drawn in for her by  little Miss Frances Caldwell. The first gift was a lovely cor-1 sage of Sweetheart roses from the groom-elect and miniature clothes pins and. line. Many handsome gifts of linen werei received numbering about 100. The guests enjoyed a contest How to Manage a Husband which was arranged on postj cards with the picture of Jiggs attached. The answers to this I caused much merriment, Mrs. H. M. Burge winning the prize. Then followed a Jungle Wed- ding, prizes being won by Mrs. W. M. Thompson and Mrs. R.W. Jamerson. Delightful refreshments were served by the hostesses. The following guests were present Mesdames. A. R. Garwood, !. FI. Lawson, Lottie j Bledsoe, M. F. McKinney, Ned Wagers, Harrison Burge, Jerry Burke, Richard Burke, Joe I OBrien, Chas. T. M ses. T. W. Moses, Nettie Mann, -ArthurI Irby, Tom Christian, G. 0 . Gpr- don, W. B.- Caldwell, J. W. Cawthorn, James Caldwell J r , Pelham Cook, T. J. Harvey, J. E. Dinwiddie, Oscar Scheffler, T. W. Odor, W, L. Ould, LeRoy Smith, W. M- Thompann, Walter I Jamerson, Walter Scott, Justin Burkev. Robert Wagner, Charles Caldwell, Robert Caldwell, Misses Eddie Hardy Nina and Anna Jones, Grace and Florence Cald well, Gladys Smith, Nola Burkey Elaine McDearmon, . Jessalyn Hancock, Louise Gills, Elizabeth and Frances OBrien, Emma Hancock, Flora Lawson And Lucille. Caldwell."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "B.- Caldwell, J. W. <mark>Cawthorn</mark>, James Caldwell J r"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "B.- Caldwell, J. W. <mark>Cawthorn</mark>, James Caldwell J r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1825.15, 611.46, 1997.49, 799.55], "bbox_id": "73230d5866", "file": "AppomattoxNewspapers_1960-1962b_0420.pdf", "page": 1, "text": "When Mrs. Mary Inge returned from visiting friends one night last week, the family were all in bed. She went out the back door to put some flower slips out and fell out as the porch had been torn down in her absence. She was not hurt seriously, though very bruised and shook up. Mrs. J. fflL Ranson entertained the following relatives with a cook-out in her back yard Saturday night Mr., and M ts . Cawthorn Harris, Sue, Mr. and Mrs. Tom Dil lon and Eunice Harris. Mr. and Mrs. Thomas Ranson vis ited Shenandoah Park and Luray Caverns while on vacation."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Mr., and M ts . <mark>Cawthorn</mark> Harris, Sue, Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Mr., and M ts . <mark>Cawthorn</mark> Harris, Sue, Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [348.7, 655.57, 665.43, 833.5], "bbox_id": "456d3a9ff4", "file": "AppomattoxNewspapers_1926-1933a_0494.pdf", "page": 1, "text": "Wheat In Countv ingham and Appomattox musi-  J  cians came to enter the event. ,  , the first of its kind ever held Good harvest days this week here. To add to the occasion here speeded the harvesting of j iig dancing and singing broke he wheat crop m this section loose when the bands chimed ind it is now fairly well on its!up with Dixie and as a grand vay to completion. The yield i finale every player upon the is not expected to be large as stage, nearly fifty in number. ast year, but an average har united in a mighty rendition of elst is expected. There have Coming Round the Mountain. tew wind storms to blow The judges J. H. OBrien wheat to the ground and it is i F. T. Cawthorn, Miss Cornelia n fine shape. Gills. Rev. R. E. Redding and ----  ----------- lJoe Crute. pondered long and carefully before selecting the best players from the wealth of"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "is i F. T. <mark>Cawthorn</mark>, Miss Cornelia n fine"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "is i F. T. <mark>Cawthorn</mark>, Miss Cornelia n fine"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1728.0, 1124.54, 1902.73, 1458.09], "bbox_id": "ff1775390b", "file": "AppomattoxNewspapers_1949-1952a_0230.pdf", "page": 1, "text": "Whats new with you? Things at A. H. S. are happening right along, day by day. As the SCA is an important part of our school, we are always glad to hear of their activities. Last Mon- day they held a meeting during lunch period. At this meeting re ports from various committees such as safety, health, program, clean up and social were given. Thè stu dent council has decided to meet every Monday at lunch time. The SCA is working hard this year to help the school and students, so let us try to help them and ourselves. The Home Economics Club initia ted new members last week and they did a very good job. If you saw a girl wearing her mothers dess, high heels witth miss-matched socks, 30 clothespins in her hair and car rying a broom, she was a F. H. A. . We are proud of our football boys for defeating Amherst Friday night, 51 to 0. Ed Cawthorn wept over for five of our touchdowns, I whili Bobby Cfeemault, Henry Doss and Billy JohnsU it each scored one. This was our lan home gams ilvs year, bui dont forget we still have a game with VES Saturday a.id a I game - Farmville November 22, so be there and suoport your team."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "51 to 0. Ed <mark>Cawthorn</mark> wept over for five"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "51 to 0. Ed <mark>Cawthorn</mark> wept over for five"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2052.21, 1737.3, 2218.26, 1766.0], "bbox_id": "95970b2958", "file": "AppomattoxNewspapers_1943-1947a_0017.pdf", "page": 1, "text": "W.H. Ferguson is spending some lime with his daughter, Mrs. Leo nard Cawthorn,"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "W.H. Ferguson is spending some lime with his daughter, Mrs. Leo nard <mark>Cawthorn</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "W.H. Ferguson is spending some lime with his daughter, Mrs. Leo nard <mark>Cawthorn</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2464.8, 209.26, 2740.13, 621.3], "bbox_id": "ea7df7d826", "file": "AppomattoxNewspapers_1971-1973a_0182.pdf", "page": 1, "text": "wfifci fires a c e started bv SOMEONE BEING CARELESS! VIRGINIA IN THE CIRCUIT COURT OF APPOMATTOX COUNTY MATTIE C. MORGAN Complainant VS ORDER OF PUBLICATION ELIZABETH C. ALLEN 723 James Street Riverton, New Jersey IRA MARSHALL 377 S. Oakley Avenue Columbus, Ohio 43420 NONA MARSHALL 360 Stone Avenue Brooklyn, New York 11212 DEWEY MARSHALL 1605 Franklin Park, South Columbus, Ohio 43205 SAMUEL W. MARSHALL 107 Majestic Avenue San Francisco, California 94112 ELVIN E. MARSHALL 686 Lexington Avenue Brooklyn, New York 11221 EMILL O. MARSHALL 360 Stone Avenue Brooklyn, New York 11212 DOUGLAS N. MARSHALL 123 Grant Street Beckley, West Virginia 25801 LEWIS R. MARSHALL 1613 Elliott Avenue South Boston, Virginia 24592 MAURICE CAWTHORN 223 Ellis Street Bluefield, West Virginia 24701 PEYTON CAWTHORN 223 Ellis Street Bluefield, West Virginia 24701"}, "highlight": {"text": {"matched_tokens": ["CAWTHORN"], "snippet": "Boston, Virginia 24592 MAURICE <mark>CAWTHORN</mark> 223 Ellis Street Bluefield,"}}, "highlights": [{"field": "text", "matched_tokens": ["CAWTHORN"], "snippet": "Boston, Virginia 24592 MAURICE <mark>CAWTHORN</mark> 223 Ellis Street Bluefield,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.85, 734.16, 1783.59, 856.31], "bbox_id": "ea1123f113", "file": "AppomattoxNewspapers_1926-1933a_0159.pdf", "page": 1, "text": "Wesley Chapel School First gradesAlice Cawthorn, Frances Cawthorn. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mai Mann."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Wesley Chapel School First gradesAlice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mai Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Wesley Chapel School First gradesAlice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mai Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1603.47, 716.67, 1766.76, 838.76], "bbox_id": "c4457da367", "file": "AppomattoxNewspapers_1908-1909a_0159.pdf", "page": 1, "text": ".Wesley Chapel School First gradesAlice Cawthorn, Frances Cawthorn. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mae Mann."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": ".Wesley Chapel School First gradesAlice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mae Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": ".Wesley Chapel School First gradesAlice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. Second gradeWalker Caw thorn Fourth gradeDavie Mann. Sixth gradeLouise Lewis, Raymond Mann. Seventh grade  Coy Mae Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1999.83, 645.43, 2167.3, 738.28], "bbox_id": "9c10939668", "file": "AppomattoxNewspapers_1939-1943a_0540.pdf", "page": 1, "text": "Wesley Chapel, Nov. 17 The.i will be services at Wesley Chapel Sunday afternoon at 3 oclock. Mrs. Mamie Shupe is visiting Mrs. Lawrence Stewart, at Evergreen. George Cawthorn, .of Lynchburg was a guest in the home of J. T. Wooldridge Sunday."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Stewart, at Evergreen. George <mark>Cawthorn</mark>, .of Lynchburg was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Stewart, at Evergreen. George <mark>Cawthorn</mark>, .of Lynchburg was a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2380.8, 711.15, 2547.95, 823.15], "bbox_id": "d4b56400fa", "file": "AppomattoxNewspapers_1939-1943a_0484.pdf", "page": 1, "text": "Wesley Chapel, July 6.- There will be services at Wesley Chapel Sunday afternoon at 3 oclock. The public is invited. Guests in the  Wooldridge home Sunday were Mrs. Joe Shupe, and grand-daughters Rose and Ruth, and George Cawthorn of Appomat tox. J. L. Lewis came home Thursday from the Virginia Baptist hospital."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "and Ruth, and George <mark>Cawthorn</mark> of Appomat tox. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "and Ruth, and George <mark>Cawthorn</mark> of Appomat tox. J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1387.9, 820.07, 1547.62, 903.07], "bbox_id": "2d8cfbca42", "file": "AppomattoxNewspapers_1908-1909a_0064.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Walker Cäwthorn, RylandTrent, 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis Cawthorn, Sallie Mann. 6th grade, Coy Mae Mann."}, "highlight": {"text": {"matched_tokens": ["Cäwthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Walker <mark>Cäwthorn</mark>, RylandTrent, 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis <mark>Cawthorn</mark>, Sallie Mann. 6th grade, Coy Mae Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cäwthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Walker <mark>Cäwthorn</mark>, RylandTrent, 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis <mark>Cawthorn</mark>, Sallie Mann. 6th grade, Coy Mae Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1392.69, 829.56, 1552.75, 912.1], "bbox_id": "fcdfc5096d", "file": "AppomattoxNewspapers_1926-1933a_0064.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Walker Cawthorn, Ryland Trent. 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis Cawthorn, Sallie Mann. 6th grade, Coy Mae Mann."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Walker <mark>Cawthorn</mark>, Ryland Trent. 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis <mark>Cawthorn</mark>, Sallie Mann. 6th grade, Coy Mae Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Walker <mark>Cawthorn</mark>, Ryland Trent. 3rd grade, Dovie Mann. 5th grade, Louise Lewis, Cur tis <mark>Cawthorn</mark>, Sallie Mann. 6th grade, Coy Mae Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [383.05, 686.11, 558.35, 1246.51], "bbox_id": "e7b6467032", "file": "AppomattoxNewspapers_1908-1909a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. fith.grade, Touiae Lewis, Cur- tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, Eli zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, I Garland Harding. 1st grade, Mabel Martin, Ola Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb.Oarl Carson. I A p pomattox A. H. S. 4th year, Luciile Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary Jamerson, Louise Scruggs, Floyd Dinkins. 2nd year. Verta Simms, Hallie Chilton, Kathleen Paulette, Dora Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman- I tha Pippin, Homer Babcock, Edith OBrien, I 1st year, Bertha Rogers Fay I Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, i Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw-"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Touiae Lewis, Cur- tis <mark>Cawthorn</mark>. 6th grade, Coy Mae"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Touiae Lewis, Cur- tis <mark>Cawthorn</mark>. 6th grade, Coy Mae"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [387.33, 695.11, 568.88, 1670.83], "bbox_id": "ffd7552000", "file": "AppomattoxNewspapers_1926-1933a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. 5th grade, Louise Lewis, tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, Garland Harding. 1st grade, Mabel Martin, Ola I Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb, Carl Carson. A ppomattox A. H. S. 4th year, Lucille Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary I Jamerson, Louise Scruggs, I Floyd Dinkins. I 2nd year. Verta Simms, Hallie I Chilton, Kathleen Paulette, Dora I Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman tha Pippin, Homer Babcock, Edith OBrien, 1st year, Bertha Rogers Fay Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw ley, John Hesson, James Morris, Charles James, Holcomb Cald well. 7th grade, Lucille Crailt, Eve lyn Dickerson, Adelina Fergu- Ison, Josephine LeGrand. j 6th grade, Mandane Anderson, Nellie Bloxton, Carrie Jamerson, I Hilda Moore, Eloise OBrien, I Claudine OBrien, Mary Smith, I Elizabeth Trent, Billie Hubbard, I Garland Plunket. 5th grade, Ruby Cole, Marion Agee, Margaret Carter, Eliza beth Cralle, Mary Clark, Leilas Davis, Mabel Hall, Thelma Mor ris, ary McNally, Annie Mar shall, Mabel Smith, Dorothy Tweedy, Elliott Torrence, Ray mond Jamersoh, Lawrence Moore, Harry Lee. 4th grade, Geneva Wingfield, Willie Guthrie Anderson, Erna Dickerson, Loraine Handy, Christine Caldwell, Roberta Dinwiddle,  Edith Franklin, Cecil Torrence, Billy Smith, John Cole, Charles Guill, Davie Carter. . 3rd grade, Anna Carter, Yir- I ginia Christian, Edith Cole, Net- I tie Davidson, Olla May Dinkins, Hattie Guill, Virginia Epes Irby, I Edith Lucado, Susie Plunkett,"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "grade, Louise Lewis, tis <mark>Cawthorn</mark>. 6th grade, Coy Mae"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "grade, Louise Lewis, tis <mark>Cawthorn</mark>. 6th grade, Coy Mae"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [379.47, 1279.16, 537.75, 1351.36], "bbox_id": "4c8ee7bb0f", "file": "AppomattoxNewspapers_1908-1909a_0057.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Aliee Cawthorn, Walker Cawthorn, Walker Çaw- thiíh, France- Cawthòfri..   3rd grade, Louie Manti. 5th grade, Loui-ie Lewis, Sallie Mann, Curtir Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Aliee <mark>Cawthorn</mark>, Walker <mark>Cawthorn</mark>, Walker Çaw- thiíh, France- Cawthòfri..   3rd grade, Louie Manti. 5th grade, Loui-ie Lewis, Sallie Mann, Curtir <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade, Aliee <mark>Cawthorn</mark>, Walker <mark>Cawthorn</mark>, Walker Çaw- thiíh, France- Cawthòfri..   3rd grade, Louie Manti. 5th grade, Loui-ie Lewis, Sallie Mann, Curtir <mark>Cawthorn</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.09, 505.48, 1847.66, 599.96], "bbox_id": "27f8832de9", "file": "AppomattoxNewspapers_1908-1909a_0184.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade  Alice Cawthorn. 2nd gradeFrances Cawthorn. 3rd grade-W alker Cawthorn. 4th grade-Davie Mann. 6th grade-Louise Lewis, Sal- lie Mann. 7th grade-Coy Mae Mann."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade  Alice <mark>Cawthorn</mark>. 2nd gradeFrances <mark>Cawthorn</mark>. 3rd grade-W alker <mark>Cawthorn</mark>. 4th grade-Davie Mann. 6th grade-Louise Lewis, Sal- lie Mann. 7th grade-Coy Mae Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL 1st grade  Alice <mark>Cawthorn</mark>. 2nd gradeFrances <mark>Cawthorn</mark>. 3rd grade-W alker <mark>Cawthorn</mark>. 4th grade-Davie Mann. 6th grade-Louise Lewis, Sal- lie Mann. 7th grade-Coy Mae Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [385.2, 1287.0, 543.69, 1357.41], "bbox_id": "0e5f5d5d39", "file": "AppomattoxNewspapers_1926-1933a_0057.pdf", "page": 1, "text": "WESLEY CHAPEL  1st grade, Alice Cawthorn, Walker Cawthorn, Walker Caw- thofn, France Cawthorn. 3rd grade, Louie Mann. 5th grade, Louiae Lewis, Sallie Mann, Curtis Cawthqrn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL  1st grade, Alice <mark>Cawthorn</mark>, Walker <mark>Cawthorn</mark>, Walker Caw- thofn, France <mark>Cawthorn</mark>. 3rd grade, Louie Mann. 5th grade, Louiae Lewis, Sallie Mann, Curtis Cawthqrn."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "WESLEY CHAPEL  1st grade, Alice <mark>Cawthorn</mark>, Walker <mark>Cawthorn</mark>, Walker Caw- thofn, France <mark>Cawthorn</mark>. 3rd grade, Louie Mann. 5th grade, Louiae Lewis, Sallie Mann, Curtis Cawthqrn."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1898.4, 378.44, 2220.67, 625.74], "bbox_id": "5e130d93cc", "file": "AppomattoxNewspapers_1902-1905a_0464.pdf", "page": 1, "text": "were gone out of it, I wondered what she were going to do with hit. Well, Sunday I knew what she had j done she were wearing hit for it bustle, and you should have seen her cat about in front of that mor row and then the window, until she saw the nw minister coming along then she started out in front of hiui, twisting and turning fit to kill, when all at ouce both feet flew E v erg reeu . I frQm untjer her and you could have Misses Vashti Davis and Lena! hearn the basket splits crashing aud Woolridge, spent last Sunday as the I brealcinif I dont know how far. guests of Miss Bertha Woolrdge. I  ej the new minister jumped out Mr. Edmond Cawthorn has pur-10 his buggy and ran to her, for he chased a loi, of Mr. Frank Thornton I thought she had broken every bone at this place and will soon have a h e r body. So he put hia arm uice dwelling aud sto e built DP around her and said, so sweet and - hMi,,- liow. My dear lady, are you hurl? lean on me. Oh she said,  this"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "jumped out Mr. Edmond <mark>Cawthorn</mark> has pur-10 his buggy"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "jumped out Mr. Edmond <mark>Cawthorn</mark> has pur-10 his buggy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [562.12, 1473.62, 720.22, 1867.35], "bbox_id": "a4e214aec5", "file": "AppomattoxNewspapers_1898-1902a_0486.pdf", "page": 1, "text": "were as follows Miss Ella Gaw thorn and Sam Jennings, Miss Mas- sie Caw thorn and Scott Shorter, Mr. and Mrs. Childress and Messrs. John and Willie Caw thorn. Messrs. Austin aud Huddeneli visited the. old surrender grounds at Appomattox on Sunday evening. Miss Sadie Coleman, of West Ap pomattox, was the guest of Miss Mazie McDtfarmou on Wednesday last. - Mrs. Bettie Chism celebrated her 69tii birthday on Friday last. She is well apd strong. She wasnt forgotten on that clay. Misses Willie and Nannie Wool dridge and Nannie Simms and Messrs. Chap Simms and Dabney Inge spent Saturday and Sunday last at Mr. Daniel Fergusons near the Old C. H. , Miss Carrie Cawthorn, who has been ill for the past few days is im proving slowly, we are glad to state. Mr. Ellis Simms, of Roanoke, was the guest of his parents of near here last week. Mr and Mrs. Pfizer Gills were the guests of Mr. nd Mrs. Henry Pitman on Saturday night last. Misses Massie Cawthorn, Mada- line Colemau, Ella Cawthorn, Mazie McDearmou, and Messrs. Johnnie Jennings, Jim Hamilton, Sam Jen nings, Edmond Cawthorn, Hubnard Coleman, and William McDearmon attended the supper and dance given at Mr. Scott Shorters on Saturday"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "C. H. , Miss Carrie <mark>Cawthorn</mark>, who has been ill"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "C. H. , Miss Carrie <mark>Cawthorn</mark>, who has been ill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [370.53, 365.89, 532.75, 1005.48], "bbox_id": "c04739e6bc", "file": "AppomattoxNewspapers_1908-1909a_0433.pdf", "page": 1, "text": "Well the great campaign is over, next comes Thanksgiving Day, so lets give thanks to God for his protection and guidance. Mrs. Lillie Inge, who has just undergone a very serious opera tion at Baptist Hospital is get ting along as well as could be expected. Her daughter, Mrs. Lawrence Young, who was a re cent patient there, has returned home and is improving fast. We hope mother and daughter will soon be restored to health. Mr. James Alfred, of Bristo who has been visiting his grand daughter, Mrs. W. J. Smith, has returned to his home. Mrs. H. Smith and child ren, of Buckingham, were the guests ofMr8. J. J. Farrar Sat urday night. .... Rev. J. E. White and wife and Mr. and Mrs. J- P. Paulett at tended the district Stewards meeting in Lynchburg Saturday. Our community was shocked and saddened last Friday after noon by the sudden death of Mrs. Bettie Cawthorn. She was sit ting in her chair when the call came and she passed to her eternal4 home as a little child drops to sleep without a murmer.  She was a devoted mother, a kind friend and neighbor and will be missed in her church and community. She enjoyed ming ling with her friends and neigh bors. She is survived by the following children Edmond, Hector and Russell, Mesdames. J. R. Hamilton, S. J. Jennings, W S. Farrar and Sam Staples. She was laid to rest in the family cemetery at noon Sunday. Fun eral services were conducted by her pastor, Rev. J. E- Goad, as sisted by Rev- Lofflin of Church  Roads. Her popularity was attested by the unusual large crowd and beautiful floral, de signs. The family have deepest sympathy."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "death of Mrs. Bettie <mark>Cawthorn</mark>. She was sit ting"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "death of Mrs. Bettie <mark>Cawthorn</mark>. She was sit ting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.87, 535.09, 2486.98, 945.68], "bbox_id": "65b1216912", "file": "AppomattoxNewspapers_1949-1952a_0580.pdf", "page": 1, "text": "weeks now Slates of delegates to district and state conventions were elected at a Democratic mass meeting last Fri day night at the court house. The meeting adopted two resolutions one endorsing Watkins M. Abbitt for renomination and re-election to Congress from the Fourth District, introduced by Calvin Robinson and one endorsing the record of United States Senator Harry F. Byrd, in troduced by C. W. Smith. Congressman W. M. Abbitt was present and addressed the meeting. Charles F. P. Crawley served as the presiding officer of the meeting and C. W. Smith served as secretary. The following delegates, instruct ed to vote as a unit, were named to the Fourth District Convention in Petersburg, May 24 J. A. Bingham, George Abbitt, Jr. G. T. Moses, Sr. G. B. Buchanan, J. H. OBrien, Wal lace E. Bondurant, John E. Burnett, Mrs. N. A. Wagers, N. E. Farrar, C. C. Harvey, Mrs. J. W. Flood, Mrs. Hazel R. Mann, Grover E. Smith, E. T. Guill, C. T. Moses, Jr. H. C. Pulliam, Mrs. Margaret Calcott, R. C. Hubbard, P. B. Stratton, Calvin H. Robinson, J. A. Burke, D. A. Conner, J. W. Cawthorn, F. J. Smith, Irby B. Wheeler, David T. Robertson, Chas. F. P. Crawley, T. C. Ligon, W. W. OBrien, Mrs! C. H. Robinson, Mrs. F. C. Dresser, J. W. Conner, Tobey E. Inge, Eula M. Burke, R. D. Robinson, W. D. Fer guson, H. A. Williams and John P."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "A. Conner, J. W. <mark>Cawthorn</mark>, F. J. Smith, Irby"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "A. Conner, J. W. <mark>Cawthorn</mark>, F. J. Smith, Irby"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.92, 647.06, 1707.97, 964.5], "bbox_id": "1816e14d4e", "file": "AppomattoxNewspapers_1974-1975a_0184.pdf", "page": 1, "text": "Week end guest of Miss Dorma Cawthorn was Miss Mary Beth Carter. Mr. and Mrs. Clarence Coffey of Covington and Mr. and Mrs. Arron Wilson, Wesley and Jim of Richmond spent Saturday with Mr. and Mrs. Thomas Woodall and Lisa. The occasion was Lisas 4th birth day. Mr. and Mrs. Bill Watson and children visited in this home Saturday night. Pvt. Jamie Maxwell has arrived safely in Frankfurt, Germany. Where she will be for two years. We will miss her but each of us wish her health, success and happiness and a safe return home. M iss Dawn Deaner had Miss Shilia Wooten as a supper guest Friday night. Mr. and Mrs. Jimmie Wood- all of Richmond visited Mrs. Charlie Bagby Saturday after noon. Mr. Alfred Almond, Mrs. Raymond Franklin and Mr. L. H. Watson called in this home last week,  -We are very sorry to hear"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "guest of Miss Dorma <mark>Cawthorn</mark> was Miss Mary Beth"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "guest of Miss Dorma <mark>Cawthorn</mark> was Miss Mary Beth"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1816.54, 1472.89, 2232.64, 1530.64], "bbox_id": "f74d95387c", "file": "AppomattoxNewspapers_1915-1918a_0151.pdf", "page": 1, "text": "week end at Mrs. home near Manteo. ren were tn gueste oi uar. Wince Tibbs last Sunday. ! Mr. and Mrs. Floyd Wood,1 spent a while Sunday with her home people Mr. Sam Cawthorn"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "home people Mr. Sam <mark>Cawthorn</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "home people Mr. Sam <mark>Cawthorn</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1847.73, 449.22, 2008.86, 519.72], "bbox_id": "d2f9a6d644", "file": "AppomattoxNewspapers_1926-1933a_0429.pdf", "page": 1, "text": "We wish to thank our friends or their kindness in the recent ereavement of our mother, Mrs. J. D. Cawthorn, also for use of cars. i I rs . J. R. H amilton , B rothers and S isters ."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "mother, Mrs. J. D. <mark>Cawthorn</mark>, also for use of"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "mother, Mrs. J. D. <mark>Cawthorn</mark>, also for use of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [148.8, 222.39, 331.93, 1666.13], "bbox_id": "c3a1b4e7a6", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "We w ere sad d led when word came Sunday that Mr. W. M. Blade had passed away. Our love and deepest sympathy are extended her loved ones. Our prayers and sympathy are with the family and loved ones of Mr. Zack Cheatham, who passed away last week. We were very sorry to learn of the illness of Mrs. Sandy Baldwin of North Dakota. Our sincere prayers are with her and each of the family. We were very sorry to hear of the death of Mrs. Alfred LeGrande. Deepest sympathy is extended her loved ones. Mr. James Maxwell returned home Friday from the hospital. We wish for him a very speedy recovery. The families of the late Mi. and M rs. W. L. Turnes celebrated their family reunion Sunday at the home of Mrs. J. L. Torrence. Mr. H. W. Jenkins and son, Mr. Robert Jenkins attended the funeral of Mrs. Ossie Key of Bedford Saturday. She was a very dear relative of the late Mrs. H. W. Jenkins. Mr. and Mrs. Bill Watson and family returned home Friday after spending their vacation at W illiamsburg and Virginia Beach. Visiting Mr. and Mrs. Robert Coleman last week were Mr. and Mrs. Calvin Smith, Bobby and Tammie Smith. Visiting MrJ and Mrs. Scott Sheets several days last week was his sister, Mrs. Violet Pittsinger of Eaton, Ohio and Mr. and Mrs. Paul Sheldon of Columbus, Ohio, Mr. and Mrs. Edward Greer and family are visiting in the home of Mr. and Mrs. L. L. Webb and family. Visiting Mr. and Mrs. L. H. Watson Sunday were Mr. and Mrs. Raymond Franklin, Mr. and Mrs. W. H. Wingfield, Miss Julia Wingfield and Mr. and Mrs. Eddie Wooten and son. Among others visiting in this home last week were Mr. and Mrs. Berkley Drinkard and family, Mr. and Mrs. Berkley Brown, Mr. and Mrs. Walker Shupe, Mr. Alfred Almond and Mr. and Mrs. Alton Lucado and family. Mrs. B. B. Harris, Sr. was a visitor Monday night of Mrs. Virgie Beasley, Mrs. Claude Hamlett and daughter Brenda spent Friday with M rs. Beasley. Mr. and Mrs. George Inge of Chester, VA visited her Saturday and Mr. Grover Beasley, Jr. visited her Sunday. Mrs. Holly Cawthom, Mrs. Rachel Cawthorn and Mrs. Raymond Harris were visitors in the homes of Mr. H. W. Jenkins, Mr. and Mrs. L. H. Watson and Mrs. Mary Bagby, Wednesday evening. Mr. and Mrs. A. B. Franklin, Jr. and family of Chase City were visitors Thursday after noon of Mr. and Mrs. R. M. Webb and family. Mrs. Elmo Smith recently spent a week with her sons at Grottos, VA. Mr. Smith spent the week end in this home. Mr. and M rs. Ryland M ayberry and M rs. loan Mayberry of Newport News spent the week end in the homes of Mr. and Mrs. Kenneth Deaner and family and Mr. and Mrs. Roy St.John. The W. H. Wingfields visited in the homes of Dr. and Mrs. Tom Sumaker and family and Mr. and M rs. Billy Inge Wednesday night. Dinner guest Thursday of Mrs. Mary Bagby were Mrs. Mary Higgins, Mrs. Shirley Carson, Mrs. Loveline Scruggs, Mrs. Katherine Wingfield, Mrs Ruby Woodall and daughter Tj. Calling in this home last week w ere M rs. M. L. Covington, Mrs. Andy Davis, Mrs. loan Mayberry, Mrs. Kenneth Deaner. Miss Dawn Deaner, Mr. H. W. Jenkins, Mrs. Shirley Franklin and daughter. Pamela. Mr. and Mrs. Frank Scham- pel were visitors Sunday night of M. and M rs. W. H. Wingfield and family. Mr. and Mr- K enneth Deaner and family. Mrs. loan Mayberry and Mr. And Mrs. Ryland Mayberry spent Sun day in Roanoke with Mr. and Mrs. Kenneth Wingfield and family. They celebrated Mr. Wingfields birthday Sunday with a lovely dinner. I Mr. and Mrs. James Woodall Visited Mr. and Mrs. Thomas Woodall and family and Mrs. Mary Bagby Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Holly Cawthom, Mrs. Rachel <mark>Cawthorn</mark> and Mrs. Raymond Harris"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Holly Cawthom, Mrs. Rachel <mark>Cawthorn</mark> and Mrs. Raymond Harris"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [582.94, 1601.35, 747.57, 1839.35], "bbox_id": "b521da70e1", "file": "AppomattoxNewspapers_1898-1902a_0260.pdf", "page": 1, "text": "We, the undersigned have seen a card in the New-Herald of Oct. 26, 1899, reflecting upon the mem bers of the Democratic Committee of Appomattox county, to which our names are signed. We desiri to state hat we never saw until to dav the address issued and pub lished by said Committee and after reading it are unable to point out hii incorrect sentence in it. We further state that we know every member of said Committee to be hightone. truthful gentlemen and would not and could not say or pub lish one word detrimental to the eleven gentlemen who compose the committee. We have never signed or authorized our names to be signed to the card above alluded to know ing its contents. E. N. Wooldridge, J. W. Evans, L. E. Rutledge, J. D. Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "E. Rutledge, J. D. <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "E. Rutledge, J. D. <mark>Cawthorn</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1727.05, 993.29, 1894.32, 1012.39], "bbox_id": "ca37c02175", "file": "AppomattoxNewspapers_1943-1947a_0032.pdf", "page": 1, "text": "We regret to report that E. Hs Cawthorn is sick."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "We regret to report that E. Hs <mark>Cawthorn</mark> is sick."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "We regret to report that E. Hs <mark>Cawthorn</mark> is sick."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [831.32, 467.23, 989.12, 625.81], "bbox_id": "3b3bcd6c95", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "We have read the above state ment of Mr. Ferguson in reply to the letter of Mr. Cawtborn of October 18th, and we concur fully in that statement so far as it re lates to what transpired between all of us at the Clerks office up on the occasion referred to by Mr, Cawthorn. We have also seen Mr Cawthorns account of what oc curred on th at occasion and know that it is incorrect. M. W. C arson . J. R H orsley . O W . S m ith . adv G. M. D r in k a r d ."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "referred to by Mr, <mark>Cawthorn</mark>. We have also seen"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "referred to by Mr, <mark>Cawthorn</mark>. We have also seen"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.45, 896.66, 1535.2, 1126.76], "bbox_id": "849a0707ce", "file": "AppomattoxNewspapers_1908-1909a_0080.pdf", "page": 1, "text": "We have had Some fine ground hog weather. Mrs. Randolph Caldwell has been quite ill, but is better at j b wished for I this writihg. I Cawthorn, 1 We regret to hear of Mrs- Willie Giles leaving the neigh borhood. She was a kind good th e Werectiou h2i8hbo d I am sure she will Lon its tot on p misseabyall.  I L. Brown is We are glad to hear that Mr. the building I Perce Odr is improving. Rev. Thompson preached a fine sermon at Liberty Church Sunday. . Mr. Robert Hollycross and little son, John Randolph, have been sick, but they are improv ing-"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "I this writihg. I <mark>Cawthorn</mark>, 1 We regret to"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "I this writihg. I <mark>Cawthorn</mark>, 1 We regret to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.1, 818.28, 1839.14, 892.88], "bbox_id": "28e4216918", "file": "AppomattoxNewspapers_1943-1947a_0341.pdf", "page": 1, "text": "We had a pleasant chat with Jack Cawthorn, son of Mr. and to . T. Ji. Cawthorn, yesterday. He followed the  Pacific war from Attu to Okinawa, and looks to be in fine shape, although he was due today at the Army Hospital at Staunton for a check-up."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "pleasant chat with Jack <mark>Cawthorn</mark>, son of Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "pleasant chat with Jack <mark>Cawthorn</mark>, son of Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [350.4, 325.2, 511.07, 733.31], "bbox_id": "e7266f41e7", "file": "AppomattoxNewspapers_1908-1909a_0264.pdf", "page": 1, "text": "We had a few days of the -good old summer time last week, but heard of no prostra tions with the wheat threshers. Mrs. E. G. Harvey, who was visry ill last week is improving. Rev. and Mrs. T. El Goad and Mr. J. L. Clark and Mr, Cal Ransom attended the dedi cation at Spring Creek Church Sunday. Mrs. W. B. Thomas was the guest of Mrs. Ohas. Harvey and Mrs. E. E Walker at Pamp- lin last week. Miss Elsie Marks was the guest of Miss Madian Lee and Mrs. J. J. Farrar last week. Mrs. E- D. Glover, who had her.eye taken_ out is getting along nicely. The Sunday School rooms of the Methodist Church is go ing up in a hurry. Mrs. Sallie Cawthorn, of Richmond, is the guest of her sister, Mrs. J. R. Lee, though confined to her wheel chair she is a comfort to her invalid sis ter. There willbe a lawn party given by the ladies of the Meth- odisfrChurch here, at the school house next Saturday, July 5, beginning at 5 oclock P. M. be sure to come. We are expect ing you. . ... . .... p    - R ocks N ew s"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "a hurry. Mrs. Sallie <mark>Cawthorn</mark>, of Richmond, is the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "a hurry. Mrs. Sallie <mark>Cawthorn</mark>, of Richmond, is the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [317.74, 304.31, 480.86, 692.64], "bbox_id": "17ca130a86", "file": "AppomattoxNewspapers_1926-1933a_0343.pdf", "page": 1, "text": "We enjoyed the day so very much at Evergreen Baptist Church Sunday. We appreci ate the welcome with which we andall other neighboring bretheren were received. We delighted to see the progress that has been made at this church. May our God ever hold her up in the future as in he past. Rev William Warren preach ed at Rocks Church Sunday night. Our hearts were made to rejoice with having our old pastor back with us again. Mrs. Anderson is still con fined to her room. Mr. Tom Cress is still un able to be at work. Mrs. D. R. Inge visited her brothers, P. O. and Wilson Paulett, Sunday evening. Miss Bradley Cawthorn spent the week-end with Laura Inge.  Miss Rachel Inge entertain ed a number of her little friends Saturday night play ing games, eic."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Sunday evening. Miss Bradley <mark>Cawthorn</mark> spent the week-end with"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Sunday evening. Miss Bradley <mark>Cawthorn</mark> spent the week-end with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [315.84, 285.07, 479.92, 674.11], "bbox_id": "7d7d48c1c1", "file": "AppomattoxNewspapers_1908-1909a_0343.pdf", "page": 1, "text": "We enjoyed the day ao very much at Evergreen Baptist Church Sunday. We appreci ate the welcome with- which we andall other neighboring bretheren were received. We delighted to see the progress that has been made at this church. Mfly our God ever hold her up in the future as in the past. Rev William Warren preach ed at Rocks Church Sunday night. Our hearts were made to rejoice with having our old pastor back with us again. Mrs. Anderson is still con fined to her room. Mr. Tom Cress is still un able to be at work. Mrs. D. R. Inge visited her brothers, P. O. and Wilson Paulett, Sunday evening. Miss Bradley Cawthorn spent the week-end with Laura Inge.  Miss Rachel Inge entertain ed a number of her little friends Saturday night play ing games, etc."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Sunday evening. Miss Bradley <mark>Cawthorn</mark> spent the week-end with"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Sunday evening. Miss Bradley <mark>Cawthorn</mark> spent the week-end with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.47, 662.05, 1892.67, 1089.89], "bbox_id": "3839dfc5e2", "file": "AppomattoxNewspapers_1949-1952a_0203.pdf", "page": 1, "text": "We are very proud of the foot ball team for their victory over Randolph-Henry of Charlotte Court House here last Friday nizii.. The score was 277. The touchdowns were made by Cawthorn, Doss and Mitchell. Chernault and Dos3 con verted for the extra points. We were sorry many of our playets suffeied injuries, but all of them are expect ed to see action in Fiiday nignts game at Blackstone. We notice 1 several members of last years foot ball squad at the game last Friday, namely Harry Gordon Lawson and Dick Marks, who are attending the University of Virginia.  Everyone is busy making- plans for the big Homecoming Day which is only one week from tomorrow. We would like to congratulate Jim my Harris and Martha Nash from the high school and Hal Flood and Robbie Lee Robertson of the grades, who were chosen to reign over this celebration. We appreciate the visit of Mr. William E. Hanson, Lynchburg, to our school on Monday and gave a talk to the members of Hi-Y and Tri-Y. He explained the aims - of these clubs. We hope he will visit us again. We were glad too hear that the photographer is coming next week to take pictures for the annual. Thats about all for this, week so, until we meet again somewhere be tween this week-end and next week or, if we dont, Ill see you next Thursday."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "touchdowns were made by <mark>Cawthorn</mark>, Doss and Mitchell. Chernault"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "touchdowns were made by <mark>Cawthorn</mark>, Doss and Mitchell. Chernault"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [884.88, 236.53, 1029.82, 1009.25], "bbox_id": "16d6fe34a7", "file": "TimesVirginian_1976_0218.pdf", "page": 1, "text": "We are very proud and lappy to have six of our young eople of Hollywood Church graduating this year Lelia Maxwell, Debra Scruggs. De- orious Deaner, Beverley Cole- nan, Steve Cawthorn and Ben Maxwell. Congratulations to jach of them and all those graduating in the Class Í976 from Appomattox High. Bible School begins at Hollywood Church Monday, Tune 14, and will close Friday, June 18. The school will open at 9 a.m. and close at 12 noon each day. All the families and friends are invited to come Friday night at 8 oclock for the closing exercises.  Miss Julia Wingfield and the Acteens from Hollywood Chur ch called in the home of Mrs. Berkley Brown Sunday after Sunday School. The Acteens of Hollywood met in the home of Mr. and Mrs. Raymond Franklin and family Tuesday night for their June meeting. Mrs. i Paul Balthaser was a welcome-guest at themeeting. Mrs. Franklin served delightful refreshments and everyone enjoyed the social hour very much. Rev. Paul Balthaser went with Mr. H. W. Jenkins to visit Mr. Jenkink mother and sister at the Liberty House Nursing Home in Lynchburg Thursday. We are very sorry to hear Mr. Bennett Gilliam is á patient in the Lynchburg General Hospital. Relatives and friends are praying he may have a speedy recovery. Mr. and Mrs, W. H. Wingfield visited Mrs. Frank Woodall in the Lynchburg Hospital Friday night. We are so glad she is improving nicely. It was good to see Dawn Deaner at church Sunday. She was sick all last week with a virus. Mr. and Mrs. Martin Webb, Mrs. Thelma Martin and Mr. and Mrs. R. M. Webb spent the week end with Mr. and Mrs. Robert Webb and family, of Jappa, Md. Mrs. Raymond Page and Mrs. Gertrude Page visited Mrs. C. R. Banton Tuesday, Mrs. John Goin, Mr. Walker Webb and Mr. Joe Goin visited Mrs. Banton Thursday. Mrs. Emma Lemon was a visitor Sunday afternoon of Mrs. M. L. Covington. M ru -Aiifj Ring,  Mr. Thomas Woodali and Lisa"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Beverley Cole- nan, Steve <mark>Cawthorn</mark> and Ben Maxwell. Congratulations"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Beverley Cole- nan, Steve <mark>Cawthorn</mark> and Ben Maxwell. Congratulations"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [518.62, 633.14, 682.97, 676.99], "bbox_id": "954b08b80e", "file": "AppomattoxNewspapers_1922-1923a_0263.pdf", "page": 1, "text": "We are sorry to state the illness f Mr. Edward Cawthorn, of this ace. Hope he will Soon be out again."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "We are sorry to state the illness f Mr. Edward <mark>Cawthorn</mark>, of this ace. Hope he will Soon be out again."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "We are sorry to state the illness f Mr. Edward <mark>Cawthorn</mark>, of this ace. Hope he will Soon be out again."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1902.52, 406.21, 2053.94, 650.45], "bbox_id": "4702a6790c", "file": "AppomattoxNewspapers_1971-1973a_0406.pdf", "page": 1, "text": "We are sorry to say Mr.  Kenneth Moore is still very ill. He is in an Ohio Hospital. Mrs. M argaret Marshall spent the week end with her daughter-in-law and son, Jim my Marshall and family. Mr. and Mrs. Coleman Moore and daughter, Pam of Virginia Beach were dinner guest, Monday of his father and family, Mr. and Mrs. Clarence Moore. Mr. and Mrs. Walker Cawthorn was on their vaca tion in Florida. And Mr. Caw thorn had a heart attack and is I in the hospital down there very iU. Mrs. Maggie Gardner got the word Sunday afternoon for their son, Tommy Cawthorn to come at once. Do hope him a speedy recovery."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Mr. and Mrs. Walker <mark>Cawthorn</mark> was on their vaca"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Mr. and Mrs. Walker <mark>Cawthorn</mark> was on their vaca"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [271.21, 1101.25, 413.98, 1277.8], "bbox_id": "a70a98ea28", "file": "AppomattoxNewspapers_1962-1965a_0179.pdf", "page": 1, "text": "We are so s Tommy Cawthorn, i doing fine after his i is in Farmville Hosij Mrs. O. W. Martin Moore. Mrs. Herbert Richardson, and Mis. Clarke Moore visited friends and relatives in Fann- ville Saturday. Mr. and Mrs. Gordon Saunders and children, of Lynchburg, visit ed Mr. and Mrs. Jimmy Mar shall Sunday afternoon, also Mrs. T. M. Cunningham, of Appomat tox. Mis. Harold Martin and son, Louis spent Sunday with her parents, Mr. and Mrs. H. H. Caldwell."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "are so s Tommy <mark>Cawthorn</mark>, i doing fine after"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "are so s Tommy <mark>Cawthorn</mark>, i doing fine after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [388.48, 1144.78, 548.95, 1478.58], "bbox_id": "f3aae33db9", "file": "AppomattoxNewspapers_1926-1933a_0459.pdf", "page": 1, "text": "We are glad to see the sun shine after so much rain. Many tobacco crops were destroyed by high water, also corn crops. Mr. W. E. Moore is sick again we trust he may soon be out. Mrs. E. W. Moore, of near Bent Creek, spent Sunday and Monday with her mother, Mrs. Emily Burge, who keeps quite sick, at her daughters, Mrs. C. A. Moore- Also Mr. and Mrs Fletcher Burge, Jr., and son, of near Stapleton, were visitors in this home Sunday afternoon. Miss Lois Martin, of near Oak ville, is visiting her aunt, Mrs. H. R. Moore. Miss Virginia Moore has re turned home after spending some time with relatives at Ap pomattox. Miss Nellie Cawthorn, of Ap pomattox, spent the week-end in the home of Mr. M. T. Mar tin. Revival meeting begins at Mt. Comfort church next Sunday."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Ap pomattox. Miss Nellie <mark>Cawthorn</mark>, of Ap pomattox, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Ap pomattox. Miss Nellie <mark>Cawthorn</mark>, of Ap pomattox, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [866.91, 1512.95, 1343.47, 1589.0], "bbox_id": "be1cf3711e", "file": "AppomattoxNewspapers_1908-1909a_0220.pdf", "page": 1, "text": "waXIICrillC Webb incr nntfl 1 o a  a I aa L  j vWorfl smith. Rnn.  C.C. Harvey and Prank T. other momlnv f r o  n f  f t . ln m S T  S Cawthorn on motion of B. L. clock S S A i i  i  Dls lct-  J. W. Fiahbourae Burke, county treasurer, were ieceivw an  BepresentSK appointed deputy treasurers. R. u1!?e! l ecy. . w11. fotl!e Seventh.  W- Smith was given a soft thA nfflp u v u ftL F -If -the plan goes throuvh  drink license. -TS. Mcuilly questethat fakJ ?id Mr Byrd  we wirid be"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "m S T  S <mark>Cawthorn</mark> on motion of B."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "m S T  S <mark>Cawthorn</mark> on motion of B."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1949.75, 368.29, 2115.92, 748.18], "bbox_id": "b94c8a83f5", "file": "AppomattoxNewspapers_1922-1923a_0310.pdf", "page": 1, "text": "Water melons are plentiful. Mr. James Cawthorn carried a big load to Evergreen Saturday. Mrs. Daisy Woolridge attended  the funeral of Mr. John Lucado of Lynchburg on Friday last. Mr. John Bagby aud wife re turned home from Lynchburg last Saturday. Messrs. S. V. Beasley and M. L. Covington, attended the Appomat tox Association at Midway church in Charlotte las week. They report having nada glorious time. We need a phone line from here to Appomattox, and hope the people will soon become interested and put the line into operation. Mr. Taylor, the R. F. D. Inspec tor was with Mr. Alex WingfieW last Friday inspecting his route. Each correspondent of this paper should accord a vote of thanks to the author of that poetical jein in the last number of this paper, Aud I Will Give You Rest. Ah, yes we have read in the Book of truth where He said Come Ye that are heavy laden and I will give you rest. Mr. Jim Coghill has returned  to Roanoke after a weeks visit here."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "are plentiful. Mr. James <mark>Cawthorn</mark> carried a big load"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "are plentiful. Mr. James <mark>Cawthorn</mark> carried a big load"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [518.6, 1220.82, 2422.85, 1656.84], "bbox_id": "2d9240cdcf", "file": "AppomattoxNewspapers_1952-1954a_0463.pdf", "page": 1, "text": "WATCH NIGHT SERVICE SUPERB FLAVORING March 5.- Curry Harvey named to head local Red Gross drive. Goal is set at 2,337,  j j , V March 6.-FVed Caw to represent county in public speakihg.contest. March 6.C AmericaV Legion spon sors oratorical contest.  s March 13.- Pamplifi.-H. S, plays in district basketball tournaifient finals. March 16.- Mrs. Louise T. Brown elected head of local Eastern Star. March 19.- Highway Dept, states 4193,000 allocated for new fiscal year for Appomattox secondary roads. March 26.- Bloodmobile visits Ap pomattox. March 26.- Crawford Davidson at tending Cardinal baseball training camp at Albany, Ga. March 26.- Proposed Appomattox County budget publisbed. March 27.- Spelling Bee finals are held at A. H. S. April 1.- Service station property here on Route 460 purchased by new church group for house of worship. April 2.- James Richard Redding, Jr. hit by train here, dies following Sunday. April 2.- A. H. S. senior play pre sented. April 4.- Dr. S. S. Shouse appoint ed Norfolk Health Director. April 8.- J. W. Cawthorn, former town manager, dies. April 9.- Appomattox observes the 88th anniversary of the peace made at Old Court House in 1865. April 10.- Trial Justice C. F. P. Crawley named to serve as town judge for Appomattox. April 13.- Appomattox starts an-"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "April 8.- J. W. <mark>Cawthorn</mark>, former town manager, dies."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "April 8.- J. W. <mark>Cawthorn</mark>, former town manager, dies."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1488.46, 738.57, 1621.01, 1241.5], "bbox_id": "b8bd34d63d", "file": "AppomattoxNewspapers_1974-1975a_0136.pdf", "page": 1, "text": "was quite foggy here ay. v. and Mrs. Don Wagner Gary left on last Tuesday Winston-Salem, N.C. to d Christmas with their son is and familv. They rned Thursday night. . and Mrs. Wilson Almond return this week from a to Kenya, Africa with her her Jay Stew art and r. They left on December lor the trip. ite a few families had their ten with them during the tmas holidays. .apd Mrs. Glenn Martin Mr. and Mrs. Samuel in and Bob spent Friday in mqrkd with, Mf. and Mrs. dy Bradshaw,  m J ._juid MrsJlill_ Caldel boys left on Triday lor insville for a few days with arents. mpathy is extended to Albert Baird nee Jessie erald and Mrs. Norman cer of Buckingham in the of their brother. Moon raid of Farmville. Also, athy is extended Mrs. Schaubach of Crewe nee Cawthorn in the death husband last Friday and uried at Appomattox last y. and Mrs. Glenn Mein- and Melinda spent Satur- night and Sunday at rd with Mr. and Mrs. Elder. The Rocks Quar- ill sing at Rocks Church day night at 730 PM. The Extension Home Makers will meet with Mrs.  f n c e Ran son on January th 730 PM. Note change of"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Schaubach of Crewe nee <mark>Cawthorn</mark> in the death husband"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Schaubach of Crewe nee <mark>Cawthorn</mark> in the death husband"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.5, 454.29, 2205.06, 855.8], "bbox_id": "d2ba9c986c", "file": "AppomattoxNewspapers_1933-1936a_0007.pdf", "page": 1, "text": "was delivered at the Hixburg Presbyterian church Sunday morning by Mr. Donald Car- son, a recent graduate ot Hampden-Sidney College. Mrs. Colyer S. Parks visited several days last week in the home of her sister, Mrs. R. R. Young, of Prospect. Miss Louie Cawthorn, of Newark, N. J., is spending sev eral weeks with her sister, Mrs. E. A. Covington. Mr. and Mrs. J. Wilbur Da vis, of Harrisonburg, spent sev eral days last week in the home of J. W. Davis, ... Mr. and Mrs. H. C. Wheel er were guests in the home of W. A. Swan. Mrs. R. W. Covington had  as her guests Sunday, two of! her brothers, John and Ray mond Rosser Miss Virginia has recuperat ed from having the measles. Miss Lou Covington and her 1 brother, Henry, visited l a s t  week in ihe home of Mr. and Mrs. E- A. Covington. - -------------- o -------------- - The W.M.U. of Hollywood will have a lawn party at the church Saturday July 1st, be ginning at 530, for the bene fit of the church."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "of Prospect. Miss Louie <mark>Cawthorn</mark>, of Newark, N. J.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "of Prospect. Miss Louie <mark>Cawthorn</mark>, of Newark, N. J.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.13, 409.81, 1154.87, 439.01], "bbox_id": "9bb2c4a885", "file": "AppomattoxNewspapers_1949-1952a_0383.pdf", "page": 1, "text": "was born in Appomattox a son of Schuyler Patterson j llvira Susan Cawthorn Cole- j"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "was born in Appomattox a son of Schuyler Patterson j llvira Susan <mark>Cawthorn</mark> Cole- j"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "was born in Appomattox a son of Schuyler Patterson j llvira Susan <mark>Cawthorn</mark> Cole- j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [852.49, 384.47, 1033.01, 1157.77], "bbox_id": "a8e9eb5f44", "file": "AppomattoxNewspapers_1915-1918a_0502.pdf", "page": 1, "text": "War Stamp Campaign Corn mitt Chairm an, L. Crawlay. Each m inister in county. Row. L. F. Gallaham, Appo m attox. Rev C. W. McElroy, Appo m attox. Rev. J . C. Lops, Appomattox. Rev. O. W. Taylor, Pamplin Rev. A. K. Lambdiu, Pam  plin. Rev. A. J . Ponton, Pamplin Rev. G.A. Chocolate, Phenix Rev. J . H. Gordon, Vera. Rev. O. R. James, Concord. Hon. 8. L. Ferguson, Appo m attox. Claude 8m ith, Appomattox. A. T. Inge, Appomattox. Don Moses, Appomattox. Prof. Bigley, Pamplin. Misa Jennie Godwin, Appo m attox. Hon. J . W. Cawthorn, Appo m attox.  P itser Gills, Appomattox. Hon. R. L. Burke, Appomat tox. 8. Pieree Loving, Pamplin. L.N. Ligon, postmaster,Pam plin. Hon. Willia Ligon, Pamplin. B. G. Anderson, Appomattox. Fenton Harvey, Pamplin. Boy ScoutsJ C. Leps, Ap pom attox. A. H. Clement, Appomattox Dr. D. A. Christian, Vera. Dr. H. 8. H art, Pamplin. Dr. Chap Jonee, Appomattox Dr. D. N. Twyman, Appo m attox. N. R. Feathereton, Vera. E. LeRoy Smith, Appomat tox. Robert Irby, Appomattox. Publicity CommitteeMinis ters of oonnty, A H. Clement L. Crawley. Committee On SchoolsEach teacher in county, and Super intendent of Schools N. R Feathereton. Personal Canvass  To be done by Scouts and sohool ohil dren. Womans OrganizationMrs R. O. W agner, Mrs. Pitzer Gills Mrs. 8. L. Ferguson, Miss Anna Jones, Miss Kate Franklin,Mrs. S. D. Cheatham, Miss Jacque line Atwood, Miss Enla May Burke, Miss M attie Sears, Mrs. John Sears. Mrs. W. T. Steele, 8pout"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "attox. Hon. J . W. <mark>Cawthorn</mark>, Appo m attox.  P"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "attox. Hon. J . W. <mark>Cawthorn</mark>, Appo m attox.  P"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.07, 729.53, 1951.02, 910.68], "bbox_id": "2778bacd56", "file": "AppomattoxNewspapers_1926-1933a_0107.pdf", "page": 1, "text": "W. T. Marshall, G. O. Thorn hill and E. LeRoy Smiththe Electoral Board met last Friday. Following judges and clerks were appointed to conduct primary election Aug. 2, 1927 C. H. R. F. Jamerson, N. R. Featherston, W. M. Hancock Lewis Doss and Lewis Ferguson, Clerks. Cheat woodJ. O. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, Cawthorn, T. H. Ford. E. W."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "erson. ChapJ. L. Lewis, <mark>Cawthorn</mark>, T. H. Ford. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "erson. ChapJ. L. Lewis, <mark>Cawthorn</mark>, T. H. Ford. E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.53, 720.68, 1942.25, 901.13], "bbox_id": "0d6f67f31e", "file": "AppomattoxNewspapers_1908-1909a_0107.pdf", "page": 1, "text": "W. T. Marshall. G. 0. Thorn hill and E. LeRoy Smiththe Electoral B6ard met last Friday. Following judges and clerks were appointed to conduct primary .election Aug. 2,1927 C. H.R. F. Jamerson, N. R. Featherston, W. M. Hancock- Lewis Doss and Lewis Ferguson, Clerks. CheatwoodJ. 0. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, E. W. Cawthorn, T. H. Ford-"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "L. Lewis, E. W. <mark>Cawthorn</mark>, T. H. Ford-"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "L. Lewis, E. W. <mark>Cawthorn</mark>, T. H. Ford-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.06, 331.71, 2011.84, 491.05], "bbox_id": "bfd5960db8", "file": "AppomattoxNewspapers_1939-1943a_0125.pdf", "page": 1, "text": "W. Marsh Mrs. W . A . MtcDear- mon. of Lynchbuqg Mr.and Mrs. Russell Cawthorn of Spout Spring Mr. and Mrs. C. S. McDearmon and Misa Mildred McDearmon, of Appomattox. churches, is direct- lion Bible School at theme of the Friend and Savior pupils were enroll- The following are Sallie Kate Wo- Pollard Mamie Scott Moms Nancy Spain and Mrs. tu."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Lynchbuqg Mr.and Mrs. Russell <mark>Cawthorn</mark> of Spout Spring Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Lynchbuqg Mr.and Mrs. Russell <mark>Cawthorn</mark> of Spout Spring Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1688.4, 595.11, 1848.93, 652.61], "bbox_id": "17321b46d0", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "W. J. Trent, J. F. Dickerson, and J. W. Cawthorn were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "W. J. Trent, J. F. Dickerson, and J. W. <mark>Cawthorn</mark> were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "W. J. Trent, J. F. Dickerson, and J. W. <mark>Cawthorn</mark> were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1153.19, 214.89, 1426.87, 456.93], "bbox_id": "ab533e09c8", "file": "AppomattoxNewspapers_1915-1918a_0210.pdf", "page": 1, "text": "w i  .  at this writing Mrs. JoeB iw k W  dren, of Reusens,a  her parents, Mr. T. Johnson. Mr. Tucker Che . ing fine work  T  threshing machine.  stand he has given e, satisfaction on even wheat he hasthreshej. Mr. B. P, Inge a .., home people here. Mr. Con Tweedy g 4 a broad smile, owing J , vent ofa little gin Mrs. Capps and chiM Norfolk, and Mr and  .., . , ... . - .sell Cawthorn ar . oí 1..Í wwk w,th Miaaee Halbe tbe home Ann rhiYH Ti a R aalrino ShOFO D"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "and Mr and  .., . , ... . - .sell <mark>Cawthorn</mark> ar . oí 1..Í wwk"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "and Mr and  .., . , ... . - .sell <mark>Cawthorn</mark> ar . oí 1..Í wwk"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.07, 963.1, 2026.9, 1041.8], "bbox_id": "d2d6d2fc00", "file": "AppomattoxNewspapers_1926-1933a_0476.pdf", "page": 1, "text": "W esley C hapel S chool buick thorn, Walker Cawthorn. Fourth G rade-Earl Myers. Sixth Grade  Louise Lewis, Ray Myers, Coy Mae Mann."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "W esley C hapel S chool buick thorn, Walker <mark>Cawthorn</mark>. Fourth G rade-Earl Myers. Sixth Grade  Louise Lewis, Ray Myers, Coy Mae Mann."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "W esley C hapel S chool buick thorn, Walker <mark>Cawthorn</mark>. Fourth G rade-Earl Myers. Sixth Grade  Louise Lewis, Ray Myers, Coy Mae Mann."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [306.26, 1353.84, 462.14, 1438.05], "bbox_id": "3f549977ce", "file": "AppomattoxNewspapers_1908-1909a_0197.pdf", "page": 1, "text": "W esley C hapel 1st grade - Alice Cawthorn, ranees Cawthorn.  3rd gradeWalker Cawthorn. 4th gradeEarl Myers. 6th gradeLouise Lewis. 7th gradeCoy Mag Mann,. ----"}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "W esley C hapel 1st grade - Alice <mark>Cawthorn</mark>, ranees <mark>Cawthorn</mark>.  3rd gradeWalker <mark>Cawthorn</mark>. 4th gradeEarl Myers. 6th gradeLouise Lewis. 7th gradeCoy Mag Mann,. ----"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn", "Cawthorn"], "snippet": "W esley C hapel 1st grade - Alice <mark>Cawthorn</mark>, ranees <mark>Cawthorn</mark>.  3rd gradeWalker <mark>Cawthorn</mark>. 4th gradeEarl Myers. 6th gradeLouise Lewis. 7th gradeCoy Mag Mann,. ----"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.7, 1088.03, 2189.59, 1361.74], "bbox_id": "60343482af", "file": "AppomattoxNewspapers_1912-1915a_0375.pdf", "page": 1, "text": "W. E. Wooldridge. Mr. and Mrs. Cawthorn Glo ver and Miss Nina Má Rag A TRACT O r LAND IN BUCK INGHAM rONNTY. VA. , Pursuant to deoree entered In tbe Chan- oery w o w of H. D. Pe row vs. A roller bob ertaon and others, at the Hay term o t the Circuit Court o t Buckingham County, the undersigned Commissioner, .will offer for atae a t publle auction. In the Town of Hoae Bower, near the property. In front of the etore of H. A. Harvey, on F r id a y , J u ly 1 7 th , 191 A, A t 10 oolook, A. M., that tract of land situa ted in BuoUngham County, adjoining the lanns of Lueaao estate, Willie Wat,on,. D. W. Farrow and others, and is tbe same traot of land on which Garant and Nancy Perrow resided Im thelr life time, containing 263 ac res more or less. There is a small dwelling house, orchard and some good timber on this land, TEKM8One-third Cash, balance on one and two yeara credit, retention of title and bonds bearing interest from day of sale will be required, or purchaser may pay all cash A . l i . 6 L B M B N T , Commissioner. In the Clerks Office of the Circuit Court of the County of Buckingham H D. Perrow. Plaintiff, against Archer Bobertson, Defendant. I, W. J. Hubard, Clerk of the said court, do certify th a t the bond required of tbe Commissioner by the deoree rendered in said cause on the 12to day of Hay, 191, has been duly given. Given under my hand as clerk of the said court, this 19th day of June, 1911. 6-24-it W. J. HDBAHD, Clerk."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Wooldridge. Mr. and Mrs. <mark>Cawthorn</mark> Glo ver and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Wooldridge. Mr. and Mrs. <mark>Cawthorn</mark> Glo ver and Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [308.13, 1376.82, 467.67, 1473.07], "bbox_id": "b896846822", "file": "AppomattoxNewspapers_1926-1933a_0197.pdf", "page": 1, "text": "W e sl e y C h a pel 1st grade  Alice Cawthorn, Frances Cawthorn. 3rd grade-Walker Cawthorn. 4th gradeEarl Myers. 6th gradeLouise Lewis. 7th grade-Coy Mae Mann. 2nd grade-Rebecca Myers."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "pel 1st grade  Alice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. 3rd grade-Walker"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "pel 1st grade  Alice <mark>Cawthorn</mark>, Frances <mark>Cawthorn</mark>. 3rd grade-Walker"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [990.24, 463.9, 1272.33, 519.6], "bbox_id": "b7b7aceea4", "file": "AppomattoxNewspapers_1908-1909a_0345.pdf", "page": 1, "text": "W e are allow ed to serve only tw enty-five out side m ares at 15.00 each, cash w ith service see Frank T. Cawthorn and g et your booking for Feb ruaryy March and April."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "service see Frank T. <mark>Cawthorn</mark> and g et your"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "service see Frank T. <mark>Cawthorn</mark> and g et your"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1375.89, 1439.44, 1492.32, 1497.94], "bbox_id": "52eead3509", "file": "AppomattoxNewspapers_1918-1922a_0052.pdf", "page": 1, "text": "W, Cawthorn spent  at Catawba Sani- iattending the gradual i oicises of her daughter, Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "W, <mark>Cawthorn</mark> spent  at Catawba Sani- iattending the gradual i oicises of her daughter, <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "W, <mark>Cawthorn</mark> spent  at Catawba Sani- iattending the gradual i oicises of her daughter, <mark>Cawthorn</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [434.39, 415.54, 531.51, 424.54], "bbox_id": "66f14d6916", "file": "AppomattoxNewspapers_1933-1936a_0143.pdf", "page": 1, "text": "W. Cawthorn is sick."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "W. <mark>Cawthorn</mark> is sick."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "W. <mark>Cawthorn</mark> is sick."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [470.66, 300.26, 765.01, 345.11], "bbox_id": "4f766ad2a9", "file": "AppomattoxNewspapers_1926-1933a_0156.pdf", "page": 1, "text": "Vivian Clarke the teacher. Mr. Richard Singleton was a _ .. J l f .visitor in the home of J. H. Bettie Cawthorn and Mrs.  Marshall Sunday."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Vivian Clarke the teacher. Mr. Richard Singleton was a _ .. J l f .visitor in the home of J. H. Bettie <mark>Cawthorn</mark> and Mrs.  Marshall Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Vivian Clarke the teacher. Mr. Richard Singleton was a _ .. J l f .visitor in the home of J. H. Bettie <mark>Cawthorn</mark> and Mrs.  Marshall Sunday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [849.45, 1026.38, 1016.47, 1085.82], "bbox_id": "936887aa3f", "file": "AppomattoxNewspapers_1943-1947a_0092.pdf", "page": 1, "text": "Visitors of Mr. Mann Sunday were Mrs. Andrew Mann and child ren and Mr. and Mrs. George Mann. W. H. Ferguson has been spend ing awhile with his daughter, Mrs. Leonard Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "his daughter, Mrs. Leonard <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "his daughter, Mrs. Leonard <mark>Cawthorn</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1907.98, 705.93, 2034.91, 873.37], "bbox_id": "ddfcf742eb", "file": "TimesVirginian_1980a_0220.pdf", "page": 1, "text": "Visitors last week in the home of Mr. and Mrs. Monroe Webb and family were Mr. David Cawthorn, Mr. Scott Sheets, Mr. Walker Webb, Mr. Richard Webb and Mr. H. W. Jenkins. ! Relatives and friends of Mr. Ewing Joiner of Herndon, Ky. are happy to know he is back home from the hospital and recovering nicely. We pray he may soon be real well again."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "family were Mr. David <mark>Cawthorn</mark>, Mr. Scott Sheets, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "family were Mr. David <mark>Cawthorn</mark>, Mr. Scott Sheets, Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.23, 347.03, 2386.33, 395.43], "bbox_id": "7a223f926a", "file": "AppomattoxNewspapers_1955-1957a_0251.pdf", "page": 1, "text": "Visitors in the home of Mr. and Mrs. L. H. Watson on Sunday were Mr. and Mrs. Robert Guthrie, Mrs. Rachel Cawthorn and Mr. and Mrs. Paul Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Visitors in the home of Mr. and Mrs. L. H. Watson on Sunday were Mr. and Mrs. Robert Guthrie, Mrs. Rachel <mark>Cawthorn</mark> and Mr. and Mrs. Paul <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Visitors in the home of Mr. and Mrs. L. H. Watson on Sunday were Mr. and Mrs. Robert Guthrie, Mrs. Rachel <mark>Cawthorn</mark> and Mr. and Mrs. Paul <mark>Cawthorn</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.1, 175.98, 2654.76, 590.36], "bbox_id": "fb6a7653cd", "file": "AppomattoxNewspapers_1971-1973a_0199.pdf", "page": 1, "text": "VIRGINIAN, JANUARY 2 7 , 197 APPOMATTOX Lexington A venue, Brooklyn, New York 11221 EmillO. Mar shall whose last known address is 360 Stone Avenue, Brooklyn, New York 11212 Douglas N. Marshall whose last known ad dress is Beckley, West Virgin ia 25801 Maurice Cawthorn whose last known address is 223 Ellis Street, Bluefield West V ir g in ia 24701 and Peyton Cawthorn, 223 Ellis S t r e e t , Bluefield, West Virginia 24701, are not residents of this State and that there are or may be persons interested who are un known and made parties defend ant by the general description of parties unknown, it is ord ered that the said nonresident defendants and the said persons made defendants by the general description of p a r t i e s un known, it is ordered that th6 said nonresident defendants and the said persons made defend ants by the general description of parties unknown do appear within ten days after due publi cation of this order and do what is necessary to protect their in terests. Teste ALDAH B. GORDON,Clerk W. M. Abbitt, p.q. Attorney at Law Appomattox, Virginia 1-64t"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Virgin ia 25801 Maurice <mark>Cawthorn</mark> whose last known address"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Virgin ia 25801 Maurice <mark>Cawthorn</mark> whose last known address"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [889.21, 1136.66, 1066.91, 1793.94], "bbox_id": "c567002d98", "file": "AppomattoxNewspapers_1947-1949a_0141.pdf", "page": 1, "text": "Virginia In the Circuit Court of I Appomattox County, Nov. 8th, 1947 I H. Ruth Bargyh  Ora B, Gill vs I Lula E. Cawthorn  Others. To H. Ruth Bargyh, Ora B. Gill, I Lula E. Cawthorn, Floyd llarvey, Florence Sfpencer, Estelle aniels, Howard Harvey, Annie Pearl Flood, Helen Morgan, Walter Minist Har vey, Jack Samuel Harvey, Elsie Letcher, Tucker Harvey. Earl Jar- I rett, Alice Jarrett Morehand, Jim my Hamlet, Charlie Harvey, Fred Harvey, John Sam Harvey, Elmira Han ey, SMlie Harvey, Mary Har vey, Virginia Harvey, and W. M. Abbitt, Guardian ad Litem, Plain tiffs and Defendants in the above  styled suit. You are hereby notified that I have fixed Tuesday the 9th day of December, 1947, at 1100 a. m., as the time, and my office at Appo- mattox, Virginia, as the place for taking the several accounts ordered by decree of the Circuit Court of Appomattox, in the above styled I suit, at the October Term, 1947, as I follows I First Who are the owners of the land described in the bill filed in I this suit? I Second Are all of the owners of the land described in the bill filed, in this suit parties .3 to the suit? Third What is the present mar ket value of the real estate describ-  ed in the bill filed in this suit? Fourth Can the real estate des cribed in the bill in this cause be conveniently divided in kind be tween the owners thereof? Fifth Will the interest of any of- the owners of the said real estate! be prejudired by a sale of the whole thereof and a division of the pro-1 ceeds among the owners? Sixth To inquire and report alii liens, if any, with their priorities! against the said real estate. Seventh Whether or not the offer made by the complaintant, H. Ruth1 Bargyh, mentioned in the bill of complaint filed in this suit is a fair and reasonable offer and whether the same should be accepted and a private sale approved? Eighth Any other matters deem- ed pertment to the objectives of this suit by the Commissioner or anv one interested. Given under my hand the day and year above written. C. W. SMITH"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "vs I Lula E. <mark>Cawthorn</mark>  Others. To H. Ruth"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "vs I Lula E. <mark>Cawthorn</mark>  Others. To H. Ruth"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [878.52, 1135.8, 1059.21, 1808.92], "bbox_id": "41cccbc331", "file": "AppomattoxNewspapers_1947-1949a_0140.pdf", "page": 1, "text": "Virginia In the Circuit Court of Appomattox County, Nov. 8th, 1947 H. Ruth Bargyh  Ora B. Gill vs Lula E. Cawthorn  Others. To H. Ruth Bargyh, Ora B. Gill, Lula E. Cawthorn, Floyd Harvey, Florence Sfpencer, Estelle aniels, Howard Harvey, Annie Pearl Flood, Helen Morgan, Walter Minist Har vey, Jack Samuel Harvey, Elsie Letcher, Tucker Harvey. Earl Jar- rett, Alice Jarrett Morehand, Jim my Hamlet, Charlie Harvey, Bred Harvey, John Sam Harvey, Elmira Harey, Sullie Harvey, Mary Har vey, Virginia Harvey, and W. M. Abbitt, Guardian ad Litem, Plain tiffs and Defendants in the above styled suit. You are hereby notified that I have fixed Tuesday the 9th day of December, 1947, at 1100 a. m., as the time, and my office at Appo mattox, Virginia, as the place for taking the several accounts ordered by decree of the Circuit Court of Appomattox, in the above styled suit, at the October Term, 1947, as follows First Who are the owners of the land described in the bill filed in this suit?  Second Are all of the owners of I the land described in the bill filed  I in this suit parties _ .k. .3 to the I suit? I Third What is the present mar- I ket value of the real estate describ. I ed in the bill filed in this suit? Fourth Can the real estate des cribed in the bill in this cause be conveniently divided in kind be tween the owners thereof? Fifth Will the interest of any of the owners of the said real estate  be prejudired by a sale o f the whole thereof and a division of the pro-1 ceeds among thg owners? Sixth To inquire and report alii liens, if any, with their priorities j against the said real estate. Seventh Whether or not the offer made by the complaintant, H. Ruth1 Bargyh, mentioned in the bill of complaint filed in this suit is a fair and reasonable offer and whether the same should be accepted and a private sale approved? i Eighth Any other matters deem ed pertinent to the objectives of this suit by the Commissioner or any one interested. Given under my hand the day and year above written. i C. W. SMITH, Commissioner in Chancery, i ll-20-2tc"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Gill vs Lula E. <mark>Cawthorn</mark>  Others. To H. Ruth"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Gill vs Lula E. <mark>Cawthorn</mark>  Others. To H. Ruth"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2371.2, 235.27, 2510.5, 642.2], "bbox_id": "47a33841f7", "file": "AppomattoxNewspapers_1971-1973a_0199.pdf", "page": 1, "text": "VIRGINIA IN THE CIRCUIT COURT OF APPOMATTOX COUNTY MATTIE C. MORGAN Complainant VS ORDER OF PUBLICATION ELIZABETH C. ALLEN 723 James Street Riverton, New Jersey IRA MARSHALL 377 S. Oakley Avenue Columbus, Ohio 43420 NONA MARSHALL 360 Stone Avenue Brooklyn, New York 11212 DEWEY MARSHALL 1605 Franklin Park, South Columbus, Ohio 43205 SAMUEL W. MARSHALL 107 Majestic Avenue San Francisco, California 94112 ELVIN E. MARSHALL 686 Lexington Avenue Brooklyn, New York 11221 EMILL O. MARSHALL 360 Stone Avenue Brooklyn, New York 11212 DOUGLAS N. MARSHALL 123 Grant Street Beckley, West Virginia 25801 LEWIS R. MARSHALL 1613 Elliott Avenue South Boston, Virginia 24592 MAURICE CAWTHORN 223 Ellis Street Bluefield, West Virginia 24701 PEYTON CAWTHORN 223 Ellis Street Bluefield, West Virginia 24701"}, "highlight": {"text": {"matched_tokens": ["CAWTHORN"], "snippet": "Boston, Virginia 24592 MAURICE <mark>CAWTHORN</mark> 223 Ellis Street Bluefield,"}}, "highlights": [{"field": "text", "matched_tokens": ["CAWTHORN"], "snippet": "Boston, Virginia 24592 MAURICE <mark>CAWTHORN</mark> 223 Ellis Street Bluefield,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [299.77, 310.57, 620.78, 418.07], "bbox_id": "9af552355f", "file": "AppomattoxNewspapers_1908-1909a_0191.pdf", "page": 1, "text": "Virginia Bolt, Virginia Chick, Frances Coleman, Fay Babcock, Mary Woodson, John Hesson, Alfred Harwood. Charles James, Billy Dickerson, Charles Crawley, Henry Pack, Samuel Ford, James Morris. 1st year  Ruby Woolridge, ready delayed too long the estab- Alice Burge, Mamie Cawthorn,"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "estab- Alice Burge, Mamie <mark>Cawthorn</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "estab- Alice Burge, Mamie <mark>Cawthorn</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2069.01, 1146.23, 2278.61, 1759.62], "bbox_id": "c7c0af6e4e", "file": "AppomattoxNewspapers_1902-1905a_0231.pdf", "page": 1, "text": "violin, but no games or dancing was engaged All present said they had a good time. On the 25th all of the young people mostly went to the home of Mr. Sam Ransom where they had an enjoyable time and proBOunced Mis Gertie a charming hoses. On the 26th all to the home of Mr. J. L. Davis where they had one more good time, On the 27tb a good crowd assembl ed in the parlor at Mr. W. E. Wool ridge where they sang hymns and Miss Willie skillfully performed on the organ. On the 28th there was a big dance at the Hall. Music was rendered by our string b nd, Messrs. Ragland and Staples. On the 29th there was a large crowd paid Mr. Hutson Oheatham a call, and he did not fail to entertain them all O. K. Onr prayer meeting was conduct ed on the 30th by Dr. Wm. Abbitt. He gave a long interesting talk that was listened to with good attention, and we believe that it done much good. Rev. H. W. Dunkley will preach for us at Evergreen Church, on the 5th Sunday evening at 3 oclock. Gome one and all prepared to hear a good sermon. Your correspondent was present at Westley Chapel on Sunday last, and heard the best sermon that was ever preached on a Christians duty. If any church member that heard that sermon can ever dance again I dont know what to think. There was no prayer meeting on Wednesday night, and it was a fine sugar stew at Mr. Cheathams that he gave the boys for their kindness in helping him fill his ice-hou.e with ice 5 inches thick. Prayer meeting has m t been given out for next Wednesday night Air. E. H. Cawthorn wears a broad mile over the arrival of a flue boy at his house on the Cd inst, We_ wish him much happiness over hisjV  treasure and hope that he will raiael"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "night Air. E. H. <mark>Cawthorn</mark> wears a broad mile"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "night Air. E. H. <mark>Cawthorn</mark> wears a broad mile"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.28, 1366.64, 1797.82, 1606.83], "bbox_id": "3ea153b88c", "file": "AppomattoxNewspapers_1918-1922a_0164.pdf", "page": 1, "text": "Violation of Liquor Law udge Frank Obristian held I irt here for Judge ilundly  iterday, Judge Hundley be  engaged in tbe trial of a 11 case at Farmville. The following grand jurors re sent to their room W.  Brown, JoelT. Cawthorn, J. Ferguson, B L Wheeler, A . ! Harwood, M. C. Hmitb, C. j Drinkard, W. A Narh and i W. Beale, and renrned five lictments for violations of   prohibition laws. The indicted express them- ves as being greatly sur- eed, that any evidence  jula be presented which j uld make them even appear j violators of the law, aud i U show tbe court and countv June lltb whether they are ilty or not."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "room W.  Brown, JoelT. <mark>Cawthorn</mark>, J. Ferguson, B L"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "room W.  Brown, JoelT. <mark>Cawthorn</mark>, J. Ferguson, B L"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [884.15, 1543.9, 1369.58, 1659.35], "bbox_id": "7e9b4a5da8", "file": "AppomattoxNewspapers_1926-1933a_0219.pdf", "page": 1, "text": "ville, and Richard Webb a- day Saturday, Monday mom- between Howard Smith, Rep- gainst Catherine Webb- ing until 12 oclock,,and every resentative from the Eigth C. C. Harvey and Frank T. other morning from 830 o- District, and J. W. Fishbourne, Cawthorn on motion of R. L. clock until 10 oclock, unless he newly elected Representative Burke, county treasurer, were receives an emergency call, form the Seventh, appointed deputy treasurers. R. which takes him away f r o m If -the plan goes through, W- Smith was given a soft the office. Mr. Hudgins re- said Mr. Byrd, we would be drink license. -T. S. Mcually quests that farmers do not call in a new Seventh District in- was appointed administrator of him during these hours except eluding Bath, Highland, Aug- the late Minnie McNally by in case of an emergency, the court. ________ _ ."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "and J. W. Fishbourne, <mark>Cawthorn</mark> on motion of R."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "and J. W. Fishbourne, <mark>Cawthorn</mark> on motion of R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.51, 580.21, 1783.28, 1673.81], "bbox_id": "35d0dfd1dc", "file": "AppomattoxNewspapers_1926-1933a_0260.pdf", "page": 1, "text": "Veteran Charles Henry Cole man, from Wreck Island was in town today looking none the worse after 87 summers. Mrs. J. H. Kidd and Mrs. C. W. Potts, of Lynchburg, spent Monday inthe home of A. H. Clement. , Miss Mildred Powell, of Lynchburg, is visiting, in the lome of Mr. and Mrs. M. H. Marks this week. Miss Lucille fsucado has re- urned from Richmond, where he has been visiting Miss Lu cille Morriss. Mr. Garland Torrence and 3isters, of Verlena, and Louise, of Hopewell, have been on a visit to home people here. Mr. and Mrs. J. R. Thomas, of Lynchburg, were Sunday guests of Mr. and Mrs. S. E. Torrence here.1 Mrs. ,A. E Torrence, who las been on! the slpk list is improving, also Mrs. J. L. Tor rence. Mrs. C. E. Torrence and daughter, Cecile, of Roanoke, lave been on a visit to home 1olks here. Mr. and Mrs. W. D. Griggs and children, of Hopewell, were guests of the latters brother, Mr. S. J. Evans last week. Mr. and Mrs. M. H. Marks and family attended ?the fam ily re-union given at the home of Mr. and Mrs. J. T. Trent Sunday. Mrs. E. H. Cawthorn, who las been visiting relatives at Appomattox and Pamplin for two weeks, returned to her lome in Roanoke on Sunday. Mr. and Mrs. Elwood Alvis and Miss Edith OBrien, of lichmond, were guests in the lome of F. A. OBrien for the holidays. Miss Nannie Harvey and Mr. Lenwood Harvey, of Bucking ham, were guests bf Misses Is abelle and Phoebe OBrien during last week-end. Miss Kathleen Wood and Mr. Claude Wood, of Lynch burg, were guests in the home of Mr. Pitzer Gills last week end. Mr. and Mrs. Meredith Mc Faden, of Buckingham, spent last week with their sister, Mrs. Andrew Carter, near here. I.iitie Royal Hancock, J r. of Raleigh, N. C., has returned home after visiting his grand parents, Mr. and Mrs L. M. Drinkard for several weeks. A very highly bred guernsey bull calf has been awarded to Master Jas. Langran, of this place by Mr. Warren S. Corn ing. Mrs. Louella Morris and daughter, Mrs. Helen Welch, have returned to their home after an extended stay in Lynchburg. The regular monthly meet ing of the U. D. C. will take place at the residence of Mrs. W. L. Brown at 330 Thurs day, Jjuly the 17th. Dr. Price and family, of Clarksville, Va., were visitors at the home of Warren S. Corn ing this week. The doctor is one of the big live stock growers of Va."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Sunday. Mrs. E. H. <mark>Cawthorn</mark>, who las been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Sunday. Mrs. E. H. <mark>Cawthorn</mark>, who las been visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [907.2, 309.3, 1071.39, 411.25], "bbox_id": "624e687f47", "file": "AppomattoxNewspapers_1926-1933a_0406.pdf", "page": 1, "text": "Very unlike home Appomat-1 tox Restaurant. The more we have to feed the better we feel. Give us a trial. Cawthorn  Caldwell  A p p o m a tto x , V irgin ia"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Give us a trial. <mark>Cawthorn</mark>  Caldwell  A p p"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Give us a trial. <mark>Cawthorn</mark>  Caldwell  A p p"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [918.7, 389.56, 1076.99, 491.39], "bbox_id": "159b1a42b0", "file": "AppomattoxNewspapers_1926-1933a_0398.pdf", "page": 1, "text": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. Cawthorn  Caldwell Appomattox, Virginia"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. <mark>Cawthorn</mark>  Caldwell Appomattox, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. <mark>Cawthorn</mark>  Caldwell Appomattox, Virginia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [596.89, 315.76, 753.95, 416.81], "bbox_id": "c8b4cf83f5", "file": "AppomattoxNewspapers_1926-1933a_0402.pdf", "page": 1, "text": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. Cawthorn  Caldwell Appomattox, Vi ginia"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. <mark>Cawthorn</mark>  Caldwell Appomattox, Vi ginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. <mark>Cawthorn</mark>  Caldwell Appomattox, Vi ginia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [882.51, 812.9, 1041.0, 913.29], "bbox_id": "d31d3028d4", "file": "AppomattoxNewspapers_1926-1933a_0395.pdf", "page": 1, "text": "Very unlike home Appomat tox Restaurant. The more we have to feed the better we feel. Give us a trial. Cawthorn  Caldwell A p p o m a tto x , V irg in ia"}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "Give us a trial. <mark>Cawthorn</mark>  Caldwell A p p"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "Give us a trial. <mark>Cawthorn</mark>  Caldwell A p p"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1923.1, 517.15, 2107.82, 1310.32], "bbox_id": "618f5a5804", "file": "AppomattoxNewspapers_1926-1933a_0256.pdf", "page": 1, "text": "Very hotand exceedingly dry. I We had a nice shower last I week but need, more badly Some thermometers registered 104 Sunday afternoon, in J shade. Elkton Hamilton, of Chic-1 ago, has been here visiting I his parents, Mr. and Mrs. B. H. Hamilton. . Mias Louise Stratten is visit ing her aunt, Mrs.J. H. Elder, in Richmond. Mrs. C. N. Price, of Lynchburg, is also  her guest. Mrs. Elder and! family and guests are camping this week at Boilers Wharf. I Mrs. Alice Jacobs a n d daughters, Bettie and Dot, of Richmond, are guests of th e 1 formers parents for several weeks, Mr. and Mrs. C. M. Stratten, Sr. Mr. Jacobs and children are spending several days with I Mrs. Jacobs sister, Mrs. D. A. Christian at Appomattox. Mr. Jacobs is touring Europe for several months. Misses Hazel Taylor and Ethel Alvis and John Taylor motored to Richmond Satur day. John returned Sunday, the girls remained for a longer visit. Mr. and Mrs. Allen Chick, Mrs. Aubrey Thomas and little daughter Ann, were Sunday guests of Mr. J. A. Stratten and family. Mr. and Mrs. Cal Chick, of Norfolk, are visiting relatives in the county this week. Mrs. Mary Carson Cawthorn of Newark, N. J., has conclud ed a two weeks visit with her parents, Mr. and Mrs. C. E. Carson. Mrs. E. H. Carson is visiting her son, Owen Carson for a few days.. Miss Landis Laughan and mother, Kermit, have recent ly visited relatives in Rich mond. Mrs. J. W. Neighbors, Jr., and children were guests of Ir. and Mrs. Neighbors a few days last week. Mr. and Mrs. S. E. Ander son spent Sunday afternoon with Mr. and Mrs. Tom Tay lor near Beckham. Mr. and Mrs. Dunkley Gun- er, and son, Bobbie, Mr. and Mrs. Sam Stratten and Mr. and drs. Asby Anderson, of Lynch burg, motored to Crewe and Crystal Lake Sunday. Mrs. Seay, of Lynchburg, spent he week-end with Mrs. S. E. Anderson. Supervisor S- E. Anderson ias purchased a new Ford from Rustburg."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "week. Mrs. Mary Carson <mark>Cawthorn</mark> of Newark, N. J.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "week. Mrs. Mary Carson <mark>Cawthorn</mark> of Newark, N. J.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1730.86, 742.34, 1897.66, 1133.56], "bbox_id": "7965506736", "file": "AppomattoxNewspapers_1926-1933a_0062.pdf", "page": 1, "text": "VERA V iñi- 7th grad-, Mary lzsie Morris, I Viofo Smith. Ernest Beal, Frank! Cawthorn, Billy Cawthorn, John  Will HSmiltof. Joe Gallier. 6th grade, Ruth Morris, Rachel I Morris, Nellie Hamilton Cathe rine Lucado, Lula Drinkard, Edna Smith, Dorothy Covington, Jutson Morris, Summers Gobble. I 5th grade, Hilda Abbitt,. Mar garet Morris, Florefice Smith! Herbert Abbitt JCllis Webb. 4th grade, Elizabeth Drinkard, I Eva Ferguson, Pauline Gobble, I Virginia Hamilton, ? Margaret  Harris, Hilda OBrien, Garland  OBrien, Cornelius Smith. 3rd grade, Mildred Abbitt,! Eloise Abbitt, Defronia Gobble, I Iva Childers, Elizabeth Harris, Virginia Beal, Herbert Lucado, WiUis Carter. 2nd grade. Sarah Drihkard, Maynard OBrien, Earl Morris, Berkley Garrett, Walter F. O-1 Brien.  1st grpde, Loraine Hamilton, Dorothy OBrien, Thelma Smith, I Virginia Trent, Maggie Gallier, Mannie Morris, Edwin Lucado, Charlie Abbitt, Harold Morris,! James Smith, Jr. Carter, Alvin Trent, Jud Kinney."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Smith. Ernest Beal, Frank! <mark>Cawthorn</mark>, Billy <mark>Cawthorn</mark>, John  Will"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "Cawthorn"], "snippet": "Smith. Ernest Beal, Frank! <mark>Cawthorn</mark>, Billy <mark>Cawthorn</mark>, John  Will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1438.82, 803.72, 1756.73, 941.72], "bbox_id": "7e3bd67895", "file": "AppomattoxNewspapers_1908-1909a_0570.pdf", "page": 1, "text": "VERA, April 5.Mr. and Mrs. Willie Beale and son, James, spent Sunday in the Addie Lena Fergusonspent home ofMiss, Virginia Harvey, the week-end with Heten Evans of Buckingham. Afrs. Wesley Wooldridge, of Miss Louise Scruggs spent Church Roads, and Mr. and the week-end with her parents Mrs. Dewey Cawthorne an d here. family visited F, T. Cawthorn recently. Mrs. O. P. Farrar and chil dren, of Villamont, visited here several days last week."}, "highlight": {"text": {"matched_tokens": ["Cawthorn"], "snippet": "family visited F, T. <mark>Cawthorn</mark> recently. Mrs. O. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn"], "snippet": "family visited F, T. <mark>Cawthorn</mark> recently. Mrs. O. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
