{"document": {"bbox": [630.21, 983.82, 899.64, 1013.82], "bbox_id": "f8284f5db0", "file": "AppomattoxNewspapers_1949-1952a_0018.pdf", "page": 1, "text": "CHARLES T. MOSES"}, "highlight": {"text": {"matched_tokens": ["CHARLES", "T", "MOSES"], "snippet": "<mark>CHARLES</mark> <mark>T</mark>. <mark>MOSES</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["CHARLES", "T", "MOSES"], "snippet": "<mark>CHARLES</mark> <mark>T</mark>. <mark>MOSES</mark>"}], "text_match": 1736172819517538425, "text_match_info": {"best_field_score": "3315704398080", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517538425", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.63, 444.13, 1946.07, 789.66], "bbox_id": "0cf138bcc7", "file": "TimesVirginian_1983a_0461.pdf", "page": 1, "text": "Work began this week on nine additional holes for the Falling River Country Club golf course, according to FRCC President Charles T. Moses, Jr. Moses says the back nine holes should be completed sometime in 1984, and will be ready for play by 1965. This addition to the 125-acre course wifi give Appomattox County an 18-hole course, complete with a watering system to keep the .greens in good shape even during hat, dry weather. The greens have been designed to be very picturesque, Moses said this week. Some of them have been set hack in the woods, and the 18th hole, which is in front of the club house, wifi be terraced all around, so that people can sit around the hole and watch the ends of tournaments. The golf-course improvement, which Will cost approximately 90,000, will enable more people to play at once, says Moses. At present, with nine holes, we can accomodate 75 people at one tim e, for example, in a tournament he says. With 18 holes, we will be able to accomodate 150 people. This will give us a complete facility, Moses continues. We will have an 18-hole golf course, a swimming pool, a dub house facility,"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "according to FRCC President <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. <mark>Moses</mark> says the"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "according to FRCC President <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. <mark>Moses</mark> says the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [259.19, 670.05, 400.58, 758.95], "bbox_id": "484e67a14a", "file": "AppomattoxNewspapers_1962-1965a_0192.pdf", "page": 1, "text": "Woodrow Wilson District Mr. J. W. Wright, Lt. Governor Zone 3, 1961 Mr. Ralph Turpin, Lt. Governor Zone 3, 1962 and Mr. John J. Coleman, Lt. Governor Zone 3, 1963 also James Davis, Delegate, Amherst and Nelson counties Charles T. Moses, State"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Amherst and Nelson counties <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, State"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Amherst and Nelson counties <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, State"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Moses", "Charles", "T", "Moses"], "snippet": "H. Lucado, T. W. <mark>Moses</mark>, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Pat Chand ler,"}}, "highlights": [{"field": "text", "matched_tokens": ["Moses", "Charles", "T", "Moses"], "snippet": "H. Lucado, T. W. <mark>Moses</mark>, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Pat Chand ler,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [762.95, 296.46, 941.59, 744.64], "bbox_id": "618ddd8af6", "file": "AppomattoxNewspapers_1960-1962b_0166.pdf", "page": 1, "text": "William Alexander  Moses, re tired Civil Engineer, died Friday ev ness  He was bom in Appomattox County, October, 17, 1868 son of dhe lata Charles Thomas arid Mary tVoodsdn Moses. When a young mar. he was in the meritantile bustness. He first clerked in. the store of J.R. Atwood and in 1800 went in busi ness for himself. He served as a Justice of the Peace for Appomat tox County. After successfully tak ing a correspondence course from thè University of Virginia, he be came a certified surveyor in Appo mattox County in 1906, which pro fession he f afri owed until he retir ed .in 1954. He married Mias Cagne Harris Smith on April, 11, 1895. Mrs. Moses died January, 3, 1931. Survivors include one daughter, Mrs. Aluson T. Inge three grand children, Don Moses  Jr., of Balti more William T. Moses of Roar.- oka and Str. Tonwnie C.  Harvey Jr., of Appdmttttox six great grand children one brother, Lem M. Mose of Appomattox one nephew, State Senator Charles T. Moses  three nieces, Mrs. Nettie M. Dresser, and Misses Lula and Cara Moses ah of Appomattox. 1 Funeral services were conducted Sunday afternoon a t 2 - Oclock j from Robinson  3 Funeral Home by Rev. James T. Cravens, pastor of j Liberty Baptist Church. Pall bearers J were C. - T. Moses Jr., Reggi W. j Stanley, C. S. Ranson, William T. j Moses, T. C. Harvey Jr nd C. T. Moses."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "one nephew, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>  three nieces, Mrs. Nettie"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "one nephew, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>  three nieces, Mrs. Nettie"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.88, 352.5, 2145.29, 693.49], "bbox_id": "b761c8b301", "file": "AppomattoxNewspapers_1952-1954a_0224.pdf", "page": 1, "text": "were carefully copied from the originals, under the personal super vision of the Manager, Mr. E. M. Farley, and checked by Mr. J. Paul Hudson, Museum Specialist, Na tional Park Service. Funds fot making the four pieces were provided by the Common wealth of Virginia from a special appropriation of 5000, sponsored by State Senator Charles T. Moses, Appomattox, Virginia, and approv ed by Governor John S. Battle, in 1950, for furnishing the Surrender Room at the McLean House. H. A. Gurney, Monument Super intendent, commenting on the new acquisitions stated that each of the four pieces has an interesting his tory aside from its connection with the Lee and Grant meeting. The two generals had barely left the McLean House on the after noon of Palm Sunday, April 9, 1865, when Federal Officers des cended on Wilmer McLean intent on securing a souvenir from the sur render room. General Phil Sheridan paid Mr. McLean 20 in gold for the small pine table and gave it to General Custer to present to his wife with Sheridans compliments. There are several contemporary eye-witness accounts of the youthful Custer,"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "sponsored by State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Appomattox, Virginia, and approv"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "sponsored by State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Appomattox, Virginia, and approv"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2193.57, 214.48, 2339.46, 478.13], "bbox_id": "cc602294f0", "file": "AppomattoxNewspapers_1962-1965a_0519.pdf", "page": 1, "text": "We are sorry to hear of the illness of Mrs. Ethel Coleman Balin and we do hope for her a speedy recovery. Miss Sandra Harvey, Don and William, visited in the home of Mr. and Mrs. T. C. Harvey on Thursday. William remained for a few days visit. We are glad to hear that Sena tor Charles T. Moses is at home and improving Mr. and Mrs. T. C. Harvey visited in the home of Mr. and Mrs. L. H. Watson Sunday night. Mrs. Leslie B. Harvey visited in the home of Mr. and Mrs. T. C. Harvey Friday. The foliage Is just beautiful. We are sorry to hear of the illness of Mr. Walker OBrien. Week end guest in the home of Mr. and Mrs. T. C. Harvey were Mr. and Mrs. Richard Car- son and Sylvia, Mr. Allen"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "hear that Sena tor <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is at home and"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "hear that Sena tor <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is at home and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [666.27, 389.33, 835.31, 450.52], "bbox_id": "6a78e0ddd3", "file": "AppomattoxNewspapers_1960-1962b_0019.pdf", "page": 1, "text": "Virginia and the nation. Virginias senior State Senator, Charles T. Moses resides in Appomattoox, as does U. -S. Congressman W. M. Abbitt, also a relative of Mrs. Iiudd."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Virginia and the nation. Virginias senior State Senator, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> resides in Appomattoox, as does U. -S. Congressman W. M. Abbitt, also a relative of Mrs. Iiudd."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Virginia and the nation. Virginias senior State Senator, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> resides in Appomattoox, as does U. -S. Congressman W. M. Abbitt, also a relative of Mrs. Iiudd."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.74, 642.37, 1879.44, 835.26], "bbox_id": "ba10d2a0eb", "file": "TimesVirginian_1980a_0197.pdf", "page": 1, "text": "vin Drinkard and Mr. and Mrs. Charles T. Moses, Jr . of Appomattox. In addition to the hosts and the honored couple, the guest list included Mrs. Lewis Keith Bussey, Jr ., of Roanoke, mother of the bride-elect, Mr. and Mrs. Thomas L. Waller, Shep- herdsville, Kentucky, moth er and step-father of the bridegroom, Mr. and Mrs. Archie Craft of Lexington, Kentucky, grandparents of the bridegroom, the wed ding party, family members, relatives and friends of the honored couple."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "and Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr . of Appomattox. In"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "and Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr . of Appomattox. In"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2283.52, 1745.15, 2483.39, 1796.69], "bbox_id": "8175ea2261", "file": "AppomattoxNewspapers_1962-1965a_0215.pdf", "page": 1, "text": "village. Above are Lawrence M. McWane. Lynchburg, member of State Highway Com mission, Congressman Abbitt, State Senator Charles T. Moses, and Park superintendent Grover Earl Steele."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "village. Above are Lawrence M. McWane. Lynchburg, member of State Highway Com mission, Congressman Abbitt, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and Park superintendent Grover Earl Steele."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "village. Above are Lawrence M. McWane. Lynchburg, member of State Highway Com mission, Congressman Abbitt, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and Park superintendent Grover Earl Steele."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2311.18, 544.67, 2482.07, 1033.01], "bbox_id": "ad08b967f9", "file": "AppomattoxNewspapers_1952-1954a_0239.pdf", "page": 1, "text": "Two nights of novel entertainment are in store for Appomattox, as the local Parent - Teacher Association presents their big show, Guys as Gals. The show will be on tonight and tomorrow night, at 800 oclock at the Appomattox High School aud itorium. Local men will don female attire to provide the entertainment. Mrs. A. R. Harwood, Jr. will be mistress of ceremonies, but all the others in the show will be men. In a beach scene, the following will appear as bathing beauties Mar vin Scruggs, Reginald Speir, Vsraes Bryant, Willie B. Morris, Frank F. iCarr, Kendall Hunter, Henry Bar ger and Frank Mabeley. Ivey Holland and Robert Allen Sears will also appear in a beach scene skit, with John Grinels as the chaperone. Another feature will be a talent contest which will present Guys as Gals in unique talent stunts. In cluded among the performers will be Frank Hanenkrat, Billy Burke, Otis Dewberry, B. T. Price, Bob Mitchell, John Hall, Bill Runkle, and Lewis McDearmon. Also offered as climatic entertain ment will bo a male beauty contest mifU fk 1   . vwawit vo a V U v n tiift VUMiCi  Burke Guill, DeWitt Evans, Cur ry Harvey, Tommy Martin, A. R. Harwood, Jr. Larry Mays, Charles T. Moses, Jr. Ashby Paulette, Biiiy Conner, Jack Couch, Martin Webb, Roy McCrickard, Mark Saurs, Geo. Buchanan, Randall Wooldridge, Dick Robin son, Herbert Pulliam, Duncan Kinchlce, Bill Stern, Ken neth Jamerson, Claiborne Inge, John Cole, Billy Cheraault, David Rob ertson and Newton Jennings. iMo.  -"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Harwood, Jr. Larry Mays, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. Ashby Paulette, Biiiy"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Harwood, Jr. Larry Mays, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. Ashby Paulette, Biiiy"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1565.33, 395.89, 1747.91, 681.93], "bbox_id": "113176c67e", "file": "AppomattoxNewspapers_1960-1962b_0137.pdf", "page": 1, "text": "Tuesday evening at 6 oclock at the  Virginia Baptist Hospital, where  she bad been a patient for six weeks. She was the widow of the Thomas Walker Moses, who preceded her to the grave by 1  months. She was a sister of the late Mrs. S. L. Ferguson. Born in Appomattox County on July 9, 1876, she was the daughter of the late Charles R- and Martha I Jeanette Pemnick Mann. She vfl long active in the various civic and I church organizations, f nd member of Memorial Methodwt Church. Mr. and M. Moses tad lived in their same colonial home on Church Street   J    J  years. They were! noted tor their neighborliness, always willing to J S with others their blessings of life They both had -a passion tor flowers, and they P py hours working in their lovely gaidlen. She is survived by one son, State Senator Charles T. Moses, and one I bens _ Moses Dres-"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "one son, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and one I bens"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "one son, State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and one I bens"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1533.6, 347.4, 1670.37, 424.35], "bbox_id": "510de241f3", "file": "AppomattoxNewspapers_1960-1962b_0316.pdf", "page": 1, "text": "tor Charles T. Moses haS anfined to his home several ith an illness. and Mrs. Clarence C. Poe Richard, spent the holi er! in Albertville, Ala., i and Mrs. James A. Beaty."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "tor <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> haS anfined to his"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "tor <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> haS anfined to his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [728.56, 457.88, 918.96, 1019.66], "bbox_id": "85d8327d8a", "file": "TimesVirginian_1984a_0013.pdf", "page": 1, "text": "to voice thqneeds of small squads over the larger moipr vocal and powerful groups. He, also, gave a breakdown of the E.M.S. dollar tacked onto the, license fee, formerly labeled-rescue squadtninds. Highlights of the evenito began with the citationfBy Captain Way Noble, of Mrs.. Ruby RpSCn, O utstanding Crewman of tl E n t N1983. Mrs. , Roach was chosenby the members for , efforts and actions bgytind her normal rescue squad duties. Life memberships were presented to Mr. Jameau-C. Rogers and Mr. A. Gordon Staples. Mr. Paul Pete Doss, spoke just prior to this presentation to thank everyone for hinward last year and said he hoped the new recipients wofild be dsthrilled and honored as he was in recewingtllhoifor. Honorary memberships were pre-, sented to Mr. Charles T. Moses, Mrs. Bess Pulliam, Mr. John S. Grinels and Dr. Clyde G. OBrien. President Doug Seamster, iq presenting these awards, stated thljit there were four things that came to mind when he thought of our local rescue squad. The first was that God Almighty had been very good to us, the second being that therehad never been any trouble raising funds due to the generosity of the fine Appomattox County people, thirdly, that the fellowship and the ability of the members was outstanding and. last but not least, the people of thmbuainess community have support? and sustained us everyway possible. . Officers installed for the year 1964 were P resident, D.L. Seam ster Vice-President, Harry T. Ferguson, Jr. Communications Officer, James C. Rogers, Sr Training Officer, G. P. Beasley, Jr. Captain, Raymond A. liable 1 st Lt., Nellie P. Almond 2nd Senior, P.O. Doss 2nd Lt. Jr., Ruby E. Roach Motor Sgt., Cecil W. Kidd Sgt. of Building and Grounds, Virginia FrShklin Secretary, Nancy Elder Treasurer, Tobylnge. The meal was prepared by J and E. Catering Services."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "pre-, sented to Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Mrs. Bess Pulliam, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "pre-, sented to Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Mrs. Bess Pulliam, Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2312.39, 776.61, 2494.54, 1122.56], "bbox_id": "5c4f7aa3ff", "file": "AppomattoxNewspapers_1962-1965a_0260.pdf", "page": 1, "text": "To the Voters of Appomattox County Ladies and Gentlemen Tuesday, November 5, 1963, will be Election Day. This is the day we vote for the elected Democratic Nominees of the July Primary. If you have been voting by ab sentee or mall ballot and expect to be away on that day, and want to vote, which I hope you will, and I humbly ask you to do Please let me know, or the f o l l o w i n g know, promptly George F. Abbitt, Jr., Common wealth Attorney Watkins M. Abbitt, Congressman John C. Caldwell, Commissioner of Reve nue L. L. Stanley, nominee for Sheriff1 c. W. Smith, Clerk John C. Cole, Nominee for South- side District Supervisor Otha T0  1?.! Martin,- Jr,, Supervisor - tor J r trivl WonfiUra District Ridftard M. T k I i webb, Supervisor, Clover Hill District, or D. A. Conner. Go in person if you can. Carry the members of your family who vote, and ask your friends and neighbors to go out and vote Tuesday, Nov. 5, Gen eral Election Day. Thanks. Charles T. Moses"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "eral Election Day. Thanks. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "eral Election Day. Thanks. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [843.45, 741.23, 986.09, 1087.67], "bbox_id": "285bd0a474", "file": "AppomattoxNewspapers_1962-1965a_0268.pdf", "page": 1, "text": "To the Voters of Appomattox County Ladies and Gentlemen Tuesday, November 5, 1963 will be Election Day. This is the day we vote for the elected Demo cratic Nominees of the July Pri mary If you have been voting by ab sentee or mail ballot and expect to be away on that day, and want to vote, which I hope you will, and I humbly ask you to do. Please let me know, or the f o l l o w i n g know, promptly George F. Abbitt, Jr., Common wealth Attorney Watkins M. Abbitt, Congressman John C. Caldwell, Commissioner of Reve nue, John G. Plunkett, Treasur er L. L. Stanley, nominee for Sheriff C. W. Smith, Clerk John C. Cole, Nominee for South- side District Supervisor Otha W. Martin, Jr., Supervisor for Stonewall District Richard M. Webb, Supervisor, Clover Hill District, or D. A. Conner. Go in person if you can. Carry the members of your family who vote, and ask your friends and neighbors to go out and vote Tuesday, Nov. 5, General Elec tion Day. Thanks, Charles T. Moses"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Elec tion Day. Thanks, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Elec tion Day. Thanks, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2158.56, 744.53, 2324.76, 894.93], "bbox_id": "e608a15b03", "file": "AppomattoxNewspapers_1933-1936a_0250.pdf", "page": 1, "text": "To the voters of Appomattox County It has been brought to my attent ion that some of the opponents of my nephew, Charles T. Moses of tWe j county,who is a candidate for the State Senate, are saying that he does not have my sincere support, and that I am voting for him merely because f the family relationship which ex ists. I wish to correct these state ments which are untrue and to  1 that he has my whole hearted support and that of any member of my fam ilv for the office which-he soeks. I sincerly hope he will have the suppor of all my friends.Mrs. S. L. Ferguson"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "opponents of my nephew, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of tWe j county,who"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "opponents of my nephew, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of tWe j county,who"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [703.44, 973.97, 867.19, 1158.67], "bbox_id": "320065908e", "file": "AppomattoxNewspapers_1933-1936a_0264.pdf", "page": 1, "text": "To the Voter, of Appomattox, Charlotte Buckingham and Cumber land Counties My Campaign for the Senate is drawing to a close. The Primary is next Tuesday. I am sorry it wag im possible to see and talk to every voter due tQ thd large number in the District. I earnestly solicit your vote and support. I am deeply grateful to everyone, for the kindness and consideration shown me. I pledge t 0 the Voters of this District, if I am nominated and elected, I will impartially and act ively at all times exert my very best effort for the interest of my District and Welfare of 1 th e State at large. Your friend, CHARLES T. MOSES."}, "highlight": {"text": {"matched_tokens": ["CHARLES", "T", "MOSES"], "snippet": "at large. Your friend, <mark>CHARLES</mark> <mark>T</mark>. <mark>MOSES</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["CHARLES", "T", "MOSES"], "snippet": "at large. Your friend, <mark>CHARLES</mark> <mark>T</mark>. <mark>MOSES</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [599.75, 375.3, 1300.44, 578.0], "bbox_id": "addc48ccdf", "file": "AppomattoxNewspapers_1933-1936a_0360.pdf", "page": 1, "text": "TIM E9 -VIRGINIA a p p o m a t t o x . V i r g i n i a THURSDAY DECEMBER 10 1 naît accompanied her home. Friends are glad to know that Mrs J .M Rosses fhas r turned home fiom the hospital and is improving. Mrs. Joel Flood spent several cays_ last week in Richmond. Miss Mary Gray Sears was home for the week end. H Y Spencer and R W Wilkins were here for last week end. Mrs J C Caldwell, of Richmond, spent last week end here. Wiiliam Burke was home for the week end. Mr and Mrs R B Hudgins Mr and Mrs Charles T Moses and Mr and Mrs R L Sheppe attended the golden wedding celebration of Mr vlr   Wood at Wingina on Monday evening."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Hudgins Mr and Mrs <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark> and Mr and Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Hudgins Mr and Mrs <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark> and Mr and Mrs"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [502.83, 990.14, 2395.93, 1293.19], "bbox_id": "c7c0dc1700", "file": "AppomattoxNewspapers_1943-1947a_0592.pdf", "page": 1, "text": "THt GENIS At , SAYS F ARM VILLE S. T C SOCIETY OF CHRISTIAN ch 14, The Evergreen meet at the school at ALUMNI FUND  SERVICE MEETS MARCH 12 L , ------- ........... I Wis Fiona Bellp -Williams has Is- Vhe Womans Society of Christ- sued the foHoWingzt-atement as to  ian Service of Memorial Methodist j Church will hold its regular meet ing Wednesday, March 12, in the Church assembly room, at 730. Mrs. J. B. Seignious, president, will preside at the business session. Mrs. E. N. Hamilton will havg of the program for the after which there will be a on and tea for the new mem bers of the society. Hostesses for the evening will be have officers of the Society, Mrs. J. B. ering Seignious, Mrs. Grover Smith, Mrs. early Frank F. Carr, Mrs. J. E. Jamerson their and the Circle Chairmen. The tea table will be arranged by Mrs. Charles T. Moses, Jr., Mrs. Floyd M. Lucas will pour, assisted by Mrs. J. B. Seignious and the Circle Chairmen, Mrs. C. J. Hunt er, Mrs. H. M. Burge asd Mrs. C."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "be arranged by Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., Mrs. Floyd M."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "be arranged by Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., Mrs. Floyd M."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1549.67, 1626.8, 1832.07, 1821.89], "bbox_id": "23e9a9f519", "file": "TimesVirginian_1976_0229.pdf", "page": 1, "text": "Through the courtesy of Charles T. Moses, Jr., owner of Moses Motor Company, a 1976 Vega Sport Coupe will be given away this week end during the Member-Guest Golf Tournament at Falling River Country Club to the first person participating in the event to make a hole-in-one off 3 tee. The Vega, white with a red vinyl top, air condition, and fully equipped, will be parked at HZ tee and the keys will be presented the winner on-the-spot. In the photo above, Dr. BUI Geisler, Chairman of the Golf Activities Committee at FRCC, is shown accepting the keys to the 1976 Vega from C. T. Moses, Jr. Dr. Geisler should there be a winner, wiU present tbe keys to the car to the person making the first hole-in-one. This car is being given ottt-right, not a one-year loan as is often the case in professional tournaments, Moses said, and i rgaily hope we have a winner! You can bet your life that on Saturday and Sunday, this week end, there will be a lot of excited people on the course when they prepare to tee-off on HZ."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Through the courtesy of <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., owner of <mark>Moses</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Through the courtesy of <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., owner of <mark>Moses</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2052.94, 699.66, 2332.63, 888.91], "bbox_id": "058cea3fec", "file": "AppomattoxNewspapers_1974-1975a_0322.pdf", "page": 1, "text": "Through the courtesy fo Charles T, Moses, Jr Moses Motor Company, a 1975 Monza To  e Coujw wflbe riven away this week end during the Member-Guest Golf Tournament at Falling River Country Club t the rirst person participating in the tournament to make a hole-inne off 63 tae. The Monza, white with a blue vinyl top, air condition, and hiUy equipped, will be parked at No. 3 tee and the keys will be nresented the winner on-the-spot. . r u P In the photo above. Dr. BUI Gefaler. Chairman f the Golf Activities Committee at FRCC. is shown accepting the key to the 1975 Monza from Charles T. Moses, Jr. Dr. Geisler, should there be a winner, will present the keys to the car to the person malting the first hole-in-one. . This car is being given out right, not  one-yw -loanasia often the case in professional tournaments, says Mows, andl really hope we have a winner! You can bet your life that on Saturdayand Sunday there wil  a lot of excited people when they prepare to tee-off on No. 3."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Through the courtesy fo <mark>Charles</mark> <mark>T</mark>, <mark>Moses</mark>, Jr <mark>Moses</mark> Motor Company,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Through the courtesy fo <mark>Charles</mark> <mark>T</mark>, <mark>Moses</mark>, Jr <mark>Moses</mark> Motor Company,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1779.12, 919.38, 1921.21, 1089.43], "bbox_id": "81eef2d3ef", "file": "AppomattoxNewspapers_1962-1965a_0269.pdf", "page": 1, "text": "Theres no apparent opposition to Tuesdays élection for county and state offices. July 9ths Democratic primary placed the following names oh the ballot. For State Senator Charles T. Moses For the House of Dele gates Dr. W. A. Pennington, of Buckingham. Commonwealth At torney George- F. Abbitt, Jr. Treasurer, J. Garland Punkett Supervisor, Southside District, John C. Cole Clover Hill Dis trict, Richard Mead Webb Stone wall, Otho W. Martin. Sheriff Sgt. Leslie L. Stanley Commis sioner of Revenue, John C. Cald well."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "ballot. For State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> For the House of"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "ballot. For State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> For the House of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [981.03, 877.31, 1157.67, 1202.21], "bbox_id": "be5ce5d933", "file": "AppomattoxNewspapers_1943-1947a_0089.pdf", "page": 1, "text": "The wedding of Miss Carolyn Frances Moses, daughter of Senator and Mrs. Charles T. Moses, to Lieu tenant Vincent Lusardi, son of Mr. and Mrs. H. J. Lusardi, of Craw- j ford, New Jersey, took place Mon day evening in the Memorial Meth odist Church here. Decorations con forming to the bridal note were in I the church, and the pastor, the Rev.  W. R. Reed, officiated. Proceeding the ceremony, Walter Dresser, cousin of the bride, render ed several selections. Airs. F. B. Cale rendered severalvocal num bers, accompanied at the piano by M iss Cornelia Gills. The bride, who was given in mar riage by her father, wore an ivory satin gown fashioned wit i a sweet heart neckline, long pointed sleeves, elosdy fitted bodice, and a full skirt flaring into a round tvain. Her riigcr tip v.il of tulle fell from a beeri-shaped coronet. The brides only ornament was a Sun burst necklace, an heirloom from the maternal side of her family. She carried a prayer book which was printed in 1838 and belonged to her great-great grand mother on the paternal side of her family.The prayer book was showered with white orchids and iliac."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, to Lieu tenant Vincent"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, to Lieu tenant Vincent"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2344.54, 722.08, 2514.92, 865.98], "bbox_id": "6522a7a0a0", "file": "AppomattoxNewspapers_1939-1943a_0590.pdf", "page": 1, "text": "The War Bond Auction here Sat urday resulted in the sais of ao- p oAimately -3,000 worth of War Bonds. Perhaps the largeit crowd in. ipp.-.iiiuitox xor ten j oars was pre vent as the two companies of coun- Jr --muni Men and a brass band -rom Camp Picxett stagol a parade from the high school toiougu town to the court house. There the War Loan CommUlee took over. R, L. Burke, chairman, presided. Brief talks were made by G. F. j Abbitt, Jr., C. T. Moses, Charles McCloud, of Lynchburg, and C. S. McDear- mon."}, "highlight": {"text": {"matched_tokens": ["T", "Moses", "Charles"], "snippet": "j Abbitt, Jr., C. <mark>T</mark>. <mark>Moses</mark>, <mark>Charles</mark> McCloud, of Lynchburg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Moses", "Charles"], "snippet": "j Abbitt, Jr., C. <mark>T</mark>. <mark>Moses</mark>, <mark>Charles</mark> McCloud, of Lynchburg, and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2356.79, 1040.55, 2528.92, 1359.7], "bbox_id": "cfba57a257", "file": "AppomattoxNewspapers_1939-1943a_0587.pdf", "page": 1, "text": "The Virginia War Fund,hc.,spon sored by Governor Colgate W. Dar den, Jr, and headed by Homer L. Ferguson, of Newport News, has a quota of 1,835,000 to raise in Vir ginia this fall.This turn is Virginias share in the budgets of the seven teen agencies united in the Nation al War Fund. These include USO and other war front agencies, relief groups serving the civilian popula tions of our Allies and others de signed to relieve distress of refu gees from or populations in occu pied countries. Through one appeal to be conducted tills autumn, the Fund hopes to raise this sum. Garland Gray is chairman of the Fund for the Fourth District, and Charles T. Moses is chairman for Appomattox County. In this county a commendable start has already been made to ward raising a county quota of 3,600.00. A meeting was held here last Thursday night at the court house, and another at Pamplin on Tuesday night ef this week. W. M. Abbitt is treasurer of the War Fund drive for this county, and Miss Marguerite Gilliam is sec- tetary. Contributions may be mail ed to either of them, or to Mr. Moses."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "the Fourth District, and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is chairman for Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "the Fourth District, and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is chairman for Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1988.36, 703.32, 2154.55, 954.06], "bbox_id": "9dd9f0293e", "file": "TimesVirginian_1983a_0092.pdf", "page": 1, "text": "The spring meeting of the South Central District of Virignia Federa tion Garden Clubs will be held Wednesday, April 6,1983 at 10 a.m. in the River Ridge Mall Community Room. Special guests at this meeting will be Mrs. Edward J. Hennessy, Mr. arid Mrs. Albert jS. Beech and Mrs. Charles T. Moses, Jr. State life memberships will be presented. The program will be a standard flower show entitled Virginias Heritage. The show, featuring artistic designs and horticulture specimens, will be presnted in the Mall from 1230  500 p.m. and is open to the public. One of the Educational Exhibits will be a display of new and unusual daffodils. Mrs. John M. Dotten of Lynchburg serves as flower show chairman."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "jS. Beech and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. State life memberships"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "jS. Beech and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. State life memberships"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1717.92, 437.26, 1883.48, 485.2], "bbox_id": "fd134047d8", "file": "AppomattoxNewspapers_1952-1954a_0600.pdf", "page": 1, "text": "The Rev. and Mrs. B. T. Price and daughters, Patricia and Barbara Jean were dinner guests in the home of Mr. and Mrs. Charles T. Moses, Jr."}, "highlight": {"text": {"matched_tokens": ["T", "Charles", "T", "Moses"], "snippet": "The Rev. and Mrs. B. <mark>T</mark>. Price and daughters, Patricia and Barbara Jean were dinner guests in the home of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Charles", "T", "Moses"], "snippet": "The Rev. and Mrs. B. <mark>T</mark>. Price and daughters, Patricia and Barbara Jean were dinner guests in the home of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1622.63, 1065.78, 1768.03, 1278.53], "bbox_id": "6daa57e33e", "file": "AppomattoxNewspapers_1962-1965a_0265.pdf", "page": 1, "text": "The RAD subcommittee de signated to investigate special Centennial projects and related county improvement has met twice since its organization last month. Mrs. W. W. Burke has been named chairman, with Mrs. Martin Webb, secretary. Mrs. Burke says that monthly meet ings are planned, with addition- nal meetings when the need arises. Other members of the RAD Centennial committee are Er. J. A. Mathews, RAD head and ex office chairman, plus Miss Flora Belle Williams, Pamplin State Senator Charles T. Moses, Mrs. Mary Grey Holland, Mrs. Vi Harwood, J. A. Smith, all of Appomattox and the Rev. John Leslie Hart, of Pamplin."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Williams, Pamplin State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Mrs. Mary Grey Holland,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Williams, Pamplin State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Mrs. Mary Grey Holland,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [568.29, 276.26, 718.64, 937.63], "bbox_id": "f164e9199b", "file": "AppomattoxNewspapers_1974-1975a_0430.pdf", "page": 1, "text": "The petition, wjth said notice of time and place that it would be presented. had been published in the Thmeo-Virgm- ixn once a week for four successive weeks. A copy had been posted at the front of the Court House for the same period. The court was satisfied that j it would be to the interest of the inhabitants of the town.  that the prayer of said petition was reasonable th at the general good of the community mentioned in the petition would be promoted by the incorpora tion and that the numb of inhabitants of the town exceeded two hundred and did . not exceed 5.000. and that the area of land designed to be embraced within the town was not excessive. The Circuit Court then ordered as provided by j  Chapter 116 of the Code of Virginia, as amended, that all ! provisions had been complied j with, and that the Town of  Appomattox in the county of Appomattox, shall be . . . Incorporated and made a body i politic and Corporated by the j name of THE TOWN OF I APPOMATTOX with all pow ers and privileges and duties conferred and appertaining to town under the General Law of the State of Virginia. The Court ordered that the first election for town officers be held Tiles., Aug. 18,1925, at the Court House of Appomat tox County, which is located within the town.. The sheriff was ordered to post notice of said election at the front door of the Court House and at least three other public places within the town. The first town council in 1925 was made up of the following members James W. Cawthon, Jr., Charles F. James, C. S. McDearmon, R. S. Wheeler, Charles T. Moses, A. H. Gregory and Don Moses. Town officials were James W. Cawthon, Jr W. W. Scott, Town officials were James W. Cawthon, Jr., Mayor W. W. Scott, Manager Don Moses,"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "McDearmon, R. S. Wheeler, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, A. H. Gregory and"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "McDearmon, R. S. Wheeler, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, A. H. Gregory and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.48, 880.45, 1915.34, 1167.39], "bbox_id": "8a6bbb5388", "file": "AppomattoxNewspapers_1955-1957a_0317.pdf", "page": 1, "text": "The October meeting of the Ap pomattox Garden Club was held in the Appomattox Elementary School cafeteria at 730 P. M., Monday, Oct. 22, with the president, Mrs. Kenneth C. Gregory, presiding. The business meeting was- of necessity, a long one, following the Flower Show of Oct. 20 and 21. The program for the evening was to have been Fall Bulbs for Con tinuous Spring Bloom, with Mrs. O. O. Utt, of Lynchburg, Va. as the guest speaker. Due to the illness of Mrs.. Utt, this program was post poned. Ribbons for the exhibits were as follows . 1. Arrangement suitable for a coffee table, Miss Laura Mottley, blue and Mrs. Martin Webb, red. , 2. Arrangement suitable for a mantle Miss Laura Mottley, blue Mrs. Charles T. Moses, Jr., blue and Mrs. Martin Webb, red. Horticulture winners were Chrysanthemums Miss Laura Mott ley, blue Gerbera, Miss Laura Mott ley, red.."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Laura Mottley, blue Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., blue and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Laura Mottley, blue Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., blue and Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2334.24, 531.58, 2498.99, 1284.12], "bbox_id": "ffddca573d", "file": "AppomattoxNewspapers_1962-1965a_0191.pdf", "page": 1, "text": "The new fire house and com munity building at Gladstone was dedicated officially on Sat urday in ceremonies which in cluded addresses by Lt. Gover nor Mills Godwin and Congress man John O. Marsh, of the 7th District. Godwin, commending Glad stone residents for their woric, said It is the spirit of Virgin ians to be self - sustaining and not to ask the federal govern ment for help. Throughout tirrgj, the nation has had to have great people in order to accomplish great things and remain free. These can be accomplished through cooperative community efforts such as the erection of this fire station. Congressman John O. Marsh, the other speaker at the dedica tion, also warned of the increas ing role the federal government plays in the affairs of the people. Godwin commented that on ills travels through Virginia it gave him a feeling of pride to see how Virginians take care of their own needs without the aid of the fed eral government. There is a need of awakening in the people of the great ned of public spiritedness such as ouir forefathers had. We have been endowed with these privileges which we enjoy upon a great deal of sacrifice on their part, and we must do our part to keep these privileges. Godwin was Introduced by State Sen. Charles T. Moses, of Appomattox. Other Celebrities and Officers Lina Trent, of Appomattox, performed a baton twirling rou tine and Sandra Eustler, a dance during the festivities. Fran Rue- sell, of Lynchburg, was master of ceremonies. Jiarry M. Dixon, president of ie Gtaftdnw Volunteer Wee De- w-V partment, reported that the fire  department began operation on April 5, 1963. Twenty - three firemen are on call, nine of whom have attended special fire fighting schools and received certificates in firefighting. Total debt remaining on the building and fire truck is 8,000, Dixon said. Dixon introduced the officers and directors of the department, a non - stock corporation, as follows H. M. Dixon, president W. F. Quinn, vice president L. E. Moore, chief Agnes C. Hers- ley, secretary M. B. Miller, treasurer F. J. Justus, director Nelson County H. H. Hlggen- botham, dirccotor Amherst Coun ty J. H. Dixon, director Buck ingham County and James Phelps, director Appomattox County. Other guests introduced includ ed Mr. Harold Singleton, Presi dent Ruritan National also Mr. Continued On Page 2"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Introduced by State Sen. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. Other Celebrities"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Introduced by State Sen. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. Other Celebrities"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.22, 347.43, 1880.88, 566.22], "bbox_id": "d84bed4017", "file": "AppomattoxNewspapers_1939-1943a_0005.pdf", "page": 1, "text": "The Library Club of the Appo mattox high school presented a pro gram at chapel on Wednesday, Nov ember 15, for National Book Week. The following characters from books were portrayed Wee Gills group winning first prize Romeo and Juliet sacond prize Scarlet OHara, Dr. Jekyil and Mr. Hyde Mr. Chips, winning first individual prize Huck leberry Finn, seeortd individiual prize The Little Minister and his gypsey fiance Aunt Polly Amy, from Little Women President Roose velti and Carter Glass and the Horse and Buggy Doctor. The program was presented in the form of a Book Fair, with Charles T. Moses as barker introducing each character. Connie Fulp gave a talk on the meaning of National Book Week. After the program the char acters, headed by the barker pa raded the streets of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "a Book Fair, with <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> as barker introducing each"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "a Book Fair, with <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> as barker introducing each"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.31, 495.26, 1764.87, 672.5], "bbox_id": "61902df9ef", "file": "AppomattoxNewspapers_1962-1965a_0274.pdf", "page": 1, "text": "The Honorable Mills E. God win, Lieutenant Governor of Vir ginia, will speak Monday night, November 11, at the Appomat tox Elementary School. The American Legion Auxiliary has asked him to speak. Post 104, American Legion will meet jointly with the auxiliary. Meeting time is 8 p.m. The Auxi liary has Issded an invitation to the entire county and surround ing area to be on hand to hear the Lt. Governor. Lt. Gov. Godwin is a native of Chuckatuck, Nansemond County. .He is a nephew of Mrs. Charles T. Moses, Sr of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "a nephew of Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "a nephew of Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr of Appomattox."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.32, 1451.89, 1623.32, 1610.69], "bbox_id": "b8126efb1a", "file": "AppomattoxNewspapers_1962-1965a_0545.pdf", "page": 1, "text": "The family of the late Senator Charles T. Moses takes this op-, portunity to thank all his friends for the many acts of kindness extended him during his recent illnesses. We know how much he appreciated your thoughts and remembrances. We, his family, also wish to thank you sincerely for the many expressions of sympathy extend ed us at his passing. Your grac ious and sincere acts of thought fulness are greatly appreciated and will be long remembered The Family. 12-3-lt"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of the late Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> takes this op-, portunity"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of the late Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> takes this op-, portunity"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2381.31, 731.66, 2554.26, 981.41], "bbox_id": "21a0e7a52c", "file": "AppomattoxNewspapers_1939-1943a_0244.pdf", "page": 1, "text": "The cry of gerrymander was readied for use here today, as lo cal political eyes were popped all most out of their sockets by a tom tative plan for reapportionment of the membership of the . Virginia General Assembly was put forwarl by the Legislative Kedistrictinz Commission. The proposal, as ss nounced in Richmond would not om ly tear Appomattox from its politf cal moorings, but would virtual put a political blitzkreig on bosh State Senator Charles T. Moses and Delegate John B. Boatwright. The State Constitution requires a apportionment of membership in the General Assembly after, -the federal census each ten years with membership on a population basis. A Legislative Commission was ap pointed to work oqt  redistricting proposal. It is the proposal which has been hatched by this commis sion that is causing the headaches on local Political fronts."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "on bosh State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> and Delegate John B."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "on bosh State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> and Delegate John B."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [899.06, 654.59, 1043.34, 849.24], "bbox_id": "51753bb4b6", "file": "TimesVirginian_1976_0236.pdf", "page": 1, "text": "The bridegroom is a graduate of William Campbell High School and Ferrum College. He received his B.A. degree from Lynchbufg College. He is employed with Campbell Coun ty School Systems. Mr. Herndon is the grandson of the late Senator and Mrs. Charles T. Moses of Appomat tox. After a wedding trip to Jamaica, the couple will return to live in Gladys. Va. ________ FRCC Sets Dance For Tournament"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomat tox. After"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomat tox. After"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.06, 370.11, 2343.75, 849.09], "bbox_id": "7a2a5cd693", "file": "AppomattoxNewspapers_1954-1955a_0260.pdf", "page": 1, "text": "The Appomattox Lions Club at its March 31 meeting featured two county winners in the Flue-cured Tobacco Production Contest.  Mr. Thomas Hall, general manager of the Virginia Dark-Fired Tobacco Growers Marketing. Association, made the awards. First prize for be ing first in the State of Virginia went to Harold Martin, of Appomat tox. The prize was a one hundred dollar Savings Bond. Wayne Moore, Gladstone, was awarded a cash prize of ten dollars as the eighth place winner in the state contest. Mr. Charles T. Moses, State Sena tor from Appomattox, was present to introduce Mr. Hall and the two winners to the Lions Club members. Senator Moses compared the por tion of the fire-cured tobacco pro ducers in 1931 when the Virginia Dark-Fired Tobacco Growers Market ing Association was organised, - and that of the growers today. Ha then introduced Mr. Martin and Wayne Moore, the winners, and Mr. Hall, who made the awards. Mr. Hall then told a little mort of the history of the Growers As sociation and explained the contest which they are sponsoring. The pur pose of this contest is to encourage young fanners to adopt production and marketing practices that will re sult in higher yields of better qual ity tobacco. The participants F. F. A., 4-H, or N. F. A. students, keep detailed records of the improved practices, such as having soil tested, insect control, and others, and turn this record in when the crop is mar keted. The two winners, Harold Martin, first, and Wayne Moore, eighth, hon ored at this meeting, are both F. F. A. students at the Appomattox High School, Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "the state contest. Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, State Sena tor from"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "the state contest. Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, State Sena tor from"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.69, 1216.63, 1696.39, 1454.61], "bbox_id": "68ec13ad67", "file": "AppomattoxNewspapers_1974-1975a_0208.pdf", "page": 1, "text": "The Appomattox Junior Womans Club met on Tuesday evening, February 25 at 730 p.m. at the Farmers National Bank in the Triangle Plaza Shopping Center. Mrs. James A. Nolen, president of the club, presided. The call to order was given by Mrs. Nolen followed by the devotional led by Mrs. Arlene Stratton. The collect was then recited by all members present. Mrs. Monte Mays, chairman of the Conservation and Gardens Department of the club, introduced the guest speaker, Mrs. Charles T. Moses. Mrs. Moses gave a very interesting program on flower arrangements and demonstra ted ways of arranging flowers well as information on"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "the guest speaker, Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Mrs. <mark>Moses</mark> gave a"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "the guest speaker, Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Mrs. <mark>Moses</mark> gave a"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2282.88, 1506.21, 2448.2, 1609.31], "bbox_id": "3e42b36479", "file": "AppomattoxNewspapers_1962-1965a_0604.pdf", "page": 1, "text": "The Appomattox Garden Club held its February meeting to the County Library on Monday night February 22. An interesting pro gram arranged by Mrs. Charlés T. Moses, Jr. was given in the form of a panel discussion on the subject of the responsibility of the different community agen cies in making Appomattox and Blue  Appomattox County cleaner and"}, "highlight": {"text": {"matched_tokens": ["Charlés", "T", "Moses"], "snippet": "gram arranged by Mrs. <mark>Charlés</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. was given in"}}, "highlights": [{"field": "text", "matched_tokens": ["Charlés", "T", "Moses"], "snippet": "gram arranged by Mrs. <mark>Charlés</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. was given in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [146.9, 874.77, 320.99, 1092.65], "bbox_id": "0970e28983", "file": "TimesVirginian_1983a_0162.pdf", "page": 1, "text": "The Appomattox Garden Chib will hold its annual masting on Monday. May 23. at the home of gr. and Mrs. Sam Kerr. The evt will begin with Ucbytrc supper, followed by u bcW budnossY meeting and the iaataliation of new officers. Mrs. Charles T. Moses, Jr., newly elected first viee-prcttidsuf j f the Virginia Federation of Garala Clubs. Inc., will he the installing officer. Officers fbr the A fn 1 1983 1985 are Mrs. Martin Webb, president? Mrs. Clyde Nash,, vice president Mrs. Floyd f i H K ! secretary and Mrs. John. Fedison, Jr, treasurer.   Club members ure rsnuqdsd that the supper will begin at MU. Members and their guts should tiring their own lawn chairs."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of new officers. Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., newly elected first"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of new officers. Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., newly elected first"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2440.32, 1174.26, 2579.77, 1349.15], "bbox_id": "ceb735320d", "file": "AppomattoxNewspapers_1962-1965a_0583.pdf", "page": 1, "text": "The annual shareholders meet ing of The Farmers National Bank was held at the bank Tues day, Jan. 26th, at 230 p.m. Management reported another good year with earnings of 3.82 per share of stock of which 2.00 per share was paid in dividends. The year end statement also showed an increase in resources of 517,135.24. The Board expressed g r e a t sorrow In the loss of vice-presi dent and director Charles T. Moses, Sr. on Nov. 17, 1964. A Memorial Statement in honor of Mr. Moses was read to the"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "vice-presi dent and director <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr. on Nov. 17,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "vice-presi dent and director <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr. on Nov. 17,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1565.3, 603.26, 1737.3, 1062.04], "bbox_id": "e54866a732", "file": "AppomattoxNewspapers_1954-1955a_0205.pdf", "page": 1, "text": "The annual banquet of the Appo mattox County Teachers Association was held Monday, Feb. 7, in the Ap pomattox school cafeteria. , Mr. Francis Irving, president of the Association, presided. He first introduced Superintendent J. A. Burke, who in turn introduced Dr. Robert F. Williams, executive secre tary of the Virginia Education As sociation. Dr. Williams was the prin cipal speaker. He was accompanied by Mrs. Williams. In his introduction, Mr. Burke sketched the career of Dr. Williams, first as a high school teacher, then principal, superintendent, and then head of the Elementary Department in the state. He characterized Dr. Williams as a fighter for the under dog. Dr. Williams began his speech after a reference .to his long friend ship with Mr. Burke, with a warm tribute to State Senator Charles T. Moses, of Appomattox. He said, No one has fought more consistently for education in Virginia than Sena tor Moses. The rest of his address was devot ed to a study of retirement bene fits, disability allowances and sick leave, under Virginia state law. Dr. Williams noted that there are now 700,000 children in school in Virginia and 1,300 more teachers are employed than last year .through out the state. The rising birthrate means that still more teachers will be needed. The banquet was served by Mrs. L. L. Stanley and the cafeteria staff. Members of the seventh grade, un der the direction of Miss Flora Belle Williams, decorated the tables and made fate favors."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "tribute to State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. He said,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "tribute to State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. He said,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [839.97, 556.92, 1005.42, 1163.05], "bbox_id": "17a69e1349", "file": "AppomattoxNewspapers_1962-1965a_0017.pdf", "page": 1, "text": "The American Legion Auxili ary held its 43rd Annual Con vention at Virginia Beach, on Sept. 7, 8, and 9. Attending this convention from Appomattox Unit 104 was Mrs. Charles T. Moses, Jr. and Mrs. Shearer B. Robert son. At this meeting it was an nounced that Appomattox Unit 104 won first prize in their Poppy Window for the Dept, of Virginia. Mrs. Robertson accepted the check for this award in the ab sence of the Poppy Chairman. Mrs. John S. Moore and Mrs. E. T. Bruce were honored by hav ing membership given them in The Liberty Bell Ringers. Ap pomattox Unit 104 was also first in membership in the 4th. dis trict and brought home a pair of boxing gloves to present to the unit as being the champs of the district. The Appomattox Unit 104 is honored to have one of our mem bers, Mrs. C. T. Moses, Jr. as first vice president of the 2nd and 4th District Dept, of Virgin ia. Mrs. Moses was installed in this office at the convention at Virginia Beach. The Appomattox Unit 104 held their monthly meeting on Sept. 17th at the Post Home. At this time the following officers were installed for the 1962-63 sessions, president, Mrs. Shearer B. Ro bertson first vice pres., Mrs. Reba Bruce second vice pres., Mrs. Pearl Moore Secretary, Mrs. Mary Gray Holland Chap-  lain, Mrs. Peggy Harvey His-  torian, Mrs. C. T. Moses Jr. The Unit has already piaced the American Flag in each room I of the Appomattox High School, I Spout Spring arid Evergreen schools. Plans are in progress I now to place them in Pamplin, B ! Oakville and Vera Schools. This I is part of their Americanism pro-  gram. The Auxiliary also voted B to sponsor the Brownie Troops B in Appomattox for the coming B year. The next monthly meeting of the auxiliary will be held on October 8th in the home of Mrs.  c . T. Moses, Jr. Mrs. Mary Grey 1 will have charge of the program."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Unit 104 was Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. and Mrs. Shearer"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Unit 104 was Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. and Mrs. Shearer"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1628.84, 508.71, 1804.37, 986.51], "bbox_id": "569109e320", "file": "AppomattoxNewspapers_1960-1962b_0559.pdf", "page": 1, "text": "The 50th Anniversary of the or ganization of Girls Sioouts is behfe celebrated all over the country this week. The Central Virginia Council of Girl Scouts, Inc. of which Appo m attox is a mjamtoer, will highlight its annfivensary with a Golden An niversary Fair a t the City Armory Lynchburg, Virginia on Saturday, March 17th, from 130 to 6 p.si. Afll the girls scouts which number 1,803 in this council will pai-tici- pate in presenting exhibits, films, booths and 1 skits. All of the par ents and friends of the Girl Scouts are urged to go see The Girls In Action. Intermediate Girl Scout Troop  41 of Appomattox celebrated thi j occasion with a birthday party ai thtwr troop meeting on Tuesday, March 13, 1962. This troop is sponsored by the. Appomattox Wo mans Club. There are 18 mem bers of this troop and their leaa- ,rs are Mrs. Charles T. Moses, Jr. land Mrs. Jamies M1. Me Aden, and the Troop Committee is composed of Mm. John S. Grinds, Mrs. John Caldwell and Mrs. Lewis McUmor mon. Th girls opened their meet ing wftth thte flag ceremony and then highlights of the growth of G irl Scouts was given by their leaders. The girls of one of the patroHs then, present ad a .skit, Mirs. MicAden then presented the girls w ith the proficiency badges they had won this year. The girls had as their special guest the members of th e troop committed and also the -service team of this district. After refreshm ents tlhe girls formed their friendship dircle and were dismiss- T  __ - -"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "leaa- ,rs are Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. land Mrs. Jamies"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "leaa- ,rs are Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. land Mrs. Jamies"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2370.22, 702.79, 2542.49, 870.48], "bbox_id": "ffe92f693f", "file": "AppomattoxNewspapers_1947-1949a_0332.pdf", "page": 1, "text": "State Senator Charles T Moses presided at the meeting, lie asked tor a free and open, discussion of the pending election. He declared that there was unanimous support for the Democratic candidates for the Senate and Congrarfs, A. Willis Robertson and Watkins M. Abbitt, nut that some voters were ua-Veid ed as to the presidential contes- He emphasized the r.r,c of everv voter to form his own decision. After summarizing some of the is- sues at stake, he stated that tile over-all record of the party led him to support President Truman for re-election."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark> presided at the meeting,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark> presided at the meeting,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2295.3, 959.08, 2468.06, 1096.24], "bbox_id": "15821c247f", "file": "AppomattoxNewspapers_1947-1949a_0582.pdf", "page": 1, "text": "State Senator Charles T. Moses, of the Moses Motor Company off Appomattox has just been elected director at large of the Virginia Automotive Trade Association. Sen- ator Moses will represent his dis trict on the state board. Senator Moses is attending the aumuil convention of the Ahsocia- tion ia RiChitiftid this week and hi election to the Board off Directors off the organization-was announced today."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of the <mark>Moses</mark> Motor"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of the <mark>Moses</mark> Motor"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2473.65, 1251.55, 2619.25, 1614.99], "bbox_id": "73229633bc", "file": "AppomattoxNewspapers_1962-1965a_0102.pdf", "page": 1, "text": "State Senator Charles T. Moses of Appomattox, representing the 11th District Dr. William A, Pennington of Buckingham, Dele gate from Buckingham. Appo mattox and Cumberland coun ties, plan to run again for their respective offices, according to latest reports. Senator Moses, president pro tern of the Virginia Senate, and a senator since 1936, represents the 11th district which includes Appcmattox, Buckingham, Cum berland, Powhatan, Amherst, Nel son, and Amelia counties. He said on Monday that he will definitely run again, and that lie appreciates past and pre sent support from the people of the 11th district. Dr. Pennington, in a published interview, said I expect to run. I dont know what will happen but so far I dont have any op position. Pennington has serv ed in two sessions of the General Assembly. He said he also pro bably would make his formal an-  nouncement at his district Demo-  era tic Committee meeting, the date for which has not been set. Ash Trays To Valentines Save Them, Says Club"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomattox, representing the"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomattox, representing the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1988.37, 978.88, 2164.72, 1365.92], "bbox_id": "77505a6c16", "file": "AppomattoxNewspapers_1939-1943a_0334.pdf", "page": 1, "text": "State Senator Charles T. Moses, as a member- of the resolutions com mittee, secured passage by the an nual convention of the Young Dem ocratic Clubs of Virginia ir. Roan oke last Friday and Saturday, of a timely resolution recommending that the State Board of Education end the Budget Commission seek State appropriations to help defray the cost of school transportation. Senator Moses, resolution is aim ed at relieving the counties of an almost staggering cost of operating a transportation system for pupils. The convention named Richard S. Wright, of Woodstock, as president to succeed Franklin Daniel, of Lynchburg. Meeting in Roanoke Ausruest 2.1- 30, the convention postponed until 1947 a 40-year age limit on active members, by adopting a majority report submitted by Clav Church, committee chairman. The committee recommended that memt-rh of clubs chartered before January--l, 194,3, with age limits fif 18-4by,-.eould- con tinue to hie. members in good stand ing until January 1, 1947, when the age limit will become 40 years. Approximately 1,000 persons at tended the convention. Charjes R. I Fenwick, of Arlington, Celivered the keynote address, in which h. ad vocated Navy convoys to get sup- I plies to Britain, and tftdt the Repub lican Party was  making a political footbail of national defense."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, as a member- of"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, as a member- of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2084.44, 1396.12, 2250.43, 1451.27], "bbox_id": "99f555ae90", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "State senator Charles T. Moses and Calvin Kobinson, of Appomattox will be the speakers at e ppblic meeting of the Young Democratic Club of Buckingham, next Thursday night at Buckingham Court-House."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> and Calvin Kobinson, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> and Calvin Kobinson, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2012.65, 289.77, 2183.9, 470.92], "bbox_id": "852d4305c5", "file": "AppomattoxNewspapers_1939-1943a_0568.pdf", "page": 1, "text": "State Senator and Mrs. Charles T. Moses entertained at a buffet luncheon at their home preceding the memorial service held in Appo mattox Sunday afternoon. Guests included Governor Colgate W. Dar den, Jr., of Richmond Lieutenant Governor William M. Tuck, of Hali fax Andrew E. Godsey and Mar ion E. Blanton, of Cumberland Senator Robert Brock, of Farmville, Colonel Charles McCloud, of Lynch burg Mr. and Mrs. Harry E. Grif- i fin, of Buckingham, and Mrs. Sam-  uel L. Fergus n, Mrs. Vara Abbitt,  Mr. and Mis. Thomas V. Moses, j Mr. and Mrs. Frank C. Dresser, I Judge Joel W. Flood, George F. Ab- bitt, Jr W. M. .iltt, Dr. C. G. ! OBrien and Waiter Dresser."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> entertained at a buffet"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> entertained at a buffet"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2296.27, 945.73, 2463.8, 1043.83], "bbox_id": "26b6a23a09", "file": "AppomattoxNewspapers_1949-1952a_0447.pdf", "page": 1, "text": "State Sehator Charles T. Moses today called attention to the general election to be held in Virginia on Tuesday, November 6 . He cited the fact that county officers are to be elected on that date, and urged that there be a large turn-out of voters. There are some 2,200 eligible voters in the county, and the Appomattox tradition is for a heavy vote."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Sehator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> today called attention to"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Sehator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> today called attention to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1939.2, 975.43, 2267.59, 1218.23], "bbox_id": "99173de125", "file": "AppomattoxNewspapers_1933-1936a_0467.pdf", "page": 1, "text": "Spout Spring, May 28.- Billy Dickerson has accepted ia position in Alabama. tner and two -adopted children Hallie Wooten and William Alvis and one .brother, Clifford Wooten of iStonewall. Services were con ducted at the home by the Rev. O . G. Burnett, assisted by the Rev. R.T. Smptfti. Pallbearers were -the grandsons of the deceased Otis, Jesse Robert and Ernest Franklin and Major and Wilson Gowin. Honorary pallbearers were J . H . and F .A , OBrien and Charles T. Moses. Flower bearers were Mrs Frances OBrien,, Mrs. .Bertie Taylor Billye, Alice Gertrude and Thelma Margie, Louise and Emma Franklin Lula and Ruby Gowin Virginia Andrews, Eunice Brown, Phyllis Jean Taylor, Dorothy Fer guson end Eloise Trent. Mrs, Franklin was a faithful member of the Hollywood church and throughout her life all who knew her found her a true friend and Christian."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "F .A , OBrien and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Flower bearers were Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "F .A , OBrien and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Flower bearers were Mrs"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2227.41, 1501.8, 2401.13, 1788.53], "bbox_id": "38bbc8b0ad", "file": "AppomattoxNewspapers_1952-1954a_0373.pdf", "page": 1, "text": "SPONSORS CLASS A. C. dePorry, director of the Lynchburg Center of the University of Virginia Extension Division, has announced the formation of an. In terior Decorating class here..  Thin class will be given by practicing In terior Decorators who are member of the Virginia Chapter, American Institute of Desijn, under the direc tion ef the University of Virginia Extension, and sponsored by the Womans Club of Appomattox. The first class, with John Manzer lecturing on Fun, Facts and Falla cies in Decorating, will meet at the Appomattox High School, Room IT Tuesday, Oct. 29, at 7 P. M. The tuition for this ten-lecture non-credit course is 16. Classes wilt he open only to those registering for the entire course. Registrations can be made through Oct. 29, by- contacting Mrs. Bessie H. Caldwell, chairman of the Education Depart ment of the club Mrs. Charles T. Moses, Jr., chairman of the Ameri can Home Department, or Mrs. Joel W. Flood, Club President."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of the club Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of the club Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., chairman of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.01, 755.19, 1868.95, 777.48], "bbox_id": "efdf687544", "file": "AppomattoxNewspapers_1892-1898a_0051.pdf", "page": 1, "text": "SOUTH SIDE DISTRCI0T.  Charles T. Moses, Peoples Party,"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "SOUTH SIDE DISTRCI0T.  <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Peoples Party,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "SOUTH SIDE DISTRCI0T.  <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Peoples Party,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2023.83, 916.68, 2303.16, 1092.98], "bbox_id": "59bf549dc6", "file": "TimesVirginian_1978_0415.pdf", "page": 1, "text": "SOM EONE W ILL WIN THIS 1878 LIM ITED EDITION CHEVROLET CORVETTE during the Railroad Festival this week end. According to Charles T . Moses, Jr . of Moses Motor Company, the car will be on display on Main Street this week endaSGto4rwhigTi4Bbeliridat5i.m. L ThelW 8 Limited Edition Chevrolet Corvette has brought over 81,000 at auction - some one will win this car for a mere 5.00 donation., . All proceeds after expenses will go for operating expenses at Robert E . Lee Academy. Tickets are available and will be on sale Saturday while they last. Make your donations now mid you may be the lucky winner and help the local Robert E . Lee Academy at the same time. Students of the Academy shown with car in above photo are, left to right, Angela Hackett, Andra Doss, Sissy Knight, Pedi M yrick, Herbie Jones, Darrell Bryant, Troy Loveday, Sarah Morris, Shanna Bryant, Clyde Blayberry, Laura Doss, Brian W allace, Melinda Fleshman and L . A . Bryant."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "week end. According to <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark>, Jr . of <mark>Moses</mark> Motor"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "week end. According to <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark>, Jr . of <mark>Moses</mark> Motor"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [686.91, 396.11, 855.7, 444.51], "bbox_id": "799c086e9a", "file": "AppomattoxNewspapers_1960-1962b_0409.pdf", "page": 1, "text": "Senator Charles T. Moses return ed home Tuesday from the Virginia Baptist Hospital, where he had been a patient for two weeks. His con dition is reported to be saisfactory."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> return ed home Tuesday from the Virginia Baptist Hospital, where he had been a patient for two weeks. His con dition is reported to be saisfactory."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> return ed home Tuesday from the Virginia Baptist Hospital, where he had been a patient for two weeks. His con dition is reported to be saisfactory."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [863.06, 464.85, 1006.11, 637.3], "bbox_id": "cd296ad8bc", "file": "AppomattoxNewspapers_1962-1965a_0280.pdf", "page": 1, "text": "Senator Charles T. Moses an nounces the marriage of his sis ter, Mrs. Nettie Moses Dresser to Mr. Willis Dottridge Martin. The double ring ceremony was performed by Dr. Harvey W. Ashby, pastor of Aabury Me morial Methodist Church, Har risonburg. Marriage took place in the home of her son, Walter C. Dresser. The bride is the daughter of Mr. and Mrs. Thomas Walker Moses and the groom is the son of the late Mr. and Mrs. W. D. Martin. They will make their home in Appomattox and Harrisonburg."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> an nounces the marriage"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> an nounces the marriage"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [634.1, 295.59, 804.23, 367.79], "bbox_id": "1d794c7247", "file": "AppomattoxNewspapers_1939-1943a_0152.pdf", "page": 1, "text": "Senator Charles T. Moses,  -Pi-mat ox, was re-el acted as jaident of the Virginia Dark Fir ed Tobacco Growers Association as i-.a o.a.r incumbent officers were also re-named at a recent meeting of the nw board of directors held tn Farmville."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>,  -Pi-mat ox, was re-el"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>,  -Pi-mat ox, was re-el"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2077.44, 895.23, 2194.6, 903.73], "bbox_id": "699a1b36a2", "file": "AppomattoxNewspapers_1936-1939a_0053.pdf", "page": 1, "text": "Senator Charles T. Moses"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2459.41, 500.24, 2621.01, 1484.58], "bbox_id": "4fc838de42", "file": "TimesVirginian_1978_0415.pdf", "page": 1, "text": "School Chorus, under the direction of M s. Teresa Quesenberry, w ill provide musical entertainment during the ceremonies after the parade. A new attraction to this years Railroad Festival will be an Air Show, Sunday, Septem ber 24 from 4 p.m. until dusk, weather permitting. Sky is the Limit from Lynchburg will have their hot air balloon and hangglider. Richmond Gra phics will also have a hot air balloon. Dave Carnes and Je ff Schultz will have hanggliders and there w ill also be exhibitions by tow kites, parachutists and parasails. All this can be seen at the home of James R. Ford, Jr ., Locust Grove Farm, 1 mile from 460 on the Church Street Extension. Highway 641. Arrangements for the Air Show were made by Mr. Bill Britton, Town Manager and Assistant to the Board of Supervisors. The Appomattox Womans Club is hosting the M iss Appomattox Beauty Pageant Saturday night, 800 at the high school. Sunday at 1230 p.m ., the former Virginia Governor Mills Godwin will unveil a portrait of the late Virginia Senator Charles T . Moses, given by his fam ily to the County of Appomattox. Virginia Fibre Corp. and the Future Farmers of America are providing i  crosscut sawing contest on Saturday and Sunday. The Beard Growing Contest, sponsored by the Downtown Merchants Association, will be judged at 230 Saturday afternoon. The entrants are requested to report to toe contest area at that time. The prizes will be awarded at 3 p.m. in the Depot area. An historic dress contest is scheduled for Sunday. Prises will be given in the five categories of men, women, children, couple, and family. Entrants should report to toe contest area at 180 and the winners will be announced at 315. Parking for toe handicapped will be at Coleman and Sons on Main Street. Main, Harold and Lee Streets will be dosed to traffic. Limited parking will be available surrounding toe down town area. We suggest parking at Appomattox County High School. Shuttle buses will be running between downtown and ACHS every 15 minutes for an hour at the beginning and end of each day. A com plete schedule of events and bus times can be found in the Depot Journal - the newspaper publiihed by the festival. Although the Appomattox Junior Womans Club and the Town of Appom attox are co-sponsoring the Festival, many civic organizations and local businesses have partici pated in the planning and production of the Sixth Annual Railroad Festival, September 28 and 24."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "the late Virginia Senator <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark>, given by his fam"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "the late Virginia Senator <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark>, given by his fam"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [170.92, 315.29, 2230.4, 593.2], "bbox_id": "dc669016c2", "file": "AppomattoxNewspapers_1939-1943a_0123.pdf", "page": 1, "text": "Rural Briefs TO CHECK Trial by Error A class of 63 Seniors will reeehS diplomas at Appomattox high schol commencement exercises next Fridas night, June 7. IThe following pr gram has been announced  Orchestra Processional Invocation, Rev, L Address of .welcome, ChanejR Moses Jr., class president Salutatory, Charles T . Moses ES If I rest, I rust by ConstagJ Fulp Does a high school educatlk pay? by Mary Helen Johnshos  Personality looks ahr?ad by Frj ces Harvey Yesterday, today and tomorrow by Tlah Buchanan When will Democracy fail? T James Redding The hoipe of Amaria by Jam Bites, Jr. Awarding of diplomas, scholarshjE and medals, by Principal L. Crt ley Valedictory, James Sites Jr, ,Recessional."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Jr., class president Salutatory, <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark> ES If I rest,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Jr., class president Salutatory, <mark>Charles</mark> <mark>T</mark> . <mark>Moses</mark> ES If I rest,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1340.06, 391.87, 1471.21, 588.46], "bbox_id": "a98ec91a91", "file": "TimesVirginian_1981a_0410.pdf", "page": 1, "text": "ROBERT THACKSTON center. Manager of District Office of Social Security, was recent guest speaker for the American Legion Post 104, Appomattox. Thacks- ton, who has been with the Social Security Administra tion for approximately 20 years, discussed Operation Social Security.......What Has Created Problems With SS Trust Fund and Reme dies Now Before Congress. Seated, left, is Dennis Gragg, and Charles T. Moses, right, both mem bers of American Legion Post 104."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "is Dennis Gragg, and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, right, both mem bers"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "is Dennis Gragg, and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, right, both mem bers"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2075.5, 1398.89, 2245.66, 1513.54], "bbox_id": "4580ad96e4", "file": "AppomattoxNewspapers_1939-1943a_0010.pdf", "page": 1, "text": "ress. Law James Harvey, Julian Hesson, J. E. Carson, Jr., R. B Hudgins, Jr., Jack Lawson, Charles T. Moses Jr., Ralph Moore. Art Margaret Stratton, Irene Trent, Jane Dickerson, Robert Lee, Rudel Seay, Bessie Thornhill, Christine Crews, Mary Ann Wheeler, Rebecca John son, Catherine Christine."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Hudgins, Jr., Jack Lawson, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., Ralph Moore. Art"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Hudgins, Jr., Jack Lawson, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., Ralph Moore. Art"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1806.15, 879.26, 1966.3, 1092.63], "bbox_id": "4e6d2d3b0e", "file": "AppomattoxNewspapers_1892-1898a_0370.pdf", "page": 1, "text": "Resolution of Respect. Resolved, That we the members of Liberty Alliance iu regular monthly meeting assembled on this the 26th day of Dec. 1896. Having been called through the wisdom of Almighty God, since onr last meeting to mourn the death of our worthy President and Brother, Charles T. Moses do hereby testi fy onr high esteem for his honesty and lutegrity in his official capacity and as a citizen. Onr love for him as a  friend and Brother, and- the great loss that oqr order sustains in his death. To his bereaved family we tender onr heartfelt sympathies. R. K .-P urdum , T. A. C aldwell , J. F. P urdum , Committee."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "worthy President and Brother, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> do hereby testi fy"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "worthy President and Brother, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> do hereby testi fy"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1559.04, 526.91, 1733.72, 749.8], "bbox_id": "92d92f2d12", "file": "AppomattoxNewspapers_1960-1962b_0230.pdf", "page": 1, "text": "Rep. Watkins M. Abbiiit, Fourth District Congressman, spoke on Na tional Jjjjfecurity, at a joint meeting of the .American Legion and the Legion Auxiliary at the American Legion Home Monday night. Mrs. Abbitt was also a guest at the meeting. x Mrs. Robert Montgomery, Na tional Security Chairman for Unit 104 , introduced the speaker. Mis. John S. Moore presided. Mrs. Charles T. M-oses, Jr., the Fourth District President, spoke briefly on her day a t the AJuxiliary Gift Shop at McGuire Hospital, and Mis. Ivey Holland, the Department Membership officer, spoke briefly on membership. Mrs. Henry Pack, Mrs. Martin W ebb,. Mrs. Herbert PuMiam1, Mrs. R. D. Robinson were hostesses for,the evening."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "M-oses"], "snippet": "S. Moore presided. Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>M-oses</mark>, Jr., the Fourth District"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "M-oses"], "snippet": "S. Moore presided. Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>M-oses</mark>, Jr., the Fourth District"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2115.6, 1504.95, 2289.59, 1655.85], "bbox_id": "6fd810f053", "file": "AppomattoxNewspapers_1960-1962b_0174.pdf", "page": 1, "text": "R. Sheffield of Victoria is State Chairman of this Project. Mre. Charles T. Moses, Jr., of Appomattox, is President of the Fourth District presided at the meeting, which was held in the Farmville Baptist Church. Members of Jack Garland Unit number 32 Farmville were hostesses for the meeting, The District Chairmen were present to present their plans for thè work of The Auxiliary for the year. Mrs. Charles G. L. Huether of"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of this Project. Mre. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., of Appomattox, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of this Project. Mre. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., of Appomattox, is"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [684.5, 320.09, 1494.79, 440.99], "bbox_id": "2ac0d796b4", "file": "AppomattoxNewspapers_1960-1962b_0313.pdf", "page": 1, "text": "quality Mrs. H.uglTBailey, of Darlington Heights, and boys, spent Wednesday with Mrs. J. J. Chernault. Mr. and Mrs. Charles T. Moses, J it. we re dinner guests of the American Legion Auxiliary, Unit No. 57, in Suffolk, on Tuesday eve ning. John Ivey Holland left Monday for V. P. I., after spending the rnpinv tnlidvs at his home here."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Chernault. Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, J it. we re"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Chernault. Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, J it. we re"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1662.87, 1520.86, 1828.18, 1566.4], "bbox_id": "cd28d95dcd", "file": "AppomattoxNewspapers_1939-1943a_0567.pdf", "page": 1, "text": "Pvt. Charles T. Moses, Jr., who has been stationed at Fort Riley, Kansas, is now at Lexington. Pvt. Moses will spend the week-end at his home here."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Pvt. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., who has been stationed at Fort Riley, Kansas, is now at Lexington. Pvt. <mark>Moses</mark> will spend the week-end at his home here."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses", "Moses"], "snippet": "Pvt. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., who has been stationed at Fort Riley, Kansas, is now at Lexington. Pvt. <mark>Moses</mark> will spend the week-end at his home here."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2107.7, 1551.45, 2276.39, 1707.35], "bbox_id": "6c42a00ee9", "file": "AppomattoxNewspapers_1952-1954a_0270.pdf", "page": 1, "text": "P.-T. A. Hold Final Meeting The Appomattox P.-T. A. held its final meeting of the year on May 19 in the High School Cafeteria. The new officers, Charles T. Moses, Jr., and Mrs. Leonard Anderson, were installed by the outgoing president, Mr. John Taylor. Mr. Moses then announced the following chairmen for the coming year Program, Mrs. A. R. Harwood, Jr. Finance, Rev. B. T. Price Cafeteria, Miss Laura Mottley Athletics, Judge Joel W. Flood Band, Mrs. B. V. Caldwell and Publicity, Mrs. J. R. Lawson, i"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Cafeteria. The new officers, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., and Mrs. Leonard"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Cafeteria. The new officers, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., and Mrs. Leonard"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.26, 992.3, 1902.18, 1233.44], "bbox_id": "62d130cbb3", "file": "TimesVirginian_1983a_0172.pdf", "page": 1, "text": "ParuMue remembermg  those Mrs. Virginia M, Bahcpck, days, dimeteit of the Appomattox County I didimi know what to,call her, SO Department of Social Services, has l last raised my hand when, needed received. the Meritorious Service to get her attention, Pat continued. Award, recognising individuals who She was a good teacher, but make substantial contributions to strict...! couldnt get by with even a human services in the Common little talking in school! Pat said. Wentth of Virginia. W After teaching school, Virginia Innovative leadership and a spent seven years with the Juvenile tireless, sensitive commitment and Domestic Relations Probation characterize the puMic service Services. At the end of that period, career of Virginia M. Babcock, he accepted the position as reads the award, signed by William Director, Appomattox County De- L. Lukhard, Commissioner of Social partmentof Social Services. Services for the Strie of Virginia. She is. indeed, a earing person, A daughter of the late Senator commented Babcocks sister, Mrs. and Mrs. Charles T. Moses. Virginia Carolyn Lusardi - of Brook neal. is a gradiiete of Appomattox High Every Sunday, regardless of how School, attended Sweet Briar busy her personal schedule may be, College, received a BA degree from Virignia goes to a Lynchburg nurs- Lynchburg College and a Masters ing home to spend time with an from the University of Virginia. elderly distant cousin. She does"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "sister, Mrs. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Virginia Carolyn Lusardi - of"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "sister, Mrs. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. Virginia Carolyn Lusardi - of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1706.88, 933.85, 1874.98, 1061.0], "bbox_id": "785804921c", "file": "AppomattoxNewspapers_1955-1957a_0252.pdf", "page": 1, "text": "On August 13 , 1896, sixty years ago Monday, simple but lasting marriage vows were made by Miss Cifra Matilda Mann, 20 year old daughter of Mr. and Mrs. Charles Robert Mann, and her chosen bride groom, Thomas Walker Moses, 23 son of Mr. and Mrs. Charles T Moses, all of Appomattox. Thè Rev. B. W. Johnson officia ted at the ceremony on a Wednes day morning at 11 oclock, in the"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark>, all of Appomattox. Thè"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark> <mark>Moses</mark>, all of Appomattox. Thè"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [961.2, 491.33, 1130.5, 1114.06], "bbox_id": "411c3dde93", "file": "AppomattoxNewspapers_1954-1955a_0093.pdf", "page": 1, "text": "of Liberty Baptist Church. Her father, Thomas E. LeGrand, along with several brothers, volunteered in the Confederate Army. Because of his bravery and proficiency he was promoted to the office of Lieutenant  quote from Times-Virginian of March 4, 1903. Mrs. Hancock joined the church which her grandfather helped organ ize at an early age and in this church was married to Mr. Hancock, a descendant of several of the oldest families of Charlotte County.Mr. and Mrs. Hancock built their home here soon after their marriage and have contributed much to the growth and development of the town and com munity. Mrs. Hancock is survived by five daughters and one son Mrs. Walter W. Scott of Appomattox Mrs. W F. Woolfork of Petersburg? Miss Annie Hancock of Lynchburg and Appomattox Mrs. Paul S. Drinkard, W. E. Hancock, and Mrs. Watkins M. Abbitt, all of Appomattox by the following grandchildren Mrs. Nancy Scott Goode of Lynchburg, William F. Woolfork, Jr. of Peters burg Walter E. Hancock, Jr., Anne Watkins Jr. and Rinne Abbitt of Appomattox one great-grandchild, Susan Virginia Goode of Lynchburg. She is also survived by two brothers and two sisters Mrs. Manie S. Kelley and Luther B. LeGrand of Lynchburg, Mrs. W. D. Mason of Rice, and W. J. LeGrand of Appo mattox. Funeral services were held at 11 A. M. October 4 in Liberty Baptist Church, of which she was one of the oldest members, with interment in Liberty cemetery. Her pastor, Dr. Carl A. Collins, Jr., conducted the services, assisted by two former pas tors of her church, Dr. W. M. Thompson of Middleburg, Virginia and Dr. V. W. Sears of Clifton Forge. Honorary. pallbearers were the Deacons of her chuch and flow er bearers were members of the Womans Missionary Society. Active pallbearers were Charles T. Moses Alfred R. Harwood, Jr George F. Abbitt, Jr., Alfred Lawson, and four of her nephews, Ned LeGrand of Appomattox Luther B. LeGrand Jr., and William A. Kelley of Lynch burg, and Charles L. Mason of Crewe."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Society. Active pallbearers were <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Alfred R. Harwood, Jr"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Society. Active pallbearers were <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Alfred R. Harwood, Jr"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.03, 855.29, 2088.89, 896.24], "bbox_id": "e6cf777230", "file": "AppomattoxNewspapers_1962-1965a_0450.pdf", "page": 1, "text": "O n the right is Senator Charles T. Moses, of Appomattox. S ta n d in g behind his Excellency are Dr. J. A. Mathews, Heritage w rice-president John Spencer, clerk of Buckingham County s a n d James A. Smith, Heritage treasurer."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "the right is Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. S ta"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "the right is Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, of Appomattox. S ta"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1661.31, 562.76, 1822.51, 660.36], "bbox_id": "7bb8c4382a", "file": "AppomattoxNewspapers_1933-1936a_0259.pdf", "page": 1, "text": "Next Tuesday, August 6, the vo- terg of Appomattox County will go to the polls to cast their ballotg in tie Democratic primary. Appomattox voterg will be expect ed to support county men this rime. Charles T,, Moses, local auto mobile, dealer, is seeking the state senate post held by the late S. L . Ferguson. His opponent ip J . Kent Early of Charlotte. Four counties"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "county men this rime. <mark>Charles</mark> <mark>T</mark>,, <mark>Moses</mark>, local auto mobile, dealer,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "county men this rime. <mark>Charles</mark> <mark>T</mark>,, <mark>Moses</mark>, local auto mobile, dealer,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1848.61, 694.63, 2018.53, 1304.17], "bbox_id": "80485ed5b6", "file": "AppomattoxNewspapers_1949-1952a_0503.pdf", "page": 1, "text": "ner. In reviewing the history of the bank since its organization in 1918, Mr. Abbitt stated that the primary purpose then was not to make money but to serve as a community project. Mr. Abbitt told the stockholders it was an institution to be proud of and cited figures of dividends paid in past years. F. L. Murphy, president, in ad dressing the group, thanked the stockholders for their past co-opera tion and expressed his gratitude for, the confidence implied in his election to this office in 1937 and re-election each year since. George F. Abbitt Jr., was named to preside as chairman over the busi ness session. Of the 500 shares of stock there were 393 represented, 266 in person and 127 by proxy. T. DeWitt Evans, cashier, was called upon to read minutes of last years meeting which were approved. Mr. Evans then gave the financial statement which revealed from the set income 6,000.00 was divided among the stockholders. He gave ia- teresting facts of the banks growth with resources four times the amount reported 10 years ago and deposits more than four times as great in the same length of time. Unanimously re-elected were the twelve directors, George F. Abbitt Jr., W. M. Abbitt, Charles F. P. Crawley, T. DeWitt Evans, C. S. Jenkins, C. S. Me Dear-man, L. J. Morris, Wiley M. Morris, C. T. Moses, T. W. Moses, F. L. Murphy asd Mrs. Mary B. Murphy. Two new directors were elected, Alfred- R. Harwood Jr., and Charles T. Moses Jr. After the directors took the oath of office, the present officers of the bank were re-elected F. L. Murphy, president Luther J. Morris, vice- president. C. S. McDearmon, vice- president T. DeWitt Evass, cashier and Mrs. Jessalyn Drinkard, assist ant cashiei. The past presidents of the bank in the order which they served were, C. W. Hancock, C. A. Hancock, M. C. Smith and F. L. Murphy. A silent pause was observed in memory of the late C. A. Hancock and Alfred R. Harwood Sr., a past I president and a past cashier of the bank, respectively, who have passed on Bince the last meeting."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "R. Harwood Jr., and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr. After the directors"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "R. Harwood Jr., and <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr. After the directors"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [891.6, 709.17, 1040.6, 929.79], "bbox_id": "89c004eea1", "file": "TimesVirginian_1978_0069.pdf", "page": 1, "text": "NAMED TO DEANS LIST LEXINGTON - Feb. 7 - At I Virginia Military Institute 300 cadets have been named to the deans list for the first semester of the academic year. The honor list, which requires a grade point average of 3.0 on a 4.0 scale, is almost evenly divided between Vir ginia and out-of-state cadets, with the largest number coming from the senior and junior classes. Among those named is Charles T. Moses, III, son of Mr. and Mrs. C. T. Moses, Jr., of Appomattox. Moses is a history major in his third year atVMI."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Among those named is <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, III, son of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Among those named is <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, III, son of Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2166.43, 534.3, 2334.11, 612.25], "bbox_id": "9cc022a502", "file": "AppomattoxNewspapers_1949-1952a_0561.pdf", "page": 1, "text": "Mrs. Webster Babcock, of Am herst entertained at a brides luncheon Tuesday in the home of her parents, Mr. and Mrs. Charles T. Moses, honoring Miss Helen May Poe, whose marriage to James Al bert Beatty, Jr. will take place here April 5th."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "parents, Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, honoring Miss Helen May"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "parents, Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, honoring Miss Helen May"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [369.06, 655.31, 534.8, 1262.98], "bbox_id": "0a34a90934", "file": "AppomattoxNewspapers_1926-1933a_0516.pdf", "page": 1, "text": "Mrs. W. H. S. Barlow. Miss Ella Drinkard, of Lynch burg, visited her nephew, A. R. Harwood, last week. Charles T. Moses entertain ed his little friends at an Easter egg hunt Saturday. Joyce Cole found the most. Miss Catherine Gills spent the Easter holidays in Charles ton, W. Va. The Recreational Club has fixed up the court house tennis court, ready for the Spring sea son. Mss Lois Lucado and Mr. Al len Kent, of Halifax, spent the eek-end with Mr. and Mrs. A. H. Lucado. Mr. and Mrs. Lewis Winters, Mr. R. E. Caldwell, Sr., Mrs W. A. Agee and Miss Jannie Caldwell spent Easter with re latives in Roanoke Hubert Caldwell is in Vir ginia Baptist hospital, recover ing from an operation pre formed Monday. Mr. and Mrs. Green and Mr. a n d Mrs. Will Walton spent Easter with their parents, Mr. and Mrs. T. A. Walton. Local school teachers have returned from visits to their homes during the Easter holi days. Mrs. A. B. White, of Lynch burg, visited her parents, Mr. and Mrs. L. E. Smitji, recently. Mrs. Lottie Btedsoe, who has been sick for sometime is now able to be up again Miss Grace Garlington spent the Easter holidays with Miss Mary Grey Sears. George Langran, Jr., was home last week-end. Jim Langran spent Sunday with Alfred Harwood, Jr., at Blacksburg. R. B. Hudgins spent Wednes day in Richmond. Lester Harvey is confined to bed on account of sickness Ned Wages, of Lynchburg, spent Wednesday here. Mrs. D. B. Henderson, of Richmond, is"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "R. Harwood, last week. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> entertain ed his little"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "R. Harwood, last week. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> entertain ed his little"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.08, 952.59, 1719.18, 1001.94], "bbox_id": "b67c2e2ba4", "file": "AppomattoxNewspapers_1955-1957a_0288.pdf", "page": 1, "text": "Mrs. Vincent Lusardi and three daughters, Jean, Terry and Dee, and son, Vincent Jr., spent Sunday here with her parents, State Sena tor and Mrs. Charles T. Moses."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. Vincent Lusardi and three daughters, Jean, Terry and Dee, and son, Vincent Jr., spent Sunday here with her parents, State Sena tor and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. Vincent Lusardi and three daughters, Jean, Terry and Dee, and son, Vincent Jr., spent Sunday here with her parents, State Sena tor and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.38, 1506.46, 2591.46, 1627.06], "bbox_id": "d9db0978e4", "file": "AppomattoxNewspapers_1962-1965a_0604.pdf", "page": 1, "text": "Mrs. Ivey Holland, Moderator. In honor of the occasion, Feb ruary 22, Charles T. Moses III appeared dressed in the costume of Gqorgc Washington and gave a quotation from this great statesman. During the business session which followed, the club voted to request the Town to proclaim Mrs. Millard Stimpson _ _________ ___ _ _____ ____ and Red Christmas Decorations!more beautiful for the Centenn-1 March 15 to April 2 as a special ial celebration and maintaining clean-up period for the Centenn-"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "occasion, Feb ruary 22, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> III appeared dressed in"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "occasion, Feb ruary 22, <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> III appeared dressed in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2282.84, 171.87, 2426.04, 321.06], "bbox_id": "dcbe9627fe", "file": "TimesVirginian_1978_0233.pdf", "page": 1, "text": "Mrs. Harry E. Ranson, and Mrs. Month Mays. Guests included friends and relatives of the bride-elect. The wedding of Miss Herndon, daughter of Mr. and Mrs. William Robertson Hern don of Brookneal and grand daughter of the late State Senator and Mrs. Charles T. Moses of Appomattox, to Mr. Timothy Wayne Gentry will be an event of June Third at the home of Mr. and Mrs. Babcock."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomattox, to Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "State Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> of Appomattox, to Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.1, 934.83, 2059.3, 1529.27], "bbox_id": "65ecf8e810", "file": "AppomattoxNewspapers_1952-1954a_0360.pdf", "page": 1, "text": "Mrs. Giles C. Engledove, of Rich mond will speak at the first fall meet- .. .... e At, 01.-L tyP Amnn- illg ui Vuc n vutaflo viBw  Li jijJU- mattox, at 330 Monday afternoon, Sept. 14, at Mauds Hot Shop. Mrs. Bessie H. Caldwell, chairman of the Education Department will present Mrs. Engledove. Mrs. Engledove is president of the Presidents Council of Womans Clubs of Richmond member of the advisory board of the Salvation Ar my, Care Committee works for the interest of the Crippled Childrens Hospital chairman of the Womans Organization for the Red Cross Blood Program in Richmond and is active jn religious work. She is a native of Appomattox, daughter of the late Mr. and Mrs. J. R. Atwood. The program committee of the local club has announced programs for the coming months. They are Oct. 5, 1953 Legislation Depart ment, Mrs. George F. Abbitt, Jr., chairman, will present Hon. Robert Whitehead, member of the House of Delegates, Nelson County, who will speak on, Conditions in the School for the Blind and Deaf in Staunton Va., and Conditions in Mental In stitutions in Virginia. Nov. 2, 1953 Fine Arts Depart ment, Mrs. R. G. Janatka, chairman will present Mrs. A. R. Harwood, Jr She will review James Hiltons new book, Time and Time Again. Dec. 7, 1953 International Rela tions Department will offer a panel discussion on Americas Foreign Po licy. , Jan. 4, 1954 Conservation Depart ment, Mrs. T. M. Trent, chairman, will present a talk on National Parks, illustrated with slides. Feb. 1, 1954 American Home Department, Mrs. Charles T. Moses, Jr., chairman, will offer a program on interior decorating, by Walter G. Schnee, Richmond, Va. March 1, 1954 Welfare Depart ment, Mrs. Hazel R. Mann, chair man, will present a program. April 5, 1954 Public Affairs De partment, Mrs. Howard Kerr, chair man, will present a program."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "American Home Department, Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., chairman, will offer"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "American Home Department, Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., chairman, will offer"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1718.67, 492.91, 1884.23, 541.35], "bbox_id": "366ddffaf3", "file": "AppomattoxNewspapers_1952-1954a_0600.pdf", "page": 1, "text": "Mrs. F. E. Moore, Mrs. F. N. Bailey and Mrs. Troy Livingood, of Roanoke were luncheon guests Tues day of Mr. and Mrs. Charles T. Moses, Jr."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. F. E. Moore, Mrs. F. N. Bailey and Mrs. Troy Livingood, of Roanoke were luncheon guests Tues day of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr."}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. F. E. Moore, Mrs. F. N. Bailey and Mrs. Troy Livingood, of Roanoke were luncheon guests Tues day of Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.54, 531.46, 1752.79, 1081.21], "bbox_id": "a4ea6ee607", "file": "AppomattoxNewspapers_1962-1965a_0121.pdf", "page": 1, "text": "Mrs. Eula F. Wooldridge Mrs. Eula Fleshman Woold ridge, 85, who had rriade her home for the past 25 years with her son and daughter - in-law, Mr. and Mrs. Jeter Witt Woold ridge at 229 Chestnut St., Cov ington, died at 715 p.m., Thurs day, Feb. 28, in the CO Hos pital, Clifton Forge, where she had undergone emergency sur gery, Feb. 21. Mrs. Wooldridge was born in Appomattox County, March 24, 1878, a daughter of the late Willis Fleshman and Bertie Whitehead Fleshman. She was a member of the Concord Presbyterian Church in Charlotte County. Surviving other than her son, is one brother, E. W. Fleshman, of Roanoke and Wytheville. She was preceded in death by her husband, Jeter Cury Wooldridge, in 1933, and by one son Joel Thomas Woolridge, in 1910. A funeral service was held Sun day at 2 p.m. in the Concord Presbyterian Church, with her pastor, the Rev. Mr. Skidmore officiating. Interment was in the church cemetery. Active pallbearers were W. A. Haynes, Fred Martin, DeWutt Harvey, Frank Fleshmlan, Clyde Fleshman, Wlalter Smith, Law rence Stewart, Jr., and Duval Conner. Honorary pallbearers were Courtney Harvey, George Threa- ves, Dr. UMty Monger Powell, Dr. Wlalter Johnson, Dr. M. I. Hanna, Mrs. Carolyn Dykes Dr. Meade Edmunds, Dr. J. M. Em mett, Dr. R. Preston Hawkins, Richard F. Beime m , Earl Key. T. I. Hardy, Howard Davis, J. B. Vaughan, Robert MteCaleb, the Rev. Ryburn T. Siancil, Tom Christian, Ernest Schumaker, Senator Bale Collins, Senator Charles T. Moses, and Congress man Watkins Abbitt. Also, the Hunter family of Charlotte Coun ty nephews, great- nephews, husbands of her Meces and the Women of the Concord Presby terian Church."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator Bale Collins, Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and Congress man Watkins"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Senator Bale Collins, Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and Congress man Watkins"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [959.74, 323.96, 1101.07, 428.5], "bbox_id": "00964fb13f", "file": "AppomattoxNewspapers_1962-1965a_0173.pdf", "page": 1, "text": "Mrs. Charles T. Moses, Jr., vice - president and program chairman of the South Central District Council of Accredited Flower Show Judges attended a meeting of this group in Brod nax, Wednesday, May 22. Mr. Ellis W. Wampler presented the program, a demonstration on Flower Arranging with empha sis on Design."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., vice - president and"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., vice - president and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1981.42, 888.02, 2151.16, 987.56], "bbox_id": "e85d22d9ff", "file": "AppomattoxNewspapers_1960-1962b_0366.pdf", "page": 1, "text": "Mrs. Charles T. Moses Jr., the Fourth Distrist President, has an nounced that the annual .meeting of the Fourth1 District of the Ameri can Legion Auxiliary, Department of Virginia, is being planned for Sunday, Jun 18, at 2.00 P- M. E. S. T., at the American Legion Home of Petersburg Post No. 2, in Petersburg."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., the Fourth Distrist"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., the Fourth Distrist"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.25, 1520.64, 1782.88, 1762.04], "bbox_id": "1ae3501436", "file": "AppomattoxNewspapers_1974-1975a_0478.pdf", "page": 1, "text": "Mrs. Charles T. Moses, Jr., President of the South Central District, Virginia Federation of Garden Clubs, Inc., will preside the program, An Evergreen  Christmas, at the South Central District Meeting on Sat., Oct. 25, at the Appomat tox County High School. Mrs. Charles T. Moses, Jr President of the South Central District, Va. Federaton of Garden Clubs, Inc., will preside over the business meeting at 1030 a.m. and the luncheon at 1 p.m.  The Appomattox Garden Club wil host the Coffee Hour at 930 a.m. and will serve as the hostess club for the meeting. Mrs. Reid Shields is President of the Appomattox Garden Club."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., President of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., President of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [345.85, 832.63, 492.67, 1367.94], "bbox_id": "67004ce14f", "file": "AppomattoxNewspapers_1974-1975a_0248.pdf", "page": 1, "text": "Mrs. Charles T. Moses, Jr. of Appomattox was elected presi dent of South Central District, Virginia Federation of Garden Clubs, Inc., at its annual meeting in Farmville on Tues., April 8. Mrs. Moses, a member of the Appomattox Garden Club since 1947, has served two terms as its president. She has also served the District as Director - Treasurer as well es many committee chairmanships. She is a National Council Accredited Flower Show Judge holding a Masters Certificate and wUl complete her two year term as President of South Central District Council of Nationally Accredited Flower Show Judges in May. She is also a member of The Virginia Council of Nationally Accredit ed Flower Show Judges. For six years she has served on the Board of Directors of the Virginia Federation of Garden Clubs, Inc. and is currently serving as Memorial Gardens Chairman for the State. Mrs. Moses has chosen as the theme for the next two years - Conservation Today - Our Heritage for Tomorrow The Horticulture project will be Daffodils  a new one in every garden. The objectives 1. To con tinue to support state and national objectives. 2. Involve ment - of every member. I suppose I inherited the love of flowers and gardening from my mother but I didnt inherit her green thumb, she says. With my church my family and my Garden Club work, I hardly find time to garden. But her garden at this time is a host of golden daffodils and her Camellias are"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. of Appomattox was"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. of Appomattox was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [389.49, 817.08, 558.26, 917.38], "bbox_id": "ac5f9739bb", "file": "AppomattoxNewspapers_1954-1955a_0198.pdf", "page": 1, "text": "Mrs. Charles T. Moses, Jr. en tertained today at her home with i bridge luncheon. Those present in eluded Mrs. H. Webster Bab cock, of Amherst Mrs. Vincent J. Lusardi, and Mrs. W. R. Hern don, of Brookneal Mrs. Charles T. Moses, Mrs. C. R. Thomas, Mrs. F. F. Carr, Mrs. F. C. Dresser and Mrs. Bessie H. Caldwell."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. en tertained today"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. en tertained today"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [290.66, 251.39, 433.79, 635.98], "bbox_id": "4ded00a09f", "file": "AppomattoxNewspapers_1962-1965a_0530.pdf", "page": 1, "text": "Mrs. Charles T. Moses, Jr. en tertained this morning Thurs day at 1030 with a morning coffee at her home, 108 S. Church St. honoring Miss Vir ginia Carolyn Caldwell whose wedding to Mr. Joel Dickerson Carnefix is planned for Wednes day evening, the twenty-fifth of November. Assisting the hostes were Mrs Nettie Dresser Martin, Mrs. Wal ter Carson, Mrs. S. R. Lawson, of Appomattox, and Mrs. W. R. Herndon, of Brookneal. The guest list included Mrs. D. E. Caldwell, Jr., Mrs. J. E. Carnefix, Mrs. Dora Randolph, Mrs. D. E. Caldwell, Sr., Mrs. D. R. Caldwell, Mrs. W. E. Han cock, Mrs. Harry Davis, Mrs. Ned LeGrand, Mrs. Hunter Dick erson and Mrs. J. C. Caldwell. Also Miss Marguerite Gilliam, Mrs. M. J. House, Mrs. Rachel Lawson, Mrs. Robert Clifton, Mrs. David Trent, Mrs. Harvey Thomas, Mrs. C. G. OBrien, Mrs. Henry Pack, Mrs. W. T. Williams, and Mrs. M. G. Stimp- son. Also included were Mrs. By ron Ohlsen, Mrs. Raymond Kel sey, Mrs. Neal Fletcher, Mrs. J. B. Terry, Mrs. J. M. Cobb, Jr., Mrs. C. E. Harvey, Mrs. Sterling Gallier, Mrs. Murrell Ferguson, Mrs. Earle Langran, Mrs. Sonny Conner, Mrs. Her man Schweizer, Mrs. J. A. Burke"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. en tertained this"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr. en tertained this"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2094.25, 892.68, 2266.55, 933.67], "bbox_id": "ffd3d2d001", "file": "AppomattoxNewspapers_1960-1962b_0230.pdf", "page": 1, "text": "Mr. Charles T. Moses, Jr., Fourth District President, and Mrs. John S Moore, Fourth Distinct Secretary and treasurer, of the American"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., Fourth District President, and Mrs. John S Moore, Fourth Distinct Secretary and treasurer, of the American"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mr. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Jr., Fourth District President, and Mrs. John S Moore, Fourth Distinct Secretary and treasurer, of the American"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [383.75, 586.12, 550.13, 954.22], "bbox_id": "9275876c7b", "file": "AppomattoxNewspapers_1939-1943a_0402.pdf", "page": 1, "text": "Mr. and Mrs.Berkley Rogers and son, Jimmie, Mr. Dinkins and Mr and Mrs. W . P . Cox visited M r. and Mrs. Fred Thompson in North Caro lina Sunday. Recent guests of Mr.and Mrs. C. H. Coleman were Senator Charles T. Moses, and W . S. Taylor, of Appo mattox. Those who called Christmas Day and Friday were Mrs. Bennie Wheeler and son, Irby Mrs. Flor ence Carslpn, Roya. Coleman, and daughter, Polly, Mr. and Mrs. Clar ence Moore, and family, Mrs. C.A. Mpore, Mr. and Mrs. Hal Moore, and boys, all of Appomattox, and Joe Wheeler, of Roanoke. Mr. Cole man is improving and is able to walk about in his home. He has received many nice presents and cards of greeting, and has appreciated and enjoyed them all. Those who called on Mr. and Mrs. T . E . Owen during the past week were Mrs.Melvin Stratton and John Cars n, Mr. and Mrs. John Owen, all of Concord, Mr.and Mrs.James P . Owen and son, of Lynchburg, and Mr. airi Mrs. Guy Harris and daughter, Jean Marie, also of Lynch burg. Sunday, guests of Mr.and Mrs. R. E S m ith were Mr.a.-.. Mrs. Ned Botge and daughter, Shirley, Mr. Mrs. Irving Ayers, Mr. and Ifm. Terry Rogers, Mrs. Irene Ro gers and Miss Vivian Clarke, who is spending this Week in this home."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "H. Coleman were Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and W . S. Taylor,"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "H. Coleman were Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, and W . S. Taylor,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2304.25, 622.51, 2585.98, 771.75], "bbox_id": "cb80a1cf0f", "file": "TimesVirginian_1978_0153.pdf", "page": 1, "text": "Mr. and Mrs, William Robertson Herndon, Jr., of Brookneal, announce the engagement of their daughter, Carolyn Virginia, to Timothy Wayne Gentry, son of Mr. and Mrs. William Wingate Gentry of Booneville, North Carolina. Miss Herndon is the granddaughter of the late Senator and Mrs. Charles T. Moses, Sr. of Appomattox. She is a graduate of William Campbell High School and Averett College and is presently employed by the Campbell County School System. Mr. Gentry is a graduate of George Washington High School and attended Danville Community College. He is employed by Yeargin Construction Company in Winston-Salem. . The wedding will take place June 3 at Charmos, paternal ancestral home, the home of Mr. and Mrs. Harold Webster Babcock, aunt and uncle of the bride."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr. of Appomattox. She"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>, Sr. of Appomattox. She"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1947.58, 645.92, 2224.49, 817.71], "bbox_id": "a6d5653e03", "file": "TimesVirginian_1976_0087.pdf", "page": 1, "text": "Mr. and Mrs. Walter William Puckette of Gladys announce the engagement of their daughter. Merle Scott to William Robertson Herndon, III, son of Mr. and Mrs. William Robertson Herndon, Jr. of Brookneal. Miss Puckette is a graduate of William Campbell High School and received a B.S. degree in education, with a specialization in reading from Averett College in Dnville, Virginia. She is presently working toward a masters degree in education from Lynchburg College. The bride-elect te presently employed with Lynchburg Public Schools. Mr. Herndon is a graduate of William Campbell High School and received a B.A. degree from Lynchburg College. He is presently employed with Campbell County Schools System. Mr. Herndon is the grandson of the late Senator and Mrs. Charles T. Moses. The wedding date is set for June 19."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. The wedding date is"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "late Senator and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark>. The wedding date is"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.92, 1128.39, 1792.53, 1449.69], "bbox_id": "b7ef399b44", "file": "AppomattoxNewspapers_1939-1943a_0340.pdf", "page": 1, "text": "Mr. and Mrs. James P. Gills and children, Julian Scott, Lucille and Jimmy, of Bluefield, West Virginia spen the week-end in the home of Mrs. E. E. Gills. Mr. and Mrs. Luther B. Pitman, of Richmond, recently visited in the home of W. P. Gills. Mrs. William Halller Copenhaver left last week to spend the school session in Marion, where she is on the faculty of the high school.. Raymond Crawley will attend William and Mary College this ses sion. Mrs. George Perdum has return ed from a vsit to relatives in B.uefield, W. Va.  J. C. Caldwell spent last Thurs day in Washington. Charles T. Moses Jr., and James Elictt Cheatham left ast week to resume their studies at V. M. I.  Mrs. Annie Adams left Sunday for her home at Outwood, Ky., after spending several weeks in the home of J. H. OBrien with her mother, Mrs. Lucy Conneer who continues ill. Mr. and Mrs. G. M. Deane will"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Thurs day in Washington. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., and James Elictt"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Thurs day in Washington. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr., and James Elictt"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2322.6, 248.99, 2463.1, 721.44], "bbox_id": "985da2341c", "file": "AppomattoxNewspapers_1962-1965a_0197.pdf", "page": 1, "text": "Mr. and Mrs. Harry B. Stan ley and children. Bill and dan, will leave Saturday for a vaca tion in Darahester, Mass. 9 9 9 Mr. and Mrs. James E. Cheat ham and children, of St. Peters burg, Fla., spent several days this week with his parents, Mr. and Mrs. Zack Cheatham and with the Harry B. Stanleys. 9 9 9 Mr. and Mrs. Lonnie Honey cutt and family, of Mooresville, N. C., returned home Monday after spending the week end with Mr. and Mrs. Rob Honeycutt.   9 Mr. and Mrs. Raymond Hall and three cliildren, Patricia, Ray, and Janice, and Miss Linda Car ter left Tuesday for a visit in Baltimore . Mrs. Halls broth ers, Oscar and Lonnie Carey. 9 9 9 The Rev. Forrest S. Wagoner returned home Monday from the Lynchburg Genral Hospital where he underwent treatment for a week. 9 9 9 The family of Senator Charles T. Moses enjoyed a picnic supper Wednesday evening at the home of his son and daughter-in-law, Mr. and Mrs. C. T. Moses, Jr. The occasion, was in celebra tion of Senator Moses birthday. 9 9 9 Miss Laura Motley, of Rich mond, visited friends here Mon day. Miss Motley Is a former Home Economics teacher In the Appomattox High School. 9 9 9 Mr. and Mrs. R. L. Montgom ery and family returned to their home here Saturday after being away for two weeks. Mr. Montgomery was attending a conference at VPI while Mrs. Montgomery and their three chil dren visited her home at Verona."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "The family of Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> enjoyed a picnic supper"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "The family of Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> enjoyed a picnic supper"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1752.95, 564.33, 1897.75, 870.23], "bbox_id": "27405d605a", "file": "AppomattoxNewspapers_1962-1965a_0539.pdf", "page": 1, "text": "Mr. and Mrs. Edward Ranson and Mrs. Rosa Marks spent the week end in Richmond with re latives. Mrs. Lloyd Richardson and Mrs. Gladys Harvey were in Lynchburg Saturday shoppl n g. A very large crowd attended the funeral of Senator Charles T. Moses Thursday afternoon. He will be greatly missed in the county. The mission study class was very well attended on Wednes day night Mrs. Helen Inge and Mrs. Florence Ranson taught the Book, On the Edge of Decision, They did a fine job. Teresa McIntosh spent Sunday with Jo Ann Elder at Evergreen. Patricia Elder, of Evergreen, spent Sunday with Melinda Mc Intosh. Miss Mary Willie Ranson, of Lynchburg spent the week end with her parents, Mr. and Mrs. Jim Frank Ranson. Glenn Martin and Ray Routt will leave today with a load ot tobacco for the market in West Jefferson, N.C. Miss Christine Dickerson and"}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "the funeral of Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Thursday afternoon. He will"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "the funeral of Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Thursday afternoon. He will"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [878.13, 875.81, 1020.77, 1098.21], "bbox_id": "99dbad4099", "file": "AppomattoxNewspapers_1962-1965a_0508.pdf", "page": 1, "text": "Mr. and Mrs. E. T. Guill have had as their guests this week, Mr. and Mrs. Vernon A. Evans, of Baltimore.    Mrs. Clara G. Mitchell spent several days this week in Lynch burg in the home of her son-in- law and daughter, Mr. and Mrs. W. W. Ford.    Senator Charles T. Moses is re ported to be improving at his home here from .an extended ill ness.    Cecil Wayne Phelps under went an operation at the Lynch burg General Hospital Monday. His condition is reported to be satisfactory.    Mr. and Mrs. Grover E. Smith motored over the Skyline Drive Sunday."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "W. W. Ford.    Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is re ported to"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "W. W. Ford.    Senator <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> is re ported to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1559.04, 684.2, 1734.22, 743.59], "bbox_id": "b224caaacb", "file": "AppomattoxNewspapers_1960-1962b_0244.pdf", "page": 1, "text": "Mr. and Mrs. Charles T. Moses Jr. were guests of The American Leg ion Auxiliary, Victoria U nit 102 on ! Thursday evening when there was a joint Christmas Party fo r both the American Legion and the Auxiliary."}, "highlight": {"text": {"matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr. were guests of"}}, "highlights": [{"field": "text", "matched_tokens": ["Charles", "T", "Moses"], "snippet": "Mr. and Mrs. <mark>Charles</mark> <mark>T</mark>. <mark>Moses</mark> Jr. were guests of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
