{"document": {"bbox": [2415.42, 1008.06, 2555.55, 1039.45], "bbox_id": "31845a1709", "file": "AppomattoxNewspapers_1971-1973a_0595.pdf", "page": 1, "text": "Zack Hudson Cheatham and friend, Wade Frazier, of Clearwater, Florida, spent the"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Zack Hudson <mark>Cheatham</mark> and friend, Wade Frazier, of Clearwater, Florida, spent the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Zack Hudson <mark>Cheatham</mark> and friend, Wade Frazier, of Clearwater, Florida, spent the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [151.2, 258.15, 309.06, 745.78], "bbox_id": "33ec67c403", "file": "TimesVirginian_1978_0316.pdf", "page": 1, "text": "Zack Elliott Cheatham, 82, of Evergreen hid Tuesday, July 4,19TB in Medferi Care Center inIA 6 hhucg HI Bora in Appomattox County, he was a son of the late James Hudson, and MoUy Evans Chetttham. R t v u a farmer and dealer in cattle and horses and member of the Virginia Horse Show Association. He is survived by his wife, Mayme Chocklett Cheatham a son, James Elliott Cheatham of Clearwater, Fla. a daughter, Jeanne C. Stanley of Appomat tox two sisters, Annie C. Bingham of Lynchburg and Alice C. Babcock of Columbia. S.C. four grandchildren, Zack and Nan Cheatham of Clear water, Fla., and Bill and Jan Stanley of Appomattox, and a great-grandson, James Hudson Cheatham of Clearwater, Fla. Besides the immediate fam ily, there were present a niece, Mrs. Anne Branmgan. and husband from California a nephew. Cecil Robbins, and wife from Wilmington, N. O. and a nephew, Huck Babcock, from Columbia, S. C. and many cousins. Funeral services were con ducted at 130 p.m. Friday from Robinson Funeral Home m Appomattox. Burial was m Evergreen Cemetery. Serving as pall bearers were Jack Baker, David Paulette, Kermit Paulette, Edward Har vey, Leslie Goodrich, Jesse Franklin, Herbert Diadmond, and Henry Simmons."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Zack Elliott <mark>Cheatham</mark>, 82, of Evergreen hid"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Zack Elliott <mark>Cheatham</mark>, 82, of Evergreen hid"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.49, 307.19, 1688.52, 330.89], "bbox_id": "f2d7e88e50", "file": "AppomattoxNewspapers_1926-1933a_0395.pdf", "page": 1, "text": "Zack Cheatham is really j proud of his new baby girl."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Zack <mark>Cheatham</mark> is really j proud of his new baby girl."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Zack <mark>Cheatham</mark> is really j proud of his new baby girl."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1843.7, 1568.47, 2008.43, 1631.97], "bbox_id": "6fa01434af", "file": "AppomattoxNewspapers_1933-1936a_0387.pdf", "page": 1, "text": "Zack Cheatham had a .i.all.on.th ice Monday and gave his back a bad lick. Those on thT tfrk list this week are Mrs. Judie Evans and Mrs. Eddie Warriner."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Zack <mark>Cheatham</mark> had a .i.all.on.th ice Monday and gave his back a bad lick. Those on thT tfrk list this week are Mrs. Judie Evans and Mrs. Eddie Warriner."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Zack <mark>Cheatham</mark> had a .i.all.on.th ice Monday and gave his back a bad lick. Those on thT tfrk list this week are Mrs. Judie Evans and Mrs. Eddie Warriner."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1084.97, 760.41, 1252.46, 790.31], "bbox_id": "cc7b6ba25f", "file": "AppomattoxNewspapers_1954-1955a_0188.pdf", "page": 1, "text": "Z. E. Cheatham spent several days last week at Abingdon selling to bacco."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark> spent several days last week at Abingdon selling to bacco."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark> spent several days last week at Abingdon selling to bacco."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1375.13, 656.4, 1457.16, 696.4], "bbox_id": "c945f3ed68", "file": "AppomattoxNewspapers_1955-1957a_0593.pdf", "page": 1, "text": "Z. E. Cheatham mo- ge Thursday to see has been in a Rich er the past month."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark> mo- ge Thursday to see has been in a Rich er the past month."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark> mo- ge Thursday to see has been in a Rich er the past month."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1956.97, 335.85, 2089.69, 346.35], "bbox_id": "eed8016a5a", "file": "AppomattoxNewspapers_1949-1952a_0388.pdf", "page": 1, "text": "Z. E. Cheatham  recently. ."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark>  recently. ."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Z. E. <mark>Cheatham</mark>  recently. ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.36, 1092.51, 2247.75, 1376.1], "bbox_id": "e77de22d0d", "file": "AppomattoxNewspapers_1915-1918a_0057.pdf", "page": 1, "text": "ySire. xoutn ana oia age testify such an effort being jits soothing and healing qualities. I jn i29, but was not entered in Pneumonia and lung trouble arel often caused bv delay of treatment I ll. .  Dr. Kings New Discovery stops I One-half mile lfi and under t lose hacking oongbs and relieves It-QbeStham. Time, 143 li grippe tendencies. Money back!  Running high jumpR ii it fails. r 50o. ad 1.00 hqlgjit, 5 fw t. G. ,   I Rice, seoond Prize, 2.00, H. _ When a girl has a good I jrowder. Fifteen and nnder, delivered!figure nobody uofciqim ier b ad jE Cheatham, 4 ft. 3 inches, a very instructive and interest-j form. j Pole vaultR Thornhill, ing address on the subject of I I height. 7 ft.. 8 inches. Q.Rice. Cooperation. Mr. Beall told T t o  . r r t a . M o o e  -   . . . f t  j , Fifteen of an  ignprant mountaineer U  S I Z for , K nheuthr0ughha5 apdSunder, J. Abbitt, 7 feet, who entered bis boy at one of l a col1 ? w hat a vigorous impulse it I Cheatham, second, the rural schools, he told thelgeotl How you opdipfed wide yourl Standing broad jump 15 and teacher what he wanted bislungs to take in those inYidofa8udeir-. Cheatham, 8 feet, boy to study and he wanted APPomsttox.Hard- him pushed in the study ot j timuiutiag qualities andover-l ware Co. trigonometry for said he this I comes hacking coug is The ianerl Standing high jumpR. boy knows little or nothing I lining of the throat is strengthened I Thornhill, 4 feet .Fifteen and about handling a gun. jin its attack against junder, E. Cheatham, 8 ft., 1 The tobacco market opens a tl ?ery   I   - Dillwyn today. Already some"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "ier b ad jE <mark>Cheatham</mark>, 4 ft. 3 inches,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "ier b ad jE <mark>Cheatham</mark>, 4 ft. 3 inches,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1686.69, 547.95, 1851.04, 881.55], "bbox_id": "2459f08fd6", "file": "AppomattoxNewspapers_1918-1922a_0064.pdf", "page": 1, "text": "your dogs. Mr. and Mrs C. T. Drinkard have returned from a delight ful honeymoon and are now at  home, 8tapleton. Mr. Russell Prilliman is back  from France and has accepted his old position at the Appo mattox Hardware. Miss Mildred Bass, aftar a I two weeks visit with Miss  Alice Cheatham at the New Appomattox, has returned to I Lynchburg. The proposition to incotpo-l rate the town is sleeping. Com-1 mittees are making investiga tions and soon there will be an awakening. Cadets Percy Rogers and j Russell Abbitt came home last I week from V P. I. Russell is now taking officers training  at Gamp Lee. Mrs. H O. Baboook is ml Richmond visiting her daugh-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "visit with Miss  Alice <mark>Cheatham</mark> at the New Appomattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "visit with Miss  Alice <mark>Cheatham</mark> at the New Appomattox,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [693.06, 531.39, 856.06, 1715.28], "bbox_id": "26e710c163", "file": "AppomattoxNewspapers_1915-1918a_0458.pdf", "page": 1, "text": "You will see from Mr. A. H. Howertons own words that be con fesses violating the law in not de stroying the nnnsed ballots before openng the ballot btfx, and in vio lating tbe law he also violated tbe above solemn oath. Mr. A H Howerton says -When he polls closed, I and the other jadges present were of tbe opnon that the nnnsed ballots should be burnt. Conducting tbe election accord ing to their opinion and not acoord- ng o hw. Opinions are all right, when right all wrong, when errng. Note that Mr. A. H. Howerton ays that each and every onof -.hem being destroyed. Read this certificate signed by the party who had tickets, others wno witnessed the horning and an other who was cle k of election and Mr G. W. Cheatham who witnessed the count This certifies that the ballots at Cbeatwood precinct were not counted after the election No vember, 1915. Therefore we can not swear that all nnnsed ballots were horned some distance from the voting place. S. P. C olima x, Clerk. G. W. C heatham . J. O. R obkktsox , Clerk. We can not swear all unused ballots were burned as we did not see any burnt. W. D. Doss, R. A. C heatham , Jadges. Note that Mr. A. H. Howerton can testfy to a fact, that the party who had the tickets and others will ot swear to. Bat I shonld remember taat Mr V. H. Howerton can commit no vrong and most be possessed of uperbnman power to know that ac and every nenaed ballot was burnt. Note above Mr. A. H. Howerton  ats tint the unuetd ballots had ibsolntely no effect whatever upon tbe resolr of tbe election at tha pr. cinct but he does not say as to dn il resalt of election in the conn y perhaps this is tne nigger in the wood-pile. Mr. A H Howerton says the un tied ballots were burnt by Mr. 8. P. Coleman on the ontside of the house  Any one would infer from this that tbe nnused ballots were nrnt near the preciuct as a matter f fact the ballots were carried throngh one farm and burnt on the next and why this boose becoming so suddenly dilapidated? Echo an swers Why? Oh, Troth, Truth, bow much thy very existence depends on bolts sod bars, on windows and doors, on hoars and minutes,on the best qual ity of window shades or on an old iilapidated boose. Mr. A. H. Howerton goes to the trouble to prove what he was not charged with, I suppose for the pur pose of drawing the attention of the eader from the facta in tbe esse. It is said that a worm partakes of the color of the food on which it feedt the same law of nature mast pply to Mr. A. H Howerton, who has fed ao long at the adder uf boiiism that he is doomed to think and set in accordance with tbe only light which has been given himan artificial lightwhich has so col ored his view that he no longer can distinguish right from wrong or good from evil. His or ginality and is taste has been destroyed. He rejoices in boteism, in which he has been told that might makes right. Now as for his saying I was en gaged in tbe drcnlation of a false hood and under other conditions vss simply lying, I have simply his to sa that where Mr. A H Howerton is known especially i. he tobacco belt nothing that be can say will hart me, and where I m known nothing that he may say rill harm ms. Bostum has altered tbe common highwaymans demand of your money or yonr life into that of your money and yonr life. A great party does not mock Heaven and its Powers by pretending oelief in a revelation which asserts tbe love of money to be the root of all ev.1, and d daring at the same time oat it is actuated, and intends to be, actuated in all chief party nL nd measures by no other lore."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mr G. W. <mark>Cheatham</mark> who witnessed the count"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mr G. W. <mark>Cheatham</mark> who witnessed the count"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [635.3, 700.62, 1969.88, 777.96], "bbox_id": "f012bb2d1a", "file": "AppomattoxNewspapers_1960-1962b_0039.pdf", "page": 1, "text": "you will desire to make Church At tendance this week-end a Family Oc- er Slagle. Larry Smith, Tommy Wilhoit, Robert Winston, Shirley Cheatham, Sandra Gilbert Joyce Ann Goin.Judy Goodrich, Theresa Green, Linda Grinds, Suzanne Gudll, Gloria Mayberry, Brenda Pugh, Di- anne Smith"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Wilhoit, Robert Winston, Shirley <mark>Cheatham</mark>, Sandra Gilbert Joyce Ann"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Wilhoit, Robert Winston, Shirley <mark>Cheatham</mark>, Sandra Gilbert Joyce Ann"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [631.7, 343.77, 789.56, 396.57], "bbox_id": "3b0f85a2ca", "file": "AppomattoxNewspapers_1926-1933a_0536.pdf", "page": 1, "text": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. Cheatham, Appo mattox, Va. 4 7 2t"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. <mark>Cheatham</mark>, Appo mattox, Va. 4 7 2t"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. <mark>Cheatham</mark>, Appo mattox, Va. 4 7 2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [551.72, 333.86, 708.95, 386.71], "bbox_id": "d4132ae0b0", "file": "AppomattoxNewspapers_1926-1933a_0512.pdf", "page": 1, "text": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. Cheatham, Appo mattox, Va. 4 7 2t"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. <mark>Cheatham</mark>, Appo mattox, Va. 4 7 2t"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "You are invited to come in and see my line of Millinery I have just opened. Mrs. J. H. <mark>Cheatham</mark>, Appo mattox, Va. 4 7 2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.02, 692.14, 846.89, 1600.13], "bbox_id": "2cf039f5ce", "file": "AppomattoxNewspapers_1933-1936a_0259.pdf", "page": 1, "text": "yn and Martian Lee, Mrs. e, Bert and Hoi-man Lee, week a t V irginia Beach. Mrs. E. W . Padgett  nd son, id I-,. J. Body, of Lynchburg, are siting Mrs R G Moore. Maji Evens and Ruby  It al-l visiting Miss M argaret Allen t Pleasant View, Va. Miss Evelyn, Blackburn, of Roanoke sPep4jng th,V week with Miss Virginia Moses. , Mr. arid Mrs. Em m ett Tuclt, who nave beh here fo r sometime, have returned to- Virgilina. F. T. Cawthoi-n and H. C Pulliam notorctdi to Richmond Tuesday to ttend a F ord mcieting. r M l- !nd Mrs. T E Caldwell, of ynchburg, spent last week with Mrs. Franklin Marshall. There will Ibe preaching at the risbyterian churcji ia,- Evergreen aunday afternoon at 330. ... Miss Della Inge will retu rn om e atuiday -after attending summe- cl- ol at Charlottesville. Mrs. Harrison, of Lynchburg, -pent last week with her sistrir, Mrs. T. J. Lowe. Friends of Mr. and Mrs. Hornsey Smith xkitertaineid a t ,a show.fr re eently in their honor. Moss Lewis, of Roanoke, - sp nt he week slnd with his parents, Mr. md Mrs. Cheriie L w is. Miss Flora Lawson and Mrs. Al fred I.awson hav, returned from a visit with relatives in New York. We are glad to hear th a t Andrrjw ferguson, who was op rated on at Memorial hospital last wgek, is now improving. Mr, and Mrs. S. J. Evans and children, Billy and M arian June have . returned from a visit with her sister Mrs. L. A. M essreau. of Baltimore. Jessie Guill, of W arrington, and Charli j Guill, of W ashington, spent Sunday with their parents, Mr. and Mrs. Fletcher Guill. M utt Cawthorn, of W ashington, ipent soveral days the first of the week with his parents, Mr. and Mrs. F. T. Cawthorn. Mrs. Beatrice Meadows and Miss Mary Smith, of Lvnchburg spent the week end in the Ihonvl of Hornsey Smith. Rev. W. M. Thompson, Mrs Hele.n Welch, Mrs. Loue 11,a Morris and Virginia Lee Thompson m otored to V cxandrin Monday. Mr. and Mrs. Howard Blank., and son,, Howaj-d, Jr., of Lynchburg. I spent the week end with Mr. and Mrs, E. L. Laynet. Guests in the home of Mrs. T. T Lowe for the week  jrid, w ere Mrs. T. A. H ackett and daughters, Ilelan and Dorothy, of Covington. Misses Nan Throckmorton, of New York, andi Mary Francs Pretlow, of Norfolk, are visiting relatives and friends here. Mr. end Mrs. Ed Layne, Mr. and Mrs, Howard Blanks, and Mr. arid Mrs, E. T. Guill and fam ily motored to Spears Mountain recently. Mr. and Mrs. George Babcock from j Florida spent l-.st week with Mrs. I H. C Babcock, en route to Maine and I other northern states. Mrs. Ruth Spilman and son of Pichard, and Miss M ary Kemp, of Florida are spending son time with Mrs. W. M. Morris. . . IWrs. M. C. S nath has retu rn ed from Richmond accompanied by her daughter, Virginia and Mrs. George Mayers who will spend the week in that home.  Harvey Morris and son, Norvall Woodson, Mr. and Mrs. Irving Maekof, of Richmond, Misses Ada were visitors in H arvey during and May Harvey, the home of T.  th 2 week end. Mrs. J. H. Cheatham. Mrs S .V . Munsey, D r.H avilah iVbcock and son, Huck and Jam es Elliot Cheat- ham are spending"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "end. Mrs. J. H. <mark>Cheatham</mark>. Mrs S .V . Munsey,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "end. Mrs. J. H. <mark>Cheatham</mark>. Mrs S .V . Munsey,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2169.41, 439.16, 2333.28, 612.81], "bbox_id": "7a807b085d", "file": "AppomattoxNewspapers_1933-1936a_0181.pdf", "page": 1, "text": "yesterday by Miss Lucy LeGrand u follows Elsie Carson, Spout Spring .. 171 Hazel Cheatham, Woodland . . . . 100 Hazel Lee Coleman, Liberty Chap- ITe1 . . .................. i ..................... 45 Hope Cralle, Evergreen . . 140 Cora Lee Gilliam, Pamplin 267 Alice Mayberry, Pettys Forte ..65 Ruby Martin, Oakville .......... 100 Irene Page, Mount Comfort .. 61. Reva Robertson, Appomattox . .887 These returns am for the count up to March 26. The next total will be announced in next weeks paper. The public is urged to Vote for favorite candidates. The May queen will be named April 12 and preside over impressive ceremonies here on May 8."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Spout Spring .. 171 Hazel <mark>Cheatham</mark>, Woodland . . . . 100 Hazel Lee"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Spout Spring .. 171 Hazel <mark>Cheatham</mark>, Woodland . . . . 100 Hazel Lee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [478.31, 443.95, 810.87, 725.0], "bbox_id": "9a0c018247", "file": "AppomattoxNewspapers_1926-1933a_0565.pdf", "page": 1, "text": "YELLOW VALLEY, March - - - , 16 .Robert Woodall, of Vera The Y. W. A. of Liberty United Mr. and Mrs. W. R Church will meet at the home Baldwin over the week-end. of Miss Jessalyn Hancock Fri-1 Mr. and Mrs. E. A. Coving day afternoon. ton, their daughter, Mary    !Francis, also Mrs. Hattie Mrs. Lennie R. Gills leaves Cheatham visited Mrs. Bas Sunday to spend several weeks cotne price, near Prospect Sun with her son, E. T. Gills, in day.  T . _ Kenneth Gilliam, of Larton,   v Va., visited Mr. and Mrs. Tom A 1D. D. E. Caldwell, Jr., and Cawthorne Friday evening. little son have returned to then j Bernard Gilliam has accept- home here after a visit with re- ed a position in Larton, Va. latives in Richmond. I Mrs. Willie Ida Cawthorne     has returned to her home at Joe D. Ferguson, of Provi- Evergreen.  , dence Forge, spent the week-j M rs. J a m e s Blankenship ano end with his parents, Senator daughter, Jean Mane, ol and Mrs. S. L. Ferguson. Lynchburg, are visiting her sis-    Iter, Mrs. Dewey Cawthorne, The sacred concert, conduct- for a week. ed by Holland Wilkinson, oft T. J. Cawthorne is on th e Richmond, will be held at the sick list. . jehool auditorium Thursday Miss Jessie Richardson visit- avening at 800 P. M. ed Mrs. Bessie Baldwin Sun-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Lennie R. Gills leaves <mark>Cheatham</mark> visited Mrs. Bas Sunday"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Lennie R. Gills leaves <mark>Cheatham</mark> visited Mrs. Bas Sunday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1426.58, 1008.94, 1584.39, 1265.66], "bbox_id": "cff8e10028", "file": "AppomattoxNewspapers_1908-1909a_0562.pdf", "page": 1, "text": "YELLOW VALLEY, MaîTà. Airs. Jeter Smith, of Washing- itoTi, D. C., was visiting in the home of her brother, Tom J. Cawthortte, last week. Mrs. Hattie Cheatham is visitingher niece, Mrs. E- A. Covington, for awhile. Miss Gladys Swan, her brother, William, and Henry Covington spent Sunday with Mrs. E. A. Covington. Mrs. Willie Ida Cawthorne is visiting her son, Dewey Caw thorne, for ashort time. Mr. arid Mrs. Dewey Caw thorne are the proud parents of a fine baby boy, James Ed- Virin. Mrs. T. R. Richardson a n d daughter were in Lynchburg Friday. , A surprise party was given Miss Bradley Cawthorne Fri day evening. Quite a few be-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "last week. Mrs. Hattie <mark>Cheatham</mark> is visitingher niece, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "last week. Mrs. Hattie <mark>Cheatham</mark> is visitingher niece, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [579.65, 514.31, 723.92, 673.61], "bbox_id": "f7cf242309", "file": "TimesVirginian_1976_0264.pdf", "page": 1, "text": "Yeatts, Josephine Walton, Phyllis Perdieu Robertson, and Shirley Austin Harvey fourth row, left to right, Jimmy Harris, James Slagle, J. C. Lewis, Bobby Phelps, Ray Page and Tandy Harris and on the fifth row, left to right, Bobby Bryant, Malcolm Blackwell, Ralph Smith, Sam Davidsdn, and Marshall Harris. Not available .for picture were Howlette B. Martin, Jr., and Mrs. Frances Cheatham, teach er."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Jr., and Mrs. Frances <mark>Cheatham</mark>, teach er."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Jr., and Mrs. Frances <mark>Cheatham</mark>, teach er."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.34, 502.73, 1849.84, 585.73], "bbox_id": "8a80c856dc", "file": "AppomattoxNewspapers_1918-1922a_0202.pdf", "page": 1, "text": "year 1919 tht Mrs. Njrman Cheatham is les freed fr confined to her room at the which was New Appomattox by illness. over any pr Miss Eva Woolridge has re turned home from a motor trip to the Peaks of Otter."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "1919 tht Mrs. Njrman <mark>Cheatham</mark> is les freed fr"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "1919 tht Mrs. Njrman <mark>Cheatham</mark> is les freed fr"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1412.11, 538.67, 1517.36, 755.45], "bbox_id": "530a8a6045", "file": "AppomattoxNewspapers_1954-1955a_0066.pdf", "page": 1, "text": "y C.  L T wrote at some length thoughts Of old days m  it looked when I came I knew I was leaving  of fine people who tre in the early 30s. I want to thank all those L telephone and person comments. Truly, I am th a choice audience. Sev- nin other states wrote in Weived a number of let- Virginia. A Virginia sub-  that we should have i K . Ut. Byland M. H. Cheatham and others. ader wondered why we did ,uch a personable man as Bradley Babcock. And yet led by to recall events of ppomattox far back before"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Ut. Byland M. H. <mark>Cheatham</mark> and others. ader wondered"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Ut. Byland M. H. <mark>Cheatham</mark> and others. ader wondered"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1455.85, 989.07, 1590.72, 1112.37], "bbox_id": "262628b46e", "file": "TimesVirginian_1980a_0108.pdf", "page": 1, "text": "y  Maid of hönor was Miss Rebecca Walker, of Clear water, Florida. Bridesmaids were Jan Stanley of Appomattox, M rv Laura Cheatham, of Clearwater, Jan Rocke and Julia Rocke, of Lincoln, Nebraska.  The couple will make their home in St. Petersburg, Fla., after a honeymoon in Atlanta, Ga."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Appomattox, M rv Laura <mark>Cheatham</mark>, of Clearwater, Jan Rocke"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Appomattox, M rv Laura <mark>Cheatham</mark>, of Clearwater, Jan Rocke"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1622.11, 959.14, 2167.64, 1011.43], "bbox_id": "bb2f2b6de2", "file": "TimesVirginian_1983a_0191.pdf", "page": 1, "text": "xrruinATTUA l w n i i mud su iu u l nunun uitAuvATEs, LLAH ur i w frem left  Front row - Susan Morris, Lamm WMten,. Laurie Cowan, Derwin Harvey 8sB id raw - Lynn Fester, Rente Wells, Patricia Chandler, Cheryl WUN m m , Darlene Smith, Rebecca Date Third raw  Anita Harvey, Dawn Pltsenberger, Kim Maxwell, Patty Reach, Teresa Rasa. afraMa Carries, Cheryl Cheatham Fourth row- Jennifer Inge, Mitsi Baldwin, Virginia Marshall, Susan Eye, Layne, Nancy Maoris Back raw - James Beaty, Glen M cChny, Richard Conner, David Page. Photo by Rill"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Rasa. afraMa Carries, Cheryl <mark>Cheatham</mark> Fourth row- Jennifer Inge,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Rasa. afraMa Carries, Cheryl <mark>Cheatham</mark> Fourth row- Jennifer Inge,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [922.31, 340.35, 1094.37, 516.38], "bbox_id": "69d9e0bab7", "file": "AppomattoxNewspapers_1943-1947a_0222.pdf", "page": 1, "text": "Xae S. C. A. held installation j services Friday, June 1, at eight I oclock in the high school audito rium. The ceremony was conduct ed by Warren Mar. in. The present officers include Gordon Webb,Alice Clapp and Eleanor Smith, with the new officers, who are Garland Rey nolds, Jeanne Cheatham and Louise Covington, marched in with can dles. The candles wtre placed on the table, those of the officers for 44 and 45 b ing ligated. The new officers repeated together the oath of he S. C. A. and then each took an oath of his own office. As each new officer was sworn in, Gordon Webb lighted a candle, which was renresentative of his duties, and"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Garland Rey nolds, Jeanne <mark>Cheatham</mark> and Louise Covington, marched"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Garland Rey nolds, Jeanne <mark>Cheatham</mark> and Louise Covington, marched"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2069.52, 250.03, 2209.91, 456.33], "bbox_id": "09a1880039", "file": "AppomattoxNewspapers_1962-1965a_0402.pdf", "page": 1, "text": "Wttlsie Sue Paulette, Frances Reeve, Brenda Robertson. 9th Grade Albert Carter. David Hamilton, Walton Pankey, John Lewis, Victor Meadows, Reita Cordell, Julia Anne Guill. Edith Kaufman Beth Massie Peggy Morris, De- lores Wooten, Delores Reynolds. 8th Grade James Beamer, Jams Burcher, Ray Cheatham, Malcolm Inge, Anthony Lucado, Robert Moon, Gene Price, Mike Seay, Burt Schrock, Larry Smith, Valeria Brannan, Patricia Covington, Bonnie Lou Creasy, Cynthia De- Pew, Sandra Gilbert, Kathy Goin, Linda Grinels, Jacquetta Guill, Suzanne Guill, Sarah Lane Louise Wheeler."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Beamer, Jams Burcher, Ray <mark>Cheatham</mark>, Malcolm Inge, Anthony Lucado,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Beamer, Jams Burcher, Ray <mark>Cheatham</mark>, Malcolm Inge, Anthony Lucado,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.45, 1406.52, 1516.93, 1460.6], "bbox_id": "fde878ed36", "file": "AppomattoxNewspapers_1947-1949a_0100.pdf", "page": 1, "text": "WrPrr?,Sept- 16- Mr- and and daughter, i n Miss Clarkie Cheatham at- L, ugolden wedding arini-  f Mr. and Mrs. Ben Schau- Crewe on September 11."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "WrPrr?,Sept- 16- Mr- and and daughter, i n Miss Clarkie <mark>Cheatham</mark> at- L, ugolden wedding arini-  f Mr. and Mrs. Ben Schau- Crewe on September 11."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "WrPrr?,Sept- 16- Mr- and and daughter, i n Miss Clarkie <mark>Cheatham</mark> at- L, ugolden wedding arini-  f Mr. and Mrs. Ben Schau- Crewe on September 11."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2212.81, 945.77, 2353.71, 1177.22], "bbox_id": "0ef787b988", "file": "AppomattoxNewspapers_1974-1975a_0438.pdf", "page": 1, "text": "wr Xriv n wvy I want to thank my friends, relatives and neighbors for the many expressions of love and concern shown me while I was in the hospital and since my return home. The visit, prayers, card, and flower wfll long be remembered. Z. E. Cheatham. 9-25-lt ,v I would like to thank all of the many churches in the Appo- mattox and Spout Spring area for the many prayers, cards, gifts and food during my stay in the hospital and since I have returned heme. You will always be remembered for your kindness. K Sincerely,  Louise Punkett __ __________ __ 0-26-1 p"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "be remembered. Z. E. <mark>Cheatham</mark>. 9-25-lt ,v I would"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "be remembered. Z. E. <mark>Cheatham</mark>. 9-25-lt ,v I would"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1591.71, 714.51, 1746.59, 783.1], "bbox_id": "9aff4d16c7", "file": "AppomattoxNewspapers_1915-1918a_0412.pdf", "page": 1, "text": "Work on our new modern briok hotel is being rushed. Mine host, J. H. Cheatham, will be happy when he can umile on Miss Mollie as hostess of this up-to-date inn."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Mine host, J. H. <mark>Cheatham</mark>, will be happy when"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Mine host, J. H. <mark>Cheatham</mark>, will be happy when"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1828.08, 256.48, 1992.03, 456.62], "bbox_id": "005422164e", "file": "AppomattoxNewspapers_1926-1933a_0365.pdf", "page": 1, "text": "Woodson. His parents motor ed up for him on Friday. Mr. and Mrs. Lacy Puckett, of Lynchburg, spent the past week with the formers par ents, Mr. and Mrs. F. T. Puck ett. Mrs. E- G. Cheatham, who has been employed at Appo mattox, has returned home. Tdr. Hermon Marshall and sister, Mildred, are now em ployed in Lynchburg. .Mrs. W. W. Driscoll, who has been sick for the past two weeks is better."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "ett. Mrs. E- G. <mark>Cheatham</mark>, who has been employed"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "ett. Mrs. E- G. <mark>Cheatham</mark>, who has been employed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1816.28, 262.52, 1976.99, 449.91], "bbox_id": "17b9a5dfe8", "file": "AppomattoxNewspapers_1908-1909a_0524.pdf", "page": 1, "text": "WOODLAND,T h é killing in thjs section is about o ver. The people are busy get ting ready for the Christmas holidays. Misses Celene and Beatrice Woodson, Francis Marshal?, Vivian Clark, Mesdames E. G- Cheatham a n-d Ben Newman Mrs. Watt Harvey a n,d Mrs. Lula Howerton were in Lynch burg Saturday shopping. Miss Hamner Coleman, of Lynchb.urg and Mrs- Lewis Carrol and baby of Concord, were week-end visitors in the home of W. W- Coleman."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Clark, Mesdames E. G- <mark>Cheatham</mark> a n-d Ben Newman"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Clark, Mesdames E. G- <mark>Cheatham</mark> a n-d Ben Newman"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [582.01, 1241.27, 740.5, 1478.85], "bbox_id": "8ecb774376", "file": "AppomattoxNewspapers_1926-1933a_0509.pdf", "page": 1, "text": "WOODLAND,Mrs. W. W. Woodson and Celene Woodson entertained quite a number of ladies in their home last Thurs day with a quilting. A nice dinner was served. Among those present were Mesdames E. G. Cheatham, Ben Newman, John Marshall, W. W. Driscoll, W. L. Coleman, C. F Fleshmanj Miss Eula Howerton and Mrs. Lula Howerton. Mr. and Mrs. J. L. Harvey and family, of Dillwyn, spent Sunday in the home of his .ather, S. J. Harvey.  Mrs. E. G. Cheatham and son Claud, accompanied by Mr. and Mis. Ben Newman, vuited Mrs. Cheathams father, Mr. Will Marshall, in Lynchburg, Sunday afternoon. Little Mary Coleman Jessie"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "were Mesdames E. G. <mark>Cheatham</mark>, Ben Newman, John Marshall,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "were Mesdames E. G. <mark>Cheatham</mark>, Ben Newman, John Marshall,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [834.7, 287.67, 998.69, 710.75], "bbox_id": "b49ec5342e", "file": "AppomattoxNewspapers_1926-1933a_0515.pdf", "page": 1, "text": "WOODLAND,Mr. an d Mrs. Watts Harvey and Mr. and Mrs. Bob Carey spent the Easter holidays in the home of J. L. Harvey, at Dillwyn. Miss Hamner Coleman, of Lynchburg, Misses Annie Ruth Carrol and baby of Concord, spent the holidays in the home of W. L. Coleman. Mr. and Mrs. Howard Fitz gerald and sons, Junior and Kenneth, and Mr. Trent, of Roanoke, were week-end visi tors in the home of R. L. Poe. Miss Bernice Woodson,spent the week-end with Miss Hazel Morris, of near Madisonville. Misses Edna Torrence an d Frances Miles visited . Misses Francis a n d Helen Marshall during the holidays. Marshall Cheatham and Clyde Woodson, of Williams burg, spent the week-end with their parents here. Miss Dorothy Woodson spent the holidays in the home of her father. M iss Mildred Marshall is sick at her home here. Mr. and Mrs. W. W. Wood- son spent Saturday night and Sunday with her mother, Mrs. John Rush, near Andersonville. Mr. a n d Mrs. Ernest Paul ette spent the holidays with her mother, Mrs. Johnnie Poe. Miss Vivian Clark spent the holidays with Mrs. G. P"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "during the holidays. Marshall <mark>Cheatham</mark> and Clyde Woodson, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "during the holidays. Marshall <mark>Cheatham</mark> and Clyde Woodson, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [578.39, 1220.6, 737.91, 1458.69], "bbox_id": "16e13bd104", "file": "AppomattoxNewspapers_1908-1909a_0509.pdf", "page": 1, "text": "WOODLAND,Mm W. W. Woodson and Celene Woodson entertained quite a number of ladies in their home last Thurs day with a quilting. A nice dinner was served. Among those present were Mesdames E. G. Cheatham, Ben Newman, John Marshall, W. W. Driscoll, W. L. Coleman, C. F Fleshman, Miss Eula Howerton and Mrs. Lula Howerton. Mr. and Mm J. L. Harvey and family, of Dillwyn, spent Sunday in the home of his father, S. J. Harvey. , _ . Mrs. E. G. Cheatham and son Claud, accompanied by Mr. and Mis. Ben Newman, vtited Mrs. Cheathams father, Mr. Will MaishalL-jte-nrbtnirg Sunday afternoon. Little Mary Coleman Jessie"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "were Mesdames E. G. <mark>Cheatham</mark>, Ben Newman, John Marshall,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "were Mesdames E. G. <mark>Cheatham</mark>, Ben Newman, John Marshall,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1543.2, 1129.37, 1707.95, 1525.34], "bbox_id": "2ac840e773", "file": "AppomattoxNewspapers_1926-1933a_0511.pdf", "page": 1, "text": "WOODLAND,C. R. Wood- son and daughter Rachel, spent the week-end with Mr. and Mrs. Houston Reams, of .near Nheiix. Misses Hamner Coleman, of Lynchburg, Mildred Marshall, of Appomattox, and Dotty Woodson of Mt- Comfort school spent the week-end in their homes here Mrs. Lewis Carrol and baby have returned to their home at Concord, after a tw o weeks visit at-her mothers, Mrs. W. L. Coleman. Mr. and Mrs. Bob Carey moved back to Lynchburg Sat urday. Mr. and Mrs. Sammie Cheat ham, of Lynchburg, are guests of Mr and Mrs. Oscar Cheat ham. Mr. and Mrs. Lacy Puckett and sister, Mrs. Bradly, were Sunday guests of Mrs. Floyd Puckett. Mr. and Mrs. Ben Newman, of Appomattox, were dinner guests of Mrs. E. G. Cheatham Sunday? Mrs. Jim Serra, of Norfolk, is the guest of her mother, Mrs. J. L. Driscoll. Mrs. Watts Harvey and ba by, spent the day lecently with Mr. r nd Mrs. Franklin Marsh all, rear Appoma-nx."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "of Mrs. E. G. <mark>Cheatham</mark> Sunday? Mrs. Jim Serra,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "of Mrs. E. G. <mark>Cheatham</mark> Sunday? Mrs. Jim Serra,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1059.07, 315.03, 1225.39, 382.63], "bbox_id": "8b03f2eb38", "file": "AppomattoxNewspapers_1943-1947a_0003.pdf", "page": 1, "text": "Woodland, Sept. 1.- Mr. and Mrs. 3 G. Cheatham, of Williamsburg, were the Quests of Mr. and Mrs. J. P. Marshall over the week-end. Mr. and M s. R. M. Taylor were also guests in this home. Mr. and Mrs. Elliott Cheatham"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mrs. 3 G. <mark>Cheatham</mark>, of Williamsburg, were the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mrs. 3 G. <mark>Cheatham</mark>, of Williamsburg, were the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.8, 183.3, 1664.46, 857.93], "bbox_id": "57d2eec0a1", "file": "AppomattoxNewspapers_1926-1933a_0333.pdf", "page": 1, "text": "WOODLAND Mr. and Mrs. Ben Newman, accompanied by their mother, Mrs. Eldridge Cheatham and Mrs. Wesley Driscoll motored to Washington week before last and spent the week-end. Misses Geraldine and Helen Coleman are visiting relatives in Lynchburg this week. Messrs. Herman Marshall and Marshall Cheatham, of iynchburg, were week-end visitors of their parents here. Miss Dorothy Woodson, of Farmville S. T. C., and Miss Olivia Rush, of Lynchburg, were week-end guests at the home of Mr. Wert Woodson recently. Mr. Sammie Cheatham, of Detroit, is visiting his parents, Mr. and Mrs. Oscar Cheatham. Mr. and Mrs. Josh Harve and son, of Lynchburg, spent Sunday at the home of Mr. and Mrs. E- G. Cheatham. Mr. C. R. Woodson has re turned from a trip on the Staunton river. Mr. and Mrs. B. J. Mitchell, and family, of Lynchburg, were dinner guests of Mr. and Mrs. Walter Coleman Sunday. Miss Virginia Woodson spent the week-end at her home here. On last Friday night the many friends of Mrs. Susie B. Cheatham Newman gave her a miscellaneous shower at the home of her parents, Mr. and Mrs. E. W. Cheatham. After the opening of the many pres ents received, nice refresh- were served and the young peo pie enjoyed a nice time. Mr. and Mrs. Ben Newman are now making their home in Lynchburg and we wish them a long, prosperous and happy life."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "their mother, Mrs. Eldridge <mark>Cheatham</mark> and Mrs. Wesley Driscoll"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "their mother, Mrs. Eldridge <mark>Cheatham</mark> and Mrs. Wesley Driscoll"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1538.9, 1083.59, 1706.75, 1499.72], "bbox_id": "efe4bb6181", "file": "AppomattoxNewspapers_1908-1909a_0511.pdf", "page": 1, "text": "WOODLAND J WOODLAND,C. R. Wood- son and daughter Rachel, spent the week-end with Mr. and Mrs. Houston Reams, of pear Nbepix. Misses Hamner Coleman, of Lynchburg, Mildred Marshall, of Appomattox, and. Dotty Woodson of Mt Comfort school spent the week-end in their homes Mrs. Lewis Carrol and baby have returned to their home at Concord, after a tw o weeks visit at her mothers, Mrs. W L. Coleman. Mr. and Mrs. Bob Carey moved back to Lynchburg Sat urday. iw Mr. and Mrs. Sammie Cheat ham, of Lynchburg, are guests of Mr- and Mrs. Oscar Cheat ham. Mr. and Mrs. Lacy Pucket and sister, Mrs Bradly, were 1 Sunday guests -of Mrs. Floyd Puckett. Mr. and Mrs. Ben Newman, of Appomattox, were dinner guests of Mrs. E. G. Cheatham Sunday. Mrs. Jim Serra, of Norfolk, is the guest of her mother, Mrs. J. JL Driscoll. Mrs. Watts Harvey and ba by, spent the day lecently with Mr. i nd Mrs. Franklin Marsh- ail, rear Appoma--."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "of Mrs. E. G. <mark>Cheatham</mark> Sunday. Mrs. Jim Serra,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "of Mrs. E. G. <mark>Cheatham</mark> Sunday. Mrs. Jim Serra,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [474.68, 294.13, 634.17, 461.43], "bbox_id": "10d2043cff", "file": "AppomattoxNewspapers_1926-1933a_0510.pdf", "page": 1, "text": "WOODLAND, E. G. Cheatham and daugh ter, Alice, spent Saturda night in the home of Mr. a n d Mrs. Norman Cheatham. Mrs- Houston Reams, of near Phenix, is spending the week with h e r father, C. R. Wood- son. Mr. land Mrs. Witt Harvey, of Williamsburg, Mr. and Mrs. Bob Carey, Mr. and Mrs. Glov er Marshall and sons of Lynch burg, were guests of Mr. a n d Mrs- Sam Harvey Sunday. Mrs. Sam Harvey is spend-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "WOODLAND, E. G. <mark>Cheatham</mark> and daugh ter, Alice,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "WOODLAND, E. G. <mark>Cheatham</mark> and daugh ter, Alice,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [471.84, 272.65, 632.73, 593.59], "bbox_id": "40de2ad5ab", "file": "AppomattoxNewspapers_1908-1909a_0510.pdf", "page": 1, "text": "WOODLAND, E G. Cheatham and daugh ter, Alice, spent Saturda night in the home of Mr. a n d Mrs. Norman Cheatham. Mrs Houston Reams, of near Phenix, is spending the week with, h e r father, C. R. Wood- son.  h i t ! f l l i l t l Mr. land Mrs. W itt Harvey, of Williamsburg, Mr. and Mrs. Boh Carey, Mr. and Mrs. Glov er Marshall and sons of Lynch burg, were guests of Mr. a n d i Mrs Sam Harvey Sunday. Mrs. Sam Harvey is spend ing this week in Lynchburg. Mrs. E. G. JCheatham is con fined to her bed by illness. Mr. and Mrs. C. R. Crawley, Mrs Bradley and son, and Jim mie Puckett, of Lynchburg, spent Sunday in the home of F, T. Puckett.  C. R. Woodson, Misses Mary Woodson, Celene Woodson and Geraldine Coleman spent a few hours Thursday at the bedside of Edd Crawley, near Madison ville, who is ill at his home. . --------- 0 -------------"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "WOODLAND, E G. <mark>Cheatham</mark> and daugh ter, Alice,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "WOODLAND, E G. <mark>Cheatham</mark> and daugh ter, Alice,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.09, 1135.85, 1860.77, 1355.4], "bbox_id": "6d8fd9c68d", "file": "AppomattoxNewspapers_1943-1947a_0003.pdf", "page": 1, "text": "Woodland, Aug. 25.- Mrs. Odell Howe .ton has returned home after visiting her sister, Mrs. J. P. Mar shall. Mr. and Mrs. Twyman Coleman  and sons and Mr. and Mrs. W. L. oleman visited Mr. and Mrs. B. D. Stratton at Boonsboro Sunday. Miss Jean Cheatham is visiting i relatives in Williamsburg. Mrs. Hus on Reams and daugh ters from Green Village, N. J.,were recent visitors of Mr. and Mrs. Russell Woodson. Mrs. Bertha Austin is visiting her sister, Mrs. W. L. Coleman. Miss Mary Ellen Coleman and Mr. and Mrs. Lewis Carroll and Boiby spent the week-end with Mr. and Mrs. W. L. Coleman. Mr. and Mrs. H. C Thomas and son, from Richlands, Va., were re cent visi ors in the home of Mr. and Mrs. J. P. Marshall."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Boonsboro Sunday. Miss Jean <mark>Cheatham</mark> is visiting i relatives"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Boonsboro Sunday. Miss Jean <mark>Cheatham</mark> is visiting i relatives"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1352.13, 161.75, 1818.03, 291.79], "bbox_id": "399827cddf", "file": "AppomattoxNewspapers_1908-1909a_0333.pdf", "page": 1, "text": "WOODLAND  I of Staymen Winesap, l i t  E. Mr. and Mrs. Ben Newman, LeRoy Smith f l  2nd, S L. I accompanied by their mother, Ferguson 50c. Best plate of j Mrs. Eldridge Cheatham and I Fall Cheese, 1 st E- LeRoy Mrs. Wesley Driscoll motored Smith 1 2nd, L. M. Moses 50. to Washington week before Best plate of Mammoth Black . ,  last and spent the week-end. Twig, 1 st S. L. Ferguson 2 promptly and regularly. I Misses Geraldine and Helen 2nd, E. LeRoy Smith 1 Best at the Pot-Officeat  I Coleman are visiting relatives plate of Keiffer Pears lst  act uCogra m jin Lynchburg this week. Callhoun Moore ?l l 2nd Em-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "of j Mrs. Eldridge <mark>Cheatham</mark> and I Fall Cheese,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "of j Mrs. Eldridge <mark>Cheatham</mark> and I Fall Cheese,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1901.31, 254.02, 2042.66, 757.45], "bbox_id": "7db6e7cb43", "file": "AppomattoxNewspapers_1962-1965a_0357.pdf", "page": 1, "text": "W.M.U. Week of Prayer for Home Missions is in progress here -this week .at the Baptist church. Mr. and Mrs. John Nostein and family have recently moved in their new home. Mr. and Mrs. Perry Mobley have announced the birth of a son, born February 24th at Vir ginia Baptist Hospital. Richard Hamilton, of Bluefield College, spent the week end with his parents, Mr. and Mrs. J. K. Hamilton and Donald. Those on the sick list are Mrs. G. W. Glover, Mr. J. C. Staples, Mrs. w. E. Warrlner and Mrs. J. A. Young. Mr. and Mrs. Vernon Dalton, of Blackstore, visited Mr. Arch er Legrand last Sunday. Mrs. Ryand Staples and son, Wilson, and Mrs. O. C. Paulette were luncheon guest of Mr. and Mrs. Tobey Inge and family last Tuesday. Mr. and Mrs. Dan Jennings and son, Sammie, of Cambria, spent the week end with his mother, Mrs. S. J. Jennings and Mrs. Eva Cawthom. Mrs. R. E. Harris has return ed home from the hospital much improved at this time. Mr. and Mrs. Ernest Farrar spent last Sunday with her brother, Mr. and Mrs. Calvin Coleman, of Chase City. Mrs. Thomas Paulett and chil dren of Phenix, visited Mr. and Mrs. W. C. Garrett Sunday eve ning. Mr. Z. E. Cheatham won sec ond prize at the Horse Show Last week at Largo Fla. Mr. and Mrs. Wayne Wirt and family, of Lynchburg, visited Mr. and Mrs. J. C. Staples Sun day afternoon. Mr. and Mrs. J. L. Griffith, of Richmond, were luncheon guest of Mr. and Mrs. G. W. Glover Saturday."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "ning. Mr. Z. E. <mark>Cheatham</mark> won sec ond prize"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "ning. Mr. Z. E. <mark>Cheatham</mark> won sec ond prize"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.05, 1073.0, 614.95, 1568.43], "bbox_id": "8b7fe22d2e", "file": "AppomattoxNewspapers_1918-1922a_0620.pdf", "page": 1, "text": "Wm. Garrett, labor _ ____ _ __ _ ___ _ _______ 12733 Fred Doodley, labor ___________ __ _ ____ ____ 788 John Ferguson, la b o r _________ ZZZZZZZZZZZ!  i 5fion Hall Bryant, la b o r _________ _ ___________________ lkoo Hubert Gallaher, la b o r _________ _______________ ZZZZZZZZZZZZZZ 5053 T. S. McNally, road foreman, care of team and incidental expensesZZ 783.56 Buck Wells, labor _ ___________________________________ _ 106.01 H. M. Burge, feed, supplies, A c . ________ ZZZZZZZZZZZZZZZZZ 568 79 D. R. Puckett, blacksmith w o rk _________________________ ZZZZZZ 1900 Appomattox Hardware Company, supplies _________________ _ _ _ 126.31 R. F. Burke, Treasurer, for draft for feed...____________________  13200 Jesse T. Jennings, dragging road _ ________________________ Adams Bros.-Paynes Co., culvert p ip e __________ W. H. Jones, lum ber ___ . . . __ _ _____________ ZZZZZZZZZZZZZZZZZ. Earl Harris, la b o r _____________ _______ ZZZZZ A. W. Jones, work on ro ad _ _ ___ ZZZZZZZZZZZZ Buck Doss, labor _ ___ _ _ _ _ __ ______ ZZZZZZZZZZZZZZZZZZZZZ L. E. Smith A Bro., chop and corn _ _ _ ______ C. A. Flowers, blacksmith account __ of Appomattox, for drafts for feed Z __ Z.ZZZZZZZZZZZZZZZZZZ 4w.   E Smith, salary as member Road B o ard ____________________ 183.00 W. Smith, one-third salary as clerk Road Board _______ ____ Z 3334 I . A. sm ith A Co., heater, and pipe for road cam p _____ 440 Lawson Woodson, labor _ _ __ ____ _____ 11 an Wallace Woodson, labor _ __ _ ___________ ZZZZZZZZZZZ 1140 Curtis Martin, labor _ _______________ - 8,n Bill Hollins, la b o r ___ ____ __ _________ ___ ZZZZZZZZZZZZZZZ 7 50 W. T. Nash, boarding road force, c.__ZZZZZZZZZZZZZZZZZZ__Z 20 00 Leslie T. Morris, road w o rk ___ _ ________ __________  _______   533 rs- T. S. McNally, cooking for road fo rc e __________ __ 3250 M. J. Goin, fe e d ________________________ 9Knn F. T. Puckett, work on ro a d ___________________ ZZZZ 12 00 Epps Johnson, labor _ ___ ______ _ ________________ ZZZZZZZZZZZZZ 24.00 J. A. Sears, Frt. on grader blades _________________ Z ZZZZZZZZ 185 Gallon Iron Works, grader b lad es ______________  40 42 Andrew Pillow, labor _ ______________ _ iq  vk Bill Jamerson, labor __________ 1 oKn G. W. Lewis, fe e d _______________ ZZZZZZZZZZ ---------------------------- 11 nn Willie Smith, la b o r __ _ ____ _ ____________ _  j  aa N. W. Jamerson, la b o r __ _______  14a R. S. Wheeler, lum ber _________________ Z __ ZZZZZZZZZZZZZZZZZZZZ 5007 Hunter Harvey, blacksmith w o rk ___ _ ________ ZZZZZZZZZZZZZZZZ 967 S. P. Coleman, Jr., cutting tree out ro a d _________________ _ 1 00 R. A. Anderson, lu m b er ________________  3750 J. L. Driskill, sills for culvert . . . _____ _ ____ qnn Joe Sell, labor _ __ _ _ _ _____ ________ 525 Mr. Brewer, labor . . . __ _ _______ ZZZZZZZZZZ 3nn Emmett Day, labor - __ _ _______ 81 60 Wiley McNally, labor ____________ ZZZZZZZZZZZZZZZZZZZZZ ------ 3525 C. A. Agee, painting w ag o n ____________________ 1700 Times-Virginian, warrant boo k ________________________ Z-ZZZZZZ 1350 Pomona Terra-Cotta Co., sewer p ip e ___________________________ 4605 Appomattox Garage, for Fordson Tractor and repairs ___________ 731.94 Standard Oil Co., for gasoline and oil _ ____________________ 4588 J. W. Crenshaw, la b o r __________________ __ __ 6400 Rector Bros., supplies ____ _______________  . Bq7 O. F. Cheatham, lum ber ________________ZZZZZZZ 3425 Jim Casey, labor __ _ ________ _ ____  97nn R. C. Mann, la b o r ______________ ZZZZZZZZZZZ ZZ 7 00"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "supplies ____ _______________  . Bq7 O. F. <mark>Cheatham</mark>, lum ber ________________ZZZZZZZ 3425"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "supplies ____ _______________  . Bq7 O. F. <mark>Cheatham</mark>, lum ber ________________ZZZZZZZ 3425"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.1, 451.88, 1167.15, 805.31], "bbox_id": "34d84c03ee", "file": "TimesVirginian_1976_0085.pdf", "page": 1, "text": "without aid from the Govern ment. R. A . Cheatham was married on October 24, 1866 to Harriet Nelson CaWthorn, daughter of the Rev. John H. Cawthorn, a Baptist minister. They were the parents of eleven children, the youngest of whom Russell Aubrey Cheatham, served with tMfe Army in Europe during World War I. R . A . Cheatham died Nov. 6,1922 and is buried In the Cheatham Fanhily Cemetery three miles south west .of Appomattox, Va. on State Route 719. - I have always heard that my Grandfather was left on. the battlefield for dead, but an Appomattox soldier passing by found him and took him to the medical tent. They cleansed his chest wound by passing a silk hankerchief through it. His paralyzed left arm was cured by massaging over a period of years. My grandmothers fami ly did not want her to marry him as they did not think a man with only one arm could support her, a problem soldiers of ail wars have had to face."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Govern ment. R. A . <mark>Cheatham</mark> was married on October"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Govern ment. R. A . <mark>Cheatham</mark> was married on October"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.56, 997.04, 1476.45, 1673.51], "bbox_id": "780625d2fd", "file": "TimesVirginian_1980a_0133.pdf", "page": 1, "text": "with venise lace. The sheier bishop sleeves were trim med at the cuffs with venise lace. The skirt had a center front insert ..of pleated organza and an attached chapel length train.She wore a fingertip veil of silk illusion appliqued with flowers, which was edged with complimentary lam. The cap was Juliet style covered with laced flowers and decorated with pearls. She carried a bouquet of white rose buda, white daisies and babys breath. Mrs. Patsy Pierce of Appomattox, sister of the bride, was matron of honor. She wore length , beige floral dress-leatunng a cowl neck, sleeveless with draw strings on shoulders and tie belt. She carried a bouquet of pink daisies with pink and blue streamers. Other attendants were Miss Janet Fitzgerald, Miss Nancy Stratton, Mrs. Cindy Watson, and Mrs. Debbie Drinkard, all of Appomatt- tox. They .wore a slipper length light blue satin dress made identical to the matron , of honor and carried a bouquet of pink daisies with blue streamers. Mr. McClary served as his sons best man. Ushers were Mr. Jimmy McClary, brother of the groom, Mr. Greg Love, Mr, Dwayne Scruggs and Mr. H. L. Williamson, Jr., all of Appomattox. Misses Lori Goin and Susan Cheatham of Appo mattox were flower girls and Master Scott Goin of Appomattox was ring bear er. Directors were Mrs. Her bert Garrett of Spent Spring and Mrs. Robert Garrett of Appomattox. Miss Sue Thomas of Appomattox and Miss Deb bie McFadden of Gladstone registered the guests. Following the ceremony the brides mother was host for a reception in the church social hall. The reception was hostedby Mrs. fienault and Mrs. Edith"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Lori Goin and Susan <mark>Cheatham</mark> of Appo mattox were"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Lori Goin and Susan <mark>Cheatham</mark> of Appo mattox were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [682.49, 598.86, 817.39, 629.01], "bbox_id": "dd70ab8200", "file": "AppomattoxNewspapers_1933-1936a_0073.pdf", "page": 1, "text": "with their grandparents, Mr. Mr?. Norman Cheatham. e e"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "with their grandparents, Mr. Mr?. Norman <mark>Cheatham</mark>. e e"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "with their grandparents, Mr. Mr?. Norman <mark>Cheatham</mark>. e e"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.92, 423.28, 1693.59, 841.01], "bbox_id": "44473c0267", "file": "AppomattoxNewspapers_1954-1955a_0220.pdf", "page": 1, "text": "With the theme, Vocational Agri culture trains future farmers to be better farmers, and the F. F. A. makes Future Farmers into better citizens, members of the Robert E. Lee Chapter, Appomattox, will tell part of their story to the public to morrow over WLVA, Lynchburg Television Station. Ralph Harris, president of the local chapter, will introduce four other members on the program. These members will be Claude Allen Moore, va senior and vice-president Ralph .Reynolds a junior and chapter treasurer Bob by Barger, a sophomore and dub sentinel and a freshman, James Cheatham. Each member will tell some phase of their vocational agriculture or F. F. A. work, starting with James Cheatham who will -tell that The Future Farmers of America was largely patterned after the Fu ture Farmers of Virginia, which was organized first. Boibby Barger will tell a little about the F. F. A. con tests, and Ralph Reynolds will ex plain the meaning of the symbols seen on F. F. A jackets and pins worn by these farm boys. Claude Allen Moore will sum up the entire vocational agriculture program as it affects high school boys, with parti cular emphasis on the farm shop phase of the program. Items made in the shop will be displayed and ex plained. The Appomattox .boys will appear on the RFD 13 program, Lynchburg, at 12 noon, Friday, Feb. 25."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and a freshman, James <mark>Cheatham</mark>. Each member will tell"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and a freshman, James <mark>Cheatham</mark>. Each member will tell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.09, 637.48, 1833.74, 647.48], "bbox_id": "3804048e98", "file": "AppomattoxNewspapers_1952-1954a_0220.pdf", "page": 1, "text": "with Mr. aiid Mrs. Z. E. Cheatham."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "with Mr. aiid Mrs. Z. E. <mark>Cheatham</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "with Mr. aiid Mrs. Z. E. <mark>Cheatham</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [551.5, 492.95, 722.36, 719.84], "bbox_id": "ccc83ff5e4", "file": "AppomattoxNewspapers_1939-1943a_0092.pdf", "page": 1, "text": "with M rs. ---- -------- W. Woolridge, to demonstrate slip covering. Rev. C. A. Collins r. closed a very successful meeting at Forest Chapel Saturdaly night. Those from the Evergreen Baptist church attending the Appomattox Baptist Association were E.J.Paul ette, Miss Virginia Paulette, Rev. and Mrs. G. A. Chocklette and Rev., and Mrs. C.A. Collins, Jr. Mr. and Mrs. R. 5. Hudnall, of Lynchburg visited his uncle, W. W. Farrar, Monday. I Miss Madian lee spent the week end here. C. T . Evans is having his dwell ing painted, Mrs. Z. E. Cheatham is home again after spending some time at"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "painted, Mrs. Z. E. <mark>Cheatham</mark> is home again after"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "painted, Mrs. Z. E. <mark>Cheatham</mark> is home again after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1858.28, 328.31, 2022.78, 349.6], "bbox_id": "f77bc89517", "file": "AppomattoxNewspapers_1939-1943a_0402.pdf", "page": 1, "text": "with his parents, Mr. H. Cheatham. apd Mrs.J.  A-r ."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "with his parents, Mr. H. <mark>Cheatham</mark>. apd Mrs.J.  A-r ."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "with his parents, Mr. H. <mark>Cheatham</mark>. apd Mrs.J.  A-r ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1404.0, 1609.72, 1651.24, 1648.25], "bbox_id": "8d709aee06", "file": "AppomattoxNewspapers_1918-1922a_0190.pdf", "page": 1, "text": "with dual electric Mies Ethel Woodson has re- ________________ _ from Lynchburg. with dual electric Startf 5 .-  i s  Arline Cheatham In system ...... - ...... .........."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "with dual electric Mies Ethel Woodson has re- ________________ _ from Lynchburg. with dual electric Startf 5 .-  i s  Arline <mark>Cheatham</mark> In system ...... - ...... .........."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "with dual electric Mies Ethel Woodson has re- ________________ _ from Lynchburg. with dual electric Startf 5 .-  i s  Arline <mark>Cheatham</mark> In system ...... - ...... .........."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1920.4, 1083.6, 2080.11, 1318.04], "bbox_id": "3854b97c3e", "file": "AppomattoxNewspapers_1915-1918a_0530.pdf", "page": 1, "text": "with C. B. McDearmon and Q. A. OhockletJ, secretaries. The following names were en rolled Mrs. Massie Jenkings, Mrs. James McDearmon, Miss Frances McDearmon, Miss Ida M. Farrar, Mrs. 8 . M. Thorn ton, Mrs. G. A. Chocklett, Mrs. O. A. Warren, Mrs. B. J. Glov er, Mrs. Albin Staples, Miss Ida Evans, Zack Cheatham, 0. A. Walker, A. B. Chocklett, W. C. Garret, Gilbert Dinkins, T. B. Harvey, Mrs. 8 . J. Jennings, Daniel J e n n i n g s , Marvin Staples., Gelene son ham, Mabel Johoson, Gladys Jennings, Cecil Staples, Miss Minnie Inge."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Miss Ida Evans, Zack <mark>Cheatham</mark>, 0. A. Walker, A."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Miss Ida Evans, Zack <mark>Cheatham</mark>, 0. A. Walker, A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [256.78, 524.33, 743.91, 757.15], "bbox_id": "7289619160", "file": "AppomattoxNewspapers_1908-1909a_0281.pdf", "page": 1, "text": "with a view to giving its cus-i of gents furnishings you will tomers the greatest value pds-jfind the stock large, selected sible. When it c o m e s to j by buyers of excellent taste ready-made clothing they have  and priced reasonable. - lines which are so complete as j This firms store is stocked to styles, material and prices! with the greatest variety of that the lost particular can quality mens clothing in the find something suitable. But j country. Popular prices pre- the success of a dealer in this vail, automatically going lower line rests not only with the J as materials, manufacturing ness men of the community, I price he pays for his goods, land retailing prices will per- they cater to every taste and I He must be an efficient buyer, mit, this protects the buyer have a most comprehensive j weir versed in the styles of the The many patrons come from gtoeb. j day and with a knowledge of j all quarters of the community It is with a feeling of satis-the demands of his customers.and outside as well, faction that customers enterit is this feature of the trade Paul Cheatham Inc, is this store. I that has made his store so pop- well known business concern Realizing that the -service lular with the young of this see- and a progressive booster for extended this year will he con-jtion. ___________ . ------the c o m m u n i t y. We are sidered when the next season In the way of collars, ties, pleased to compliment it upor approaches, this well known! haber-dashery, underwear and the metropolitan service and house has chosen its stock in fact everything in the way public spirited policies."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "of the trade Paul <mark>Cheatham</mark> Inc, is this store."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "of the trade Paul <mark>Cheatham</mark> Inc, is this store."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [354.48, 774.19, 845.97, 1009.69], "bbox_id": "8e9af18439", "file": "AppomattoxNewspapers_1908-1909a_0311.pdf", "page": 1, "text": "Wisecrack There Is, as Is usual each season, one of those half-whimsical, half- dramatic A. A. Mllhe plays at the tiny Charles Hopkins theater. This time It la about two very nice people, one of whom commits bigamy. All 1411ns people are very nice, from Winnie the Pooh on up, and the bigamy to this case la quite the right thing to da But I am digressing. What I wanted to tell about is a line that amused me. Edith B arrett the wife. Is try ing to get the attention of Henry Hull, the husband, who Is reading a Mr. ana Mrs. a . u . jxiaruuH under this head for 50 cents. - and baby, Dorothy Smith, spent Sd name anpoat      d  Z te  . Sunday afternoon recently in S h S 50 cents. ? I n have plcked it. up. ,o cm the home of E. G. Cheatham. I We aiso print cards for post Measles js on the move visit- ing at five cents each ing Ihe different families. The4 - -   children of Mr. and Mrs. El- liot Marshall have measles, also"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "home of E. G. <mark>Cheatham</mark>. I We aiso print"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "home of E. G. <mark>Cheatham</mark>. I We aiso print"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.29, 594.65, 1834.3, 804.09], "bbox_id": "592ee6f81d", "file": "AppomattoxNewspapers_1962-1965a_0621.pdf", "page": 1, "text": "Winter is still around with snow. Mr. R. E. Harris has returned home from the hospital and is much improved. Mr. and Mrs. Hugh Dickerson, of Pamplin, Mrs. Mary Sullivan, of Lynchburg, visited Mr. and Mrs. G. W. Glover over the week end. Mr. and Mrs. Bobby Canada and family and Mrs. Katie Aus tin, of Phenix, visited Mr. and Mrs. Lewis Harvey and. daugh ter, Linda and Sue, Sunday eve ning. Mrs. Z. E. Cheatham visited Mr. and Mrs. Dean Sunday eve ning. Mr. and Mrs. Dan Jennings and son, Sammy, of Cambria, Mr. and Mrs. Lawrence Young,"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "ning. Mrs. Z. E. <mark>Cheatham</mark> visited Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "ning. Mrs. Z. E. <mark>Cheatham</mark> visited Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2073.08, 378.43, 2232.76, 1539.76], "bbox_id": "7a28bc806b", "file": "AppomattoxNewspapers_1902-1905a_0283.pdf", "page": 1, "text": "winter has disappeared and nature has commenced her work. Spring has returned. Onr neighborhood has been made very sad by deaths both young and yonug and old. Last week there were two burials within a mile of each other and both within three days. Mrs. Peniok and Mrs. Pugh, of whom we speak, were the same age and spsr.t their young days to gether, then after long separation by marriage, a to., we laid to rest near each other. Every one oi Mrs. Pen- ioks grand-children except one fam ily have lost a grandparent on both both their mothers and fathers side, within a year, and there were six families. Mr. Chap Sims, of Roanoke, vis ited his hoipe last week. Mr. A. S. Woolridge spent a few days in Roanoke last week, also vis ited his brother, Mr. G. W. Wool ridge, at Lowry, while he wm gone. Mrs. Archer Woolridge has just finished a quilt oontaiuing 2,818 pieces. She must have a lot of pa tience. New Light school has olosed. Tbe entertainment was held at Evegreen, in Thornti ns hall, on Friday-night, April 1st., with great success. The hunse was decorated with white and evergreens, and ere the time appoint ed for tbr exc eWs v begin th bouse was c owded. 1 ue . grauii e was as follow Welcome Add teeJ-e- e Xt-ples.! Trouble With Opening Pi e. .ity 2 girls. Somebodys F uhh . Earl Kiumr. Courtship under Dillcult. .2 gills 1 buy. At School and at Home.Walter Harvey. Recitations bv 7 children. Little Feilnw.ticker Cheatham. Japanese Parasol Drill,By II girl, Papas Calendar.Beatrice Inge. Will Winter Never Be 0 er?r-Eliza Sullivan. Big Holler School.By 7 boys and 8 girls. Gods Eye.Ruth Hirvey. Speaking Pieces.Bernice Rutledge. Pitiful Cry of Nobodys Child. Myrtioe Cawtliorii. Solo, Nobodys Child.  Mazie Cawborn. The Other Train.Alma McDear- mon. Doll Drill.By 10 little girls. Take a Taler and Wait.Henry Staples. How She Cured Him.2 girls and 1 bpy. Little Gerald. Mary Lou Wingfiela. What Ill Be.By 7 boys. House Cleaning.Tellie Johnson. Fortune Telling.By 3 girls. Smack in School.Loraine LeGrand. Jesus, Lover of My Soul.Annie Ragland. Sermon.By Sam Staples. Flag Drill.By 6 boys and 6 girls. Annt Mandy.Bill Wingfield, tin School Days.Sadie Snell. Seed Babies.By 5 girls. Little Teacher.Earl Farrar. Making an Editor Outen Him.2 boys 1 girl. Learning to Sew.Nora Johnson. 13 United Colonies.By 18 girls. Goodby to School.Beatrice Inge Chorus, God be With you.By School. All separated and went to their homes hoping to meet again. The teacher, Miss Bertha Woolridge, thanks ths patrens through the col umns of this paper, for their co-op eration in tne school work the past winter. Also thanks the pupils for their kindness and obedience. Annie Cheatham was present 100 days and Annie Ragland 99. Success to your paper. L. M April 9."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "7 children. Little Feilnw.ticker <mark>Cheatham</mark>. Japanese Parasol Drill,By II"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "7 children. Little Feilnw.ticker <mark>Cheatham</mark>. Japanese Parasol Drill,By II"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1609.7, 572.66, 1779.27, 1061.95], "bbox_id": "245c4e8721", "file": "AppomattoxNewspapers_1908-1909a_0169.pdf", "page": 1, "text": "Winter came last week and the weather this week is so much warmer.. Lots of people have terrible colds- Mrs. T. H. Ford is not so well a f this writing also her little boy, George has been sick N. D. Marshall id suffering with rheumatism but going around Some of the farmers in. this section who have marketed some are very much discourag ed with prices, while others real ized fair prices. Miss Bessie Martin entertainec a few of her friends on Saturday night recently, with rook and everybody had a good time. Lloyd Nash, of Richmond, is I visiting his father, Si J. Nash. He took his children to Lynch burg yesterday for a trip. Mr, Jim Bob Ford visited his home folks last Sunday. Miss EuUi Cheatham gave a dance last Friday night. Miss Bessie Martin visited in the home of her Uncle, W. L. Ford, last Saturday. Mr. and Mrs. J. B. Marshall left last Tuesday from the home of T. H. Ford, where they spent the night before, for Fayettsville F a , where they had a position awaiting them. We certainly hate tio give these good people up as citizens of Appomattox Coun ty. Their sale, which took place the last of November was well"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "last Sunday. Miss EuUi <mark>Cheatham</mark> gave a dance last"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "last Sunday. Miss EuUi <mark>Cheatham</mark> gave a dance last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1467.6, 594.27, 1798.66, 802.11], "bbox_id": "8f8d3c6ab1", "file": "AppomattoxNewspapers_1926-1933a_0169.pdf", "page": 1, "text": "Winter came last week and the _________ I __m weather this week is so much a large crowd present and every-1 warmer. Lots of people have body reported a good time. At I terrible colds, a late hour the crowd left wish-1 Mrs. T. H. Ford is not so well ing him many more happy birth! at this writing also her little days. I boy, George has been sick. Mrs. F. T. Puckett entertained I N. D. Marshall is suffering with rheumatism but going around Some of the farmers in this section who have marketed some tobacco are very much discourag- Cheatham is on the Jed with prices, while others real ized fair prices. Miss Bessie Martin entertained a few of her friends on Saturday"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "are very much discourag- <mark>Cheatham</mark> is on the Jed"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "are very much discourag- <mark>Cheatham</mark> is on the Jed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.04, 397.27, 811.17, 427.72], "bbox_id": "f1f08406dd", "file": "TimesVirginian_1980a_0336.pdf", "page": 1, "text": "WINNING TEAM MEMBERS  IU r Ray Cheatham. Dennis Stratta top individual scorer and Robert Coleman."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "WINNING TEAM MEMBERS  IU r Ray <mark>Cheatham</mark>. Dennis Stratta top individual scorer and Robert Coleman."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "WINNING TEAM MEMBERS  IU r Ray <mark>Cheatham</mark>. Dennis Stratta top individual scorer and Robert Coleman."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2275.7, 1052.79, 2428.75, 1419.42], "bbox_id": "fae56f3156", "file": "TimesVirginian_1976_0406.pdf", "page": 1, "text": "Winners in the weekly football contest that has been sponsored for the past several weeks by area businesses have been announced by the TIMES- VIRGINIAN for last weeks contest. First place winner, with 13 out of a possible 15 correct 1 predictions, is Shelia Torrence of Route 2. She will receive a check from the TIMES-VIR GINIAN in the amount of  10.00 as prize for first place. Seven persons predictea correctly 12 games of the 15 in the contest. Going to the tie breaker for a winner, M. W. Cheatham of Spout Spring gave Appomattox 22 points over Amherst, this being the closest score to the 20 point actual difference. He will receive a 1 check in the amount of 5.00 for  second place. As the Seminole District ! ended play for the season 1 Friday night, the Football  Contest has come to an end for  this year. There has been much interest, shown in the contest and hopefully we will continue with a similar contest next  season."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "a winner, M. W. <mark>Cheatham</mark> of Spout Spring gave"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "a winner, M. W. <mark>Cheatham</mark> of Spout Spring gave"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1480.56, 429.85, 1964.4, 510.98], "bbox_id": "707828e383", "file": "TimesVirginian_1983a_0053.pdf", "page": 1, "text": "WINNERS IN THE FBLA  Dress Properly competition include Cheryl Cheatham, Ridi Caldwell, Mike Davis, Anita Harvey, and Betty Vanoy. FBLA Week observed here"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "WINNERS IN THE FBLA  Dress Properly competition include Cheryl <mark>Cheatham</mark>, Ridi Caldwell, Mike Davis, Anita Harvey, and Betty Vanoy. FBLA Week observed here"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "WINNERS IN THE FBLA  Dress Properly competition include Cheryl <mark>Cheatham</mark>, Ridi Caldwell, Mike Davis, Anita Harvey, and Betty Vanoy. FBLA Week observed here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2124.7, 1314.21, 2298.29, 1753.09], "bbox_id": "b56f5f7a32", "file": "AppomattoxNewspapers_1905-1912a_0235.pdf", "page": 1, "text": "Winner of First Prize of 275 at Lynchburg Fair. William H. Dorin, of Clover, Halifax county, Virginia, had twenty-five acres in com and made an average yield of forty bushels per acre. Mr. Dorin won aix prizes at Lynchburg in 1910 and two elsewhere, and they aggregated 438. Leonidas W. Hanimersley, of Rust burg, Campbell county, averaged fifty bushels on three acres, and this land three or four years ago would not raise twenty bushels. William Edward Branch, of Madl- sonville, Charlotte county, average forty bushels per acre on twelve acres cultivated. John H. Turner, of Appomattox, Vir ginia, planted twelve bushels and aver aged forty bushels to the acre yield. August Manlcke,- of News Ferry, a native of Germany, who came to Hali fax county in 1900, bought land dirt cheap, cultivated it, planted twenty five acres in com this year and made fifty bushels to the acre. Mfc Manlcke states that land adjoining his can bo bought for 10 and 20 per acre. Mr Manlcke won over 400 In cash prizes this year. As excellent as are these records, they pale before tbe following aver ages George William Cheatham, of Spout Springs, Appomattox county, who made sixty-one bushels to the acre in 1910. In 1907, 1908 and 1909 he made twenty-two bushels per acre. George S. Nichols of Bedford county Virginia, planted eighteen acres. Ten acres averaged seventy-five to eighty five bushels per acre and the balance forty to fifty bushels. Mr. Nichols 271 in prizes, including tbe grand sweepstake prize, at the Lynchbur ifalr far toe beat tan ears of white"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "aver ages George William <mark>Cheatham</mark>, of Spout Springs, Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "aver ages George William <mark>Cheatham</mark>, of Spout Springs, Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "P. Farrar, J. H. <mark>Cheatham</mark>, Dr. L L. Gayle,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "P. Farrar, J. H. <mark>Cheatham</mark>, Dr. L L. Gayle,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [665.48, 238.69, 828.62, 548.53], "bbox_id": "d4c2be2e0e", "file": "AppomattoxNewspapers_1908-1909a_0534.pdf", "page": 1, "text": "William G. Stevenson, of the! Blackstone , Courier-Record, was a welcome visitor at Times Virginian office Saturday. Misses Virginia and Adeline OBrien, of Lynchburg, visited Mrs.. W. B Caldwell .Friday and Saturday. Mr. and Mrs. J! S. Schaubach Mr. and Mrs. V. B. Strawser and daughter, Caroline, Mr- and Mrs. Wiley B. Caldwell and daughter, Irene, and son, William, of Lynchburg, and Mr and Mrs. Elliott. Cheatham of Forest, attended the home coming at Liberty Baptist church last Sunday. Sunday, September 27 was the occasion of a birthday par ty and family reunion in honor of Spugeon Coleman, aged seventy one years. An elabo rate dinner was prepared and consumed and many friends from far and near joined with the family to make the day one of joy."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Mr and Mrs. Elliott. <mark>Cheatham</mark> of Forest, attended the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Mr and Mrs. Elliott. <mark>Cheatham</mark> of Forest, attended the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1044.23, 872.89, 1157.11, 884.89], "bbox_id": "65611b5d23", "file": "AppomattoxNewspapers_1960-1962b_0600.pdf", "page": 1, "text": "William Cheatham ,"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "William <mark>Cheatham</mark> ,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "William <mark>Cheatham</mark> ,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [588.93, 415.53, 736.06, 826.82], "bbox_id": "dd87a706e3", "file": "AppomattoxNewspapers_1971-1973a_0589.pdf", "page": 1, "text": "William Baxter Cheatham, 34, of Rt. 1, Appomattox died , Saturday as the result of injuries sustained in an auto accident. He was the husband of Mrs. Margaret Cheatham. Born in Campbell County, he was a son of Mrs. Mary Cox  Cheatham and the late Russel Cheatham. In addition to his mother and widow, he is survived by six stepdaughters, Mrs. Jannis Burns and Mrs. Dreametta Austin of Appomattox, Mrs. Armetta Carter of Brookneal, Linda Younger of Concord, and Mrs. Carnella Eubank and Ruby Younger of Lynchburg a stepson, Norman Younger of Appomattox three sisters, Mrs. Etta Hamlett of Newport News, Mrs. Mary Elliott of Brookneal and Mrs. Evelyn Stone of Hurt two brothers, Richard Cheatham of Concord and Elliott Cheatham of  Brookneal, and 10 grandchild ren. Funeral services were con ducted at 1 p.m. Wednesday at St. Lukes Baptist Church by the Rev. R. Q. Lawing with burial in the church cemetery. Carl B. Hutcherson Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "William Baxter <mark>Cheatham</mark>, 34, of Rt. 1,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "William Baxter <mark>Cheatham</mark>, 34, of Rt. 1,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [603.58, 393.48, 722.88, 403.98], "bbox_id": "371e581a52", "file": "AppomattoxNewspapers_1971-1973a_0589.pdf", "page": 1, "text": "WILLIAM B. CHEATHAM"}, "highlight": {"text": {"matched_tokens": ["CHEATHAM"], "snippet": "WILLIAM B. <mark>CHEATHAM</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["CHEATHAM"], "snippet": "WILLIAM B. <mark>CHEATHAM</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [583.87, 300.99, 874.62, 376.99], "bbox_id": "be8da869cd", "file": "AppomattoxNewspapers_1962-1965a_0500.pdf", "page": 1, "text": "will Community Center. Sept. 24, ers of the Board of Directors with Mrs. Onyx Metz and Mrs. ! and management of the South- Cheatham Thompson co-hostess, side Electric Cooperative to Ap- Other oliicers elected to serve , proximately 3,500 members and with Mrs. Scott were Mrs John I friends at the 27th Annual Meet- Torrence vice president and of Members held Saturday. Mis. Ryland Phelps, secretary September 19, in Crewe, Va., in- and treasurer"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "management of the South- <mark>Cheatham</mark> Thompson co-hostess, side Electric"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "management of the South- <mark>Cheatham</mark> Thompson co-hostess, side Electric"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [538.08, 1059.35, 677.86, 1469.17], "bbox_id": "0866991c31", "file": "AppomattoxNewspapers_1971-1973a_0473.pdf", "page": 1, "text": "will be Methodist The Revival in progress at Church this week. Mr. and Mrs. K. C. Paulette and Mrs. R. W. Staples and son, Wilson attended the Richmond Fair last week. Mr. and Mrs. Ermil Pickeral of Lynchburg was dinner guest Tuesday evening of Mr. and Mrs. A. B. Cocke and Dorothy. Sympathy is extended to the Ramsey family in the death of their mother. The Sunday School picnic was well attended at the Methodist Church Sunday. Mr. and Mrs. Wyley Rich ardson of Lynchburg and Mrs. Jessie Car wile and Miss Mackie Paulette visited Mr. and Mrs. J. M. Haney Sunday. W.M.U. Group one will be at Rocks Church Tuesday night. Mrs. Mattie Pillow visited Mr. and Mrs. Z. E. Cheatham last week. Mrs. Henry Simmon and Mrs. Donald Dixon were at Lynchburg Saturday. Mrs. Otis Davis of Farmville spent Sunday in the home of Mr. and Mrs. J. K. Hamilton also Mr. and Mrs. Donald Hamilton of Newport News. Mr. and Mrs. Randall Wool- dridge spent Friday night"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z. E. <mark>Cheatham</mark> last week. Mrs. Henry"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z. E. <mark>Cheatham</mark> last week. Mrs. Henry"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [878.65, 247.43, 1040.49, 517.62], "bbox_id": "db9bbf9228", "file": "AppomattoxNewspapers_1918-1922a_0058.pdf", "page": 1, "text": "will attend Bummer Normal Misses Bettie and Grade Mar shall, Sarah and Eula Hower ton, Messrs John Cheatham, Schuyler Marshall and Thoinas and Richard Caldwell were guests at the home of Mr. and Mrs. M C. Caldwell for the week end Miss Mary Sue Bingham is sick. We hope she may soon be well Miss Pearl Caldwell is visit ing friends and relatives at Spout Spring Miss Ruby Caldwell is visit ing her aunt, Mrs. EX A. Wal ton, of Bent Creek Mrs. Leslie Gordon and little son, Lesl e, Jr., have returned home after a two weeks visit to relatives in Richmond Mrs. J. R Brooks and Miss Isabelle Hughes have returned to their homo in Blacksburg after a two weeks visit to Mrs J. H. Stephenson"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Hower ton, Messrs John <mark>Cheatham</mark>, Schuyler Marshall and Thoinas"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Hower ton, Messrs John <mark>Cheatham</mark>, Schuyler Marshall and Thoinas"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.98, 749.5, 1952.21, 893.7], "bbox_id": "4311199597", "file": "AppomattoxNewspapers_1908-1909a_0503.pdf", "page": 1, "text": "will , i home. raging here. . ! Mrs. J. E. Martin, of Roan- Ï am glad to     î oke and J L. Martin, of Peters- grdens have been planted and burg acconipanied Misg Anne Martin for a few days to San ford, Fla., where the latter will spend the summer with her neice, Mrs. A. H. Garrett? Mrs. J. H. Cheatham, and daughter, Mrs. Ringham a n d Miss Iean Johns, of Appomat tox, were recent visitors in the home of Mrs. J. A. Martin."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Garrett? Mrs. J. H. <mark>Cheatham</mark>, and daughter, Mrs. Ringham"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Garrett? Mrs. J. H. <mark>Cheatham</mark>, and daughter, Mrs. Ringham"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.69, 1549.76, 1890.18, 1836.7], "bbox_id": "caf4d834ba", "file": "AppomattoxNewspapers_1954-1955a_0186.pdf", "page": 1, "text": "Wilkes 25 cents to make it run. Wilkes repaired the clock, collected the 25 cents. He promptly went to Martins blacksmith shop and paid 15 cents for a pair of pliers, and then 10 cents for a punch. Mr. Henry Cheatham had a 98 cent watch a good one in those days. But the Watch was broken, and Wilkes got the job of repair ing it. He found that a spring was broken, but he had no replacement. Put Wilkes was inventive, and he fashioned a wooden spring out of white oak wood from a chair bot tom. It worked, and he proudly took the watch to Mr. Cheatham, and asked 30 cents for his work. Mr. Cheatham paid off with a small pig, which later turned out to be blind. Wilkes borrowed a saddlebag to carry the pig home, and by fall had the pig up to 200 pounds. Mr. Wilke3 has a splendid mem ory and recalls in detail many events of the 1890 period in and around Appomattox. He recounted to the Times-Virginian his first trip"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "a punch. Mr. Henry <mark>Cheatham</mark> had a 98 cent"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "a punch. Mr. Henry <mark>Cheatham</mark> had a 98 cent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2053.46, 432.21, 2394.23, 607.1], "bbox_id": "6700c219f3", "file": "AppomattoxNewspapers_1954-1955a_0123.pdf", "page": 1, "text": "whose children taught.  in two and three generations have It was during the seven years of been Evergreen pupils. The achieve- Ursula Wooldridges teaching that a ments of the past are a challenge to well was bored on the school prop- the future. erty. Before then water was gotten Note The Times-Virginian is from a house across the road. indebted to patrons of the Evergreen About this time so many pupils at- Mrs. Z. E. tended Evergreen school, classes Cheatham and Mrs. J. K Hamilton could be given only a few minutes t n tl!e,r  8e h in    rin d each. To relieve this situation, Miss coxnPll,ng the histo ry of this school, Minnie Chocklett was appointed........................... . -......... .....  teacher and for several months p 1  taught in the new store house. 1 During the school years of Miss- es Aileen McClenny and Louise Lewis, the 2nd World War broke"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "tended Evergreen school, classes <mark>Cheatham</mark> and Mrs. J. K"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "tended Evergreen school, classes <mark>Cheatham</mark> and Mrs. J. K"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [420.96, 577.07, 598.83, 1206.06], "bbox_id": "a9154427e3", "file": "AppomattoxNewspapers_1939-1943a_0524.pdf", "page": 1, "text": "who underwent an operation erday. Corn. Carter is report be in a satisfactory condition Charles Gregory, of the U. S has a ten-day extension on hi 1 lough. Mrs. J. W. St- Clair. of n  and Miss Madian Lee. ton spent the week--re with Mrs. IR. T. Lee. Mrs. H. P. Davis. Mrs. F. C. Dres ser and Mrs. R. T. Lee spent a few days in Richmond last week. Week-end guests of Miss Frances Evans were Miss Pauline Griggs, of  Phoebus and Sg. L. E. Cauley. Guests over the week-end in the home of Mrs. C. M. Evans were Mr. and Mrs. W. F. Ranson, Mr. and  Mrs. J. F. Ranson, Mr. and Mrs. R. O. Ranson, and daughter, j of Pangolin Mr. Mrs. C. S. i Ranson and son William, of Peters burg. Mrs. Jerry Smith visited in this home this week. C. M. Evans will spend the week end at his home here. Mr. and Mrs. Ray Houchens and son, of Petersburg spent Sunday with her parents, Mr. and Mrs. D. A. Conner. Mrs. Ola Willis m d Miss Edith Lucado, of Lynchburg spent Sun day with Mr. and Mrs. J. H. Luca do. Miss Doris Lucado end Dan Ruck er, of Richmond will dpend this week-end with Mr. and Mrs. J. H. Lucado. Mrs. T. U. Conner is visiting her sister, Mrs. W. S. Bryant, of Cullen. Mr. and Mrs. Frank Hanenkrat have moved into their newly com pleted home on Route 2. Miss Constance Fulp, of Rich mond was home last week-end. John Cheatham has returned to Frederick, Md. after spending two weeks in the county. Mrs. W. A. Thornhill, of Blue- held, W. Va. spent the week-end with her sister, Misse Patty Feather- ston. C. K. Hunter was in Blackstone Friday. Mrs. Barry Dahl and G. F. Ab- bitt Jr. weije business visitors in Charlotte Court House Saturday."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "home last week-end. John <mark>Cheatham</mark> has returned to Frederick,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "home last week-end. John <mark>Cheatham</mark> has returned to Frederick,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.9, 399.34, 1766.15, 892.33], "bbox_id": "5496100b8e", "file": "AppomattoxNewspapers_1908-1909a_0136.pdf", "page": 1, "text": "Who said It aint going to rain no more. We are Having plenty rain now. Some say te much, but we are neMitified. M n. Kate Cheatham, of near iustmirg, is visiting relatives near here- Mrs. Bettie Cawthorn is visit ing her son, Mr. Hector Caw- thorp, in Roraoke. Mp, DaniBl Jenniijgs has re- urned from a pleasant trip to loarmke. Mr. j and Mrs Blass Harvey, and ttle son, of W. VA, were 1 he guests of his home people ast Week. Mr. E. G. Godsey, of Roanoke,4 was be guest of Mr, and Mrs. J. J.Parrar, Sunday. Mffih Lonell Hamilton, and Mr. Sam Jennings, are visiting rela tives in Roanoke this week Mr. and Mrs. O. P. Farrar and frs. Austin were week-end visitms at the Beach last week- T h   re p c a  i a fine tiittb. Mp. and Mrs. J, D. Fleenor, and gaby Mrs. H. R. Johnson, and fwo little sons, and Mw,   Myers, of Bristol, Tenn.. are the pests of Mr.and Mrs- W. J. Smith this week. Mr. and Mrs. J. D. Fleenor, and Mr. M..J. Smith motored to Washington Mottdkjf Sn a plea sure trip. Mies Hal lie Burnett, of Vera, was the week-end guest of friends here last week."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "neMitified. M n. Kate <mark>Cheatham</mark>, of near iustmirg, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "neMitified. M n. Kate <mark>Cheatham</mark>, of near iustmirg, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.88, 414.95, 1791.0, 907.39], "bbox_id": "143cf31722", "file": "AppomattoxNewspapers_1926-1933a_0136.pdf", "page": 1, "text": "Who said It aint going to rain no more. We are baying plenty rain now.  Soque fay too, much, but we are never ratified.! Mrs. Kate Cheatham, of near Hustbjurg, is visiting relatives! near here. Mrs. Bettie Cawthorn is visit ingherson, Mr. Hector Caw thorn, in Roanoke. Mr, DaniBl Jennings has re turned from a pleasant trip to iloan.oke. Mr.,and Aifrs- Blass Harvey, and little son, of W. Va., were the guests of his home people ast week. Mr. E. G. Godsey, of Roanoke, was the guest of Mr. and Mrs. J. J. Parrar, Sunday. Miss Lonell Hamilton, and Mr. Sam Jennings, are visiting rela tives in Roanoke this week. Mr. and Mrs. O. P. Farrar and Mrs. Austin were week-end visitors at the Beach last week. Théy report a fine time. Mr. and Mrs. J. D. Fleenor, and baby, Mrs. H. R. Johnson, and tWo little sons, and Mrs. S. F. Mjyers, of Bristol, Tenn.. are the guests of Mr. and Mrs. W. J. Smith this week. Mr. and Mrs. J. D. Fleenor, and Mr. W. J. Smith motored, to Washington Motidy on a plea sure trip. Miss Hallie Burnett, of Vera, was the week-end guest of friends here last week."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "never ratified.! Mrs. Kate <mark>Cheatham</mark>, of near Hustbjurg, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "never ratified.! Mrs. Kate <mark>Cheatham</mark>, of near Hustbjurg, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.44, 1689.29, 2028.72, 1745.39], "bbox_id": "7d0d654592", "file": "AppomattoxNewspapers_1912-1915a_0593.pdf", "page": 1, "text": "who have beta visiting relativesFord Wreck Island hill on Beck-i rpke Lee Piano Company of here, returned to their home in  ham road, Jones hHl on Tower  Lynchburg is arranging for an ex- IBrunswick Countv last week Hill and Oakville road Bent Creeklhibit of fine pianos at Babcock s 1 7 hills near Bent Creek Cheatham Store beginning Friday, July 16th Mrs. Margaret Ann Moss, 581Mountain bill Rough Creek Free concerts will be given daily."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "hills near Bent Creek <mark>Cheatham</mark> Store beginning Friday, July"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "hills near Bent Creek <mark>Cheatham</mark> Store beginning Friday, July"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [546.23, 737.64, 693.21, 1086.97], "bbox_id": "3a67612db2", "file": "AppomattoxNewspapers_1962-1965a_0003.pdf", "page": 1, "text": "who has been j better. rs. E. W. Marshall, j Karen and Hunter and Mr. j s. Hugh Holt and Jean-  visited Paul and Ellen Nash  Monday night. Rev. Eli Layne visited in the home of Mr. and Mrs. Hunter Nash Wednesday evening. Mr. and Mrs. Paul Nash visit ed Mr. and Mrs. Clarence Jones Wednesday night. Mr. Glover Jones, of Sherwill, is a patient at a Lynchburg hos pital. Mr. Hunter Nash and Mr. Bu ford Nash and Dennis, of Gladys, spent Saturday at PET Gladys, Sepnt Saturday at Pet ersburg, attending the conven tion of wood cutters and saw millers. Mr. and Mrs. Jimmie Tibbs and Pat visited in Lynchburg Monday night. Mi-, and Mrs. Tommie Mar sh a ll and family, of Lynchburg, spent Monday with his parents. 1 Mr. and Mrs. E. W. Marshall. Sr. Mr. lar Cheatham is im-  proving nicely at the Virginia i Baptist Hospital where he is a I patient."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Marshall. Sr. Mr. lar <mark>Cheatham</mark> is im-  proving nicely"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Marshall. Sr. Mr. lar <mark>Cheatham</mark> is im-  proving nicely"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.08, 229.04, 1193.38, 979.91], "bbox_id": "022cae7961", "file": "TimesVirginian_1983a_0146.pdf", "page": 1, "text": "Whitten Park Avenue Chapel was in charge of arrangements. James D.Gnffl James D. Jimmy Guill, 68, of Route 4, Appomattox, died at 730 a.m. May 3, 1983 in Lynchburg General Hospital. He was the husband of Mrs. Maxine Martin Guill. jjjl - Born in Appomattox County April 10, 1915, he was a son of the Late Joel L. Guill and Bertha Carter Guill- He was a member of Memorial United Methodist Church and was a retired service station operator. In addition to his wife, he is survived by a step-daughter, Mrs. Thelma Scott Matthews, Harrison burg, a step-son, W. C. Story, Jr., Concord, three grandchildren, four great-grandchildren,three sisters, Mrs. Rachel G. Robertson and Mrs. Clara G. Mitchell, both of Appomattox, Mrs. Hester G. Witt, of Lynchburg, two brothers, Julian Guill, Appomattox and Dan Guill of Lynchburg. Funeral services will be conduct ed at 11 a.m. Thursday, May 5,1963 from Memorial United Methodist Church by The Rev. P. Edward Leonard. Burial will follow in Liberty Cemetery. Mary Lula Brown Lerner Mary Lula Brown Lerner, 79, of 1508 Florida Ave., Lynchburg, died at 410 p.m. Sunday, May 1,1963, at Lynchburg General Hospital. Her husband was the late William H. Lerner. Born in Appomattox County, she was a daughter of the late William W. Brown and Mittie Cheatham Brown. She was a former employee of Consolidated Textile Co. and a member of Bethesda Presbyterian Church. She is survived by five sons, William Lerner of-Edgewater, Md., James Lerner of Annapolis, Md., Clarence Lerner of Loxahatchee, Fla., Wallace Lerner of Daytona Beach, Fla., and Russell Lerner of Stevensville, Md. two daughters, Edith Brooks of Concord and Mary Mitchell of Lynchburg three brothers, David Brown of Newport News, Tom Brown of Brookneal and Russell Brown of Spout Spring three sisters, Etta Stanley, Betty Williams and Eleanor Wilkes, all of Lynchburg 25 grandchildren 29 great-grandchildren and one great- great-grandchild. Funeral services were conducted at 11 a.m. Wednesday at Whitten Park Avenue Chapel by the Rev. James Wood. Burial was in Fort Hill Memorial park. Whitten Park Avenue Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "W. Brown and Mittie <mark>Cheatham</mark> Brown. She was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "W. Brown and Mittie <mark>Cheatham</mark> Brown. She was a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2278.74, 1535.22, 2424.43, 1805.61], "bbox_id": "df3a8b7357", "file": "TimesVirginian_1976_0442.pdf", "page": 1, "text": "Westvaco employees have erected a new display outside their Court Street Office. We are hoping that the display will encourage people to use and enjoy live trees this Christ mas, said Westvaco forester Roy Cheatham. He pointed out that young, healthy Christmas tree plantations add to the well being of the environment by tempering wind, screening dust, preventing soil erosion, and providing wildlife habitat. Next , spring Christmas tree growers will replace the trees cut with new seedlings. Some folks have turned to plastic or tensil Christmas trees to avoid the danger of a drying-out cut tree. Dry trees are a very real fire threat that should not be ignored, but the solution to this problem need not be an artificial tree. A live"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "said Westvaco forester Roy <mark>Cheatham</mark>. He pointed out that"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "said Westvaco forester Roy <mark>Cheatham</mark>. He pointed out that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [542.16, 362.84, 714.26, 775.29], "bbox_id": "1912ab321f", "file": "AppomattoxNewspapers_1955-1957a_0015.pdf", "page": 1, "text": "West, Joyce Mitchell Fifth grade, Mrs. Cunningham Willu Fred Mayberry, Ted mer Phelps, Geraldir tricia Cheatham, Ca Mary Ann Franklin, Katherine Lewis, Hel Page, Linda Thomas. Fifth grade Mrs. Annie C. Cald well Kyle Aiinond, Claude Byers, Marvin Caldwell, Freddie Carter, Allen Conner, Rayford Fleshman, Steve Godsey, Freddie Grishaw, Jesse Johnson, Allen Lee Mayberry, Glenn McIntosh, Clifford Pugh, Frank Lee Thomas, Billy Trent, James Whitehead, Roy Woody, Ha zel Campbell, Juanita Hicks, Juan ita Maddox, Mary Lee Mayberry, Phyllis Jane Mayberry, Jacqueline Sarver, Sue Tucker. Fifth grade, Miss Mamie Cullop Blaine Carter, Donald Giles, Robert Goin, Wayne Mann, Danny Ray Moon, Thomas Pankey, Buddy Wilcox, Phyllis Almond, Marlene Barger, Mary Wilkins Booth, Bar bara A. Carter, Hazel Fields, Mag gie Ferguson, Betty Goin, Betty Hash, Mary Lou Jamerson, Joan Moses, Brenda Nash, Florence Wat son, Rachel Snow, Linda Nash. Fourth grade, Mrs. Thelma W. M artin Donald Brown, Harold Car ter, Earl Day, Tom Evans, Wayne Ferguson, Doug Mitchell, Mike Mitchell, Cecil Phelps, Wayne Phelps, David Reed, Richard Smith,    Wright,"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "mer Phelps, Geraldir tricia <mark>Cheatham</mark>, Ca Mary Ann Franklin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "mer Phelps, Geraldir tricia <mark>Cheatham</mark>, Ca Mary Ann Franklin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [480.94, 267.71, 640.84, 519.5], "bbox_id": "5f52b33d51", "file": "AppomattoxNewspapers_1898-1902a_0342.pdf", "page": 1, "text": "Wesley Chapel. Some of ns are anticipating quite a pleasant time at the Association his week, since the rain has laid the dust so nicely. Mrs. Henrietta W. Cheatham is siting her daughter, Mrs. H. E. Clarke, in Lynchburg. The revival begins at Wesley on Sunday next. Rev. W. J. Williams, of Red House, will assist Mr. Bell. Mrs. H. Drinkard, of Bedford, is visiting her people in this vicinity. Melons and croquet seem to be the chief means of occupying our pleas- iit afternoons at preeeut. 1 believe that everybody has had i good time this summer, more or less, and it will go a little hard, no doubt, with some of us to give up our pleasant, free-and-easy life that ue have been leading, and to take up again our old routine life but we cannot have all  sunshine and roses."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "nicely. Mrs. Henrietta W. <mark>Cheatham</mark> is siting her daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "nicely. Mrs. Henrietta W. <mark>Cheatham</mark> is siting her daughter,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [581.08, 676.87, 726.85, 1050.59], "bbox_id": "8ceabefa9d", "file": "TimesVirginian_1976_0223.pdf", "page": 1, "text": "were Trudy Jane Harris, Dana Moore, Michael Marshall, Dean Jamerson, Laurie Cowan, Wen dy Gagneur, Bruce Carter, Clarence Gilliam, Ken Baldwin, Chris Tolley. Timmy Franklin, Cynthia Johnson,David OBrien Bobby Carter, Bettina Moore, Mike Seamster, Kevin Martin, Wendy Lee, Sharon Cheatham, Dianne Brown, Darrell Moore, Cindy McCormick, Penny Cun- eo, and Denise Jackson. 4-Hers receiving white a- wards were Warren Baldwin, Carolyn Morgan, Joe Crews, Carrie Pennington, Margaretta Flood, Eric Mason, Ricky Garrison, Todd Nash, Larry Mann, Rhonda Seay, Sheri McCormick, Scott Jordan, Timmy Garrison, Kenneth Wayne Spradlin, Danny Ham- lett, Malcolm Miller, Connie Webber, Jason Cobbs, Barry Hamlett, Abraham Chambers, James Morgan, Karen Carter, Kathy Parsons and Carolyn Chandler. We Sell. RUBBER STAMPS  PADS Times-Virginian Front Entrance"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Martin, Wendy Lee, Sharon <mark>Cheatham</mark>, Dianne Brown, Darrell Moore,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Martin, Wendy Lee, Sharon <mark>Cheatham</mark>, Dianne Brown, Darrell Moore,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1491.09, 1309.1, 2145.85, 1440.2], "bbox_id": "1079053963", "file": "AppomattoxNewspapers_1905-1912a_0279.pdf", "page": 1, "text": "went from this school last year, The President of the schools reply as follows Entered well and is Mildred OBrien, Virginia an unusual student for a first year son, Alice Cheatham, man, Bays University of Virginia I 1st year high schoolEarl Far- ahout Jamie Gills. Mr, Gills r a r , Frank Cole, entered 3B English, the highest I 2nd year high schoolSnsie Han English given for A. B. degree. I Cock, Don Moses. . Frank Harwood made all his class J 3.d year_ high schoolLobelia  4 es and is a most excellent student, Drinkard, Walter Dnrham, Wilmerjl ...................... t t fl IT .............. .. ............................................... ........... .. says his President. George Turns  Smith   --------- -------"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "first year son, Alice <mark>Cheatham</mark>, man, Bays University of"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "first year son, Alice <mark>Cheatham</mark>, man, Bays University of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1384.31, 362.66, 1561.08, 1384.52], "bbox_id": "fe93e5ad19", "file": "AppomattoxNewspapers_1933-1936a_0001.pdf", "page": 1, "text": "Well, well, lets see vhat there is to chronicle tonight? Whither, vaulted columnar ver nacular?    First, J. H. Cheatham had a birthday yesterday. He was down on the streets before 7 oclock doffing his sombrero in token of 68 birthdays. Yas sah. And Len Smith and W. M. Hancock had birthdays togeth er Chooseday . . . 69 I do bow- lieve.    Then, theres that fishing party of Tuesday. Our Col. Joel, E. T. Mitc.hell, J. H. OBrien, aided and abetted to- wit, wherewithal and whereas by Watkins Abbitt, garnered their earthworms and, hied away to Horseleys Pond, wherever that is. The Col. mussed up his shirt front with a sun perch. Cope teste, Father Darkleaf, et cafeteria.    Nfurthermore, theres the case of the right Rev. Lee. Hes dean of the colored parsons in Roanoke. Happened to be here attending court last week and when a pair of matrimonial- bound colored folks applied for a license said Rev. Lee was called in to do the honors right in the clerks office. Vo-do-de- o-do.    Theres something, it might be chronicled, whimsical about a bathrobe. Father Darkleafs favorite is one used for eleven years. Had several given me since I got thatbut my bones and joints dont feel right in em.    And orchids to Mother Bright- leaf. Shes twenty-seven cents on the blue inc side of our bud get for June. And keeps her ledg r like a veteran, she does. And I like the fare better than Delmonicos.    Oh yes, I forgot, the colored couples names were Perry Nathenial Brown and Annie Lee Mins. Thats the sort of a reporter I am .   and the parsons initials are W. E., since Im being downright accurate.    And folks, Im warning you, Mather Brightleaf is hot after back subscribers. And when I told her about the way folks wouldnt Subscribe for them selves but borrowed. their neighbors paper, she turned up her nose, she did and said, The stingy things. One subscriber on one of the routes this week said he had to put up with four families borrowing his Times- - Virginian. Scallions and ashes.    George Peery no doubt real izes hes gonna be the next governor, but hes taking no chances. Has a plaque on hijP office wall containing four-leaf  clovers, horse-shoes and a rab bits foot.    Lots of suckers will bet on on the big prize fight tonight. The only thing I ever bet on was when I called Mother Brightleafs bet that my mother didnt serve oatmeal for break fast. Proved it too, by heck."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "nacular?    First, J. H. <mark>Cheatham</mark> had a birthday yesterday."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "nacular?    First, J. H. <mark>Cheatham</mark> had a birthday yesterday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1184.15, 553.54, 1354.56, 613.23], "bbox_id": "8c33f0e929", "file": "AppomattoxNewspapers_1947-1949a_0449.pdf", "page": 1, "text": "Well, the affair was sponsored toy Mrs. Frances Cheatham and her Spanish classes, so four girls from Puerto Rico who are attending Longwood College at Farmville were special guests."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Well, the affair was sponsored toy Mrs. Frances <mark>Cheatham</mark> and her Spanish classes, so four girls from Puerto Rico who are attending Longwood College at Farmville were special guests."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Well, the affair was sponsored toy Mrs. Frances <mark>Cheatham</mark> and her Spanish classes, so four girls from Puerto Rico who are attending Longwood College at Farmville were special guests."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.61, 1105.93, 1710.33, 1177.68], "bbox_id": "2bd2165a8d", "file": "AppomattoxNewspapers_1908-1909a_0079.pdf", "page": 1, "text": "well, Lena NbÙ, Monk and Lin cile Bates, Frances Smith. Lu cile Marshall Eula Mae Burke,! Mrs, W. T. Steele, R. L. Burke, Mr and Mrs. G. Cheatham, Mrs. Durpby, Mrs"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Mr and Mrs. G. <mark>Cheatham</mark>, Mrs. Durpby, Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Mr and Mrs. G. <mark>Cheatham</mark>, Mrs. Durpby, Mrs"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [976.11, 241.11, 1135.79, 501.05], "bbox_id": "18f6e2fb0b", "file": "AppomattoxNewspapers_1926-1933a_0541.pdf", "page": 1, "text": "well, after a weeks visit with her grandmother, Mrs Bob Poe Mr. and Mrs. John Brewer, of Hopewell and Mr. and Mrs. Garnett Foster, of Charlotte, were week-end visitors in the home of Mr. and Mrs. Bob Poe. Mr. Clyde Woodson has ac cepted a position in Williams burg. We shall miss him from our community Miss Mildred Marshall h a s- returned home after a weeks visit with her aunt, Mrs Del Howerton, of Spout Spring. Mr. Herman Marshall of Lynchburg, spent Sunday with his parents, Mr. and Mrs. John Marshall. Mr. and Mrs. Ben Newman, Mr. and Mrs. E G Cheatham and little daughter, Alice, visit ed relatives in Roanoke Sunday a week ago."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mrs. E G <mark>Cheatham</mark> and little daughter, Alice,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mrs. E G <mark>Cheatham</mark> and little daughter, Alice,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.34, 1229.44, 2050.51, 1269.44], "bbox_id": "a1f00ceb8a", "file": "AppomattoxNewspapers_1947-1949a_0109.pdf", "page": 1, "text": "Well, adiosas Mrs. Cheatham would sayuntil next week when well be back with more news from A. H. S."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Well, adiosas Mrs. <mark>Cheatham</mark> would sayuntil next week when well be back with more news from A. H. S."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Well, adiosas Mrs. <mark>Cheatham</mark> would sayuntil next week when well be back with more news from A. H. S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.63, 1662.16, 1616.89, 1805.81], "bbox_id": "85ec05fc6a", "file": "AppomattoxNewspapers_1962-1965a_0183.pdf", "page": 1, "text": "weeks seniors, now graduates of Appomattox High  afe spending the summer days applying for per- work  already working on summer jobs, or lazily t the good-weather. Theres college or technical train- for about 25 out of the 75 graduates pictured above, right on first row are Robert Brown, James Harse. whitehead, Pat Wells, Nancy Jo Kidd, Blaine Carter,  urks, Harry Ranson, John Harrison, and Tony Mann, second row are Margaret Johnson, Linda Thomas, helps, Thomas Richardson, James McCormick, Robertson, Mary McClenny. Randoph Smith, Kyle  ,chrd Harris, John Alvis, Mary Ranson. In the .7 Ahen Conner, Thacker Cheatham, Bill Stratton, vrawley, Mary Watkins Booth, and Barbara Thomas."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "7 Ahen Conner, Thacker <mark>Cheatham</mark>, Bill Stratton, vrawley, Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "7 Ahen Conner, Thacker <mark>Cheatham</mark>, Bill Stratton, vrawley, Mary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.22, 470.48, 2344.06, 979.81], "bbox_id": "83c0838ac6", "file": "TimesVirginian_1983a_0280.pdf", "page": 1, "text": "week with his daughter in the home of Mr. and Mrs. E. C. Howard of Greensboro, N.C. Mr. and Mrs. Winifred Nash and family attended the Nash reunion on Sunday. Mr. and Mrs. Roy Cheatham and boys spent last weekend with Mr. and Mrs. Billy Moore and son. Mr. and Mrs. Lankford Torrence. Mr. Walter Jordan and Mrs. Mattie Pillow spent last week in Pennsylvania. Mr. and Mrs. Raymond Mullins and boys spent last week vacationing at Bugs Island. George D. Nash and son Jeff visited in the home of Elliott Nash Monday night. Mrs. Elliott Nash, Dawn Kerr and Stacey Howard visited Mrs. Fannie Kerr Saturday night. Mr. and Mrs. George Inge of Chester, Va. visited Mr. and Mrs. Richard Nash Tuesday. Wendy Nash spent last week with Mr. and Mrs. David Carson, Susan and Ryan. Mr. and Mrs. Winifred Nash attended the Turner and Dudley wedding at Evington Saturday. Mrs. Nash is the sister of Mr. Dudley. Mrs. Laura Ferguson spent Sunday with Mr. and Mrs. Lowell Owens. Frank Moore visited in the home of Richard Nash Sunday. Mrs. Lelia Mann is in the Lynchburg hospital for treatment. We wish her a speedy recovery. Robin and Stewart Mann are spending this week with Mr. and Mrs. Henry Mann. Visitors of Mr. and Mrs. Raymond Mullins and boys were Mr. and Mrs. Jerry Hollingsworth and family, Mr. Jr . Reynolds and friend and Mrs. Rosser Reynolds."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Mr. and Mrs. Roy <mark>Cheatham</mark> and boys spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Mr. and Mrs. Roy <mark>Cheatham</mark> and boys spent last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2252.11, 509.47, 2397.52, 1013.86], "bbox_id": "10e2d2def4", "file": "AppomattoxNewspapers_1962-1965a_0611.pdf", "page": 1, "text": "Week of Prayer for Home Mis sions is in progress at Baptist Church this week. Those visiting Mr. and Mrs. Z. E Cheatham last week were Mr. and Mrs. L. M. Ringham, of Lynchburg, and Mr. and Mrs. .1. D. Morris, of Amelia. Our deepest sympathy goes to the family of Mr. W. C. Gar rett, who passed away last Sat urday. Mr. and Mrs. H. C. Staples, Jr. and daughter, Janet, of Rich mond, spent the week end with his parents, Mr. and Mrs. H. C. Staples, Sr. Mrs. W. E. Warriner is still on the sick list, also Mrs. O. C. Paulette. Hope they will soon be much better. Those who visited Mrs. Ryland Staples and family and Mrs. O. C. Paulette Sunday were Mrs. L. E. Thomas and dauhter, Barimra Mr. and Mrs. Roy K e y s , Appomattox Mr. and dMrs. J. E. Paulette, of Madi son Heights. Mrs. Z. E. Cheatham visited re latives in Gretna Saturday. Mr. and Mrs. Cecil G .Wool dridge, of Palmyra, spent the week end with his parents, Mr. and Mrs. L. F. Wooldridge. Mr. and Mrs. S. D. Thompson, of Lynchburg, spent Saturday with her parents, Mr. and Mrs. G. W. Glover. Mr. and Mrs. Courtney Frank lin and dauhter, Virginia, Jes se Franklin, Jr. and Virginia Lee Franklin spent the weke end at Norfolk visiting Mr. and Mrs. Donald Jones and family, Mr. and Mrs. Otis Franklin and fam ily. Mrs. Katie Austin, of Phenix .spent last week with her daugh ter and family, Mr. and Mrs. Lewis Harvey and daughter. Mr. and Mrs. Curtis Morris and family, of Richmond, spent the week end their parents,"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z. E <mark>Cheatham</mark> last week were Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z. E <mark>Cheatham</mark> last week were Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1921.45, 1107.26, 2082.2, 1247.8], "bbox_id": "80509e606c", "file": "AppomattoxNewspapers_1915-1918a_0091.pdf", "page": 1, "text": "week. Miss May Lerner visited her home people here last week. Mrs Mary A. Ryan and her two little grand - children, Ruby Cheatham and Tommy Ryan, visited Mr. H- Jt. Ryan at Reusens, Va., last week. A very sad accident ocotred near here on Christinas eve, in Mr. R. D. Thompsons store- Two colored -men -became in-"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "little grand - children, Ruby <mark>Cheatham</mark> and Tommy Ryan, visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "little grand - children, Ruby <mark>Cheatham</mark> and Tommy Ryan, visited"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1888.29, 1076.68, 2059.79, 1300.28], "bbox_id": "0a453431b3", "file": "AppomattoxNewspapers_1939-1943a_0029.pdf", "page": 1, "text": "Wednesday to resume his studies at V.Myi. Mry and Mrs. Harry Hayden, of New York, spent Friday with Mr. and Mrs. Z .E . Cheatham. Mr. and Mrs. Calvin Coleman, of Blackstbha visited his parents on Sunday. A Mrs. H. C. Staples attended an all-day adult teachers meeting in Farhiville Friday.Miss Virginia Gre gory, of Richmond was the principal speaker January is a good time to sow poppy seed Jusb scatter the tiny seed thinly, they need scarcely any covering. If sown thinly, the plants may be successfully transplanted if one will use a. trowel when the soil is moist, so as not to disturb the roots. I have a few more seed to distribute."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z .E . <mark>Cheatham</mark>. Mr. and Mrs. Calvin"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Mrs. Z .E . <mark>Cheatham</mark>. Mr. and Mrs. Calvin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [577.45, 623.09, 726.35, 1010.88], "bbox_id": "6f1289625e", "file": "AppomattoxNewspapers_1962-1965a_0478.pdf", "page": 1, "text": "Wednesday is the day for our children to go back to school. Most of them are happy. Mr. F. J. Nash is in the hos pital. Hope he will be well soon. Mrs. Margaret Marshall has returned home. Hope she is feel ing better. , Miss Pat Tibbs spent Satur day night with Jeanie Holt. Mr. and Mrs. L. M. Tibbs visi ted his parents Mr. and Mrs. R. B. Tibbs, of Mike, Sunday. Mr. and Mrs. Morris Hodnett, of Rustburg, were Sunday dinner guest of Mr. and Mrs. Hugh Holt. Miss Anna Lou and Emma Sue Howerton, of Lynchburg, spent a few days with Mrs. Nannie Marshall. Mr. Joe Howerton has return ed home from the hospital. Mr. and Mrs. E. W. Marshall, Jr., Karen and Hunter motored to Washington, D.C. For sight seeing and visited with Mrs. T.  R. Gray. Mr. and Mrs. Raymond Nash visited Mr. and Mrs. Frank Nash Sunday. Mr. Edward Cheatham and j girls visited Mr. and Mrs. Harry Nash Sunday afternoon. In my trip to D. C. we were signing in at the motel, we gave our address as Spout Spring, Va. and the clerk wanted to know if we had a street address."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Nash Sunday. Mr. Edward <mark>Cheatham</mark> and j girls visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Nash Sunday. Mr. Edward <mark>Cheatham</mark> and j girls visited"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [459.6, 1692.64, 604.11, 1820.48], "bbox_id": "1bd3bcd2a9", "file": "TimesVirginian_1978_0322.pdf", "page": 1, "text": "We would like to take thi opportunity of expressing our sincere appreciation to friends and relatives for prayers,, cards, visits, flowers, food, phone calls, and all - acts of kindness shown during the illness and death of Z. E- Cheatham. May God bless each of you. The Family of Zack Cheatham 7-20-ltp"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "death of Z. E- <mark>Cheatham</mark>. May God bless each"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "death of Z. E- <mark>Cheatham</mark>. May God bless each"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.86, 1776.5, 1645.76, 1847.04], "bbox_id": "be5b05790a", "file": "AppomattoxNewspapers_1926-1933a_0135.pdf", "page": 1, "text": "We wish to thank our friends f ar the kindness and sympathy shown us during the recent ill ness and death of our mother, also for the beautiful floral de signs. - Mrs. J. H- Cheatham, C. T. Evans,"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "signs. - Mrs. J. H- <mark>Cheatham</mark>, C. T. Evans,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "signs. - Mrs. J. H- <mark>Cheatham</mark>, C. T. Evans,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.37, 380.54, 2010.86, 689.68], "bbox_id": "fb047e644f", "file": "AppomattoxNewspapers_1926-1933a_0367.pdf", "page": 1, "text": "We wish to thank all neigh bors and friends for the kind- Bloomer girls play Pamplin ness and sympathy shown us ball team at Pamplin next during the illness and death txt j j i.o.QA of our sister, Mrs. Bingham Wednesday at 330. Murrell. Gladstone ball players play Her Sisters, morning and afternoon games here today. Miss Virginia Puckett and Mrs. Arthur Irby delightfully Dick Puckett are visiting rela- entertained with bridge and rook tives near Cullen, Va. in honor of her visiting guest,  j Miss Nelta Irby, , of Blakstone, Mr. Tucker Cheatham, ot y a fte several games were Madison, Wis., is visiting his paye prizes were awarded, parents at Appomattox Hotel, rpjjg high score prize for bridge Miaa Earle Patteson is spend- fell to Ml Virginia Twymai. ,, , , -v, Ruth and the booby prize to Miss Ann ing the week with Miss Ruth The high gcore prize in Shephard at Buckingham C.H. was won by Homer Bab- Mr. and Mrs. Sam Fergu- cock and the booby by Miss Net- son, of Lynchburg, are spend- ta Irby. After the delightful ing their vacation with rela- games delicious refreshments tives in this county. were served. Last week Mrs. D. N. Twy- Miss Loveline Bryant, of man entertained at the hall for"}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "of Blakstone, Mr. Tucker <mark>Cheatham</mark>, ot y a fte"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "of Blakstone, Mr. Tucker <mark>Cheatham</mark>, ot y a fte"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1795.5, 1155.25, 1963.91, 1214.44], "bbox_id": "608b2d501a", "file": "AppomattoxNewspapers_1947-1949a_0346.pdf", "page": 1, "text": "We wish the best of luck to Vir ginia, Joyce, Mary Ellen and Sonny on their tiip to Richmond for the SCA convention Friday and Satur day. Mrs. Cheatham will also at tend the convention."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "and Satur day. Mrs. <mark>Cheatham</mark> will also at tend"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "and Satur day. Mrs. <mark>Cheatham</mark> will also at tend"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2319.58, 447.93, 2490.45, 577.92], "bbox_id": "b240b2d485", "file": "AppomattoxNewspapers_1939-1943a_0345.pdf", "page": 1, "text": "We welcome back to our com munity Misses Mary Mills, Mary West and Katherine Mathews, mem bers of the Stonewall faculty. Mrs. George Cheatham and daugh ter, Nancy, and Miss Elva Stratton, of Apponnaittox, spent the week end at their home here. Mr. and Mrs. Elkon Hamilton, of Lynchburg, were guests Sunday of his parents, Mr. and Mrs. B. W. Hamilton."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "Stonewall faculty. Mrs. George <mark>Cheatham</mark> and daugh ter, Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "Stonewall faculty. Mrs. George <mark>Cheatham</mark> and daugh ter, Nancy,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [148.8, 222.39, 331.93, 1666.13], "bbox_id": "c3a1b4e7a6", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "We w ere sad d led when word came Sunday that Mr. W. M. Blade had passed away. Our love and deepest sympathy are extended her loved ones. Our prayers and sympathy are with the family and loved ones of Mr. Zack Cheatham, who passed away last week. We were very sorry to learn of the illness of Mrs. Sandy Baldwin of North Dakota. Our sincere prayers are with her and each of the family. We were very sorry to hear of the death of Mrs. Alfred LeGrande. Deepest sympathy is extended her loved ones. Mr. James Maxwell returned home Friday from the hospital. We wish for him a very speedy recovery. The families of the late Mi. and M rs. W. L. Turnes celebrated their family reunion Sunday at the home of Mrs. J. L. Torrence. Mr. H. W. Jenkins and son, Mr. Robert Jenkins attended the funeral of Mrs. Ossie Key of Bedford Saturday. She was a very dear relative of the late Mrs. H. W. Jenkins. Mr. and Mrs. Bill Watson and family returned home Friday after spending their vacation at W illiamsburg and Virginia Beach. Visiting Mr. and Mrs. Robert Coleman last week were Mr. and Mrs. Calvin Smith, Bobby and Tammie Smith. Visiting MrJ and Mrs. Scott Sheets several days last week was his sister, Mrs. Violet Pittsinger of Eaton, Ohio and Mr. and Mrs. Paul Sheldon of Columbus, Ohio, Mr. and Mrs. Edward Greer and family are visiting in the home of Mr. and Mrs. L. L. Webb and family. Visiting Mr. and Mrs. L. H. Watson Sunday were Mr. and Mrs. Raymond Franklin, Mr. and Mrs. W. H. Wingfield, Miss Julia Wingfield and Mr. and Mrs. Eddie Wooten and son. Among others visiting in this home last week were Mr. and Mrs. Berkley Drinkard and family, Mr. and Mrs. Berkley Brown, Mr. and Mrs. Walker Shupe, Mr. Alfred Almond and Mr. and Mrs. Alton Lucado and family. Mrs. B. B. Harris, Sr. was a visitor Monday night of Mrs. Virgie Beasley, Mrs. Claude Hamlett and daughter Brenda spent Friday with M rs. Beasley. Mr. and Mrs. George Inge of Chester, VA visited her Saturday and Mr. Grover Beasley, Jr. visited her Sunday. Mrs. Holly Cawthom, Mrs. Rachel Cawthorn and Mrs. Raymond Harris were visitors in the homes of Mr. H. W. Jenkins, Mr. and Mrs. L. H. Watson and Mrs. Mary Bagby, Wednesday evening. Mr. and Mrs. A. B. Franklin, Jr. and family of Chase City were visitors Thursday after noon of Mr. and Mrs. R. M. Webb and family. Mrs. Elmo Smith recently spent a week with her sons at Grottos, VA. Mr. Smith spent the week end in this home. Mr. and M rs. Ryland M ayberry and M rs. loan Mayberry of Newport News spent the week end in the homes of Mr. and Mrs. Kenneth Deaner and family and Mr. and Mrs. Roy St.John. The W. H. Wingfields visited in the homes of Dr. and Mrs. Tom Sumaker and family and Mr. and M rs. Billy Inge Wednesday night. Dinner guest Thursday of Mrs. Mary Bagby were Mrs. Mary Higgins, Mrs. Shirley Carson, Mrs. Loveline Scruggs, Mrs. Katherine Wingfield, Mrs Ruby Woodall and daughter Tj. Calling in this home last week w ere M rs. M. L. Covington, Mrs. Andy Davis, Mrs. loan Mayberry, Mrs. Kenneth Deaner. Miss Dawn Deaner, Mr. H. W. Jenkins, Mrs. Shirley Franklin and daughter. Pamela. Mr. and Mrs. Frank Scham- pel were visitors Sunday night of M. and M rs. W. H. Wingfield and family. Mr. and Mr- K enneth Deaner and family. Mrs. loan Mayberry and Mr. And Mrs. Ryland Mayberry spent Sun day in Roanoke with Mr. and Mrs. Kenneth Wingfield and family. They celebrated Mr. Wingfields birthday Sunday with a lovely dinner. I Mr. and Mrs. James Woodall Visited Mr. and Mrs. Thomas Woodall and family and Mrs. Mary Bagby Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Cheatham"], "snippet": "ones of Mr. Zack <mark>Cheatham</mark>, who passed away last"}}, "highlights": [{"field": "text", "matched_tokens": ["Cheatham"], "snippet": "ones of Mr. Zack <mark>Cheatham</mark>, who passed away last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
