{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "clerk", "Bocock"], "snippet": "instead of by election. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, first <mark>clerk</mark> Thomas S. <mark>Bocock</mark>, first"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "clerk", "Bocock"], "snippet": "instead of by election. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, first <mark>clerk</mark> Thomas S. <mark>Bocock</mark>, first"}], "text_match": 2314894167458709625, "text_match_info": {"best_field_score": "4419510861824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167458709625", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "clerk"], "snippet": "on the death of <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, the first <mark>clerk</mark>, he was succeeded by"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "clerk"], "snippet": "on the death of <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, the first <mark>clerk</mark>, he was succeeded by"}], "text_match": 2314894167324491897, "text_match_info": {"best_field_score": "4419510796288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167324491897", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "Clerk"], "snippet": "steady and peaceful growth. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, the first <mark>Clerk</mark>, died soon after his"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "Clerk"], "snippet": "steady and peaceful growth. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, the first <mark>Clerk</mark>, died soon after his"}], "text_match": 2314894167324491897, "text_match_info": {"best_field_score": "4419510796288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167324491897", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "clerk", "Bocock"], "snippet": "term of th court, <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>f the firs <mark>clerk</mark>, died and Henry F. <mark>Bocock</mark> his son, was named"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "clerk", "Bocock"], "snippet": "term of th court, <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>f the firs <mark>clerk</mark>, died and Henry F. <mark>Bocock</mark> his son, was named"}], "text_match": 2314894166921838713, "text_match_info": {"best_field_score": "4419510599680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894166921838713", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.07, 588.56, 2499.2, 1436.07], "bbox_id": "b2e07345fe", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "fty Calvin Robinson Clerk of the Circuit Court of Appomattox County, has submit ted his resignation, effective as of July 15. Smiths resignation was motivated by reasons of health and came with four years remaining in his current term of office. The resignation was submitted to Circuit Court Judge George F. Abbitt. Mr. Smith was bom In Fred erick County, Maryland, son of the late Mr. and Mrs. M. C. Smith. The family moved to Ap pomattox in 1907. He began his distinguished service in the Clerks office Feb. 8, 1908, as a Deputy Clerk under toe late John Rolfe Horsley. He became Clerk in 1919 and was elected to that Office in the fall of that year, and was re-elected, without op position in the county elections Of 1927, 1935, 1943, 1951 and 1959. This is thought to be a record for the State and indicative of the high respect and esteem In which he is held and reflects tribute to the efficiency and high quality of public service render ed. Since its establishment in 18- 45, Appomattox County has had six County Clerks John T. Bo- cock, Henry F. Bocock, Geo. T. Peers, George W. Abbitt, John Rolfe Horsley and Mr. Smith. In addition to his career aa Clerk, Mr. Smith has been most active in community, county and Church affairs. He was one at the drigttler of toe Appomat tox Light it Power Company In 1922. He wrote tf -Charter for the Town of .Appomattox when it was incorporated in 1925. He has served as Vice-President and Chairman of the Board of The Bank of Appomattox. He has served as Chairman of the Official Board of Memorial Methodist Church for 14 years served as Church Treasuer for 30 years. Superintendent of the Church School for 42 years and as a merriber of Monroe Lodge 301 AF  AM, Woodmen of the World and Appomattox L i o n s Club. In October of 1915, he was married to Miss Lucye Cabell Foster, who is an outstanding leader in local civic and church affairs. On toe occasion of the Cenn tennial of the forming of Appo mattox County in 1945, Mr. Smith wrote a splendid history of toe! county, which was widely dis tributed in booklet form. Despite the press of his many duties, he has found time for his favorite hobby, that of gardening, and his flower garden has been a show- place of the community. In World War II he served on the Appomattox Selective Service Board and through the years, Whenever the Community and! county needed the services of this modest and capable leader. The American Cancer Socle tys Appomattox unit will meet he has assumed assignments of Thursday at 730 p.m. at the responsibility. Farmers National Bank. All Mrs. Aldah B. Gordon, Deputy devoted almost an entire issue j board members and volunteers and Mrs. Joel W. Flood, assis- to Appomattox using the subject are urged to attend. I Continued on Page 3 title, Eighty-eight Years Later -- -----------------------------------  ------------------------"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "T"], "snippet": "had six County Clerks <mark>John</mark> <mark>T</mark>. Bo- cock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, George"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "T"], "snippet": "had six County Clerks <mark>John</mark> <mark>T</mark>. Bo- cock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, George"}], "text_match": 2312642367376588921, "text_match_info": {"best_field_score": "3319999102976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367376588921", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Bocock", "T", "John"], "snippet": "T. Bocock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, Geo. W. Abbitt, <mark>John</mark> Rolfe Horsley and Claude"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "T", "John"], "snippet": "T. Bocock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, Geo. W. Abbitt, <mark>John</mark> Rolfe Horsley and Claude"}], "text_match": 2312642367242371193, "text_match_info": {"best_field_score": "3319999037440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367242371193", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [536.13, 1099.95, 694.23, 1313.1], "bbox_id": "950b937251", "file": "AppomattoxNewspapers_1892-1898a_0201.pdf", "page": 1, "text": "roe A.G. Mo -.-plaintiff! AGAINST. Wra. A. Cabell aimr. of N. F. Bocock decd. ctavia K. Bocock. Henry Gibbs and Rosa hi ife, John N. F. Bocock. Sallie P. Bocock. rank W. Bocock. Victoria E. Curley in her irn rifrbr and as admr. of James S. A lie eed. Mattie Allen. Ben Shaw Allen, Joh lien and James Allen, the last four name eing infants....................................defendant! The object of this suit is to obtain a deed onveying lots Nos. 5 and 6 in the town of Masille in Buckingham county, Va., tc Wm. A. Moss, Jr., A.G. Moss, M. S. Matthew aisy A. Moss. Frank B. Moss and C. F. Mo hey being the parties entitled thereto. And 3 affidavit having been made and filed that the defendant Frank W. Bocock is not a resi- ent of the State of Vinrinia.it is ordered that e do appear here within fifteen days after ue publication hereof, and do what may be eccssary to protect his interest in this suii And it is further ordered that a copy hereof be published once a week for four successive reeks in the A ppom attox and B uckingham D im es , and that a copy be posted at the front loor of the Court House of this county on the irst day of the next term of the county ourt. A copv T este P. A. F o r bes , Clerk. E. W. H ubard , p. q."}, "highlight": {"text": {"matched_tokens": ["John", "Bocock", "Bocock"], "snippet": "and Rosa hi ife, <mark>John</mark> N. F. <mark>Bocock</mark>. Sallie P. <mark>Bocock</mark>. rank"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Bocock", "Bocock"], "snippet": "and Rosa hi ife, <mark>John</mark> N. F. <mark>Bocock</mark>. Sallie P. <mark>Bocock</mark>. rank"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
