{"document": {"bbox": [756.5, 1146.89, 914.75, 1954.17], "bbox_id": "af115bb7da", "file": "AppomattoxNewspapers_1898-1902a_0451.pdf", "page": 1, "text": "Unusually Large A ttendanceInter esting M urder Trial. There was au unusually large at tendance of the sovereigns from every part of the county on last Thursday, the regular term of the County Court. Mauy of them were doubtless attracted by the wide spread interest in the trial of the negroes George Flowers aud Charles Robertson who had been indicted aud imprisoned for the murder of Bob Boler near Spout Spring, on the uight of the 4th of January last. The parties indicted and the import ant witnesses had all made fiatly contradictory statements and an im penetrable mystery seemed to overhang the tragedy. There bad been a negro frolic and dance, the parliciputs, male and female,- be coming uproarious from whiskey. On the way home Bob Boler, Letitia Carson, George Flowers aud Charles Robertson were walking together apart from the othei s. A scuffle en sued between George Flowers and Bob Boler they were separated aud the puny walked on a few paces when pistol shots were heard and Bob Boler fell to the ground mort ally wounded, ana his dead body was left in the middle of the road. These were all of the facts about which there was direct, uncontra- dicted testimony. A jury was empannelled in the case of George Flowers, without de lay or difficulty,consisting of the fol io wiug persons F. G. Thorpe, C. M. Diiukard, Seaborn Gilbert, Fielding Rogers, Ro. W. Morris, Jas. W. Paris, Samuel J. Lee, Samuel Rauson, P. H. Wooldridge, T. L. Cralie, W. T. Marshall, and Alouzu Hamilton. Mr. S. L. Ferguson, the uewly appointed Commonwealths Attorney, assisted by Hon. H. D. Flood, prosecuted the case and Col. R. B. Poore defended the accused. Mr. Fergusou managed the case with ability and gave abundant evi dence that he will make an efficient States Attorney. Col. Poore and Mr. Flood threw their utmost ener gies iuto the case, aud it is unneces sary to add that their efforts were vigorous and brilliant. The case occupied two days, and on Friday alternoou the jury brought in a ver dict of guilty and awarded the ac cused tea years in the peuitentiary. The counsel for the Commonwealth demanded only a verdict for murder iu the second decree, for which the punishment is confinement in the penitentiary admitting to the jury that they were unable to establish the ingredient of premeditation necessary - to elevate the homicide to murder iu the first degree. Col. Poore moved the Court to set aside the verdict and award the prisoner a new trial, upon the following grounds First That the verdict was con trary to the law and the evidence. Second That .he Attorney for tbe Commonwealth commented on the fact that the prisoner was not"}, "highlight": {"text": {"matched_tokens": ["L", "Ferguson", "Commonwealths", "Attorney"], "snippet": "Alouzu Hamilton. Mr. S. <mark>L</mark>. <mark>Ferguson</mark>, the uewly appointed <mark>Commonwealths</mark> <mark>Attorney</mark>, assisted by Hon. H."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Ferguson", "Commonwealths", "Attorney"], "snippet": "Alouzu Hamilton. Mr. S. <mark>L</mark>. <mark>Ferguson</mark>, the uewly appointed <mark>Commonwealths</mark> <mark>Attorney</mark>, assisted by Hon. H."}], "text_match": 2891363715586719865, "text_match_info": {"best_field_score": "4423805698048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2891363715586719865", "tokens_matched": 5, "typo_prefix_score": 0}}
