{"document": {"bbox": [1278.96, 757.9, 1500.62, 1458.86], "bbox_id": "908f46369d", "file": "TimesVirginian_1983a_0159.pdf", "page": 1, "text": "The DuVal - Johns home, known as ML Comfort plantation, to Appomattox County will hold a spring open house on Saturday, May 21, 1963. Hours the iioine will bo open to visitors will be from l to 5 p.m. mid the pahttc is Invited to tour this old colonial plantation home. Price of admission will be SO Coach. ML Comfort was constructed to the lata 1700s and Is one of the obtest homes to Appomattox County. The house la situated high atop a bill with a picturesque view of the Peaks of Otter and the Blue Ridge Mountains. It tea beautiful, throe story, date frame country manor with green shutters and roof. Tha dwelling was restored to 1170 sad has 14 rooms .aid 7 usable firaptoeaa. Att if the medwork inside te arigtoal including the doara, mantels, pine panel waioncoatingi wide heart pine flooring, and hand hewn exposed beams Much of the original couatnidteD v r i w B hw Pt and where nails were uaed, they mte tha aid aquareblacksmithmadesfyto. One unique feature of jOte house la R at separate staircases adpnd to nigh of OtetBve upstairs bedrooms. The yard is beautifully landscaped with English boxwoods around the house and down the rid brick walk, and a split rail fence ondoaea nearly two acres of lawn wtdeh adds to the charming colonial setting. The borne was first owned by Major William DuVal, a Revaiuntary War officer, a prominent Richmond attorney, and Wealthy hminamman. Major DuVal was very prominent to the newly formed colonies and aw ed in the House of Delegates as well as being onaef the men to charge of moving the sent of government Cram W lI H r m im r g I n R lr iim n n d l After the death of William IMVal, the homo was old to Colonel John Johns and wae paaa ed down to his son and granddaughter. The Johns family is well known to the Apponaatftox County area since Captain Thomas W. Johns was the countys first Commissioner of revenue. IBs daughter, Miss Deane Johns, taught school to Appomattox County for many yean. The home is listed to the book Old Virginia Houses - The Piedmont by Kmitee Hines. In addition, the home te the sitoject of a new book written by the current owners entitled, Mt. Comfort Plantation - A History and Description of an Authentic Colonial Virginia Home The tour is being sponsored by the currant owners of the home, Mr. and Mrs. Richard L. Guild with help from some of the members of the Appomattox County Historical Society. The owners have requested that no high heeled shoes be worn and that no photographs be taken inside the home. - To reach Mt. Comfort from Appomattox travel 3.5 miles north on Route 26, turn right on Route 711, go straight through the brick entrance and go .7 mile to the house. ML Comfort is easy to find and the tour is an interesting step back into colonial times. Ilootoaom will be to costume to make your visit an enjoyable one."}, "highlight": {"text": {"matched_tokens": ["Thomas", "W", "Johns", "Commissioner", "of", "revenue"], "snippet": "County area since Captain <mark>Thomas</mark> <mark>W</mark>. <mark>Johns</mark> was the countys first <mark>Commissioner</mark> <mark>of</mark> <mark>revenue</mark>. IBs daughter, Miss Deane"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "W", "Johns", "Commissioner", "of", "revenue"], "snippet": "County area since Captain <mark>Thomas</mark> <mark>W</mark>. <mark>Johns</mark> was the countys first <mark>Commissioner</mark> <mark>of</mark> <mark>revenue</mark>. IBs daughter, Miss Deane"}], "text_match": 3472336863207882873, "text_match_info": {"best_field_score": "6627123724288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863207882873", "tokens_matched": 6, "typo_prefix_score": 0}}
