{"document": {"bbox": [372.7, 591.34, 534.36, 851.49], "bbox_id": "c156e060f4", "file": "AppomattoxNewspapers_1915-1918a_0006.pdf", "page": 1, "text": "87 55 Lewie majority 32. No official returns are available from Buckingham County at this time, bnt the indications are that A. J, Terrell defeats Mr. Baker, of Cumberland for the Hoase of Dele gates. Judge Watkins defeats Mr. Thompson for Commonwealths Attorney of Prince Edward. and Mr. Alien defeats Mr. Brock for the Senate from the Prince Bdward District. Mr, Light defeats Mr. Mnrrell in Campbell county for Common wealths Attorney and Mr. Bussell! defeats Mr. Ould for House of le legates from the same county. A. E. Strode defeats Bland I Massie for Senate in the Amherst- Nelson district."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "Edward"], "snippet": "defeats Mr. Thompson for <mark>Commonwealths</mark> <mark>Attorney</mark> of Prince <mark>Edward</mark>. and Mr. Alien defeats"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "Edward"], "snippet": "defeats Mr. Thompson for <mark>Commonwealths</mark> <mark>Attorney</mark> of Prince <mark>Edward</mark>. and Mr. Alien defeats"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1380.25, 624.89, 2336.92, 941.18], "bbox_id": "13fef228cd", "file": "AppomattoxNewspapers_1926-1933a_0083.pdf", "page": 1, "text": "The House That Bests Them All For The Price ESTIMATE OF EXPENDITURES uuuig I Yéhr ending June 30, 1928 were Mrs McCall Mrs. C u r t i s Total estimated compensàtion to be paid from were Mrs. McaiL mra. ur S county funds to Board of Supervisors Harvey, Mrs. C. E- Massey and County Clerk, Shèriff, Commonwealths Mrs. Edward Barber and Mrs. Attorney, Treasurer, Commissioner of Farrar. j the Revenue, and all other administra is a sraau aurpiua mere ta uauauy i Messrs. Kenneth Farrar andj rive expenses, little trouble in selling well cured iNewton Llgon, of V. P. I. paid a ! JudiciaryCircuit Judge salary pork products in the tobaccc recent viait t0 thefo homes here. Jury Comm 0V area. However, where one or I A play entitled The Path! Commissions, and other expenses of the more soyvs are kept, more pigs Accross the Hill will be given I p ablic Buildings are produced than are needed Ky th0 Junior Class of Pamplin1  for home use. To start with, High School on Friday night at these can be disposed of toM asonjc Haii. neighbors as pen pigs and this Mrs. Wiley Richardson spent has been a good sideline the I aat Wednesday with her mother, past few years. However, sell- Mrs. Fore at Appomattox, ing pigs can easily be overdone J Mrs. J. W. Canada is with her cherefore with the majority of husband, who now has a position in Charlotte, N. C. Mr. W. A. Womack is not so I well at this time. Mr. Stanhope Womack a pat ient in St. Peters Hospital, Char lotte, N. C. improves very slow"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Edward", "Attorney"], "snippet": "and County Clerk, Shèriff, <mark>Commonwealths</mark> Mrs. <mark>Edward</mark> Barber and Mrs. <mark>Attorney</mark>, Treasurer, Commissioner of Farrar."}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Edward", "Attorney"], "snippet": "and County Clerk, Shèriff, <mark>Commonwealths</mark> Mrs. <mark>Edward</mark> Barber and Mrs. <mark>Attorney</mark>, Treasurer, Commissioner of Farrar."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.17, 184.11, 1823.58, 1489.39], "bbox_id": "302ff98146", "file": "AppomattoxNewspapers_1912-1915a_0378.pdf", "page": 1, "text": "ory and Henry College, from which he was graduated witlTsthe degree of B. A. in 1877, and with that of M. A. is 1880. After leaving college, he read laV4 for one year in the office Of Judge William V. Deadrick, of Tennessee, and.another year with General A. C. Cuming, H  attended be University of Virginia for one session. He- began practicing in Abingdon and achieved such sjiccpss that he .was elected Judge of tho County Court in December, 1885, but resigned the judgeship in Octo ber, 1886, in order to accept the of fice of assistant dlstriot attorney for the Western District of Virginia, to which he was appointed by President Cleveland. He resigned this office in June, 1888. In 1891 he was elected Commonwealths attorney of Wash ington County, and served one term, declining re-election. On February 12, .1903, be was elected judge of the Cir cuit Court. Before thfe last General Assembly hé was a leading candidate for the Supreme Court oLAppeals. He is president of tbe board of trustees of the Stonewall Jackson Institute, and a member of the board of trustees of Hampden-Sidney College. Revisers to be Paid 6,000 Each For Work. The act creating the Commission for Revision of the Code of Virginia was approved on March 21, 1914, and is listed in chapter 193, section 1, Acts of Assembly. Section 1, provides that the Gov ernor shall, from a list of ten qualified citizens of Virginia, who shall be nom inated by the Supreme Court of Ap peals of Virginia, appoint three, com missioners to revise, codify and index, with suitable marginal citations .and references, the.general statute law of this State, whose duty it shall be to collate, revise and codify all the gen eral statutes, civil and criminal, of this Commonwealth, which may be in force at the time of the completion of their work and properly index the same. They shall denote all Imperfections, contradictions and omissions, and recommend to the General Assembly how they may be reconciled, supplied or amended without producing a radi cal chnge In the present statute law. of the State. It will be their duty also, to make such marginal citations as will be helpful to a clear understanding of the statutes, and they must supervise the publication of thq first edition of the revision and codification. Each of i the commissioners shall receive thé -snm of 6,090, and shall have power to appoint a clerk, whose salary shell not exceed 1,800 a year, and to em ploy such additional clerical help as may be necessary, at a total expense not to excéed 3,000 per. annum. The commission is required to make iis re port to the General Assembly on the first day of the session in 1916. It is believed that the commissioners will begin its labors In the very near future, having before it an elaborate and intricate task. The sum of 40,000, or so much ther- of as may he necessary, was appro priated for the purpose of carrying out the provisions of the act, including the publication, of the new Code, Prdfessor Burks is Son of Former Reviser. The Cqde of Virginia was last of ficially revised in 1887. Professor Burks, who is a son of Judge Edward C. Burks, who was at that time one of the revisers. The other two were Judge Waller R. Staples and Judge Riely, both of whom afterwards served on the bench of the Supreme Court of Appeals of Virginia, The appoint ment is considered a high honor by the legal profession, scarcely second to a designation on the Supreme bench. It iê an open secret that at the session of the General Assembly of 1908 a bill  was offered providing for a Code revision commission, and that it had sufficient votes pledged to secure its passage. A campaign was launched to secure positions as revisers for per tain Virginia lawyers. The patrons f the bill, realizing the Immense impor tance of the work to the State, and fearing political interference, pre ferred to see the bill pigeonholed rath er than take the chance of having any but the. best men in the State named as revisers. At the last session, com mittees of the House and Senate con sulted as to the best methods of safe guarding the appointments, finally de termining on the course provided in the bill of having the Supreme Court nominate ten, from whom the Gov ernor selected three. May Secure Expert To Make Index. The act provides for the employment of a clerk, who, it is believed, should be a trained law student. Later it is believed the commission will need the services of an expert cataloguer from some big library, as it is realized that the index to the Code is in many re spects its most important feature. For some years past the Code in practical use in Virginia has been the compilation made by AttorUey-Gederal John Garland Pollard in 1904, and which was published by a lawbook firm. Since the State has Issued an official Code, the Constitution has been rewritten, and the statute law of the State has undergone extensive changes in almost every section."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "attorney"], "snippet": "1891 he was elected <mark>Commonwealths</mark> <mark>attorney</mark> of Wash ington County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "attorney"], "snippet": "1891 he was elected <mark>Commonwealths</mark> <mark>attorney</mark> of Wash ington County,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.27, 568.69, 1522.48, 1159.96], "bbox_id": "4263347587", "file": "TimesVirginian_1978_0306.pdf", "page": 1, "text": "of meetings.  Rev. Earnie Lucas, pastor of Bible Baptist Church, said local residents should voice support o local law enforcem ent officials, the commonwealths . attorney and judges for stiffer penalities for drug .abusers. i W. S. Bill Slagle inquired what the group could do, not to become a part of the problem but to provide a solution. Edward P. Leonard, pastor of Memorial United Methodist Church, commented that he thinks drug usage among teenagers is a parent prob lem. However, teenagers are fcnowledgable of drugs, their symptons and effects while parents som etim es rem ain unaware of these things. Upon successful completion df the drug abuse program, the charge can then be dropped. This is an intensive counseling program and some elect not to bter, preferring instead to facing sentence by the court.  The DASH program can be utilized by anyone who has a drug problem, not solely those who face drug related charges.  Bruce W illiams told the group he sees an increasing number of persons, who are jonvicted of charges .other than rug violations, using a variety of drugs. Usually if they use marijuana to any degree of regularity they use other forms if drugs also. Z Several group m em bers expressed concern that there ms been a lack of communica tion about drug abuse problems fo the county. One member said fee felt it is mainly a parent problem, and that children are being less attentive to presen tations made to them about drug abuse. More emphasis Should be placed on educating parents."}, "highlight": {"text": {"matched_tokens": ["commonwealths", "attorney"], "snippet": "enforcem ent officials, the <mark>commonwealths</mark> . <mark>attorney</mark> and judges for stiffer"}}, "highlights": [{"field": "text", "matched_tokens": ["commonwealths", "attorney"], "snippet": "enforcem ent officials, the <mark>commonwealths</mark> . <mark>attorney</mark> and judges for stiffer"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2196.47, 592.66, 2489.04, 961.75], "bbox_id": "58b769587d", "file": "AppomattoxNewspapers_1962-1965a_0436.pdf", "page": 1, "text": "George F. Abbitt, Jr., 57, of Appomattox, was appointed Judge of the Fifth Judicial Circuit of Virginia, late Friday aft ernoon by Governor Albertis S. Harrison. Abbitt, who is a brother of Fourth District Congressman Watkins M. Abbitt, has been commonwealths attorney of Ap pomattox since he succeeded his brother in that position in 1948. He was appointed at th at time by the late Judge Joel W. Flood, whom he now follows as the circuit judge. ------------------------------------------- 1 The vacancy in the circuit judgeship occurred April 27, when Judge Flood died after an illness of several months. Thè. interim appointment was made by the governor and is effective until 30 days after the next General Assembly session, when as customary, formal election of the new judge will take placé. Judge Floods term was to have expired Feb. 1, 1970. Abbitt received the judicial nod over County Judge William P. Hay, Jr., of Prince Edward County. Delegations in behalf of both candidates appeared before Governor Harrison, prior to his decision. Abbitt Is a graduate of Appo mattox High School and holds a law degree from the University of Richmond. He entered private practice In 1931 in his home town and has been there since. He served as chairman of the Appomattox board of supervisors from 1942 to 1948. He had been appointed to the board by the late Judge Flood. Abbitt is a"}, "highlight": {"text": {"matched_tokens": ["commonwealths", "attorney"], "snippet": "M. Abbitt, has been <mark>commonwealths</mark> <mark>attorney</mark> of Ap pomattox since"}}, "highlights": [{"field": "text", "matched_tokens": ["commonwealths", "attorney"], "snippet": "M. Abbitt, has been <mark>commonwealths</mark> <mark>attorney</mark> of Ap pomattox since"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [364.56, 1248.05, 525.71, 1406.59], "bbox_id": "f02158b782", "file": "AppomattoxNewspapers_1922-1923a_0507.pdf", "page": 1, "text": "Fletcher For State Senate. Warrenton Special.  Complete returns from the Democratic primary give G. L. Fletcher fifty-three majori ty over T. C. Pilcher for the nomina tion for State senator from the coun ties of Loudoun and Fauquier. M. M. Green received the nomination for the house of delegates, defeating A. D. Kelly and Edward Ambler, the candidates, standing in tbe order named. J. A. C. Keith was nomi nated for Commonwealths attorney without opposition, and the remain ing county officers also, except for sheriff, and for this office A. S. Ham ilton defeated J. E. Oiinger by a large majority."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "attorney"], "snippet": "was nomi nated for <mark>Commonwealths</mark> <mark>attorney</mark> without opposition, and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "attorney"], "snippet": "was nomi nated for <mark>Commonwealths</mark> <mark>attorney</mark> without opposition, and the"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1795.19, 403.61, 1964.2, 1485.3], "bbox_id": "e08021fc9a", "file": "AppomattoxNewspapers_1892-1898a_0325.pdf", "page": 1, "text": "Col. G. W. Hansbrough, one ot the ablest lawyers of Southwest Virginia and a promi nent republican leader, died at his residence In Salem, after an illness of a week of paraly- sis. He was born In Culpeper county August 16, 1828. After graduating In law from the University of Virginia he located In Taylor county, W. Va., where he was soon elected Commonwealths attorney. He was colonel ot the Ninth Virginia Infantry during the civil war and served till the close of hostilities with distinction and gallantry. He was severely wounded at the battle ot Alleghany mountain. At the restoration of peace he removed to his farm, near Salem, resumed tbe practice of law and soon en joyed a Urge and luoratlve practice. In 1883 he wag elected reporter of Le Supreme Court ot Appeals and served uatll tbe ex piration of his term iu 1895 Ho leaves a wife and one son, L O. Hansbrough, a mem ber of the Salem bar. A young mnn, named Frank Donnel l, ol Richmond, aged twenty-one years, was drowned near Homewood, on the James ilvor, by ailing from the excursion steamer Pocohontss. The firm ot Williams Brothers, produce dealers on Roanoke doek, were burned out All the stock on hand, including a lot ot peanuts, was lost, but the building was saved. Edward Richmond, coored, from Greens boro, N C , was shot In Lynchburg, and it is feared that the wound will prove fatal. The shooting was done by a white man named Wood, who olalms that the man wot l.i his watermelon patch. M B Noel, for many years In the stone business in Lynchburg, made an assignment for the benefit of creditors The assets are estimated at 2,500 liabilities not stated. Considerable excitement was caused In Boanoke by the attempt of a colored girl named Lulu Corellas to kill Capt. M. M. Rogers, a prominent citizen of Roanoke county, residing a short distance from tbe southern limits of this city. The girl had been employed as a domestic in Captain Rog ers family, but owing to her independence and Insolence was discharged a few days ago, after a very stormy scene In wblvh she declared she would kill Captain Rogers. About 9 oblock Sunday morning, as be wae riding on horseback to his place of business he was stopped by tbe girl, whom be told to call around at bis offloe later iu tbe day and he would pay her a small balancoduo her Just os he started to ride on some one called to him to look out and on turning bis head he found the girl pointing a pistol straight a him. In order to dtveit her aim ho rode di rectly toward her and as she stepped back she fired, but fortunately the bullet missed aim He then went in search of a police man, and while thus engaged the girl mad her way to the station-house and surrendered herself. The pistol was taken from her and found to be a 32-calibre of six chambers, two of which wero loaded. The first payment has been made by the New York, Philadelphia and Norfolk Railroad Company on the property just purchased at Pinners Point from tho Portsmouth Water Front Company, nnd plans - have been pre pared for extensive improvements in that locality. The Bouthorn Railway Company owners of tbe adjoining docks an l ware houses, has asked for an estimate from the New York Dredging Company for a founda tion for the largo colton compress which tho Southern purposes removing from City Point to Pinners Point by the time the fall business sets in. These operations are likely to give employment to a large building force for several montbe. Except In the ooal line, Pinners Point, with its three railroad lines, will soon outrival Lamberts Point in freight handling. At duek, Marshall Crow, nineteen years of age, son of Mr. Jno. T. Crow, a well-known citizen and former sheriff of Clark county, was accidentally shot and killed by another youth of about tbe same age. Geo. F, Night ingale, who with his father and mother, ot Washington, D. C., are spending the summer at the home ot the deceased boy in Berry- ville. Young Nightingale, thinking it was not loaded, snapped an old pistol at his roqra mate and friend, which the dead boy bad bmself loaded and laid away in a drawer a short time before. The ball pierced hii breast and he was instantly killed. Young Crow was greatly beloved, his bright mind high character and exemplary habits win ning for him the estoora of old and fonng. It Is said the corn farmors of Norfolk county are receiving some benefit from the hot Bans, and some of them will bull out very favorably, notwithstanding the serious wet season. The corn fanners, who as usual put in Irish potatoes, lost nearly all ot that crop, while It Is stated that tbe disastrous failure of the truckers crops has seriously involved many of them, they being deprived of the means to meet tbe bills of the fertilizer men, seedsmen, Ac. They have nothing left to ship except sweet potatoes. It is thought that a number of these now trucking will have to get out of the business."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "attorney"], "snippet": "he was soon elected <mark>Commonwealths</mark> <mark>attorney</mark>. He was colonel ot"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "attorney"], "snippet": "he was soon elected <mark>Commonwealths</mark> <mark>attorney</mark>. He was colonel ot"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.1, 848.09, 2060.64, 1267.29], "bbox_id": "4c7cc5fb9e", "file": "AppomattoxNewspapers_1939-1943a_0033.pdf", "page": 1, "text": "Col , Joel W. Flood, of Appo mattox, has received wide endorse ment for the judicial vacancy caus ed by the death of Judge Robert. F, Hutcheson. A causcus of the Democrats in the General Assembly is scheduled to be held next Tuesday to nominate a candidate to succeed udge Hutcheson. Col. Flood has received the en dorsement and active support of the bar associations o f Appomattox, Buckingham and Cumberland coun ties, and bas been urged to become a candidate for the judgeship by friends from all parts of the State. State Senator Charles T . Moses, who is actively supporting Col. Flood, stated this week that he had been highly gratified at the pledges from mëmberS of the General Assembly to support Col. Flood and that bis nomination for the vacancy on the first ballot was very probable, R . E . Garland, of Farmville, and J . Kent Early, attorneys of Farm villeand Charlotte Court House res pectively, have also been mentioned in connection with the vacancy.Mr. Garland is 40 years of age and has been a member of the Prince Edward bar for 16 years. Mr. Early is a former commonwealths attorney of Charlotte coun and unsuccessful ly opposed State Senator Moaes for the state senate in 1934. Col. Flood has outstanding qual- ftcations fitting him for the circuit bench. He is an alumnus of Wash ington and Lee University and the U, of Virginia, and took a law course at Oxford University, London. He bagan the practice of law in 1917, and was Commonwealths Attorney"}, "highlight": {"text": {"matched_tokens": ["commonwealths", "attorney"], "snippet": "Early is a former <mark>commonwealths</mark> <mark>attorney</mark> of Charlotte coun and"}}, "highlights": [{"field": "text", "matched_tokens": ["commonwealths", "attorney"], "snippet": "Early is a former <mark>commonwealths</mark> <mark>attorney</mark> of Charlotte coun and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
