{"document": {"bbox": [246.0, 1055.93, 406.2, 1379.25], "bbox_id": "f4ece843bc", "file": "AppomattoxNewspapers_1918-1922a_0081.pdf", "page": 1, "text": "Citizens Party Mass Meeting On August 30 the Citizens Party of Appomattox county assembled in mass meeting at the courthouse for the purpose of nominating and endorsing candidates for the various county offices. Notwithstanding the inclem ent weather, about one hun dred representative citizens were present. The party drew up resolutions of respect for the memory of the lamentec Dr. Robertson, and adopted a platform. Havilah Babcock was elected chairman of the party and the following men were declared the partys nom inees House of DelegatesHavilah Babcock. TreasurerH. G. Babcock. ClerkGeorge F. Abbitt. SheriffH. S. Coleman. Commonwealths Attorney W. C. Franklin."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W", "C", "Franklin"], "snippet": "Abbitt. SheriffH. S. Coleman. <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W", "C", "Franklin"], "snippet": "Abbitt. SheriffH. S. Coleman. <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark>."}], "text_match": 2893615515668840569, "text_match_info": {"best_field_score": "5523317456896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2893615515668840569", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [763.68, 1374.71, 1448.86, 1724.8], "bbox_id": "9d3fbdb30a", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "Sheriff F. W. McKinney. Commonwealths Attorney Franklin. DISTRICT OFFICIRS CLOVER HILL DISTRICT SupervisorW. H. Ligon. co m ty, signed by the chair-1 Road Comr.J.W . Trent, man of said board and counter-1 ConstableR. W. Bristow.  s 1 lined by the clerk thereof,  Justices of the Peace payable in not m ire than thirty  maciPf. C. Turns, P. iL __ y a r s from the date of issue  Overseer PoorD. P- Fergus f said bonds the said bonds  s o u t h s id b district to be in denom ina ions of one Suoervisor W. B. Harvey, hunderd dollars to one thou- ,3Upervisor sand dollars, as the said board Justice of the PeaceC. N. I l hi? lbe8tL w ith couPon 8  Eitt R W. Martin, R all, attached for the sem i-annual  P au W party affilia- m Merest, and the principal shall Overseer PoorJ L. Driskill  3  j g Cub Creek, Beckham , Spout I perately, without predudice re-1 dollars each year, 80 that all STONEWALL DISTRICT Springs and all other sections membermg that there still is abid- of the bonds shall become due SupervisorS. R. Martin of the county. ing in the county a brotherhood of and be paid off in sums of n o t!Road Comr.J. E. Martin- I rejoice th a t we have the mankind more precious and more than five hundred dollars I Constable  J. B- Whiteneau Appom attox A g r i c u 1 tural enduring than that of blood School and only w ish that ito r party, and this should be culti- w as better equipped for its great mission and I hope to see it divorced from politics that the instructors m ay be free to give their whole talent and time to the uplift of the children Y et w ith tile j of the county, t the tax4s The county- is now very much in ! debt for school purposes. I ap-"}, "highlight": {"text": {"matched_tokens": ["W", "Commonwealths", "Attorney", "Franklin"], "snippet": "Sheriff F. <mark>W</mark>. McKinney. <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>Franklin</mark>. DISTRICT OFFICIRS CLOVER HILL"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Commonwealths", "Attorney", "Franklin"], "snippet": "Sheriff F. <mark>W</mark>. McKinney. <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>Franklin</mark>. DISTRICT OFFICIRS CLOVER HILL"}], "text_match": 2891363715855155321, "text_match_info": {"best_field_score": "4423805829120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2891363715855155321", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W", "C"], "snippet": "not one, but two <mark>Commonwealths</mark> <mark>Attorney</mark> was <mark>W</mark>. <mark>C</mark>. law offices. One was"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W", "C"], "snippet": "not one, but two <mark>Commonwealths</mark> <mark>Attorney</mark> was <mark>W</mark>. <mark>C</mark>. law offices. One was"}], "text_match": 2891363715855155321, "text_match_info": {"best_field_score": "4423805829120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2891363715855155321", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [366.69, 650.19, 531.19, 1332.64], "bbox_id": "64d42614fd", "file": "AppomattoxNewspapers_1892-1898a_0294.pdf", "page": 1, "text": "jorffr able Commonwealths Attorney, Hon. H. D. Flood, who was assisted by Mr. W. C. Franklin, who had been employed by the friends and relatives oi the prosecutrix, and the accused by Messrs. Poore and Fer guson. After the case was given to the jury they remained in the jury room for some little time, finally reporting to the court that they were unable to agree upon a verdict, when the court discharged the jury which stood eleven for acquittal and one for light punishment. On the next day a nolle prosequi was entered by the Commonwealths Attorney who stated to the court that he would not further prosecute the case, for the leason, he was satisfied from the evider.ee at the trial and the standing of the jury that tried West that he could not convict the accused. Therefore it was ordered by the court, that the case he dismissed and stricken from the docket and the accused dis charged from his recognizance. The next case tried was that of Commonwealth v. Daisy Webb, a colored girl living at this place, who was charged with the murder of her infant child on or about the 29th, of July 1895. The commonwealth was represented by Commonwealths Attorney, Mr. H. D. Flood,- and the accused by Mess. Fleshmau and ankliu. The case was gone into early Friday morning and the balance of the day was taken up iu the examination of witnesses for both the Commonwealth and the defense. A few witnesses on each side was put on the stand on Saturday morn ing and after argument ou both sides the case was given to the jury about 130 p. m., who after getting dinner, wis brought into Court by the Sheriff, to whom they were commit ted according to their adjournment, end rendered a verdict of not guilty. No sooner was the verdict pronounced by the clerk than was created quite a sensation in the court room, by the jubilaut actions and expressions of,Aunt Viny mother of the accused, who motherlike, was as glad of the acquittal as the ac-"}, "highlight": {"text": {"matched_tokens": ["W", "C", "Franklin"], "snippet": "was assisted by Mr. <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark>, who had been employed"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "C", "Franklin"], "snippet": "was assisted by Mr. <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark>, who had been employed"}], "text_match": 2889111916309905529, "text_match_info": {"best_field_score": "3324294332416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916309905529", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [803.74, 402.08, 964.64, 1630.11], "bbox_id": "7304d0620c", "file": "AppomattoxNewspapers_1898-1902a_0193.pdf", "page": 1, "text": "HON. H. D. FLOOD. We sometimes hear it charged against the Hon. H. D. Flood that he exercises too potent a voice in the councils of the Democratic party of this, Appomattox connty. When Mr. Flood returned to his home in July 1886, from the Uni versity of Va., to enter upon the practice of the profession of law, he found this, his native county domi nated by the Republican parly. The Common wealths Attorney, Sher iff and Treasurer were all republi cans, and many of the district offices were filled by men of like politics. The connty was and had been for some pA8t years represented in th Legislature by a republican. With that tnergv and vim which has characterized him from boyhood,.Ite espoused the cause of the old party, and now and for some past years the republican office holders have been displaced and Democrats elected in their places. His services have been so universally recognized that he is looked up to as a guide in every measure proposed to secure the con tinuance of Democratic control. The fear of him and hatred for him entertained by our republican friends is the best testimony to the debt of gratitude the Democratic party owes him. And yet wheu anything occurs iu our party man agement which is displeasing to any number of our party, however small that number may be, there are some of us who lend ready ears to the cry of the republicans, Flood is respon sible for that. Republicans have for years past persistently and wi h- out reason trumped up all manner of charges against him, 99 ont of 100 being false, and industriously circulated these false reports with the hope of alienating from him the confidence of the people. Democrats are you to be so easily fooled by such reports. Will you make yourselves parties to the un doing of your party by defeating Mr. Flood in the approaching elec tion and so playing into the bauds of the Republican party. Yon say no, emphatically, for Mr. Flood has deserved well at your hands and re publican guile cannot deceive you. Mr. W. C. Franklin was Mr. Floods.imniediate predecessor in the office of Commonwealths Attorney. Ask of yourselves, or look to the re cord of the two men and say what per cent of prosecutions for crime did Mr. Franklin convict and then ask what per cent of those charged with crime have gone un whipped of justice since Mr. Flood has been your prosecutor ? Answer this honestly toyourselves and then say for whom should you vote for on the 25th iust, for that office. Flood or Franklin. If you want the guilty brought to justice you will vote for Flood, if you would have them restored to society to con tinue in their nefarious deeds Frank lin is your man. Those who know Mr. Flood know that he is out spoken, conceals noth ing and is ready to avow and stand by his every word and deed. You do not doubt his honesty for he is brave aud truthful. You cannot doubt his ability for he stands to day among the foremost lawyers of his age in this State. You do not doubt his energy, for while achieving a high place in his profession he has devoted much labor and time to re deem his county from republican rule and to hold it steadily in the Democratic ranks. Of our own knowledge we know that Mr. Flood has been falsely ac cused of interfering with minor matters. It is true that Mr. Flood stands firmly by his friends, but he uever goes out of his way to interfere where propriety says,  Hands off. Say to the republicans who can find so much to complain of in Mr, Flood that he has not been anxious to conciliate them and that you support him the more heartily be cause they dread him so much. In the discharge of the office of Commonwealths Attorney he knows neither friend nor foe. Democrat or Republican, but has an eye single to the proper enforcement of his duties. A charitable nmn, he freely gives of bis time and means to aid the deserving and is as tender of the erring as his dutie? will permit Go to work Democrats and pile up a majority so big that our peace will not soon again be disturbed by active republican office-seekers. X."}, "highlight": {"text": {"matched_tokens": ["W", "C", "Franklin"], "snippet": "cannot deceive you. Mr. <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark> was Mr. Floods.imniediate predecessor"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "C", "Franklin"], "snippet": "cannot deceive you. Mr. <mark>W</mark>. <mark>C</mark>. <mark>Franklin</mark> was Mr. Floods.imniediate predecessor"}], "text_match": 2889111916309905529, "text_match_info": {"best_field_score": "3324294332416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916309905529", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2235.08, 164.87, 2394.08, 768.06], "bbox_id": "22bae84513", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "1 The other candidate for the Legislature is Mr. R. L. Burke, who not only voted but worked l!or the adoption of the En abling Act by the voters of his oounty. We leve to vou to decide which man is most likelv to be of servidb to the prohibition cause in the next Legislature After the passage of the law by the General Assembly of 1916, the most important mat ter will be the proper enforce ment of the law, and the en forcement of the law is lodged very largely in the hands of the Commonwealths Attorney. We understand that there are two candidates for this office, one Mr S. L Ferguson, and the other Mr. W. C Franklin. The cord of these two men on prohibition is as follows Mr. Ferguson has been an active supported of prohibition legislation not only in his own hunty, but also was of great orvice in Richmond by bis ork with members of the jleneral Assembly. His record one of tbe best in the State the question of the prohibi tion of the manufacture and sale of ardent spirits. The records of Mr. Franklin that he has always been against prohibition, has voted against prohibition looally, and did so in the Statewide election. The voters of the county must decide which man is more likely to be energetic and suc cessful in his enforcement of the Statwide prohibitory law to be passed by the General Assembly This letter as you well under stand is not written becHUSe of any personal fee ing toward an of the four ni n ineii ion-d blit only that te. vott-rn ru  nave before t ern the refforii. .  tbe four men ci ncer Tnu prohibition. W ith best wisiths, I am , Y o u r. sincerely, J ames C annon J r 8 u p t Anti Sloon League of Virginie a d y"}, "highlight": {"text": {"matched_tokens": ["W", "C", "Franklin"], "snippet": "and the other Mr. <mark>W</mark>. <mark>C</mark> <mark>Franklin</mark>. The cord of these"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "C", "Franklin"], "snippet": "and the other Mr. <mark>W</mark>. <mark>C</mark> <mark>Franklin</mark>. The cord of these"}], "text_match": 2889111916309905529, "text_match_info": {"best_field_score": "3324294332416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916309905529", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [448.54, 540.38, 892.52, 701.83], "bbox_id": "54b45c1c73", "file": "TimesVirginian_1980a_0014.pdf", "page": 1, "text": "The Appomattox County Nellie Almond, first, lieutenant governors representative Ab- Rescue Squad held its annual Pat Noble, training officer ner Scruggs, second lieutenant, dinner and installation of Dale Franklin, secretary se- senior and Richard Bsrtelt, officers fpr the new year on cond row, left to right, Grover sergeant of motor pool. Mike V _ s P. Beasley, Jr., captain Toby Weiss, elected sergeant of Restaurant. Attending were Inge, treasurer Harry Fergu- building .and grounds was not members of the local squad, son, Jr.,, vice president and present for the installation, their spouses, honorary mem- Andy. Scruggs, president and In addition to the officers bers and their spouses, and Mr. on the back row, lefteto right, installed, W. M. Abbitt is the and Mrs. W. Sam Kerr. W. Sam Kerr, Appomattox legal advisor for the Appomat- As another year of successful Commonwealths Attorney and tox County Rescue Squad and service to the citizens of . installing officer Ray Noble, . medical advisors are Dr. A- A. Appomattox County was noted, communicatons officer Bill Fratriek, Dr. J. A. Mathews, newly elected officers installed Noble, second lieutenant, jun- Dr. Kenneth .Powell, Dr. C. G. were, seated, left to right, for Pete Doss, board of OBrien, and Dr. Larry Smith."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney"], "snippet": "another year of successful <mark>Commonwealths</mark> <mark>Attorney</mark> and tox County Rescue"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney"], "snippet": "another year of successful <mark>Commonwealths</mark> <mark>Attorney</mark> and tox County Rescue"}], "text_match": 2886860116630438009, "text_match_info": {"best_field_score": "2224782770176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2886860116630438009", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1758.7, 276.85, 1920.78, 1494.19], "bbox_id": "9cdc63bcff", "file": "AppomattoxNewspapers_1902-1905a_0164.pdf", "page": 1, "text": "Pensions granted VirginiansWil liam P. Crump, 6 Edmond Sprow, 6 William Johnson, 8 Loudon Hurdle. 8 William Griffin, 6 Louis Rich mond, 6 Lewis William Spies 6 William S. Hines, 12 Andrew Moore 8 John Fleming, 12 Thomas G. Hope, 12 Joshua V. Davis, 40 John Breckenridge, 10 Bettie Hughes, 8, Susan J. Hamilton, 8 Samuel Quiller, 6 Myron Weeks, 55 Emma J. Rudd. 8 Charles H. Cooper, 12. W. H. Couch, a yOung married man, has been sentenced to pay a fine and serve a term in the Danville jail 01 stealing dress goods from L. Herman, by whom he was employed. Couch re signed his position, it is alleged, to seek employment in Chase City, his old home. He left at his boarding house a box labeled  dress chickens,1 which was opened for fear the meat would spoil The box was filled with dress goods. Couch, who comes from a well-known family at Chase City, married the youngest daughter of the late Joseph T. Miller. The young wife is almost prostrated. Virginia Bowling, the pretty 15-year- old daughter of W. T. Bowling, of Lynchburg, eloped with Mr. Lewis A. Hoffman, of Charlottesville, an alum- nus of the Miller School. Miss Bowl ing has not yet reached the dignity of long dresses, and to accomplish hei purpose borrowedone from Miss Hoff man, sister of the groom-elect. Mr. Hoffman went to Lynchburg, when he met his sweetheart, and after she had told her mother that she was going tc spend the night with her chum, they then left for Washington, where they were married. Miss Hattie Underwood, a pretty girl of 16 years, committed suicide at het fathers home, near Adams Grove, ir Southampton county, by sending a bul let crashing through her brain. Sh fired the shot in the presence of her sis ters and other members of the family and expired in a few minutes. Mist Underwood had just recovered from an attack of fever and the family had not noticed that her mind was affect ed. Adam Heath and his son, who re side in Prince George county, neat Disputants Station, on the Norfolk atid Western Railway, left home for Black- water Swamp to hunt squirrels. White going through the swamp Heaths gun was accidentally discharged, the load lodging in his leg, and he bled to death While rabbit hunting, William Rob erts, of West Point, accidentally shol Hugh George in the right leg, inflict ing n ugly wound. After the shoot ing the boys who were hunting carried George for some distance nntil they could get a wagon and then brought him to.West Point. Dr. W. K. Gate- wood amputated the limb just above the foot. George is about 17 years of age. Oliie Hudgins, the United Statei lightkeeper at Mathews, may die from the results of a crab bite. He was bit ten some time ago on the fleshy part of his thum erysipelas set in a week ago and is now entering the body. Drs. Hunley and White say they can not relieve the sufferer and that they believe his end is near at hand. The police of Lynchburg have arrest ed Robert Coleman and his wife, Pleas Herndon and his wife, William Mitchell and Maria Nowlin, colored, who are .charged with systematically robbing packages at the freight depot of the Southern Railroad.  Lillian Poindexter, a 17-year-old col ored girl, employed in the household of Commonwealths Attorney Thos. Hamlin, at Danville, was found uncon scious in her bed, having inhaled gas. Her room was forcibly opened and the girl was found lying on her side on the bed with the gas turned on full. Uncle A. Finney, an ex-slave owm er, 90 years old, who lived in a moun tain cabin on the farm of the late Jas Martin in Franklin county, was re garded by ignorant people living in the vicinity as a sorcerer. A few nights ago the old man was called to his dooi by three unknown men and shot to death. H. C. Macklin has resigned as gen eral storekeeper for the Norfolk and Western Railway Company, with offices in Roanoke, to become general pur chasing agent for the Seaboard Ait Line Railway Company, with head quarters at Portsmouth. The Virginia Military Institute op ened for the autumn session with 245 enrolled cadets, of whom 105 were new students. At least 25 old schol ars will report in tho next few days, and as many new cadets, bringing the corps number up to 300 or more. The Washington and Lee University opened its one hundred and twenty- second session. Opening services were held in Lee Memorial Chapel, over which President Denny presided and addressed the students, who numbered about 230. Charles W. Latimer, a sailor, living near Hampton, died from the effects oi an overdose of laudanum. He suffered from insomnia and took a dose of the drug to induce sleep. Deceased was 70 years old and was at one time in the United States Navy, but at the out break of the Civil War joined the Con federate Navy. W. C. Howell  Co., confectioners, filed a deed of assignment at Suffolk. The liabilities are 1200 assests 1800. Damage suits aggregating 8500 were filed against the Portsmouth, Berkley and Suffolk Water Company, breach ol contract being alleged. It is claimed that property to that amount recently was destroyed by fire, which could have been put out had there been water in the nearest plug."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney"], "snippet": "in the household of <mark>Commonwealths</mark> <mark>Attorney</mark> Thos. Hamlin, at Danville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney"], "snippet": "in the household of <mark>Commonwealths</mark> <mark>Attorney</mark> Thos. Hamlin, at Danville,"}], "text_match": 2886860116630438009, "text_match_info": {"best_field_score": "2224782770176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2886860116630438009", "tokens_matched": 5, "typo_prefix_score": 0}}
