{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["S", "Bocock", "Commonwealth", "Attorney"], "snippet": "County Clerk, and llomas <mark>S</mark>. <mark>Bocock</mark>, the first <mark>Commonwealth</mark> <mark>Attorney</mark>, and An- ew B."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Bocock", "Commonwealth", "Attorney"], "snippet": "County Clerk, and llomas <mark>S</mark>. <mark>Bocock</mark>, the first <mark>Commonwealth</mark> <mark>Attorney</mark>, and An- ew B."}], "text_match": 3470085063931068537, "text_match_info": {"best_field_score": "5527612358656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 18446744073709551615, "score": "3470085063931068537", "tokens_matched": 6, "typo_prefix_score": 0}}
