{"document": {"bbox": [1320.27, 702.2, 1476.94, 749.19], "bbox_id": "f7b8be3a5e", "file": "AppomattoxNewspapers_1892-1898a_0138.pdf", "page": 1, "text": "Mr. L. E. Smith, Commissioner of Revenue, in a few days, will be gin his yearly tour through the county."}, "highlight": {"text": {"matched_tokens": ["L", "E", "Smith", "Commissioner", "of", "Revenue"], "snippet": "Mr. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, in a few days, will be gin his yearly tour through the county."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "E", "Smith", "Commissioner", "of", "Revenue"], "snippet": "Mr. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, in a few days, will be gin his yearly tour through the county."}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [453.61, 350.72, 612.19, 634.72], "bbox_id": "f173cae174", "file": "AppomattoxNewspapers_1898-1902a_0433.pdf", "page": 1, "text": "APPOMATTOX, etjUHTY orricxKs. Judge of Giroui_CourtrGeo. J. Hundley Cou rt. tin t day of ..pril and October. Judg of County CourtD. A. Christian, curt, Thursdaytafterlflrst Monday. Clerk of Circuit and county CourtGeo. T. Peer. Attorney for.CommonwealthH.. Flood sheriffS. P. Coleman. Treasurer D. Mott Rlbertson. Commissioner of Revenue L. E. Smith. Board of SupervisorsW. H. Ligon, chair man  8. C. Stratton and J. C. Jones. Board meets on Wednesday after first Monday In March. June. September, and December. BUCKINGHAM. OOUHTY OCriCKHS. Judge of Circuit CourtGeo.J.Hundley Court. ttthAprllandOctobcr judge of County Court  John R. Moss Court. Second Monday. Clerkof Circuit and County Courts,P. A. Forbes. Attorney for the CommonwealthB. W. Hubard. SheriffWm. W illiams. TiwurerJefferson Davis, t . 0 oissioner of Revenue, District No. 1 u f can. District No. 2, C. C. Camden. Ilr,nl of SupervisorsP. A. Grigg, chair- ru i Alexander Forbes, Wm. R. Silvey, M M ti-t is, Thomas Tindall and Allle C. Wood it .. I meets first Monday in each month."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "Smith", "of"], "snippet": "Treasurer D. Mott Rlbertson. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>. Board <mark>of</mark> SupervisorsW. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "Smith", "of"], "snippet": "Treasurer D. Mott Rlbertson. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>. Board <mark>of</mark> SupervisorsW. H."}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1334.65, 481.84, 1487.84, 516.46], "bbox_id": "fea37592f5", "file": "AppomattoxNewspapers_1892-1898a_0296.pdf", "page": 1, "text": "week. Commissioner of the Revenue, L. E. Smith, went to Lynchburg last"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "Smith"], "snippet": "week. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>, <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, went to Lynchburg last"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "Smith"], "snippet": "week. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>, <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, went to Lynchburg last"}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [342.95, 526.75, 467.17, 604.52], "bbox_id": "7a9c7ff0c8", "file": "AppomattoxNewspapers_1892-1898a_0236.pdf", "page": 1, "text": "Sheriff. S. P. COLEMAN. Treasurer. WILLIAM J. TRENT. Commissioner of the Revenue. L. E. SMITH."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "SMITH"], "snippet": "Sheriff. S. P. COLEMAN. Treasurer. WILLIAM J. TRENT. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>SMITH</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "SMITH"], "snippet": "Sheriff. S. P. COLEMAN. Treasurer. WILLIAM J. TRENT. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>SMITH</mark>."}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [260.65, 586.22, 386.73, 608.37], "bbox_id": "98277010b7", "file": "AppomattoxNewspapers_1892-1898a_0238.pdf", "page": 1, "text": "Commissioner of the Revenue. L. E. SMITH."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "SMITH"], "snippet": "<mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>SMITH</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "L", "E", "SMITH"], "snippet": "<mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>SMITH</mark>."}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.48, 575.4, 1752.37, 1387.53], "bbox_id": "394d66361b", "file": "AppomattoxNewspapers_1902-1905a_0125.pdf", "page": 1, "text": "Mr. A. H. Clement desires it to be understood that he is in the can vass and will endeavor to visit the homes of the people of the county, but that he has been interfered with n some respects by unforeseen cir cumstances. The Baptist ministers of the Ap pomattox Association will meet to day to discuss the needs of the field ind to arrange a tentative program for the Association which meets at Charlotte C. H., August 18. Rev. Hugh Smith attends from this place. Capt. R. S. Echols, who was so badly injured by the wreck between Petersburg and Richmond last Fri day and who was reported to have been killed, is now here on a fair way to permanent recovery. Engi neer Covington and Fireman Cov ington, of the ill-fated train, were killed. All of these gentlemen were well and favorably known in this, county. The following officers qualified on Monday before Judge Christian in the county court, their terms being extended to January 1,1904, under the new Constitutiou S. P. Coleman, sheriff Leon. E. Smith, commissioner of revenue J. W. Paris, superintendent of poor J. R. Horsley, county surveyor W. H. Ligon, J. C. Jones, supervisors. R. F. Burke qualified as treasurer, vice l. Mott Robertson, resigned. It is rumored that T. J. Stratton will stand for road Commissioner in Stonewall, J. F. Dickerson for Gloyer Hill, and Hon. J. C. Jones- and Saml Lee has announced them selves candidates in Southside. No candidate has come out for Super visor for Stonewall, and Hon. W. Hi Ligon has no opposition in Clovef Hill for his old place on the board. Messrs. J. H. Robertson and Ed ward Harvey are candidates for Supervisor from Southside. Quite a surprise was sprung on the village yesterday when Mr. W. D. Cofer, came down from Blue field, W. Va., and secured a license for the marriage of Miss Lizzie Fleshman, which happy event will be celebrated to-day at the home of the brides father in a quiet way. The brides pastor Rev. Hugh C. Smith will officiate. The couple will leave on the evening train for a trip east and will be permanently located in Bluelield, where the groom holds a lucrative position with the N.  W. Ry. Co. The bride is a very charming young lady and de- servingly popular with"}, "highlight": {"text": {"matched_tokens": ["E", "Smith", "commissioner", "of", "revenue"], "snippet": "P. Coleman, sheriff Leon. <mark>E</mark>. <mark>Smith</mark>, <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark> J. W. Paris, superintendent"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Smith", "commissioner", "of", "revenue"], "snippet": "P. Coleman, sheriff Leon. <mark>E</mark>. <mark>Smith</mark>, <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark> J. W. Paris, superintendent"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [233.75, 429.88, 390.8, 691.88], "bbox_id": "7353e33ad4", "file": "AppomattoxNewspapers_1892-1898a_0240.pdf", "page": 1, "text": "Below we give the vote of the county for the various offices as ascertained by the Commissioners of Election. Tbev have not counted the vote of Spout Springs precinct, as they adjourned over until Monday to consider some irregularites of that point. As ascertained by them the vote stands as follows  For Treasurer. D. Mott Robertson..................... 705 W. J. Trent................................. 496 For Commonwealth Attorney. H. D. Flood................................. 639 W.C. Franklin .......................... 575 For Sheriff. S. P. Coleman ............................. 1168 Commissioner Revenue. L. E. Smith................................. 753 E. F. Collins ................................ 398 Supervisors."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "Revenue", "L", "E", "Smith", "E"], "snippet": "S. P. Coleman ............................. 1168 <mark>Commissioner</mark> <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>................................. 753 <mark>E</mark>. F. Collins"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "Revenue", "L", "E", "Smith", "E"], "snippet": "S. P. Coleman ............................. 1168 <mark>Commissioner</mark> <mark>Revenue</mark>. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>................................. 753 <mark>E</mark>. F. Collins"}], "text_match": 3470085064065286265, "text_match_info": {"best_field_score": "5527612424192", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085064065286265", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.51, 558.7, 1721.22, 895.3], "bbox_id": "90920fa1c2", "file": "AppomattoxNewspapers_1898-1902a_0633.pdf", "page": 1, "text": "APPOMATTOX COUNTY OrriCEHH. Judge of Circuit CourtGeo. J. ilundley. Courts, first day of April and October. Judge of County CourtI. A. Christian. Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Peer. A ttnrneyfor CommonwealthS.L. Ferguson Shoriff8. P. Coleman. TreasurerI. Mott Hvbertson. Commissioner of i ovem.e- L. E. Smith, ilpard of SupervisorsW. H. IJgon, chair man S. C. Stratton and J. C. Jones. Hoard meets on Wednesday after first Monday m Maroh. June. September, and December. BUCKINGHAM. V  COUNTY OkriCKKS. Judge of Circuit CourtGeo. J. Hundley. Courts. 35tli April and October., Judge of County CourtJohn U. Moss, Court. Second Monday. Clerk of Circuit and County Courts P. A. Forbes. Attorney for the Commonwealth E. W. Hubard. SheriffWm. W illiams. TreasurerJefferson Davis, t tu,i issloner of Revenue, District No. 1. M.  3 can. District No. 2, C. C. Camden. Hoard of SupervisorsP. A. Urigg, chair- ezander Forbes, Forrest Guthrie, M. h .   Is, Thomas Tindall and Allie C. Wood- to y 1 meets first Monday til each month. CUMBERLAND. COUNTV OrriCEHS. Jad.  of Circuit CourtGeo. J. Hundley. Coil its, 7th May, 7th November. Judge of County Court - T. M. Miller. Cqurt, Fourth Tuesdays. Clerk of Circuit and County CourtsJ. B. Fllppon. DeputyV. Vulden. Attorney for the CommonwealthWm. M. Mmlth. TreasurerO. , Fllppen. Sheriff-H. K Adam. Surveyor -., u. Diggs. Dona oRBupervisorsJ. A. Stegor, chair man, Thos. H. Perkins and Wm. H. Rhodes,"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "L", "E", "Smith", "of"], "snippet": "Coleman. TreasurerI. Mott Hvbertson. <mark>Commissioner</mark> <mark>of</mark> i ovem.e- <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, ilpard <mark>of</mark> SupervisorsW. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "L", "E", "Smith", "of"], "snippet": "Coleman. TreasurerI. Mott Hvbertson. <mark>Commissioner</mark> <mark>of</mark> i ovem.e- <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, ilpard <mark>of</mark> SupervisorsW. H."}], "text_match": 3470085063796850809, "text_match_info": {"best_field_score": "5527612293120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085063796850809", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [368.15, 486.12, 526.02, 707.38], "bbox_id": "144d8dcbef", "file": "AppomattoxNewspapers_1915-1918a_0043.pdf", "page": 1, "text": "D em ocratic N om ioees 8. L. Ferguson . Commonwealths Attorney T reasurerit. F. Burke f Commissioner of Revenue E. R. A bbitt S ouse of DelegatesR. L. Burke Sheriff F. W. McKinney DISTRICTOFFICERSCLOVER HILL Supervisor C. M. Drinkard ConstableB, M. Drinkard Road Commissioner8. A. Ferguson Justices of the PeaceR. A. OBrien, P. H. Gliiiam. Overseer P oor- T P. Ferguson SOUTHSIDB Supervisor- L. i . Smith Road CommissionerW. H. Lewis ConstableK. C. Minn Justices of the PeaceW. L. Brown. T. W. tyloses. Overseer Poor8. G. Harvey - STONEWALL Supervisor ifr. W. Carson Road CommissionerH. ti. Harding Constable B. A. V a!ton Justices of the PeaceC. F. Button, F. G. Thorp Overseer PoorR. T. Phelps"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "E"], "snippet": "reasurerit. F. Burke f <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>E</mark>. R. A bbitt S"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "E"], "snippet": "reasurerit. F. Burke f <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>E</mark>. R. A bbitt S"}], "text_match": 3467833264385818745, "text_match_info": {"best_field_score": "4428100861952", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264385818745", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1700.58, 695.47, 1867.48, 953.63], "bbox_id": "bc0e1744a9", "file": "AppomattoxNewspapers_1952-1954a_0137.pdf", "page": 1, "text": "Miss Caroline Matilda Smith, 41 secretary to the commissioner of the revenue of Appomattox County, died at 400 A. M. Saturday at Memorial Hospital. She had been in ill health since June. Born in Appomattox on Feb. 11, 1911, she was the daughter of the ate Leoimfti Luis Smith and Mrs. Willie Cleveland Smith, who survives her. She wa9 an active member of Liberty Baptist Church. In addition to her mother, she is s.Avived by four sisters, Mrs. R. W. Stanley, Miss Myrtle C. Smith and Mrs. J. H. OBrien, all of Appomat tox and Mrs. Gobel Reynolds, of Crittendon, Ky two brothers, L. E Smith, Jr., of Lynchburg, and Thomas A. Smith, of Appomattox- two half sisters, Mrs. A. B. White, and Miss S. Illene Smith, of Lynch burg. Funeral services were held Sun day at 330 P. M. from the Liberty Baptist Church. Burial was in Lib- erty Cemetery. Dr. V. W. Sears, pas-"}, "highlight": {"text": {"matched_tokens": ["L", "E", "Smith", "of"], "snippet": "Crittendon, Ky two brothers, <mark>L</mark>. <mark>E</mark> <mark>Smith</mark>, Jr., <mark>of</mark> Lynchburg, and Thomas A."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "E", "Smith", "of"], "snippet": "Crittendon, Ky two brothers, <mark>L</mark>. <mark>E</mark> <mark>Smith</mark>, Jr., <mark>of</mark> Lynchburg, and Thomas A."}], "text_match": 3467833264251601017, "text_match_info": {"best_field_score": "4428100796416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264251601017", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [917.29, 460.08, 1083.93, 1623.48], "bbox_id": "f39f7ffb77", "file": "AppomattoxNewspapers_1902-1905a_0151.pdf", "page": 1, "text": "iton is serious. It happened just at he train was pulling out of the station. It was stopped and the injured man was removed and taken to a surgeon -iice. No arrests were made. Suit was instituted in Richmond by Bollock  Lamb in behalf of Millie C. Cook, who asks 30,000. damages from Alexander Tompkins and others. The plaintiff sets forth that she paid the defendants 103 for a room lor life ir he house at 9115 North Sixthstreet !t is contended that she was denied admission to the room at night, hav- i!g to remain out in the weather and mitered front cold. Dr. F. S. Goodman, steward in the L. S. -hospital service, Norfolk, will per mit  malanal mosquitoes to bite him 1 the interests of science. He wishes Jo see whether one bitten by them wiil be inoculated with malaria Dr. Good man believes he is immune from vellow fever. Ih c Lynchburg City Council author ized the Water Committee to expend fyooo for the purchase of land for the dam site and watershed for the pro posed gravity water supply. The Coun cil also authorized a joint committee to piace the public school buildings in a thorough sanitary condition, a work that will cost about 8000. Samuel Dennis, while at work on the bridge which is being erected across the Rappahannock river at Rem ington, .was killed by being caught under a heavy beam, the rope by which it was suspended having broken. After five attempts to commit sui cide Mrs. Jas. Smith, of Staunton, 41 years old. succeeded in ending her life by strangling. Mrs. Smith came-Ac Staunton several weeks ago from Mil lers School to spend the summer fot her health, and she made three unsuc cessful attempts to throw herself ir front of the Staunton street cars. Last Friday she was taken to the Western State Hospital, where several days age she tried to choke herself with a cord. Thursday after dinner she succeeded in slipping away from the guards, ran into a room and tied a handkerchief around her neck, the other end of which I she tied to a window guard, and threw herself forward, strangling to death. She was in the infirmary ward and a close watch had been kept on her evet since she had been confined in the hos pital. 1 his ward has more guards and is the closest guarded ward in the hos pital. Hers was a case of stticida mania, and in such cases patients art under strict guard. At the coroners inquest no blame was attached to tfiv authorities. William Coulter andhis sweetheart went to the Court Clerks office at W il liamson to secure a marriage license. I he document was written by the clerk and Coulter laid down a half-dol lar, evidently believing that to be the fee. When informed that it required ffiai much more he was not able to pro duce it and asked the young woman if she could advance the amount. She be came enraged and refused to marry hint. They left the office quarreling, and upon reaching the street Coulter became enraged and fiercely attacked his companion, beating her unmerci fully. He was arrested and lodged in jail. Next morning when Jailer Thom as took Coulters breakfast to him he was found dead on the stone floor of the cell. He had been dead several hours when discovered. Judge A. A. Phlegar, late of the Su preme Court of Virginia, has announc ed himself a candidate for the State Senate f-om the Fourth district. Sena tor Lyle, the present Senator, for busi ness reasons will retire. Judge Phle gar was for years the general attorney of the Virginia Iron. Coal and Coke Company. He was later general mana ger, and retired recently to resume the practice of law. Edward C. Carty and his cousin, Maggid Carty, the latter a pretty giri of 18 years old, eloped from Castle- wood. Russell county. They traveled all night, crossing the mountains in an open wagon and arriving in Bristol at 4 oclock in the morning. They were married and started for home as they came. R. C. Stearns, of Salem, announced his candidacy to represent his district in the State Senate of Virginia, subject I to the Democratic nominating pri- j niary. A barn belonging to D. E. Kefauvcr. Commissioner of the Revenue for Ro anoke county, was struck by lightning and totally destroyed. The loss is 1200 with 400 insurance. Mrs. Cornelia R. Johnston, 36 year old, of Memphis, Tentt., who was spend ing the summer at Virginia Beach, was told she had received a telegram ami died from the excitement before the mes sage, which was of minor importance ccitld be read to her. She was 1 daugh ter of the late Dr. T. B. Johnston, ol Kentucky. The body was shipped tc Memphis. Late Saturday evening, while driving from Pamlin Depot to his farm, Otis Gilliam, a young farmer, of Lynchburg was shot in the head by a spent bullet which came from no one knows where No report of a gun was heard and nc one was in sight with a weapon. Mr Gilliam was not seriously hurt. Mack Fletcher was killed by a fa! from a- window at the liomc of Mr. O A. Eubank, near Round Hill, Loudour county. Samuel Hodges, a fireman, was rur over and both his legs crushed in the railroad yards at Roanoke."}, "highlight": {"text": {"matched_tokens": ["E", "Commissioner", "of", "Revenue"], "snippet": "barn belonging to D. <mark>E</mark>. Kefauvcr. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> for Ro anoke county,"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Commissioner", "of", "Revenue"], "snippet": "barn belonging to D. <mark>E</mark>. Kefauvcr. <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> for Ro anoke county,"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [426.5, 391.14, 591.79, 667.74], "bbox_id": "4b54c1e359", "file": "AppomattoxNewspapers_1898-1902a_0586.pdf", "page": 1, "text": "A11  rneyf or Common weal t hS. L. Ferguson j SI l itl  8. P. Coleman. Treasurer i. Mott K jbertson. Commissioner of even e- f. E. Smith, anl of SupervisorsW. H. Ligon, chair- j mu S. Stracton and J. C. Jones. IJard iects on Wednesday after first Monday in larch, June. September, and December. I BUCKINGHAM. COUNTY OFFICERS.  Judge of Circuit CourtGeo. J. Hundley. Courts. 25th April and October. Judge of County CourtJohn R. Moss. ciMt. Second Monday? Cerkof Circuit County Courts P. A. j oibes. Attorneyfor the Commonwealth E. W . j lEi.b    . . Win. M illiams. Trciisiircr -Jefferson Davis. issioner of Revenue, District No. 1. can. District No. 2, C. . Camden, lioard of SupervisorsP. A. Grigg, clmir-  i, lexauder Forbes, Forrest Guthrie, M.  is, Thomas Tindall and Allie C. Wood- l meets first Monday in each month. CUMBERLAND, COUNTY OFFICERS. e of Circuit CourtGeo. J. Hundley, i ICourts, 7th May, 7tli November. Judge of County Court - T. M. Miller. ICouris, Fourth Tuesdays. I OFrk of Circuit and County CourtsJ. B.. IFlipten. DeputyV. Vaideii.  Attorney for the CommonwealthWm. M. Is mi th.  TieasurerO. , Flippen. I SheriffIC. E Adams. I Surveyor  . . Diggs.  Bouu of SupervisorsJ. A. Steger, enair-  in in Ihos. H. Perkins and Wm, it. Rhodes,"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "e", "E", "of"], "snippet": "i. Mott K jbertson. <mark>Commissioner</mark> <mark>of</mark> even <mark>e</mark>- f. <mark>E</mark>. Smith, anl <mark>of</mark> SupervisorsW. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "e", "E", "of"], "snippet": "i. Mott K jbertson. <mark>Commissioner</mark> <mark>of</mark> even <mark>e</mark>- f. <mark>E</mark>. Smith, anl <mark>of</mark> SupervisorsW. H."}], "text_match": 3467833263983165561, "text_match_info": {"best_field_score": "4428100665344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263983165561", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [650.66, 966.18, 815.6, 1751.51], "bbox_id": "8f25d52e2c", "file": "AppomattoxNewspapers_1898-1902a_0181.pdf", "page": 1, "text": "White Hall. Since the weather has been fail aud favorable for work, the p opl have been very busy getting their potatoes planted, and some have be gun to plant corn. Onr town, while not specially on a boom, is buildiug up in a quiet way. The sound of the saw and the hammer is heard, as new buildings are going up. Mr. W. R. Silvey is having a resi deuce p u t up. He has purchased the farm of Mr. George VV. Garratt. which lies adjacent to this place. Mr. Geo. W. G arratt and family have removed from their home here to some plaee in Pennsylvania. Mr. Robert Smith, of this neigh borhood, and Miss Josie G arratt, of this place, were m arried last week Rev. W. E. G rant officiating. We hope for the parties much happiness in their m arried life. Our Mr. Jefferson Davis returned last week from New York. Mrs. H. M. White, accompanied by her sou W ilbur, left last v.eek to spend some weeks- visiting relatives and friends at W arreuton, Va. We wish her a pleasant visit and a sate return. Mrs. Wm, R. Silvey is this week visiting her relatives near Rival, Va. Miss Susie Harden, of this place, is visiting friends at Gravel Hill. Mrs. Willie A. Moss is visiting her relatives at Mt. Viuco. On her return, we think, our friend Willie will have everything ready here foi housekeeping. We are glad to have them with us. A mass-oracling of the Democrats of Jurdsville district, to elect dele gates to the county convention and to make nominations for district of ficers, was held at Rosuey on April 22. E. W. H ubard called the meet ing to order H. M. White was elect ed chairman, aud W. it. Silvey secre tary. Eugene Vaughan nominated the following delegates, instructed for L. Mi Ganaway foi commissioner of the revenue Nick Crute, Temple Claiborne, Thomas Guthrie, Forest Guthrie, W. E. Bailey. An amend m ent Was offered that these delegates be instructed for C. C. Camden when Mr. Ganaway Vliam e was not before the convention which was lott. E. W. Hubard offered the following re solution, which was carried T hat the delegates present at the couven lion should cast the vote of the dis trict. The following were nominated for district officers  For SupervisorE. A. Richardson for Overseer of the PoorWesley S m ith for Justices of the PeaceWesley Elam , J. T. Brausford, P. H. Coghill for Con stableC. H. Agee. On motion,, the meeting adjourned. We are glad to see letters from so many Buckingham correspondents. Let us keep our paper to the frout. R."}, "highlight": {"text": {"matched_tokens": ["L", "commissioner", "of", "revenue"], "snippet": "following delegates, instructed for <mark>L</mark>. Mi Ganaway foi <mark>commissioner</mark> <mark>of</mark> the <mark>revenue</mark> Nick Crute, Temple Claiborne,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "commissioner", "of", "revenue"], "snippet": "following delegates, instructed for <mark>L</mark>. Mi Ganaway foi <mark>commissioner</mark> <mark>of</mark> the <mark>revenue</mark> Nick Crute, Temple Claiborne,"}], "text_match": 3467833263848947833, "text_match_info": {"best_field_score": "4428100599808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263848947833", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.99, 717.94, 1476.79, 926.88], "bbox_id": "189b144eb1", "file": "AppomattoxNewspapers_1933-1936a_0325.pdf", "page": 1, "text": "DEMOCRATIC TICKET Tuesdays Election NOVEMBER 5, 1935 For State Senator Charles T. Moses For House of Delegates John B. Boatwright For County Treasurer R. L. Burke For Commonwealths Attorney W. M. Abbitt For County Clerk C. W. Smith For Sheriff H. W. McKinney For Commissioner of Revenue J. H. OBrien For supervisor Stonewall District T. E. Owen For Supervisor Southside District Don Moses For Supervisor Clover Hill District F. A. OBrien"}, "highlight": {"text": {"matched_tokens": ["Smith", "Commissioner", "of", "Revenue"], "snippet": "County Clerk C. W. <mark>Smith</mark> For Sheriff H. W. McKinney For <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> J. H. OBrien For"}}, "highlights": [{"field": "text", "matched_tokens": ["Smith", "Commissioner", "of", "Revenue"], "snippet": "County Clerk C. W. <mark>Smith</mark> For Sheriff H. W. McKinney For <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> J. H. OBrien For"}], "text_match": 3467833263580512377, "text_match_info": {"best_field_score": "4428100468736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263580512377", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1323.35, 713.27, 1471.05, 921.07], "bbox_id": "0d65288504", "file": "AppomattoxNewspapers_1933-1936a_0326.pdf", "page": 1, "text": "DEMOCRATIC TICK ET Tuesdays Election NOVEMBER 5, 1935 For State Senator Charles T. Moses For House of Delegates John B. Boatwright For County Treasurer R. L. Burke For Commonwealths Attorney W. M. Abbitt For County Clerk C. W. Smith For Sheriff H. W. McKinney For Commissioner of Revenue J. H. OBrien For supervisor Stonewall District T. E. Owen For Supervisor Southside District Don Moses For Supervisor Clover Hill District F. A. OBrien"}, "highlight": {"text": {"matched_tokens": ["Smith", "Commissioner", "of", "Revenue"], "snippet": "County Clerk C. W. <mark>Smith</mark> For Sheriff H. W. McKinney For <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> J. H. OBrien For"}}, "highlights": [{"field": "text", "matched_tokens": ["Smith", "Commissioner", "of", "Revenue"], "snippet": "County Clerk C. W. <mark>Smith</mark> For Sheriff H. W. McKinney For <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> J. H. OBrien For"}], "text_match": 3467833263580512377, "text_match_info": {"best_field_score": "4428100468736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263580512377", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [495.35, 1333.61, 812.41, 1474.52], "bbox_id": "df9bd79ad2", "file": "AppomattoxNewspapers_1918-1922a_0616.pdf", "page": 1, "text": "Total - ------------------------------------------------ .535.40 Officers Salaries Joel W. Flood, Commonwealths Attorney ______________________  600.00 H. W. McKinney, Sheriff and Jailo r ______________ v ___________ 628.00 H. W. McKinney, Probation Officer _________________ _ ______ t _____ 100.00 G. W. Smith, County Clerk ___ _ ________ _ _________________ H l OOOioO C. W. Smith, Clerk of Board of Supervisors and road work _______ llO.OO W. H. Ligon, Supervisor ___________________________________ 108.00 L. E. Smith, Supervisor ________ _ ____ _ _________ ____________ 97.60 S. E. Anderson, Supervisor _________________________________ 115.20 R. T. Phelps, Overseer of Poor ____ __________________________ 2o!oO D. P. Ferguson, Overseer of P oor___________, ______ _ _ H U _ _ 2010 S. G. Harvey, Overseer of P o o r _____________ v ________ .......V 20.00 D. L. Martin, Janitor Clerks Office___________I,___________ _ ___ 24.00 E. R. Abbitt, Commissioner ReVenue, extending levies, c _______ 1,509.82 Geo. J. Hundley, Appomattox countys part of Sy __________  ____ 211.76"}, "highlight": {"text": {"matched_tokens": ["L", "E", "Commissioner", "ReVenue"], "snippet": "v ________ .......V 20.00 D. <mark>L</mark>. Martin, Janitor Clerks Office___________I,___________ _ ___ 24.00 <mark>E</mark>. R. Abbitt, <mark>Commissioner</mark> <mark>ReVenue</mark>, extending levies, c _______ 1,509.82"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "E", "Commissioner", "ReVenue"], "snippet": "v ________ .......V 20.00 D. <mark>L</mark>. Martin, Janitor Clerks Office___________I,___________ _ ___ 24.00 <mark>E</mark>. R. Abbitt, <mark>Commissioner</mark> <mark>ReVenue</mark>, extending levies, c _______ 1,509.82"}], "text_match": 3467833263446294649, "text_match_info": {"best_field_score": "4428100403200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263446294649", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [538.54, 263.01, 681.06, 650.75], "bbox_id": "89c09cf252", "file": "AppomattoxNewspapers_1962-1965a_0198.pdf", "page": 1, "text": "Rite Masons. Two Seek Sheriffs Post Incumbent Sheriff Walter S. Conner, appointed to fill the un expired term of David T. Robert son after Robertson was killed in an auto accident in 1960, seeks his first full term as sheriff, hav ing served as deputy sheriff under Robertson. Leslie L. Stan ley, retired State Police serg eant also seeks the post. Conner Conner will be seeking his first full term as sheriff. He was ap pointed by Circuit Court Jud Joel W. Flood to fill the unex pired term of Dave T. Robertson alter Robertson was killed in an auto accident in Dec., 1960. Conn er had been a deputy under Ro bertson since 1950. He is married and has two children, Neal and Gail, who are students at Appo mattox High School. Stanley Stanley, 59, retired recently from Virginia State Police after nearly 33 years service. Stanley is married to the former Vara Smith, of Appomattox. They have two children, Mrs. .psetta Sowers, of Richmond, and. Mrs. Shirley Gordon, of Los Angeles. Commissioner of Revenue Incumbent John C. Caldwell, 59, and Thomas E. OBrian, 24, have announced they will seek the Democratic nomination for commissioner of revenue. Cald well has been commissioner of"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "E"], "snippet": "Gordon, of Los Angeles. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> Incumbent John C. Caldwell, 59, and Thomas <mark>E</mark>. OBrian, 24, have announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "E"], "snippet": "Gordon, of Los Angeles. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> Incumbent John C. Caldwell, 59, and Thomas <mark>E</mark>. OBrian, 24, have announced"}], "text_match": 3467833263446294649, "text_match_info": {"best_field_score": "4428100403200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263446294649", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1400.67, 1148.75, 1553.97, 1808.76], "bbox_id": "52cfa0ce83", "file": "TimesVirginian_1980a_0054.pdf", "page": 1, "text": "time. What you moat? I tppomattox in 1961, and faced Tree Great Depres- skm. But the decade I recall moat was The Roaring Twen ties. Fresh from victory in World War I we wore aglow with wide and power. Wo had Mary Pfekfbr. Douglas Fair banks, Charlie Chaplin and Rudolph Valentino. Bobby Jones, BUI T ildes, Jack Dempsey, Red, Grange and Knots Rockne. Ah yea, Billy Sunday and Cal Coolidge. The Talking Movies. What a Decade. And how waa it in - Appomattox? Our Town was incorporated in 1925, with Barnes W. Cawthrene as first Mayor, followed by W. L. Drown and C. 8. McDearmon. C. W. Smith waa county dark, TL W. McKinney waa Sheriff, J. H. OBrien commissioner of .revenue, D. A. Conner game warden, R. F. Burke and then A I Burke treasurer S. L. Ferguson, H. D. Flood,- Joel W. Flood, prominent attorneys. I soiling local merchants were L. E. Smith, H. M. Burge, A. T. -Inge, J. D. and W. M. Morris, H. C. Pulliam, Will Smith, J. M. Rosser, Mias Emma 8ntith, Mr. and Ifrs. W. R. RaynMda, Chaa. V . James, and we had the leadership of A. R. Harwood, H. C. Babcock, L. M. Wilkes, Don .Moses, Prof. L. Crawley. Do you remember Mias Kate Franklin, Mias M. Anna Jones, C. K. Hunter, Rev. Peter Price, Rev. W. M. Thompson, Alee Ringham. R. W. Wilkins, B. G. Anderson, J. A. Burke, LeRoy  Smith, R. S. Wheeler, Walter -Stott, W. M. Hancock. JJkv D. N. Twyman, Das u . A. Christian, Jr., Baa Caldwell, E. T. Mitchell? JE . Sears. N. R. Featheratqa, nob Craig, Spflier Trent, M. P. Porter, T. W. Mooed, Rev. R. E. Redding. . Miaa Eula Mae Burke, Dr. H. G. AbMtt, Latter B. Harvey, W. T. Nash, A. A. Baldwin, and H. G. Johnson, and ao many fine penonaNMp of the tMOTal 1 could double the Hat.  . Appomattox la A Growing. Town and so many have helped - ,r"}, "highlight": {"text": {"matched_tokens": ["commissioner", "of", "revenue"], "snippet": "Sheriff, J. H. OBrien <mark>commissioner</mark> <mark>of</mark> .<mark>revenue</mark>, D. A. Conner game"}}, "highlights": [{"field": "text", "matched_tokens": ["commissioner", "of", "revenue"], "snippet": "Sheriff, J. H. OBrien <mark>commissioner</mark> <mark>of</mark> .<mark>revenue</mark>, D. A. Conner game"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [236.63, 974.91, 432.78, 1260.46], "bbox_id": "e3eb98c23c", "file": "AppomattoxNewspapers_1898-1902a_0665.pdf", "page": 1, "text": "The office of Commissioner of the Revenue for Appomattox county promises tc be a much coveted plum whenever it is pulled off. The candidates for the Democratic nomination will probably be Mr. H. C. Babcock, who came very near the goal at the last election when he was defeated by Mr. L. E. Smith on. S. C. Stratton, Mr. John W. Overton, deputy collector of taxes Mr. Rag-  land Feathers tone, school trustee. It is by no means certain that there will not be other candidates. The nomination for this office may occur at the time of holding the Congressional primary and the election on 2d Tuesday in November, 1903. The disposition of the con stitution makes things a little uncer tain. In the meantime gentlemen your formal announcement cards should appear in the T im es ."}, "highlight": {"text": {"matched_tokens": ["L", "E", "Smith"], "snippet": "was defeated by Mr. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark> on. S. C. Stratton,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "E", "Smith"], "snippet": "was defeated by Mr. <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark> on. S. C. Stratton,"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["L", "E", "Smith", "E"], "snippet": "Van Gilliam, Wm. Statham, <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, H. C. Babcock, <mark>E</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "E", "Smith", "E"], "snippet": "Van Gilliam, Wm. Statham, <mark>L</mark>. <mark>E</mark>. <mark>Smith</mark>, H. C. Babcock, <mark>E</mark>."}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1171.18, 589.89, 1344.57, 1803.48], "bbox_id": "a0285206c6", "file": "AppomattoxNewspapers_1926-1933a_0520.pdf", "page": 1, "text": "Supervisors a n d county of ficials of Appomattox county met at the court house Tues-  day night of this week and agreed to a slashing of the county tax rate and salaries.j The tax-rate will be cut t 1.50 and salaries will be - duced 10 per cent, it fit. agreed. The present i levies run from 1.80 to 1.95. The reduction is expected to cause a bolstering of confidence locally and will be warmly wel comed by tax payers. No con certed demand for a reduction had been made by citizens, but the supervisors and county of f a l s felt that the cut was in .ine with steps already taken by several other counties. The supervisors also felt it best to act in advance of widespread dissatisfaction that might be forthcoming if theratewere not . educed and wisely averted any m a s s meetings of tax payers such as a number of other coun ies have experienced. Th i s act is expected to renew confi dence in the administration of county affairs, and cooperation -vill now be sought in an effort -o avoid drastic cut in upkeep jf roads and the conduct of the jchools. The- statement signed by county supervisors, follows To T h e Taxpayers of Appo mattox Count Realizing the financial con dition of the farmers and citi zens of our county, brought about by the drought of last year, a n d the unprecedented depression whichwe are pass ing, and small demand and low prices for all farm products, and while all of us now receive the lowest salary and compen sation allowed by state laws, but desiring to help relieve the tax burden of o u r people to some extent, hereby express cur willingness and voluntarily agree to accept a ten per cent cut in salary or compensation for the year beginning January 1st, 1932, and pledge ourselves to do everything possible to practice economy in the admin istration of the county affairs, so that the county, school and road levy m a y be reduced to the lowest possible figure. The above ten per cent does not ap ply to the County Treasurer or the Commissioner of the Rev enue, as the reduction in levy automatically reduces their compensation more than ten per cent. C. W. Smith, Clerk R. L. Burke, County Treasurer Jo el W. Flood, Commonwealth Attorney H. W. McKinney, Sheriff J. H. OBrien, Comr. of Revenue J. A. Burke, Supt, of Schools F. A. OBrien, Supervisor Don Moses, Super visor T. E. Owen, Supervisor E. LeRoy Smith, Chairman School Board ,T. J. Ligon, Member School Board j  o! Davidson, Member School Board. ,, 111 viw of the, foregoing, we iu undersififned members of th e Board of Supervisors, whose duty it is to make up the bud get and fix the levy bf the coun ty, desire to state that we wish to do everything we can to low- er the tax rate to t h e lowest possible figure, consistent with sound financing and safeguard ing the institutions of our coun ty. We are sure we can make a substantial reduction in the levy for th e next fiscal year, and agree to make the total levy 1.50 on the 100.00 for all purposes, thus reducing the taxes of the people approxi mately 12,450.00. We real ize this means a substantial cut in county affairs, road building, and length of school term. This includes a reduction in the sal aries and wages of everyone employed by the county, but we feel that an emergency exists , Continued on Page 4"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of"], "snippet": "County Treasurer or the <mark>Commissioner</mark> <mark>of</mark> the Rev enue, as"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of"], "snippet": "County Treasurer or the <mark>Commissioner</mark> <mark>of</mark> the Rev enue, as"}], "text_match": 3463329665026883705, "text_match_info": {"best_field_score": "2229077737472", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3463329665026883705", "tokens_matched": 6, "typo_prefix_score": 0}}
