{"document": {"bbox": [397.95, 286.67, 562.82, 947.71], "bbox_id": "7eb9b0f336", "file": "AppomattoxNewspapers_1918-1922a_0282.pdf", "page": 1, "text": "At a meeting of the Board held at Cleric office Dec. 8present w H Llgou, L  Smith and 8 E Andenon, the following claim were allowed POOR HOUSE AND PAUPERS G W watgon, board and care of In mate to Dec. 16 80 00 Joe Woolrldge 3 00 Mr Sallie Reger 8 10 Mr Nannie Warner 2 60 C Roach Mann 4 00 Kate Petty for Frank Thornton 2 60 Ann John  60 Mrs Anna B Burton 2 CO Marshy Hancock 2 00 Marla Scruggi 2 00 Lou Conner 8 00 Ella Elliott 2 00 Humphrey North 2 60 Ossie May Flesh man 8 00 John Denni for daughter 6 00 Robert Fleshman 2 60 Sarah Giles, Dec. and Jan. 10 00 Ed Forbes 2 60 CONVICT ROAD MAINTENANCE 18 00 Henry Scruggs, painting bridges C, H. AND YARD D L Martin, cleaning, eto. SCALPS C W Smith to pay for scalps ELECTIONS A H Clement, printing ballots FGiWjLH KILLED Mrs Annie L Robertson, 2 turkeys CLERKS OFFICE . Everett Waddey CL Modern Index Corporation M L Barman, lights Appox Telephone Co T W Odor, kindling wood MISCELLANEOUS C W Smith, making and certifying list of oounty and district officers 8 L Ferguson, legal service regarding county farm B B Anderson, services as spoolal agent of Board L B Smith, same J w Flood, permanent improvements to office COMBS VIEWING ROAD E P Carson, locating road on W J Goodmans land J T Whitten, same J B Chilton, same A H Howerton, same H B Marshall, same 8 B Anderson, agent of the Board to look after the repairing of the flu at Bent creek bridge, made a Anal report to the Board wbioh tbe Board accepted whereas, under the law the Oounty Treas urer b entitled to have an office furnished him, which office la on the northern wing of tbe courthouse and W here as. sinoe Mr. Burkes Incumbency in office as treasurer he has not used this office and the same oas been used p?rt of the time by courtesy of Mr. Burke by H D Flood and was then turned over to 8 L Ferguson by courtesy of Mr. Burke sinoe bis election and Qualification at State senator, wbioh vacated his office as Commonwealths attorney and Whereas, tbe offices in the Clerks office building bad been formerly ooeupled since their completion by H D Flood as Common wealths attorney, and then by Mr. Fergu-"}, "highlight": {"text": {"matched_tokens": ["D", "Flood", "attorney"], "snippet": "their completion by H <mark>D</mark> <mark>Flood</mark> as Common wealths <mark>attorney</mark>, and then by Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood", "attorney"], "snippet": "their completion by H <mark>D</mark> <mark>Flood</mark> as Common wealths <mark>attorney</mark>, and then by Mr."}], "text_match": 2889111915907252345, "text_match_info": {"best_field_score": "3324294135808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111915907252345", "tokens_matched": 5, "typo_prefix_score": 0}}
