{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["David", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>Christian</mark>, Revenue was George W."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>Christian</mark>, Revenue was George W."}], "text_match": 2886860116630438009, "text_match_info": {"best_field_score": "2224782770176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2886860116630438009", "tokens_matched": 5, "typo_prefix_score": 0}}
