{"document": {"bbox": [1400.67, 1148.75, 1553.97, 1808.76], "bbox_id": "52cfa0ce83", "file": "TimesVirginian_1980a_0054.pdf", "page": 1, "text": "time. What you moat? I tppomattox in 1961, and faced Tree Great Depres- skm. But the decade I recall moat was The Roaring Twen ties. Fresh from victory in World War I we wore aglow with wide and power. Wo had Mary Pfekfbr. Douglas Fair banks, Charlie Chaplin and Rudolph Valentino. Bobby Jones, BUI T ildes, Jack Dempsey, Red, Grange and Knots Rockne. Ah yea, Billy Sunday and Cal Coolidge. The Talking Movies. What a Decade. And how waa it in - Appomattox? Our Town was incorporated in 1925, with Barnes W. Cawthrene as first Mayor, followed by W. L. Drown and C. 8. McDearmon. C. W. Smith waa county dark, TL W. McKinney waa Sheriff, J. H. OBrien commissioner of .revenue, D. A. Conner game warden, R. F. Burke and then A I Burke treasurer S. L. Ferguson, H. D. Flood,- Joel W. Flood, prominent attorneys. I soiling local merchants were L. E. Smith, H. M. Burge, A. T. -Inge, J. D. and W. M. Morris, H. C. Pulliam, Will Smith, J. M. Rosser, Mias Emma 8ntith, Mr. and Ifrs. W. R. RaynMda, Chaa. V . James, and we had the leadership of A. R. Harwood, H. C. Babcock, L. M. Wilkes, Don .Moses, Prof. L. Crawley. Do you remember Mias Kate Franklin, Mias M. Anna Jones, C. K. Hunter, Rev. Peter Price, Rev. W. M. Thompson, Alee Ringham. R. W. Wilkins, B. G. Anderson, J. A. Burke, LeRoy  Smith, R. S. Wheeler, Walter -Stott, W. M. Hancock. JJkv D. N. Twyman, Das u . A. Christian, Jr., Baa Caldwell, E. T. Mitchell? JE . Sears. N. R. Featheratqa, nob Craig, Spflier Trent, M. P. Porter, T. W. Mooed, Rev. R. E. Redding. . Miaa Eula Mae Burke, Dr. H. G. AbMtt, Latter B. Harvey, W. T. Nash, A. A. Baldwin, and H. G. Johnson, and ao many fine penonaNMp of the tMOTal 1 could double the Hat.  . Appomattox la A Growing. Town and so many have helped - ,r"}, "highlight": {"text": {"matched_tokens": ["H", "commissioner", "of", "revenue"], "snippet": "McKinney waa Sheriff, J. <mark>H</mark>. OBrien <mark>commissioner</mark> <mark>of</mark> .<mark>revenue</mark>, D. A. Conner game"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "commissioner", "of", "revenue"], "snippet": "McKinney waa Sheriff, J. <mark>H</mark>. OBrien <mark>commissioner</mark> <mark>of</mark> .<mark>revenue</mark>, D. A. Conner game"}], "text_match": 3467833264251601017, "text_match_info": {"best_field_score": "4428100796416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264251601017", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [719.27, 662.99, 879.3, 871.33], "bbox_id": "72e3c1e019", "file": "AppomattoxNewspapers_1902-1905a_0100.pdf", "page": 1, "text": "genial hospitality were shown me and I wish that I was able to thank you in more appro priate terms, but you must excuse this in your farmer friend. One tiling, which was but amusing, which I encountered in the canvass, was that I found more relatives of Mr. Smith than there are voters in the county and the others were pledged to him a year ago. Accept my grateful thanks for all kindness shown. I remain gratefully yours, H. C. BABCOCK.. So many of my kind friends voluntarily came to me and prof fered their support after the pub lication of tiie above card at the end of the last canvass, that I concluded then to be a candidate at the proper tim e for your votes for the office of Commissioner of Revenue again. I do hereby announce myself formally a candidate tor the office of Commissioner of Revenue of"}, "highlight": {"text": {"matched_tokens": ["H", "C", "BABCOCK", "of"], "snippet": "I remain gratefully yours, <mark>H</mark>. <mark>C</mark>. <mark>BABCOCK</mark>.. So many <mark>of</mark> my kind friends voluntarily"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "BABCOCK", "of"], "snippet": "I remain gratefully yours, <mark>H</mark>. <mark>C</mark>. <mark>BABCOCK</mark>.. So many <mark>of</mark> my kind friends voluntarily"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [924.26, 663.48, 1086.93, 894.55], "bbox_id": "9263dda272", "file": "AppomattoxNewspapers_1902-1905a_0138.pdf", "page": 1, "text": "F o r C om m ission er o f R even u e. So many of my kind friends voluntarily came to me and prof fered th eir support after the pub lication of my card at the end of the last canvass, th a t I concluded then to be-a candidate at th e proper tim e for your votes for the office of Commissioner of Revenue again. I do hereby announce myself form ally a candidate tor the office of Commissioner of Revenue of A ppom attox county, subject to theaction of the Democratic pri m ary. I f it be your pleasure to nom inate and elect me, I promise a faithful and im partial discharge of all th e duties of the office in person . R espectfully yours, H. C. BABCOCK."}, "highlight": {"text": {"matched_tokens": ["of", "H", "C", "BABCOCK"], "snippet": "all th e duties <mark>of</mark> the office in person . R espectfully yours, <mark>H</mark>. <mark>C</mark>. <mark>BABCOCK</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["of", "H", "C", "BABCOCK"], "snippet": "all th e duties <mark>of</mark> the office in person . R espectfully yours, <mark>H</mark>. <mark>C</mark>. <mark>BABCOCK</mark>."}], "text_match": 3467833263446294649, "text_match_info": {"best_field_score": "4428100403200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263446294649", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1867.91, 699.57, 2033.99, 904.87], "bbox_id": "afe15f215b", "file": "AppomattoxNewspapers_1922-1923a_0184.pdf", "page": 1, "text": "West Appomattox, Va., Sept. 1,1905. Mr. W. H. Camp, Petersburg, Va. Dear Sir Yours to hand and noted, and in reply will say I purchased two barrels of Camps Prepared Chemicals from your agent at. this point, Mr. Wingfield. I intend ed using it on corn, but as Commissioner of Revenue, I had lots of riding to do about that time and overlooked it. So when I came to plant tobacco I was iu a burry and did not tkc the time to mix it, but drilled it along side of a 3. 9. 8. guano, same proportion, 500 1 bs. to the acre, and I have never beeu able to tell the difference, It is ail fine tobacco. There is in experimenting station ou my farm, run .by the Bureau of Soils, and the Manager made considerable fun of me using Chemicafs. He seemed to doubt that it contained the ingredients it claimed to, so we drew a sample and he ook it to Washington and had it analysed. It ran 1 per cent higher on ammonia than you claimed and about the same ou potash. T know several parlies tha did use your chemicals according t. your directions this year with flue results. Very respectfully, II. C. BABCOCK"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "on corn, but as <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, I had lots <mark>of</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "on corn, but as <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, I had lots <mark>of</mark>"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1884.02, 689.01, 2049.14, 895.06], "bbox_id": "585f356277", "file": "AppomattoxNewspapers_1922-1923a_0179.pdf", "page": 1, "text": "West Appomattox, Va., Sept. 1, 1905. Mr. W. H. Camp, Petersburg, Va. Dear Sir Yours to hand and noted, and in roplv will say I purchased two barrels of Camps Prepared Chemicals from your agent at this point, Mr. Wingfield. I intend ed using it. nn corn, but as Commissioner of Revenue, I bad lots of riding to do about that time and overlooked it. So when I came tupian tobacco I was in a hurry and did not take the time to mix it, but drilled it along side of a 3. 9. 3. guano, same proportion, 500 lbs. to tbe acre, and I have never been able to tell the difference, it is all fine tobacco. There is an experimenting station on my farm, run by the Bureau of Soils, and the Manager made considerable Iuu of me using Chemicals. He seemed to doubt that It coutaiued the Ingredients it claimed to, so we drew a sample and he ook it to Washington and had it analysed. It ran 1 per cent higher on ammonia than you claimed and about tlie same ou potash. I know several parlies tba did use your chemicals according to your directious this year with fine results. Very respectfully, H. C. BABCOCK"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "nn corn, but as <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, I bad lots <mark>of</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "nn corn, but as <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark>, I bad lots <mark>of</mark>"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [236.63, 974.91, 432.78, 1260.46], "bbox_id": "e3eb98c23c", "file": "AppomattoxNewspapers_1898-1902a_0665.pdf", "page": 1, "text": "The office of Commissioner of the Revenue for Appomattox county promises tc be a much coveted plum whenever it is pulled off. The candidates for the Democratic nomination will probably be Mr. H. C. Babcock, who came very near the goal at the last election when he was defeated by Mr. L. E. Smith on. S. C. Stratton, Mr. John W. Overton, deputy collector of taxes Mr. Rag-  land Feathers tone, school trustee. It is by no means certain that there will not be other candidates. The nomination for this office may occur at the time of holding the Congressional primary and the election on 2d Tuesday in November, 1903. The disposition of the con stitution makes things a little uncer tain. In the meantime gentlemen your formal announcement cards should appear in the T im es ."}, "highlight": {"text": {"matched_tokens": ["H", "C", "Babcock"], "snippet": "will probably be Mr. <mark>H</mark>. <mark>C</mark>. <mark>Babcock</mark>, who came very near"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "Babcock"], "snippet": "will probably be Mr. <mark>H</mark>. <mark>C</mark>. <mark>Babcock</mark>, who came very near"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["H", "C", "Babcock"], "snippet": "Statham, L. E. Smith, <mark>H</mark>. <mark>C</mark>. <mark>Babcock</mark>, E. R. Abbott and"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "C", "Babcock"], "snippet": "Statham, L. E. Smith, <mark>H</mark>. <mark>C</mark>. <mark>Babcock</mark>, E. R. Abbott and"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [136.1, 591.48, 274.52, 1017.16], "bbox_id": "6877d8e956", "file": "TimesVirginian_1980a_0401.pdf", "page": 1, "text": "Mrs. CartThomas Canipe f Mrs. Rosella Babcock Canipe of Route 2, Rust- burg, died st her home Thursday. She was the wife n Carl Thomas Canipe. f She was born in Appomat tox County, a daughter of tile late Thomas Honier Babcock and Lottie Martin pabcock. She was the Commissioner of-Revenue of CampbellCounty from 1971- 1975 and she worked as a deputy commissioner in the revenue office for 33 years. She was a member of the Central United Methodist Church in Rustbur?. g In addition to her hus band. she is survived by five brothers. Dwight M. Bab cock and Thomas H. Babcock Jr., both of Rustburg, Charles H. Babcock of Blackstone, Wallace H. Babcock of Richmond, and Walter Babcock of Louisa One sister, Mrs. Frances Nelson of Richmond, and 11 nieces and nephews. A funeral service was conducted at II 7 a.m. Saturday from the Central -United Methodist Church by the Rev. David C. Moore- J field. Interment was in the Babcock family cemetery. Appomattox County. Diuguid Memorial Chapel was in charge of arrange ments. ."}, "highlight": {"text": {"matched_tokens": ["H", "Babcock", "of", "H", "Babcock"], "snippet": "both of Rustburg, Charles <mark>H</mark>. <mark>Babcock</mark> <mark>of</mark> Blackstone, Wallace <mark>H</mark>. <mark>Babcock</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Babcock", "of", "H", "Babcock"], "snippet": "both of Rustburg, Charles <mark>H</mark>. <mark>Babcock</mark> <mark>of</mark> Blackstone, Wallace <mark>H</mark>. <mark>Babcock</mark>"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [569.75, 199.69, 724.45, 1109.21], "bbox_id": "1656606022", "file": "AppomattoxNewspapers_1918-1922a_0363.pdf", "page": 1, "text": "Miss Macie Inge has return ed from a visit to Roanoke. Rev. J. M. Street, who bas been ill, is much improved. - Mrs VirgiHa Jones is visiting in Roanoke. Circuit court will open here Friday morning. Miss Nettie Moses spent last week with her cousin, Mrs. Curtis Harvey, in Pamplin. Mrs. L. W. Throckmorton and baby are back from a visit to Bedford. Mr N. 1 Wagers and wife are here. We understand they will make their home here. Miss Bell Byrne, of East Falls church, is a guest of her broth er, vV. H Byrne, here. Mrs. N H. Gregory leaves today for Roanoke to bear Billy Sunday. Mr. and Mrs. M. L. Earrnan have returned from an extend ed visit to tbe Valley. Havilab Babcock and sister, Miss Gallic, were visitors ben this week from Elon College. Mr. Jesse Turnon is recover mg from a broken arm, the result of cranking biscar. Miss Eula M. Burke is spend ing some time with her sick brother in North Carolina. Miss Addie Chandler, of Burkeville, visited her brother, Mr. C. C. Chandler, last week. Mr and Mrs. Price, father and mother of our townsman, Mr. E. T. Price, are on a visit here. George W. Lewis, J r , is a oew arrival and there is great rejoicing, even with thé chick ens. The Lynchburg Fair is on this week and many Appomat,. tox people are journeying to the Hill City. Mr. Richard Baber lost bis barn of 1800. sticks of tobacco last week oy Are on the farm it tbe Lte ür. D M. Robertson Mr. A. F Drinkard, of near Stapletou, continues sick, anc lias Laura 1 bell, who has jeen ill, is much better. Women over 21 years of age should see Commissioner of Revenue E R. Abbitt and reg ster, so they will be prepared to vote at the next election. New Butcher Shop at Appo mat tox I will bave fresh meat every day. I will buy all veal oalves. Call on me. 8 4t W J . L e G r a n d . I will receive sealed bids for Lunch privilege in building at Appomattox Fair until Mon day evening, October 4, at 8 p. m. E. L e R oy S mith , President. Billy Abbitte condition be came alarming a few days ago and the family was summoned to his bedside. After conference it was decided to remove him to a Norfolk hospital. He went down Monday. Tbe Sunbeam band of Holly wood church will bold its reg alar meeting on Saturday, October 2nd, beginning at 3 oclock p m. Every member invited to ittend."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. Abbitt and"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. Abbitt and"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [900.68, 648.49, 1064.35, 880.51], "bbox_id": "c972b7f075", "file": "AppomattoxNewspapers_1902-1905a_0121.pdf", "page": 1, "text": "For C om m issioner o f R evenue. So many of my kind friends voluntarily came to me and prof fered their support after the publ ication of my card at the end of the last canvass, that I included then to be a candidate at the proper time for your votes for the office of Commissioner of Revenue again. I do hereby announce myself formally a candidate tor the office of Commissioner of Revenue of Appomattox county, subject to theaction of the Democratic pri mary. If it be your pleasure to nominate and elect me, I promise a faithful and impartial discharge of all the duties o f the office in person . Respectfully yours, H. C. BABCOCK."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "for the office of <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> again. I do hereby"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "for the office of <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> again. I do hereby"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1446.91, 1704.89, 1768.47, 1790.03], "bbox_id": "d3fe1a6224", "file": "AppomattoxNewspapers_1902-1905a_0446.pdf", "page": 1, "text": "presents received bear testimony to physician  the popularity of tbe bride, h.pes for his speedy recove y. Mr. After the ceremony the bridal Babcock is a brother of our county- party drove to the borne of Mr. and man, Commissioner of tbe Revenue, I Mrs. T. J. Stratton, parents o e Homer C. Babcock. Hu friends  groom, aud were delightfully en h - here hope for him a spedy recovery. J tained."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "of Mr. and man, <mark>Commissioner</mark> <mark>of</mark> tbe <mark>Revenue</mark>, I Mrs. T. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "of Mr. and man, <mark>Commissioner</mark> <mark>of</mark> tbe <mark>Revenue</mark>, I Mrs. T. J."}], "text_match": 3465581464572133497, "text_match_info": {"best_field_score": "3328589234176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464572133497", "tokens_matched": 6, "typo_prefix_score": 0}}
