{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["George", "W", "Abbitt", "commissioner", "of", "revenue", "W"], "snippet": "J . R. Franklin, Treasurer <mark>George</mark> <mark>W</mark>. <mark>Abbitt</mark>, <mark>commissioner</mark> <mark>of</mark> the <mark>revenue</mark> and <mark>W</mark>. C. Franklin,"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "W", "Abbitt", "commissioner", "of", "revenue", "W"], "snippet": "J . R. Franklin, Treasurer <mark>George</mark> <mark>W</mark>. <mark>Abbitt</mark>, <mark>commissioner</mark> <mark>of</mark> the <mark>revenue</mark> and <mark>W</mark>. C. Franklin,"}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2302.22, 666.99, 2470.79, 825.58], "bbox_id": "74dcb6ac0a", "file": "AppomattoxNewspapers_1949-1952a_0451.pdf", "page": 1, "text": "For State Senate Chas. T. Moses House of Delegates, John B. Boat wright County clerk C. W. Smith County treasurer R. L. Burke Commonwealths attorney, George Abbitt, Jr. Commissioner of the revenue J. H, OBrien County sheriff D. T. Robertson Southside supervisor F. L. Mur- phy Clover Hill supervisor F. A. OBrien Stonewall supervisor F. J. Smith Justice of the peace T. W. Moses."}, "highlight": {"text": {"matched_tokens": ["George", "Abbitt", "Commissioner", "of", "revenue"], "snippet": "L. Burke Commonwealths attorney, <mark>George</mark> <mark>Abbitt</mark>, Jr. <mark>Commissioner</mark> <mark>of</mark> the <mark>revenue</mark> J. H, OBrien County"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "Abbitt", "Commissioner", "of", "revenue"], "snippet": "L. Burke Commonwealths attorney, <mark>George</mark> <mark>Abbitt</mark>, Jr. <mark>Commissioner</mark> <mark>of</mark> the <mark>revenue</mark> J. H, OBrien County"}], "text_match": 3470085063796850809, "text_match_info": {"best_field_score": "5527612293120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085063796850809", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2351.01, 524.79, 2496.43, 874.02], "bbox_id": "4cbc92f43a", "file": "AppomattoxNewspapers_1962-1965a_0274.pdf", "page": 1, "text": "1,336 voters from showing up at the countys ten polling locations. A total of 2,737 voters cast bal lots In toe primary. Unofficial returns Tuesd a y night gave 1,252 votes to Senator Charles T. Moses, Sr. 1,072 to Dr. W. A. Pennington, Stale house delegate from Bucking ham. Incumbent Commonwealth Attorney George F. Abbitt re ceived 1,262 and Commissioner of Revenue John C. Caldwell, 1,254. L. L. Stanley, running for sheriff, received 1,252. Incum bent J Garland Plunkett receiv ed 1,241. John C. Cole, running for Soutoside supervisor to re place retiring Fltz L. Murphy, received 631. Incumbent Stone wall District supervisor Otoo W. Martin received 345, and Incum bent Clover Hill supervisor Rich ard M. Webb received 313. - Two justices of the peace were elected from the Soutoside Dis trict Geraldine Mitchell, 449 votes and E.T. Guill, 577. Frfin the Clover Hill District, James .Wilson Franklin, 241, and wqjcm Kanipe, 179. World Traveler  To Speak Sunday"}, "highlight": {"text": {"matched_tokens": ["George", "Abbitt", "Commissioner", "of", "Revenue"], "snippet": "ham. Incumbent Commonwealth Attorney <mark>George</mark> F. <mark>Abbitt</mark> re ceived 1,262 and <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> John C. Caldwell, 1,254."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "Abbitt", "Commissioner", "of", "Revenue"], "snippet": "ham. Incumbent Commonwealth Attorney <mark>George</mark> F. <mark>Abbitt</mark> re ceived 1,262 and <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> John C. Caldwell, 1,254."}], "text_match": 3470085063394197625, "text_match_info": {"best_field_score": "5527612096512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085063394197625", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.35, 181.69, 1821.29, 1101.26], "bbox_id": "bdbafae3c0", "file": "AppomattoxNewspapers_1918-1922a_0362.pdf", "page": 1, "text": "Miss Macie Inge has return ed from a visit to Roanoke. Rev. J. M. Street, who has been ill, is much improved. Mrs VirgiHa Jones is visiting in Roanoke. Circuit court will open bare Friday morning. Miss Nettie Moses spent last week witb her cousin, Mrs. Curtis Harvey, in Pamplin. Mrs. L. W. Throckmorton and baby are back from a visit to Bedford. Mr N. E Wagers and wife are here. We understand they will make their home here. Miss Bell Byrne, of East Falls church, is a guest of her broth er, W. B Byrne, here. Mrs. N H. Gregory leaves today for Roanoke to hear Billy Sunday. Mr. and Mrs. M. L. Barman have returned from an extend ed visit to the Valley. Havilah Babcock and sister, Mies Oallie, were visitors hen this week from Elon College. Mr. Jesse Turned is recover mg from a broken arm, the result of crankiDg his car. Miss Eula M. Burke is spend ing some time with her sick brother in North Carolina. Miss Addis Chandler, of Burkeville, visited her brother, Mr. O. G. Chandler, last week. Mr and Mrs. Price, father and mother ,of our townsman, Mr. E. T. Price, are on a visit here. George W. Lewis, J r , is a new arrival and there is great rejoicing, even with the chick ens. The Lynchburg Fair is on this week and many Appomat tox people are journeying to the Hill City. Mr. Richard Baber lost hie barn of 1800 sticks of tobacco last week oy fire on the farm f the lute Dr. D M. Robertson Mr. A. F Drinkard, ot near Stapleton, continues sick, anc iiss Laura 1 bell, who has jeen ill, is much better. Women over 21 years of age should see Commissioner of Revenue E R. Abbitt and reg Ster, so they will be prepared to vote at the next election. New Butober Shop at Appo mat tox I will bave fresh meat every day. I will buy all veal oalves. Gall on me. 8 4t W J. L i G band . I will receive sealed bids for Lunoh privilege in building at Appomattox Fair until Mon day evening, October 4, at 8 p. m. E. L e R oy S mith , President. Billy Abbitts condition be came alarming a few days ago and the family was summoned to his bedside. After conference it was derided to remove him to a Norfolk hospital. Be went down Monday. The Sunbeam band of Holly wood church will hold its reg alar meeting on Saturday, October 2nd, beginning at 3 oclock p m. Every member invited to attend."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. <mark>Abbitt</mark> and reg Ster, so"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. <mark>Abbitt</mark> and reg Ster, so"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [569.75, 199.69, 724.45, 1109.21], "bbox_id": "1656606022", "file": "AppomattoxNewspapers_1918-1922a_0363.pdf", "page": 1, "text": "Miss Macie Inge has return ed from a visit to Roanoke. Rev. J. M. Street, who bas been ill, is much improved. - Mrs VirgiHa Jones is visiting in Roanoke. Circuit court will open here Friday morning. Miss Nettie Moses spent last week with her cousin, Mrs. Curtis Harvey, in Pamplin. Mrs. L. W. Throckmorton and baby are back from a visit to Bedford. Mr N. 1 Wagers and wife are here. We understand they will make their home here. Miss Bell Byrne, of East Falls church, is a guest of her broth er, vV. H Byrne, here. Mrs. N H. Gregory leaves today for Roanoke to bear Billy Sunday. Mr. and Mrs. M. L. Earrnan have returned from an extend ed visit to tbe Valley. Havilab Babcock and sister, Miss Gallic, were visitors ben this week from Elon College. Mr. Jesse Turnon is recover mg from a broken arm, the result of cranking biscar. Miss Eula M. Burke is spend ing some time with her sick brother in North Carolina. Miss Addie Chandler, of Burkeville, visited her brother, Mr. C. C. Chandler, last week. Mr and Mrs. Price, father and mother of our townsman, Mr. E. T. Price, are on a visit here. George W. Lewis, J r , is a oew arrival and there is great rejoicing, even with thé chick ens. The Lynchburg Fair is on this week and many Appomat,. tox people are journeying to the Hill City. Mr. Richard Baber lost bis barn of 1800. sticks of tobacco last week oy Are on the farm it tbe Lte ür. D M. Robertson Mr. A. F Drinkard, of near Stapletou, continues sick, anc lias Laura 1 bell, who has jeen ill, is much better. Women over 21 years of age should see Commissioner of Revenue E R. Abbitt and reg ster, so they will be prepared to vote at the next election. New Butcher Shop at Appo mat tox I will bave fresh meat every day. I will buy all veal oalves. Call on me. 8 4t W J . L e G r a n d . I will receive sealed bids for Lunch privilege in building at Appomattox Fair until Mon day evening, October 4, at 8 p. m. E. L e R oy S mith , President. Billy Abbitte condition be came alarming a few days ago and the family was summoned to his bedside. After conference it was decided to remove him to a Norfolk hospital. He went down Monday. Tbe Sunbeam band of Holly wood church will bold its reg alar meeting on Saturday, October 2nd, beginning at 3 oclock p m. Every member invited to ittend."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. <mark>Abbitt</mark> and reg ster, so"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "of age should see <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> E R. <mark>Abbitt</mark> and reg ster, so"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1406.14, 557.69, 1570.53, 691.39], "bbox_id": "75e81d77a8", "file": "AppomattoxNewspapers_1912-1915a_0506.pdf", "page": 1, "text": "BUCK IN u HAM. HOM. GEORGE J . HUNDLEY, JUDGE. Court meets Tuesday ter the 2nd Monday n November Tuesday after the 2nd Monday in March Tuesday attei the 2nd Monday in May Tuesday after the xud Monday in Sept. APPOMATTOX. t TreasurerE. F. Burke, Appomattox Sheriff F, W. McKinney, Appomattox, Deputy Sheriff -H. W. McKinney, Appo mattox. ClerkJ. JCHoraely, Appomattox. Attorney for CommonwealthS. L Fer guson, Appomattox. Commissioner of Revenue B. K. Abbitt, Appomattox. Xu ox. nutty SurveyorW, A. Mose, Appo ma t-"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "L Fer guson, Appomattox. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> B. K. <mark>Abbitt</mark>, Appomattox. Xu ox. nutty"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "Abbitt"], "snippet": "L Fer guson, Appomattox. <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> B. K. <mark>Abbitt</mark>, Appomattox. Xu ox. nutty"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["W", "Commissioner", "of", "Revenue", "of"], "snippet": "Wm. T. Johnson Sheriff <mark>W</mark>. J. Collins, <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> the Office <mark>of</mark> County"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Commissioner", "of", "Revenue", "of"], "snippet": "Wm. T. Johnson Sheriff <mark>W</mark>. J. Collins, <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> the Office <mark>of</mark> County"}], "text_match": 3467833263983165561, "text_match_info": {"best_field_score": "4428100665344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263983165561", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1354.1, 245.76, 1614.2, 989.97], "bbox_id": "a06c7ccbaa", "file": "TimesVirginian_1983a_0479.pdf", "page": 1, "text": "Continued from page 1  Thé April 14 issue indicated that the Town of Appomattox had refused to  alter its ordinance regulating video games, with video still prohibited in I puMte places from 11 p.m. Saturday to T a. m. Monday. Appomattox Copntians were shock- Id t o . learn in the April 21 Thoea-Virgbiian that a county native, . Staff Sgt. Ben H. Maxwell, had been killed in a terrorist attack on the U.S. Embassy in Beirut, Lebanon. In the final issue of the paper that month, readers learned that Watkins M, Abbitt, Jr., had been appointed by Gbv. Charles S. Robb to a state committee which would study the effects of proposed uranium mining and milling in the south-central portion of the state. The first paper in May brought news th at Appomattox County would participate in a statewide Whistle  Stop Relay slated for June. In the May 12 issue, readers learned that Martin  Webb had been appointed by the Appomattox Town Council to fill the  unoxpired portion  of W alter H. Buddy Carsons term on Town Council, and that Appomattox County Sheriff Gene Richardson would run for  re-election. The following weeks paper  carried news that Barbara R. Williams  had filed to run for re-election to the county clerks office. The May 26 issue noted that Virginia M. Babcock had received the states Meritorius Service Award for substan tial contributions to human services in j Virginia, and that R.B. Moore had been ! named president of the Woodmen of v the Worlds I Ate Insurance Society for t. Virginia.  In the June 2 paper, readers learned ! that three persons - Nelson Mann, ! Deborah Powell, and John Fedison - t would be considered for the vacant i South side District seat on the school J board. In that paper also, it was t announced that Monte Mays had filed i to run for re-election to the office of  Commissioner of Revenue in Appomat- J tox County..  ! One of the stranger stories of the a year was published in the June 9 paper, . following an unexpected visit to  Appomattoxs Triangle Plaza Shopping  Center by a black bear. That paper also  detailed the unveiling of a portrait of  retired judge George Abbitt in the  county courthouse.  The June 16 paper noted that  Deborah Powell had been selected by J the Board of Supervisors to serve on t t e countys school board, and that  .more than 100 people had participated f in the Whistle Stop Relay. f. The June 30 paper told of the Rèv.  Ron Gallaghers quest for a marathon a r preaching record. The following, week, , . .w p"}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "to the office of  <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> in Appomat- J tox"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "to the office of  <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> in Appomat- J tox"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.65, 895.48, 1759.17, 1097.65], "bbox_id": "bce58352c8", "file": "AppomattoxNewspapers_1905-1912a_0577.pdf", "page": 1, "text": "Col. Goo. W. A bbitt. As we go to press we hear of the sad death of Go! Geo. W. Abbitt. Ool. Abbitt has been a sufferer for some time and passed away last night, age 84 years. At one time be was Commissioner of Revenue of this County and later was County Clerk. He is survived by his wife, six sons and three daughters Messrs. Burr Abbitt, of Newport News Gus Abbitt, Lynch burg George, Hawley, Walter and OharleB Abbitt. His daughters are Mrs. White, of Lynohburg Mra Bernard, of Newport News, and Mra Covington, of this county."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "one time be was <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>of</mark> this County and"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue", "of"], "snippet": "one time be was <mark>Commissioner</mark> <mark>of</mark> <mark>Revenue</mark> <mark>of</mark> this County and"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2011.92, 528.98, 2354.6, 1191.81], "bbox_id": "b9559bd93f", "file": "AppomattoxNewspapers_1954-1955a_0247.pdf", "page": 1, "text": "Appomattox voters were given another contest today, as J. Alex Bingham announced as a candidate for county sheriff. He will oppose the incumbent, David T. Robertson, in the Democratic Primary Election of July 12. Contests have already been an nounced for county treasurer, com missioner of the revenue, and super visor in the Stonewall District. Mr. Bingham is a retired Lieute nant, Virginia State Police. He be gan police work in 1922 as an in spector. He was promoted to lieute nant in 1930 and assigned to the Central Virginia territory. In 1942 he became a Special Investigator of the Virginia Department of State Police. It had been reported here for sev eral weeks that Mr. Bingham plan ned on seeking the office of sheriff, but he made formal announcement to the Times-Virginian this week. His opponent, Mr. Robertson, was appointed by the court to serve out the term of the late H. W. McKin ney, and then four years ago won election for a full term. Both of these contestants are popular and experienced police offi cers. Abbitt Announces Commonwealth Attorney George F. Abbitt, Jr. informed the Times- Virginian this week that he would be a candidate for re-election. It is considered certain that he will not have opposition. Candidates for commissioner of revenue are the incumbent, J, H. OBrien, and H. H. Caldwell, Jr. Candidates for county treasurer are deputy treasurer J. Garland Plunkett, and Thomas Terrill Mar tin, local businessman. Contestants for supervisor in the Stonewall District are H. H. Scruggs and O. W. Martin, Jr. NOTICE . .  c  w All children who will begin school at Oakville, Vera and Spout Spring schools this fall, and have not bad their examination, please come to the Appomattox Health Center on Thursday, April 7, 1955, between 900 A. M. and 230 P. M. All other children who have not had their preschool examination please also come on this day, as this is the last day for these exami nations. ,"}, "highlight": {"text": {"matched_tokens": ["commissioner", "of", "revenue"], "snippet": "have opposition. Candidates for <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark> are the incumbent, J,"}}, "highlights": [{"field": "text", "matched_tokens": ["commissioner", "of", "revenue"], "snippet": "have opposition. Candidates for <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark> are the incumbent, J,"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2332.82, 574.2, 2480.17, 1130.69], "bbox_id": "963d84a357", "file": "AppomattoxNewspapers_1962-1965a_0143.pdf", "page": 1, "text": "A contest In all three magis terial districts of Appomattox County was assured. Friday with the announcement by Hubert B. Scruggs, of Stonewall District, that he will oppose incumbent Qtho W. Martin, Jr., of Oakville. Filing deadline for county can didates was midnight, Wednes day, April iu. In the Cloverhill District, in cumbent Richard Webb is op posed by David R. Wood, and a three - way race is underway in Southside District where John C. Cole dairy products producer, Joe T. Irby, shoe repair store operator, and J. Peyton Harvey, a farmer, have filed for the post left vacant by the retirement at the end of this term of Fitz L. Murphy, present chairman of the Board of Supervisors. Scruggs Files H. B. Scruggs, a native of Ap pomattox, is a livestock buyer for McKenna Meat Products Co., Lynchburg. A cattle raiser and farmer, also. Scruggs is married to the former Myrtle Alma Wright, and they have two daugh ters and two grandchildren. Scruggs is a member of Hebron Baptist Church, Marshall Lodge No. 39 AF  AM, the Wloodmen of the World, and the Scottish Rite Masons. O. W. Martin, Jr., of Oakville is a salesman for a hardware concern. In addition, he oper ates a store at Oakville. The Martins have two children. Other County Contests Incumbent Walter S. Conner and Leslie Lv Stanley will run for county sheriff, subject to the J3fnwppp.iie.- pilntary. Incumbent John C. Caldwell andTttontas E  OBrien will seek the Democra tic nomination for commissioner of revenue. Other incumbents who have announced their candidacies for re - election are commonwealths attorney, George F. Abbitt, Jr., and J. Garland Plunkett, treasur er.  Town Election"}, "highlight": {"text": {"matched_tokens": ["commissioner", "of", "revenue"], "snippet": "Democra tic nomination for <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark>. Other incumbents who have"}}, "highlights": [{"field": "text", "matched_tokens": ["commissioner", "of", "revenue"], "snippet": "Democra tic nomination for <mark>commissioner</mark> <mark>of</mark> <mark>revenue</mark>. Other incumbents who have"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2121.07, 499.97, 2290.17, 982.06], "bbox_id": "b655a36835", "file": "AppomattoxNewspapers_1955-1957a_0001.pdf", "page": 1, "text": "Tuesday, Nov. 8, is General Election day in Virginia, and a last minute effort is being made to get out a sizeable vote for Appomattox County. There are approximately 2,500 eligible voter in the county, but thus far there has been a min imum of interest, and the size of the actual vote is uncertain. To be elected are unopposed candi dates for the State Senate and the House of Delegates, and a slate of unopposed nominees for county of fices. Polling places will open at 6 A. M. and close at 6 P. M. There are ten precincts in the county. The candidates, all Democrats, are as follows For the State Senate, Chas. T. Moses. For the House of Delegates John B. Boatwright. For Commonwealths Attorney George Abbitt, Jr. For County Treasurer John G. Plunkett. For Commissioner of the Revenue J. H. OBrien. For Sheriff David T. Robertson. For Supervisor in Southside Dis trict F. L. Murphy. For Supervisor in the Stonewall District Otho W. Martin, Jr. For Supervisor in the Colver Hill District Richard Webb. For Justice of the Peace, South- side District Cree to be elected T. W. Moses, Mrs. Lucille S. Con ner and E. T Guill. The officials to be elected Tues day will take office in January. In appealing for a good turn-out of voters next Tuesday, the quality of the candidates listed and the im portance of the eounty maintaining a record for a large vote, were cited as reasons for everyone making an effort to cast their ballots."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "John G. Plunkett. For <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> J. H. OBrien. For"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "John G. Plunkett. For <mark>Commissioner</mark> <mark>of</mark> the <mark>Revenue</mark> J. H. OBrien. For"}], "text_match": 3465581464572133497, "text_match_info": {"best_field_score": "3328589234176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464572133497", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2208.64, 1596.99, 2385.5, 1844.82], "bbox_id": "2365435e44", "file": "AppomattoxNewspapers_1954-1955a_0438.pdf", "page": 1, "text": "An appeal for a sizeable vet.- in the Nov. 8 General Election for  -,e unopposed Democratic nominees  been made here by State Sem-. r Chas. T. Moses. He asks that A - pomattox maintain its tradition o f turning out a large wumher o f votes. Senator Moses and J. B. Boat wright head the ticket, as nomi-  nees for the State Senate and tho House of Delegates respectively. Nominees for the county oflk i are George Abbitt Jr. for f  t- monwealth Attorney J. Ca- nd Plunkett, for Treasurer, David T. Robertson for Sheriff, and J. H. OBrien for C Commissioner of the - Revenue. Unopposed nominees Supervisor are F. L. Murphy, Southside O. W. Martin, Jr., Stonewall, and Richard Webb Clover Hill. Voters will also name three unoppesed justices of the peace."}, "highlight": {"text": {"matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "H. OBrien for C <mark>Commissioner</mark> <mark>of</mark> the - <mark>Revenue</mark>. Unopposed nominees Supervisor are"}}, "highlights": [{"field": "text", "matched_tokens": ["Commissioner", "of", "Revenue"], "snippet": "H. OBrien for C <mark>Commissioner</mark> <mark>of</mark> the - <mark>Revenue</mark>. Unopposed nominees Supervisor are"}], "text_match": 3465581464572133497, "text_match_info": {"best_field_score": "3328589234176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464572133497", "tokens_matched": 6, "typo_prefix_score": 0}}
