{"document": {"bbox": [2206.27, 794.9, 2376.33, 897.84], "bbox_id": "d7c5e8c0d5", "file": "AppomattoxNewspapers_1947-1949a_0126.pdf", "page": 1, "text": "For State Senate Chas. T. Moses. For House of Delegates John B. Boatwright. For Commonwealths Attorney, W. M. Abbitt. For County Treasurer, R. L. Burke. For Sheriff H. W. McKinney. For Commissioner of the Revenue, J. H. OBrien."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "John B. Boatwright. For <mark>Commonwealths</mark> <mark>Attorney</mark>, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>. For County Treasurer, R."}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "John B. Boatwright. For <mark>Commonwealths</mark> <mark>Attorney</mark>, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>. For County Treasurer, R."}], "text_match": 2893615515668840569, "text_match_info": {"best_field_score": "5523317456896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2893615515668840569", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.99, 717.94, 1476.79, 926.88], "bbox_id": "189b144eb1", "file": "AppomattoxNewspapers_1933-1936a_0325.pdf", "page": 1, "text": "DEMOCRATIC TICKET Tuesdays Election NOVEMBER 5, 1935 For State Senator Charles T. Moses For House of Delegates John B. Boatwright For County Treasurer R. L. Burke For Commonwealths Attorney W. M. Abbitt For County Clerk C. W. Smith For Sheriff H. W. McKinney For Commissioner of Revenue J. H. OBrien For supervisor Stonewall District T. E. Owen For Supervisor Southside District Don Moses For Supervisor Clover Hill District F. A. OBrien"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "R. L. Burke For <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> For County Clerk C."}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "R. L. Burke For <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> For County Clerk C."}], "text_match": 2893615515668840569, "text_match_info": {"best_field_score": "5523317456896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2893615515668840569", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1323.35, 713.27, 1471.05, 921.07], "bbox_id": "0d65288504", "file": "AppomattoxNewspapers_1933-1936a_0326.pdf", "page": 1, "text": "DEMOCRATIC TICK ET Tuesdays Election NOVEMBER 5, 1935 For State Senator Charles T. Moses For House of Delegates John B. Boatwright For County Treasurer R. L. Burke For Commonwealths Attorney W. M. Abbitt For County Clerk C. W. Smith For Sheriff H. W. McKinney For Commissioner of Revenue J. H. OBrien For supervisor Stonewall District T. E. Owen For Supervisor Southside District Don Moses For Supervisor Clover Hill District F. A. OBrien"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "R. L. Burke For <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> For County Clerk C."}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W", "M", "Abbitt"], "snippet": "R. L. Burke For <mark>Commonwealths</mark> <mark>Attorney</mark> <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> For County Clerk C."}], "text_match": 2893615515668840569, "text_match_info": {"best_field_score": "5523317456896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2893615515668840569", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2197.15, 778.7, 2367.29, 873.0], "bbox_id": "30f845707e", "file": "AppomattoxNewspapers_1943-1947a_0179.pdf", "page": 1, "text": "W. M. ABBITT W. M. Abbitt, Appomattox Coun y Commonwealths Attorney, will be a candidate for election as del egate from th Eleventh Senator ial Distrie  to the State Constitu tional Convention to be hald April 30. Electlr . of delegates will be"}, "highlight": {"text": {"matched_tokens": ["W", "M", "Abbitt", "Commonwealths", "Attorney"], "snippet": "W. M. ABBITT <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>, Appomattox Coun y <mark>Commonwealths</mark> <mark>Attorney</mark>, will be a candidate"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "M", "Abbitt", "Commonwealths", "Attorney"], "snippet": "W. M. ABBITT <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>, Appomattox Coun y <mark>Commonwealths</mark> <mark>Attorney</mark>, will be a candidate"}], "text_match": 2893615515266187385, "text_match_info": {"best_field_score": "5523317260288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2893615515266187385", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [632.89, 339.05, 811.13, 659.83], "bbox_id": "218ea2d83b", "file": "AppomattoxNewspapers_1960-1962b_0101.pdf", "page": 1, "text": "casion to see a rare and prrvateuy printed booklet concerning the late Colonel George W. Abbitt. Mr. Abbitt was the grandfather of Re presentative Watkins M. Abbitt, and Commonwealths Attorney, George F. Abbitt, Jr., Mrs. L.- E. Conner, CoL Charles, Abbitt, Mr. Herbert Abbitt, Mrs. Ben Snead, and-many other prominent kinsmen here. We are taking the privilege of reprint ing much of the material from this booklet.- Editor. Obituary and War Record g of COLONEL GEORGE W. ABBITT of Appomattox County, Virginia George W. Abitt was born in what is now a portion of Appomat tox County on June 19th, 1828. As a boy and young man he was educa ted i.at Union Academy after gradu ating from this school he pursued the occupation of farming until the beginning of the Civil War at which time he was elected First Lieutenant of Company B, 46 Vir ginia Infantry, Wises Brigade. . George W. Abbitt as a soldier had come into his predestined sphere, his bravery, courage and"}, "highlight": {"text": {"matched_tokens": ["M", "Abbitt", "Commonwealths", "Attorney", "Abbitt"], "snippet": "of Re presentative Watkins <mark>M</mark>. <mark>Abbitt</mark>, and <mark>Commonwealths</mark> <mark>Attorney</mark>, George F. <mark>Abbitt</mark>, Jr.,"}}, "highlights": [{"field": "text", "matched_tokens": ["M", "Abbitt", "Commonwealths", "Attorney", "Abbitt"], "snippet": "of Re presentative Watkins <mark>M</mark>. <mark>Abbitt</mark>, and <mark>Commonwealths</mark> <mark>Attorney</mark>, George F. <mark>Abbitt</mark>, Jr.,"}], "text_match": 2891363715855155321, "text_match_info": {"best_field_score": "4423805829120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2891363715855155321", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2196.47, 592.66, 2489.04, 961.75], "bbox_id": "58b769587d", "file": "AppomattoxNewspapers_1962-1965a_0436.pdf", "page": 1, "text": "George F. Abbitt, Jr., 57, of Appomattox, was appointed Judge of the Fifth Judicial Circuit of Virginia, late Friday aft ernoon by Governor Albertis S. Harrison. Abbitt, who is a brother of Fourth District Congressman Watkins M. Abbitt, has been commonwealths attorney of Ap pomattox since he succeeded his brother in that position in 1948. He was appointed at th at time by the late Judge Joel W. Flood, whom he now follows as the circuit judge. ------------------------------------------- 1 The vacancy in the circuit judgeship occurred April 27, when Judge Flood died after an illness of several months. Thè. interim appointment was made by the governor and is effective until 30 days after the next General Assembly session, when as customary, formal election of the new judge will take placé. Judge Floods term was to have expired Feb. 1, 1970. Abbitt received the judicial nod over County Judge William P. Hay, Jr., of Prince Edward County. Delegations in behalf of both candidates appeared before Governor Harrison, prior to his decision. Abbitt Is a graduate of Appo mattox High School and holds a law degree from the University of Richmond. He entered private practice In 1931 in his home town and has been there since. He served as chairman of the Appomattox board of supervisors from 1942 to 1948. He had been appointed to the board by the late Judge Flood. Abbitt is a"}, "highlight": {"text": {"matched_tokens": ["M", "Abbitt", "commonwealths", "attorney"], "snippet": "Fourth District Congressman Watkins <mark>M</mark>. <mark>Abbitt</mark>, has been <mark>commonwealths</mark> <mark>attorney</mark> of Ap pomattox since"}}, "highlights": [{"field": "text", "matched_tokens": ["M", "Abbitt", "commonwealths", "attorney"], "snippet": "Fourth District Congressman Watkins <mark>M</mark>. <mark>Abbitt</mark>, has been <mark>commonwealths</mark> <mark>attorney</mark> of Ap pomattox since"}], "text_match": 2891363715720937593, "text_match_info": {"best_field_score": "4423805763584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2891363715720937593", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [448.54, 540.38, 892.52, 701.83], "bbox_id": "54b45c1c73", "file": "TimesVirginian_1980a_0014.pdf", "page": 1, "text": "The Appomattox County Nellie Almond, first, lieutenant governors representative Ab- Rescue Squad held its annual Pat Noble, training officer ner Scruggs, second lieutenant, dinner and installation of Dale Franklin, secretary se- senior and Richard Bsrtelt, officers fpr the new year on cond row, left to right, Grover sergeant of motor pool. Mike V _ s P. Beasley, Jr., captain Toby Weiss, elected sergeant of Restaurant. Attending were Inge, treasurer Harry Fergu- building .and grounds was not members of the local squad, son, Jr.,, vice president and present for the installation, their spouses, honorary mem- Andy. Scruggs, president and In addition to the officers bers and their spouses, and Mr. on the back row, lefteto right, installed, W. M. Abbitt is the and Mrs. W. Sam Kerr. W. Sam Kerr, Appomattox legal advisor for the Appomat- As another year of successful Commonwealths Attorney and tox County Rescue Squad and service to the citizens of . installing officer Ray Noble, . medical advisors are Dr. A- A. Appomattox County was noted, communicatons officer Bill Fratriek, Dr. J. A. Mathews, newly elected officers installed Noble, second lieutenant, jun- Dr. Kenneth .Powell, Dr. C. G. were, seated, left to right, for Pete Doss, board of OBrien, and Dr. Larry Smith."}, "highlight": {"text": {"matched_tokens": ["W", "M", "Abbitt"], "snippet": "row, lefteto right, installed, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> is the and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "M", "Abbitt"], "snippet": "row, lefteto right, installed, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark> is the and Mrs."}], "text_match": 2889111916309905529, "text_match_info": {"best_field_score": "3324294332416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916309905529", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.48, 1265.04, 2005.78, 1523.93], "bbox_id": "8d4a997591", "file": "TimesVirginian_1978_0020.pdf", "page": 1, "text": "k I The Appomattox County Board of Supervisors delayed action Friday on the proposed curfew and loitering ordinances j for Appomattox County when opposition emerged at the j meeting. After opposition was voiced I at a public hearing, the j supervisors asked W. S. Kerr, j . commonwealths attorney, to j develop a new curfew ordin- ! ance. According to the clerk of the board, Tommy Lawson, W. M. Abbitt, Watkins Abbitt, T. E. Sonny Conner, Rev. James Becker, Roland Murphy, Bill B ritton, Virginia Babcock, Delna Barksdale and Richard M artin opposed both proposed ! ordinances. They felt that  something should be done but"}, "highlight": {"text": {"matched_tokens": ["W", "M", "Abbitt", "Abbitt"], "snippet": "the board, Tommy Lawson, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>, Watkins <mark>Abbitt</mark>, T. E."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "M", "Abbitt", "Abbitt"], "snippet": "the board, Tommy Lawson, <mark>W</mark>. <mark>M</mark>. <mark>Abbitt</mark>, Watkins <mark>Abbitt</mark>, T. E."}], "text_match": 2889111916309905529, "text_match_info": {"best_field_score": "3324294332416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916309905529", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2121.07, 499.97, 2290.17, 982.06], "bbox_id": "b655a36835", "file": "AppomattoxNewspapers_1955-1957a_0001.pdf", "page": 1, "text": "Tuesday, Nov. 8, is General Election day in Virginia, and a last minute effort is being made to get out a sizeable vote for Appomattox County. There are approximately 2,500 eligible voter in the county, but thus far there has been a min imum of interest, and the size of the actual vote is uncertain. To be elected are unopposed candi dates for the State Senate and the House of Delegates, and a slate of unopposed nominees for county of fices. Polling places will open at 6 A. M. and close at 6 P. M. There are ten precincts in the county. The candidates, all Democrats, are as follows For the State Senate, Chas. T. Moses. For the House of Delegates John B. Boatwright. For Commonwealths Attorney George Abbitt, Jr. For County Treasurer John G. Plunkett. For Commissioner of the Revenue J. H. OBrien. For Sheriff David T. Robertson. For Supervisor in Southside Dis trict F. L. Murphy. For Supervisor in the Stonewall District Otho W. Martin, Jr. For Supervisor in the Colver Hill District Richard Webb. For Justice of the Peace, South- side District Cree to be elected T. W. Moses, Mrs. Lucille S. Con ner and E. T Guill. The officials to be elected Tues day will take office in January. In appealing for a good turn-out of voters next Tuesday, the quality of the candidates listed and the im portance of the eounty maintaining a record for a large vote, were cited as reasons for everyone making an effort to cast their ballots."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "Abbitt"], "snippet": "John B. Boatwright. For <mark>Commonwealths</mark> <mark>Attorney</mark> George <mark>Abbitt</mark>, Jr. For County Treasurer"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "Abbitt"], "snippet": "John B. Boatwright. For <mark>Commonwealths</mark> <mark>Attorney</mark> George <mark>Abbitt</mark>, Jr. For County Treasurer"}], "text_match": 2889111916175687801, "text_match_info": {"best_field_score": "3324294266880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916175687801", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2396.88, 619.84, 2544.51, 1299.9], "bbox_id": "794d18c940", "file": "AppomattoxNewspapers_1971-1973a_0011.pdf", "page": 1, "text": "No Democratic primary elec tion will be held in Appomattox county this year, according to Fourth District Representative Watkins M. Abbitt, who is also chairman of the Appomattox County Democratic Committee. There will be no primary be cause no candidates other than incumbents in various county offices filed to run in a Demo cratic primary. Deadline for filing was Wed., July 14. Incumbent county o f f i c e r s who filed before the deadline with the Democratic Committee chairman will, of course, be running as Democratic candid ates in the general election of Tuesday, Nov. 9. Other candidates for county offices have indicated their in tentions to run as Independent candidates in the November election, and a contest has de veloped for the office of county treasurer. Incumbent county treasurer is John Garland Plunkett. Announced Independent can didate is Mrs. Ida Belle Camp bell who at present serves as rfeput commissioner in the of fice of the Commissioner of The Revenue. Incumbent Democratic candi dates who will appear on the bal lot in November include James Eugene Richardson, s h e r i f f  John Garland Plunkett, treas urer Harry Gordon Lawson, Commonwealths attorney Otho W. Martin, Jr., supervisor from the Stonewall District and pre sent chairman of the board of supervisors. Also, O. Hunter Tolley, supervisor, Cloverhill District. In addition, David Harold Ka- nipe is running for the office of justice of the peace, Cloverhill District and G e r a l d i n e R. Mitchell, justice of the peace, Southside District. The incumbent Commission er of The Revenue, John Curtis Caldwell, has announced his candidacy and will run as an Independent. Incumbent supervisor for the Southside District, John C.Cole, has indicated that he will run for the same office in November as an independent but has made no public announcement of this."}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "attorney", "W"], "snippet": "urer Harry Gordon Lawson, <mark>Commonwealths</mark> <mark>attorney</mark> Otho <mark>W</mark>. Martin, Jr., supervisor from"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "attorney", "W"], "snippet": "urer Harry Gordon Lawson, <mark>Commonwealths</mark> <mark>attorney</mark> Otho <mark>W</mark>. Martin, Jr., supervisor from"}], "text_match": 2889111916175687801, "text_match_info": {"best_field_score": "3324294266880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916175687801", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "W"], "snippet": "not one, but two <mark>Commonwealths</mark> <mark>Attorney</mark> was <mark>W</mark>. C. law offices. One"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "W"], "snippet": "not one, but two <mark>Commonwealths</mark> <mark>Attorney</mark> was <mark>W</mark>. C. law offices. One"}], "text_match": 2889111916175687801, "text_match_info": {"best_field_score": "3324294266880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916175687801", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [2036.13, 640.24, 2373.54, 1112.47], "bbox_id": "4e71d14b6e", "file": "AppomattoxNewspapers_1954-1955a_0290.pdf", "page": 1, "text": "is heralded as one of the most sensational ever to be tried here. Arrangements are being made for a large press coverage of the trial. The opening day is expected to be occupied with selection of a jury. The jury will be quartered in Lynchburg at nights during the trial. Commonwealths Attorney George F. Abbitt, Jr. will be assisted in the prosecution by his brother, Re presentative Watkins M. Abbitt. The court-appointed attorneys for the defense are Barry Wall, Jr. and W. F. Watkins, Jr., both of Farrn- ville. There are reports that the prose cution plans to go up with the charge of shooting to death of Dr. Christ ian first. There was no indication that May berrys attorneys would ask for a postponement of the trial. The court had granted their request for a jury frqm a county, other than Appomat tox. The tragedy on the night of Feb ruary has attracted nation-wide pub licity. The defendant was finally arrested after an extended gun battle with a posse of state and county of- ficrs, being apprehended after re ceiving slight wounds, and after having held off the posse from the home and garage of the Evergreen residence. Tucker fell first, and Dr. Christ- Reason for the uncertainty is th e,ian wai!  ?d  delay in knowing how soon the sup-! epprosehed the res.dence afte . plier to Virginia will have approved merCy  OMIC vaccine ready, there has been some indication that it wilt be after June The state doe not have enough vaccine to undertake the second shot distribution. A new batch of vaccine is in process of being made, but it may require another three weeks,"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "Abbitt"], "snippet": "nights during the trial. <mark>Commonwealths</mark> <mark>Attorney</mark> George F. <mark>Abbitt</mark>, Jr. will be assisted"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "Abbitt"], "snippet": "nights during the trial. <mark>Commonwealths</mark> <mark>Attorney</mark> George F. <mark>Abbitt</mark>, Jr. will be assisted"}], "text_match": 2889111916041470073, "text_match_info": {"best_field_score": "3324294201344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111916041470073", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1340.19, 663.28, 1839.6, 816.55], "bbox_id": "94d2a2673d", "file": "AppomattoxNewspapers_1912-1915a_0463.pdf", "page": 1, "text": "I the greater part of her neefnl life until a few years ago when she moved to this county and made her home with her daughter, Mrs. W hitaker. Her remains will be in terred tomorrow in the family I grave-yard in Campbell County. She ia survived by four children as Appo- Cl8rk-J. B. Hortoly.Appomattox. Attorney for CommonwealthS. L. Fer-  m  to S S iT K o v e n u o -B . U. Abbitt. JSfy SurveyorW, A. Moses, Appomat-1"}, "highlight": {"text": {"matched_tokens": ["Attorney", "CommonwealthS", "m"], "snippet": "Appo- Cl8rk-J. B. Hortoly.Appomattox. <mark>Attorney</mark> for <mark>CommonwealthS</mark>. L. Fer-  <mark>m</mark>  to S S iT"}}, "highlights": [{"field": "text", "matched_tokens": ["Attorney", "CommonwealthS", "m"], "snippet": "Appo- Cl8rk-J. B. Hortoly.Appomattox. <mark>Attorney</mark> for <mark>CommonwealthS</mark>. L. Fer-  <mark>m</mark>  to S S iT"}], "text_match": 2889111915907252345, "text_match_info": {"best_field_score": "3324294135808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111915907252345", "tokens_matched": 5, "typo_prefix_score": 0}}
{"document": {"bbox": [1150.55, 1719.23, 1312.2, 1847.99], "bbox_id": "2d2f71b4a1", "file": "AppomattoxNewspapers_1892-1898a_0030.pdf", "page": 1, "text": "C oust Appomattox, Amherst. Buc ing- hate Lynohburg. Court of Appeal at Rich mond, and U. S. Courts St Lynchburg, and Commonwealths Attorney for Appomattox county. ______ ort 2 to w To the land owners of Southaide Pre cinct, Appomattox county, Va. Take notioe That in pursuance of an order of the County Court, wa, as proeesaioners appointed by the said Court to procession tea lands In South- aide precinct of said county, will begin our worit on the 17th day of October, IMS. and continue the same, with such adjournments m provided by law, until completed. J. B. ABBITT.  J. K. HANNAH, - V Processioners W. H. glWJS, j oetnts"}, "highlight": {"text": {"matched_tokens": ["Commonwealths", "Attorney", "w"], "snippet": "Courts St Lynchburg, and <mark>Commonwealths</mark> <mark>Attorney</mark> for Appomattox county. ______ ort 2 to <mark>w</mark> To the land owners"}}, "highlights": [{"field": "text", "matched_tokens": ["Commonwealths", "Attorney", "w"], "snippet": "Courts St Lynchburg, and <mark>Commonwealths</mark> <mark>Attorney</mark> for Appomattox county. ______ ort 2 to <mark>w</mark> To the land owners"}], "text_match": 2889111915504599161, "text_match_info": {"best_field_score": "3324293939200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2889111915504599161", "tokens_matched": 5, "typo_prefix_score": 0}}
