{"document": {"bbox": [1114.28, 475.65, 1266.6, 487.65], "bbox_id": "71ba1ad51b", "file": "AppomattoxNewspapers_1898-1902a_0218.pdf", "page": 1, "text": "CONFEDERATE REUNION"}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "<mark>CONFEDERATE</mark> <mark>REUNION</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "<mark>CONFEDERATE</mark> <mark>REUNION</mark>"}], "text_match": 1157451471441625209, "text_match_info": {"best_field_score": "2211897868544", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441625209", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1828.54, 953.9, 2157.81, 1244.25], "bbox_id": "d6fc8da112", "file": "AppomattoxNewspapers_1922-1923a_0469.pdf", "page": 1, "text": "Within sight of my home lives an I campaign. They are replenishing aged veteran, who works in the field fihir supply of Worses and having for his own living, walks as b risk ly their buggies repaired. They ar. as one of his sons, and seems in first very wise, iu that a nice horse and rate health.  bugKY ia a potent factor in a mat rimonial contest, Messrs. W. L. Ford and J. R. Hnghes attended the Confederate Reunion in Richmond. We can scarcely realize that so young a man as Mr. Ford actually fought in the war forty-two years ago. Ii certainly brings to onr minds the pathetic side , that so many young boys were brave enongh to want to light for what they thought to be right. We hope that the young men of this generation will be as prompt and eager to defend the right as their fathers were, Al though the north and south are being welded together, still we re member the hardsbipsour kinsmen had to endure."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "R. Hnghes attended the <mark>Confederate</mark> <mark>Reunion</mark> in Richmond. We can"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "R. Hnghes attended the <mark>Confederate</mark> <mark>Reunion</mark> in Richmond. We can"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [139.23, 1527.79, 716.09, 1762.03], "bbox_id": "66014faaf0", "file": "AppomattoxNewspapers_1908-1909a_0518.pdf", "page": 1, "text": "There are only a few of them left, those heroes who wore the Gray back in 1865. This week as the -nation observ ed the birthday of the immortal VERA,Mrs. Ida Beale and I Robert E, Lee, the attention of daughter, Mamie, of near Tow-1 the - editor was tumel toward -er Hill, are visiting her father, the heroes who still survive to S. T- Megginson, Sr. tell the story of the days lead-  We are very sorry to state ing over the tragic trail from  cliled toattend me and never ttiat the condition of Judson Bull Run to Appomattox. jbeen asked twte? to dpay a Kinney remains the same-  Four men, Daniel Ferguson, i bili, declared the veterdn. He -JS -  i 1 5  of below I Dick Ferguson, Tom Marsh is tall and straight now, keen Liberty Chapel, has returned and C- H- Coleman, now live in and active, almost as ever. Im home after spending a few Appomattox county, who were anxiously awaiting the next neighborhood and active as soldiers of the Con- Confederate reunion. It meets with menM. .  federacy. The editor inter- in Richmond Little Ellen Kinney is visitviewed one of them, Mr. Cole- The ranks ing her grandparents, Mr. land  man, this week. Jdra B- K. Moss, of Danville. Ä S  mm,"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "soldiers of the Con- <mark>Confederate</mark> <mark>reunion</mark>. It meets with menM."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "soldiers of the Con- <mark>Confederate</mark> <mark>reunion</mark>. It meets with menM."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.44, 953.95, 1611.95, 1027.05], "bbox_id": "f0f0799da4", "file": "AppomattoxNewspapers_1912-1915a_0184.pdf", "page": 1, "text": "The reunion this year of Mosbys command will be held in Fredericks burg on October 2, In connection with the Confederate reunion,, which will time, be held on the last day of the Fred ericksburg Fair. The command will hold its business meetings in the Courthouse."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "In connection with the <mark>Confederate</mark> <mark>reunion</mark>,, which will time, be"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "In connection with the <mark>Confederate</mark> <mark>reunion</mark>,, which will time, be"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.16, 305.39, 1932.19, 1505.49], "bbox_id": "3038cb579d", "file": "AppomattoxNewspapers_1902-1905a_0357.pdf", "page": 1, "text": "The eleventh annual reunion of the old Confederates who fought under Col. John S. Mosby was held at Ber- ryville, near which place during the war Mosbys men made many daring exploits. The meeting was presided over by Col. Joseph Bryan, of Rich mond. Hon. Marshall McCormick de livered the address of welcome and a memorial from the pen of Col. John Alexander, of Leesburg, on the death of Chaplain Sidney Ferguson was read. J. William Foster was elected president and H. S. Ashby adjutant. The reunion closed tonight with an entertainment by Polk Miller and his Old South Quartet. At its regular meeting Garland Rodes Camp, Sons of Veterans, of Lynchburg, selected as their sponsor for the coming Confederate reunion Miss Rebecca Martin and as maid of honor Miss Norvie Craighill. both of that city. The Veterans have invited ex-Gov. Francis T. Nichols, who is spending the summer at Chase City, to attend the reunion and be one of the speakers. _ A call was issued by George E. Caskie, chairman of the executive committee of the Virginia Sunday- School Association, for the-State con vention to be held at Lynchburg Oc tober 3 to 5 . A large number of local committees will go to work at once arid arrange for a large attend ance. The last State convention was hqld at Petersburg in March, 1902.   George W. Wilson, of Fancy Hill, Rockbridge county, aged 73 years, is dead. He was a descendant of the Wilsons of Tinkling Springs, Augusta county, and had traveled over the whole of the United States. James Norton, of Medford,_ Mass., has discovered what he claimi to be the richest nickel mine in the United States on the edge of Floyd county, 10 miles south o f ShaWsville, on the Norfolk and Western railway. The lead is said to be large and Mr. Norton has ordered machinery for de veloping the property. The find is- lo cated four miles from the property of the United States Arsenic Mines Com pany, which is being operated by Pittsburg capitalists. The City Engineer, of Roanoke, is sued a building permit to the Norfolk and Western Railway for the erection of a new passenger station in that city at an estimated cost of 99,000. The Roanoke City Council enacted a Pure Food and Milk law. A drastic anti-gambling ordinance just enacted by the Roanoke City Council provides for a fine of not less than 50 nor more than 500 fot gaming. Mayor Cutchin says that he will permit no games of chance at the Roanoke fair in September. Mayor Joel H. Cutchin, of Roanoke, who was recently re-elected, in an in terview said he had given his time, attention and very best efforts to the city for two years and that his poli tical opponents have made the posi tion as unpleasant as possible. The Council, he says, has continually fought him in everything he attempts to do in the interest of the city, and recent proceedings he fears is an in dication that the same tactics will con tinue in the new Council. If so, he cannot and will not stand it. Some whom he thought were. his friends have shown an animosity that does not please him. He says the salary, which is less than any officer, police man or blacksmith of the city, is no compensation for the duties he is called upon to perform, to say nothing of a continual wrangle with the Coun cil, which is annoying to him and humiliating and distasteful to his rela tives and family. The Mayor says that the office has destroyed his law business and the continued harassing has injured his health and peace of mind. He says that if present condi tions continue no gentleman can- or will be Mayor of Roanoke. W. E. Ehoflf, 26 years old, is under arrest at Newport News on the charge of housebreaking, committed nearly six years ago. Ehoff was then living with his parents in Newport News. When he learned that a warrant had been sworn out against him he went to Philadelphia. While living there he was married, and a few days ago reappeared in Newport News with two children. The celebrated suit for divorce of Mrs. Olivia Thurman from her hus band, Gen. Charles Thurman, a rich landowner of Clarke county, which has been before the public frequently during the last year, was settled out of court. A decree will be entered giving Mrs. Thurman a divorce a mens et thoro, which will become absolute in three years, when alimony will cease. Caroline County Camp of Confed erate Veterans has decided to raise 2,500 for the erection of a monument to the Confederate soldiers of that county who were killed or died in the service. Rev. A. C. Knibb. a ministerial stu dent at the Virginia Christian Colege, of Lynchburg, has been conducting a protracted meeting in a tent in West Lynchburg for six weeks and nearly 300 persons have professed conver sion. About 200 persons have been baptized and many others will receive the ordinance-in a day or two. A broken axle wrecked n ears of a freight train on the Atlantic Coast line near Emnoria. No one was hurt. Mrs. R. L. Pownell, of Sherman dis trict. near Romney, was badly scald ed in the face while boiling hops. Miss Elizabeth Booker, of Lynch burg. who was injured in a runaway a- nt, has recovered consciousness after Iving in a comatose condition for more than 75 hours."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "sponsor for the coming <mark>Confederate</mark> <mark>reunion</mark> Miss Rebecca Martin and"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "sponsor for the coming <mark>Confederate</mark> <mark>reunion</mark> Miss Rebecca Martin and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2242.29, 623.27, 2407.04, 775.82], "bbox_id": "ae6d29d60e", "file": "AppomattoxNewspapers_1892-1898a_0083.pdf", "page": 1, "text": "The Confederate reunion to tie . leld at Fairfax Court House on the  30th promises to be a most success ful affair. Among those expected be present are United States, enators John B. Gordon, of Georgia ! t. 0. Butler, of South Carolina ppa Hunter and John W. Daniel, Representative James 4 . Marshall, Virginia, and John Allen, Mississippi Col. Edmund Berkeley, Col. Arthur Herbert ajrd Capt. W. A. Smoot."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "The <mark>Confederate</mark> <mark>reunion</mark> to tie . leld at"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "The <mark>Confederate</mark> <mark>reunion</mark> to tie . leld at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [323.81, 1511.22, 1278.02, 1644.07], "bbox_id": "32a10107d8", "file": "AppomattoxNewspapers_1915-1918a_0369.pdf", "page": 1, "text": "The Confederate Reunion committee at Washington gave qu  a general or der from General George P. Harrison, commander-in-chlet of the United Con federate Veterans, urging full attend ance at the annual reunion at Wash ington, June 4-8. GERMANS TO GET WAR MEASURE, WOULÒ STOP FIREWORKS SALE, WANTS TO SAVE DAYLIGHT. MAY WORK GERMANS IN PARK. The Union Jack and the Stars and Stripes fluttered side by side in com radeship at Elba Station, Richmond, when nearly 2,000 citizens waved fare well to the citys contingent of nine young men who left for Canada to get Into uniform for fighting in France,"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "The <mark>Confederate</mark> <mark>Reunion</mark> committee at Washington gave"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "The <mark>Confederate</mark> <mark>Reunion</mark> committee at Washington gave"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [328.1, 191.87, 495.57, 966.76], "bbox_id": "31ddf475af", "file": "AppomattoxNewspapers_1905-1912a_0348.pdf", "page": 1, "text": "the Confederate reunion at Little Nock, singing the praises of the people of that city and with more of enthusiasm as  Old Reb. He tolerates no suggestion of a  lost cause, but insists that it is still liv ing and will live on to the end of time. Mr. Page Irving, of New York, has been on a visit to his brother, Dr. Irving. His first visit to Parm- ville for fifteen years and he hardly knew the place. And his friends did give him a cordial greeting. Miss Frankie McKinney, who has been visiting friends in New York for the past month is at home again. Miss Charlie Jones, who taught the past session at Hot Springs, is at home for the vacation. Miss Alii.e Graham, who was a student at the Mary Baldwin School during the past session, has return ed to her home at Hampden-Sidney. Mrs. Ellen C. Jones has gone to her home at Hampden-Sidney for the summer. Mr. R. Baxter Tuggle has return ed from an extensive Lusiners trip through the Sou hern States. Mrs. Ellen Guerrant and children have gone to Christianshurg for the summer Mr. Madison Armistead and Mrs. Armistead have gone to Weldon, N. C. on a visit to the parents of Mrs. Armistead. Mrs. W. R. Berkeley and the baby are back from a visit to the old home in Baltimore. This is alumnai year at the Nor mal and many of the number are ex acted to be present during com mencement week. Miss Mary Carrington, who had been at the Normal during the session, left for home before the ses sion closed on account of an irritat ing attack of poison oak. Rev. English preached each even ing during last week and twice on Sunday in the Presbyterian church to the delight and spiritual uplift of all who were privileged to hear him. He is one of the strong men of the church who preaches the Gospel in iits purity and power. His sermon on  Cross bearing was one of the most striking and convincing it was ever my privilege to listen to. He takes no long-faced view of Christi anity, and insists that all we have to do is to join the army of the liv- ng God, enlist under the banner of the Cross and then obey the com mand of our Leader."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "the <mark>Confederate</mark> <mark>reunion</mark> at Little Nock, singing"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "the <mark>Confederate</mark> <mark>reunion</mark> at Little Nock, singing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [440.17, 1023.59, 603.74, 1429.39], "bbox_id": "e15479d6de", "file": "AppomattoxNewspapers_1926-1933a_0013.pdf", "page": 1, "text": "The Confederate Reunion at Appomattox has been pronounced, a great success. It was a tre mendous task and a source of great pleasure that it was done so faithfully, nothing but praise anc congratulations are to be hearr from all sources for the splendic services rendered by the various committees and persons through out the town and county. Had it not been for the splendid co operation and the patriotic ser vice of everyone called on such a phenominal success would not have been possible. As Gen. Chairman, I wish to thank one and all for their noble work and self sacrificing labor in making the day such a happy one for the veterans. Hundreds of visitors expressed their highest praise of the splendid service rendered by the people of Appo mattox County. Those serving and bringing dinner deserve special credit for the splendid dinner served and those handling transportation and parking an to be especially congratulated ipn their work, as not a soul injured scratched. L. C raw ley ,"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "The <mark>Confederate</mark> <mark>Reunion</mark> at Appomattox has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "The <mark>Confederate</mark> <mark>Reunion</mark> at Appomattox has been"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.45, 670.48, 1615.81, 815.63], "bbox_id": "01c34f6ba2", "file": "AppomattoxNewspapers_1926-1933a_0112.pdf", "page": 1, "text": "State Confederate Reunion Army Veterans in the county who wishes to attend the State Reunion will please notify Miss Eula May Burke, Asst. Adjutant of the Appomattox Camp. Those veterans who go will be given the proper credentials for voting in the reunion as delegates .by Commander C. H. Coleman, or if more convenient, by Miss Burke."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "State <mark>Confederate</mark> <mark>Reunion</mark> Army Veterans in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "State <mark>Confederate</mark> <mark>Reunion</mark> Army Veterans in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.37, 648.32, 1593.17, 792.72], "bbox_id": "7f4f42c33a", "file": "AppomattoxNewspapers_1908-1909a_0112.pdf", "page": 1, "text": "State Confederate Reunion Army Veterans in the county who wishes to attend the State Reunion will please notify Miss Dula May Burke, Asst. Adjutant of the Appomattox Camp. Those veterans who go will be given he proper credentials for voting in the reunion as delegates .by Commander C. H. Coleman, or if more convenient, by Miss lurke."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "State <mark>Confederate</mark> <mark>Reunion</mark> Army Veterans in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "State <mark>Confederate</mark> <mark>Reunion</mark> Army Veterans in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2175.81, 532.75, 2340.07, 892.75], "bbox_id": "150aac05af", "file": "AppomattoxNewspapers_1918-1922a_0080.pdf", "page": 1, "text": "Rev. 8timpson began a pro tracted meeting at Trinity Methodist church on Sunday the congregation was not as large as it would have been if a meeting had not been going on at Mulberry Grove church at the same time Mr. Stimson and his family have1 made a good impression here. Mr. Peyton Moss, of Norfolk, visited his home here for the week end. Miss Mary E, Moss left this week for a trip to Riohmond. Messrs. George W. and W. Lee Patteson are contemplat ing a trip to Harrisonburg this week to attend the Confederate reunion. Mr J. P Andrews shipped s carload of cattle to Mr. Graham Currie at Riohmond last week The board of supervisor- meet here todayMondayam it iB probable that some actio will be taken in regard to join ing with Aupooiattox and oth er counties in establishing 1 poor house. There are only 5"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "week to attend the <mark>Confederate</mark> <mark>reunion</mark>. Mr J. P Andrews"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "week to attend the <mark>Confederate</mark> <mark>reunion</mark>. Mr J. P Andrews"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1103.06, 1159.21, 1259.28, 1484.61], "bbox_id": "4b79b3d3b4", "file": "AppomattoxNewspapers_1898-1902a_0288.pdf", "page": 1, "text": "Portrait Presentation . 1 The life-like portrait of Gen. John Echols presented to Stonewall Jackson Camp Con federate Veterans by his son, Hon. Edward Eobols, was unveiled at Staunton with Im posing ceremonies. The presentation speeeb was made by Capt. James Bnmgardner, Jr. Capt. H. M. Mcllhany, commander of the camp, received the portrait, whloh was un veiled by Miss Virginia May. Capt. T. C. Morton, chairman portrait committee, stated that this portrait would be the first of tbe Stonewall veterans to adorn the hall walls and urged friends of other deceased mem bers to follow Mr. Echols worthy example Shot In a Disreputable Bouse. Calvin McMillan, a married man, lies  the point of death as the result of two pistol shot wounds received at a disreputable house in Bristol. He was shot by Ella ODier, whe had warned him not to enter the house. Five shots were fired. The ODier womaD and two of her women associates are in jalL The Confederate Reunion. Division Commander James Mann has ap pointed Miss Frances Claiborne Spicer, of Petersburg, as sponsor-in-ehief for Vir ginia ot the Sons of Confederate Veterans at the reunion to be held at Louisville, Ky. Miss Spicer will designate Miss Lucy Wat son as her maid of honor. Lost Right Leg nnd Left Foot- J. H. Kellum, who lives at Wythevllle, attempted to jump a fast freight in the yard at Pulaski,missed his hold and had his right leg cut off above tbe ankle and his left foot mashed up. He 1 about 17 years old and was beating his war home from Pocahontas."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "are in jalL The <mark>Confederate</mark> <mark>Reunion</mark>. Division Commander James Mann"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "are in jalL The <mark>Confederate</mark> <mark>Reunion</mark>. Division Commander James Mann"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1228.52, 1738.64, 1381.63, 1876.41], "bbox_id": "bce7971166", "file": "AppomattoxNewspapers_1922-1923a_0043.pdf", "page": 1, "text": "Plan Part Of U. D. C. In Veterans Reunion. Plans for the participation of the United Daughters of the Confederacy in the great Confederate Reunion hero June 20-22, were formulated when three local chapters of the society met in the Hotel Jefferson. Mrs. Norman V. Randolph, chair man of the entertainment committee of the Confederate Southern Memorial Association and the U. D. C. for the reunion, has issued invitations to mem bers of Lee and Stonewall Jackson Chanters of the IT. D. C. to attend-"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "Confederacy in the great <mark>Confederate</mark> <mark>Reunion</mark> hero June 20-22, were"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "Confederacy in the great <mark>Confederate</mark> <mark>Reunion</mark> hero June 20-22, were"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [225.37, 780.49, 541.32, 1245.78], "bbox_id": "57e35b7d73", "file": "AppomattoxNewspapers_1905-1912a_0437.pdf", "page": 1, "text": "new tobacco coming in slowly. I am hoping for ieeord-breaking0Ud suburbs and may have corn prices. Six for primings shon d I to sell. Any how tho few acres did mean this, that is nniess the tobac- yield abundantly, co magnates have learne 1 the art of Capt. S. W. Paulett attended the making primings do the full work Confederate reunion at Newport of tobacco. And the are sharp I News, and gave the yell with more t irn u u v Inw. I of gnsto than others. The Conservatory rf Music is in Mr. B. J. Worsham, who has lived full swing, Mrs Schmidt, daughter I on a farm near HampdenSidney of the late Dr. Scheme!, being in since the close of the war, nas mad eharge. She I k said to be an artist application to be admitted to the of genuine gifts. I Soldiers Home at Richmond where I am impressed with the fact day te hopes to spend the evening of his by day that the Farm ville merchant life. Noble institution, and its in- who advertises most liberally is the I mates worthy of best things bestseller of gtods. Mr. J . E. Harris, of Prospect, Three marriages last week, and J who some time since announced his while the bell rung out merrily candidacy for the position of Com- three are missing, those a ho gavel misaioner of the B. venue for Prince eharm and cheer to them. Marri-1 Edward, has retired from tne race age is Heaven-ordained and Heaven- on account of continued ill health bleated yet it brings sadness as well Bev. Dr. and Mrs. Grammar, of as gladness. Giving over a dangh-1 Winchester, are guests in the home ter to the keeping of another is no of Dr. P. A. Irving light thing to do. Mrs. Cnmmings, ef Winchester, The High Bohool had an . imper- Ky., has.been on a short visit to her onator with them on last k riday siater, Mrs. Zornu, but it wasnt a drawing card. May-1 be too close on the heels of the cir -1 cut. The largest tranks of the season  are being received at our depot these days, and Sans Clans may be looked within them. But our first concern is for that Thanksgiving turkey. And it may be a gobbler, a large one at that, to measure well np to the demands of the day. Let the house wives, however, see to it that the"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "do the full work <mark>Confederate</mark> <mark>reunion</mark> at Newport of tobacco."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "do the full work <mark>Confederate</mark> <mark>reunion</mark> at Newport of tobacco."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1725.33, 798.96, 1885.28, 1052.34], "bbox_id": "9cd849ccd5", "file": "AppomattoxNewspapers_1908-1909a_0493.pdf", "page": 1, "text": "Mr. and Mns. J. _W. Scott, of New tYork, are spending some time in their country home here and with their children, W. W. Scott, and Mrs. S. W. Sears. Miss Ruby Cole is attending conference at Randolph-Ma- con College, in Lynchburg. She wassent as a delegate by the Methodist church here. . j .  Miss B. V. Harwood has re turned from Richmond, where she attended the Confederate Reunion and had charge of some group dances given as part of the entertainment. Mr. and Mrs. N. E. Ferguson and little daughter, Dorothy, Mr, and Mrs. S. H. Doss and daughter, Mamie, and Miss Catherine Webb motored to Oceian.View and Va Beach and spent the week-end. All enjoyed their selves riding the"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "where she attended the <mark>Confederate</mark> <mark>Reunion</mark> and had charge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "where she attended the <mark>Confederate</mark> <mark>Reunion</mark> and had charge of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [676.55, 604.88, 901.09, 638.13], "bbox_id": "bbd8d7a35c", "file": "AppomattoxNewspapers_1939-1943a_0421.pdf", "page": 1, "text": "MISCELLANEOUS OPERATING FUNCTIONS Supplies Selective Service ........... .. .................. Confederate Reunion Exp. veterans"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "MISCELLANEOUS OPERATING FUNCTIONS Supplies Selective Service ........... .. .................. <mark>Confederate</mark> <mark>Reunion</mark> Exp. veterans"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "MISCELLANEOUS OPERATING FUNCTIONS Supplies Selective Service ........... .. .................. <mark>Confederate</mark> <mark>Reunion</mark> Exp. veterans"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1260.47, 1253.05, 1398.43, 1397.7], "bbox_id": "77a6849c98", "file": "AppomattoxNewspapers_1912-1915a_0528.pdf", "page": 1, "text": "Lay Jackson Cornerstone 01 Reunion. J June 3 has been chosen by the M wall Jackson Monument Associtti being the most appropriate tnl the laying of the cornerstone j Stonewall Jackson Monument, m will be erected at the lntersecna Avemfe and the Bo On this date the grand parade j Confederate Reunion will be all veterans attending the rennwl be given an opportunity to taw j to the ceremonies incident 1 laying of the cornerstone."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "the grand parade j <mark>Confederate</mark> <mark>Reunion</mark> will be all veterans"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "the grand parade j <mark>Confederate</mark> <mark>Reunion</mark> will be all veterans"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.13, 1403.27, 1768.22, 1603.06], "bbox_id": "dfe22de94a", "file": "AppomattoxNewspapers_1912-1915a_0210.pdf", "page": 1, "text": "Is Orator At Confederate Reunion Held Near New Market. Harrisonburg.  Henry C. Stuart, Democratic nominee for Governor ot Virginia, was the speaker at the Con federate reunion held a mile north of New Market, Shenandoah county. Mr. Stuart was introduced by former Sen ator George B. Zeezell, of Harrison burg, as the next Governor. Mr. Stuart praised the valorous deeds of .toe Southern soldiers, upheld the con stitutional rights of secession and de clared that when the Chief Justice of the United States, a Confederate vet eran, administered the oath to Wood-1 row Wilson, a native of Virginia, the last span in the bridge across the bloody chasm was made. About 4,000 people were present from all parts ol the Valley."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "Is Orator At <mark>Confederate</mark> <mark>Reunion</mark> Held Near New Market."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "Is Orator At <mark>Confederate</mark> <mark>Reunion</mark> Held Near New Market."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [646.55, 255.6, 805.75, 1163.35], "bbox_id": "749435c7e4", "file": "AppomattoxNewspapers_1902-1905a_0561.pdf", "page": 1, "text": "In New York Mrs. Rose Schoomke, a former trapeze performer, w   was deserted by her husband, triedo hang herself, but the rope broke. Then she drank a liquid in which matches had been soaked. Before the poison became effective she tried to throw herself from a fifth-story window. In a speech at a Confederate reunion at McGregor, Tex., Senator Bailey de cried the remarks of President Aider- man, of the University of Virginia, in belittling modern statesmen of the South. It is stated that the fund necessary to meet the expense in the case of the ap peal of Johann Hoch, the Chicago Blue beard, has not been presented to the court. Sam Grice, a former British soldier, who once saved the life of General Rob erts in battle, was sentenced at Salt Lake City to 12 years in prison for bur glary. Edward Drouin died under mysterious circumstances at Peoria, 111 . He was the son of a former member of the fac ulty of the University of Pennsylvania. Twenty firemen were overcome by an explosion of tanks containing fats in a New York soap factory. They were rescued by their comrades. At Frederic, Mich., Mrs. Hedrich was arrested on the charge of the murder of her two little boys. President Jordon, of the Southern Cotton Association, has demanded the resignation of Vice President Peters of the organization. The Citizens Union of New York has issued a call for the nomination of Dis trict Attorney Jerome for mayor. President Roosevelt addressed the mineworkers and the Catholic Total Ab stinence Union at Wilkesbarre. General Lyon succeeds General Car nahan as head of the Uniformed Rank of Knights of Pythias. Eijiro Tagasugi, professor of English at the University of Tokio, says Russia must make peace. Capt. Jerome B. Osier, believed to be the oldest resident of Illinois, died at Chicago. Oscar Benson, a policeman, shot and killed his brother-in-law in Chicago. The boilermakers of the Chicago Great Western shops have struck. The Chicago police will pursue the gamblers who have taken refuge on a floating poolroom on Lake Michigan with a gunhnat. Two locomotives sank into a bottom less pit by the giving away of a sec tion of track at Crawford Junction, N. Y. The fire in the Humble oil field has burned itself out The loss is estimated at 350,000, with partial insurance. The third attempt to kidnap the young son of Governor Otero, of New Mexico, has been defeated. New records for the Army were es tablished at the tournament in progress at Fort Sheridan. President Harper, of the University of Chicago, will visit John D. Rocke feller, in Cleveland. An interchurch conference or federa tion will be held in New York, Novem ber 15. The applicants for lands on the Uintah Reservation have increased. An assignee has been appointed for the Western Bank at Denver. Mr. J. P. Morgan called at Sagamore Hill and had a conference with the President with reference to the Hankow Railroad in China, which that govern ment wants to buy from Mr. Morgans firm. The provincial governors of the Phil ippines, through Governor Wright, ask ed for a number of reforms. The con gressional committee gave a hearing to the sugar planters. Miss Ethel Delaney was arrested in Louisville, charged with complicity in murdering Cecil Crutchfield near Stan ford, Ky. The second annual encampment and reunion of the Spanish War Veterans will be held at Milwaukee, September 9. It is authoritatively announced in New York that Senator Goman will not be a candidatte for re-election. Frederick W. Vanderbilt will build another dormitory for the Yale Sheffield Scientific School. Fifteen electric light and gas compa nies in Luzerne county, Pa., have been consolidated."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "a speech at a <mark>Confederate</mark> <mark>reunion</mark> at McGregor, Tex., Senator"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "a speech at a <mark>Confederate</mark> <mark>reunion</mark> at McGregor, Tex., Senator"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1057.21, 1069.92, 1217.72, 1203.72], "bbox_id": "c54744cbdc", "file": "AppomattoxNewspapers_1905-1912a_0420.pdf", "page": 1, "text": "H arrisonburg. W. H. F urry, su perintendent of the almshouse, in anger struck Jam es Gray, a Confed erate veteran and Inm ate of the In stitution. In the Mayors Court F urry was fined 5 and given a short jail sentence. The town council dis charged him. F urry appealed to the Circuit Court, which Increased the fine to 20. F redericksburg. Col. R obert E. Lee, Jr., of Fairfax, has accepted an Invitation to deliver the address at the Confederate reunion to .be held here Septem ber 28."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "the address at the <mark>Confederate</mark> <mark>reunion</mark> to .be held here"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "the address at the <mark>Confederate</mark> <mark>reunion</mark> to .be held here"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1035.89, 1070.88, 1197.13, 1205.38], "bbox_id": "242fabaa0a", "file": "AppomattoxNewspapers_1905-1912a_0419.pdf", "page": 1, "text": "H arrisonburg. W. H. F urry, su perintendent of the almshouse, in anger struck Jam es Gray, a Confed erate veteran and inm ate of the in stitution. In the M ayors Court F urry was fined 5 and given a short jail sentence. The town council dis charged him. F urry appealed to the Circuit Court, which increased the fine to 20. F redericksburg. Col. R obert E. Lee, Jr., of Fairfax, has accepted an invitation to deliver the address at the Confederate reunion to .be held here Septem ber 28."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "the address at the <mark>Confederate</mark> <mark>reunion</mark> to .be held here"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "the address at the <mark>Confederate</mark> <mark>reunion</mark> to .be held here"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1346.89, 622.07, 1504.13, 1549.51], "bbox_id": "6b095d718f", "file": "AppomattoxNewspapers_1922-1923a_0013.pdf", "page": 1, "text": "Freeling.Intelligence just received here from Donkey, a little town some miles above here in the Cumberlands, states that Emerson Countiss, of that place, was shot and killed by prohibi tion officers on the Kentucky Side of the line. The man was a nephew of Peter G. Countiss, a respectable farm er of this place. Particulars of the affair are meager. Lynchburg.What is believed to be the shortest deed ever recorded here has just been filed for reco.rd In the clerks office of the Corporation Court. The text of the instrument reads For value received I hereby transfer all my right, interest and title in the property situated at 2000 Tulip street, In the city of Lynchburg, to my broth er, W. C. Morrissett. The deed Is signed by A. J. Morrissett. Fredericksburg.Maury Camp, Con federate Veterans, has elected the fol lowing delegates to the Confederate Reunion, to -be held In Richmond in June A. B. Bowering and Thomas F. Proctor, delegates, and John S. Musselman and Samuel Fitzhugb, al ternates. In addition to the delegates practically the entire membership of Maury Camp will attend the reunion. Tho veterans are much enthused re garding the coming reunion. Lexington.A half million dollars in Rockbridge county bonds were burned in the courthouse yard under the direction of the Board of Super visors. The bonds were cancelled a shdrt time ago by the Siiiifng Fund Commissioners, and the county was left without debt. The bonds em braced 420,000 in _Valley Railroad bonds 500,000 Northriver Canal bonds, and 20,000 county courthouse bonds. A large and interested crowd of spectators witnessed the burning Fredericksburg.A meeting was held at Stafford Courthouse to make plans for the organization of a cheese factory association and the erection of a factory near Stafford or Garrison- vllle. A temporary organization was effected with W. G. Sneed, president Milton Mountjoy, vice-president, and Churchill Gordon, secretaiy and treas urer. Arrangements were made to hold another meeting May 4, after which it is planned to erect a factory as quickly as possible. Winchester.  Commercial fruit growers here are much interested in the announcement that Governor Trinkle had signed a bill, introduced during the recent session of the Leg islature by Senator Byrd, prohibiting the sale or manufacture of Insecticides or fungicides unless such articles con tain proper ingredients and comply with the analysis as required in the bill. Samples will be analyzed by the State chemist without charge, and fer tilizer inspectors are required to take samples coming into the State for analysis. Manufacturers not comply ing with the law are to be prohibited from shipping such goods into the State. Norfolk.Physicians over the en tire State are being asked in letters which the Tidewater Automobile As sociatlon Is sending out to indorse the proposed special session of the Gen eral Assembly to vote for good roads bonds. The Norfolk County Medical Association has already adopted reso lutions favoring the bond issue, and the Soutbside Medical Association meeting last month in Suffolk led the way among the doctors of the State by urging the special session for the bond issue in order to benefit physi cians practicing In the country. The Norfolk County Medical Association is composed of members of the med ical profession in Norfolk, Portsmouth and the county, and is not, like the Southside Association, composed largely of country physicians."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "lowing delegates to the <mark>Confederate</mark> <mark>Reunion</mark>, to -be held In"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "lowing delegates to the <mark>Confederate</mark> <mark>Reunion</mark>, to -be held In"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [681.58, 1627.18, 1232.53, 1648.5], "bbox_id": "6dffab9a99", "file": "AppomattoxNewspapers_1912-1915a_0032.pdf", "page": 1, "text": "First Day, Grand Tournament and Confederate Reunion jûïlt Bby a Papiri Dont sell your Farm"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "First Day, Grand Tournament and <mark>Confederate</mark> <mark>Reunion</mark> jûïlt Bby a Papiri Dont sell your Farm"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "First Day, Grand Tournament and <mark>Confederate</mark> <mark>Reunion</mark> jûïlt Bby a Papiri Dont sell your Farm"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1742.14, 709.45, 2064.09, 732.24], "bbox_id": "10cb6fb11f", "file": "AppomattoxNewspapers_1912-1915a_0024.pdf", "page": 1, "text": "First D ay, Grand Tournament and Confederate Reunion and Parade."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "First D ay, Grand Tournament and <mark>Confederate</mark> <mark>Reunion</mark> and Parade."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "First D ay, Grand Tournament and <mark>Confederate</mark> <mark>Reunion</mark> and Parade."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1265.0, 618.92, 1398.5, 1371.76], "bbox_id": "79c5f7e0fe", "file": "AppomattoxNewspapers_1915-1918a_0381.pdf", "page": 1, "text": "Federal Vocation Aid. The State Board of Education fixed June 26 as the day upon which It will grant hearings to schools in the Ststi which will receive aid from the fund apportioned Virginia by the Fsdtnl government for vocational training, j committee of the board, composed ot Dr. J. A. C. Chandler and D. E. Cop haver, made a comprehensive report on the plan they suggest for dlstribni lng the fund among the various schodli engaged in vocational training work For all classes of work, Virginia wt receive about 32,000 the first you, The Smith-Hughes law, under whlcl the fund is apportioned, will becow operative in time for the schools to ceive the benefit of it this fall. Atthi meeting of the board on June 24, i decision will be made in the matter cl breaking up the school division, cob prising Winchester and the countia of Frederick and Clarke, and makiq of Winchester a separate division ! J. M. Davis, who. was elected by th board in April division superintended of schools ln Hanover county, after i spectacular local fight, declined to so cept the office, giving as hla reasa that the salary attached to the post tion is too small. This declination makes it necessary that the board name another man at the meeting a June 26. To Pay Cost Of Veteran Trip, Under the provisions of two recoil tions from the Committee on Finanei unanimously adopted under a suspei sion of the rules at the special meet ing of the Common Council, vetens frtjm the Soldiers Home will not ban to defray their expenses to the Unite! Confederate Reunion, which will  held in Washington June 4-8, and iffl also have their transportation cosh paid to the Gettysburg National Pul The first resolution appropriates 11 to help in defraying their eipemd from Richmond to Washington ml from that city to the Gettysburg bat tie field, where the monument to Ga eral Robert E. Lee will be unveiled The Finance Committee recommntt an amendment to the resolntkd which was adopted by the Connd providing for transferring the appm priatlon from the advertising acoool of the city. The committee re mended, in a second resolution, tbi the Reunion Committee of 1915 be U thorized to spend for the aame P pose 458.79, left In their hands M the reunion held in this city two yc ago. Both resolutions were appm at a special meeting of the committ Liberty Savings Clubn Persons of moderate means given the opportunity for patrloj action in purchasing Virginias sWJ ment of the  2 , 000 , 000,000 U k ! Loan, under plans worked out sub-com m ittee of the executive com tee for the sale of these bonds Richmond district. Every banking stitution will open . liberty  club, similar to Christmas a tion savings clubs, the avlngs which will be devoted to the P of one or more of the bon committee in co-operation wi 1 banking and brokerage Institution  the State is exerting every"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "expenses to the Unite! <mark>Confederate</mark> <mark>Reunion</mark>, which will  held in"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "expenses to the Unite! <mark>Confederate</mark> <mark>Reunion</mark>, which will  held in"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [394.78, 1604.29, 717.5, 1763.44], "bbox_id": "16219c3c7f", "file": "AppomattoxNewspapers_1926-1933a_0518.pdf", "page": 1, "text": "federacy, and he was with Lee at Appomattox. Pve never spent a whole day in bed, never had a doctor called to attend me and never been asked twice to pay a Four men, Daniel Ferguson, bill, declared the veteran. He Dick Ferguson, Tom Marsh is tall and straight now, keen and C- H- Coleman, now live in and active, almost as ever. Im Appomattox county, who were anxiously awaiting the next active as soldiers of the Con- Confederate reunion. It meets federacy. The editor inter- in Richmond. I always go. viewed one of them, Mr. Cole- The ranks are thinning fast man, this week.  now, but those of us left must C. H Coleman is now 89, he carry on."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "soldiers of the Con- <mark>Confederate</mark> <mark>reunion</mark>. It meets federacy. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "soldiers of the Con- <mark>Confederate</mark> <mark>reunion</mark>. It meets federacy. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [136.1, 244.17, 312.1, 1788.46], "bbox_id": "fff5349232", "file": "AppomattoxNewspapers_1912-1915a_0357.pdf", "page": 1, "text": "FARM V1 LliiS. Lettuce jjtowers were pieced with early shipments but us the days went by prices wont down, and de gpair took the place of hope. Lfit season it was said the crop of thu section was too early, this season the cry is, too l te. Hard to keep np witn a shitting market demand, or please people who oontrol the market. This is a hard blow to earnest workers. I had my first strawberries on the 9th. And they came from the homt j garden, and for the benefit of yoni readers 1 will add that the patch was well oovered.and the doth al lowed to remain on until all fear ot fiost bad gone. This means tha the berries are a week ahead of those in adjoining gardens. And while  week ahead on a small paten against another small patch doesnt cu much of a figure it would count largely where the berries are culti vated on a large scale for market. The judges who oouducted the lecent town primary hare recounted the rote and broken the tie between Mr. E.ambert and Mr. R. H. Pan lett. The former won and will en ter upon his eighth term a council man in September next. Captain Pan lett is back from the Confederate Reunion at Jackson - vide, and w ile he enjoyed the el-j bow-touch with old comrades, he confesses to a feeling of sadness when he missed from the gathering the great commanders, the Lees, j Johnstons, Hood, Hardee, Gordon, Forest, et id all gone to join Jack- son. Not long before the rank and file will be so th nnod that bnt few will answer roll oall, and by and by the one remaining. Mr. Samuel Nicholson, of Crewe, was in town today and said the new high bridge would be ready for nse by the middle of Jnly, and Lbat double tracking from Elam to Nor folk will come next. Daring a recent driv through a portion of Cumberland I was grati fied to find the farms l.oking so well and the work on them so far . advanced. Crimson clover, too, spread oat like a red sea of glory. And this means better crop and at the same time better soil. What we are doing with the crimson olo er, however, onr fathers did with the red top. That was the friend ot the tobacco lots and made of them the lichea spots on the farms. We are learning bnt 1 still insist that onr fa hen were not fooiisu people. The death of Mrs. J . A. Armi- stead removes from home, society  and ohnrca a woman of modes worth and of largest charity. Dr. E. H. Richardson, of Balti more, has been on a visit to Farm vlllelrieuds. A native of Farm vill who has made good in the home of hi, adoption. He is one of the surgeons ot John Hopkins and en joys an enviable reputation as physi cian and urgeon. Mr. and Mrs. T. V. Edmunds, of W mston-Sa em, are visiting ihe parents of Mr. Edmunds in their country home near town. Major J. R. Martin and asso iia.es own a number of acres on the Onm- berlanu side of the Appomattox, ad joining the lithia springs property, and if plans kow under considera tion mature, it will mean mneh io Cumberland and Farmville. Oat of a graduating class of 140 at the Normal, MisB Welker, oi Smitbfiuld, wins first honor and Miss Bristow, of Farmville, second. Ten others arc mentioned as having done e xcellent work. What an in fluence for educational uplift these 140 graduates will meau when they take up the work of the larger work field. Farmers tell me that the sea.on sc far has been ideal, the only note cl discord sounding oat from the conn try places is that many hogs are sick and some of them lying. And tne ill, ease is not said to be cholera No report bn the sheep industry since that seems to have become well nig obsolete. And tho more the pity. In my boyhood days wedding feast without a saddle of mutton end whole pig with an apple in the month, would have been reckoned among the feast-failures. Head quarters in such a saddle meant creature comfort at its climax. FarmviJe is represented at Vera Cruz by two sons of Mr. Lind, oi The Virgini Land Agency. They are members of a marine band and aid in making mnsic to stir soldier pulse beats. From the number of people who go to hospitals lor treatment unman ills mnst be on the ingrease, or else its fashionab.e. D r, Frank Nash and Mr. Pag Jrring, of W ashington, have been"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "is back from the <mark>Confederate</mark> <mark>Reunion</mark> at Jackson - vide, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "is back from the <mark>Confederate</mark> <mark>Reunion</mark> at Jackson - vide, and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [256.3, 263.46, 428.52, 1578.21], "bbox_id": "dc14ab35fd", "file": "AppomattoxNewspapers_1912-1915a_0553.pdf", "page": 1, "text": "FARM V ild b K , Summer heat in April and some folks war hind ? to remind me of the not. To tell  fallow mor tal that its hot on a very hot day ia sweltering and useless surplusage. And if only the showers had come too, though the same farmer said to me on yesterday, it always rains in  time. An optimist of the right i kind. An unsnal scene was witnessed in one.of our housholds recently. The cook was not efficient though very loyal, and tiie house wife deoided to employ another. This she did and when the fact was announced to the one in charge aha lifted her voice and wept. Her wails oould be heard for a square as she sobbed out, dont want to leave. 1 love every body here and dont want to go away. Her ones  prevailed and with all her faults she was retained. I confess that such expression oi loyality suprised me and I am not surprised that the mistress yielded to such pressure. Honest, humble, loyal, and such virtues oover s multitude of faults. Mr. W. W. Jackson brought to town this morning a load of oountry cured meahidrawn by a 700 pair oi mules andjthe sight was good for well eyes. A picture was taken of the meat and mules aud A s ild have wide ameftlat ion the cotiafey over This old Southstde is a  a any howand all v need do is to tell about it. And by the way, I fell heir to one of the hams and such a dinner is in store! I have been im pressed with my luck of late any how. Ten prises were given away by-Mr Mastin the jeweler, and 1 came in for one of them. But one way to aooount for it I was bora on the 13th day of the month, and you know tbatk Mr.  ilsons pet num ber. But the luck has been long time coming my way. Now that the evening has come it may be bright. It ii bright, for though a Confeder ate soidier form 61 to 65 I am still strong for work end have no idea of living witli any of my ohildren. And, then, I not only work but eat and sleep and now and then laugh. Wish I laughed more. Honors are ooming thick and fast on Ool A. J. Terrel He will look every inch the soldier when te puts on that new uniform and I expect to note how well he fills it on the Confederate reunion in 1 Richmond The Governor and his stall will he busy doing the honors during those days. And, then, Buckingham in sists that he goes back to the legis lature. I would love to see one law making body composed of a majority of suoessful farmers. Not that 1 love the lawyers less but the farmers more. And it must be admitted that the lawyers have had their day in ootort. Give the soil workers a chance. And I know of no more typical farmer than is Ool. Terrel Nor is he so wedded to farm life that he doesnt keep abreast of the ourrent events of the day. When a merchant, manufacturer er any other business man gets an efficient agent in their service they are slow to change. So it should be with honest and capable public servants who have experience joined with these qualities Tht living Confederates of Appo mattox are invited by tne Daughters to dine with comrade on the 20th. Let them all come for the ranks ate thinning and soon the last dinner and the last reunion. Soma one was good enough to send me the initial number of the Leghorn Journal and I have read it with interest. I must run up some day and go o rer that two re farm of Mr. Lewis about which I hear bo much. Thats the kind of demon- station work that appeals to me Judge Watkins and Mr. Tomp son are hard at it in the race for Commonwealth Atty. They are addressing the dear people from point to point in the county but there are no barbecues, no beer and no long green. No other county"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "fills it on the <mark>Confederate</mark> <mark>reunion</mark> in 1 Richmond The"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "fills it on the <mark>Confederate</mark> <mark>reunion</mark> in 1 Richmond The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [471.63, 1685.68, 794.18, 1708.18], "bbox_id": "c22a08a405", "file": "AppomattoxNewspapers_1912-1915a_0034.pdf", "page": 1, "text": "F irst Day, Grand Tournam ent and. Confederate Reunion and Parade. t"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "F irst Day, Grand Tournam ent and. <mark>Confederate</mark> <mark>Reunion</mark> and Parade. t"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "F irst Day, Grand Tournam ent and. <mark>Confederate</mark> <mark>Reunion</mark> and Parade. t"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1328.89, 673.86, 1479.31, 933.45], "bbox_id": "110c47a6fe", "file": "AppomattoxNewspapers_1892-1898a_0314.pdf", "page": 1, "text": "e x c u r s io n f r o m a p p o - M A T T O X T O R I C H M O N D T O R E U N I O N J U N E 3 0 T H . TheConfederate Veterans of Farm- ,11, Va., have chartered a special excursion train which will leave early in the morning of June 30th for Richmond, Va. This train will stop at all stations between Lynch burg and Farmville to take on any passengers who wish to attend the Confederate Reunion. There will he a special car for the Daughters of the Confederacy and also for any other ladies who wish to go. The Farmville Military Company and Baud will escort the crowd from the train to the grounds at Rich mond. Round trip tickets on this train from Appomattox to Rich mond and return 2.05."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "wish to attend the <mark>Confederate</mark> <mark>Reunion</mark>. There will he a"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "wish to attend the <mark>Confederate</mark> <mark>Reunion</mark>. There will he a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.18, 479.74, 1789.27, 1439.93], "bbox_id": "75727a24e5", "file": "AppomattoxNewspapers_1926-1933a_0009.pdf", "page": 1, "text": "Dont forget on June 11th the State Reunion of the Confeder ate Veterans will convene at the Old Courthouse and spend the day, and that the people of Ap pomattox County have the op portunity of showing their rev erence, respect and patriotism, perhaps for the last time to this honorable party. Bring your basket Come out and honor these old Veterans, many of whom have not been here since 65. They will arrive on the 10 oclock train from Farmville, and go at once to the Old Court House, where a pro gram has been arranged in their honor, after which a dinner for the entire party will be served on the grounds. The committees, ten in number, have all been ap pointed and the work is well or ganized to make the affair a per fect success. The Committees on Decoration have let the contract to decorate the entire town in an artistic manner. The committee on grounds have arranged for a large platform and seats in the shade of old Appomattox. Biing your dinner early and turn it over to the committees headquarters at the old jail. Mr. Raymond Lawson, Chair man of transportation will be glad to hear from any who will furnish cars to help take the old soldiers out and bring them back. This will be one of the history making dayâ of Appomattox County. , The brass band from Farm ville and the brass band from Charlottesville are both expected. The Pathe News Corporation has agreed to come and take pictures of the scenes of the day, which dhubtless, will be flashed on the screen all over the world. Come on boys. Lets make the old soldiers happy for the last time. Program will be in charge of Appomattox committee. 01 d Courthouse, Appomattox, Va. Reunion called to order, 1130 a. m. Address of welcome, S. L Ferguson. Appomattox. Response, Capt. S. W. Paulett, of Farmville. Address, Miss Anna Jones, president Daughters of the Con federacy. Unveiling of Confederate tab let.- Address, T. J. Browning. Dinner. Review of battlefields. Leave Appomattox on return trip to Farmville, where it will occur. On Thursday at Farmville Hon. St. Geo. Tucker will be principal speaker. L. Crawley, Chairman Confederate Reunion"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "speaker. L. Crawley, Chairman <mark>Confederate</mark> <mark>Reunion</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "speaker. L. Crawley, Chairman <mark>Confederate</mark> <mark>Reunion</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.52, 260.92, 1633.83, 540.47], "bbox_id": "6d7268177c", "file": "AppomattoxNewspapers_1926-1933a_0003.pdf", "page": 1, "text": "Confederate Reunion will meet at the Old C. H. June 11th. This is the first statewide meet ing ever held in Appomattox. Committees from all over the county are now being appoint ed to entertain the old soldiers. If you are on the committee dont fail to serve. - Board of Supervisors met yesterday and transacted the following business. An appro priation of 40 each for all Appo mattox Confederate Veterans who desire to attend the annual re-union at Birmingham. An appropriation of 300 for enter tainment of Confederate Veter ans here on June 11th. The road boards agreed to build base for marker and Board gave per mission to erect same on old C. H. lot at surrender grounds."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> will meet at the"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> will meet at the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [859.92, 1471.04, 1013.1, 1480.04], "bbox_id": "e8dfd7462d", "file": "AppomattoxNewspapers_1915-1918a_0100.pdf", "page": 1, "text": "CONFEDERATE REUNION IN MAY."}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "<mark>CONFEDERATE</mark> <mark>REUNION</mark> IN MAY."}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "<mark>CONFEDERATE</mark> <mark>REUNION</mark> IN MAY."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1174.54, 1605.93, 1328.95, 1737.33], "bbox_id": "4315fac188", "file": "AppomattoxNewspapers_1922-1923a_0023.pdf", "page": 1, "text": "Confederate Reunion Committee.  Arrangements for the annual re union of the United Confederate Vet erans, -to be held in Richmond June 20, 21 and 22, are rapidly being made, and reports from the camps of the vet erans, sons and daughters, are to the effect thht one of the greatest crowds ever recorded will attend the forth com I t  s reunion. Plans for. the re union will be similar to those of the 1916 meeting In this city, and will in dude parades, special programs and other features."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> Committee.  Arrangements for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> Committee.  Arrangements for the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1927.16, 925.31, 2088.87, 1199.14], "bbox_id": "bd6ed78f01", "file": "AppomattoxNewspapers_1912-1915a_0143.pdf", "page": 1, "text": "Confederate Reunion at Cen tenary. The Diana Mills Chapter U. D. C. will give an entertain m ent a t Centenary, Va.y June 3rd, at which time hope to see every Confederate Veteran present y  o  can pos sibly come. Free dinner to the veterans. A few crosses will also be bestowed on th a t day We hope to have some good speakers present, and will do all in our power to m ake the day a pleasant one for all pre sent. Everybody invited. Din ner twenty-five cents, ice cream, fruits, candies, c. at usual prices. Now dont for get tbe date, and everybody come and bring somebody with you. D iana M ills C hapter U. D. C."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> at Cen tenary. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> at Cen tenary. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.15, 1011.19, 1925.76, 1285.19], "bbox_id": "32ffb429b4", "file": "AppomattoxNewspapers_1912-1915a_0147.pdf", "page": 1, "text": "Confederate Reunion at Cen tenary. The Diana Mills Chapter U. D. 0. w ill give an entertain m ent at Centenary, Va., on June 3rd, at w hich tim e we hope to see every Confederate Veteran present.who can pos sibly come. Free dinner to the veterans. A few crosses w ill also be bestowed on that day. W e hope to have some good speakers present, and w ill do all in our power to m ake the day a pleasant one for all pre sent. Everybody invited. Din ner tw enty-five cents, ice cream, fruits, candies, c. at usual prices. N ow dont for get the date, and everybody come and bring somebody w ith you. D iana M ills C hapter , U. D. C."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> at Cen tenary. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> <mark>Reunion</mark> at Cen tenary. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1427.3, 1714.61, 1588.9, 1779.81], "bbox_id": "a3cabc3bbb", "file": "AppomattoxNewspapers_1912-1915a_0204.pdf", "page": 1, "text": "Col. R. E. Lee, Jr., of Fairfax, was the orator at the Confederate reunion held at Tapuahannock, In Essex conn ty, on the Rappahannock river, under the auspices of Wright-Latane Cam?. It was an all-day affair, and free din ner was served."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "the orator at the <mark>Confederate</mark> <mark>reunion</mark> held at Tapuahannock, In"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "the orator at the <mark>Confederate</mark> <mark>reunion</mark> held at Tapuahannock, In"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [132.01, 946.04, 292.98, 1056.79], "bbox_id": "4afc96bab1", "file": "AppomattoxNewspapers_1912-1915a_0220.pdf", "page": 1, "text": "Col. E. D. Cole has been appointed chief marshal for the Confederate reunion which will be held October 2 In connection with the Fredericks burg Fair. He will be assisted by Capt. M. B. Rowe,, Dan M. Lee and Col. W. H. Chapman, Mosbys com mand willparticipate in the reunion Mrs. John T. Goolrick has been ap pointed chairman of the -committee of women to arrange for the dinner to the veterans."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "chief marshal for the <mark>Confederate</mark> <mark>reunion</mark> which will be held"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "chief marshal for the <mark>Confederate</mark> <mark>reunion</mark> which will be held"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [141.78, 1443.28, 306.15, 1707.47], "bbox_id": "b2f9173364", "file": "AppomattoxNewspapers_1912-1915a_0137.pdf", "page": 1, "text": "Ceu Confederate Reunion at tenary. The Diana Mills Chapter U D. O. will give .an entertain m ent at Centenary, Va., on June 3rd, at which time we hope to see every Confederate Veteran present.who can pos sibly come. Free dinner to the veterans. A few crosses w il also be bestowed on that day W e hope to have some gooc speakers present, and w ill do all in our power to make the day a pleasant one for all pre sent. Everybody invited. Din ner twenty-five cents, ice cream, fruits, candies, c. at usual prices. Now dont for get the date, and everybody come and bring somebody with yon. D ia n a M il l s C h a p t e r ,"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "Ceu <mark>Confederate</mark> <mark>Reunion</mark> at tenary. The Diana"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "Ceu <mark>Confederate</mark> <mark>Reunion</mark> at tenary. The Diana"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1098.0, 788.41, 1262.0, 963.51], "bbox_id": "97cfa39201", "file": "AppomattoxNewspapers_1912-1915a_0565.pdf", "page": 1, "text": "Capitol Decorations. Governor Stuart yesterday awarded contracts for the decoration and Illum ination of the Capitol, State Library and Executive Mansion during the Confederate Reunion. Two separate contracts were made, one for swath ing the big buildings in hunting, flags and banners, which are to be tastefully arranged and draped, and the other tor illumination. Powerful limelights, distributed at points in the Capitol grounds are to be projected against the facades ot the State buildings after dark each night, bathing the decorated structures in a flood of brilliant light. The contracts were awarded to two local concerns."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "Executive Mansion during the <mark>Confederate</mark> <mark>Reunion</mark>. Two separate contracts were"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "Executive Mansion during the <mark>Confederate</mark> <mark>Reunion</mark>. Two separate contracts were"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1633.91, 1453.26, 1956.12, 1575.06], "bbox_id": "5845e584cb", "file": "AppomattoxNewspapers_1892-1898a_0257.pdf", "page": 1, "text": "but it would be a ruthless disturb ance of Uncle Sams meditations on the silver question, and conld have little other effect. Spain has quite as much as she Her I Daniel addressed five thousand peo- 1 can attend torn Cuba. Her great pie today at a Confederate reunion at  army has made  ! Martinsville.- _ Confederate monument was laid with I w L -P to g ress, Masonic honors. The military"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "pie today at a <mark>Confederate</mark> <mark>reunion</mark> at  army has made"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "pie today at a <mark>Confederate</mark> <mark>reunion</mark> at  army has made"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.69, 484.53, 1888.64, 1730.56], "bbox_id": "ad697d0673", "file": "AppomattoxNewspapers_1912-1915a_0562.pdf", "page": 1, "text": "Bucklngnam. The Board of Supervisors met here on Saturday last and closed a deal by selling to Buckingham capitalists 10,- . 000 worth of county bonds, and the road force will resume work today Monday after having had a rest. The Board will ask the Circuit Court to order an election to let the peo ple decide whether the county will borrow the sum of 40,000 t 9 be expended in road work. A proposition is now made to build a good road from Richmond to Lynchburg and if Buckingham will contribute the sum of 10,000 it is prob able th a t the route may be taken through this county. Mrs. Forbes, Mrs. Gilliam, Mrs. Norment and Judge John R Moss have all been quite sics the past week. Mrs. S. R. Bondurant and Miss Mary G. Glover were among the visitors here last Saturday Mr. L. W. Jones seems to be ge-ting on nicely w ith the post-office here It seems to be decided that Misses Jennie Shaw and her sister will not go to Richmond to live. Some of our good people lose out by placing too much con fidence in strangers, Miss Roma G arnett is to be one of the graduates at the Farm viile Normal School this term. Dr. and Mrs. Perkins Glover came up from A rvonia on Sun day morning to visit friends and relatives here. There was a fine rain here! on Sunday night and much! preparing will be done for to bacco as plants are nearly large enough Ao plant- Corn is looking unusually well de spite the dry spell we have had and where the land was well ordered before planting was done the crops are very promis ing. Hon. H. D. Flood is expected to deliver an address, here a t the closing of the High School and it is always a treat to hear this gifted orator. A m inister from Lynchburg has been in vited to preach to the student body on Sunday night, May 30th. On Wednesday night, June 2nd, there will be a gold medal contest. One gold medal will be given the girl student who presents the best recita tion. A gold medal will also be given the boy who delivers the best declamation. Diplo mas will bedelivered to two graduates, and the closing exercises will be held on Wed- night. Mr. Floods address, however, will be delivered ou Tuesday night. Clerks of School Boards are reminded that the time lim it for the taking of the school census is up on May 31st and t ieir books should be ready to deliver at the office of the Sup erintendent as soon thereafter as possible. Ih e contests for the Demo cratic nomination for Com missioner of Revenue is w ax ing warm. Messrs Snoddy and Elcan in D istrict No. 1, and Mdssrs. Camden and Moseley in District No. 2. Col. Albert Johnson Terrill has secured a fine saddle horse to ride in the parade at the Confederate Reunion a t Rich mond. Mr. Terrill is one of the Governors staff."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "the parade at the <mark>Confederate</mark> <mark>Reunion</mark> a t Rich mond."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "the parade at the <mark>Confederate</mark> <mark>Reunion</mark> a t Rich mond."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.17, 1018.53, 1835.39, 1828.31], "bbox_id": "82df54ad8a", "file": "AppomattoxNewspapers_1922-1923a_0253.pdf", "page": 1, "text": "Buckingham. I The meeting held here on the 14tii Jin the interest of the soldiers mon- j nmen t was a. success in every way,  socially, financially and intellectual- Jly. First, we had a feast of humor land flow of soul in a two-hours speech by Col. James Marshall, of Craig. The speaker was gracefully introduced by Col. It. T. Huba.d, who said he had rtood shoulder to shoulder with him in the Legislature in trying to save to the State th old Kanawah canal, and speaking of Col. Marshall as a big hearted man. Col Marshall opened by addressing himself to soldieis of every flag, col ored men of every hue. He then told of deeds of valor done by the Confi derate soldiers, bow at Antie- tum 35,000 Confederates, who were in a half starved condition, drove back 90,000 Federal soldiers. Every body sings the praise of the Con federates. Deep down in his heart is the love of home and the love of God. He has gone along filling the offices of duty and of destiny, and turning to Mr. E. W. Hubard oh, Edmund, all the offices of .emolu ment he could get. Then turning to the ladies he sad the smile of woman was the sweetest thing that had ever patting h s heart played I under his homespun jacket. Then turning to Sheriff Williams he said, Ben Johnson was a man modeled like you and I, and after he had found a woman that would consent to marry him she told him she had a secret she felt bound to divulge to him and then leave him to say If he wanted her. She then told him she had an uncle w 10 was hung. He said, why that is nothing. I had nine who ought to have been hung. The speaker said, I want to die with a smile on my face. I want it writ ten of me that I made more people laugh than cry. I have seen a Con federate soldier presiding over the Senate of the United States. I have seen one a judge of the Supreme Court. They have gotten all the good offices they could get. Some way, somehow, in the gret beyond, I think there will be a Confederate reunion. He spoke of how few of the old commanders were now liv ing, and mentioned M. B. Forest, the son of a blacksmith, who could not write in English sentence cprrectly, and yet was great on the field of battle. Said Forest was never known to write but one dispatch and this was when appealed to by some com"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "there will be a <mark>Confederate</mark> <mark>reunion</mark>. He spoke of how"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "there will be a <mark>Confederate</mark> <mark>reunion</mark>. He spoke of how"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [339.57, 828.44, 660.28, 1198.18], "bbox_id": "de1c6c1105", "file": "AppomattoxNewspapers_1898-1902a_0502.pdf", "page": 1, "text": "bix nu dais were offered in the High School this session  Mne is the surest and quickest cure ! scholarship, giveu every session in the world for all throat and lung! by Mr. A. H. Clemen, editor of the trouble. Regular sizes 50 cents and  -p IME8 aWarded to Alias Lucy Elesh- 11.00. Trial bottles free at J . R. Atwoods, West Appomattox at R. j alilU , , J . Carters Prospect. j English Essay, offered regularly j by Rev. Geo. Braxton Taylor, for 1 the three best English essays, The Historic lia veis, gavel used by General G. W. awarded to Air. Fred Driukard. Gordon at the Confederate reunion 1 in Memphis was made from sl tree  Mathematies, given by bupt. J . at Beauvoir, Jefferson Daviss old j . Hannah for best average in home. The gave! presented by G en. inaihematics, awarded to Miss Mary .Stephen 1. Lee was made from the ,, i. Reamer Star of the West, which re- j Ui lC0tK ceived the first shot of the war when j Penmanship, offered by M i. 1. K. it attempted to carry relief to Fort Wooldridge, for the greatest im provement in writing, awarded to Sumter. The Appomailux gavel, j which was sent, by Mrs. Oh - rles W.  Hunter to General John lb Go don, j Jommander-in chief, U. C. V., was i made from a tree on the battlefield j of Appomattox. It is painted witlij black euameline. The handle and I both sides of the mallet are capped j Food and Messrs. S. with gold, with a band of gold around the centre, bearing this in scription   Gen. J . B. Gordon, Com mander-in-chief U. C. V. From Mrs. 0 . W. Hunter, Appomattox TJ. D. 0. Aioiind tlie baud in the centre is insciibed the word  Appomattox. It is a beautiful and valuable sou venir."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Driukard. Gordon at the <mark>Confederate</mark> <mark>reunion</mark> 1 in Memphis was"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Driukard. Gordon at the <mark>Confederate</mark> <mark>reunion</mark> 1 in Memphis was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1395.85, 403.64, 1566.08, 1749.06], "bbox_id": "a2b4741492", "file": "AppomattoxNewspapers_1908-1909a_0493.pdf", "page": 1, "text": "Bifly BteelmpEurned to Varina after a Wwf visit here. Miss Naomi Hancock is visit ing relatives in Lynchburg. Richard C .Harvey visited his hbmefolks last week-end. Bore to Mr. and Mrs. John Guthrie June 17, a boy. Mrs. D. B. Henderson, of Richmond will spend next week will her mother, Mrs. S. L. Fer guson, here. Mr. and Mrs. Joe Ferguaon, of Providence Forge, spent last week-end here. Miss Eula May Burke is in Richmond attending the Con federate reunion. George F. Langran, Jr., is spending this week at Rent Creek. Mr and Mrs. R. A.-Lucado, of Oakville, were visiting home people Sunday. Miss Irene Guthrie spent a part of last week in Rich mond. Mrs. R. E Redding and two sons are visiting at her home in McClellansville, N. C. Mrs. G. F. James and Miss Addie White leave Tuesday for Alabama.  Charles James, Jr., is attend ing summer school at William and Mary. Mr. and Mrs. j. L. Cates visited in Burlington, N. C., the first of this week, Mr. and Mrs. Richard Law- son visited Mrs. A. A. Steele, of Roanoke, Sunday. Ben-Chapman, of Sdlem, visited Richard McDearmon Monday. Mrs. Helene Welch is attend ing summer session at Univers ity of Virginia. Miss Virginia Twyman is spending the summer with her fatfier, Dr. D. N j - Twyman.  Miss Agnes Christian is visit ing her sister, Mrs. G. P. Jen  ningA-fi ...........  Mrs. G. R. Gimbert and two children are visiting . Mr. and Mrs. C. A. Hancock. . . Mr. and Mrs. Thomas Guill are the happy parents of a fine baby boy, born June 9. Mr. and Mrs. G. W. Hatris were the guests of Mrs. Anne Durrum Sunday. Miss Florence Shirley Burks is spending this week With her sister, Mrs. H S. Johnson of Lynchburg. Bayiiard Burks has returned home after a three months visit with friends and relatives of Buena Vista. C. Y. Bingham, who has been working in Danville foi quite a- while, has moved to Halifax. Clarence Evans and family, of Evergreen have moved to Appomattox and are living in Miss Ella Wheelers house. A. R. Harwood and daugh ter, Eleanor, visited Mr. and Mrs. S. G. Harwood, at Victoria Tuesday. Mrs. G. L. Doss and Mrs. Ola Patterson spent Sunday at Buckingham C. H., with Mrs. P. J. Sheppard. Messrs. George Henry and John Stark, of Altoona, Pa., ar rive Saturday for a visit in the home of F. A. OBrien. Visitors to the Old Court House report that the state is soiling the road to the N. C. Monument Misses Vay Abbitt and Betty  Ambler McGill are visiting Mr W. T. Steele and other relatives here. Miss Catherine Gills and J. C. Davidson drove to Richmond Sunday. Kenard Gills return ed with them for a vacation at home. Mrs. Oscar Moss has been Helping Mrs. Childress recent ly and is now visiting her sister, Rtrs. Ola Furbush.  Mr. and Mrs. John Johnson H of Lynehburg spent the week end with Mr. Johnsons mother, Mrs. Cora Johnson. Misses Marguerite, Evelyn arid Edith Robertson and S. P. Smith, of Spout Springs, at tended the Confederate reunion i Richmond Wednesday.  Mrs. C. W Phelps, Mrs. Fan-  die Dixon, Mr. and Mrs. J. R. Marks and Mrs. Ida Marks were dinner guests at Mrs. G, F. Langrans Sunday.  Mr. and Mrs. C. Y. Bingham and Mr. and Mrs. H. .S John son, of -Lynchburg, were supper guests  of their parents, Mr.  and Mrs. R. L. Burks, Saturday I night."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Springs, at tended the <mark>Confederate</mark> <mark>reunion</mark> i Richmond Wednesday.  Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Springs, at tended the <mark>Confederate</mark> <mark>reunion</mark> i Richmond Wednesday.  Mrs."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1676.16, 329.32, 1996.41, 621.24], "bbox_id": "586597289e", "file": "AppomattoxNewspapers_1892-1898a_0242.pdf", "page": 1, "text": "After the crowd dispersed there was a meeting of the Veterans As sociation, of which Col. R. B. Poore, Major J. W. Flood, Judge Christian, J. C. Jones, L. R. Bagby and T. J. Stratton were appointed delegates to the Confederate Reunion, to be held at Charlottesville, Va. These gentlemen will present the question of the Appomattox Park at this Re union. Before another year has passed it is to be hoped steps will be taken to place stone head-pieces at the graves. It is also suggested that another vear ehe decorations take place in Mr. Franklin the case -will be car ried to the circuit court where Judge  ihe afternoon Tailor Berry, will pass upon it. Judge Berrys decision will be final A prominent gentleman of Appo mattox was in the city this morning and in the course of a conversation with the Advance reporter said that I Leading Clothier, corner Main 9th Streets. Lynchburg, Va 10.-22"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "appointed delegates to the <mark>Confederate</mark> <mark>Reunion</mark>, to be held at"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "appointed delegates to the <mark>Confederate</mark> <mark>Reunion</mark>, to be held at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1245.06, 429.35, 1384.61, 997.59], "bbox_id": "bf67017b4c", "file": "AppomattoxNewspapers_1912-1915a_0520.pdf", "page": 1, "text": "According to Chairman Jolmi the general committee of the m Confederate Reunion has fount i indication of hard times in it,. pign for the funds needed tor f tertainment of the veterans J The general committee has pledges from the public of Rich amounting to between 7,000 u 000, which, with the 25,000 an ated by the City Council and I 000 given by the State of makes p. total of about 43,000 disposal of the committee. Tills sum, while seemingly is not enough by any means proper entertainment of the c tinguished guests iu June, m is realized that Jacksonville spent 70,000 on the reunion, i tie Rock 60,000, it is evident much work in collecting funds i before the committee. Incideij Captain Lamb called attention t fact that Memphis, in asking lut for the 1915 Confederate Reunis nounced that 60,000 had a pledged in that city for the entt ment of the veterans. It is apparent from the mtu which Richmond is responding! call for money that this city I idea of doing less for the vein than Memphis, Jacksonville or Rock. Captain Lambs commits working all plans for the ment of the 10,000 veterans exp along the most economical si stent with the comfort of the guests. Noteworthy also is the fact I nearly 8,000 has been raised I campaign that has been conducted tirely by mail. More than l.OWfl ters have been sent to person! I subscribed to the entertainment jj for tv last Richmond reunion,! the pledges are coming in withi mail. It ? planned, however, a committee of the Richmond I Confederate Veterans conduct t e prebensive personal campaign! funds, beginning shortly. Tbe fact that this will probably tbe last, reunion to be held Ini mond. tbe old Confederate caplU quickening the interest of Sontf people in the. event, and it is I predicted that toe attendance of  itors will be unprecedented."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "committee of the m <mark>Confederate</mark> <mark>Reunion</mark> has fount i indication"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "committee of the m <mark>Confederate</mark> <mark>Reunion</mark> has fount i indication"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1457.31, 245.14, 1618.9, 422.88], "bbox_id": "90d417b35e", "file": "AppomattoxNewspapers_1902-1905a_0100.pdf", "page": 1, "text": "A naturally polished gavel, made from a tree on the Surrend r Ground, and a box of flowers of the choicest variety from the surrounding conn try, were sent from Appomattox by Mrs. C. W. Hunter to Hon. Paul Gapdeviile, Mayor of New Orleans, to be used in decorating the audito rium at the Confederate Reunion May 21st and 22nd in New Orleans. Also a box of historic flowers was sent to the Kirkwood Otey Chapter, U -1. C., in Lynchburg, to be used at the Union Convention of the U. J. C. May 20th."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "audito rium at the <mark>Confederate</mark> <mark>Reunion</mark> May 21st and 22nd"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "audito rium at the <mark>Confederate</mark> <mark>Reunion</mark> May 21st and 22nd"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1071.85, 312.28, 1259.47, 1789.16], "bbox_id": "e49033be01", "file": "AppomattoxNewspapers_1912-1915a_0528.pdf", "page": 1, "text": "A batch of thirty bills. Including sev eral of the measures supplementary to the main tax reform billB, received the I Governors signature. The last of the I batch was House bill . 141, which pro- 1 vides an appropriation of 27,500 to on- able the Richmond Light Infantry Blues to attend the Panama-Pacific Exposition at San Francisco as a mili tary organization representing the I Commonwealth of Virginia. I Following Is a list of the bills signed by the Governor . Senate MH 93 Amending certain sections and repealing certain sections I of Code concerning duties of Auditor I and commissioners of revenue In as sessment of taxes, to conform to sg I rogation. _ I House bill 82Fixing tax on bank Btook at 35 cents on the 310 or State, 1.15 for cities, 40 cents for counties and 75 cents for towns. House bill 10?General corporation tax bil. increasing franchise tax on steam railroads from 1 per cent jo 1H per cent of gross earnings, and putting express companies on percent age instead of mileage basis. House bill 74 Requiring fertilizer taxes to be paid into Treasury of State and be appropriated by General Assem bly, and paid out on approval of State Accountant. Senate bill 119 Appropriating 1.200 for additional stenographic services in the office of Attorney-General.  House bill 115Declaring cities of second class to be parts of judicial circuits for tax purposes under segre gation, with reference to duties of ex- I aminers of records. I House bill 142 Appropriating 600 I for relief of needy Confederate women  npt on pension rolls and not In any I charitable institution. House bill 120Declaring who shall vote In elections involving removals of courthouses. Senate bill 114Validating recorda tions of bills of sale In .certain in- l stances- House bill 133Fixing maximum town levy and maximum capitation tax for town of South  Boston, Halifax j County. I House bill 140 Extending time to treasurers for collection of taxes for I which they have already settled. House bill 138 Requiring Board of Supervisors of Norfolk County to ad vertise and sell bonds for road im provement House bill 136 Permitting school board of Tanners Creek District. Nor folk County, to borrow 20,000 for school purposes. House bill 134- Validating coupon bonds of toWn of South Boston. . House bill 143Requiring Board of, Supervisors of Spottsylvania county to let contracts for printing and adver tising to lowest bidder. House bill 126 Amending law au thorizing school board of Jerusalem District, Southampton County, to bor row money. House bill 122 Amending road law of Pulaski County. j House bill 119 -Permitting persons I over twenty-one years of age to aL tend public schools In certain cases and authorizing night schools for any age. _ .1 , Senate bill 112Authorizing Boards of Supervisors and Councils to appro- I priate money to pay expanses of vet- j rans to Confederate Reunion In Rich mond. . I House, bill 124 -r-RaUfylng proceed ings authorizing. .road bond  issue to.J Rohoboth District, .Lunenburg Conntyf j House bill 127 Authorizing Cum berland County to Issue bonds toy road purposes. House bill 128 Authorizing town of Rocky Mount. Franklin County, to ap propriate money to aid school In dls- j trlct outside town. j House bill 129 Authorizing city of J Winchester to issue 50,000 of refund-1 ing bonds.  - . j j House bill 130Authorizing County of Stafford to issue refunding bonds. House bill 132 Permitting levy of local capitation tax in town of Hons- I ton. Halifax County. House bill 145 Repealing a portion of the road law of Campbell County. House bill 131 Authorizing Count of Cumberland to levy tax on vehicles for road purposes. Senate bill 105 Authorizing city of Kllliamsburg to Issue bonds for sew er system and electric tight system. House bill 144 Amending road law l of County of Washington. House bill 141 Appropriating 7,500 for the transportation and expenses of the Richmond Light Infantry Blues to the Panama-Pacific International Ex position. Senate bill 17 Reclassifying indus trial sick benefit companies and in- I creasing rate of taxation from  to 1 per cent of premium Income. Senate bUl 94 Segregating intangi ble personal property to State, reclass ifying said property tor taxation and fixing rate thereon, with emergency clause added. I Senate bill 95Creating State Ao- visory Board on Taxation and county and city boards of review for equali sation of assessments, with emergency clause. Senate MU 111Providing license  tax on general auctioneers. i I Senate bill 98Defining powers and duties.. of coal taxing bodies under segregation plan. .House bill 147Relieving Henry Roach, of Charlotte County, of pay ment of fine improperly paid. Senate bill 66Providing road force service for men guilty of deserting wife of infant child, when failing to j pay amount prescribed by court. Senate bUl. 97Defining classes of property on which cities and towns may levy taxes under segregation. House bill 109Providing for levy ing taxes for sinking fund tor road I bond issues, under segregation. I House bill 108Providing for re- I demptios under segregation of local 1 bond issue for rand building."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "vet- j rans to <mark>Confederate</mark> <mark>Reunion</mark> In Rich mond. . I"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "vet- j rans to <mark>Confederate</mark> <mark>Reunion</mark> In Rich mond. . I"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [901.13, 913.87, 1065.09, 1084.37], "bbox_id": "903070241d", "file": "AppomattoxNewspapers_1902-1905a_0073.pdf", "page": 1, "text": "1 New Orleans Special. Preparations for the Confederate reunion, which be gins May 19, are now well under way. A number of novel features will be in troduced. Each State division will have a band preceding it in the parade. Fourteen young ladies of the highest Confeder ate standing, will ride in a beautifully decorated tally-ho at the head of the parade, and will be known as heralds. They will be dressed entirely in white and will have banners denoting the State they represent and the coats of arms of the States will be wrought in flowers on the sides of the tally-ho. The tally-ho will be preceded by the Memphis Bugle Corps of 45 pieces,- composed of young society, men, who have been training for the purpose."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Special. Preparations for the <mark>Confederate</mark> <mark>reunion</mark>, which be gins May"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Special. Preparations for the <mark>Confederate</mark> <mark>reunion</mark>, which be gins May"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [536.65, 328.65, 797.18, 467.11], "bbox_id": "9b82b05863", "file": "AppomattoxNewspapers_1908-1909a_0077.pdf", "page": 1, "text": "0. P. Aivis,. service as member of Local C. W. Smith, services as clerk of Local C. W. Smith, Clerk, Inv. and rept. on Treas. bond and cer. County and District pffieers ----- - ------ - ------ - f -  T. A Drinkard, Jury Commissioner -  ---------   J. H. OBrien, Jury Commissioner  ______  ------   ---------- Ik B. Smith, Jury Commissioner ____ ____ _  - -  -------  Treasurer of Virgihia, appr. for forest Are protection  - ----- ireasurer of Virginia, tax on basic prem. workmans compensa tion law - __ , ____ 1 - ---- - ----------- --------- - - T C. W. Smith, Clerk, to defray expenses old soldiers to reunion S. E. Anderson, exps. as rept. in int. joint poor house --------- Robert Irby, stamped envelopes ______  _________ - ----- - J. A Burke, Treas., Chamber Commerce appr. for Confederate reunion expenses _ _____  _ ____ ____  - --- -------------- À. R.. Harwood, Treas., to decorate buildings- a - _ --------"}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Chamber Commerce appr. for <mark>Confederate</mark> <mark>reunion</mark> expenses _ _____  _ ____ ____  - --- -------------- À. R.. Harwood,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Chamber Commerce appr. for <mark>Confederate</mark> <mark>reunion</mark> expenses _ _____  _ ____ ____  - --- -------------- À. R.. Harwood,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.78, 1068.96, 2321.14, 1417.4], "bbox_id": "3ec9f28318", "file": "AppomattoxNewspapers_1908-1909a_0009.pdf", "page": 1, "text": ". Coksto quickly at gas, says Battle I expert I Come on hoys, the old soldiers happy for tee ast time.  . Program will be in charge of Appomattox committee. O ld Qourthousé, Appomattox, Va. Reunion calledhto order, 1130 a. m. Address of welcome, S. -L Ferguson. Appomattox. Response, Oapt. S. W. Pauiett, of Farmville.  Address, Miss Anna Jones, president Daughters of thè Con federacy. Unveiling of Confederate tab l e t s x  7 .  Address, T. J. Browning. . Dinner, Reviewof battlefields. Leave Apponiattox on return trip to Farmville, where it will occur. On Thursday at Farmville Hon. St. Geo. Tucker will be principal speaker. I I L. Crawley,  - Chairman Confederate Reunion"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "I L. Crawley,  - Chairman <mark>Confederate</mark> <mark>Reunion</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "I L. Crawley,  - Chairman <mark>Confederate</mark> <mark>Reunion</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1794.0, 1180.41, 1956.86, 1201.75], "bbox_id": "3c978e8511", "file": "AppomattoxNewspapers_1905-1912a_0095.pdf", "page": 1, "text": ", --------   -w .-w v . v v i c u u c i C 5 t t t C O to the Confederate reunion in Mo- bile, Ala., April 26."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": ", --------   -w .-w v . v v i c u u c i C 5 t t t C O to the <mark>Confederate</mark> <mark>reunion</mark> in Mo- bile, Ala., April 26."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": ", --------   -w .-w v . v v i c u u c i C 5 t t t C O to the <mark>Confederate</mark> <mark>reunion</mark> in Mo- bile, Ala., April 26."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1124.91, 420.95, 1283.23, 1584.8], "bbox_id": "bdfa85b589", "file": "AppomattoxNewspapers_1898-1902a_0192.pdf", "page": 1, "text": "Twenty-two members of tbe Olympias crew, who fought at Manilo and were dis charged from tbe Raleigh, are on their way to San Francisco to rc- 9 nlist and return to tbe Philippines. Wichita, Kan., is without street ear ser vice. In accordance with a decision by Judge Dalo, declaring the street ears pabilo nuisance the cars quit rnnnlng, tbe lease ot the present company having expired. It is announced tbat Admiral Dewey, President Dta, of Mexico, and Lord Minto, Governor-General of Canada, will attend tbe laying of the corner stone ot the new postoffloe in Chicago October 9 and will meet President McKinley. Tbe Methodist ministers of Atlanta, Ga., passed resolutions calling for tbe appoint ment of a committee to urge upon tbe forth coming annual conference a movement for an extra General Conference to reconsider tbe Publishing House matter, the disposi tion of whlob, it is alleged, is not satisfac tory. Students at Princeton attacked a parade of Pawnee Bills Wild West show and a pitched battle took place, in which many were injured. The Southern Baptist Convention, in ses sion at Louisville, Ky., selected Ex-Mayor Bobert C. Davidson, of Baltimore, to join a delegation ot English B iptists In a personal appeal to the Czar in behalf ot the persecut ed Russian Baptists. After this week no miner. In the Conr DAlene district of Idaho will be permitted to work there unless he renounces member ship in the union that is held responsible for tbe present strike. The steamer Dauntless, formerly famous as a filibuster, was released by tbe United States Court at Jacksonville, Fla. In the cáse of Rafael Ortiz, a native of Porto Rico, who was found guilty of the murder of Private John Burke, Company C, Forty-seventh New York Regiment, at Cag- uas, Porto Rico, on February 24 lost, and whose sentenco of death was commuted to Imprisonment for life, the President has directed that he be confined in the Minnesota State prison, at Stillwater. The organization ot the Paulding County Ga. Cotton Mills has been perfected. The officers are E. Davis, president B. T. Drake, vice-president W. Z. Spinks, secre tary R. P. Gann, treasurer. The company will erect a cotton factory and cottonseed oil mill. It is proposed to do the work en tirely with home capital. Citizens of the town and county aro subscribing liberally. The Berwind White Coal Mining Com pany,. which has mines in Centre, Clearfield,  Jefferson, Cambria and Somerset counties, Pa., and which is one ot the largest pro ducers of bituminous coal In the world, has notified its employes of an Increase In wages, to go into effect June L Miners will re ceive 50 cents a ton tor picking and 25 cents a ton for loading after machines. The Baltimore and Ohfo Railroad, at tbe request of numerous business organizations of Baltimore and Philadelphia, has arranged for a ten days stop-over at each of tboso cities under the usual procedure of the passenger depositing the ticket with tbe ticket agent upon his arrival. The Balti more and Ohio Railroad now grants ten days stop-overs at Washington, Baltimore and Philadelphia. William N. Boggs, the defaulting bank teller ot Dover, Del., was sentenced at Wi- mington to five years in the penitentiary and to pay a fine of 6,500. A movement is on foot in tbe Florida Legislature to provide for a revision of the State constitution. Stove manufacturers who are meeting in Cincinnati may form a consolidation of tbeir interests. A dispatch to tbe Navy Department from Captain Cogblan states that an examination of the Raleigh after she was floated shows that she sustained practically no damage in grounding off Charleston. George Ubler, a farmer, fifty years of age, ro-idlng n ar Mount Hope, Pa., killed bis wife with ah axo ..while she was milking a cow. Hs then banged himself. Tbe double tragedy was discovered by their son, aud is ascribed to religious insanity. Tbe saw-mill plant of tbe E. E. Jackson Company, at Reidsville, Ala., was destroyed by fire. Loss, 75,000. Tbe president ot tbe company is cx-Governor E. E. Jackson, of Maryland. Alex. Volllatb, of Sheboygan, and H. I. Elvers, of Baltimore, students of Mission House College, were drowned while boat- riding in a small lake near Franklin, Wis. Their bodies have not been recovered. A yonng man named Roderick, oi Cbnrler- toivn, W. Va., shot himself through tbe leg,- between the thigh and tbe knee, while handling a pistol in the dining parlor oi Jones confectionery at Berryviile, Va. The wound is a very painful one, and bml the ballet passed a little higher up, it would have severed an artery and death would have resulted. An equestrian statue of General Hartranfl was unveiled at Harrisburg, Pa. Three thousand persons attended a recep tion and banqnet in Washington, D. C., in honor of the National Society ot Mechanical Engineers. Alter experiments-with wireless telegraph by the United States Signal Corps, General Greely has conoluded that it will not sup plant tbe present system of wires. Secretary Keep, of tbe Merchants Ex change, Buffalo, N. I., telegraphed to tbe Confederate Veterans reunion at Charleston. S. C., an invitation to bold tho reunion in 1901the Pan-Ameriean Exposition year- in Buffalo. C. E. LittleflelJ, of Rockland, was nomi nated by acclamation by tbe Republicans ot tbe Second Maine Congressional District to succeed the late Nelson Dlngley. Juno 3 will be observed as Confederate Memorial Day at L-xington, Va. Tbe West Virginia Knights Templar Con clave, in session at Huntington, selected Fairmont as the next place of meeting."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "I., telegraphed to tbe <mark>Confederate</mark> Veterans <mark>reunion</mark> at Charleston. S. C.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "I., telegraphed to tbe <mark>Confederate</mark> Veterans <mark>reunion</mark> at Charleston. S. C.,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [705.1, 1698.4, 865.32, 1771.65], "bbox_id": "b3bf9e1501", "file": "AppomattoxNewspapers_1902-1905a_0091.pdf", "page": 1, "text": "TJNITED CONFEDERATE VETERANS REUNION -New Orleans, La., May 1, 20. 21,22. Very low rate excursion tickets vU Norfolk A Western Railway on sale May 16- 21 Inclusive, limited to May 54, bat by de- positing ticket with Joint Agent and pay ment of Stic fee extension can be bad to .a s  15th, IU03. Through Pullman sleeper dto- tug ears, meals a la earte. AdWttooal rafor- matlou and rates eheerially isrsh h a l w ."}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "TJNITED <mark>CONFEDERATE</mark> VETERANS <mark>REUNION</mark> -New Orleans, La., May"}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "TJNITED <mark>CONFEDERATE</mark> VETERANS <mark>REUNION</mark> -New Orleans, La., May"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [691.74, 650.35, 858.64, 1046.15], "bbox_id": "5650f6514b", "file": "AppomattoxNewspapers_1902-1905a_0085.pdf", "page": 1, "text": "Southern Jt. Y . Notices. .Meeting American Medical Association New Orleans, L a ., M ay 5th-8th, 1903, One fare for the round trip. Tickets on i-alc May 1st to 4th, includsive, return limit. 10 days from .date o f sale. National Conference Charaties  Cor rect ions Ataluta, G a ., M ay 0-12, 1903. G no fare plus 23 cents for the round trip from all points Tickets on sale May 4t.li cs fith. return lim it May l9th. Southern Baptist Convention and A ux- ilia .y Societies Savannah, G a ., M ay 7-14, 1903. One fare plus 25 cents for the round trip from all points. Tickets on sale M ay 3th. itb7 tit with return lim it May.20th. - .1  side trips from Savannah during this oc lion at very low rates. General Assembly Cumberland Pres- byt. rian Church, N ashville, Term , M ay 21., 1903. Oi.e. lanplus 25 cents for the round trip front all oint8 in V irgin ia N orth  South Carolina, including Washington, D . C . - kts on sale M ay 19th, 20th  21st r h rn, lim it Jn ne lsr. r. irteeltth Annual Meeting, Southern E t uatioiial Association A sheville,.N . C ., Jut i 30-Ju ly 3rd, 1903. C t fate, plus 25 cents, plus 2. mem bers ip lee, lortlie round trip from all pOtlll i. -National Conveution B. Y . P . U . o f Ain rica A tlanta, G a ., Ju ly ,9-12,4963. Ou faro plus 25 cents for the round trip i  j n, all points.. Tickets on sale Ju ly 7tli, bt. . Jth  10th w ith return lim it Ju ly 15. H ited Confederate Veterans Reunion . ev Orleans, L a ,, M ay 19-22,1903. One cent per m ile each way for the ro.anl trip, pickets on sale May 16th to 21., inclusive, return lim it M ay 24th. it t ilage of extenaion o f return lim it, by . ayuient of 50 cents, to Ju n e 15th. S T O P A T"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "ly 15. H ited <mark>Confederate</mark> Veterans <mark>Reunion</mark> . ev Orleans, L a"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "ly 15. H ited <mark>Confederate</mark> Veterans <mark>Reunion</mark> . ev Orleans, L a"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [182.4, 1020.71, 403.3, 1513.4], "bbox_id": "3db61eb663", "file": "AppomattoxNewspapers_1898-1902a_0660.pdf", "page": 1, "text": "SEND FOR PRICE L1SJ- was en- w, ife interest of the New York Central Company and gaves ti e right to railroad corporations to seize private property in the most high-handed manner, There q be no doubt that the greatest jd .a influence w hich now threatens the liberflffils exercise in jpnTe and the welfarjyodies and which is the.unbouudewith relentless vigor, .he corporations. slat   --------- Confederate Veteran Reunion, Dallas, Texas, April 22-35, 902. For the above occasion the South ern By. begs to announce one cent per mile in e tch direction for the round trip from all stations on its lines to Dallas, Texas and return short liue mileage. Tickets to be ou sale April 18th, 19th, and 20th. with return limit May 2nd, except that by depositing ticket with Joint Agent at Dallas on or before April 30th and payment of 50 cent an ex tension cf return limit until May 15th, will be granted, Stop-overs will be allowed within transit limit f ticket within S. E. P. A. territory west of and including Chattanooga and Atlanta. The rate from Rich mond to Dallas and return will be 28-65, and correspondingly low rates from all other points. The Southern Ry. has short ronte and quick time to Dallas, and offers the choice of routes through Ashe ville Land of the Sky Chattanooga Lookout Mouutaiu and Memphis through Atlanta, Birmingham and Memphis or Atlanta, Birmingham and Shreveport. The far famed Laud of the Sky ronte is without equal, and is the most interesting offered. Dont miss the opportuity of pass ing through Land of the Sky the Switzerland of America."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "vigor, .he corporations. slat   --------- <mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 22-35,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "vigor, .he corporations. slat   --------- <mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 22-35,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1253.73, 1827.92, 1411.28, 1999.84], "bbox_id": "b0cc141da6", "file": "AppomattoxNewspapers_1898-1902a_0349.pdf", "page": 1, "text": "S ta t in B rief. Dr. A. C. Emmert, a leading physi cian of Bristol, is dead. Dr. Kenneth McKinnon, formerly of Wythe county, died recently in Ala bama. A camp of Confederate Veterans has been organized at Hlllsville, Carroll county, Va., with Capt. W. H. Suther land as commander. Initial steps looking to the organi zation of an association of Virginia soldiers who served in the Spanlsh- American War were taken at a meeting held i9 Richmond. There was a reunion of Confederate Veterans at Lacrosse, Meckltnburg county, which was largely attended. Speeches were made by Gen.- Stith Bol ling, Grand Commander of the Grand Camp of Yirgyiig, and other."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "Richmond. There was a <mark>reunion</mark> of <mark>Confederate</mark> Veterans at Lacrosse, Meckltnburg"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "Richmond. There was a <mark>reunion</mark> of <mark>Confederate</mark> Veterans at Lacrosse, Meckltnburg"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [742.1, 838.7, 907.75, 1210.54], "bbox_id": "d1aa004449", "file": "AppomattoxNewspapers_1902-1905a_0093.pdf", "page": 1, "text": "S o u t h e r n JR.- Y . N o tic e s .  etiuji American Medical Association Orleans, La., May 5th-8tli, 1903,  , 1 fare for the round trip. Tickets i .-.lie May 1st. to 4th, includsivc, return ij 10 days from date of sale. Tivsibual Conference Charaties  Cof- ions Atalnta, Ga., May 6-12, 1903. !. i fine jius 25 cents for the round i iTom all points. Tickets ou sale May i, i, 5th, return lim it May 19th. Southern Baptist Convention and Aux- a.,y Societies Savannah. Ua., May 7-14, I0i  Hie fare plus 25 cents for the round   i row all points. Tickets on sale May , Oth 7 th with return limit May 20tli. i . side trips from Savannah during this j o o. on nt very low rates. U neral Assembly Cumberland Pres- ryt. r,m Church, N ashville, iTenn , Mav ji 1-3. . 1903.  Onu far plus 25 cents for the round trip j  . ..in all points in Virginia N orth A South C. uiina. including Washington, D. C. 3 Ci, ets on sale May 19th, 20th  21st 1 .tern lim it June 1st. Thirteenth Annual Meeting, Southern j educational Assoetatiou Asheville, N, C.,  ..ne 30-July 3rd, 1903. pile fare, plus 25 cents, plus 2. mem- ij .ership fee, tor the round trip from all  points. National Convention B. Y. P . U. of America A tlanta, Ga., July 9-12, 1903. One fare plus 35 cents for the round trip f.iom all points. Tickets on sale July 7th, 3th, 9th  10th with return lim it July 15. United Confederate Veterans Reunion Now Oilcans, La,, May 19-22,1903 One cent per mile each way for the round trip. Tickets on sale May 16th to 21st, inclusive,, return lim it May 24th. Privilage of extension of return limit, by payment of 50 cents, to June 15th."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "it July 15. United <mark>Confederate</mark> Veterans <mark>Reunion</mark> Now Oilcans, La,, May"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "it July 15. United <mark>Confederate</mark> Veterans <mark>Reunion</mark> Now Oilcans, La,, May"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1981.71, 1060.76, 2137.77, 1105.21], "bbox_id": "5bc1277a24", "file": "AppomattoxNewspapers_1926-1933a_0450.pdf", "page": 1, "text": "Richmond, Va., Eopt. 10 ,- A t a re- cent reunion of Confederate Veterans attended by several men who followed Mosby, resolutions were adopted call ing upon all descendants of Confed-"}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "Richmond, Va., Eopt. 10 ,- A t a re- cent <mark>reunion</mark> of <mark>Confederate</mark> Veterans attended by several men who followed Mosby, resolutions were adopted call ing upon all descendants of Confed-"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "Richmond, Va., Eopt. 10 ,- A t a re- cent <mark>reunion</mark> of <mark>Confederate</mark> Veterans attended by several men who followed Mosby, resolutions were adopted call ing upon all descendants of Confed-"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.98, 298.32, 2101.66, 1508.96], "bbox_id": "9f4ca2c810", "file": "AppomattoxNewspapers_1902-1905a_0522.pdf", "page": 1, "text": "Rev. John Ward, 78 years old, a well- known Baptist clergyman of Isle ol Wight county, was found dead in bed. Mr. Ward, who was chaplain of the Cal- ott-Wrenn Camp of Confederate Vet erans, delivered the prayer at Isle ol Wight Courthouse -uesday, when the Confederate monument was unveiled in the presence of 4,000 persons. He was in his usual health at bed time. The deceased is survived by a widow and two sons Dr. J. W. Ward and Robert Ward. As the result of an accident on May IO, when he was bruised internally by being thrown from a buggy, Frank E- Stallings, a justice of the peace, at Buckhorn, Nanseniond county, dit-i iged 50 years. Justice Stallings horse became frightened at a pile-driver, and he jumped to escape more serious dam- ige. Mrs. ouise Fletcher oreene, of Rap pahannock, has been appointed to rep resent the Valley of .Virginia at the reunion of Confederate veterans to be held in Louisville this month. She lias selected Miss Brucie Funkhouser, of Strasburg, as her maid of honor. Major F. R. Lassiter sued the city of Petersburg for 3,560 because the ity erected a smallpox hospital on a farm adjoining his estate. J. C. Reed, of Evansville, Ind., was held in Petersburg charged with being passer of bogus checks. A syndicate has been formed to bund an electric railway to connect Ocean View and Pine Beach. The distance is ave miles, but 300,000 capital will be raised to build hotels and cottages along he line. Stewart Terry, the 15-year-otd son of Mr. W. L. Terry, a well to-do farmer, living near Lynchburg, was kicked by horse and is probably fatally injured. Jose Antone Peria, a fireman on the steamer City of Augusta, which has taken the place of the Hamilton between Norfolk and New York, is in St. Vin cents Hospital, Norfolk, seriously wounded, and Eugene Lianas, a Portu guese mess boy on the same steamer, is in jail charged with attacking him. The boys fought. Perias wounds are in the shoulder and were inflicted with a sharp carving knife. , A dispatch from King William Court house says that Henry Lipscomb, a farm er of Manquin, that county, is probably fatally injured as the result of an attack made on him with a pitchfork by a small negro boy. The boy became angered at something said to him by Lipscomb, and attacked the farmer, driving the fork into his body 15 timds. The reunion of Independent Order of Odd Fellows of the Valley, under the auspices of the lodges of Shenandoah county, occurred at Mount Jackson There were about 1,500 persons present. Dr. C. A. R. - Moore, Mayor of Mount Jackson, made the address of welcome This was followed by a speech of ReV E. E. Northern, past grand master of Winchester, upon the origin and growth of the Order of Odd Fellows. Mr. F. P. Brumback, of Woodstock, introduced the orator of the day, Gov. A. J. Mon tague, who made a splendid speech on Odd Fellowship, which was enthusias tically received. Sands  Oliver, contractors for the first 100 miles of the Tidewater railway, have begun clearing the rights of way at Suffolk for the roadbed. Managet Dupuy is ready to advertise for bids fot another section of the road. Thomas S. Nunnally and George By rum were indicted in the Corporatioi Court at Norfolk for non-support. Nun nally was required to give bond of 120 to insure the payment to his wife of 30 every three months, and Byrum was re quired to give a bond of 150 for the payment of 3 a week to his wife. Th order in each instance is to remain in force for 12 months, with the alterna tive of staying in jail. John P. Branch, one of Richmond wealthiest bankers, has giveh 30,000 to Randolph-Macon College, at Ashland, to be used in the erection of a dormi tory. Mr. Branch is a stanch friend of the college and has heretofore made large donations. Concluding a six days trial in the Circuit Court of Surry county, the 5,000 damage suit of James H. Dillard against Mayor George H. Woods and Police Chief Kemtnerer, of Claremont, ended in a mistrial. The suit was warmly contested by five attorneys. Dillard seeks damages because of alleged illegal arrest on account of his refusal to pay town license claims. Laughton Diuguid, aged 22 years, son of William D. Diuguid, a prominent bus iness man of Lynchburg, killed himself at his home shortly before noon by blow ing the top of his head off with a Win chester rifle. The young man was suf fering from nervous breakdown, caused by overstudy during the past term at school in Philadelphia, where he was taking a course in chemistry. He had to return home some weeks ago and was to be taken to Richmond for special treatment. He did not want to leave home, and the departure was delayed. Diuguid secured the rifle, went to hts room, and, placing the muzzle against his right temple, fired. The Elks have begun the erection of their  Home, on High street, Char lottesville, opposite the Courthouse. United States Marshal Morgan Treat will remove the headquarters of the Eastern district from Newport News to Richmond. The Merchants and Farmers Bank has been organized at Smithfield, with 30,000 to 50,000 capital stock. The officers are W. P. Wilson, president B. P. Gay, vice-president W. R. My ers, cashier."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "of .Virginia at the <mark>reunion</mark> of <mark>Confederate</mark> veterans to be held"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "of .Virginia at the <mark>reunion</mark> of <mark>Confederate</mark> veterans to be held"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.47, 447.13, 2029.72, 1037.13], "bbox_id": "0e3f6b47f3", "file": "AppomattoxNewspapers_1902-1905a_0339.pdf", "page": 1, "text": "John S. O Brien, who claims Balti more as his home, is in the Norfolk county jail suffering from a wound in the right breast made by a bullel from the revolver o f Policeman Lhase, who shot O Brien when the letter attempted to escape from Port Norfolk, where he had been ordered off the property of the Alantic Coast Line. O Brien was charged with trespassing -and the officer attempted to arrest him. O Brien drew a re volver, but the officer was too quick for him and fired. The bullet entered the right breast and plowed its way to  eft side, where it came out. .He is charged with trespassing, carrying a revolver and attempting to shoot the officer. An important shoe deal involving two large concerns has just been conr, summated after several months of negotiations, and as a result the Ken- more Shoe Companys plant in Fred ericksburg has been consolidated with the wholesale house of Wingo. Ellet  Crump of Richmond. Officers have been elected as follows President, C. E. Wingo, of Richmond vice-presi dent and general manager, Charles J. Green, of Fredericksburg secretary, W. F. Gordon, of Richmond trea surer, George B. Wilson, of Richniond. For various reasons, but princi pally because the Home Guard will take part in. the military encampment to be held  at Manassas and many veterans and sons of veterans also wish, to atend, the Garland Rodes Camp of Confederate Veterans has requested Grand Commander Chris tian, of Richmond, to change the date of the Confederate state reunion from September 7, 8 and 9, to September 14, 15 and 16. Herbert Bruce, of Sperryvillc, Rap pahannock county, after arming him- self with a revolver went to the office of Dr. Edward Johnson in the latteri absence and attempted to commit sui cide by shooting. The weapon was discharged, the ball glancjng and lodg ing in Bruces waistcoat. Dr. John son arrived just as Bruce was mak- tfiffthe second attempt to end his life, After a struggle he succeeded in dis arming the man bent on self-destruc tion. Bruce is about 35 years old, and is said to have becn drinking heavily. M rs. Fannie Adelaide Scott, wife of William Scott, of Fredericksburg and daughter of the late Ex-Mayor Hugh S- Doggett, died in the Georgetown D. C. Hospital from the effects of an operation. She is survived by a widower and seven children. The contract for dredging the Rap- pahannock river under the new ap propriation will be awarded thif week. Mr. E. W . Mills, of Fredericks. WT8V has received the contract from the Government for furnishing piles to be used in making the dykes for that work."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "the date of the <mark>Confederate</mark> state <mark>reunion</mark> from September 7, 8"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "the date of the <mark>Confederate</mark> state <mark>reunion</mark> from September 7, 8"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.11, 672.61, 1637.76, 719.81], "bbox_id": "61804982dd", "file": "AppomattoxNewspapers_1922-1923a_0343.pdf", "page": 1, "text": "Hon. J. C. Jones and Mr. How ard Fisher leave for the reunion of Confederate soldiers at Roanoke to-day."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "Hon. J. C. Jones and Mr. How ard Fisher leave for the <mark>reunion</mark> of <mark>Confederate</mark> soldiers at Roanoke to-day."}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "Hon. J. C. Jones and Mr. How ard Fisher leave for the <mark>reunion</mark> of <mark>Confederate</mark> soldiers at Roanoke to-day."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [376.11, 1184.23, 536.76, 1755.06], "bbox_id": "c4f22c29b5", "file": "AppomattoxNewspapers_1892-1898a_0256.pdf", "page": 1, "text": "He is Sanguine of Democratic Success in the State. Senator John W. Daniel and Gen eral Fitzhugh Lee returned yester day afternoon from Gape Charles, where they bare been attending a Confederate Veterans reunion. They expressed themselves as very much pleased with their trip. Speaking of the Senators stop in that city, the Richmond Dispatch says Senator John W. Daniel, who has been spending several days at Cape Charles, where he spoke at a Con federate reuuion on Thursday, ar rived in the city last night, and is stopping at Murphys. The Senator was seen by a Dis patch man and asked for an expres sion as to the political outlook, but pleaded ignorance of the situation as an excuse for not complying. He says he had devoted his entire time to legal business this summer, and consequently was not well posted in the doings of the political world I am going home now, though, he said, and prepare myself, and on the 7th of October I shall enter the legislative campaign at Franklin. The Senator thought the prospects for Democratic success in Virginia this fall were very bright, but when asked whether the brightness of the prospects extended beyond the hori zon of this State, he did not reply so readily. He thought, how ever, there was no occasion for Dem ocrats to worry about results, either immediate or prospective. During the course of the inter view the reporter alluded to the re solutions adopted by the convention being held throughout the State en dorsing Major Daniel, and the Sena tor said that they were all very gratifying to him.News."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "bare been attending a <mark>Confederate</mark> Veterans <mark>reunion</mark>. They expressed themselves as"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "bare been attending a <mark>Confederate</mark> Veterans <mark>reunion</mark>. They expressed themselves as"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1114.77, 564.97, 1271.46, 793.77], "bbox_id": "40bd568501", "file": "AppomattoxNewspapers_1898-1902a_0218.pdf", "page": 1, "text": "Despite lowering clouds 8,000 or 10,000 people attended tbe annual Confederate Veterans reunion at Fishers Hill under tbe auspices ol Stover Camp, of Stra.burg, on Saturday. Camps from Woodstock, Wiu- abester, Front Royal, Edinburg, New Mar ket, Lebanon Chnrob, Harrisonburg, a well as Stover Camp, were lu attendance. During the dinner hour a heavy rainstorm came up, and a majority of the people were drenched. Owing to the min the speaking was not begun until after 2 oclock and then thousands of p-eople were standing in the mud and on the wet seats. Col. E. E. Stick ley, of Woodstock, oalled the assembly to order acd Rev. D. Hamaker, of Straslurg, led in prayer. Rev. Dr. A. C. Houkins,  f Charlestown, W. Va., an old Confederate cbapluln, spoke of the valor of the Confederate soldiers. He was followed by Governor Tyler, who captlvated his aud ience from tbe start. He spoke for half an hour. Hon. W. B. Cornwall, of Romney, W. Va., followed In an eloquent address and Judge Giles Cook, of Front Royal, closrd the exeroises in a short but appropriate talk. It is olalmed that tbe crowd on Saturday was the largest ever her."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "people attended tbe annual <mark>Confederate</mark> Veterans <mark>reunion</mark> at Fishers Hill under"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "people attended tbe annual <mark>Confederate</mark> Veterans <mark>reunion</mark> at Fishers Hill under"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [731.04, 1032.87, 892.89, 1394.1], "bbox_id": "73d06f4605", "file": "AppomattoxNewspapers_1898-1902a_0657.pdf", "page": 1, "text": "Confederate Veteran Reunion, Dallas, Texas, April 32-25, 1902. For the above occasion the South ern By. begs to announce one cent per mile in e.ich direction for the round trip from all stations on its lines to Dallas, Pexas and return short line mileage. Tickets to be 011 sale April 18th, 19th, and 20t.h. with return limit May 2ud, except that by depositing ticket with Joint Agent at Dall.is on or before April 30th and payment of 50 cent, an ex tension of return limit until May 15th, will be granted, Stop-overs will be allowed within transit limit of ticket within S. E. P. A. territory west of and including Chattanooga and Atlanta. The rate from Rich mond to Dallas and return will be 28-65, and correspondingly low rates from all other points. Ihe Southern Ry. has short route ud quick time to Dallas, and offers che choice of routes through Ashe ville Land of the Sky Chattanooga Lookout Mountain and Memphis through Atlanta, Birmingham and Memphis or Atlanta, Birmingham and Shreveport. The far famed Land of the Sky route is without equal, aud is the most interesting offered. 1 Dout miss the opportuity of pass ing through Laud of the Sky the Switzerland of America."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 32-25,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 32-25,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [750.47, 1558.76, 912.2, 1920.18], "bbox_id": "2721d815f1", "file": "AppomattoxNewspapers_1898-1902a_0653.pdf", "page": 1, "text": "Confederate Veteran Reunion, Dallas, Texas, April 22-25, 1902. For the above occasion the South ern By. begs to announce one cent per mile in eich direction for the round trip from all stations on its lines to Dallas, Texas and return short line mileage. Tickets to be on sale April 18ch, 19th, and 20th, with return limit May 2nd, except that by depositing ticket with Joint Agent at Dallas on or before April 30th and payment of 50 cent ail ex tension rf return limit until May 15th, will be granted, Stop-overs will he allowed within transit limit j of ticket within S. E. P. A. territory 1 west of and including Chattanooga and Atlanta. The rate from Rich mond to Dallas and return, will be 28-65, and correspondingly low rates from all other points. The Southern Ry. has short route and quick time to Dallas, aud offers the choice of routes through Ashe ville Land of the Sky Chattanooga Lookout Mountain and Memphis through Atlanta, Birmingham aud Memphis or Atlanta, Birmingham and Shreveport. The far famed Land of the Sky route is without equal, and is the most interesting offered. Dont miss the opportnity of pass ing through Land of the Sky the Switzerland of America."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 22-25,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "<mark>Confederate</mark> Veteran <mark>Reunion</mark>, Dallas, Texas, April 22-25,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [309.13, 1546.98, 467.29, 1625.83], "bbox_id": "be7ceff4c2", "file": "AppomattoxNewspapers_1905-1912a_0538.pdf", "page": 1, "text": "Annual Reunion, United Confederate Veterans, riacon, Ola., May 7 9,1913 Southern Railway offers very re duced fares for this occasion as fol lows Round trip fare from Richmond.  111.00 Burkevllle, 11.15 Keysville, 10.35 South Boston, 10.25 Dan ville, 0.40 Martinsville, 9.45 Chat-"}, "highlight": {"text": {"matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> Veterans, riacon, Ola., May"}}, "highlights": [{"field": "text", "matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> Veterans, riacon, Ola., May"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [307.45, 789.49, 466.35, 809.84], "bbox_id": "499b6da3e9", "file": "AppomattoxNewspapers_1905-1912a_0542.pdf", "page": 1, "text": "Annual Reunion, United Confederate Veterans, nacon, Ga., May 7 9 , 191 a,"}, "highlight": {"text": {"matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> Veterans, nacon, Ga., May 7 9 , 191 a,"}}, "highlights": [{"field": "text", "matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> Veterans, nacon, Ga., May 7 9 , 191 a,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1561.89, 440.4, 1882.85, 461.95], "bbox_id": "4bace4634e", "file": "AppomattoxNewspapers_1905-1912a_0534.pdf", "page": 1, "text": "Annual Reunion, United Confederate I Large assortment of the Stand- Veterans, nacon, pa., May 7 9 , 191 a. I ard and leading styles."}, "highlight": {"text": {"matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> I Large assortment of the Stand- Veterans, nacon, pa., May 7 9 , 191 a. I ard and leading styles."}}, "highlights": [{"field": "text", "matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark>, United <mark>Confederate</mark> I Large assortment of the Stand- Veterans, nacon, pa., May 7 9 , 191 a. I ard and leading styles."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [544.29, 1393.64, 703.9, 1535.08], "bbox_id": "6cab508008", "file": "AppomattoxNewspapers_1898-1902a_0185.pdf", "page": 1, "text": "Annual Reunion United Confederate  Veterans, Charleston, S. C., Hay 10.13. 1899. On account of the above occasion, the Southern Railway will sell tick ets f rom points on its line to-Charles ton, S. 0 ., and return, at the rate of one cent per mile iu each direction, t ickets will be sold May 8, 9, and 10 final limit, May 21, 1899.. For further information as to routes, schedules, etc., apply to any agent ot the Southern Railway, or to G. VV. W estbu ky , T. F. A.. Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark> United <mark>Confederate</mark>  Veterans, Charleston, S. C.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Reunion", "Confederate"], "snippet": "Annual <mark>Reunion</mark> United <mark>Confederate</mark>  Veterans, Charleston, S. C.,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [854.4, 307.86, 1023.47, 1586.75], "bbox_id": "2d1cbed736", "file": "AppomattoxNewspapers_1915-1918a_0011.pdf", "page": 1, "text": "An Address at the Annual Reunion of Confederate Veterans at Flsnera Hill, Virginia, August 7, 1915, by Fairfax Harrison, President South ern Railway Company. Fishers H1U, Va.Speaking at the Annual Reunion of Confederate Vet erans here on Saturday, August 7, Mr. Fairfax Harrison, President Southern Railway Company, said At this historic reunion of survivors ef the armies of the South, of their descendants, and of those from other sections who, with true Virginia hos pitality, have been welcomed to this happy valley. It Is fitting that, while paying tribute to those who fought va liantly for the Southern cause, we should now look forward to the future We are proud of the Virginia of the p u t and of the record which her sons have made In peace and in war, and we are confident of her future hut we may be permitted to hope that her achievements hereafter shall be more In peace than In war. Virginians will be ever ready to uphold the honor of the State and of the United States on the field of battle, when that Is necessary, hat, with the horrors of the war In Europe to refresh our mem ories of the campaigns of the veterans here assembled, we may well pray for such progress In the civilization of the world and for such wisdom and strength In our government that om people may never again hear the call to arms. , Duty to Industry. In any event, thank God, we are now at peace and K Is therefore our present duty as a people so to guide the progress of the State along the paths of peace that the history of our day may he, without neglect of spir itualities, one of material progress, advancing he happiness and prosper lty of our descendants. Leaving to others, for the moment, the appeal for progress In Virginia on the spir itual. the educational, and- the aesthetic ldeu of our civilization, 1 venture to say a word of stimulus In behalf of oinwpresent duty to Industry In any review of the progress of Virginia we should never forget the condition In which she was left at ths dose of the war between the States, when her fields had been a battle ground for four years, when thousands of her sons had fallen, when many ol those who survived were maimed oi shattered In health, when property had been destroyed, when a large part of her territory had been cut off and when public and private credit and most of ail, her moral efficiency had been seriously Impaired. In he fac of such handicaps the record of actual progress since IKS Is a splendid tribute to the men and women who, after Appomattox, sat about tire task of rebuilding with Indomitable perser ranee and splendid self-sacrifice They have laid a broad foundation Cor us In our turn to build upon and In ths earns spirit which animated them we should press forward to new achievements. Principles ef Progress In this great undertaking It will ha wall always to keep before ns the prln cl pies of tree progress which are that enduring success Is the product of a restless willingness to do new things, If they shall seem good In the experi ence of others to be discontented with anything bat the heat, and t endure any sacrifice that may ha re gnlred. Dissatisfaction with existing condi tions has ever been one of the most potent motives of human progress. It te fitting, therefore, to see In what Yaspeets wa may have reason to be dissatisfied with material things they are In Virginia. Without neglect of manufactures wa are still eminently an agricultural peo pie, as Thomas Jefferson hoped might ever be. Climate and soil con ditions throughout the state are fav orable to diversified and profitable agriculture. The statistics show that have availed of these conditions by largely increasing our farm values Inoreaeed Farm Values. The United States Census Bureau Mis ue that the value of all farm property In Virginia Increased from 924T.m.53, hi lfi0, to 9525,065.883, In 1910. On its fees, an Increase ol 169 per cent In thirty years does not look bad, hut should ws ho satisfied when we compare It with an Increase of 227 per cent In tbe neighboring State of North Carolina and when we appreciate that it Is much less than It would have been If farm production had been brought up more nearly to what our natural advantages give us the right to expect? When we review the average production of the staple farm crops of Virginia we find abun dant reasons for dissatisfaction and great opportunities for Improvement. The corn crop of the State ranks first In money value. The United States Agricultural Department re ports that, for the ten years from 1996 to 1914, the average yield of corn per acre In Virginia was 24.2 bushels. The average for the United States was 26.6 bushels. Conneoticot, where natural conditions are certainly no more fav orable than In this State, had an aver age of 48.4 bushels, and a long Met of States were ahead of Virginia. With Individual Virginia farmers making records of from fifty to more then one hundred bushels we eertalnly have reason to be dissatisfied with our aver-"}, "highlight": {"text": {"matched_tokens": ["Reunion", "Confederate"], "snippet": "Address at the Annual <mark>Reunion</mark> of <mark>Confederate</mark> Veterans at Flsnera Hill,"}}, "highlights": [{"field": "text", "matched_tokens": ["Reunion", "Confederate"], "snippet": "Address at the Annual <mark>Reunion</mark> of <mark>Confederate</mark> Veterans at Flsnera Hill,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.93, 506.88, 1715.38, 1784.85], "bbox_id": "fcb563614e", "file": "AppomattoxNewspapers_1902-1905a_0340.pdf", "page": 1, "text": "A ndersonville. M b . E ditor When this is read, if read at all, the great meeting we have been looking forward to at the Tabernacle with hope, faith and works will be in its fifth day. A few years ago the reunion of Confederate soldiers was held in Richmond. What a good time we had! How we love the olo boys yet! What a joy to tell of the fights, wounds and hardships encountered. What a pleasure it was to obey or ders from our beloved commander. Infantry, cavalry and artilery all iu the line of march. So in this meet ing all Soldiersof the Cross can fall in line and march under the great commander to the city of the eternal habitation. Come and hear for your self. If you come iri the right spirit you will feel as Peter did on the Mount of Transfiguration. Certain- We can do nothiug of yourself. Come,! Mr. Editor, and bring some friends with you. You and your horse will be well cared for, I have no doubt, for about 1.00 per day on the grounds. Well, ifcs Parker and Davis. 1 did so wish it could have been Bryan aud Gray. I stick to what I said first, Bryan is the biggest man in these United States. He will tell Teddy a thing or two tefore the eve of November. We a e proud of Teddy climbing the hill of San Joe aud when Parker is elected will sign a petition to give him a big com mand in the next war we have. He needs a boss. I expect Parker will make a very good one. Our old friend and neighbor, John Flood, died this p. m., and will be buried at his late home Sat urday evening. He said he had no fears of death and was trusting in the Lord. He had been sick for several j months. He ssid from the first it was sickness unto death, and that he would not live until the meeting at theTabernacle. Dont forget the great meeting at Bethel the second Saturday aud Sunday in August. It will be con tinued through the week. Pray for its success. Our crop of wheat and oats are good and the corn and tobacco are looking well. I attended the meeting of the Board of Supervisors last Monday. The first meeting I ever attended. I am going again. I was struck with the youthful appearance of the Board. They were all known to me, but it was the first time I had ever seen them together. They had fir-t. tirst-olasa order aud they were brim ful of business. The collection of dog tax and the reward for varments was discussed and ordered the pub lic roads seen after and the publi cation monthly c.f the Boards pro ceedings. From what I saw and heard Buckingham has a good Board of Supervisors who are careful of iis finance. Good night and success to the A.  B. T im e s . P. S.To-day will long be remem bered no doubt, as it wilt be the commencement of the Forbes burn ii.g cases in court. How we do wish that the guilt of the guilty may be clearly established. Bettor for ninety-nine guilty to go unpunished thau for one innocent to suffer. A goodly congregation was at the Tabernacle yesterday, probably not so large a crowd as usual on Sun day, The benches were pretty well filled with the best i ehayed crowd for its size this writer has ever seen. The meeting closed for the evening with three at the altar. Only two preachers were on the ground, Rev Mr. Hypes, of Roanoke, and Rev. David Morris, of Shreveport, La., a student at Asbury, Ky. Dr. Me Laurren will probably be there to day. He must have been in a wreck, sidetracked or something of the sort, s he did not come Friday. Revs. Mr. Banks and Heckman will be there to-morrow. Our an hrother Bullard, of this cirouit, will, no doubt, attend. He is one that be-"}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "few years ago the <mark>reunion</mark> of <mark>Confederate</mark> soldiers was held in"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "few years ago the <mark>reunion</mark> of <mark>Confederate</mark> soldiers was held in"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.83, 1237.15, 1843.45, 1340.96], "bbox_id": "bfaaf7608e", "file": "AppomattoxNewspapers_1902-1905a_0095.pdf", "page": 1, "text": ". ..j,.,.. f  . h i  1 . 1 V . .   horn we owe a vote ot thanks. Theold CoiirtiioUbe is geitiuj, I v- recombend that fifteen bund- One fare, plus 25 cents, plus 2. mem- idy for the. eeusus enumerator I ,ej dollars of the undivided profits bership fee, for the round trip from al heres a little girl at the home ol I be carried to the surplus fund. u Y P- U. of lt    I Jos. B utton , National Convention B. x- r . I R H OUST FY I Ameriek Atlanta, Ga., July 9-12,19- J. it. HOB 8 LEY, fare pi u8 25 cents for the round trip H. D. FLOOD. _ Dorn an oints. Tickets on Bale July Jth, Jom mittee. E 8th, 8th  10th with return limit July 15. ----------------------------------- United Confederate Vetemns Reunion MiOO R ew a rd ,  1 0 0 New Orleans, La,, May 19-JJ, iwa."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "limit July 15. ----------------------------------- United <mark>Confederate</mark> Vetemns <mark>Reunion</mark> MiOO R ew a"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "limit July 15. ----------------------------------- United <mark>Confederate</mark> Vetemns <mark>Reunion</mark> MiOO R ew a"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1951.22, 1676.23, 2117.62, 1768.27], "bbox_id": "5d4181c2be", "file": "AppomattoxNewspapers_1933-1936a_0535.pdf", "page": 1, "text": "The 49th annual reunion of the Confederate veterans of Virginia is to be held in Charlottesville Sept ember 22 and 23. All veterans will be given room and board for the two days at the Montecello Hotel. There are six sur viving veterans in Appomattox co unty, all of whom are invited to at- i tend"}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "The 49th annual <mark>reunion</mark> of the <mark>Confederate</mark> veterans of Virginia is"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "The 49th annual <mark>reunion</mark> of the <mark>Confederate</mark> veterans of Virginia is"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [180.25, 942.05, 340.4, 1037.45], "bbox_id": "ad4a887924", "file": "AppomattoxNewspapers_1922-1923a_0447.pdf", "page": 1, "text": "Richmond has been elow in rais ing funds with which to entertain the confederates who will enter her gates at the coming reunion, but uo confederate will be allowed to want for comfort. We will all once more jine the cavalry and have a good time."}, "highlight": {"text": {"matched_tokens": ["reunion", "confederate"], "snippet": "gates at the coming <mark>reunion</mark>, but uo <mark>confederate</mark> will be allowed to"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "confederate"], "snippet": "gates at the coming <mark>reunion</mark>, but uo <mark>confederate</mark> will be allowed to"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [711.58, 1088.04, 877.71, 1340.84], "bbox_id": "0c67e4ad71", "file": "AppomattoxNewspapers_1902-1905a_0081.pdf", "page": 1, "text": "One fare plus 25 cents for the round trip from all points.- Tickets on sale May otb, 6th 7 th w ith retm-n lim it May 20th Also side trips lrom Savannah during thi. occasion at very low rates. General Assembly Cumberland Pres byterian Churelj, Nashville, Tenn , Mav 21-29, 1903 One far plus 25 cents for the round trip from all points in Virginia N orth  South Carolina, including Washington, D. C. Tickets on sale May 19th, 20th  21st return lim it Jnne ls v Thirteenth Annual Meeting, Southern Educational. Association Asheville, N. C., June 30-July3rd, 1913. One fare, plus 25 cents, plus 2. mem oership fee, lor the round trip from all pomts. N ational Convention B. Y. P . U. of America A tlanta, Ga., July 9-12, 1908. One fare plus 25 cents for the round trip Uom all points. Tickets on sale July 7th, 8th, 9th  10tli w ith return limit July 15. united Confederate V eterans Reunion New Orleans, La May 19-22,1903. One cent per mile each way for the round trip. Tickets on sale May 16th to 21st, inclusive, return lim it May 24th. Pnvilage of oxtenaion of return limit, by paym ent of 50 cents, to June 15th."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "limit July 15. united <mark>Confederate</mark> V eterans <mark>Reunion</mark> New Orleans, La May"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "limit July 15. united <mark>Confederate</mark> V eterans <mark>Reunion</mark> New Orleans, La May"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.3, 1526.95, 1642.3, 1848.23], "bbox_id": "54bebd904b", "file": "TimesVirginian_1983a_0252.pdf", "page": 1, "text": "M r. and Mrs. Ed Hopkinson and M r. and Mrs. BOI Sperry are back after an eight-country tour of Europe. Chatted with the Hopkin- sons about the trip. Left by plane from Phfladriphia on June 18, returning Ju ly 8. M ie. Hopkinson says she kept a diary. They enjoyed shopping in Switzerland, brought home souvenirs and were a bit partial to England.    The a  1 reunion ot the descendants of Henry T urau was held at noon 8unday at the local Woodman of the World building. Some one hundred attended, enjoying a bountiful picnic stylemeal and the family fellow ship. R em  Tom es was s Confederate Veteran. The reunion will be repeated next year, same place, the second Sunday in Ju ly.    .  Good news. I am informed that attendance at the Appomattox Court House National Park Service is up a bit over last year. The McLean House and area Restoration is one of the assets of both Appomattox and the Nation."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Tom es was s <mark>Confederate</mark> Veteran. The <mark>reunion</mark> will be repeated next"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Tom es was s <mark>Confederate</mark> Veteran. The <mark>reunion</mark> will be repeated next"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [225.37, 365.32, 384.82, 470.37], "bbox_id": "d76184355f", "file": "AppomattoxNewspapers_1898-1902a_0020.pdf", "page": 1, "text": "Judge Quarles, the Democratic nominee, ha mode an early start after the scalp of the product of that Stanntou Convention. Has the fudge pipped the shell and sized up his man ? He spoke at the reunion of the Confederate soldiers at Pal myra Saturday and is now in High- land."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "He spoke at the <mark>reunion</mark> of the <mark>Confederate</mark> soldiers at Pal myra"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "He spoke at the <mark>reunion</mark> of the <mark>Confederate</mark> soldiers at Pal myra"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [331.92, 171.86, 501.71, 822.18], "bbox_id": "34094d79aa", "file": "AppomattoxNewspapers_1912-1915a_0375.pdf", "page": 1, "text": "J . B. H am ner, Soldier, Dead. J. B. Hamner, one of the most respected citizens and s prominent, property owner and developer, died t his home at Vairioo, Fla. a few days ago. Death came very sud denly, Mr. Hamner having teen in good health, and having no indica tions of approaching demise. Mr. H mner had jnst finished dinner and was sitting in an easy chair on the front porch reading a newspaper when his heart snddenlv stopped beating. It was several minutes before children playing around him noticed any thing wrong, but when he failed to an swer questions the oldest persons of the family were immediately called and discovered that Mr. Hamner uad quietly passed away. The deceased was born at Appo mattox Court House, Virginia, No vember 82nd, 1846, and fought in the Confederate Army during tne Civil War. He was present at the surrender of Gen. Lee to General Grant, which occurred at his birth place, and was guard over the tern of Gen. Lee and other officers the nght before the surrender occur red. Mr. Hamner suffered from pnsu moaia last inter but apparently recovered and was able to attend he reunion of the Confederate Veterans in facksonsonville. oently he had determined to visa aia old home in Appomattox Court House, V a., and had engaged re set rations on a steamship for next Thursday. The deceased leaves a widow, Hrs. Fannie la Uamu-r, three sons, and a daughter. The sons are B. L. hamner, of Tampa Wm. E. Hamner, of Valrico, and Harry C. Hamner, of Managua, Nic. The daughter is Mrs. Dalzie Miller, of Valnco. The deceased also Laves two sisters, Mrs. Geo. H. Winston, of Washington, D. C., and Miss Bailie B. Hamner, of Richmond, Vo. Mr. Hamner had just completed a luxnrious home and set out a fine orange giove at bis Valrico estate when ueatb cruelly robbed him of carrying out his plans for a futme of peace and happiness. B. L. Hamner, of Tampa, chanc ed to be on a visit to bia father when the latters death occnrred. Tampa Fla. Exchange."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "able to attend he <mark>reunion</mark> of the <mark>Confederate</mark> Veterans in facksonsonville. oently"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "able to attend he <mark>reunion</mark> of the <mark>Confederate</mark> Veterans in facksonsonville. oently"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2303.52, 508.48, 2462.26, 566.18], "bbox_id": "0b156b3ce7", "file": "AppomattoxNewspapers_1902-1905a_0171.pdf", "page": 1, "text": "GRAND CAMP CONFEDERATE VETE RANS REUNION NEWPORT NEWS, VA. October 8880,1903. For the above occasion the Southern Ry. announces one first claw fare tor the round trip from all point In VIrglula to Newport Naws aud return. Tick ets on sale October 3T to 88, with return limit October 31."}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark> NEWPORT NEWS, VA. October"}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark> NEWPORT NEWS, VA. October"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.69, 1450.23, 2010.59, 1509.13], "bbox_id": "28f6afffe1", "file": "AppomattoxNewspapers_1902-1905a_0163.pdf", "page": 1, "text": "GRAND CAMP CONFEDERATE VETE RANS REUNION, NEWPORT NEWS, VA. October 2830, 1903. For the above occasion the Southern Ry. announces one first clas fare for the round trip from all points In Virginia to Newport News and return. Tick ets on sale October 27 to 28, with return limit October 31."}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark>, NEWPORT NEWS, VA. October"}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark>, NEWPORT NEWS, VA. October"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2250.68, 508.52, 2411.03, 566.92], "bbox_id": "4ec974c44a", "file": "AppomattoxNewspapers_1902-1905a_0167.pdf", "page": 1, "text": "GRAND CAMP CONFEDERATE VETE RANS REUNION, NEWPORT NEWBvX, October 88-80,1903. For tbe above occasion the Southern Ry. announces one first class iare for tbe round trip from all points in Virginia to Newport News and return. Tick ets on sh I s October 37 to 38. with return limit October 31."}, "highlight": {"text": {"matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark>, NEWPORT NEWBvX, October 88-80,1903."}}, "highlights": [{"field": "text", "matched_tokens": ["CONFEDERATE", "REUNION"], "snippet": "GRAND CAMP <mark>CONFEDERATE</mark> VETE RANS <mark>REUNION</mark>, NEWPORT NEWBvX, October 88-80,1903."}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [860.42, 1489.54, 1016.64, 1582.65], "bbox_id": "f51eebeb14", "file": "AppomattoxNewspapers_1915-1918a_0100.pdf", "page": 1, "text": "United Veterans To Fraternize At Birmingham, Ala. New Orleans.The twenty-sixth an nual reunion of the Union Confederate Veterans will be held in Birmingham, Ala., on May 16, 17 and 18 next. Offl cial announcement of the dates was made here by William E. Mickle, adjutant-general of the veterans organ ization."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "Orleans.The twenty-sixth an nual <mark>reunion</mark> of the Union <mark>Confederate</mark> Veterans will be held"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "Orleans.The twenty-sixth an nual <mark>reunion</mark> of the Union <mark>Confederate</mark> Veterans will be held"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [298.78, 1059.65, 460.51, 1167.45], "bbox_id": "bc08683a38", "file": "AppomattoxNewspapers_1912-1915a_0149.pdf", "page": 1, "text": "United Confederate Veterans zjrii Annual Reunion CHATTANOOGA. TENN. May 27-29, 1913. For this occasion Southern Hail way will sell round trip tickets at extremely low rates ap- pioxim ateiy one cent per mile distance tra veled. Tickets on sale May 24th. th, 20th, 27th and 2bth. Liberal slop-overs allowed. Hound trip tickets from Richmond 11.05 Danville 9.20, South Boston 0.00, correspon dingly reduced fares from other points. For handsome booklet on Chattanooga and the Heunion, schedules and other information, call on nearest ag en t uthern Kailway, or write, S. E HUKGESS Division Passenger Agent, 907 East Main Street, itichmond, V"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans zjrii Annual <mark>Reunion</mark> CHATTANOOGA. TENN. May 27-29,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans zjrii Annual <mark>Reunion</mark> CHATTANOOGA. TENN. May 27-29,"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2074.81, 1613.01, 2237.04, 1721.21], "bbox_id": "39c1133ce0", "file": "AppomattoxNewspapers_1912-1915a_0151.pdf", "page": 1, "text": "United Confederate Veterans 33rd Annual Reunion CHATTANOOGA. TBNN. May 27-29, 1913. For this occasion Southern Railway will sell round trip tickets at extremely low rates ap- pioximately one cent per mile distance tra veled. Tickets on sale May 24th, 26th, 26tb 27tb and 28th. Liberal stop-overs allowed Bound trip tickets from Richmond 111.86 Danville tv JO, South Boston 9.80, correspon dingly reduced fares from other points. For handsome booklet on Chattanooga and the Reunion, schedules and other information, call on nearest Agent Southern Ballway, or write, 8. B. BURGESS, Division Passenger Agent, 07 Bast Main Street, Richmond, Va"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans 33rd Annual <mark>Reunion</mark> CHATTANOOGA. TBNN. May 27-29,"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans 33rd Annual <mark>Reunion</mark> CHATTANOOGA. TBNN. May 27-29,"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2089.18, 1418.99, 2246.74, 1436.09], "bbox_id": "5ce197397b", "file": "AppomattoxNewspapers_1912-1915a_0139.pdf", "page": 1, "text": "United Confederate Veterans 33rd Annual Reunion"}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans 33rd Annual <mark>Reunion</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "United <mark>Confederate</mark> Veterans 33rd Annual <mark>Reunion</mark>"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [522.24, 1405.69, 681.87, 1951.14], "bbox_id": "e1393bc762", "file": "AppomattoxNewspapers_1898-1902a_0286.pdf", "page": 1, "text": "The tenth annual reunion of the United Confederate Veterans will be held in Louisville, Kentucky, on Wednesday, Thursday, Friday, Sat urday, and Sunday, May 30, 31, auc June 1, 2, 3. Sunday, June 3, will be the 92d anniversary of the birth of President Jefferson Davis. I hat clay has been set apart for memorial exercises in honor of Mr. Davis and of Miss Winuie Davis,  the Dangh ter of the Confederacy. Louisville is preparing to entertain the Veter- ans and others on a scale never be fore attempted, and it is expected that this will be a larger gathering of Confederates and their families than has ever heretofore assembled General John B. Gordon urges that all veterans, Daughters of the Con federacy, and Sons of Veterans who can possibly do so shall attend this meeting. Much important business demands attention. The Grand Camp now comprises 1,26 1 subordinate camps, and it has applications for nearly 100 more. The number of camps by States and Terri cones is as follows Texas 241, South Carolina 131, Georgia 127, Alabama 101, Arkansas 78, Missouri 78, Mississippi 78, Ten iiessee 75, Louisiana 61, Kentucky 59, North Carolina 56, Virginia 47, Florida 37, the Indian Territory 24, West Virginia 21, Oklahoma 19, Maryland 12, California 4, New Mexico 3, Illinois 2, Montana 2, Colarado 2, District of Columbia 2, Indiana 1, Massachusetts 1, Ohio 1, Arizona 1. It seems somewhat cu rious that Virginia and North Caro lina, which furnished such a host of men to the Confederacy, have so few organized camps of veterans."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "The tenth annual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans will be held"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "The tenth annual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans will be held"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2045.96, 940.94, 2239.52, 1785.1], "bbox_id": "8b6ae71d79", "file": "AppomattoxNewspapers_1912-1915a_0557.pdf", "page": 1, "text": "The second week in May finds plans for the twenty fifth an nual reunion of the United Confederate Veterans, schedul ed to be held in Richmond, June 1, 2 and 8, all but whipped into perfect shape. Work of prepar ing for the handling of the reunion and the vast crowds that are expected to attend has been so thoroughly distributed by the committee system em ployed that Richmond will tie ready to receive the visitors weeks before the actual open ing date. The 1915 reunion, which comes fifty years after the fall of Richmond and the end of the War Between the 8tates, is ex pected to be of the utmost significance and solemnity. To Richmond in Jane w ll come the greatest gathering of survi vors of the Confederate arms that has perhaps ever been seen. With them will come thousands of visitors, relatives, curiosity seekers, who will find much of interest during the week to repay them for tbe trip. Acceptances from many Southern Governors of the in - vitation to attend the reunion eg the guests of thé Confeder a te have been received. The presence of so many State ex ecutives will lend much to thç importance of the occasion. President Wilsons reply to the .invitation of the general com mittee is st 11 in obeyance. 1 hat he also will attend is thj expectation of those in charge of the reunion. Richmond, a most to the last man, is animated with the de sire to make the twe nty-fifth reunion the greatest event in the memory of the old Confed erates. For one week the great city will be turned over to the visitors in strict truth. Each person seems determined that business and private affairs are to give place to the greater duty of entertaining the re union. Great plans bave been made for the decoration of the city and of the Court of Honor, in particular. The Court of Honor is to be located at Lee Cir cle, in Monument Avenue, a situation ideally suited to such a purpose Brick a n d __ mortar ia all Richmond fa to ben avy"}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "twenty fifth an nual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans, schedul ed to"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "twenty fifth an nual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans, schedul ed to"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [680.9, 1481.43, 875.97, 1551.22], "bbox_id": "6e3edca653", "file": "AppomattoxNewspapers_1943-1947a_0095.pdf", "page": 1, "text": "Miscellaneous Operating Functions! Supplies for Selective Service . . . . . . , Expense Confederate S- diet to Reunion Expense Ration Board ....................... Expense- Fire Disb. loard .................. Donation U. D. C. Convention ............. Expenses F. B. I. School ............... .."}, "highlight": {"text": {"matched_tokens": ["Confederate", "Reunion"], "snippet": "Miscellaneous Operating Functions! Supplies for Selective Service . . . . . . , Expense <mark>Confederate</mark> S- diet to <mark>Reunion</mark> Expense Ration Board ....................... Expense- Fire Disb. loard .................. Donation U. D. C. Convention ............. Expenses F. B. I. School ............... .."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "Reunion"], "snippet": "Miscellaneous Operating Functions! Supplies for Selective Service . . . . . . , Expense <mark>Confederate</mark> S- diet to <mark>Reunion</mark> Expense Ration Board ....................... Expense- Fire Disb. loard .................. Donation U. D. C. Convention ............. Expenses F. B. I. School ............... .."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1335.59, 1412.39, 1481.17, 1543.41], "bbox_id": "6380b119c3", "file": "AppomattoxNewspapers_1926-1933a_0003.pdf", "page": 1, "text": "h e fow ing Confederate Baade arrangements annual re-union at ________ . Alabama Milton ell. JUBjfrhitaker, Geo. W. has. H. Coleman, Henry Woolridge. H   B t i m e boys and re mbejp will feel uneasy Until you get back y leave on No."}, "highlight": {"text": {"matched_tokens": ["Confederate", "re-union"], "snippet": "h e fow ing <mark>Confederate</mark> Baade arrangements annual <mark>re-union</mark> at ________ . Alabama Milton ell."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "re-union"], "snippet": "h e fow ing <mark>Confederate</mark> Baade arrangements annual <mark>re-union</mark> at ________ . Alabama Milton ell."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1796.86, 1503.42, 1959.66, 1789.17], "bbox_id": "eaaa349e35", "file": "AppomattoxNewspapers_1892-1898a_0143.pdf", "page": 1, "text": "B i r m i n g h a m , Ala., April 25. More than twenty thousand visitors are in Birmingham in attendance upon the fourth annual reunion of the United Confederate Veterans, which convened here to-day. The city is gaily decorated with national and Confederate flags, and bunting floats from every building. Immense streamers and flags are stretched across the streets, and the scene is a gorgeous one. Excursion trains arrived last night and this morning from every part of the country, bringing in immense crowds of veterans. All of the distinguished surviving ex-Confederates are in attendance, as well as the governors of five Sou thern States, viz Gov. Tillman, of South Carolina Gov. Hogg, of Tex as  Gov. Jones, of Alabama Gov. Turney, of Tennessee, and Governor Stone, of Mississippi."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "upon the fourth annual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans, which convened here"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "upon the fourth annual <mark>reunion</mark> of the United <mark>Confederate</mark> Veterans, which convened here"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [967.92, 1155.9, 1130.18, 1349.14], "bbox_id": "2f20651b62", "file": "AppomattoxNewspapers_1902-1905a_0532.pdf", "page": 1, "text": "Albion, 111 . Special. Three persons were killed and 20 injured in a wreck of the eastbound passenger train on the Southern Railway, at Golden Gate. The train was a cotton special, carrying Confederate Veterans to the reunion at Louisville, Ky. While running at a speed of 50 miles an hour the engine struck a spread rail on a trestle 20 feet high and the engine and four coaches were overturned and fell to the bottom of the ravine. The train consisted of three Pullmans, and four coaches.- Two of the sleepers were derailed, but did not go over thej trestle. The third sleeper remained on the track. i Most of the injured were taken to! Louisville. The others were taken west- ward by way of Olney. J. J. Uhlee, the! only passenger that was killed, was a  merchant of Greenway, Ark."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "a cotton special, carrying <mark>Confederate</mark> Veterans to the <mark>reunion</mark> at Louisville, Ky. While"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "a cotton special, carrying <mark>Confederate</mark> Veterans to the <mark>reunion</mark> at Louisville, Ky. While"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1267.39, 466.53, 1436.55, 1704.28], "bbox_id": "0720f86838", "file": "AppomattoxNewspapers_1898-1902a_0297.pdf", "page": 1, "text": "A collision occurred on the Atlantic Coast Line Railroad near Waldos, In which two men were instantly killed and three seriously injured. No. 32, known as the Atlantic Coast Line fast mall train, ran into an open swltcb nt Garysburg, resulting in a collision witb some freight cars. Sheriff Noel Roberts aud two other men were shot to death at St. Augustin, Texas, the result of a feud which also Involved the killing of a former sheriff and his son within a week. San Francisco hea-th authorities declared that the death of the Chinaman, which was investigated, was due to the bubenic plague. An attempt to hold up the northbound cannon-ball train near Longview, Texas, was foiled by the express messenger. John A. Graham, a Savannah capitalist killed City Councilman John Bradford Tallahassee, Fla. John B. Hoke, of Hanover, la.. was robbed by a thief who had politely asked to have note changed. The frigate Lancaster left Philadelphia with flve hundred boys and landsmen for cruise. The towD hall of Foxboro, Mass., was burned, one man being killed and two in jured. The anniversary of the birthday of Jeffer son Davis was celebrated in Atlanta, Ga. Dr. Giles Chambers, a prominent physi cian of Vinelnnd, N. J., was assassinated. A mob of colored men lynehed Dago Pete, colored, at Tutwiler, Miss. Mrs. Harriet Barnes committed sjiiolde at her home In Millville, N. J. Rev. Benjamin J. Kelley was conseorated bishop of Savannah by Cardinal Gibbons, assisted by the Bishop ot Wilmington and the Bishop of Charleston. The services were held in the Cathedral-Church In Richmond and were very impressive. A new trial was denied iu Philadelphia to Mrs. Anna R. Gazzau, who was ordered to pay 25,003 for alienating the affections of the husband of Mrs. Elizabeth G. Reading. Miss Olga Nethersoles proposed trip to Europe was stopped by suits filed against her by Marcus Mayer, her manager, and Clyde Fitch, tbe playwright. Julian T. Biddulph Arnold, a son ot the English poet, who is wanted in England on criminal charge, was arrested in San Francisco, and will fight extradition. Vincent 8. Seltzer, of Beading, Pa., ac cused three members of the Select Council of selling their votes to tbe Metropolitan Electric Lighting Company. Because he refused to be instructed for Bryan Perry Belmont was defeated in New York as a delegate to the national conven tion. Mary Burse, a Cherokee girl, was killed by her undesirable Indian lover because she wanted to marry a white man. A boy was fatally shot during riotous dis turbances incident to the street car mens strike in St. Louis. - The farmers of Kansas will this week be gin harvesting the largest wheat crop in the history ot the state. Fire in TampR. Fin., destroyed a number of bu-iness buildings, entailing an aggregate loss ot 200,000. Edward Shupe was arrested in Norristown, Pa., on the charge of attempting to kill his father. One burglar was killed and another fatally hart by falling from a tenement house iu New York. Patrick Flannery was arrested in Shamo- kin. Pa., on the charge of kicking his wife to d-ath. Will in m F. Miller, the Franklin syndicate swindler, was taken to Sing Sing. The formal completion ot the new Sea board Air Line was celebrated at Richmond with elaborate ceremonies, marking the end of a week ot festivities tendered by the directors to a party whom they conveyed over the line iu two special trains. A golden spike was driven by an Infant son of tbe president, the party was welcomed by Mayor Taylor and Governor Tyler, and an elabor ate banquet was given at night by the Sea board officials. A bold stage robbery occurred in Grub Gulcb, California. Two masked men beld up two troopers and went through the pas sengers on the stages following them. Mail and express matter were not touched. A disastrous freight wreck occurred on the P. W. and B. at Dover, Del. The wrecked cars took fire. Fire tramps were buried under the ruins, three of whom were rescued, although one afterwards died. Smith Alford, whose brutality is supposed to have caused his wifes death, was tarred, feathered and painted near South Bridge- ton, New Jersey. The cruiser Yiiriag, built by the Cramps for the Russian government, had a success ful trial trip off tbe Delaware capes. Colonel Eli R. Sutton, of Detroit, Mich., accused of complicity In the state military acandal, was acquitted. Blanchard H. Maul, twenty-one years old, a student at princeton University, commit ted suicide The Navnl War College a t Newport, K. I. was formally epened for instruction. Irene Vun Horn was killed by lightning in Centre Valley, Pa. The United Confederate Veterans closed their reunion at Louisville, and will meet next year in Memphis. A resolution recip rocating the kind words of General Sickles toward the men of the Confederacy was adopted after a lively discussion. Referee Kusbaum, in hearing the case against the Ice Trust m New York, ordered the production of tbe books. Evidence was given by independent dealers to show how the trust raised the price. The Southern Railway stockholders met in Richmond, Va., and authorized the issue of a fourth supplement to the companys first consolidated mortgage deed. Tbe three negroesStirling, Ivory and Perrywere held by the coroners jury in Philadelphia for the murder of Prof. Roy Whit-. Biscoe Hindman, of Louisville, was elected commander-in-cbief of the United Sons of Veterans."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "Valley, Pa. The United <mark>Confederate</mark> Veterans closed their <mark>reunion</mark> at Louisville, and will"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "Valley, Pa. The United <mark>Confederate</mark> Veterans closed their <mark>reunion</mark> at Louisville, and will"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1889.05, 841.44, 2057.14, 1558.98], "bbox_id": "346be13099", "file": "AppomattoxNewspapers_1912-1915a_0570.pdf", "page": 1, "text": "there the doming session and Prof H L Webb has aocepted the position as principal a t th is place. There will be ft called meet ing of the County School Board at this place on Friday, June llth - to attend to im portant msineas.  There are sevggal contests for district offices in th is county to e decided by the Democratic  rimary in Augustnotably the candidacy o f Messrs. Wil iams and Davidvon who. aspire to the office of Supervisor in ilarshall district and Messrs. Jones and Forbes wlao ..are op posing candidates  for Super visor in Franoiflco district None of the,incum bent county officers have any opposition in heir own pr,ty, except Mr. W. T. Snoddy, who is .opposed by Mr. Gordon Etosn. Hon. E. W. Hubard went to Parmville last Saturday on lusiness. A party of gentJemen went on a fishing excursion to Jaahfs liver recently and thty anyler took the Spears Mounta n route in a new Ford ,b a r, but the mountain was too steep y d they had to call in the aid of a yoke of oxen to p ill them up lowever they caught the  fish they went for. Rev. J. J. Spencer and Mr. 1. K C hristian were tiro of the Confederate veterans who attended the reunion in Blok- mood. It was really too bad or the old soldiers to have had such inclement weather. Mr. y . M. Rogers, who is now ocated m Charlotte County, is le-te on a visit to his home peo ple. Slate River w as out of its banks for a short tim e while the beautiful rain was failing ast week. Mr C. J . M orris was here on busineqp last week and he said the Appomattox liver went over rr ost of his corn th at was on low lands."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "were tiro of the <mark>Confederate</mark> veterans who attended the <mark>reunion</mark> in Blok- mood. It"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "were tiro of the <mark>Confederate</mark> veterans who attended the <mark>reunion</mark> in Blok- mood. It"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1332.96, 802.74, 1472.37, 946.43], "bbox_id": "105f75f8cf", "file": "AppomattoxNewspapers_1922-1923a_0455.pdf", "page": 1, "text": "The Confederate headquarters ill be at Murphys Hotel, and the urean of Information will be on le bridge in Richmond during the iniou. Large comfortable rooms II be provided. Mrs. Stonewall ickson will be at the headquarters ieday during the reunion to see ir old Confederate friends. All 11 be welcomed. The headquart- f will be in charge of Mrs. Thos. Bocock and her committee."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "headquarters ieday during the <mark>reunion</mark> to see ir old <mark>Confederate</mark> friends. All 11 be"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "headquarters ieday during the <mark>reunion</mark> to see ir old <mark>Confederate</mark> friends. All 11 be"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1156.31, 456.27, 1311.72, 1799.02], "bbox_id": "3d04c13708", "file": "AppomattoxNewspapers_1922-1923a_0446.pdf", "page": 1, "text": "tached to the side of the wagon children being arranged in tio io lines. Hundreds of little girl lit pretty little white frocks and wav ing small Confederate flags inter spersed among as many boys form ed a most imposing sight, and on will be remembered and looked bark upon with pleasure by every child who took part in the imposing cerr. inony. Practically all the school children in Richmond were in the parade. Thousands of people lined the sidewalks on each side of the thoroughfare to witness the imnot ing spectacle. The windows on each side of the street were lined with men, women and children. The vet erans turned out in full force to do this last honor to the Confederate President. Many of the old men wept as the statue moved along the street. The sttaue will he finally unveiled with imposing ceremonies during the reunion of the Grand Camp Confederate Veterans in May Heartbroken over the frustration of their plans to be married, Miss Mabel Pendleton, of Waynesboro, committed suicide at an early hour in the morning by leaping from a suspension bridge that connects Clif ton Forge with a suburban settle ment, and her lover, Stuart Gay, in an effort to save the life of his sweetheart, was also drowned The young couple left Clifton Forge at midnight en route for Washington with the intention of being married. They were intercepted at Staunton by a telegram from Mrs. W. H. Hooker, sister of Miss Pendleton, with a request that they be sent back on the next train. Arriving in that city at 7 oclock A. M., they started for the home of Mrs. Hooh- er, over the suspension bridge. When about half way across Miss Pendleton leaped to the water, aboqt 30 feet below. Mr. Gay reached out to save- her, but his grasp was elud ed and in a twinkling her body was floating down the stream. Gay then climbed over the railing and sus pended himself from a beam and dropped into the water. He swam to the Side of the girl. She stretch ed out her hands and clasped him about the neck, and in an instant , both were drowned. Rumors that the Jamestown Ex position will be closed for twe weehs after the spectacular opehing on April 26 In order that it might be completed has caused the board of directors of the fair to adopt a reso lution, which says in part All the leading features of the celebration will be completed on the opening day and will afford visitor great interest and entertainment The incompleteness is only in minor features. Be it, therefore, known that the Exposition will be open from April 26 to November 30, 1907, Sun days excepted. Benjamin Burks and 0. H.. Year mans, white prisoners serving ont a sentence on the Danville chain gang, made a daring escape while at work on a rock quarry near Danville. De spite the fact that they were chain ed together the prisoners made a dash tar the woods and escaped. The general board of directors of the State hospitals met at the Cen tral State Hospital, in Dinwiddle County, and was in session for sev eral hours. The board unanimously elected the following superintendents for a term of four years Dr. Wil liam F. Drewry, for the Central Dr. O. C. Brunk, for the Eastern Dr. T. D. Dejarnelle, for the Western, and Dr. A. S. Driddy, tar the South western. In the four hospitals there are 3,193 patients, and there are no insane kept In jail anywhere in the State. The board, at its meeting, appointed one director from each hospital a member of the committee of arrangements tar the meeting ot the National Association tor tn Study of Epilepsy and the Care or Epileptics, which is to he held w Richmond next October. Peanut dealers of Norfolk, tn greatest peanut market in the worw, have been in somewhat pf a pan for the last several days, as the re mit ot the shortage of stock. Prw have soared In consequence. 1 stock on hand Is the smallest o dozen years. There are probably was found, not more than . bags of peanuts in this mar whereas usually at this yea,r there are about 250,000 hag A short crop and heavy demand responsible for the scarcity. The Jury which tolled to on a verdict in the ease  - OConnor, at Norfolk, charged the murder of Frank Spence, years old, because the boy stood rogatory remarks about him, a six tor a sentence of 18 years penitentiary, one for 8 years. for 5 years and three for acqu People In the neighborhood  Ash cake, Hanover County, g tonished to hear of the elopemen Miss Mary Cross, daughter m , Wert .Cross, a well-to-do arm  ig Edward Smith. The bridegr , s  32 years of age, while the b J but 15. The bride retired at n b as usual, and it is supposed tnai slipped out of the bouse a , Jnber. household was wrapped in So successfully did the swee keep their secret that their P were made without the prosp T husband visiting her in her 0 Fred S. Hoback, of Floyd Count!-. . who has been serving a ter . months in jail for u n la w fu l  ing, has been pardoned by w ,  . Swanson. Hoback was con1 Jny I shooting Dr. John L. Jett ntei  of last year. The Par0  . pe- by the Governor is based upo tition signed by the judge aD , I who tried the case and by P  nent citizens of Floyd Conn. is also said by the Floyd Ja  clan that Hohacks healt  I and that further imprisonmen  endanger his life."}, "highlight": {"text": {"matched_tokens": ["reunion", "Confederate"], "snippet": "imposing ceremonies during the <mark>reunion</mark> of the Grand Camp <mark>Confederate</mark> Veterans in May Heartbroken"}}, "highlights": [{"field": "text", "matched_tokens": ["reunion", "Confederate"], "snippet": "imposing ceremonies during the <mark>reunion</mark> of the Grand Camp <mark>Confederate</mark> Veterans in May Heartbroken"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.93, 307.29, 2066.79, 1514.39], "bbox_id": "6bb707a814", "file": "AppomattoxNewspapers_1902-1905a_0361.pdf", "page": 1, "text": "Since the death of Rev. Dr. Malcolm MacVicar the Virginia Union Univer sity, near Richmond, has been without a president. Information has just been received that the executive board of the American Baptist Home Mission Society, which controls the institution, held a meeting in New York, and ap pointed Dr. George Rice Hovey to fill the place temporarily. The prospects are that he will be made president permanently. Dr. Hovey has been connected with the university for some years. He is a man of exceptional ability. The Virginia Union Univer sity is situated just outside the north ern boundaries of Richmond.  It has a number of splendid buildings and is doing a great work for the colored race. J. W. Adcock, of Amherst county, who was employed in the Buena Vista furnace yard on the cinder dump, was, a few nights ago, run over by the cinder engine and both of his legs mashed. It is thought that he was asleep, as no one saw him when the accident took place. His left leg was amputated above the ankle and it is thought that the other one will also have to be taken off. While a freight train was engaged in shifting on the Atlantic Coast Line, in Manchester, a car loaded with lum ber weighing 30,000 pounds broke away, tore the track to pieces and rushed into - Perry street, narrowly missing a crowded street car and scattering pedestrians right and left. The car toppled over and strewed the street with lumber. The Neff-Rice Camp, Confederate Verterans, held their annual reunion near Newmarket. Lieut. Gov. Joseph Willard, of Fairfax, Hon. Henry Downing, of Warren, Col. E. E. Stick- ley and Mr. Gilbert Pence, of Shenan doah, delivered addresses. A numbet of camps and several thousand peo ple were present. Robert Lee, white, 30 years old and unmarried, who said his home was al Columbia, N. C., was arrested by Depu- .ty United States Marshal West at Lamberts Point on a charge of coun terfeiting. A number of spuriout coins were found in Lees possession 1 M rs. Mary A. Knick, aged 82 years, of Collierstown, Rockbridge county is dead. She was a daughter of Mr and Mrs. William Armentrout and re sided during her whole life in th house in which she was born and died. Her husband, William Knick, died from the effects of a wound which h received in the battle of Chancellors ville, in May, 1863. Three sons survive her. After spending seven months in th inaccessible mountains of Tazewell county in order to avoid the officer! of the law, Thomas K. Leedy, t wealthy farmer, rode into Tazewe! and surrendered to, the sheriff, whe met him by appointment at the horn of State Senator J. N. Harman, whe will act as his counsel. In Januarj last according to the charge, Leed shot and killed Walter Harris, a pas senger on a train, near Graham. H immediately took to the mountains and the officers found it impossible tc arrest him. Finally, however, Leedj grew tired of being a fugitive fronr justice and agreed to give himself up In addition to being charged with the killing of Harris, Leedys defendant in a suit for damages amounting tc 10,000 brought by the relatives 01 th dead man. His trial on the charge ol murder will take place next month It is thought that Leedy will be ac quitted. He is a man well-known ir the Southwest. He posses great phy sical strength and exceptional skill in the use of the revolver and rifle. A sensational horsewhipping occur red on the streets of Leesburg ir which Mayor S. Carroll Chancelloi played the role of victim. Mrs. Geo Ferguson, who had charged the mayo with slandering her, wielded the wea pon, and mayor in defending himsell struck Mrs. .Ferguson with his cane The community has been thrown intc a perfect fever of excitement in conse quence vof the affair. It seems that about a year ago the mayor boarded at the home of Mrs. Ferguson. Re cently anonymous letters have beer, circulated concerning his conduct, and the mayor accused Mrs. Ferguson ol being their author. Harry Hoover, a young blacksmith living in Basic City, and working ir Staunton, was run over by a C.  O train while on his way to work. H later died. One foot and one arm were cut off and he was badly cut about the head and body. He was.2 years of age and has a wife at Basic It is thought he was riding a freight and tried to jump off before reaching the station, when he fell under the train. The first case under the new drug law came up Thursday when a Rich mond druggist was fined 25 for the sale of cocaine to a victim of the co caine habit. The police justice an nounced that in the future the fine would be 100 for each offense. The last Legislature passed a law forbid ding the sale of cocaine to any per sons except physicians, dentists and druggists. In Richmond many of the victims of the drug are young boys. Rockbridge Chapter of Royal Arch Masons was organized at Lexington by Mr. William J. Hubard, of Lynch burg, assisted by Mr. J. W. C. Bryant and Mr. B  F. Grove, of Clifton Forge The following officers were elected- .High priest, R. E. Hutton king, V B. McClure scribe, H. O. Dold. There were twenty applcations presented for membership."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "lumber. The Neff-Rice Camp, <mark>Confederate</mark> Verterans, held their annual <mark>reunion</mark> near Newmarket. Lieut. Gov."}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "lumber. The Neff-Rice Camp, <mark>Confederate</mark> Verterans, held their annual <mark>reunion</mark> near Newmarket. Lieut. Gov."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2224.12, 1261.59, 2389.57, 1431.69], "bbox_id": "1f4ccb5dab", "file": "AppomattoxNewspapers_1912-1915a_0497.pdf", "page": 1, "text": "Prominent Confederate veterans and officers of R. E. Lee Camp. No. 1, of Richmond, were given a hearing by tho Finance Committee of the House in the State Corporation Commission courtroom on the bill introduced by Major J. N. Stubbs, of Gloucester, ap propriating 10,WO to be used in enter taining Confederate veterans at the coming reunion to ,be held, in Rich mond, June 2-4. The bill provides that the amount shall be paid over to a committee representing Lee Camp, consisting of General J. Thompson Brown, Captain John Lamb and Edgar D. Taylor, who shall file a report of their expenditures with the State Auditor."}, "highlight": {"text": {"matched_tokens": ["Confederate", "reunion"], "snippet": "used in enter taining <mark>Confederate</mark> veterans at the coming <mark>reunion</mark> to ,be held, in"}}, "highlights": [{"field": "text", "matched_tokens": ["Confederate", "reunion"], "snippet": "used in enter taining <mark>Confederate</mark> veterans at the coming <mark>reunion</mark> to ,be held, in"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
