{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Crawford", "Jones"], "snippet": "Bocock, L. D. Isbell, <mark>Crawford</mark> <mark>Jones</mark>, Edward Woodson, T. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford", "Jones"], "snippet": "Bocock, L. D. Isbell, <mark>Crawford</mark> <mark>Jones</mark>, Edward Woodson, T. J."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2286.96, 1033.09, 2460.92, 1210.63], "bbox_id": "f749008b2d", "file": "AppomattoxNewspapers_1943-1947a_0210.pdf", "page": 1, "text": "N. R. Feather.tcn announced this week that pictures at- former com monwealth attorneys would be pre sented to the county at exercizes beginning at 12 oclock, June 1st., in the commonwealth attorneys office at the court no use. County Clerk C. W. Smith will preside and N. R. Featherston will present the pictures, which will be accepted for the county by W. M. Abbitt. Pictures to -be pres anted include those ol Thos. S. Boeock, Lewis Daniel Isbell, Crawford Jones, Ed win R. Woodson, Thos. J. Thorn hill, David A. Carif-tiu-v W. Court ney Franklin, Hal D Flood, Sam uel L. Ferguson ana Joel W.Flood."}, "highlight": {"text": {"matched_tokens": ["Crawford", "Jones"], "snippet": "Boeock, Lewis Daniel Isbell, <mark>Crawford</mark> <mark>Jones</mark>, Ed win R. Woodson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford", "Jones"], "snippet": "Boeock, Lewis Daniel Isbell, <mark>Crawford</mark> <mark>Jones</mark>, Ed win R. Woodson,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1345.85, 640.59, 1478.81, 994.55], "bbox_id": "5f8d2f0196", "file": "TimesVirginian_1980a_0314.pdf", "page": 1, "text": "Jones Crawford Caldwell Jones Crawford Caldwell, 68, of 2214 Park Place, died in Lynchburg General Hosp ital Friday, He is survived by his -wife Susie Carr Caldwell. He was born in Appomat tox County, to the son of the late Madison Caldwell and Susie Jones Caldwell. He was a member of the Travelers Protective Assoc iation, West Lypehburg Baptist Church and the Dependable Sunday School Class. He was the owner and operator of the Custom Dry Cleaners. In addition to his wife he is survived by a daughter, Mrs. Joyce Caldwell Koss of Lynchburg, three sons, Thomas Lynn Caldwell of New Orleans, La.. Sterling Crawford Caldwell and Travis Jones Caldwell, both of Lynchburg one brother. Hubert Caldwell of Appo mattox three sisters, Mrs. Lena Eversde of Lynch- burgi Mrs. Ruby Lewis Of Appomattox, and Mrs. Cath erine Dean of Bcdfi three grandcl"}, "highlight": {"text": {"matched_tokens": ["Jones", "Crawford", "Jones", "Crawford"], "snippet": "<mark>Jones</mark> <mark>Crawford</mark> Caldwell <mark>Jones</mark> <mark>Crawford</mark> Caldwell,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "Crawford", "Jones", "Crawford"], "snippet": "<mark>Jones</mark> <mark>Crawford</mark> Caldwell <mark>Jones</mark> <mark>Crawford</mark> Caldwell,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [355.7, 944.9, 682.9, 2013.26], "bbox_id": "e39a44cec5", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "a boys feelings. Going back to the old faipiljes, 1 recall the Adams familythe indus trious father and good Christian mother of Duval, Holcombe and Dick, and of Mrs. John W. Carroll, Mrs. Adams was a sister of the late Governor Duval of Florida, who pent much of the latier part of his d Miss Jennie was terribly afraid  jjfg aj. ber home near the old Court-  ! lightning. She occupied a short j douge writing a history of. Florida, sura with Isbell. At a loud clap of l djed before completing it, Some thunder and a vivid flash of lightn-, y6ars ag 0 j wrote a little piece about Dig, she involuntarily sprang nearer Lj,js most remarkable aud adventur- tu Isbell, wheu with his character -1 uj 0 jd governor, which the News i t ic humor he said, Set up close!  stick close to me, Miss Jennie,! Im the best lightning rod you! ever saw. Isbell went West and! I do not know if he is living  if so he is it is ou  borrowed i time, long past his three score and j leu. How well 1 recall his paro dies. One lie often repeated to the j girie- The girls are all deceitful show For mans deception given, Their s-iniles of joy and tears of woe. Deceitful shine, deceitful flow, Tljeie aint one true in Teven. BUCK TRENTS ANSWER. What would Appomattox be with out Buck Trent? Genial, jolly, fat Duck Trent. i liaye already alluded to the bos pitalityof Major West and his in- aristocratic tace terrestiug family, yet 1 must recur to it aguiu. 1 am debtor for some oi the happiest hours of my life to those good people. They hau then four grown daughters,, aud with liieLr numerous pretty cousiuE who visited the place, twas of course the reso t of we youug meu. It was approached by two roads meeting at right angles at the horse rack. How ofteu as Jim Robertson and myself would strike the clearing on one road, would we see Dauiel Isbell, Buck Trent and Crawford Jones approacuing on the other, when we would all dismount in a group at the gate.. On one occasion Christmas night the Major gave an oyster supper. Among the guests were the old people of the neighborhood m the private part of the mansion and enough of us younger ones to nearly fill the parlor. As the wee sma hours of the night approached, the older people came into the parlor as they dotted their wraps for the night ride home. For a moment there was a scarcity of seats, and while the small butler, Archer was bring ing in chairs, the old Major thought to fill in the time with a little trick for the boys. His plan was to place a lighted candle on the table, blind fold a boy, make him turn three times and approach the candle to blow it out. Bob West was a very bashful boy. He had a hen-house and was fond of chickens, and had been after his father fora few pul lets he had bought for the table. To induce him to try the candle the Major said, Come, Bob, if you will blow it out 111 give you two of my pullets. Buck Trent, who had 1 . ig had a weakness for one of the Majors pretty daughters, jumped up, and with that brass that only Buck could show, said, Major, if youll just give me one of your pul- lets Ill blow it out. Of course the room roared, and the Major had to give attention to Archer and the chairs. A little northwest of the Court house lived Dr. Palmer, au educated, refined, accomplished old Virginian gentleman. Like Doc Sifeis, he tramped tnose roads and forded those streamsor swum umfor two generations. I cau remember when he kept three horsfts, aud kept them all busy, too. He must have bad an iron constitution. His practice em braced Appomattox, a portion of Campbell and Buckingham and of ten over into Amherst. Who can tell the joy of the grieved mother and anxious father as they watched the fevered brow of u loved child, to see the Dr. ride up .on old Lion"}, "highlight": {"text": {"matched_tokens": ["Crawford", "Jones"], "snippet": "Isbell, Buck Trent and <mark>Crawford</mark> <mark>Jones</mark> approacuing on the other,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford", "Jones"], "snippet": "Isbell, Buck Trent and <mark>Crawford</mark> <mark>Jones</mark> approacuing on the other,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2234.13, 286.26, 2403.71, 552.51], "bbox_id": "fb144bf9bf", "file": "AppomattoxNewspapers_1943-1947a_0122.pdf", "page": 1, "text": "MRS. BELL JONES PAYNE 1854 1943 On December l6t, 1948, Mrs. Bell Jones Payne passed away at the home of Misses Minnie and Lizzie Perrpw, in Lynchburg, Va., where she had made her home for the past three years. Mrs. Payne was the daughter of Dr. David Crawford and Eliza Walton Jones. Her fath er passed away when she was five years old, leaving her to the care of her mother, who well filled the place of both father and mother. Mrs. Payne had a keen intelligent and literary ambition and was well educated. She was among the lead ers of her neighborhood in all church and social activities and was a devout member of Mt. Comfort Church in Appomattox County. She was a very efficient and popular public school teacher, and the wri ter began his first session in school in 1880 as one of her pupils. In 1863 she was united in marriage to Mr. Samuel Garland Payne, one of the leading citizens of Campbell County, later of the City of Lynch-"}, "highlight": {"text": {"matched_tokens": ["Crawford", "Jones"], "snippet": "daughter of Dr. David <mark>Crawford</mark> and Eliza Walton <mark>Jones</mark>. Her fath er passed"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford", "Jones"], "snippet": "daughter of Dr. David <mark>Crawford</mark> and Eliza Walton <mark>Jones</mark>. Her fath er passed"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1771.21, 977.78, 1932.11, 1103.04], "bbox_id": "75179949ce", "file": "AppomattoxNewspapers_1892-1898a_0029.pdf", "page": 1, "text": "A ssaulted by a Convict. C olumbus . O. Dec. 5.George Jones, a life man from Crawford county, made an assault on Guard E. O. Gump at the state prison by throwing an iron kettle at him. The latter fired two shots at Jones, one taking effect ta the right side and the other in the arm .______________ _ Stole a Five Cent Cigar. V alparaiso , Ind., D m . 5.George Smith is to be tried here for the third time for the theft of a five cent cigar. Two justice courts have tried the case and it now goes to the circuit bench. About 1,000 has been expended to lawyers fees."}, "highlight": {"text": {"matched_tokens": ["Jones", "Crawford"], "snippet": "olumbus . O. Dec. 5.George <mark>Jones</mark>, a life man from <mark>Crawford</mark> county, made an assault"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "Crawford"], "snippet": "olumbus . O. Dec. 5.George <mark>Jones</mark>, a life man from <mark>Crawford</mark> county, made an assault"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1767.37, 982.74, 1927.1, 1047.96], "bbox_id": "61c4aa0edd", "file": "AppomattoxNewspapers_1892-1898a_0028.pdf", "page": 1, "text": "A ssau lted b y a C onvict. COLUMBUS. O. Dec. 5.George Jones, a life man from Crawford county, made an assault on Guard E. O. Gump at the state jrison by throwing an iron kettle at him. the latter fired two shots at Jones, one taking effect in the right side and the other in the arm. ________ _"}, "highlight": {"text": {"matched_tokens": ["Jones", "Crawford"], "snippet": "COLUMBUS. O. Dec. 5.George <mark>Jones</mark>, a life man from <mark>Crawford</mark> county, made an assault"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "Crawford"], "snippet": "COLUMBUS. O. Dec. 5.George <mark>Jones</mark>, a life man from <mark>Crawford</mark> county, made an assault"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1615.36, 1232.22, 1756.32, 1402.77], "bbox_id": "d903c7744f", "file": "AppomattoxNewspapers_1962-1965a_0294.pdf", "page": 1, "text": "cleaned out. Mrs. Gaines said Saturday that inventory lists were not complete but that every effort is being made to replace the stolen mer chandise promptly with new items in order to meet requests for Christmas gifts. She reported that a previous attempt to enter the store was made on November 20 or 21, the same time that West End Market was robbed. An investigation is being con ducted by State Police Investi gator R. David Jones and State Trooper J. A. Crawford."}, "highlight": {"text": {"matched_tokens": ["Jones", "Crawford"], "snippet": "Investi gator R. David <mark>Jones</mark> and State Trooper J. A. <mark>Crawford</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "Crawford"], "snippet": "Investi gator R. David <mark>Jones</mark> and State Trooper J. A. <mark>Crawford</mark>."}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2301.59, 1457.44, 2476.45, 1755.44], "bbox_id": "42e040d40a", "file": "AppomattoxNewspapers_1943-1947a_0223.pdf", "page": 1, "text": "The family of the late Mr. and Mrs. M. C. Caldwell met last Sun day,- June 10. at the home of Mr. and Mrs. C. D. Lewis. Mrs. Lewis and Mrs. Hubert Caldwell were joint hostesses. In addition to Mr. and Mrs. C. D. Lewis and family, Mr. and Mrs. Hubert H. Caldwell and family, were Mr. and Mrs. S. B. Marshall and sons, Benjamin of Charleston, W. Va. and Lt. Douglas Marshall, A. A. F., Tucson, Arizona Mrs. Joe L. Eversole and son, Clark Caldwell of Hazard, Ky.j Mr. and Mrs. Jones Caldwell and daughter, Joyce and son, Sterling Crawford of Lynchburg Dr. Md Mrs. B. W. Dean and daughters, Margaret and Martha of Bedford, fihe only absent members were Joe L. Eversole and Hubert H. Caldwell, Jr., S 1-C, U. S. Naval Hospital, San Diego, Calif. This occasion was of special significance, being the birthday of Hubert Caldwell, and a farewell to Lt. Douglas Marshall, A. A. F.,who is co-pilot on a B-29 and is expect ing overseas duty at once."}, "highlight": {"text": {"matched_tokens": ["Jones", "Crawford"], "snippet": "Ky.j Mr. and Mrs. <mark>Jones</mark> Caldwell and daughter, Joyce and son, Sterling <mark>Crawford</mark> of Lynchburg Dr. Md"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "Crawford"], "snippet": "Ky.j Mr. and Mrs. <mark>Jones</mark> Caldwell and daughter, Joyce and son, Sterling <mark>Crawford</mark> of Lynchburg Dr. Md"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1032.21, 200.41, 1174.06, 403.65], "bbox_id": "dce345ea5c", "file": "TimesVirginian_1976_0180.pdf", "page": 1, "text": "with Mr. Osborne and Mr. Crawford Davidson.  Mr, and Mrs. William Ahris and Bridgett were dinner guests of Mr. and Mrs. i p. Al vis Jr. on Sunday. Mr. and Mrs. Bob Wheeler and Joan of Richmond, Mr, and Mrs. H. B. Jones and family were dinner guests of Mr. an Mrs. LB. Wheeler on Sunday. Mr. and Mrs. Ben Wheeler were visitors on Saturday night. Qn Sunday night Mr. and Mrs. Norman Jones visited L B. Wheeler. Mrs. Elsie and Nina Caldwell spent Sunday with Mr, and"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Mr. Osborne and Mr. <mark>Crawford</mark> Davidson.  Mr, and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Mr. Osborne and Mr. <mark>Crawford</mark> Davidson.  Mr, and Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.49, 902.87, 1616.54, 1236.84], "bbox_id": "2833e3055c", "file": "AppomattoxNewspapers_1974-1975a_0430.pdf", "page": 1, "text": "with Mr. and Mrs. J. P. Alvis, Jr. Mrs. C. T. Roach spent the week end with her father, J. 0. Davidson, and uncle- Crawford Davidson. Mrs. Hugh Braford and Mrs. Minnie Burnette spent Satur day night with friends in Petersburg and visited Mr. Hugh Braford in McGuire Hospital Saturday and Sunday. He is doing very well, but has to have more treatment so he remained at the hospital Mrs. Wallace Bondurant fell in the house and injured her arm. No bones broken, but badly sprained. We wish her a quick recovery. Mr. and Mrs. Herbie Gordon, of Richmond, Mr. and Mrs. Ben Wheeler, Mrs. H. B. Jones, Kathy and Richard visited Mr. and Mrs. I. B. Wheeler Sunday. Mr. and Mrs. Eugene Cyrus had as their guests for the week end from Pennsylvania Mr. and Mrs. James Kline. His mother went with them home after spending two weeks with her brother, Eugene Cyrus."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "0. Davidson, and uncle- <mark>Crawford</mark> Davidson. Mrs. Hugh Braford"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "0. Davidson, and uncle- <mark>Crawford</mark> Davidson. Mrs. Hugh Braford"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1027.43, 169.73, 1168.98, 558.46], "bbox_id": "7bc43b36a7", "file": "AppomattoxNewspapers_1974-1975a_0473.pdf", "page": 1, "text": "will do their best in each office. Mr. and Mrs. Lyle Thomas had all of their duldren-in-law and grandchildren and great grandchildren for dinner Sun day. Mrs. Hazel Gillaapie, Mr. and Mrs. I. B. Wheeler were Saturday night supper guests of Mr. and Mrs. Bill Roupe. Such a lovely supper was enjoyed by all. Mrs. I. B. Wheeler and Mrs. Hazel Gillaspie were shoppers in Lynchburg Friday. Mrs. C. T. Roach spent Sunday with ehr father, Mr. Osborne Davidson and uncle, Crawford Davidson. All in the neighborhood that were sick are doing fine now. A lot from this section went to RR Day at Appomattox Saturday and Sunday. There were really a lot of folks out. We were thankful for such a sunshiny day Sunday. The revival is in progress at Bethel this week. Rev. Johns ton from Concord in going some fine sermons. Come out and hear him. Mr. and Mrs. I. B. Wheeler visited Mr. Norman Jones and Mr. Burton Carson, Jr. Sunday afternoon. Both are doing quite well."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Osborne Davidson and uncle, <mark>Crawford</mark> Davidson. All in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Osborne Davidson and uncle, <mark>Crawford</mark> Davidson. All in the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [538.32, 201.28, 684.03, 829.25], "bbox_id": "5fc6d1a897", "file": "TimesVirginian_1976_0104.pdf", "page": 1, "text": "We were so glad to see Mrs. Elsie Thornhill at church last Sunday after her winter stay with her daughter, Mrs. Floyd Weidman, of Connecticut. Mr. Crawford Davidson had to be taken to the doctor in Lynchburg twice last week. He went again Tuesday. His niece, Mrs. Mary Barrel!, spent last week with him and Mrs. Catherine Judy is there to stay this week. Mr. Osborne is about the same with the good care Mrs. Becky Shanks is giving him. Mr. John Langhon is able to help with eating alone, but his speech is not so good yet. So our prayers go to each sick one. Mr. Tommy Davidson is still with his sister, Mrs. Davis Smith, in Lynchburg. Mr. and Mrs. Card Mince had Rev. and Mrs. Moore of Newport News, her mother and twot sisters to pend the Week end with them. Last Friday Mr. I. B. Wheeler had a slight stroke while shaving but got over it quickly with no effects, but he went on to the doctor. at Appomattox. He was not able to go to church Sunday. It was the first time he has- missed going to church Tor three years. Thanks to the Lord. Mr. Leslie Taddy, Mr. Lyle Gilbert, Mr. and Mrs. Ben Wheeler, Mr. Wallace Bondurant, Mrs. Ruby Newman, of Norfolk, and her girl friend, Mr. and Mrs. Harvey Thomas, Mr. and Mrs. Booker, Mrs. Barbara Jordan, Mr. and Mrs. Richard Krantz and daughters and Mrs. Elsie Krantz, Mrs. Elsie and Nina Caldwell, Mr. and Mrs. H. B. Jones and Richard all visited the Wheelers over the week end. Mr. and Mrs. John Osborne Harrison and family, of Louisa, spent the week end with Mr. and Mrs. John Harrison. So nice to have our children to come."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Weidman, of Connecticut. Mr. <mark>Crawford</mark> Davidson had to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Weidman, of Connecticut. Mr. <mark>Crawford</mark> Davidson had to be"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.65, 163.45, 1159.3, 441.29], "bbox_id": "879e49dcae", "file": "AppomattoxNewspapers_1974-1975a_0467.pdf", "page": 1, "text": "Tuesday dinner guest of Mr. and Mrs. L B. Wheeler. Mr. and Mrs. L B. Wheeler attended the funeral of her sister-in-law, Mrs. J. F. Alvis, Saturday afternoon in Lynch burg. She died of a heart attack. Mr. and Mrs. H. B. Jones took them. Sunday at Hebron we honored our oldest regular attendant of Sunday School and church by singing Happy Birthay to Mr. Melvin Stratton who was 88 on Monday. We wish him many more years with us. Mr. and Mrs. Lathan Haley, of Roanoke, spent the week end with Mr. Crawford and Osborne Davidson. Mr. and Mrs. Eugene Carson visited her sister Sunday. Mr. Ben W heeler spent Sunday afternoon with Mr. and Mrs. I. B. Wheeler."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> took them. Sunday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> took them. Sunday at"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [623.29, 227.31, 760.64, 727.14], "bbox_id": "f3cb2067e0", "file": "AppomattoxNewspapers_1974-1975a_0160.pdf", "page": 1, "text": "theR. ndrnom  Fas?saij  b n of their father. He will long be remembered m  county by the farmers as he was oar first county agent. Mr. and Mrs. Stuart Barrel! spent the week end with Mr. Osborn Davidson. He remains very weak. Mr. Stuart BarreQ took Mr. Crawford Davidson to see Mrs. Annie Horsley at Guggen- bemer Nursing Home Sunday morning- H eran k tk erM tiiin about the same. Mbs Becky Davidson spent Tuesday night with her grandparents. Mr. and Mrs. Wallace Bondurant. Last week end Mr. and Mrs. Eugene Carson visited her son. Mr. and Mrs. Gene Carson ri family at Blacksburg Dont forget to feed the birds when the snow is on the ground. There are lots of Blue Jays here. Mr. Mark Elliott and a friend from school spent the week end at home. Mrs. WQ soq Garrett took her mother to Richmond to get her glasses Hope she wiB really be able to see better. Soon they wiQ give her another transplant in the other eye. It is truly wonderful how God has enabled man to help each other. Mr. and Mrs. Bob Wheeler from Richmond were dinner guests Saturday of Mr. and Mrs. LB. Wheeler. Mr. and Mrs. Ben Wheeler, Mrs. H. B. Jones, Richard were week end visitors of them. also. Mrs. R. S. Spencer is out of the hospital and at her daughters in Richmond."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Stuart BarreQ took Mr. <mark>Crawford</mark> Davidson to see Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Stuart BarreQ took Mr. <mark>Crawford</mark> Davidson to see Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.95, 449.0, 1876.65, 682.64], "bbox_id": "18f1887ddd", "file": "AppomattoxNewspapers_1905-1912a_0378.pdf", "page": 1, "text": "The vote was as follows F o r th e Bill. D em ocrats  Bacon, Bankhead, Bryan, Cham berlain, Chilton, Culber son, Davis, Fletcher, Foster, Gore, Hitchcock, Johnson of Maine John ston, of Alabam a Jones,- of W ash ington Kern, M artine, Myers, New- lands, Nixon, OGorm an, Overman, Owen, Paynter, Pom erene, Reed, Shively, Sm ith, of M aryland Smith, of South Carolina Stone, Swanson, Taylor, W atson and W illiams. Republicans  Bradley, - Briggs, Brown, Burton, Crane, Cullom, Gug genheim, Lodge, McLean, Penrose, Brandeges, Perkins, Poindexter, Richardson, Root, Stephenson, Town send, W etm ore and W orks. Against th e Bill. D em ocrats - Bailey, Clarke, of A rkansas, and Simmons. Republicans Borah, Bourne, Bris- Burnham , Clapp, Clark, of Crawford, Cummins,"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "ston, of Alabam a <mark>Jones</mark>,- of W ash ington"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "ston, of Alabam a <mark>Jones</mark>,- of W ash ington"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.2, 757.98, 1632.6, 1549.24], "bbox_id": "7b1e7ffba7", "file": "TimesVirginian_1983a_0217.pdf", "page": 1, "text": "The circular skirt was of lace trimmed in teardrop effect with embroided chantily lace laying over a double ruffle. Her train was chapel length. Her finger tip veil was three tier, made of silk and attached to a lace covered bandeau cap trimmed in matching pearls. , The bride carried a bouquet of red roses, baby carnations and babys breath. Sweetheart roses were tied into the ribbon streamers. Miss Lisa Puckett of Spout Spring was maid of honor. She wore a yellow floor length gown featuring a A-line spaghetti strap, full circle skirt with a soft bodice length chiffon cape. Bridesmaids were Joetta Craw ford, of Madison Heights, sister of the groom Joni Hale of Lynchburg and Kim Garrett of Concord. They all wore identical dresses of rainbow cdort blue,1 sea-green and pink. They all carried a bouquet of flowers accenting their dresses with streamers of the other girls colors, Mr. Crawford, father of the bridegroom, was best man. .Ushers were Doug Hall of Lynchburg, Frank Jones of Spout Spring and Glen Duff of Madison Heights. The bridegroom wore a white tuxedo featuring full length rounded tails with a white ruffled shirt accented with a white satin bow tie.. He wore a red rose bud with babys breath boutonnaire. The ushers wore silver tuxedos featuring full length rounded tails with a ruffled shirt of rainbow colors, accented with a silver satin bow tie. They wore carnations boutonnaire, tipped the colors of their shirts. The ring bearer Pat Shriver of Helena, Alabama wore formal attire idential to the groom, with a yellow rose bud boutonnaire. He carried a white satin heart-shaped pillow with streamer of white. Attending the guest register was Vanessa Hamilton of Concord. The bride is a graduate of Rustburg High , School and is studying computer science at Central Virginia Community Col lege. She is employed by RGIS Inventory Specialists. The bridegroom is a graduate of Amherst County High School and is self-employed. Following the ceremony, the parents of the bride entertained with a reception in the fellowship hall. Mrs. Shirley Tucker and Mrs. Jewell Massie were in charge of the reception. Mrs. Chinkey Wilmer served the wedding cake. Miss Linda Anthony served at the punch bowl. After a honeymoon trip to Hawaii, the couple will live in Concord."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "other girls colors, Mr. <mark>Crawford</mark>, father of the bridegroom,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "other girls colors, Mr. <mark>Crawford</mark>, father of the bridegroom,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [619.2, 286.61, 762.35, 529.15], "bbox_id": "7aa000e352", "file": "AppomattoxNewspapers_1971-1973a_0297.pdf", "page": 1, "text": "The annual dinner and instal lation service for officers of the Appomattox Womans Club will be held Monday evening May 1 at 630 p.m. at Maudes Members, husbands and other friends of the club are invited to attend. Mrs. Charles D. Hill will be giving the historians report. Mrs. A. B. Norconk, outgoing president, will be in charge of the program. Incoming officers in c 1 u d e Mrs. William E. C h e n a u lt, pres. Mrs. A. A. Fratrick, 1st vice pres. Mrs. Howlette B. Martin, 2nd vice pres. Mrs. David Jones, treas. Mrs. C.D. Hill, rec. secy. Mrs. Clifford Plunkett, cor res. secy. Mrs. Crawford L. Davidson, histor ian,"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "vice pres. Mrs. David <mark>Jones</mark>, treas. Mrs. C.D. Hill,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "vice pres. Mrs. David <mark>Jones</mark>, treas. Mrs. C.D. Hill,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [586.29, 177.36, 728.66, 727.14], "bbox_id": "8c6596569b", "file": "TimesVirginian_1976_0169.pdf", "page": 1, "text": "Stonewall I  We should not trust in ourselves but In God. 2 Cor. 19 Mrs. Elsie Krantz had as her Sunday guest Mr. and Mrs. Howard Barbour, Mr. and Mrs. Elridge Barbour, Mrs. Nellie Guill and Ann, Mrs. Nellie Proft, .of Lynchburg. Mr. and Mrs. Richard Krantz, Connie and Kim visited her mother, Mrs. Taylor, of Lynchburg, for Sunday dinner. Mr. and Mrs. J. P. Aivis, Jr. went to Orange to spend Mothers Day with her mother, Mrs. Matthews. Mr. and Mrs. J. P Aivis, IH and children went to Fincastle to visit her mother Saturday. Mr. and Mrs. Bill Roupe and family visited his parents in Madison Heights Sunday.  . Mrs. Wallace Bondurant is spending a while with her sister, Mrs. Ruby Oakes at Rustburg. She is doing nicely after surgery. Mr. and Mrs. I. B. Wheeler were dinner guests of Mr. and Mrs. H. B. Jones Sunday. Mrs. James Jordan, of Concord, Mr. and Mrs. Luther Booker visited Md. Elsie Caldwell and Mrs. Nina Caldwell Sunday. Saturday Mr. Wallace Bon durant and Mr. and Mrs. Ben Wheeler visited Mr. and Mrs. I. B. Wheeler. The children of Dale and Bonnie Campbell were sick last week but are somewhat better at this writing. Christie almost had pneumonia and Dana had infected ears. Mrs. Eleanor Roach spent Sunday with Mr. Osborne and Crawford Davidson."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> Sunday. Mrs. James Jordan,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> Sunday. Mrs. James Jordan,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2158.29, 178.34, 2308.02, 504.75], "bbox_id": "a956d9da42", "file": "TimesVirginian_1978_0030.pdf", "page": 1, "text": "STONEWALL Casting all your cares upon Him for He careth for you. I Peter 57. Mr. Hugh Braford is home from McGuire Hospital, Rich mond, Virginia. Mrs. Dancey McCraw is spending some time with her daughter Mrs. Jessie Judy at Luray who has the flu. We wish her a speedy recovery. Mr. Crawford Davidson is still suffering with shingles. Miss Tracey Staton is sick. Her mother took her to a doctor in Lynchburg Monday. Mrs Cris Gallier is a patient  at hospitalin Lynchburg. A small crowd was at Hebron  Sunday since so many has the  flu and stayed home. Mr. and Mrs. H. B. Jones  visited the Wheelers Sunday I afternoon. Mr. Wallace Bondurant vis ited Hugh Braford Sunday also  Dancey McCraw. Mr. Richard Krantz had the j flu over the week end."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "a speedy recovery. Mr. <mark>Crawford</mark> Davidson is still suffering"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "a speedy recovery. Mr. <mark>Crawford</mark> Davidson is still suffering"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [713.01, 489.72, 856.75, 868.61], "bbox_id": "858b941067", "file": "TimesVirginian_1976_0136.pdf", "page": 1, "text": "Spencer. Mrs. Elsie Caldwell  m i- back home with them after a 10-day visit with her, Mr Richard Krantz killed a big black snake at his barn, that measured 8 feet long, last week. The biggest and longest one ever killed in this neighborhood. Mr. and Mrs. A. B. Carson, Jr., Mr. and Mrs. Ben Wheeler were Saturday visitors of Mr. and Mrs. I. B. Wheeler. Sunday visitors were Mr. and Mrs. Dell Martin, Mr. and Mrs. Lawrence Wheeler and Mr . and Mrs. H. B. Jones and family. Mrs. Mary Barrell, of Culpeper, spent Saturday night with her father, Mr. J. O. Davidson and Mr. Crawford Davidson. They will move to Monroe County this week to make their home. A good number from Hebron Community went to the Farm Bureau supper Saturday night. A1 had a good time. The food was delicious and fellowship was grand. Mrs. Bob Harris and boys were dinner guests of Mis. Nina Caldwell last Friday. Mrs. Verna Herdon was home for the Week end."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> and family. Mrs. Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark> and family. Mrs. Mary"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1133.28, 1028.44, 1442.73, 1489.14], "bbox_id": "e3ac321580", "file": "AppomattoxNewspapers_1955-1957a_0388.pdf", "page": 1, "text": "son and family, of Appoa Mr. and Mrs. Donald Fertguso Appomattox Mr. and Mrs. Coleman and Mr. and Mrs, Owen, of Lynchburg. Also Curtis Martin and Mrs. Mi Floater, of Richmond. Mr. anxl Ferguson were supper gu Mr. and Mrs. Frank Fleshma night. Supper guests of Mr. and Dan Irby on Wednesday night Mrs. Rosa Irby, Mr. Edd Eldei and Mrs. Ronton Roland, Mr. Mrs. Britton, Mr. and Mis. Simms, Miss Gaynell Irby, of and friend, Mr. Crawford hams, of Miss., and D. B. Lribj Miss Virginia Mullin, da Mr. and Mrs. Emery Miuliin, Bobbie St. John, of Oharlottei were married at Chesterfield, Saturday, Dec. 22 . Mir. and Mrs. Emery Miuliin ed recently with her mother, Arthur Cyrus. Recent visitors in the home and Mrs. Booker Jones were and Mrs. Smith and Miss Stanley, and Mr. Lucas Jones of Lynchburg Mr. and Mrs. of Richmond Mr. and Mrs. of Buckingham, and Mias Jones. Miss Ruth Woodson ape Monday, Jan. 7.- The Country  holidays with her brother and Lane Home Demonstration Club will meet at 730 P. M., at the home of Mrs. Byron Cole. Tuesday, Jan. 8 .- The Clover Hill Home Demonstration Club will meet at 2 P. M., with Mrs. Verna Con ner. Tuesday, Jan. 8 .- The Richwood Home Demonstration Club will meet at 730 P. M., at the home of Mrs. Fred Wooldridge."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "of and friend, Mr. <mark>Crawford</mark> hams, of Miss., and"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "of and friend, Mr. <mark>Crawford</mark> hams, of Miss., and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [443.27, 525.91, 587.07, 877.19], "bbox_id": "aa50942e61", "file": "TimesVirginian_1978_0065.pdf", "page": 1, "text": "So teach us to number our  days, that we may apply our hearts unto wisdom. Psalms 9012 Mr. Crawford Davidson is a patient at Lynchburg General Hospital having gone there last Monday, He was somewhat better Saturday. Mr. Osborne is very ill at his home. So let our prayers go out to each of these fine old men. Mr. Hugh Braford is still very ill at McGuire Hospital. His wife went to see him Saturday and Sunday. Mrs. John Alvis, III had her mother and two sisters to visit her Sunday from Fincastle, Va. Mrs. Barbara Jordon, of Concord, visited her mother, Mrs. Elsie Caldwell Sunday. Mr. and Mrs. Ben Wheeler, Mr. and Mrs. H. B. Jones and Richard visited Mr. and Mrs. Wheeler Sunday. Mr. and Mrs. Joseph Hunt, of Charlottesville, and daughter, Vicki, spent the week end with Rev. and Mrs. E. V. Mitchell. Mrs. Dixie Staton is sick and has been in bed for two weeks. We hope she will soon be"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "wisdom. Psalms 9012 Mr. <mark>Crawford</mark> Davidson is a patient"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "wisdom. Psalms 9012 Mr. <mark>Crawford</mark> Davidson is a patient"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2189.06, 190.05, 2334.21, 568.43], "bbox_id": "1f4239e00d", "file": "AppomattoxNewspapers_1974-1975a_0379.pdf", "page": 1, "text": "Set your affections on things above, not on things on the earth. W.O.L Billy King and his family are visiting his parents, Mr. and Mrs. H. G. King for a week before reporting for duty at Camp Gordon, Atlanta, Go. Mr. and Mrs. Charles Judy spent the week end with her father, Mr. J. O. Davidson and Mr. Crawford Davidson. Mrs. Tom Davidson, Mrs. John Harrison and Mrs. Phil Harrison took Mr. Crawford D avidson to G uggenheim er Home several tim es last week to visit Mrs. Horsley. She remains about the same. The Smith-Skinner wedding was at Hebron Saturday with a large crowd present. Many good wishes go with them for a long and happy life. Mrs. Hazel Gillaspie visited Mrs. Krantz. The W heelers and Mrs. Nina Caldwell last Friday afternoon. Mrs. Nina Caldwell will go to the doctor Friday and have the body cast taken off and get a lighter cast on her arm. Mr. and Mrs. Ben Wheeler, Mr. and Mrs. Jamie Ferguson from Lynchburg, and Mrs. H. B. Jones visited Mr. and Mrs. I."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "O. Davidson and Mr. <mark>Crawford</mark> Davidson. Mrs. Tom Davidson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "O. Davidson and Mr. <mark>Crawford</mark> Davidson. Mrs. Tom Davidson,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.3, 387.18, 1726.28, 1436.12], "bbox_id": "776b0d3f1d", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "SCRUGGS DICKERSON. On November 18, 1903 at Old Concord church was celebrated one of the prettiest marriages ever wit nessed in that vicinity, the contract ing parties being Mr. James Preston Scruggs and Miss Nannie Dicker- son. Very promptly at 300 p. m. the opening strains of Mendelssohns wedding march, rendered by Mrs. R. W. Stratton, announced to the large audience gathered, that the bridal party were about to enter. First came the ushers, Mr. Wat kins Nowlin and Mr. Will Spencer, of Spont Spring, followed by the waiters in the following order Mr. Layton Howerton with Miss Nina Chilton, Mr. Evans Akers with Miss Lee Steele, Mr. Hampton Steele with Miss Willie Hunter, Mr. Warren Scruggs with Miss Mary Hunter, Mr. Charlie McKinney with Mrs. Charlie McKinney, Mr. Alfred Cheatham with Miss Addie Spencer, Mr. Tom Caldwell with Miss Viola Moss, Mr. Norman Taylor with Miss Lillie Evans, Mr. Tom Scruggs with Miss Esther Coleman, Mr. Will Goodman with Miss Sllie Scruggs, Mr. W. E. Dickerson with Miss Annie Jones, Mr. W. E. Price with Miss Mary Goodman, Mr. Herbert Cheatham with Miss Mary Green, Mr. Elliott Cheatham with Miss Nannie Morriss, Mr. Lyn Sandidge with Miss Bessie Shearer, Mr. Leslie Morriss with Miss Minnie Cheatham. Then up the left ai 9 le came tbe lovely bride with her maid of honor, Miss Mittie Dickerson, immediately preceeded by little Laura Dickerson, sister of the bride, aB flower girl, while little Eunice Fnrbnsh preceed ed the groom and his best man, Mr. Crawford D. Scruggs, up the right aisle, meeting at the altar beneath a beautiful bridal arch, they were impressively united in the holy- bonds of wedlock by Rev, J. P. Rogers, while Loves old sweet song softly floated from the organ. The church was very tastefully decorated in evergreeu and chrys anthemums. The bride was attired in white organdie over white taffeta and white tulle bridal veil and car ried white chrysanthemums. The maid of bouor and flower-girls also carried huge bunches of the same beautiful flowers. Mr. .and Mrs. Scruggs accompan ied by a large number of friends drove to Spout Spring, where they boarded the east-bound N.  W. train for Richmond and other points East, amidst a shower of rice and good wishes.  The bride is a daughter of Mr. T. E. Dickenson, one of Appomattoxs most successful farmers, and is much admired for her beauty and charm of manner, and will be great ly missed in her community. The groom is an enterprising young merchant of Concord, Va., and is deservedly very popular with every one. The dinner to the brid al-party at the home of the bride on the day of the marriage, and the reception at the grooms fathers, Mr. J. J. Scruggs of Appomattox, were very enjoyable occasions. Tbe bridal gifts were numerous and handsome, including silver, china, bric-a-brac and other things too nnmerons to mention. Mr. and Mrs. Scruggs will be at home to ihrir many friends after November 23, at Concord."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Dickerson with Miss Annie <mark>Jones</mark>, Mr. W. E. Price"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Dickerson with Miss Annie <mark>Jones</mark>, Mr. W. E. Price"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [575.72, 585.97, 721.88, 993.64], "bbox_id": "aaf474e55c", "file": "TimesVirginian_1976_0150.pdf", "page": 1, "text": "Ruby Oakes in Lynchburg General Hospital several times last week. Rev. Hawkes preached a fine sermon at Hebron oh Sunday.  Mr. and Mrs. Herbert Matthews of Orange, spent Saturday with Mr. J. 0. Davidson and Mr. Crawford Davidson. Mr. and Mrs. Layton Haley or Roanoke spent Saturday night and Sunday with them. Mr. Carol Mince remains about the same at Duke University Hospital at Durham, North Carolina. Mrs. John Ewers came home Friday after several weeks stay at the hospital in Richmond. She had her third eye transplant. Pray for her to be able to see now. She will go Tuesday for examination. - Mr. and Mrs. Tom Ray Burnette. Mr. and Mrs. H. B. Jones and Richard, Mr. and Mrs. Ben Wheeler were week-end visitors of Mr. and Mrs, I. B. Wheeler. Mr. and Mrs. Bhrnette have jujst returned from an auto conven tion in Las Vegas, Nevada. What a fine trip it was. Little Jack Harris spent the week-end. with her grandmo ther Mrs. Nina CaklweliiikeJ -  ...-..-A."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "0. Davidson and Mr. <mark>Crawford</mark> Davidson. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "0. Davidson and Mr. <mark>Crawford</mark> Davidson. Mr. and Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1828.78, 231.72, 1981.59, 965.55], "bbox_id": "45ac14e014", "file": "TimesVirginian_1976_0232.pdf", "page": 1, "text": "Rev. Crawford Williams of Louisana preached a wonderful sermon at Central Baptist Church Sunday morning. Rev. Williams and family were a welcome sight at church.  Mr. and Mrs. Raymond Rowland of Gretna And Miss Anna Irby of Washington were at church on Sunday. Mr. Ned Roberts, son-in-law of Mr. and Mrs. Booker Jones is in the Virginia Baptist Hospital where he underwent surgery today. Rev. Crawford Williams and family, Miss Anna Irby, Mr. and Mrs. Raymond Rowland are visiting in the home of Mr. and Mrs. Pat Davis and famfiy. Mr. Alvin Goggin is à patient in a hospital in Charlottsville where he underwent surgery. Mr. and Mrs. Henry Mann I visited Mr. and Mrs. Milton Nash Sunday night. Mr. and Mrs. Emery Mullins visited Mr. and Mrs. Vernie Jones Sunday night. Mrs. Milton Nash and Mrs. Lloyd Cyrus visited Mr. Lloyd Cyrus in the nursing home on Sunday.  . Our Sympathy goes to the family of Mrs. Jim Wallerdiie to the death of her brother Mr. Carson. m ti Mr. and Mrs. Kenneth Goggin visited Mr. Goggin in Charlottsville on Saturday. Mrs. Elliott Nash and Dawn Kerr spent Sunday with Mr. H. D. Jennings anc Carroll of Lynchburg. Eric Jennings of Lynchburg is spending this week in the home o! Mr. and Mrs. Gordon Tucker and attending Bible School at Central Church. Cheryl Nash of Lynchburg is staying with Dawn Kerr this week and attending Bible School at Central. Bible School is in progress at Central Baptist Church this week. Mr. Elliott Nash and Dawn Kerr attended the Bible School program at Union Hill Church Friday night. Mrs. Richard Nash and Mrs. Brenda Layne and Missy visited Mrs. Linda Howard and family on Tuesday night. Mrs. Henry Mann, Mrs. Carroll Mann, Robin and Stuart Mann visited Mrs. Elliott Nash and Dawn on Friday afternoon"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Rev. <mark>Crawford</mark> Williams of Louisana preached"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Rev. <mark>Crawford</mark> Williams of Louisana preached"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [846.0, 502.69, 989.03, 960.78], "bbox_id": "d238447cf5", "file": "AppomattoxNewspapers_1974-1975a_0264.pdf", "page": 1, "text": "Remember the Sabbath Day, to keep it holy. Exodus 20  8 . Mr. and Mrs. Charles Judy of Fincastle, came Thursday to spend rest of week with her father, Mr. J. 0. Davidson and uncle, Crawford Davidson. Friday Mrs. J. L. Harrison, Mr. Crawford Davidson and Mrs. Elsie Thornhill went to Lynchburg - Guggenheimer Nursing Home to visit Mrs. Annie Horsley. Her condition is about the same. Mr. and Mrs. Eugene Carson spent week end in Blacksburg with their son and his family. Saturday we at Hebron had our annual clean up day inside and outside Sunday, we really had a lovely sight outside. By noon we had a carpet of gold all over the yard. The dandelions were in full bloom. Rev. and Mrs. Moon came home from the hospital Mrs. Moon came home from the hospital Thursday. She is really doing fine thanks to God. Mrs. J. B. Ewers was at the hospital last Monday at 8 oclock to have the eye transplant. She has gotten along just fine and is coming home Tuesday of this week. We want to thank God and her fine doctors. Mrs. Eugene Cyrus came home Saturday from the hospital. Mr. and Mrs. Ben Wheeler, Ronnie Jones and Richard"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "0. Davidson and uncle, <mark>Crawford</mark> Davidson. Friday Mrs. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "0. Davidson and uncle, <mark>Crawford</mark> Davidson. Friday Mrs. J."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2012.12, 1048.31, 2347.36, 1437.11], "bbox_id": "83a28368f9", "file": "AppomattoxNewspapers_1926-1933a_0316.pdf", "page": 1, "text": "of Brookneal. Those playing were Misses B. V. Harwood, iliflabeth McDearmon, Stratton, Lucille OBrien, Kate OBrien, Elaine McDearmon, arle Patteson, Flora Lawson, Annie Jessalyn Hancock, Hazel and Virginia Reynolds, Ocie Jones, Becky Harvey, Helen and Estelle Dickerson, Marion and Elizabeth Wagner and I TENANT WANTED Josephine Smith, of North Car-want two men to work good olina Messrs. Harold Spencer, tobacco farm. Team and lm- Paul Drinkard, Ned Hancock, P eme -   .MF.NT. William Burke, J. Crawford t f Appomattox, Va, Davidson, Nathan Goin, Her bert Pulliam, J. C. Caldwell, Howlett Martin, R. W. Wilkips, J. C. Stanley, Reggie Stanley, Richard Lawson, Lewis Mc Dearmon, Eddie Coffman and J. Oscar Cole. High Score was won by Miss Josephine Smith and second, Miss Lucille OBrien. High score for men was won by J. Oscar Cole, second by Paul Drinkard. Consolation prize was awarded Mr. William Burke."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "and Virginia Reynolds, Ocie <mark>Jones</mark>, Becky Harvey, Helen and"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "and Virginia Reynolds, Ocie <mark>Jones</mark>, Becky Harvey, Helen and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2004.23, 1092.97, 2174.33, 1300.06], "bbox_id": "5bb1560573", "file": "AppomattoxNewspapers_1908-1909a_0316.pdf", "page": 1, "text": "OBrien, Elaine McDearmon, I Earle Patteson, Flora LawBon,  Annie Jessalyn Hancock, Hazel  land Virginia Reynolds, OcieJ Jones, Becky Harvey, Helen and Estelle Dickerson, Marion and .Elizabeth Wagner and josephine Smith, of North Car olina Messrs. Harold Spencer, Paul Drinkard, Ned Hancock, William Burke, J. Crawford Davidson, Nathan Goin, Her b e rt Pulliam, J. C. Caldwell, Howlett Martin, R. W. Wilkins, 4 j. e. Stanley, Reggie Stanley, Richard Lawson, Lewis Mc-"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "land Virginia Reynolds, OcieJ <mark>Jones</mark>, Becky Harvey, Helen and"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "land Virginia Reynolds, OcieJ <mark>Jones</mark>, Becky Harvey, Helen and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1664.83, 679.26, 1809.74, 970.3], "bbox_id": "ed241c9b3c", "file": "AppomattoxNewspapers_1974-1975a_0244.pdf", "page": 1, "text": "O Lord our Lord, how excellent is thy name in all the earth. Psalm 89 Mrs. C. T. Roach spent the week end with her father, Mr. Osborne Davidson and uncle, Crawford Davidson. So glad to report Mr. Bert Stratton came home Thursday from the hospital much improved. Mr. John Ewers went back to the doctor last week for a checkup. He is doing better. Mrs. Verna Herndon spent Friday at her home. Mrs. Annie Horsley is about the same and still at the Guggenheimer Home. Mr. and Mrs. I. B. Wheeler visited Mrs. Orman Jones last Monday at the home of her daughter, Mrs. Ann Carroll at Concord. klrv and Mrs. Bob Wheeler, were dinner guest  of Mr.v and Mrs. I. B. Wheeler Sunday1"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Osborne Davidson and uncle, <mark>Crawford</mark> Davidson. So glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Osborne Davidson and uncle, <mark>Crawford</mark> Davidson. So glad to"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [290.12, 637.88, 438.54, 1112.81], "bbox_id": "e2bfd6e240", "file": "TimesVirginian_1981a_0359.pdf", "page": 1, "text": "N. Y. Miss Catherine Anne Paulette-of York, Pa. Mrs. Gary Ramsey of Gladstone Mrs. Kirby Southall of Char- lottesville and Mrs. L. M. Thomas of Appomattox. The bridesmaids ware floor length Sleeveless gowns of burgundy giana. They carried baskets of pink and burgundy silk roses. Mr. John H. Goin was his sons, best .man. Ushers were Mr. Kenneth Goin and Mr. John H. Goin, Jr., both brothers of the groom, Mr. Baxter Parris and Mr. Donald N. Parris, both brothers of the bride, Mr. Todd Craft and Mr. David Hix, all of Appomattox. The flower girl was Miss Kristy Jones, niece of the groom, of Concord. She wore a floor length gown of white lace and carried a miniature basket of burgundy and pink silk roses, Ringbearer was Mark Nel son, of Portsmouth, cousin of the bride. Mrs. Roger Clark attended the guest book at the church. Following the ceremony, the brides parents entertained with a reception in the church fellowship TROT. Mrs. Wlflftnrf Chenault and Mrs. Abner Scruggs were in charge of the reception. Serving the wedding cake were Mrs. Crawford Davidson and Miss Jeanne Nash. Mrs. Bruce Eye and Mrs. Daniel Turner served punch. Coffee was served by Miss Kathy Johnson. After a southern wedding trip, the Couple will live at Spout Springs."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "girl was Miss Kristy <mark>Jones</mark>, niece of the groom,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "girl was Miss Kristy <mark>Jones</mark>, niece of the groom,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [588.68, 764.74, 735.3, 1212.02], "bbox_id": "d429c887f8", "file": "AppomattoxNewspapers_1974-1975a_0520.pdf", "page": 1, "text": "My Lord asked his servants, saying. Have ye a father, or a brother? Mrs. C. T. Roach spent Sunday with her father, Mr. J. 0. Davidson, and Uncle Crawford. They are both doing fine. We are so sorry about Mrs. Evie Burnett who was critically injured in an auto accident Friday. If it be the will of God we ask she be restored to health. Mr. and Mrs. Bruce Stratton were dinner guests of his parents, Mr. and Mrs. Marshall StrattonSunday 4  y  S  Mr. and Mrs. rfmWhejfelef visited Mr. and Mrs. Wallace BohdUrant Saturday night and enjoyed playing Rook. Mrs. Nina Caldwell and Mrs. Elsie Caldwell spent last Thursday with Mrs. Bob Harris, Will and Jack. Deer Season opened today and the road is full of cars and trucks. Have seen a few does run by. Mr. Richard Jones celebrated his birthday Monday. Mr. and Mrs. I. B. Wheeler had supper with him. He is a teenager now. Mr. and Mrs. J. P. Alvis, HI Ricky and Jennifer spent the week end at Fincastle with her mother. Mr. and Mrs. J. P. Alvis, Jr. and Mr. and Mrs. William Alvis and Brigett went to Orange to visit The Matthews."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "0. Davidson, and Uncle <mark>Crawford</mark>. They are both doing"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "0. Davidson, and Uncle <mark>Crawford</mark>. They are both doing"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [429.09, 249.96, 570.88, 572.19], "bbox_id": "5200337d38", "file": "TimesVirginian_1978_0037.pdf", "page": 1, "text": "Mrs. Cris Gallier is doing fine after a few days in hospital having tests made. Mr. Crawford Davidson is doing about the same. Mr. White Cuneo had the furnace to blow up in his face and got burned badly. He is in Lynchburg General4 Hospital. We pray that he will not have an injury to his eyes. Mr. and Mrs. Bob Wheeler of Richmond Mr. and Mrs. Ben Wheeler, Mr. and Mrs. H. B. Jones and Ronnie and Richard visited Mr. and Mrs. LB. Wheeler Sunday. Mrs. Mary Lucy Stratton has the flu. Sorry to report the critical condition of Miss Elva Strattoq and Mrs. Mary Gilliam both lived in Hebron neighborhood in early life. Mr. Hugh Bradford is about the same. Mrs. Dancy McCraw came home from Luray. Her dau ghter, Mrs. Jessie Judy is better."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "having tests made. Mr. <mark>Crawford</mark> Davidson is doing about"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "having tests made. Mr. <mark>Crawford</mark> Davidson is doing about"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [531.84, 823.27, 663.19, 874.52], "bbox_id": "34b86f7181", "file": "AppomattoxNewspapers_1971-1973a_0215.pdf", "page": 1, "text": "Mr. and Mrs. T nd Mr. Crawford Davidson vls- d Mrs. Annie Horsier at Lib- ty Nursing Home Sunday. Mrs. Harold Jones visited"}, "highlight": {"text": {"matched_tokens": ["Crawford", "Jones"], "snippet": "Mr. and Mrs. T nd Mr. <mark>Crawford</mark> Davidson vls- d Mrs. Annie Horsier at Lib- ty Nursing Home Sunday. Mrs. Harold <mark>Jones</mark> visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford", "Jones"], "snippet": "Mr. and Mrs. T nd Mr. <mark>Crawford</mark> Davidson vls- d Mrs. Annie Horsier at Lib- ty Nursing Home Sunday. Mrs. Harold <mark>Jones</mark> visited"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1356.95, 218.93, 1515.34, 1076.48], "bbox_id": "b07ee51ab0", "file": "TimesVirginian_1976_0325.pdf", "page": 1, "text": "Mr. and Mr. Robert Spencer  of Virginia Beach, Virginia and M r.  David M itchell from Bluefibld College spent the week-end with their parents Rev. and Mrs. Edgar Mitchell. Mr. and Mrs. Bruce Stratton were dinner guests on Sunday bf his parents Mr. and Mrs. Marshall Stratton. ! Mrs. J. P. Alvis 111 had her imqther from Fincastle and two sisters to spend the week-end with her.   Mrs. Hazel Gillispie had Mr. 1 and Mrs. I. B. Wheeler, Mr. and Mrs. Bill Roope, Sherry and Troy as supper guests on .Saturday night. What a good meal she had! Mr. and Mrs. Dallas GQlispie, Connie and Karen spent last week at Littleton, N. C. at the bbach. Mr. and M rs. W allace Bondurant and Richard went to see Mr. and Mrs. Ronnie McNulty at Chester, Virguna. Ronnie is home from the hospital doing much better no. Mrs. Elsie Caldwell and Mrs. Nina Caldwell visited Mrs. H. B. Jones Monday morning. Mrs. Katie Krantz, Mrs. Elsie Krantz, Mr. and Mrs. Harvey Thomas, Mr. and Mrs. Bob Wrley visited the Whee lers last week. Mr. and Mrs. Ben Wheeler, Mr. and Mrs. H. B. Jones, and Richard, Mrs. Mable Robert son, and Mrs. David Smith visited them on Sunday. Mr. and Mrs. Charles Judy spent the week-end with Mr. J. O. Davidson and Crawford Davidson. Mrs. Becky Shanks spent the week-end with M rs. John Farrar at Evergreen, Virginia. e 1 Mr. and Mrs. Jessie Judy of Luray spent the week-end with her parents Mr. and Mrs. Dancy McCraw. Mr. and Mrs. Jim Bondurant .attended the 60th wedding anniversary of her grand mother and grandfather, Mr. and Mrs. Campbell in Amherst County on Sunday. We wish them many more happy years a together. _ __  Mr. and Mrs. Sam Stratton of Mullens, W. Va. and their daughter and her husband, Kathy and Debbie, Mr. and Mrs. Jim Newland and three sons of Lynchburg spent the week-end with In i ind Mrs. Kelly Stratton u and lavid. Sunday those who visited in the same home were Mrs. Calvin  Tanner, Mr. Tommy Tanner, Mr. and Mrs. Melvin Stratton, Mr. and Mrs. Cariysle Scruggs, Mr. and Mrs. Lyle Thomas. Miss Kathy Tanner and Mr. David Blanks."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "visited Mrs. H. B. <mark>Jones</mark> Monday morning. Mrs. Katie"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "visited Mrs. H. B. <mark>Jones</mark> Monday morning. Mrs. Katie"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2115.36, 1299.33, 2283.88, 1718.84], "bbox_id": "f735c4f75f", "file": "AppomattoxNewspapers_1908-1909a_0548.pdf", "page": 1, "text": "Miss Anna Jones today sued a program for local U. D C. meetings, with subjects and leaders. They are as follows Decemberv-Cyrus Hall Mc Cormick. M. Anna Jones, leader. JanuaryGen.Robert E. Lee, military genius Stonewall Jackson, military strategist. Miss Louise Gills, leader. February-Gen. J. E. B. Stuart. Miss Nina E. Jones, 1 leader.--1   ..... MarchMathew Fontaine Maury. Mrs. Charles F. James, l6u6r AprilDr. Frank W. Gorry Mrs.. J. A. Burke, leader. MaySurgeons and Chap lins of the Confederacy. Mrs D. N. Twyman, leader. JuneJefferson Davis, gen ius in Statesmanship. Miss Eu la May Burke, leader. JulyDr. EphrainMcDow- ell. Mrs. W. L. Quid, leader. August-Edmund  Ruffin. Mrs. Lottie Bledsoe, leader. SeptemberDr. Crawford H. Song, Firt to use ether as an anethetic. Mrs. Morton Rosser, leadef. October  John Pelhann. Mrs.Emest Gills, leader. NovemberAdmirai Itaph- all Semmes.  Mrs. Mollie Law- son, leader. By request, the December meeting will be held a week"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Miss Anna <mark>Jones</mark> today sued a program"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Miss Anna <mark>Jones</mark> today sued a program"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.39, 659.29, 1724.5, 1207.11], "bbox_id": "2228868f45", "file": "TimesVirginian_1981a_0183.pdf", "page": 1, "text": "Megginson, niece of the bride, was flower girl. Jonathan K. Megginson, nephew of the bride was ring bearer. Mr. Butler was best man for his son, ushers were Joseph Robert Megginson, Jr., brother of the bride, Richmond Lewis Kirk Harris, cousin of the bride, Gladstone James Alexander Walden, Mechanicsville Sam uel Robert Barkley, Goochland and Matthew Joseph Simons, Hagerstown, Maryland. Following the ceremony, the parents of the bride entertain ed with a reception at the Falling River Country Club. Miss Ethelina Trent was Mistress of Ceremonies. Miss Rhonda Faye Morgan, cousin of the bride, was at the guest book. Hostesses were Mrs. George C. Franklin, Mrs. A. R. Harwood, Jr., Mrs. George K reidel Mrs. Charles R. Morgan, cousin of the bride, Mrs. Bernard W. Torrence, Mrs. Crawford W. Harris, aunts of the bride, and Mrs. James - A. Conner and Mrs. DOIiald W. Thornhill. The bride is a graduate of Appomattox County High School and Bob Jones Univer sity, Greenville, S. C., and did graduate work at VPISU, Blacksburg, Va. She is employ ed as the Fire Education Specialist for the County of Henrico, Division of Fire, Richmond, Virginia. Mr. Butler a graduate of Baltimore Polytechnic Insti tute, Baltimore, Md. and The University of Arkansas with a BS degree in Forestry Man- angement, is employed with the Virginia Divison of Forestry in Henrico County. After a wedding trip the couple will make their home in Highland Springs, Virginia."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Bernard W. Torrence, Mrs. <mark>Crawford</mark> W. Harris, aunts of"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Bernard W. Torrence, Mrs. <mark>Crawford</mark> W. Harris, aunts of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [792.48, 398.86, 1331.82, 514.41], "bbox_id": "a3cd589962", "file": "AppomattoxNewspapers_1962-1965a_0621.pdf", "page": 1, "text": "Marylon-going maintenances of t h e ! Donna! Chandler Sonata, Autumn camps. On the Ice at Sweet j Leaves, and Alley Cat, Lou- 2. What Cookies Are Sold? and Crawford, Margie ise Wheeler Little Child and The f i v e different kinds! Morris Nocturne, by Schu-1 Norwegian Concerto, B e t s y of cooUies from the Southern man, Martha Williams How  Jones Prelude, Patricia Fer-  _. , . guson Four Leaf Clover and Biscult Company, Richmond, Va. Moon River. Donna Hubbard The cookies sell for 45c a box. I v . . n  r nnrt Ierns anc Hello Dolly, Bill I Prelude, Valerie Paulette , The troop makes 6 c per box, the  Vicky Rogers, Keportei Stanley Pomp and Circunv Theme from The Apartment,  Council will make approximately! stance, Bill Dudley Theme Mary Hunter March, Tommy! 19c per box. from Romeo and Juliet, Karen I Terry. Approximately 210,400 boxes"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Cookies Are Sold? and <mark>Crawford</mark>, Margie ise Wheeler Little"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Cookies Are Sold? and <mark>Crawford</mark>, Margie ise Wheeler Little"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1066.76, 194.21, 1210.86, 909.53], "bbox_id": "dd6d4d5a29", "file": "AppomattoxNewspapers_1974-1975a_0211.pdf", "page": 1, "text": "m t . ZION b a p t is t c h u r c h The Tot Choir under the direction of Roberta Womack, pianist, and Isabell Patterson, manager, will sponsor a pro gram March 16, _at 6 oclock Stonewall Lord, behold, he whom thou lovest is sick.  I John 1113. When we awoke this morning the world was truly a lovely sick. Only God can do it. Mr. John Ewers is a patient in the Lynchburg hospital. The Rescue Squad took him Friday morning. Mrs. Annie Horsley is really showing improvement. Mr. and Mrs. Charles Judy spent the week end with Mr. and Mrs. J. 0. Davidson and Crawford Davidson. Mr. and Mrs. Irby King and children spent the day Sunday with Mr. and Mrs. Hatcher King. Mr. Marshall Stratton had a call from his wife who is visiting their daughter in California saying they have a baby boy. So may they have many happy days together. Mr. and Mrs. William Alvis of Lynchburg and daughter were visitors of his parents Sunday. Mrs. Ada Thompson is in Alexandria staying while with her son. Mr. and Mrs. H. B. Jones and family were dinner guest of Mr. and Mrs. I. B. Wheeler Sunday. Mr. and Mrs. Bob Worley came in the afternoon. Mr. and Mrs. I. B. Wheeler visited Mrs. Hazel Gillaspie Friday. Mr. and Mrs. Dallas Gillaspie and Mrs. Hazel Gillaspie went to Roanoke Sunday to visit sick relatives. Mrs. Tom Davidson visited Mr. and Mrs. Wallace Bondur- ant last Friday. Miss Joe Ellen Garrett had an operation last week came home Wednesday is doing fine She will be several weeks out of school. Mrs. John Ewers is staying whith her daughter, Mrs Wilson G arrett while Mr Ewers is in the hospital. Mr. and Mrs. I. B. Wheeler visited Mr. and Mrs. Ben Wheeler and Mrs. Mary Smith Saturday at Appomattox."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "J. 0. Davidson and <mark>Crawford</mark> Davidson. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "J. 0. Davidson and <mark>Crawford</mark> Davidson. Mr. and Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1052.4, 332.35, 1223.35, 1875.18], "bbox_id": "39d4a77996", "file": "AppomattoxNewspapers_1922-1923a_0043.pdf", "page": 1, "text": "Lynchburg.A fox terrier belonging to Mrs. Claude Thornhill in the past few days has killed sixty rats in the same hole. The dog got thirty-four at one time and twenty-six at another, and Mrs. Thornhill wonders if there is another such a record in Virginia. The terrier was set after the rats when they began to deplete a flock of chickens. Danville.Leonard Crawford, 8-year- old son of S. T. Crawford sustained a badly broken leg when he fell from a tree from which he was watching the baseball game from outside the fence. He was fully thirty feet from the ground when the branch he was sit ting on and which was decayed snapped. He was removed to the hos pital where the damaged leg was set. Harrisonburg.. The Rockingham National Bank, of Harrisonburg, was the successful bidder for the 150,000 issue of the city of Harrisonburg 5 per cent, bonds of twenty-year serial, according to an announcement made by city officials. The issue was re cently authorized by the City Council for extensive addition to the citys light and water system. Bids were re ceived from a number of the largest bonding houses in the country and the accepted bid was slightly above par. Charlottesville.Albert S. Bolling of the Albemarle bar, who officiated as toastmaster at a banquet given by the local American Legion posts, evoked cheers .by his violent attack upon local profiteers. Mentioning no names, he stated that every one pres ent knew of men who had accumu lated fortunes by remaining at home during the war, giving to war work mere pittances of what they made, and that whenever he saw one of these fnen he felt a great pride in the hum blest member of the American Legion Blackstone.With the conferring ot degrees on a class of 133 young men the largest in the history of the col lege, by President Burruss, the ad dress to the class of 1922 by Dr. W. E Dodd, an alumnus of the school, pro lessor of American history in the uni versity of Chicago, and author of The Life of Woodrow Wilson, the an nouncement of honors and signing of Auld Lang Syne, the commencement exercises and Golden Jubilee program at the Virginia Polytechnic Institute ended Wednesday at noon. Richmond.Stressing that unless there is immediate relief from ex cessive freight rates jobbing interests in Virginia cities would be crippled Colonel R. McC. Bullington, address ing the eighteenth annual session of the Richmond Association of Credit Men at the Westmoreland Club urged concerted action for a square deal. He expressed the opinion that these job- hers  are not getting fair treatment .from the .transportation interests, wbose rails run through Virginia, and declared for subscriptions to a fund which would be devoted to fighting the unjust, unfair and unreasonable rates of carriers. Richmond.Commissioners at large to investigate on the feasibility of es tablishing a separate school for deaf and blind were named by Governor E. Lee Trinkle. The commission consists of Dr. Mary E. Brydon, of the State Board of Health, and Professor Chas- G. Maphis, of the University of Vir ginia, and two members of Ihe House and two of the Senate. The report will be submitted to the next General Assembly. The Governor named the commission for the blind as follows! R. J. Taylor, Staunton W. L. Hop kins, Richmond Miss Elizabeth Pidgeon, University of Virginia Sam uel H. Miller, Lynchburg, and E. Sum ter Smith, Lynchburg. New Canton.After the lapse of five weeks since the severe frosts of April, it has been ascertained, after careful examination of many orchards in this section, that the damage done to all kinds of fruit exceeded the first cal culations. Commercially, the apple crop is practically a failure. Locally, the delicious apples seem to have escaped with the least damage, while winesaps suffered a heavy loss. The Boatwright Orchards at Gold Hill suf fered less than any orchard in this section, owing to its high location. The crop there will possibly exceed 3t per cent. The orchards of A. L. Pitts, at Arvonia, and of Plummer F. Jones, in New Canton, contain about 10 per cent. of a crop. Blacksburg.Twelve hundred and thirty-two out of the 1,647 enrolled alumni of Virginia Polytechnic Insti tute were present and participated in the alumni day program of the golden jubilee celebration. Headed by Dr. Lawrence Priddy, of New York, presi dent of the General Alumni Assocla tion, the alumni from 1872 to 1921 in seventeen minutes subscribed 72,742 towards a 100,000 fund for the erec tion of a war memorial hall, which will be designed to house the various organizations and societies of the in stitut 9 n, providing dancing halls, re- ceptkm rooms and more than forty roomskfor reStal purposes to those taking post-graduate courses. Richmond.Decrease in rents in the early fall is freely predicted by real estate men here as a result of the immense number of dwellings now uu der construction. The increase in homes has become noticeable through the .for rent signs now appearing through the city. Ths.t the average drop will approximate 10 per cent, is the opinion of the rental agents. A survey of the situation indicates that there will be considerable moving on September 1, when new leases for the year become operative. Danville.Rev. SiB. Williams, .of the Danville Methodist circuit raided an illicit still Sunday near Wbitmell The minister, who had arisen early saw blue smoke curling up from some woods and attracted by it he made his way cautiously and came across fifty-gallon copper outfit running full blast. No one was there when he ar rived. The minister notified a gronj of officers in that neighborhood and led them to the spot where the still was cut up and some of its parts were brought to Danville by the minister"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "flock of chickens. Danville.Leonard <mark>Crawford</mark>, 8-year- old son of"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "flock of chickens. Danville.Leonard <mark>Crawford</mark>, 8-year- old son of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2123.99, 1354.54, 2287.31, 1648.28], "bbox_id": "b8ac01c541", "file": "AppomattoxNewspapers_1926-1933a_0548.pdf", "page": 1, "text": "leaders. They are as follows December-v-Cyrus Hall Mc Cormick. M. Anna Jones, led6r. JanuaryGen. Robert E. Lee. military genius Stonewall Jackson, military strategist. Miss Louise Gills, leader. FebruaryGen. J. E. B. Stuart. Miss Nina E. Jones, leader. March-Mathew Fontaine Maury. Mrs. Charles F. James, leader. AprilDr. Frank W. Gorry Mrs. J. A. Burke, leader. MaySurgeons and Chap lins of the Confederacy. Mrs. D. N. Twyman, leader. JuneJefferson Davis, gen ius in Statesmanship. Miss Eu la May Burke, leader. JulyDr. EphrainMcDow- ell. Mrs. W. L. Ould, leader. AugustEdmund Ruffin. Mrs. Lottie Bledsoe, leader. SeptemberDr. Crawford H. Song, First to use ether as"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Mc Cormick. M. Anna <mark>Jones</mark>, led6r. JanuaryGen. Robert E."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Mc Cormick. M. Anna <mark>Jones</mark>, led6r. JanuaryGen. Robert E."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [416.21, 446.6, 561.28, 912.87], "bbox_id": "174b26ee22", "file": "TimesVirginian_1976_0012.pdf", "page": 1, "text": "guests of Mr. and Mrs. Ben Wheeled and Mrs. Mary Smith Sunday. It was a grand birthday dinner for Irby and Ben. Mrs. Susie Krantz had as her dinner guests her mother and father, Mr. and Mrs. Taylor of Lynchburg They came to Hebron to see Connie Krantz be baptized. Mr. and Mrs. Stuart Barrell of Culpeper, Va., spent the week end with Mr. Osborne and Crawford Davidson. Mrs. Becky Shanks spent the week end with her daughter at Evergreen. Mr. and Mrs. Jim Robertson and Mrs. David Smith visited Mrs. Minnie Burnette last week. Mr! and Mrs. Dallas Gallis- pie, Connie Karen, spent a few days man Greensville, S.C. and Mrs. Hazel Gallespie came home with them Saturday, Mr. Richard Jones spent the week end with Mr. and Mrs. I. B. Wheeler, Mrs. H. B. Jones came for him Sunday niglit. Now school hak started, lets . study hard and make every day count for each one. Mrs. Connie Garrett took her mother, Mrs. John Ewers to Richmond Tuesday to a doctor about her eye. OFFICE SUPPLIES Have you seen our line of office supplies? If we dont have it, we can get it! Times-Virginian, Phone 352-8215 - Appomattox. 1-8-tf"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "with Mr. Osborne and <mark>Crawford</mark> Davidson. Mrs. Becky Shanks"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "with Mr. Osborne and <mark>Crawford</mark> Davidson. Mrs. Becky Shanks"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2357.74, 402.13, 2532.74, 632.98], "bbox_id": "b8ede991f1", "file": "AppomattoxNewspapers_1939-1943a_0188.pdf", "page": 1, "text": "Funeral services for Mrs. Sarah Elizabeth Neighbours were held from he Fl one wall Presbyterian church Sunday afternoon, by the Rev, R, E. Redding and the Rev. George D, Heaton, of Lynchburg. Burial was in the church cemetery. Honorary pallbearers were W. S , iTaiylor, S . E . Anderson, John Alvis, Eddie Carson, Crawford Davidson, R. L. Burke, Charles Goolsby, Bill Stearns, D r. Clyde OBrien and Ben Munsey. Active pallbearers were Eugene Rosser, Clayton Rossier, Wilson Neighbours, Lyle Carroll, Claude Neighbours, Bennie Neighbours and Russell Carroll. ! Flower bearers were Mi Elsie Neighbours, Mrs. Charles Goolsby, Miss Elizabeth Drinkard, Miss Trula Drinkard, Mrs. Ruth Bailey, Mi Frances Neighbours, Mi Christine Neighbours, Mrs. Davis Jones, Mrs. Ben Munsey, Mrs. Bill Stearns."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "John Alvis, Eddie Carson, <mark>Crawford</mark> Davidson, R. L. Burke,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "John Alvis, Eddie Carson, <mark>Crawford</mark> Davidson, R. L. Burke,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [728.64, 861.34, 2395.47, 1304.52], "bbox_id": "b7bad005ee", "file": "AppomattoxNewspapers_1960-1962b_0028.pdf", "page": 1, "text": "FROZEN FOOD Sparc Tim Beef Pot Pi 1 Spare. Tim Chicken Pi Spare Time Turkey Pie 2 for . WILKES JEWELS V Guaranteed by Good Housekeepii BROOKNEAL, VA. DRake 63775 APPOMATTOX, VIRGINIA FRESH MADE ORANGE DRINK GRAPE DRINK PUNCH DRINK Rainbow Tints A Party Cake underlying sensory j Some relief from pain is I auuuuiajr x . noticed if the breathing motion is I Mrs. Richard Nashs niece is less pornoumced. The decrease in I spending some time with her- motion can. be brought bout by I , ___  p applying a cravat bandage around I We are sorry to hear that he chest and. Mrs. Crawford Williams ohild tne cne,- has scarlet fever. Mrs. Williams is The cravat bandage should be the former Gaynell Irby. .? t  r a r y , however It can   0 I be used during transportation to a I Miss Elizabeth Robertson, Mrs. I medical facility. If the trip to a Mary Doss, Miss Ruiby Ring, and I doctor is a long one, remove the! Mrs. Noble, nurses from Lynchburg, bandage if the patient- experiences j all visited Mrs. James Waller Tues- j any discomfort from the bandage, j day P. M. We are glad that Mtrs.1 jm, fractures are caused most! Waller is improving, from, the rej often by direct blows and  falls. I suits of a car wreck. I fh e outward evidence may be I Mr. and Mrs, Len Love r i s i t e d U i g h t u s u a l l y with very little Mr. John Love recently. swflhnS or. deformity. The isual I indication  is no more than a ten-1 Mr. and Mrs. Lacy Lee, of Lynch-1derspot at one small point, and! t h e home of Vemiel pain at this point upon breathing. I If there is no pain, it will not be I necessary to bandage unless there I is a wound. If pain is  present J apply a cravat around the lower! Mr. and Mrs., Veriue Jones spoilt I Irt of the chest. Adjust tightness Sunday afternoon with . Mr. and according to the rekef of pain nec- Mrs. Edward Harris, near Phenix. .    U discomfort is increased by _"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "he chest and. Mrs. <mark>Crawford</mark> Williams ohild tne cne,-"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "he chest and. Mrs. <mark>Crawford</mark> Williams ohild tne cne,-"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2007.05, 210.2, 2151.28, 476.04], "bbox_id": "4e66ead9ea", "file": "TimesVirginian_1978_0022.pdf", "page": 1, "text": "For whosoever shall call upon the name of the Lord shall be saved. Romans 1013 Rev. and Mrs. Edgar Mitchell are both very sick with the flu. The Bill Roope family has flu. There were 74 at Hebron Sunday morning. A nice crowd for such a bad day. Mrs. Bert Stratton had flu over the week end. Mr. and Mrs. Ben Wheeler, and Ronnie Jones visited Mr. and Mrs. I. B. Wheeler Sunday. Mr. Hugh Braford is ill at McGuire Hospital. Mrs. Brad ford spent the day with him Saturday. Mrs. Wilton Routon is doing fine. Mr. Crawford and Mr. Osborne Davidson are both on the sick list. Everybody stay home and keep warm is my best advice."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Ben Wheeler, and Ronnie <mark>Jones</mark> visited Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Ben Wheeler, and Ronnie <mark>Jones</mark> visited Mr. and Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1562.14, 544.64, 1700.74, 1019.91], "bbox_id": "120c320eb6", "file": "AppomattoxNewspapers_1974-1975a_0171.pdf", "page": 1, "text": "For what shaU it profit a man, if he shaU gain the whole world, and lose his own soul  Mark 836 So very glad to report Mr. Hugh Braford will be coming home this week end if he continues to improve. Mr. and Mrs. Eugene Carson went to Richmond Thursday and visited Mr. Hugh Braford in McGuire Hospital. Mrs. Annie Horsley is im proving at Guggenheimer Nursing Home. Mr. Crawford Davidson and Mrs. Tom David son visited her several days last week. Mrs. C. T. Roach spent Saturday night with her father, Mr. J. 0. Davidson, due to bad weather. She went home every Sunday morning. Sunday was a real winter day, but we had the usual crowd at Hebron at Hebron Sunday. There were 104 present at Sunday School. Mrs. Hugh Braford spent the week end with her husband at McGuire Hospital, Richmond, Va. Miss Connie Krantz spent the week end with Miss Jeanie McGinnis in Rainbow Forest, Lynchburg. Mr. and Mrs. Richard Krantz went for her Sunday afternoon. Mr. Richard Jones spent Saturday night with Mr. and Mrs Hi. B. Wheeler Mri and Mrs. H. B. Jones visited them Sunday afternoon.  Mr. and Mrs. Wilbourn Moon visited Mr. and Mrs. I. B. Wheeler Monday."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Guggenheimer Nursing Home. Mr. <mark>Crawford</mark> Davidson and Mrs. Tom"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Guggenheimer Nursing Home. Mr. <mark>Crawford</mark> Davidson and Mrs. Tom"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2053.44, 1364.36, 2212.78, 1696.42], "bbox_id": "8ce8bcce30", "file": "AppomattoxNewspapers_1892-1898a_0039.pdf", "page": 1, "text": "Drawn Yesterday to Serve at the Com lug Term of the TJ. S. Courte. The following is a list of grand and petit jurors drawn by Jury Commission er Brown yesterday, to serve a t the next term of the United States District and Circuit Courts, Whloh convene in A is city on Tuesday, Maroh 4th  tS GRAND JUBY AlbemarleT. E. Etherton, O. F. Phil lips, Wm. N. Brown. AmherstW. H. Kent, Jams F. Wil liams. AppomattoxFrank B. Jones. BedfordW. H. Moseley, Wm. T. Nosl, E. W. Luck. BotetourtC. T. Hazlswood. BuckinghamJohn Cobb, J. H. Noble. CampbellWm. C. Hawkins, Frank Williams, A. L. Kelley, James M. Harris. CumberlandWesly Goodman. FloydGiles M. Whitlow. FluvannaJohn W. Howard. NelsonS. C. Payne, C. R. Hill. RoanokeJ. H. w ard, J. D. Kefauver. PETIT JTTBY. N. G. Oohrltoh, 8 . B. Barnett, N. P. Shumate. AmherstBenjamin F. Rogers, Joseph Massie.  AppomattoxJohn H. Robertson. BedfordB. L. Burks, Louis Riley, J. R. Mette. BotetourtE. L. Simpson, B. L. Sizer. BuckinghamSamuel A. Spencer. CampbellThos. A. Jeonings, A rthur Connell, E. L. Bell. Thomas A. Averett. CraigAlexandria Crawford. CumberlandJ. W. Adams. FloydJames J. Thompson, Noah D. Cole. FluvannaWm. Nicholson. NelsonW. S. Loving. RoanokeWilliam Lffid, C. F. Read. -"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Wil liams. AppomattoxFrank B. <mark>Jones</mark>. BedfordW. H. Moseley, Wm."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Wil liams. AppomattoxFrank B. <mark>Jones</mark>. BedfordW. H. Moseley, Wm."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1725.09, 288.57, 1868.46, 709.21], "bbox_id": "20b1b9a06b", "file": "AppomattoxNewspapers_1974-1975a_0109.pdf", "page": 1, "text": "Davidson, Mrs. Horsley and Mr. Crawford The sick are as Davidson usual. Mr. and Mrs. John Harrison were visitors in Appomattox last Friday. It was the first time John had been away from home for two months. Hope he may be better and enjoy the coming holidays. We wish to extend our sympathy to the family of Mrs. Rosa Morrell who was buried at Hebron Friday. So thankful she had such a long life. Mr. and Mrs. I. B. Wheeler visited Mrs. J. F. Alvis and Mrs. Russel Cawthorne last Wednesday in Lynchburg. Mrs. H. B. Jones, Kathy and Richard visited Mr. and Mrs. I. B. Wheeler Sunday. Mrs. John Ewers went back to Richmond to a doctor Friday and she is doing fine will not go again until January. Rev, Dennis E. Moore visited The Wheelers last week always glad to have him come.He spreads sunshine wherever he goes. Mr. Tommy Davidson is doing fine. He is at the home of his sister, Mr. and Mrs. Davis Smith, in Lynchburg. We had a big crowd out at church yesterday and Mr. Moore preached a grand ser mon."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "Mrs. Horsley and Mr. <mark>Crawford</mark> The sick are as"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "Mrs. Horsley and Mr. <mark>Crawford</mark> The sick are as"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [434.57, 735.13, 585.12, 927.52], "bbox_id": "1eab77a427", "file": "AppomattoxNewspapers_1962-1965a_0500.pdf", "page": 1, "text": "Concord Parent-Teacher As sociation held Its first meeting of the 1964-65 term on Sept. 24, with Oliver Jones, president, presiding. The PTA membership drive I will continue until Oct. 31, with cash awards given to rooms that  enlist the greater number. Room count awards went to room 1-A, Mrs. Marie J. Ross, teacher and room 4-A, Mrs. Stella Crawford, teacher. S. W. Inge gave a brief talk on Concord Boy Scout work and encouraged the continuation and promotion in the Scout work. Freddie Keesee, principal of the school, Introduced the faculty members."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Sept. 24, with Oliver <mark>Jones</mark>, president, presiding. The PTA"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Sept. 24, with Oliver <mark>Jones</mark>, president, presiding. The PTA"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2283.78, 1013.04, 2413.6, 1783.58], "bbox_id": "a5c4e075c6", "file": "AppomattoxNewspapers_1943-1947a_0229.pdf", "page": 1, "text": "Chas. T. Moses, Jr. H. Webster Babcock Leslie K. Coleman Malcolm Drinkard Raph Coleman Kenneth Coleman Russel Martin Lincoln Martin Richard D. Inge Berkley Garrett Norman H. Jones Lincoln Martin John Harvey Lathan Harvey John Lawson Wooldridge Edward L. Almond Emory Martin Claude Martin Hunters A. Hughey Harry McCormick Vincent Collins Herman Harvey John Lawson Wooldridge Ttfry Rogers Richard Roberts Jack Baker H. B. Cralle, Jr. Jimmy Harvey Henry Harvey Ryland Stymies i Randolph Evans T. fP. Evans, Jr. James E. Cheatham Herman Harvey Edwin Paulette Fred Cawithorne  James H. Garrett John Staton G. B. Wood Bolden McCormick Jamjrs Spiggle Herbert Martin Newton Jennings Herman Harvey Herbert Jamerson Charlie Carter Edwin Carter John C. Harvey Lathan Harvey Billy Reynolds Ray Ferguson V Elkin Hamilton Allen Torrence Joe Pauiett Kermit Pauiett Nelson Garrett Ryland Staples El-aster Hawthorn Crawford Davidsoi Charles Leslie Goin Franklin Gibson Albert L. Orr John Lawson Wooldridge Elwood Parsley Edward Almond Rober A. Sears Burke Paulette Berkley Garrett 4 Kenneth Farrar Joseph L. OBrien James K. Lowe Carl Whitney T Gilbert MayiT Jimmy Johnson Kelly Young Frank IT. Cawthorne, Jr, Kelly Young Frank T. Cawthorne, Jr. W. T. Harvey Henry Harvey Bob Wheeler Morris Gordon"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Berkley Garrett Norman H. <mark>Jones</mark> Lincoln Martin John Harvey"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Berkley Garrett Norman H. <mark>Jones</mark> Lincoln Martin John Harvey"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [556.29, 231.48, 708.7, 746.21], "bbox_id": "d2ab1c308f", "file": "TimesVirginian_1976_0159.pdf", "page": 1, "text": "Call upon me in the day of trouble, and I will deliver thee. Psalm 5015  I Mr, and Mrs. William Alvis and Brigett were dinner guests of Mr- nd Mrs. J. P. Alvis Jr. on Sunday. - Mr. Bob Wheeler of Richmond was supper guest Of Mr. and Mrs. I. B. Wheeler on Tuesday, night.  Sunday Mr. and Mrs. H. B. Jones, Kathy,  and Richard, Mrs. Thelma Webb, and Misa Mamie Cullop visited Mr. and Mrs. IB. Wheeler. Rev. Wayne Lenham will fill the pulpit each Sunday in May at Hebron Church. Mr. and Mrs. Eugene Carson visited her Sister at Pamplin Sunday afternoon. Master Will and Jack Harris are spending time with Mrs, Nina Caldwell their mother had her wisdon teeth extracted on Monday. Mrs. Wallace Bondurant and. Mrs. Virginia Davidson visited Mr. and Mrs. Lyle Thomas Sunday. They are both better now.  J. - Mr. and Mr. Jessie Judy of Luray spent week-end with Mr. and Mrs. Dancy McCraw and visited Mr. Osborne and Crawford Davidson.  Mr. Tom D avidson, M rs. Wallace Bondurant visited M rs.r Ruby Oakes in the Lynchburg General Hospital Sunday after noon. She is doing fine now, I am so glad to report. Mrs. John Ewers daughter Mrs. Wilson Garrett, took her mother to Richmond Tuesday. Do hope she will be getting better soon. She has had the"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark>, Kathy,  and Richard, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "and Mrs. H. B. <mark>Jones</mark>, Kathy,  and Richard, Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1614.48, 1101.75, 1780.42, 1751.75], "bbox_id": "fc32a48962", "file": "AppomattoxNewspapers_1892-1898a_0313.pdf", "page": 1, "text": "Applause. Without going further into the report I will say that we have unanimously selected the Hon. John M. Thurston, of Ne braska. as permanent chairman. Loud and prolonged applause  The following were unanimously chosen as permanent officers to the National Republi can Convention, subject to the ratification ot that body PresidentHon. John M. Thurston, of Ne braska. Vice-PresidentsJohn W. Jones, of Ala bama M. W. Gibbs, of Arkansas U. 8 . Grant, of California A. M. Stevenson, of Colorado John J. Hutchinson, of Kentucky L W. Livingstone, of Colorado A. J. Ricker, of Georgia B. F. Polk, of Iudlana M. M. Monroe, of Kansas E. C. Burleigh, of Maine Curtis Guild, Jr., of Massachusetts Charles F. Hendrix of Minnesota Thomas C. Mar shall, of Nevada Franklin Murphy, of New Jersey J. W. Fortune, of North Carolina Frank Reeder, of Pennsylvania Robert 8 malls, of South Carolina Zacarlah Taylor,  of Tennessee W. S. McCormick, of Utah John Anker, ot Vlrgtna J. W. Crawford, of West Virginia Otto Kramer, of Wyoming T. B. Burns, of New Mexteo Joseph W. Fifer, of Illinois L. B. Wilson, of Iowa W. G. Hunter, of Kentucky Wm. T. Malster, of Maryland Wm. McPherson, of Wisconsin Nathan Frank, ot Missouri Thomas P. Ken- nard, of Nebraska John A 8 palding, of New Hampshire John T. Mott, of New York J. W. Devine, of North Dakota David Mels- ner, of South Dakota E. C. Smith, of Ver mont Albert Goldman, of Washington! James H. Stout, of Wisconsin John M. Fair, of Arizona John I. Dill, of Oklahoma. SecretaryCol. Charles W. Johnson, of Minnesota. Assistant SscrotaclesW. E. Riley, of Kontucky IL H. Smith, of Michi gan A. H. Humphrey, of New York A. W. Manlor, of Maryland. Official StenographerFrancis E. Burke, of Pittsburg. I Segeant-at-ArmsTimothy E Byrnes, of I Minnesota. Assistants to the Sergeant-at- I ArmsOeorge W. Wlswell, of Wisconsin W. , W. Johnson, of Maryland W. P. Iluxford, of j Washington Charles E. Stone, of Illinois G. I D. Smith, of Oklahomn. Reading ClerksJ. n . Stone, of Michigan F. H. Wilson, of Missouri John R. Mailer, of I Ohio R. S. Hatch, of Indiana J. R. Beau, of ! New Jersey. Also, one vice-president from  each State. I The Chairman.The Chair appoints Senator Wm. J. Sewell, of New Jersey, and j Representative Sereno F. Payne, of Now  fork, as a committee to escort the perma-  cent chairman to the chair.  The committee then escorted Senator ! Thurston to tbe chair amid a torrent of ap- plausu and cbww I The Chairman .1 Gentlemen of the con-  volition , I have tbe honor to present to you nt chairman Senator John M. Thurston, of Nebraska. imirraan came forward rted by the committee the convention"}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "Ne braska. Vice-PresidentsJohn W. <mark>Jones</mark>, of Ala bama M."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "Ne braska. Vice-PresidentsJohn W. <mark>Jones</mark>, of Ala bama M."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2413.87, 213.73, 2558.36, 703.51], "bbox_id": "6f5e89e945", "file": "TimesVirginian_1978_0058.pdf", "page": 1, "text": "And we know that all things work together for good to them that love God. Romans 828 Mr. Hugh Braford went bade to McGuire H ospital last Wednesday. We hope he will soon be better. Mr. Hugh Bradfords mother and brother, from Natural Bridge, visited him last Tuesday. Mr. Jimmy Braford spent last week in Pennsylvania on a business trip. Mrs. Braford and Amy spent the week with her mother. Mr. and Mrs. Cris Gallier moved to their apartm ent Saturday. Good luck to a fine young couple. Mr. Osborn and Crawford Davidson are about the same. All the sick are able to be back at church Sunday, but said they were still so very weak. Mrs. Hop Elliott has been home since last Tuesday with bronchitis. Mr. and Mrs. Ben Wheeler, Mrs. Berta Jones and Richard visited Mr. and Mrs. I. B. Wheeler Sunday. Mrs. Walter Firkin and Mrs. Brooks of Lynchburg, visited Mrs. Juanita Ewers last week and took her out for lunch. Mrs. Hugh Tanner and Mr. Tommy Tanner spent Saturday in Roanoke, Va. Mrs. Maude Braford and Mrs. Clara Staton werfe in Roanoke several days attend ing a meeting last week. Mrs. Braford spent Saturday with her husband at McGuire Hospital."}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "couple. Mr. Osborn and <mark>Crawford</mark> Davidson are about the"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "couple. Mr. Osborn and <mark>Crawford</mark> Davidson are about the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.53, 267.4, 1773.18, 1764.4], "bbox_id": "d1f7f47b98", "file": "AppomattoxNewspapers_1902-1905a_0454.pdf", "page": 1, "text": "acres, exchange. C. E. Lewis to,Nel8on Bocock 53 acres, exchange and 117. C. H. iSarkill, comr to Crawford H. Going, 280 acres, 240. R. B. Cralle c.. trustees to Farm ville Bldg.  Tr. Co., 26 acres, 125. Reuben Brown to J. B. Shearer, 12 acres, 250. E. W. Gilliam, c. to H. E. Gil liam, 319 acres, 10Q0. J W. Flood c. to T. B. Scruggs, 54 acres, 126. T. B. Scruggs to W. D. Sandidge, 202 acies, 600. W. J . Martin to T. W. Oder And Robt. Irvey, 3 acres, 135. Altert Thornhills Heirs to Thos. Chambers, 158 acres 400. Madison Cyrus to O. S. Cyrus, 101 acres, 400. Madison Cyrus to S. A. Cyrus. 50 acres, 500. Madison Cyrus to D. H. Cyrus, 50 acres, 500. J. M. Dnrphey to 8. E. J. Bur- ford, lot 11-16, 1625. Wm. W. Wright to Elizabeth S. Wright, 57 acres, 100. Annie H. Bocock to Ellen Morgan, 100 acres. 500. M. P. See c. to Flood and Fer guson 805 acre-, 800. Emeline Cheatham c. to T. S. Ferguson, 6 acres, 15. Etna Iron  M. Co. to E. M. Schaefer 115 acres, 2500. Wm. A. Miller to E. C. Marshall, 319 acres, 747.23. J. H. Robertson to Henry Jack- son, 5 acres, 150. J. M. Abbott to Henry Jackson, 5 acres, 1500. C. Wiley Tucker to E. E. Chism, 2 acres, 135. Jos. R. Abbitt to Obey Mann, 100 acres, 200. Robert Meadows to Marion Mose ley, 30 acres, 91.20. C. P. Marshall to C. H. See, 31 acres, 120. R. C. Maun to Z. N. Harris, 8 acres, 175. Saml Worley to Mary D. Worley, 11 acres. . aunders F. Wright to Fannie B. Wooldridge, 120 acres, 500. W. Q. Ligon to H. Ai. Marshall, 19 acres,1200. R. H. Purdum to Joel T. Caw- thorn, trustee for Liberty Church 3 acres, 93. Juo. W. Fvans to J. Hudson Cheatham, 11 acres, 200. Samuel A. Glover, c. to Thos. W. Moses, 4 acres, 40. J. R. Caldwell to Chas. Glover, 100 acres 280. F. C. Moon Comr to Eugene M. McCormick, 40 acres, 250. Farmers Exchauge to C. W. and C. A. Hancock, store and lot 2000. Nina E. Jones to J. C. Jones, 277 acres, 3000. J. C. Jones to Jno. Wilson Dur- rum, 277 3000. W. A. Durrum to Ann R, Dur- rum, 17 acres 207. W. E. Moo e to Peyton Vf. Calla- ham, 81J acres, 170. A. B. Scruggs to T. E. Fwen, 100 acres, 400. Sallie M. Featherson to H. R. Feathe stou, 305 acres, 1500. T. E. Oweus to L. S. and T. . Do s, 30 acres, 200 Lucv F. Caris to Jane E. Coleman, 75 acres, 375. Mattie W. Harvey to Ja-e E Coleman, 106 to 250.  - Jno. S. Davis to Jas. D. McDear- man Va a lot, 75. N. ii Featherston to Monroe L. Garrett, 201 acres, 900. J. A. Cheatham to School trustee South3ide and Court House,  acre, 37. H. F. Venable to School trustee Southside, 1 acre, 3. R. S. Burke to R. F. Burke acre iots, 595. Thos. H. Paris, trustee to Hun er M. Moore, 167 acres, 1400. C. S Morton, to S. W. Thornton 5 acres, 35. Flora E. and L, D. Th rntoir to S. W. Thorn cn, 39 acres aud 2 lots, Saml H. Gordou to W. Scott Thomas, 25 acres, 90. M. S. Davidson to D. T. Wool dridge, 50 acres, 350. T. W. Moses to D. T. Wooldridge 25 acres, 250 B. W. Bocock Comr io H. D. Johnson, lOaces, 78. Wm. Patteson to H. D. Johnson, 29 acres, 60. Jno. L. Davis and wife to W. E, Wooldridge c. 20 acres. Jno. L. Davis to Wesley Chapel Lruste l i acres, gift. A. B. Hoarman to J. W. Nash Jno. R. Phelps Heirs to 8. E and W. A. Wills, 50 acres, 100. A. A. White to Clifford Beck, 10 acres. 180. G. A. J. Pennell to Geo. W, Thomas, 19 acres, 200 G. W. W, Thomas to Oueida Lhomas 19 acres. Signora P. Fore to M. E. Agee 163 acres. S. S. and Elma Coleman c. to H. W. McKinney,  lot, 1200. J. R. Horsley Comr to Eliza Wright, 5 acres, 100.  E P. Evans Est. to N.  W. Ry. Co. 365-1000 acres, 260. A nna Staples Est. to N.  W. Ry. Co. 283-1000 acre, 100. B. W. Bocock Comr to D. M. Anderson 24 acres, 72. E. M. Schaefer to W. B. Sampso n 104 acres, 5. C. W. Hunter, Jr. trustee to N.  W. Ry. 17-100 acre, 15. N. C. Manson, Jr. Comr to Jos. O OBrien, 260 acres. 5455. John Reid to N.  W. R. R. Co. lot 1 acre, 400. C. W. Hunter to Sallie McKinnev"}, "highlight": {"text": {"matched_tokens": ["Crawford"], "snippet": "H. iSarkill, comr to <mark>Crawford</mark> H. Going, 280 acres,"}}, "highlights": [{"field": "text", "matched_tokens": ["Crawford"], "snippet": "H. iSarkill, comr to <mark>Crawford</mark> H. Going, 280 acres,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1096.54, 297.76, 1256.64, 1231.26], "bbox_id": "77f0d434ca", "file": "AppomattoxNewspapers_1922-1923a_0131.pdf", "page": 1, "text": "A VISIT to the United States Naval academy, at Annapolis, Md., will almost certainly Include at least a mo ments pause before the magnificent crypt where lies what are supposed to be the remains of the first and one of the greatest of Americas naval heroesJohn Paul Jqnes. But an ex amination of the facts Ir the case will show that there is as mnch doubt as to whether this Is really the body of the American commander as there Is abont the true identity of this person age, whose career  om birth to death Is one of the unsolved riddles of the Revolutionary war. In the first place, Jones was not the real name of this hero, but one adopted by him in later years. He was born with the name John Paul and there Is much doubt as to whether he was the true or the adopted son of the Scotch gardener In whose cottage he spent the first 12 years of his life. Crawford, author of The Sailor Whom England F6a red and one of the leading authorities on the life of John Paul Jones, admits that mystery sur rounded his origin with an Impenetra ble veil and that he encountered great difficulties In his efforts to sift the false from the true, the legend from the facta The generally accepted story Is that John Paul was born In the little village of Arbigland and that his father was . poor man, half gardener and half fisherman, while his mother was o f pure Highland stock. But Crawford expresses more than a doubt that the Pauls were really the boys parents, but has been unable to delve further into the mystery, John Pauls brother was adopted by a Virginia planter by the name of Jones and, when this planter died he left his estate to bis adopted son upon condition that he take the same name. The brother, in turn, died shortly after ward, willing the property to John Paul upon the same condition. Thus John Paul- became John Paul Jones, the name by which be Is known and revered. When, after his memorable naval exploits, John Paul Jones finally died in France his death was practically unnoticed in America and the only record of the place of his burial was that left by a friend, for use, as he said, If America should ever wish to perform her duty to the one to whom she owed the most. Whether this memorandum of the grave was correct is a matter which caused much discussion about a cen tury afterward when Gen. Horace Por ter, American ambassador to France, discovered after a long search what was alleged to Le the body of John Paul Jones, exceptionally well pre served in a leaden casket filled with alcohol. The measurements of the body compared exactly with those in the possession of the Navy department at Washington, but the total absence of other distinguishing marks raised a doubt as to the real identity of the bodythough United States officials agreed to treat It as If ft were the real remains of-the naval hero. A squadron was sent to France to escort the body home and France paid great official honor to the man who, a century before, had fought with dis- tiuctlon under many flags. When the casket finally reached the United States it -was received with much pomp and ceremony and conducted to the cradle of the American navy at Annapoliswhere It remained In ob scurity under a flight of steps for many months awaiting the completion of its final resting place. Butthere Is doubt In the minds of many as to whether this is actually the body of the famous commander of the Bon Homme Richard, just as there will always be a mystery sur rounding the actual identity of the man who commenced life as John Paul, the son of a Scotch gardener."}, "highlight": {"text": {"matched_tokens": ["Jones"], "snippet": "In the first place, <mark>Jones</mark> was not the real"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones"], "snippet": "In the first place, <mark>Jones</mark> was not the real"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
