{"document": {"bbox": [1596.18, 538.6, 1654.43, 558.69], "bbox_id": "39c08d4ba1", "file": "AppomattoxNewspapers_1939-1943a_0186.pdf", "page": 1, "text": "Cross"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "<mark>Cross</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "<mark>Cross</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1197.34, 1626.01, 1225.85, 1639.01], "bbox_id": "0123008148", "file": "AppomattoxNewspapers_1962-1965a_0137.pdf", "page": 1, "text": "cross"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "<mark>cross</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "<mark>cross</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1446.68, 1752.17, 1467.71, 1760.67], "bbox_id": "69ea496592", "file": "AppomattoxNewspapers_1905-1912a_0470.pdf", "page": 1, "text": "cross-"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "<mark>cross</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "<mark>cross</mark>-"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [827.05, 870.98, 973.02, 922.98], "bbox_id": "945e5ea36a", "file": "AppomattoxNewspapers_1974-1975a_0217.pdf", "page": 1, "text": "CROSS"}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "<mark>CROSS</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "<mark>CROSS</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.31, 479.88, 1816.33, 666.08], "bbox_id": "30f7b44c11", "file": "AppomattoxNewspapers_1960-1962b_0435.pdf", "page": 1, "text": "zon. And, in looking straight up at the Northern Cross, Vega will be seen about one-fourth of the way toward the horizon dug west. Further, the Little Dipper will be seen almost midway between the Northern Cross and the Big Dipper, that is, in the middle north western sky. An interesting star in the Sep tember sky is Altair. Altair will be found about one-third of the dis tance to the southern horizon from the Northern Cross. It is a bright star and one of our closest neigh bors. It is not a large star, but it is bright because it is so close only fifeen light years away."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "up at the Northern <mark>Cross</mark>, Vega will be seen"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "up at the Northern <mark>Cross</mark>, Vega will be seen"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [202.55, 579.06, 382.52, 1462.4], "bbox_id": "37888a554b", "file": "AppomattoxNewspapers_1908-1909a_0375.pdf", "page": 1, "text": "Zedeklah was made king ot Judah by the king of Babylon U Kings  54  17 , but In spits of this kindness and the word of the Lord spoken to bint by Jeremiah Jet. 8417, 18. cf. Jer. 523, be febelled against tbeHng of Babylon. Be relied upon the help, tof Egypt, but all that Egypt could do was to cause tempo.sfy Interruption of tbe siege of Jerusalem. L The Siege of Jerusalem  tv . 1-3.  L Tbe time vv. L 2. It began on tbe tenth day of tbe  tenth month of the ninth year of  Zedeltlahs reign and lasted about  eighteen months.  The tenth month, according to the Jewish calendar, cor 1 responds to our December, January, Igg their calendar year began about j the middle of March. Tbe reason i the exact time la given is that this i was to be an event of great tmpor Itance to the Jews In their exile. t. 2. Tbe method  t . 1. Nebuehad nezzar came with a large army and l encamped against Jerusalem and built I forts against it round about It is thought that siege walls were built ! ground the city, abutting. It In. On the tops of these walls forts were I built from which missiles of destrnc- tlon could be bnrled by their engines  of year against tbe city. j  Tbe famine v. 8. i f Oelkle says, It wan speedily fol-  lowed, as is always tbe case, with an  outbreak of pestilence Food was iweli-nigb gone There bad long been k no bread. Mothers were at last driv- . en to murder and eat tbelr children. I . Tbe richest cltlsens wandered about searching for scraps In the dong hills. It Is estimated that one-third of the people of Jerusalem died of  starvation. It. Zedeklah Flight and Fate 4-7.  ki- J p p l Tbe city was broken up . 4. The Chaldeans had succeeded In making an opening in tbe wall so -  j large that they could make tbelr way .Into tbe city In spite of all that tbe k Hebrews could do. 2. Zedeklahs flight v. 4. Tbe king with his men of war fled night toward the plain. His ob- no doubt was to cross the Jor dan at Jericho ana bide in tbe moun tains east of tbe river. 3. Zedekiahs fate vv. 8-7.  1  He was overtaken In the plains Jericho v. 5, When his flight discovered, the Chaldean army pursued and captured him. 2 Be was brought to the king of Babylon at Rlblab v. , a town north of Da mascus. It was tbe kings headquar ters from which he directed his armies against Tyre and Jerusalem. Zedeklah was tried as a criminal be fore Nebuchadnezzar. 3 His fate v. 7. His sons were slain In his sight bis eyes were put out he was bound with fetters of brass and they carried him tc Babylon where he re mained prisoner until the day of his death Jer. 5211.  III. Jerusalem Destroyed w. 8-10. The dismantling of the city was de layed a month, pJthaps awaiting In structions from Nebuchadnezzar, who was at Rlblah. f L They trarnt of the house of the Lord v. 9. This was the sacred temple bnllt by Solomon, with additions And mod ifications. Before burning It waa de spoiled of all Its sacred contents. ... 2. Burnt the kings bouse v. 9. This was doubtless the palace built far Solomon. - 81Hurnt all the houses of Jerusa lem v. 9. Ill The Implication la that the common   Houses wereleft tor the people -i - m y r r r    c 4. They breko down the walls of"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "no doubt was to <mark>cross</mark> the Jor dan at"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "no doubt was to <mark>cross</mark> the Jor dan at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1123.17, 469.82, 1283.47, 1585.51], "bbox_id": "022e619294", "file": "AppomattoxNewspapers_1922-1923a_0048.pdf", "page": 1, "text": "Zedekiah was made king of Judah by the king of Babylon 2417, but in spite of this kindness and the word of the Lord spoken to him by Jeremiah Jer. 3817, 18 cf. Jer. 523, he re belled against the king of Babylon. He relied upon the help of Egypt, but all that Egypt could do was to cause temporary interruption of the siege of Jerusalem. I. The Seige of Jerusalem vv. 1-3. 1. Time of vv. 1, 2. It began on the tenth day of the tenth month of the ninth year of Zedekiahs reign and -lasted about eighteen months. The tenth month according to the Jewish calendar corresponds to our December- January, as their calendar year began about the middle of March. The reason the exact time is given is that this was to be an event of great importance to the Jews in their exile. 2. The Method v. 1. Nebuchadnez zar came in person with a large army and encamped against Jerusalem and built forts against it round about. It is thought that siege walls were built, around the city, shotting it in. On the tops Of these walls forts were built from which missiles of destruction could be hurled by their engines of war against the city. With the city shut in its fall was only a question of time. 3. The Famine v. 3. Gelkie says It was speedily followed, as is always the case, with an outbreak of pesti lence. Food was well-nigh gone. There had long been no bread. Moth ers were at last driven to murder and eat their children. Tlie richest citi zens wandering about searching for scraps in the dunghills. Even outside the city the people were starving. There was no bread for the people of the land. It is estimated that one- third of the people of Jerusalem died of starvation. II. Zedekiahs Flight and Fate vv. 4-7. 1. The City was Broken Up v. 4. The Chaldeans had succeeded in mak ing an opening in the wall so large that they could make their way into the. city in spite of all that the He brews could do. Resistance was car ried on to the bitter end. 2. Zedekiahs Flight v. 4. The king with his men of war fled by night to ward the plain. His object, no doubt, was to cross the Jordan at Jericho and hide in the mountains east of Jordan. 3. Zedekiahs Fate vv. 5-7. 1 He was overtaken in the plains of Jericho v. 5. When his flight was. discovered the Chaldean army pursued and cap tured him. 2 He was brought to the king of Babylon at Riblah v. 6. Riblah was a town north of Damascus. It was the kings headquarters from which he directed his armies against Tyre and Jerusalem. Before Neb uchadnezzar, Zedekiah was tried as a criminal. 3 His.fate v. 7. His sons were slain in his sight his eyes were put out he was bound with fet ters of brass and they carried him to Babylon where he remained pris oner until the day of his death Jer. 5211. III. Jerusalem Destroyed vv. 8-10. The dismantling of the city was de layed a month, perhaps awaiting in structions from Nebuchadnezzar, who was at Riblah. 1. They Burnt the House of the Lord v. 9. This was the sacred temple built by Solomon with additions and modifications. Before burning it they plundered it of all its sacred contents. 2. Burnt the Kings House v. 9. This was doubtless the palace built by Solomon. 3. Burnt All the Houses of Jeru salem v. 9. The implication is that the common houses were left for he people v. 12. 4. They Broke Down the Walls of Jerusalem. The aim was to render the walls useless as a means of de fense. IV. The Disposition of tho People vv. 11, 12. 1. Carried Them Into Captivity v. 11. The people who were left In the city and those who had deserted to the Babylonians were carried to Baby lon all such as would be of use in Babylon. 2. The Poorest of the Land Were Left v. 12. The people who would not likely make any trouble were left as vine-dressers and husbandmen Doubtless they were looking forward to colonization by foreign peoples. The object in leaving these people was that the country might be ready for their coming. Over these people Gedaliah was appointed as governor, with head quarters at Mizpah."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "no doubt, was to <mark>cross</mark> the Jordan at Jericho"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "no doubt, was to <mark>cross</mark> the Jordan at Jericho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [420.68, 1383.01, 582.67, 1809.2], "bbox_id": "d32056defb", "file": "AppomattoxNewspapers_1962-1965a_0004.pdf", "page": 1, "text": "Z The cheapest trips are in car- - go steamers, which are limited  to 12 passengers. Such trips, - however, take several months  and do not run on stated sched- I ules. They do provide atractive ,  staterooms and good food. Trips i _ around the world by air cost - about 1,000. Those making a  I trip to South America had bet- - ter not bother with cargo ships  or airplanes but take one of the - regular passenger steamships  from New York anT return. I These lines give excellent serv-  ice and cost, for a couple two . i n a stateroom, abtout  2 , 000   and they take about two months, j I Remember, it is summer in - South America while it is win-  ter in the United States. - The Grace Line sails from z New York south through the - the Panama Canal and down l the West Coast to Valparaiso, I Chile and return. This takes  around 50 days and costs nearly Z  1,000 per person  two in a  stateroom. The Moore-McCor-  mack Lines sail south from New ,  York down the East Coast, in- l I eluding Brazil and Argentina.  This trip does not take so long a time and therefore costs less. - Persons desiring to do so can go  south by the Grace Line, cross - the Ande and go on to the  East Coast by rail, and come - back by the Moore-McCormaCk Line. Such persons can buy a - round-trip ticket as the two lines -work together in a friendly man- I ner. Neither line goes around"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "by the Grace Line, <mark>cross</mark> - the Ande and go"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "by the Grace Line, <mark>cross</mark> - the Ande and go"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1851.09, 1693.79, 2188.5, 1710.69], "bbox_id": "d2139c09df", "file": "AppomattoxNewspapers_1922-1923a_0185.pdf", "page": 1, "text": ".yttleton, a member of j Petite entirely, which made him cross I the Balfour cabinet, was defeated. md peevish. I put him on a diet of"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": ".yttleton, a member of j Petite entirely, which made him <mark>cross</mark> I the Balfour cabinet, was defeated. md peevish. I put him on a diet of"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": ".yttleton, a member of j Petite entirely, which made him <mark>cross</mark> I the Balfour cabinet, was defeated. md peevish. I put him on a diet of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [903.59, 459.09, 1001.39, 503.49], "bbox_id": "ad1f3cb4f2", "file": "AppomattoxNewspapers_1908-1909a_0219.pdf", "page": 1, "text": "ytin.T G-cin foSeeye.. litt L c JcucJcte ctôn- TiLu  cross"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "ytin.T G-cin foSeeye.. litt L c JcucJcte ctôn- TiLu  <mark>cross</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "ytin.T G-cin foSeeye.. litt L c JcucJcte ctôn- TiLu  <mark>cross</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2191.19, 1283.33, 2536.19, 1366.07], "bbox_id": "b7719e97bd", "file": "AppomattoxNewspapers_1939-1943a_0189.pdf", "page": 1, "text": "your Sunday School or to either of i L 1941, worid condition Indicate he local banks, with the request, an export marked for not over 20 thht it be turned over in Mrs.  million pounds, meaning that about George R. Purdum, Roll Call Chair- j  per cent of  fire-cur d maricet. man, Appomalitox, V a. 1  5 fMr  f at lefV You are tihe Red Cross. Do your Marketing quotas,y which are ol- 81are untarlly approved or disapproved by Eula Mae Burk?, Chairman growers, provide an ordoriy way Appomattox County Chap.er, I f adjustment of uppy to demand"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "You are tihe Red <mark>Cross</mark>. Do your Marketing quotas,y"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "You are tihe Red <mark>Cross</mark>. Do your Marketing quotas,y"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.54, 499.86, 1782.41, 1181.16], "bbox_id": "e85f1760c5", "file": "AppomattoxNewspapers_1902-1905a_0448.pdf", "page": 1, "text": "YOUR SIN W ILL FIN D YOU OUT. Dat war Is still a raging en a bloody one it be, Fokes is falling by de thousan in dat country cross de sea. Cannons bustin, shells a screa min, ships is si likin right off hand, 0 tis sad for any country when a war stalks 1 oer de land. Japans little brave en spunky, jes es brave  es she kin be. En she could not stand a tyrant tryin to I push her in de sea,  Russias mighty big en gressive, en it ain t no pleasant lot. For to naybor wid a country, wantin wbat she is not got. 0 de Russian bar is savage when you feel her stingin breaf, Bbe will stretch her long arms round youen shell hug you right, to deaf, Peaceful fokes is lived long side her dey too weak to go to war. Bn she snarled en showed her teef en crushed dein wid her cruel paw. DarwaB mighty shameful dolns once en all de world could see, En Is gwyne to tell de story zaokl y like twas told to me Long ago a noble country flourished right at Russias door, Land was good en fokes was happy when dat 1 bar begin to roar. I Twas a blot on Russias histry when twas Poland met her fate, I When de angry Russian soldiers stood dar I howlin at de gate, I En dey took en sacked de cities, ah! dat cruel bar he roared I When de women was mistreated en do men I put to de sword. I Den she gobbled up dat country en she had a reglar feast,  I En to satisfy her naybors she gin dema little I piece, I. When de Vails was toplin round him, dem a 1 Polish nobleman I Took en lef his ruint country en went over to Japan. En he lived in dat far country for de ba.auee of his life, En twas dar he met a maiden dat he took to be his wife, Y es,twas dar he staid en flourished, en he lives a prosprous man, En a son was born to bless him in de yellow peoples land. En dat son Is great Kuroki. man of mighty actsen deeds. , Bn he lift his arm to fend her when he felt l his countrys needs. In de fore-front of de army he Is battled day i by day, , He has led his men to viotry while de enemy s  give way- I He has poked en pricked en prodded, on has I mortified de bar,  Bn de nations all is laughing at her autics over dar, En she keeps on a retreatin dun lost all her dignity, En 1 specks dat great Kuroki s gwyno to push her in de sea. When he strikes a blow for Japan he strikes one for Polands wrong, Sich a drubbln he dun gin her. Russia km not hold out long. All her ships is sunk en scattered, Togo put dem all to rout, . Mighty bad to go long sinnin case twill"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "thousan in dat country <mark>cross</mark> de sea. Cannons bustin,"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "thousan in dat country <mark>cross</mark> de sea. Cannons bustin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1309.2, 1587.24, 1486.81, 1659.4], "bbox_id": "7cf8511bea", "file": "AppomattoxNewspapers_1943-1947a_0169.pdf", "page": 1, "text": "Your Red O oss is your link with your boyhelping solve personal prob lems both of you may have. But your Red Cross has no private funds of its own. It must depend solely on your contributions. Give today. . . give more . . . to the Red Cross."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "have. But your Red <mark>Cross</mark> has no private funds"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "have. But your Red <mark>Cross</mark> has no private funds"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [724.1, 909.7, 1018.04, 929.7], "bbox_id": "671ee5fda9", "file": "AppomattoxNewspapers_1962-1965a_0136.pdf", "page": 1, "text": "YOUR RED CROSS VOLUNTEER"}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "YOUR RED <mark>CROSS</mark> VOLUNTEER"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "YOUR RED <mark>CROSS</mark> VOLUNTEER"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [752.93, 1621.62, 963.75, 1666.72], "bbox_id": "76e15bed31", "file": "AppomattoxNewspapers_1954-1955a_0249.pdf", "page": 1, "text": "Your Red Cross is still short of its goal in the 19S5 Red Cross Fund Campaign."}, "highlight": {"text": {"matched_tokens": ["Cross", "Cross"], "snippet": "Your Red <mark>Cross</mark> is still short of its goal in the 19S5 Red <mark>Cross</mark> Fund Campaign."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross", "Cross"], "snippet": "Your Red <mark>Cross</mark> is still short of its goal in the 19S5 Red <mark>Cross</mark> Fund Campaign."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1818.7, 1566.88, 2112.25, 1587.18], "bbox_id": "cf5ff0bed2", "file": "AppomattoxNewspapers_1947-1949a_0430.pdf", "page": 1, "text": "Your Red Cross is ready to give you skilled hands to use when anyone is ill."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark> is ready to give you skilled hands to use when anyone is ill."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark> is ready to give you skilled hands to use when anyone is ill."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2006.89, 813.48, 2377.64, 916.37], "bbox_id": "cb4f741367", "file": "AppomattoxNewspapers_1955-1957a_0429.pdf", "page": 1, "text": "Your Red Cross dollars are"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark> dollars are"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark> dollars are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2248.9, 610.97, 2419.5, 633.06], "bbox_id": "ab77ef929c", "file": "AppomattoxNewspapers_1949-1952a_0304.pdf", "page": 1, "text": "Your Red Cross"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Your Red <mark>Cross</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1209.84, 1539.23, 1379.51, 1563.23], "bbox_id": "33cc7a503d", "file": "AppomattoxNewspapers_1949-1952a_0069.pdf", "page": 1, "text": "Your RED CROSS"}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "Your RED <mark>CROSS</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "Your RED <mark>CROSS</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1886.08, 872.0, 2052.18, 921.6], "bbox_id": "61d25c15e3", "file": "AppomattoxNewspapers_1947-1949a_0208.pdf", "page": 1, "text": "Your Home Service of the Ap pomattox County Chapter of the American Red Cross has served one hundred and thirty-two cases during the past twelve months."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Your Home Service of the Ap pomattox County Chapter of the American Red <mark>Cross</mark> has served one hundred and thirty-two cases during the past twelve months."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Your Home Service of the Ap pomattox County Chapter of the American Red <mark>Cross</mark> has served one hundred and thirty-two cases during the past twelve months."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1996.81, 201.65, 2158.16, 478.5], "bbox_id": "a2aa9d7698", "file": "AppomattoxNewspapers_1892-1898a_0409.pdf", "page": 1, "text": "Young PillarsMessrs. Cross am! Staples. Mrs. Nannie Page, of Lynchburg, has been witli her mother, Mrs. Wharton, during her illness. Mr. Wm. Price hs been quite ill for more than a week with catarrhal fever, but is now much better. The unknown, Bapto-Methodist passon and Holy Land Lecturer drew- very small erdwds aud still mailer receipts at this place. The Epworth League, of Bethle ham Methodist Church, will hold its egular session next Friday evening ind afterwards will assemble fort nightly on Sunday eveniugs at 8 oclock. Rev. Mr. Parish lectured before the B. Y. P. U., of Mt. Vernon, Baptist Church last Sundav evenjng, Q uid N unc . May 17, 1897 ."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Young PillarsMessrs. <mark>Cross</mark> am! Staples. Mrs. Nannie"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Young PillarsMessrs. <mark>Cross</mark> am! Staples. Mrs. Nannie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [756.29, 1591.77, 1060.06, 1836.12], "bbox_id": "2e13198b67", "file": "AppomattoxNewspapers_1926-1933a_0093.pdf", "page": 1, "text": "You will be served quickly and courteously at the following stations Appomattox Motor Co. R. C. Moores Service Station Moses Motor Co. Sherwil! Mercantile Co. W-T. Cross, Cross Bros., W. E. Drinkard.ConcordDeoot W. E, Dickerson. Spout Spring P E. B. Martin, Oakville T. M. Martin H R. Moore, Beckham E. P. Tanner, Stonewall E. P. Taylor Mrs. Ida Marks A. M. Bryant W. W. Thornhill W. D. Hix  Co., Hixburgv9kS4- R. D- Baldwin a Staple Bros  - Harvey Bros.  Appomattox Hardware .Distributors BH a a m iM n n iH a ra ii I"}, "highlight": {"text": {"matched_tokens": ["Cross", "Cross"], "snippet": "Sherwil! Mercantile Co. W-T. <mark>Cross</mark>, <mark>Cross</mark> Bros., W. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross", "Cross"], "snippet": "Sherwil! Mercantile Co. W-T. <mark>Cross</mark>, <mark>Cross</mark> Bros., W. E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [480.95, 1024.66, 759.01, 1071.81], "bbox_id": "0b94d849ee", "file": "AppomattoxNewspapers_1905-1912a_0591.pdf", "page": 1, "text": "you w avSfian  tkttl. duI1 E  Whvrfbt cross smd irritable, ifs because ypu need a tonic. Why dW ky Cardui? Cadul bufldh, strengthens, J  torLnd 4  to every way as a special tonicremedy for women. TO ,U for youfyrif your druggist efto Cardid- Ask him."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "tkttl. duI1 E  Whvrfbt <mark>cross</mark> smd irritable, ifs because"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "tkttl. duI1 E  Whvrfbt <mark>cross</mark> smd irritable, ifs because"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2300.88, 1036.23, 2491.52, 1086.48], "bbox_id": "efa3f7efe1", "file": "AppomattoxNewspapers_1947-1949a_0302.pdf", "page": 1, "text": "YOU RIDE SAFER in the 59 more rigid Lifeguard Body. New box-secllon frame with five cross members . . . new Picture W indow  Visibility . . . 35 easier to apply Magic Action King-Size Brakes."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "YOU RIDE SAFER in the 59 more rigid Lifeguard Body. New box-secllon frame with five <mark>cross</mark> members . . . new Picture W indow  Visibility . . . 35 easier to apply Magic Action King-Size Brakes."}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "YOU RIDE SAFER in the 59 more rigid Lifeguard Body. New box-secllon frame with five <mark>cross</mark> members . . . new Picture W indow  Visibility . . . 35 easier to apply Magic Action King-Size Brakes."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [348.27, 766.85, 505.9, 908.85], "bbox_id": "3b40c7347c", "file": "AppomattoxNewspapers_1892-1898a_0172.pdf", "page": 1, "text": "You must not expect to become a Christian by accident. That blessed experience must be the result of deliberate determination, of intelli gent seeking, and of faithful endur ing. This truth is earnestly affirmed in many parts of Christs teaching. Christs honesty is worthy of commendation. He clearly lays down the conditions of discipleship we must take up the cross and follew him.Dr. M ac Arthur."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "must take up the <mark>cross</mark> and follew him.Dr. M"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "must take up the <mark>cross</mark> and follew him.Dr. M"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1259.78, 264.07, 1514.54, 301.07], "bbox_id": "507d62581b", "file": "AppomattoxNewspapers_1898-1902a_0316.pdf", "page": 1, "text": "You Look Cross,"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "You Look <mark>Cross</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "You Look <mark>Cross</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2285.28, 453.91, 2447.44, 569.09], "bbox_id": "da19939660", "file": "AppomattoxNewspapers_1912-1915a_0304.pdf", "page": 1, "text": "you Heres something worth taowiMb way to get mors real Joy and pleMV ana comfort out ot your life than you ever dreamed was possiblethe Joy that is bound  to come to every owner of a sturdy, healthy, vigorous body. Wonderful ROOT JUICE Ts for who are weak, ruti-down, fagged out, I ous, sleepless, appettteless amh the re markable results ft. brings about In such cases is the wonder o f euesShodg who ever tries i t You never saw anything work like it in all your life.  i ss. Have you lest ambition, energy Interest In thinpaT Do you get nert befuddled, rattled, cross, lift table and cranky? Do you feel tired, half sick, havu headaches, gst constipated, have"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "get nert befuddled, rattled, <mark>cross</mark>, lift table and cranky?"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "get nert befuddled, rattled, <mark>cross</mark>, lift table and cranky?"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [892.28, 190.68, 1035.27, 330.77], "bbox_id": "b70a697b97", "file": "TimesVirginian_1978_0382.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2125.89, 161.83, 2268.62, 300.52], "bbox_id": "e961e1c520", "file": "TimesVirginian_1978_0375.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES, HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th. SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2010.46, 838.21, 2155.12, 977.36], "bbox_id": "f9f511259b", "file": "TimesVirginian_1978_0363.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [759.09, 476.26, 901.26, 615.66], "bbox_id": "a2019ced98", "file": "TimesVirginian_1978_0362.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th. SAVE A LIFE  GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1191.81, 202.44, 1337.92, 339.38], "bbox_id": "78da5ef44f", "file": "TimesVirginian_1978_0367.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6  P.M. ON TUESDAY, AUGUST 29th SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.48, 166.92, 2140.32, 306.31], "bbox_id": "5283210a0b", "file": "TimesVirginian_1978_0370.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE A t THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th. SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "A t THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "A t THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2142.95, 555.58, 2292.59, 693.53], "bbox_id": "e24ff8b43d", "file": "TimesVirginian_1978_0369.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE POWER TO SAVE LIVES. HOW? GIVE BLOOD! . YOUR BLOOD IS A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th. SAVE A LIFE-G IVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1189.86, 400.22, 1332.17, 540.32], "bbox_id": "4f1ad5265b", "file": "TimesVirginian_1978_0373.pdf", "page": 1, "text": "YOU HAVE WITHIN YOU THE FOWER TO SAVE LIVES. HOW? GIVE BLOOD! YOUR BLOOD I S A LIFE SAVING MEDICINE. GIVE AT THE RED CROSS BLOOD- MOBILE VISIT AT LIBERTY BAPTIST CHURCH FROM NOON UNTIL 6 P.M. ON TUESDAY, AUGUST 29th. SAVE A LIFE - GIVE BLOOD."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "GIVE AT THE RED <mark>CROSS</mark> BLOOD- MOBILE VISIT AT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.69, 514.26, 1925.09, 823.06], "bbox_id": "118b2b6e6b", "file": "TimesVirginian_1978_0402.pdf", "page": 1, "text": "You have invited several friends to your home for a dinner party. You and your guests are seated at the dining room table, enjoying conver sation and a rib roast dinner. Sud denly, one of the guests begins coughing and making choking signs. A piece of meat has lodged in his throat, and he is unable to breathe. Precious seconds separate your friend from death. What would you. do if this life- threatening emergency occurred in your home? Would your knowledge of first aid enable you to save your friends lifeor would you stand by helplessly, watching him choke to death on a piece of rib roast? Medical experts agree that the first few minutes following an accident or attack are often the most critical and that prompt action may veiy well mean the difference between life and death. Unfortunately, thousands of Americahs die each year because the people who are in a position to help them during those first critical min utes dont know what action to take. The American Red Cross has long been a leader in developing and pro moting safety courses designed to"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "take. The American Red <mark>Cross</mark> has long been a"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "take. The American Red <mark>Cross</mark> has long been a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.0, 1116.6, 2479.69, 1208.45], "bbox_id": "cbb43d9e17", "file": "AppomattoxNewspapers_1933-1936a_0066.pdf", "page": 1, "text": "you go to buy aspirin, emember this Every of real aspirin of r manufacture is J with this cross. No hkt without this cross is GKNUINE Bayer Aspirin.  Safe relief for headache, colds, sore throat, pains of rheumatism and neuntis, etc."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "is J with this <mark>cross</mark>. No hkt without this"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "is J with this <mark>cross</mark>. No hkt without this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [357.36, 483.05, 514.49, 890.85], "bbox_id": "ec0d8761cd", "file": "AppomattoxNewspapers_1915-1918a_0197.pdf", "page": 1, "text": "YOU E N JO Y T H E PRO TEC  TIO N , PA Y FO U IT The multi-millionaires enjoj more protection than do the rest of us and should pay for it without protest. The men who simply write checks to pay taxes have an easy time of it, compared with toe poor man who has to deny himself or family some comfort to pay a few dollars of taxes. A n d then, when the battle is joined this same poor man will be found on the forefront of bat tie, while the rich continue to enjoy the luxuries of their pa latial homes, losing no sleep of nights and no creature com forts from the table. And if the American multis are not willing to pay the war tax on this side the water, let them cross over to England and learn that they have exchanged the frying pan for the fire. The soldier who dodges duty is stamped with the mark of de serter and what of the rich who dodge the tax-gatherer? Can he not be shamed into do ing his duty? The soldier is shot for not doing his. Let rich and poor do duty, and alls well."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "the water, let them <mark>cross</mark> over to England and"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "the water, let them <mark>cross</mark> over to England and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [172.29, 1623.18, 475.07, 1695.38], "bbox_id": "679cda83d8", "file": "AppomattoxNewspapers_1902-1905a_0587.pdf", "page": 1, "text": "you. CROSS TIES AND CORD WOOD. E. F.  Glover, Evergreen. CASTOR IA Por Infants and Children. The Kind You Have Always Bought"}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "you. <mark>CROSS</mark> TIES AND CORD WOOD. E. F.  Glover, Evergreen. CASTOR IA Por Infants and Children. The Kind You Have Always Bought"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "you. <mark>CROSS</mark> TIES AND CORD WOOD. E. F.  Glover, Evergreen. CASTOR IA Por Infants and Children. The Kind You Have Always Bought"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [813.13, 1546.31, 974.87, 1655.11], "bbox_id": "6d1d22b3e8", "file": "AppomattoxNewspapers_1912-1915a_0276.pdf", "page": 1, "text": "You ask me why I thought this loving Christ Would heed my prayer? X knew He died upon the cross for me, X nailed Him there. I heard His dying cry, Father, forglv X saw Him drink deaths cup that I might live My head was bowed upon my breast In shame. He called me, and In penitence I He heard my prayer I cannot tell you how. Or when, or where Only I love Him"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "He died upon the <mark>cross</mark> for me, X nailed"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "He died upon the <mark>cross</mark> for me, X nailed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [474.95, 789.67, 1414.65, 1338.64], "bbox_id": "5fe2c6deb2", "file": "AppomattoxNewspapers_1974-1975a_0250.pdf", "page": 1, "text": "You are inviteli Richard B.1 JESUS IS YOUR FRIEND Perhaps you have suffered some great sorrow or disap pointment. Perhaps, you have been betrayed by friends in whom you placed your trust. Tt could be that you have been hurt by some injustice, some kind of hatred against which you have found it impossible to struggle. . It is at times like these that I there comes to you a hunger to know a better and a strongr friend, a truer and a wiser justice, a filler and a fairer life than you have ever lived before. Well, my dear friend, there is Someone you can turn to He loves you! He cares for you! He even died for you! Yes, He died for you, so that you could have eternal life. This dear friend is Jesus! He died on Calvarys cross so that you might have eternal life. Shouldnt you love Him for at least that much? Do you know Jesus? Is He a part of your life? Do you trust Him? You can trust Him. He is your friend. Yes, sinner, He is even your friend. Can you admit to yourself that you are a sinner? If you can, then you have taken a giant step in the direction of being closer to Jesus. If you are saved, then you know that you are on your way to heaven, but if youre not, dear friend, youre headed straight for hell. Dont you think that its time for you to get right with Jesus? Go to church, read your Bible daily, and pray continually. But, first of all, admit that you are a sinner and ask Jesus to come into your heart and save you from all sin. he is your i friend, and He will do it!"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "He died on Calvarys <mark>cross</mark> so that you might"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "He died on Calvarys <mark>cross</mark> so that you might"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [788.14, 1656.83, 939.95, 1744.74], "bbox_id": "9b4fb4fa20", "file": "AppomattoxNewspapers_1918-1922a_0207.pdf", "page": 1, "text": "Yomel Maru Brings 760 Of Them To San Francisco. San Francisco.The steamer Yomel Maru, chartered by the American Red Cross, arrived here from Vladivostok with 760 Russian children en route to their homes in and near Petrograd, from which they were taken when the revolution swept Russia."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "by the American Red <mark>Cross</mark>, arrived here from Vladivostok"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "by the American Red <mark>Cross</mark>, arrived here from Vladivostok"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [781.43, 1588.05, 1088.54, 1814.16], "bbox_id": "d29dd780bd", "file": "AppomattoxNewspapers_1908-1909a_0094.pdf", "page": 1, "text": "Yoh will be served quickly and courteously at  the following stations  _ __  Appomattox Motor Ctt. - fi R. C. Moores Service Station fC Moses Motor Co.  uj Sherwil? Mercantile Co.  9 W- T. Cross Cross Bros., W. E. Drinkard.ConcordDepot 9  W.-S, Dickerson. Spout Sprin 7  4 E. B. Martin, Oakville 3h T. M. Martin  H R. Moore, Beckhfc  E. P. Tanner, Stonewall r B. P. T a j i - l o r  Mrs. Ida Marks 4 -  f 5    . A. M. Bryant in W. W. Thornhill -  ,  W. D. Hix  Co., Hixburg ffl .. y A  fow jlgEmXffi.  Dj Staple Bros y , 3 . Haaey Bro.fc 4 . . . . 1 Appomattox Hardware D istributors"}, "highlight": {"text": {"matched_tokens": ["Cross", "Cross"], "snippet": "Co.  9 W- T. <mark>Cross</mark> <mark>Cross</mark> Bros., W. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross", "Cross"], "snippet": "Co.  9 W- T. <mark>Cross</mark> <mark>Cross</mark> Bros., W. E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1056.23, 646.21, 1213.39, 872.71], "bbox_id": "4a7b288ca9", "file": "AppomattoxNewspapers_1898-1902a_0043.pdf", "page": 1, "text": "Yi.-s Anna Worley, of Lynchburg, was lie gm-siof tbc Misses Wori  f at their home Roseland last week. Farmers have begun cut ring to bacco and Hilling Judder. There will he quarterly confer ence at Salem church Sal 111 day and Sunday, 5 jitem-bcr 3-4. The ques tion when  he ueW church shall In built will he decided Samïdity. The protracted meeting a iR begin third üunday in October. Mr. E. C. Cross am! clu rming bride of Concord were in our midsts Sunday. Mr. Marshall Hunier, t Bluefielc spent last, week uriiing relatives near here. Success lo ihe T imes . B eat lice ."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "October. Mr. E. C. <mark>Cross</mark> am! clu rming bride"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "October. Mr. E. C. <mark>Cross</mark> am! clu rming bride"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.41, 1055.97, 1461.5, 1216.46], "bbox_id": "99056b768e", "file": "TimesVirginian_1978_0504.pdf", "page": 1, "text": "Yes, we need everyone who can give blood to come out and donate a unit of blood Tuesday, November 14, when the Red Cross Bloodmobile sets up from noon untU 6 p.m. at Liberty Baptist Church. We hope you will not have to wait long. We are trying very hard to have things run smoothly as possible. I Would like to remind you that our Red Cross nurses and workers haye a LONG day when they come to Appomat-"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "14, when the Red <mark>Cross</mark> Bloodmobile sets up from"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "14, when the Red <mark>Cross</mark> Bloodmobile sets up from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [945.59, 434.04, 1101.47, 735.09], "bbox_id": "2266dedcee", "file": "AppomattoxNewspapers_1898-1902a_0408.pdf", "page": 1, "text": "Yes, they could hear Jake say lng to their mother, to-morrow morn lng early the Captain will be taken on to Trenton and tried by drumhead court-martial as a spy, and shot, most likely. At this dreadful news the two chil dren crouching in the hallway clutched each other in the anguish of the mo ment. Come, said Jack to Dolly present. Iy, and following her brother she stole out Into the kitchen. Dolly, muttered Jack, there Is a faint chance that Washington will ar rive In time to save father, bnt we must not depend npon it, for it is storming hard and the iver Is foil of Ice, and I see not how the great Gen- eral can cross with all his men and steeds and cannon. I am going down to old Brickstons wharf, and mayhap, I will find there some kind of an old boat I shall try to cross over and ty find the American camp and if possi- ble bring back aid. No one noticed the two small fignres- as they crept out of the honse and floundered through the snow, now, knee hlghi in the direction of the rlv-i ers edge. After an hour the two near ly exhausted reached the wharf, and"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "great Gen- eral can <mark>cross</mark> with all his men"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "great Gen- eral can <mark>cross</mark> with all his men"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1371.12, 1574.1, 2237.41, 1785.32], "bbox_id": "347d82b21d", "file": "TimesVirginian_1980a_0397.pdf", "page": 1, "text": "Yes, 1 wont to give the Tfmes-Virginkut ae a Christmas gift, 52 weeks a year I 92 in Appomattox and surrounding counties, 6 for student all others, 10 SendtheTluiee-Virginianto PEN  PENCIL SETS By  PAPERMATE  HALLMARK CROSS PARKER ir Bulletin Boards Chalk Boards Staplors TapeDispensers  Filing Cabinets  Office Chairs OfficeDesks ArtSupples A ppomattox O ffice S upeui  PHONE 392 - 74  Lnrar Lovoi TfaM8-lfhMh SdMto COURT ST, - APPOMATTOX, VA."}, "highlight": {"text": {"matched_tokens": ["CROSS"], "snippet": "SETS By  PAPERMATE  HALLMARK <mark>CROSS</mark> PARKER ir Bulletin Boards"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS"], "snippet": "SETS By  PAPERMATE  HALLMARK <mark>CROSS</mark> PARKER ir Bulletin Boards"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [693.34, 1281.46, 1032.39, 1433.84], "bbox_id": "9565665ccd", "file": "AppomattoxNewspapers_1943-1947a_0171.pdf", "page": 1, "text": "Yes,  said tfie boy. they cut off one of my legs, and if it had nt been for Red Cross blood plasma and the Red Cross nurses, 1 Wouldnt be alive today. That s ydiy. I calí all you ladies an gels of mercy.  The Red Cross secretary from .Winchester went back to her desk and tackled the job of getting more angels for I . ...... the Army and Navy with renewed Compare the experience of Samuel vigor.    I Sam. 87 and of Paul Acts 9  5 . .  -------- Touch Gods people and you touch Him. Fail them and you fail Him. Serve them and you serve Him. III. Judgment Determines v. 46"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "nt been for Red <mark>Cross</mark> blood plasma and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "nt been for Red <mark>Cross</mark> blood plasma and the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.78, 1305.02, 1648.2, 1507.07], "bbox_id": "7274fd2e6a", "file": "AppomattoxNewspapers_1926-1933a_0435.pdf", "page": 1, "text": "years. He had been an invalid for eight years, having been stricken with creeping paralysis and tho he suffered no pain for three long years he could not talk. He was a member of Cal vary Baptist church. T h e funeral services were conducted at his home by Rev. Poe, the hymns sung were The Old Rug ged Cross, Sometimes Well Un derstand. His body was laid to rest i n Evergreen cemetery. He leaves to mourn their loss a wife and twelve children and one sister, Mrs. Milton Reynolds, of this county."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "The Old Rug ged <mark>Cross</mark>, Sometimes Well Un derstand."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "The Old Rug ged <mark>Cross</mark>, Sometimes Well Un derstand."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.98, 1321.47, 1904.93, 1417.12], "bbox_id": "c9bf167d66", "file": "AppomattoxNewspapers_1962-1965a_0485.pdf", "page": 1, "text": "year. XL-45, a short single cross, which has been available for two years, is being joined by XL-325, recently attended a training ses- j an early 3-way cross and XL-65, sion at the DeKalb research and j a later single cross. Researchers demonstration plots near DeKalb Illinois. More than 600 farm ers! mocjern hybrids and dealers from Illinois, Wis consin, Indiana, Michigan, Penn sylvania, New Work, Virginia,"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "XL-45, a short single <mark>cross</mark>, which has been available"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "XL-45, a short single <mark>cross</mark>, which has been available"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [360.7, 301.31, 541.5, 1741.67], "bbox_id": "7c9534e8f6", "file": "AppomattoxNewspapers_1915-1918a_0504.pdf", "page": 1, "text": "Yea, the cold haa oome good and troog. Jaat the weather I loved a a boy bat now that the anowa ot many winters have fallen on me, 1 prefer the warn sunahine. Fine ice spell, and no doubt pru dent farmers hare taken advantage of it and vet many farmers no ay, tioce we can buy ice in town, we wont brave the cold to fill on own hous s. Just the same mis take those farmers make who fail to raise home food first. They will be acaiceof ice and scares of food. No only charity, bat other thi ogs shoulo begin at home. The ladies of Farmville are doin. noble work for the Bed Cross. They go to the waiebonses each morning and solicit tobacco from farmers, which is afterwards sold and the are accumulating a comfortable sum of money. Be it said to the credit of the farmer, that they mko a lib eral response the colored farmers have also been very liberal. We had a French soldier to talk to ns last Snn iay aternooa, at a great meeting at the Normal Audi torium. Not mnoh of a talker, but having engaged in many battles oi the war and been wounded in one of them, be waa the hero of the hoar especially with the Normal girla, who gathered about him and paid obaiav c. All the world loves a lover, A g ood one on Judge Watkins He attended a session of Nottoway court, where no hotel is open, and returning home at night  uoi hav ing had d.nnerhe let loose on a cold possum, and came near eating the entire animal. I watched as he ate, but I didnt take a bite and 1 wasnt sicthe possum didnt look to he big enough for two. With a partial season, tobacco ha- been coming in in larger quantities and prices are still high. If the farmers cant pay their debts thi- time, tin y can hardly ever expect to. Owing to the cold, work on the post offiie building haa boeu sus pended. Tney are still working ou , the foundation. Mr. C. A. Price, a traveling man, is at home for a day or two and say. he struck zero weatbor in hie recent travels, and that the furnaces in all hotels fail to give put heat. Give me tho air-tight stove, aud the oth er man may have the urnaoe. Eight inches cf enow on the level is some enow, jet we have had it in ntt i gieitih to be seen on out street This wasnt true of bygon m hose days I burred to be b n to i -ue road, aud did enjoy the piB A friend remarked that in sttai of sleighiuv- he simpy plunged his feet into a bucket of ice cold water and rung a bell. How wo mortals do d hr. I am impressed with the faot tha theres moie drinking in Farmville than ever in its historyrot old booze, but soft drinks. Coca cola hoi Is the right of way and is by long odds tne most popular of them all. 1 am not a devotee of the drink, but if theres anything good to eat 1 am in the front of the fray. Mr. Laub, who supervises the building of the post dfie, bai gone to New York to spend hie vac lion and as he said goodbye to the writer he added,  Ill toink of you Chri?t- mae morning when I sip my nos-g. Kind of him, but tne trouble is they dont know how to make a re nogg in the great city and the aacn is true of the. julep. I speak iron experience, but experience of ion ago. I have been for years a per sonal prohibitionist of the deepen, dye. A little sparkliug cider now aud then only that and nothing more. Mr. C. P. Holt, who once did business in Farmville, died euddeu- ly in Norfolk on the 9th, from a stroke of apoplexy. The remains were brought here for burial. He is survived by a widow, but no chil dren. The wife of Rev. Robertson, pas tor of the Bapiat church, has be. i seriously ill, but is batter as this is written. Mr. H. N. Madison has sold bis farm in East Prince Edward, the price paid being 5,509. Another old homestead gone out of the keep ing of the family, who have live 1 there for many years. Mr. A. B. Armstrong, wbo now lives in Fnrmvill, but who has a farm in Cumberland, has reuently killed hogs, which averaged 200 pounds. A lawyer- farmer, and g iod at both. And Mrs. Armstrong raise thoroughbred chickens. A farmer told me that his apples pod potato frozi daring the recant"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "work for the Bed <mark>Cross</mark>. They go to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "work for the Bed <mark>Cross</mark>. They go to the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [971.04, 456.64, 1101.29, 707.9], "bbox_id": "7bdb672ddb", "file": "TimesVirginian_1980a_0290.pdf", "page": 1, "text": "YARD SALE Saturday, Sept. 13, beginning at 9 a.m. portable dishwasher, box spring, and mattress, head- board, comfort chair, books, records, many other items. 4th house on left. Evergreen Ave., town. , 799-11-ltp YARD SALE Saturday, September 13, turn off Rt 460 on to Rt. 635, E of Appomattox, cross bridge take next right.  ______ 799-11-ltp MULTI FAMILY Y AR D SALE10 a.m. - 6 p.m. Sept. 6  13. Second house on Pine St. Numerous items for sale - clothing, household goods, tapes and albums, toys, 23-channel CB, jewelry! Dont miss this one. ____________ 799-4-2p"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "635, E of Appomattox, <mark>cross</mark> bridge take next right."}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "635, E of Appomattox, <mark>cross</mark> bridge take next right."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2340.93, 737.69, 2486.1, 809.58], "bbox_id": "05dcfeb73d", "file": "TimesVirginian_1981a_0380.pdf", "page": 1, "text": "YARD SALE - Friday and Saturday, Nov. 6  7,10 a.m. to 4 p.m. Several families. Hugh selection. Also extra large mens suits. At Red House Cross Roads. Look for signs. 7911-4-itc"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "YARD SALE - Friday and Saturday, Nov. 6  7,10 a.m. to 4 p.m. Several families. Hugh selection. Also extra large mens suits. At Red House <mark>Cross</mark> Roads. Look for signs. 7911-4-itc"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "YARD SALE - Friday and Saturday, Nov. 6  7,10 a.m. to 4 p.m. Several families. Hugh selection. Also extra large mens suits. At Red House <mark>Cross</mark> Roads. Look for signs. 7911-4-itc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [528.93, 1106.35, 694.98, 1219.99], "bbox_id": "97c3cfff92", "file": "AppomattoxNewspapers_1943-1947a_0120.pdf", "page": 1, "text": "Yankee Doughnut Stand Beats Army to Salamaua WITH ALLIED TROOPS AT SALAMAUA, NEW GUINEA.Sol diers call it the Salamaua Salva tion army, and its been doing a roaring business. Somehow Red Cross workers John Taylor of Gramercy Park, N. Y., and Leo Schwartz of Washington, D. C., ma.n- aged to gel onto the Salamaua Isth-"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "roaring business. Somehow Red <mark>Cross</mark> workers John Taylor of"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "roaring business. Somehow Red <mark>Cross</mark> workers John Taylor of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [682.09, 368.66, 989.65, 379.76], "bbox_id": "9400593b6b", "file": "AppomattoxNewspapers_1892-1898a_0117.pdf", "page": 1, "text": "y We pay the Highest Cash Prices for Tanbark Cross Ties, Sumac and all Country Pro"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "y We pay the Highest Cash Prices for Tanbark <mark>Cross</mark> Ties, Sumac and all Country Pro"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "y We pay the Highest Cash Prices for Tanbark <mark>Cross</mark> Ties, Sumac and all Country Pro"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [563.5, 226.18, 697.17, 906.0], "bbox_id": "811a06e6d5", "file": "TimesVirginian_1980a_0230.pdf", "page": 1, "text": "y REN J. BENNETT Nc unfinished nwers ór un won wars with God In Lukes Gospel, chapter 1428-82, Jesus illustrated the common problem of iinfinithedi business with two brief parables the parable of - an impulsive farmer who began to build an elaborate farm-building but did not finirii due to a lack of funds the parable of  a rash king who declared, war on a nation but did not win due to a tack of soldiers and military power. Unfinished business is the obvious problem in these parables, but what of the application to your life and mine? Traditionally, we have applied these parables to the Christian experience, saying that anyone who follows after Jesus Christ should first count the cost of that diseipleship. And this seems to be the obvious application since Jesus Him self said likewise, whosoever he be of you that forsaketh not all that he hath, he cannotbe my disciple. However, there might be another application which isnt so obvious. When Jesus spoke these parables, the inevitability of the Cross loomed large on the horikon. Jesus has begun to tell the disciples of His impending suffering and death and no doubt, He knew what the immediate reaction would be from the disciples as they witnessed His death. They would be frightened, puzzl ed, disappointed, and dis illusioned, and ask ques tions liké Was Jesus really the Messiah, and if so, why did He die . . . Does this mean the actually death of God Himself? So. then, Jesus, who knew how these men would view the Cross, seems to be suggesting to them with these parables that there is no unfinished business,, no unfinished towers, and no unwon wars with God - the Cross would not mean the defeat of Gad and His Kingdom of right eousness. What God begins."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "the inevitability of the <mark>Cross</mark> loomed large on the"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "the inevitability of the <mark>Cross</mark> loomed large on the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [283.73, 444.11, 440.16, 1249.92], "bbox_id": "d6e6db1eef", "file": "TimesVirginian_1981a_0023.pdf", "page": 1, "text": "y. moving an inch or two of snow can prove fatal. And it isnt the shoveling itself tiiat is the problem. It is the way we go aboutit. -, Bates explained that most people-try to do too much too. quickly, too fast shoveling great mounds of snow and working very quickly. The combination of heavy snow and rapid working pace puts a great strain on our system---és- pecially when we are not in condition. - The Blue Cross and Blue Shield fitness specialist re commended some precaution ary measures that can reduce thé dangers associated with snow shoveling. 1. Use s short shovel, with a small scoop. 2. Lift small loads, not large ones dont fill the scoop , completely as you shovel. - 3. Warm-up slowly and then pace yourself stop to rest often-before you feel tired. 4. Dress warmly but dont overdo it too many layers of clothes work to trap body heat, placing still more strain on your cardivascular system. Bates emphasized th at people with high blood pressure suffer from angina, or are otherwise a high risk for heart attacks should not shovel snow under any circumstances. According to Bates, women are more -often more fit than men for snow shoveling. For one thing women have some natural protection against heart attack. Women often are in better physical condition than men, too, Bates continued, noting that- this is ini- part a  consequence of the work that  women do to keep their homes. Men are often disdain ful of such household activities as sweeping, mopping, and vacuuming because they dont fit with the traditional macho male image, he said. How ever such activities actually help strengthen the arm and back muscles, and the fact, that women are left to do these things contributes to the superior conditioning that many women enjoy. Men who want to get in shape would do well to pitch in and help with household chores especially if they spend their days sitting at - a desk. Bates concluded, We all need to become more physically fit. If youre not in shape this winter, start now to become more physically fit. If youre not in shape now start now to get yourself in,condition."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "in condition. - The Blue <mark>Cross</mark> and Blue Shield fitness"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "in condition. - The Blue <mark>Cross</mark> and Blue Shield fitness"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [752.38, 306.08, 969.03, 335.28], "bbox_id": "ee062dedd1", "file": "AppomattoxNewspapers_1892-1898a_0090.pdf", "page": 1, "text": "y Kept in a Bétail Store. NEBIES. TOBACCO, CIG AES. aod CIGARETTES. ices for Tanbark, Cross Ties, Sumac and all Country Pro"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "y Kept in a Bétail Store. NEBIES. TOBACCO, CIG AES. aod CIGARETTES. ices for Tanbark, <mark>Cross</mark> Ties, Sumac and all Country Pro"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "y Kept in a Bétail Store. NEBIES. TOBACCO, CIG AES. aod CIGARETTES. ices for Tanbark, <mark>Cross</mark> Ties, Sumac and all Country Pro"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [858.24, 446.44, 1025.54, 741.94], "bbox_id": "9f85cf39a6", "file": "AppomattoxNewspapers_1902-1905a_0048.pdf", "page": 1, "text": "xpress was so badly hurt that there is little hope of his recovery. Both the express and the trolley were on steep grades, going at right angles. The express was signaled and the cross ing gates were lowered while the trolley car was half way down the hill. The motorman shut off the power and ap plied the brakes, but almost immediate ly the car began to slip along the icy rails. It gained tremendous momentum and at the bottom of the hill crashed through the gates directly in the track of the oncoming train. The locomotive plowed its way through the trolley, throwing the children in every direction. The accident happened within three blocks of the HighSchool building, and in the car at the time were nearly 100 pupils. As many as thirty others had managed to throw themselves from the car before the crash came. The trolley was one of the specials which every day bring the children to school. It had more than its ordinary load owing to the cold. It contained every child that could squeeze inside, and others stood on the rear platform. Peter Brady, the motorman, promptly shut off the power and applied the brakes. The speed of the car was checked, gut it continued to move slow ly down the incline. There was no thought of danger. Then it began to j move faster and faster. The ice covered"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "was signaled and the <mark>cross</mark> ing gates were lowered"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "was signaled and the <mark>cross</mark> ing gates were lowered"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.65, 640.38, 1808.49, 659.32], "bbox_id": "529fd25323", "file": "AppomattoxNewspapers_1943-1947a_0391.pdf", "page": 1, "text": "xhe following contributions to the Red Cross are reported"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "xhe following contributions to the Red <mark>Cross</mark> are reported"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "xhe following contributions to the Red <mark>Cross</mark> are reported"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [829.69, 755.37, 981.45, 785.72], "bbox_id": "fbcb96504a", "file": "AppomattoxNewspapers_1915-1918a_0507.pdf", "page": 1, "text": "X WOODROW WILSON,  President of the American Red I Cross."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "X WOODROW WILSON,  President of the American Red I <mark>Cross</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "X WOODROW WILSON,  President of the American Red I <mark>Cross</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.1, 1145.0, 1808.24, 1450.51], "bbox_id": "5dcdf2577a", "file": "AppomattoxNewspapers_1915-1918a_0157.pdf", "page": 1, "text": "X u iu City, Mo.C. 7 . Collins, a Venter, was walking across the eet clou to a street car slowly mov-  in the storm. A horse, in pueing, w a shoe, which rolled under toe truck of toe car aad caused a to to he turned. ! The front end of toe car proceeded I Showers of blessings fell I a straight line, while toe I dutin the month of April at tos started up a side street. launug duo __  __ Collins was thrown under to car I the Hebron Baptist parsonage, ha struck by to swinging rear end,and in the midst of the down- A escaped being crushed under thal twenty hens and seventy i to the quickness of toe motor-1P J . I chicks were found.   T   I  Topsy Turvy will be play- The new Brltielf decoration known led a t R o ck s S ch o o l House, Sat- the Military Cross was designed by lurday n ig h t May 6th begin- enry Farnham Burke. It la of silver I n jnt a t 8 o c lo c k . Come one d is one and five-eighths inches I  , , tore. In the center are the letters lend a ll, to h elp a g  R. L, and on each arm the imperial 1 A d m issio n 10 a n d 15 cents wn. The ribbon is of three equal! . , .. pe, the center dark purple, th al E. T. Price, has t g y there white. Captains, commissioned I for all of Appomat o x County Ocere or warrant officers are e li-l, t j,e popular priced Ford i for the decoration. The Cross I _ .  nur inari n - not confer any Individual prece- 1 cars. He exp ec to or entitle the holder to any I a rr iv e next week, a p a rt of dltion after his name aa a part of I t enJ being already sold. So lany one desiring to purchase a I car should see hm early."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "House, Sat- the Military <mark>Cross</mark> was designed by lurday"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "House, Sat- the Military <mark>Cross</mark> was designed by lurday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [903.56, 805.46, 1056.55, 1101.67], "bbox_id": "1dd27718b1", "file": "AppomattoxNewspapers_1918-1922a_0419.pdf", "page": 1, "text": "X U B _ Was  Very Weak After the birth ot my baby I had a back-set, writes Mrs. Mattie Cross white, of Glade Spring, Vs. 1 was V try jl thought I was going to die. I was so weak  couldnt raise my head to get a drink of water. 1 took. . . medicine, yet I didnt get any better. I was constipated and very weak, getting worse and worse. IsentforCardui. TAKE"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "back-set, writes Mrs. Mattie <mark>Cross</mark> white, of Glade Spring,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "back-set, writes Mrs. Mattie <mark>Cross</mark> white, of Glade Spring,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1315.74, 316.61, 1622.97, 532.09], "bbox_id": "7d0e673cd6", "file": "AppomattoxNewspapers_1918-1922a_0148.pdf", "page": 1, "text": "x h b o l k r k  s u f f ic e o f H u c iR -1 FarmviUe, was the guest of t e K  A p i i i S 01 A   i Mi88 Rachel Ferguson last ........... nt week. h. Thorn am... tfiiUoú Swti Lazarus Hancock .............. Delendani lae object of tins suit la to recover Irom ldefeiiUani James Lazaiu . Hancock, tue i oi  05 . with b pei cent interest thereon m the i5tn day ot auk ubi , 191, until paid, d oy him to tue said plaintiff, lor one wa I soiu and delivereu. aud to subject to tüe touem. i said debt by attachment 08 acres Ire or lese, ot land belonging to tue de Kjaut, s tuated in the couuty 01 Appomab- I aujviuiuK the tanus oi . . H titnij cross, j .. aiuijau and othexS, near liiXhurg iu I county A . . Lad an albuavit having been maue anc i that tue deleiiaant Jme. Aiaxaius 11 an- a is not a resiuent or the ó ta te ot lr- Cla, It is ordered that he do appear here m u fifteen clays alter due publication aud do wnat may be neoeasiy to Li uct his nteiest in m is su it, md a L is rtuer ordered that a Cvjpy hereof ue pub Led ouce a week lor lour w eeks iu the ues-V iiMiuiau, a A.ewspaper rubiisuea in  county of xippoinaitoA, ad nat a copy Bpusted aü the Iront doo oi the courthouae Khis eouuiy on the i9ih uay of April. J92u, beaug tee next su eeedlug rule day  this order was entered, . co p y Teste  C. W. SMITH, Clerk. Ic. Frauklin, p. q, -14"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "tanus oi . . H titnij <mark>cross</mark>, j .. aiuijau and othexS,"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "tanus oi . . H titnij <mark>cross</mark>, j .. aiuijau and othexS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [900.25, 669.75, 1054.27, 762.75], "bbox_id": "7dfe83defc", "file": "AppomattoxNewspapers_1922-1923a_0073.pdf", "page": 1, "text": "Wytheville.  The Wythe County Child Welfare Camp has been formal ly opened under the supervision of the Wythe County Red Cross school nurse, Miss Powhatan Stone, with Miss Emma Murray, as head nurse, iu charge. The name was chosen by the board of directors for this nutrition camp at a meeting recently held at the office of Dr. John T. Graham."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "the Wythe County Red <mark>Cross</mark> school nurse, Miss Powhatan"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "the Wythe County Red <mark>Cross</mark> school nurse, Miss Powhatan"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [903.33, 672.19, 1056.65, 764.94], "bbox_id": "986ffdd8d4", "file": "AppomattoxNewspapers_1922-1923a_0074.pdf", "page": 1, "text": "WythevHle.  The Wythe County Child Welfare Camp has been formal ly opened under the supervision of the Wythe County Red Cross school nurse, Miss Powhatan Stone, with Miss Emma Murray, as head nurse, lu charge. The name was chosen by the board of directors for this nutrition camp at a meeting recently held at the office of Dr. John T. Graham."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "the Wythe County Red <mark>Cross</mark> school nurse, Miss Powhatan"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "the Wythe County Red <mark>Cross</mark> school nurse, Miss Powhatan"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1088.66, 899.14, 1425.02, 1031.49], "bbox_id": "c248000e09", "file": "AppomattoxNewspapers_1939-1943a_0385.pdf", "page": 1, "text": "Wyley Harvey, of Lynchburg, Col- j Cr oss. We thank God and let us also cny, spent Friday hunting with Trav- say to the American Red Cross, is and Peyton Harvey. They re p o rt, thank you! Truly te e American Red game very scarce. Cross is doing a great work forhu- . . i inanity and is w orthy of our sup- M r.and M rs.B . W . Harvey visit- i port. Now we are supplied with basis ed in the home of M r. and Mrs. R.  food f cr our poorer people for the L . Jennings Sunday. J next two months, with what we , _ __ V i have on hand before this second W herever people congregate, tne conversation is sure to tie of w ar and rumors o f war. We wonder when will it all end. We are all agreed as to hpw it will terminate, but when?"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "to the American Red <mark>Cross</mark>, is and Peyton Harvey."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "to the American Red <mark>Cross</mark>, is and Peyton Harvey."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1296.51, 1419.22, 1451.87, 1806.92], "bbox_id": "e248fb84a8", "file": "AppomattoxNewspapers_1902-1905a_0473.pdf", "page": 1, "text": "wui uic iiumcsi muiuou,  ufirtstlan Endeavor meeting was being i a few months back. The leader Wged upon those present to tell their ?wn spiritual experience, when a four teen-year-old girl, who had never taken ny part before, startled every one by lug with beaming face. O, I love Jesus with all my heart, were her wy words. The effect was electric, yfie after another testified to the great ness of their sins and the infinitely sreater greatness of Christs pardon. fS? neAglous contagion spread to other j,.a 8 es In fast widening circles. .J Roberts, once a ringleader in de- auchery, had recently given up coal  ln8 to study for the ministry, and in? otne tr a little rest. He was spired by the changed life of his wn to proclaim the gospel with a A m ! Yntlearfl of in a theological stu- Scores came to him for advice, nom he led to the cross. His services Din ase tor here, there and anothei ce. Wherever he went the way had wen prepared by faithful effort. Nc were large enough to accomim crowds, and the meetings a out of doors in many places -cry Sunday-school, every Christian aoeavor meeting became a revival The preachers were dls-es- The people conducted the .wrlngg as they saw fit. Songs, ex- Tjatious, prayers followed or mingled in one another, yet all without such D, .son 88 would mar the one im Dr10n of each meetingtbe evident 8 uih C?-iu Power of the Holy Spirit. v_ ? a Christmas time has never been n vn ln Wales. Instead of drunken- sertei i ?1 sin 8 ng tbe theatres de-  . their players stranded, religious the prevailing topic, sa- Th uo PRtrons. on-?? revival ia distinctively ethical, I 3 n ud enemies of years standing -  lied j- the meetings, old and"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "he led to the <mark>cross</mark>. His services Din ase"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "he led to the <mark>cross</mark>. His services Din ase"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [678.26, 1334.02, 774.7, 1353.94], "bbox_id": "9a59cf2323", "file": "AppomattoxNewspapers_1918-1922a_0575.pdf", "page": 1, "text": "writes Mrs. Mattie Cross white, of Glade Spring,"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "writes Mrs. Mattie <mark>Cross</mark> white, of Glade Spring,"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "writes Mrs. Mattie <mark>Cross</mark> white, of Glade Spring,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [482.41, 1531.97, 635.67, 1654.6], "bbox_id": "f45a684fd1", "file": "AppomattoxNewspapers_1902-1905a_0182.pdf", "page": 1, "text": "Wren Nests in Mans Coat. W hile two men were cutting the wood in a coppice near Chandlers Cross, on the borders of Herts and Bucks, England, they erected a tem porary shelter, in which one of them left his coat hanging for a few days. When he went to remove it he found i wrens nest cleverly built in one of the pockets. He replaced the coat, rad during the last week the bird has aid several eggs in the nest. The woodman has decided to allow her to Latch her eggs undisturbed."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "a coppice near Chandlers <mark>Cross</mark>, on the borders of"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "a coppice near Chandlers <mark>Cross</mark>, on the borders of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [791.29, 719.71, 946.27, 747.75], "bbox_id": "e1867adcc1", "file": "AppomattoxNewspapers_1922-1923a_0121.pdf", "page": 1, "text": "Wraps for Little Tote, in New Color Which le Cross Between Rose and Terra Cotta."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Wraps for Little Tote, in New Color Which le <mark>Cross</mark> Between Rose and Terra Cotta."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Wraps for Little Tote, in New Color Which le <mark>Cross</mark> Between Rose and Terra Cotta."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [733.46, 1521.23, 898.29, 1639.34], "bbox_id": "2507f76dd0", "file": "AppomattoxNewspapers_1912-1915a_0503.pdf", "page": 1, "text": "Wounded and Decorated With the Cross Of St. George. Moscow.Among the wounded who have arrived in Moscow from the front is Olga Krasilnikoff, a girl of 19 years. After taking part in 19 battles in Poland she was wounded in the foot. The girl enlisted under a mans name and this deception has just been dis covered. The Cross of St. George, fourth degree, has been awarded to her."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "and Decorated With the <mark>Cross</mark> Of St. George. Moscow.Among"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "and Decorated With the <mark>Cross</mark> Of St. George. Moscow.Among"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [335.32, 1526.09, 498.36, 1643.26], "bbox_id": "c7d7569313", "file": "AppomattoxNewspapers_1912-1915a_0403.pdf", "page": 1, "text": "Would Send Hospital Units To the Countries At Vyar. Washington, D. C.Red Cross head quarters announced that prompt re sponses have been received from Gov ernors, Mayors and presidents of com mercial organizations to the appeal for European relief funds. They express ed the hope that a sum sufficient to charter a big ship and send hospital units to the countries involved will be raised within a short time."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Vyar. Washington, D. C.Red <mark>Cross</mark> head quarters announced that"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Vyar. Washington, D. C.Red <mark>Cross</mark> head quarters announced that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.77, 762.21, 1180.51, 845.36], "bbox_id": "7573a1bbad", "file": "AppomattoxNewspapers_1922-1923a_0232.pdf", "page": 1, "text": "would, of course, be much stronger if arranged so that a circular hole was cut out of the cross pieces to fit over the end of the post, which could be trimmed down to three inches in diam eter. An iron pin run through the top after the cross pieces have been placed in position would prevent them work ing off the post."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "cut out of the <mark>cross</mark> pieces to fit over"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "cut out of the <mark>cross</mark> pieces to fit over"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [212.4, 433.6, 352.65, 490.55], "bbox_id": "ff844e16df", "file": "AppomattoxNewspapers_1902-1905a_0367.pdf", "page": 1, "text": "Would I had been, fair Incs, That gallant cavalier, Who rode so gayl.v by thy side, And whispered thee so near! We re there no bonny dames at home, Or no true lovers here, That he should cross the seas to win The dearest of the dear?"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "here, That he should <mark>cross</mark> the seas to win"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "here, That he should <mark>cross</mark> the seas to win"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [614.63, 1361.38, 778.13, 1488.16], "bbox_id": "666047cca4", "file": "AppomattoxNewspapers_1905-1912a_0188.pdf", "page": 1, "text": "Would Drop Old Glory. Harrisburg, Pa. Special.Asking-to be registered as the candidate of the Jesus Christ Party for governor, a man from a southwestern county whose name is not disclosed sent a emmun ca tion to the State Department. In his platform he declares for the substitution of the cross for the Stars and Stripes, the prohibition of all religions except the Christian, prohibition of low wages, like wise of gossip, substituting a flat 5 per cent, assessment on all possessions for other forms of taxation, and permitting women to vote."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "the substitution of the <mark>cross</mark> for the Stars and"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "the substitution of the <mark>cross</mark> for the Stars and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [185.76, 573.69, 362.77, 1775.73], "bbox_id": "5bca79a02f", "file": "AppomattoxNewspapers_1905-1912a_0014.pdf", "page": 1, "text": "would chance on the Corny half a dollar a day, and the lat ter took the place of the dollar-a-day man, who drank too much to hold his job, and accepted the otter and the red flag with an eagerness that almost made Mahoney wish he had knocked off an additional half dol nr. Cornys place was at the narre w crossing at Blank street, where n plat form of heavy planks had been built over the deep ditch of the subway works. At one end of the excavation was the hoisting engine house, and overhead the heavy wire cables carried the trolley car of earth or broken stone from the further end of the ditch to the dumping platform near the en gine. Beside the engineer was a window, and through this nperture he could see the boy with the flag at the cross ing, a long block away. He governed tue speed and the raising and lowering of the car according to the signal of that flag. Corny received his signals from the man who stood directly above the spot where the men were excavating, and who guided the swinging liox among the great pipes and drains aiul conduits which seemed to hang In a perfect network above the heads of the labor ers below, Besides keeping a sharp eye on the man, Corny was expected to be on the lookout for vehicles that wished to cross the ditch mid to allow none to cross while the loaded trolley wns run ning overbend. A bit of rock might fall from the car, or a horse might become frightened by the rattle of the trolley. The flagboy certainly enrned his half dollar. There was no time for sky larking, even had Corny been so in clined. But Maboney had been quite correct In his judgment of Cornys face life was altogether too serious to him for the flagboy to enjoy him self ns did other boys. When a person of fifteen feels the responsibility of forty-five resting on his shoulders skylarking Is a long way from his thoughts. The pitiable three dollars a week Mahoney allowed him was expected, with what Johhny could darn doing chores for the local store keepers and Ben could make selling papers to clothe, feed and house seven ravenously hungry, active growing boys and girls. It bad not always been so. Six months of trial and privation bad made a very old-fashioned boy Indeed of Cornelius Harney. The Ilarneys had only lived a year and a half In the eltv before the father died. They lntd come from  the old country, and after  hot man was taken, the mother pined more and more for the old English village where she had been born. She count do but little to help support the family, and soon the orphaned children raw her laid away also. Cornelius was the oldest boy. Mary, who was two years Ills senior, kept house for them and tried to keep the garments of the younger children de cently patched. Nobody seemed to want a boy of Cornelius age until be bad drawn the attention of Boss Ma honey at the underground works. Those three dollars looked big indeed to Corny until lie began to try to ap portion them outso much toward the rent, so much for food, and such a very little for clothing, and nothing at all for extras. Johnnys and Bens incomes were not to be depended upon, for they varied according to the num ber of errands Johnny could run and tile number of papers Ben sold. And to make sure of those three dol lars Corney had to be up at 6 every morning, rain or shine, warm or cold, and. be did not get back until ! at night. There certainly was no thought of play in the Ungboys mind. The re sponsibilities resting on bis young shoulders spurned Corny to do his best Ho quickly learned the signals by which tlie engine was governed, and lie was never inattentive when the trolley was in motion. Mahoney ad mitted that the kid was a good And for him but be still appropriated the other three dollars in Cornys envelope oil pay day. The timekeeper, who came up from tlie contractors office every afternoon to get tlie details of the days work from Mahoney, gave poor Corny a seri ous fright the very first day.  Wheres McAdo? asked the time keeper, briskly. He was a lively young fellow, who usually had a joke for the men, and be was known to be a rela tive of the contractor himself. McAdo was the name of the man who bad been flagging, and Corny knew it and trembled.  Hes no good, an Ive fired him. Mahoney declared, belligerently. He never seemed to like the timekeeper perhaps because he feared the latters eyes were sharply concerned in his em ployers interest. I dont believe Mr. Buttcrworth will stand for a boy to flag. Something might happen. Now, you let the lad alone, Ma"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "the flag at the <mark>cross</mark> ing, a long block"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "the flag at the <mark>cross</mark> ing, a long block"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [811.24, 1150.61, 988.38, 1784.71], "bbox_id": "e0c8bcbb14", "file": "AppomattoxNewspapers_1947-1949a_0355.pdf", "page": 1, "text": "Worlds Greatest Hymn Book T ET me write a nations songs, and 1 care not who writes their laws, said a famous man. The same thing can be said about re ligion. Let me write a churchs hymnbook, and I care not who writes their theologies. The hymns our mothers loved, the hymns we heard before we heard any other kind of poetry, the hymns that we have learned by heart and that become a part of our minds these mean far more to most peo ple than all the printed creeds. Now the Christian religion is a singing religion. Our very first hymnbook was the Book of Psalms, and all the hymnals since, down to the present day, grew out of this one book in the Bible. It is the greatest hymn book in the world not the long est nor. the oldest, but the great est in its influence for good upon mankind.    I Poetry Was in Jesus Blood  F OUR Lord Jesus himself, it truly can be said, poetry was in his veins. He came of a poetic family. His most famous ancestor, David, was a poet another royal ancestor, Hezekiah, wrote poetry. The book he knew best, the Old Testament, was full of poetry. His own mother Mary, before he was born, sang a song of her own mak ing, so beautiful that it is still sung in Christian churches and loved the world around. - When Jesus died on the cross, two of the last seven sentences that came from his lips were quotations from the Psalms. The poetry of his people was in his blood, for in his last agony the i words that came from his break ing heart were words first spok- I en by the poets of the Bible long , ago. j So it is always. Truth in song I will tarry long. Today and al-  ways, the parts of the Bible which  are most cherished, the parts most i often learned by heart, the parts  which we carry with us to the val- 1 ley of the shadow of death, are the truths set to music, long centuries ago, by inspired men who knew how to clothe truth with garments of shining and immortal loveliness, j Copyright by tbo InternationaI Council ol I Roligioua Education on boball ol 0 Proton- taut doMomiaatiooM. Raloaaod by WMU too- tMTOOj"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "Jesus died on the <mark>cross</mark>, two of the last"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "Jesus died on the <mark>cross</mark>, two of the last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [744.49, 1240.25, 1080.05, 1369.75], "bbox_id": "a89012105c", "file": "AppomattoxNewspapers_1933-1936a_0533.pdf", "page": 1, "text": "WORLDS BIGGEST CROSS WORD PUZZLE Worlds biggest  cross-word zle with cash prizes will be puz- fea-  le ased by the Virginia Tuberculosis tured in th e  September 6th issue Associatic  today indie J ted defin- 0f the BALTIMORE SUNDAY AM- itely that its program of education ERICAN. Dont miss this great treat. I rid preventive work throughout the state is sharing pronortionately in the general upswing of business. I .come from the sale of Christ- rnr.s Seals last season, based on re ports from all city and county bran, ches, so far has reached a total of"}, "highlight": {"text": {"matched_tokens": ["CROSS", "cross"], "snippet": "WORLDS BIGGEST <mark>CROSS</mark> WORD PUZZLE Worlds biggest  <mark>cross</mark>-word zle with cash prizes"}}, "highlights": [{"field": "text", "matched_tokens": ["CROSS", "cross"], "snippet": "WORLDS BIGGEST <mark>CROSS</mark> WORD PUZZLE Worlds biggest  <mark>cross</mark>-word zle with cash prizes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1475.5, 1276.3, 1635.08, 1973.1], "bbox_id": "4e7a786e27", "file": "AppomattoxNewspapers_1898-1902a_0019.pdf", "page": 1, "text": "worldly prospects for something which is of no particular present worth. Here to a young woman who hicharm . of tbo drawing-room. Now all through the social circle the whisper goes,  What a pity that suoh a bright. Ught should have been extinguished, tbuFcb a graceful gait should be crippled, W at such worldly prospects should be obliter ated. Ab, my friends, It can bo shown that religions ways are ways o f ploasant ness, ana that all her paths .Are peace that religion. Instead of being dark to doleful, and lachrymose, and reptihlve, is bright and beautlfti fairer than a dove, Its wings covered withtollver and its toathy-s with yollow go!V See. Yu the first place, what religion will do for a mans heart. I care not how cheerful a man may naturally be before conversion, conversion brings him up to a higher standard of cheerfulness. I do not say be will laugh any louder iM not ay but that be may stand back .oSJm some forms of hilarity in which 1 t once In dulged, but there comes into his soul an m- mense satisfaction. A young man, not a Christian, depends upon worldly successes to keep his spirits up. Now he to pros pered, now he has large salary, now he has a beautiful wardrobe, now he bas pleasant friends, now be has more money than he knows well how to spend everything goes bright and well with him. But trouble comesthere are many young men in the house this morning who can testlfvout of their own experience that somenmes to young men trouble does comehis friends are gone, hto salary Is gone, hto health to gone be goes down, down. He becomes 30ur, cross, queer, misanthropic, blames the world, blames society, blames tbo ehureh, blames everything rushes per haps, to the intoxicating cup to drown his trouble, but instead of drowning his trouble drowns bis body and drowns bis soul. But there is a Christian young man. Trouble homes to him. Does be give up? No. He throws himself back -on the re sources of heaven. He says, God is my Father. Out of all these disasters I shall pluck advantage for my sonl, All tbe promises are mineChrist is mine, Chris tian companionship to mine heaven is What though my apparel be worn out? Chrlit gives mo a robe of righteous ness. What though my money be gone? I have a title deed to tho whole universe In tiie promise, all are yours. What though my worldly friends fall away? Minister ing angels aro my bodyguard. What though my fare be poor und my bread be-scant? I sit at the Kings banquet. You nnd I have found out that people who pretend to ha happy are not always happy. Look young man cari- saturing the CbmSwh religion, scoffing at everything good, going Into roysterlng irunkenness, dashing tbe champagne bottlo to the floor, rolling tbe glasses Irom the barroom counter, laughing, houting, stamping the floor, shrieking. Is he happy? I will go to hto midnight pillow. I will see him turn the gas off. I will ask myself If the pillow on which he sleeps is as soft as the pillow on which tbr pare yonng roan sleeps, Abl no. TVlien he opens hto eyes in the morning will tbe world be as bright to him as to that young man who retired at night say ing his prayers, invoking Gods blessktog upon bis own sonl and the soul of his oElB rades, and father and mother and brmWer nnd sister far away? No, no. His laugh ter will ring out fr om the saloon so that you hear it ns you pass by, but it is hollow laughter in It is the snapping of heart strings and the rattle of prisin gates. Happyl That young man happy? Let him lilt high the bowl he cannot drown an upbraiding conscience. Let the balls roll through the bowling-alloy tbo deep ramble and the sharp crack cannot over power the voices of condemnation. Let him whirl in the dance of sin and temp tation and death. All the brilliancy of the scene cannot make him lorget the last"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "down. He becomes 30ur, <mark>cross</mark>, queer, misanthropic, blames the"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "down. He becomes 30ur, <mark>cross</mark>, queer, misanthropic, blames the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [385.9, 1102.06, 675.81, 1219.31], "bbox_id": "138762cc64", "file": "AppomattoxNewspapers_1922-1923a_0262.pdf", "page": 1, "text": "world. V I- Conditions of disciplesblp vs. ,,24 Will come after Me.  ill follow My directions nnd be Mv disciple. Deny Himself. Christ shows the apostles the nature of His kingdom. They must abstain from all indulgences which stand In the way _______  duty  Take up His cross. Who- thither, und it now ex- soever would follow Christ must be ,.i . ready to endure affliction and even death for His sake. 25. Whosoever acquaintance with bereave- ! 5 save. etc. Whosoever succeeds in obtaining the life of worldly comfort"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "duty  Take up His <mark>cross</mark>. Who- thither, und it"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "duty  Take up His <mark>cross</mark>. Who- thither, und it"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [379.44, 1433.81, 538.27, 1682.3], "bbox_id": "ace4a41d6d", "file": "AppomattoxNewspapers_1908-1909a_0053.pdf", "page": 1, "text": "world, Llgtt.Wfc AÏÏI __________ of the Hied. Cross cost 823,000, while operations of the Red Cross, borne by Notional Head quarters, amounted to 264,040. The remainder of the fiscal years expenditures were accounted for In insular and foreign operations  t which foreign disasters . In .Y ? the American Red- Cross served, absorbed 53,075 League of Red Cross Societies, 10.000 Junior Red Cross foreign projects, 74,065 assistance to lneular Chapters,  49 ,. 699 othey Insular sind foreign work, 54,763 ! supervision of settlce sc- ttvlttei and gênerai management, 270,629.27. - i m The total expenditures for the year ended June SO last were divided National Organisation, 7,381,869.35 local Chapters, 4,511,000. In the Tenth Annual Roll Call, November 11 to 25,.the publicité Invited to shgfe in this vast Work done in, their numt by enrolling In  this American Red Cross as inemhoee. Mi"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "AÏÏI __________ of the Hied. <mark>Cross</mark> cost 823,000, while operations"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "AÏÏI __________ of the Hied. <mark>Cross</mark> cost 823,000, while operations"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [697.91, 205.91, 866.78, 1180.74], "bbox_id": "465da6f0e2", "file": "AppomattoxNewspapers_1915-1918a_0550.pdf", "page": 1, "text": "work begin. With Ur. C. P. Marshall, president Miss Es telle Thornton, secretary, we I are going  over the top in buying Stamps. And then, too, the Red Cross work must go on. Our people are patriotic to the hearts core, and would be demonstrative, if we knew exactly how. Little Dan Kesler has a cute little sister, just one week old Mr. Harry Jennings is im- proving rapidly. Mr. Preston preached at Con- cord on Sunday afternoon. Mrs. Chris Jackson has been sick but is improving now. Her sister, Mrs. Wingfield, of Phe- x, spent Sunday with her. Dr. H. G. Chalmers visited friends in the neighborhood Sunday  Mrs. H. C Chalmers is visit ing friends in Farmville. There is something that makes us real glad when we think of it, and it is that MisB Estelle Thornton is at home. We dont want our teachers to seek government positions. Is it not better to raise their salaries? I heard aunt Patsy say  Heres yo ole bullet. Josh ef yer wants it come an git it, dont I gine fling it erway, nothin but cuisness nohow,sav in dat thing. You does de cu- isest doics I ever knowed any nigger ter do. Aunt Patsy was cutting some meat and she found a bullet in it. Uncle Josh said  Hole on dar, Patsy, doan fling dat thing erway, ceze date de very bullet me an Marse John used ter kill all ole Marsters hogs wid, an I alius got hit out each hog an kill tothers wid it die time I shot hit little too hard, buc I knowed we would fine hit when we out dat shoulder. I saw the bullet and it really looked battered and worn, but how much of Uncle Joshs sto ry was true I dont know. He took the bullet, wrapped it carefully in a piece of tinfoil and put it in a little bottle and stopped it up and put it away saying  You njay do yer gruntin out dar now, but I sav in dis bullet.1 An old white hog was out in a pen olose by. Uncle Josh said I mighty feard Mary Anns little gal is gwine have rheumatiz or sumthin wusser caze I seed her asettin on er rock, an dat brings bad luck, knows dat  Little Folks, did you ever see a chicken with three feet? An old hen hatched out a brood of little chicks and among them was one with a club foot with one toe,and the other foot good the third foot had just one toe. Its tail was flat like a ducks tail. During a thunder storm it got out of the hovel and was"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "then, too, the Red <mark>Cross</mark> work must go on."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "then, too, the Red <mark>Cross</mark> work must go on."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1076.42, 1572.26, 1370.51, 1632.21], "bbox_id": "253c830f16", "file": "AppomattoxNewspapers_1943-1947a_0082.pdf", "page": 1, "text": "Worjd War enlisted as a flying cadet. He entered the front line service early in 1918. He was awarded the Distinguished Service Cross for extraordinary heroism in action against superior enemy forces near Jametz, France.  He also was awarded the Silver Star for bravery. After the war he was commissioned in the regular Army and seved through all the grades. He was given command of Allied Air Forces m the Southwest Pacific in September 1942,"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "awarded the Distinguished Service <mark>Cross</mark> for extraordinary heroism in"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "awarded the Distinguished Service <mark>Cross</mark> for extraordinary heroism in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.9, 1643.97, 1588.08, 1764.36], "bbox_id": "646be26f17", "file": "AppomattoxNewspapers_1905-1912a_0190.pdf", "page": 1, "text": "Woodstock.  John Jewell, oi Riley cille, while attempting to cross from one ear to another was thrown from a fast freight on the Norfolk and Western and killed instantly, his neck being broken. Just a few minutes prior to the acci dent he was warned by his companion not to attempt to cross. Jewell had been working in the stone quarry near Martinsburg, W. Va., and 1 ing home by beating his v freight His body was sent home."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "cille, while attempting to <mark>cross</mark> from one ear to"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "cille, while attempting to <mark>cross</mark> from one ear to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1658.91, 750.78, 1823.24, 1591.52], "bbox_id": "9185fdde34", "file": "AppomattoxNewspapers_1892-1898a_0244.pdf", "page": 1, "text": "WOODSON MARTIN. Concord, Va., June 3, 1895 Seldom has it been our privilege to attend a more beautiful marriage than that which was consummated at Bethleham M. E. Church, last Wednesday evening, at 9 oclock the contracting parties being Mr. Wal ter B. Woodson, a young and rising merchant of this place, and Miss Minnie, the very attractive daughter of Mrs. Emma Martin, also of this town. Long before the appointed hour the church was crowded with friends and relatives anxious to witness this popular couple united in the holy bonds of wedlock. Promptly at the appointed hour the dnlect and in spiring strains of Tanhausers wed ding mach, under the masterly touch of Mrs. G. Norman Abbitt, proclaimed the entry of the bridal cortege. The order of the atteu dants was as follows Miss Nannie Wharton aud Mr Eddie Franklin Miss Sallie Ariing- on and Mr. Miles Shipman Miss Della Steele and Mr. Thesis Lindsay Miss Ruby Woodson and Mr. Rees Evans Miss Ada Staples and Mr. J. L Woodson Miss Evie Martin and Mr. Courtney Thomas Miss Jnlia Woodson and Mr. Edwin Franklin Miss Marie L. Ould and Mr. W.C. Tanner Miss Lula Conch and Mr. Orville Van B. Thompson The pretty little flower bearers enter ed in the following order Miss Katie Carson and Pearl Woodson Miss Jessie Martin and Evelyn Moore Miss Nellie Abbott, Gracie Cross and Johnie Martin. Then appeared the pretty ank blushing bride-elect, with beauti-e ful bouquet of rare spring flowers leaning on the arm of her maid of honor, Miss Florrie Arrington, who were met in front of the chan cel by Mr. Woodson with his best man, Mr. Jno. G. Fisher. There beneath a beautiful arch aud pendent bell of evergreens and spring flowers, this young couple was joined in the bonds of matri mony, bj the Rev. Mr. Parish,of the Methodist church. The wedding party, preceded by the ushers Messrs, W. L. Peet and R. L. Staples with a large number of invited guests re paired immediately to the hospitable home of Mrs. Victoria and Ann E Arrington where a sumptuous dinner awaited them. The happy couple departed Thurs day morning at 120 on the Norfolk and Western east-bound train for Richmond and other points of inter est, accompanied by the well wishes of a large circle of friends. Q u id N u n c ."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Miss Nellie Abbott, Gracie <mark>Cross</mark> and Johnie Martin. Then"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Miss Nellie Abbott, Gracie <mark>Cross</mark> and Johnie Martin. Then"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1792.81, 892.56, 2504.05, 1017.61], "bbox_id": "9bdb9a555e", "file": "AppomattoxNewspapers_1908-1909a_0495.pdf", "page": 1, "text": "WOODLAND Body types .to fit every hauling need. 50-horsepower 4-cylinder engine. New freely shackled semi-elliptic reer springs distribute load stresses. Wide, deep strong frame fives subctantlsl support for bodies. floating type rear axle for heavy service. 4-speed transmission. Tubular atari coupling shaft with heavy duty universale at each end. New bi-partlblc Miplltig removable main cross member permit easy servicing of dutch, transmission, aai eswpllng shaft. New comfort and safety to r the driver. TI ms  features and many others will convince you that the New Find Trucks can save yon money and give you added performance."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "bi-partlblc Miplltig removable main <mark>cross</mark> member permit easy servicing"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "bi-partlblc Miplltig removable main <mark>cross</mark> member permit easy servicing"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [482.14, 1090.47, 643.15, 1413.17], "bbox_id": "3050714410", "file": "AppomattoxNewspapers_1918-1922a_0555.pdf", "page": 1, "text": "wood lot, must devise some other way of holding the Christmas tree In posi tion. The easiest way to do this, if the tree Is not too- large and heavy, is to insert the trunk into the hole through the bottom of a wooden box, and either paint this box green or red or cover it with green or red paper. A starch box will hold up a small tree perfectly, but a somewhat larger box must be chosen for one of larger growth. If, in spite of all precautions, tlie tree seems too heavy and Is in clined to wobble, weight the box on either side with heavy stones. Some times the box is filled with sand, the trunk planted in that, and then the wooden cover nailed n place to make all very solid. If oneas any talent for carpentry, even of the roughest sort, an effective support can be made by nailing two pieces of wood in the shape of a square cross, holding the tree upon this and nailing cleats to both tree and support until it stands firmly. A very pretty effect can be obtained by covering the support of the tree and the floor directly around it with white cotton batting on which silver tinsel, called rain in most shops, has been sprinkled. This makes the tree look as if it were growing In a bunch of snow glittering in the sun."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "shape of a square <mark>cross</mark>, holding the tree upon"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "shape of a square <mark>cross</mark>, holding the tree upon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1746.67, 1097.18, 1851.88, 1426.57], "bbox_id": "4b01a2cd3e", "file": "AppomattoxNewspapers_1918-1922a_0554.pdf", "page": 1, "text": "wood lot, must devise of holding the Chrlstinj tion. The easiest way to tree Is not too large nl Insert the trunk Into tl the bottom of a woa either paint this hox g cover it with green or A starch box will lie tree perfectly, but a si box must be chosen fo growth. If, in spite of i the tree seems too b clined to wobble, weigll either side with heavy times the box Is filled trunk planted in that, wooden cover nailed n all very solid. If onehns any talent even of the roughest soi support can be made l. pieces of wood In t In square cross, bolding this and nailing cleats and support until it sinil A very pretty effect enf by covering the suppi and the floor directly ml white cotton halting on tinsel, called rain la nn been sprinkled. Tills in look as if if were growin of snow glittering in the"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "In t In square <mark>cross</mark>, bolding this and nailing"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "In t In square <mark>cross</mark>, bolding this and nailing"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1744.52, 1094.52, 1849.84, 1423.46], "bbox_id": "0f7453ebc8", "file": "AppomattoxNewspapers_1918-1922a_0553.pdf", "page": 1, "text": "wood lot, must devise . of holding the Chrlstml tion. 1 The easiest way to . tree is not too large ul insert the trunk Into ill the bottom of a vo either paint this box g cover it with green or A stnrch box will Ina tree perfectly, hut n box must be chosen f.... growth. If, In spite of il the tree seems too he 1 cllned to wobble, weigfl either side with heavy  times the box is filled trank planted In Unit, wooden cover nailed n all very solid. If oneclms any talent even of the roughest sor support can be made I pieces of wood in tin square cross, holding i this and nailing cleats and support until It stu A very pretty effect a by covering the supper and the floor directly a white cotton halting on tinsel, called rain in m been sprinkled. This m look as if it were grown of snow glittering in tin"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "wood in tin square <mark>cross</mark>, holding i this and"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "wood in tin square <mark>cross</mark>, holding i this and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [752.68, 1679.47, 963.31, 1707.77], "bbox_id": "de11d4089f", "file": "AppomattoxNewspapers_1954-1955a_0249.pdf", "page": 1, "text": "Wont you help us by joining the Red Cross Today."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Wont you help us by joining the Red <mark>Cross</mark> Today."}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Wont you help us by joining the Red <mark>Cross</mark> Today."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [718.29, 1374.33, 870.59, 1522.53], "bbox_id": "4f7c8b9e4d", "file": "AppomattoxNewspapers_1922-1923a_0095.pdf", "page": 1, "text": "Women Now Eligible to V. C. A royal warrant consolidating and extending provisional royal warrants regarding the Victoria Cross was pub lished recently in the London Gazette. The principal feature Is that women are now made eligible for decoration, It being ordained that matrons, sis ters, nurses and the staff of the nurs ing services and other services per taining to hospitals and nursing, and civilians of either sex serving regu larly or temporarily under the orders, direction or supervision of any of the armed forces of the crown, shall b eligible to tbe cross."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "warrants regarding the Victoria <mark>Cross</mark> was pub lished recently"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "warrants regarding the Victoria <mark>Cross</mark> was pub lished recently"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [342.53, 717.76, 607.55, 983.01], "bbox_id": "4cfb590217", "file": "AppomattoxNewspapers_1974-1975a_0184.pdf", "page": 1, "text": "Womans Club Names Winners In Arts  Crafts Show  The Womans Club of Appo- j Jmattox, meeting in regular  Jpession on Monday. Feb. 3. held jts annual Arts  Crafts Show. 1 5 5 Winners of blue ribbons in jhe show were Kit Corner - 3toma Moore for a crewel j pillow Crewel - Alice Reiners- j 3jon for a Norweigen Cross- I pillow Quilting - Isabelle Coleman for her entry of a Rouble  wedding ring quilt Crocheting - Edith Scruggs.af- j an Decorative Crafts  Isa-  jelle Coleman, owl painting in I dommode frame Pat Johnson, Jduck painting Decoupage P la-1 S8 - tfifpggsleiriooin j fiook of childrens pictures? I foology  Dot Davidson, pin j Cushion made out of tuna can I"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "3jon for a Norweigen <mark>Cross</mark>- I pillow Quilting - Isabelle"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "3jon for a Norweigen <mark>Cross</mark>- I pillow Quilting - Isabelle"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1778.67, 242.04, 2255.89, 575.03], "bbox_id": "aef4442a6e", "file": "AppomattoxNewspapers_1912-1915a_0113.pdf", "page": 1, "text": "Woman Surely Could Not Be Accused of Having Aqy Lack of Causón. Weekly Review et Trade and Market Reports. One day a very nervous, timid-look ing woman, accompanied by a robust farmer, apeared on the platform of a little railw ayat , a remote country town. For a tlmé shedevoted her at tention to the time table, but she did not find there the information she sought, and she stepped up to the sta tion master âa he came out of the office. , Will you please ten me if the three- fifteen train hast goiie yet? she asked, In apparent concern. Yea, about twenty minutes ago, he replied. And when will the four-thirty be along, do you think? Why, not for some time yet, of course. Are, there any expresses before then? Not oné. Any freight.trains? No. , Nothing at dll? Nothing whatever. Are you quite sure? Certainly I am, or I wouldnt havé said so. i   V. fy Then, said the timid woman, turn ing to her husband. I think well cross the tracks, Wilfitaa-!-Voutbs Companion. ijjtfpraatefeHh  i, .ji"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "husband. I think well <mark>cross</mark> the tracks, Wilfitaa-!-Voutbs Companion."}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "husband. I think well <mark>cross</mark> the tracks, Wilfitaa-!-Voutbs Companion."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [884.71, 367.37, 1352.34, 414.21], "bbox_id": "72bc9e4e40", "file": "AppomattoxNewspapers_1898-1902a_0338.pdf", "page": 1, "text": "Wo oiler for sale the increase of our herd J JjC a t- B a g s r e n t - f l C e. O n w h e a t tO b e g T O U n _ sion I pay ic. per bushel ferryage. Cross t  SE i T m E  you can most conveniently do so, and  D u p p P r o p . Yours to serve faithfully, E  J  T U R N E R , _ _"}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "ic. per bushel ferryage. <mark>Cross</mark> t  SE i T"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "ic. per bushel ferryage. <mark>Cross</mark> t  SE i T"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [309.58, 713.56, 475.78, 994.05], "bbox_id": "6306678bdb", "file": "AppomattoxNewspapers_1912-1915a_0344.pdf", "page": 1, "text": "Wlth the exhaust gas heater some form of regulating valve should be used and a few cross partitions in the inlet pipe at the point where the heat is applied help heat the center of the column of the entering mixture. Gaso line will stand about eighty-five pounds compression without pre-ignltlon. Kerosene, however, will not stand over seventy pounds unless a small quantity of water is taken into the cylinder with each charge. The customary man ner of doing this is to employ either a separate small carburetor for the water or a small valve attached to the regular carburetor. In a few engines the water Is Injected directly Into the cylinder. The proportion of water employed is about one and one-half pints of wa ter to each gallon of kerosene. If the water is not used when the motor has the usual compression employed for gasoline the motor will pre-ignite and Is very apt to burn out the connecting rod bearings. It is not generally known that water may be used to advantage with gasoline In about the same pro portion with considerable saving of fuel."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "used and a few <mark>cross</mark> partitions in the inlet"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "used and a few <mark>cross</mark> partitions in the inlet"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1746.25, 957.93, 2020.77, 1093.23], "bbox_id": "f8f5cdda5c", "file": "AppomattoxNewspapers_1974-1975a_0111.pdf", "page": 1, "text": "Wljen the Red Cross Bfoodmobile made Its1 tfisit  AfvpmnattoJtCounty Tuesday from noon until 6 p.m., the quota was set at 110 units of blood to make our county 100. 132 donors came out and each gave a unit of blood thus making this visit a BIG success. Shown above, left to right, Mrs. Lucy Harvey,1 Chairman of the Blood Program for the county, congratulates James Mann, the donor of the 110th pin. of blood Patsy Butler, the donor of the 111th unit, is being congratulated by Bill Hunter, Appomattox County Chairman of the Red Cross who had just donated his 48th unit of blood and on the right is the Rev. Earnie Lucas, newly appointed Recruiting Chairman for the county."}, "highlight": {"text": {"matched_tokens": ["Cross"], "snippet": "Wljen the Red <mark>Cross</mark> Bfoodmobile made Its1 tfisit"}}, "highlights": [{"field": "text", "matched_tokens": ["Cross"], "snippet": "Wljen the Red <mark>Cross</mark> Bfoodmobile made Its1 tfisit"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1753.86, 444.47, 1922.59, 1021.77], "bbox_id": "9ae9ee1bcf", "file": "AppomattoxNewspapers_1892-1898a_0033.pdf", "page": 1, "text": "witness said Beatty suggested croton oil, and I said no, that waa dangerous, and Dempsey said he knew a powder which would be better. Dempsey said he had used these powders to Chicago and he had broken a strike to four days. It is not dangerous. Dempsey said be would guarantee us fifty dollars each and our expens. Wegot no powders that day. We then left tbe hall together and talked about it. Beatty said we were to get fifty dollars each, and we were to get a gold watch and chain if we went. David son sid that of tbe fifty dollars promised him he got bat fourteen dollars. Attorney Brennen subjected the .witness to a severe cross eassitStioa, hut did not materially weaken Us evidence. Davidron, however, admitted that he was arrested late in November and taken into the St.- Nicholas building and waa sworn, and told the story he had just told. Then he was released. Gallagher was arrested before that. He said they had it down to black and white, and he had to tell all he knew. Mr. BrennenAre you to get a diamond watch for this? Oh, yes I guess so like the one I got from Dempsey. Captain BeckYqu were promised noth ing for coming here, were you? No, sir. J. H. Ford, a detective, swore I know Beatty, Gallagher and Davidson. On Dec. 1 1 heard a conversation between Beatty, Gallagher and Davidson, to which Beatty told abont the powders and .what they con tained. Gallagher said he believed if Dempsey was home the strike would be won, but Beatty said he thought not. I heard Gallager say Tom Brady first sug gested croton oil. On Dec. 4 1 overheard a talk between Gallagher and Beatty, which was about the same as the former one. Beatty said Turkish rhubarb end snuff was in tha powders and it was not necessary to tell the rest. Gallagher said he could take the powders and go west add break np some strike there, and told Beatty to go to Homestead next day and get the receipt if he had to pay five dollars, as there was money to it for both of them.  Louis Welters, steward of the restaurant to tbe Homestead mill, testified that he noticed unaccountable sickness soon after employing Gallagher as a cook. He said that to spite of the best of food he and his wife become very ill, and bad never fully recovered. He had several times seen  Beatty talking to Gallagher to tbe mill. Beatty was held in 5,000 bail for trial at court. - _____ _ A Flood Test Sait. P ittsburg , Dec. 19.Suit has been en tered to the United States circuit court agtenstthe South Fork Fishing club by Jffiies Jenktos and wife, of Youngstown, O in the right of Mrs. Jenkins for 20,000 damages for injuries received to the Johns town flood. This is the first suit ever en tered directly against the South Fork club for its connection with the flood, and is re garded as a test suit."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "witness to a severe <mark>cross</mark> eassitStioa, hut did not"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "witness to a severe <mark>cross</mark> eassitStioa, hut did not"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1345.24, 1309.82, 1633.9, 1417.31], "bbox_id": "a236014c27", "file": "AppomattoxNewspapers_1952-1954a_0485.pdf", "page": 1, "text": "with white border and in the cross were stars of white or for each state. The flag mak- were optimistic putting in stars elude Missouri and Kentucky as federate States. The South kept arrying 13 stars, but Lincoln tively kept a bare majority in states for the Union side. 1he new flag took on right off. FALWELL WELL CORPOIfeneral Pierre Gustave Toutant"}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "border and in the <mark>cross</mark> were stars of white"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "border and in the <mark>cross</mark> were stars of white"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1673.03, 1281.3, 1843.73, 1607.39], "bbox_id": "b813bc3699", "file": "AppomattoxNewspapers_1943-1947a_0179.pdf", "page": 1, "text": "With U. S. Naval Forces On The Rhine.- Shelton C. Gallier19, seaman first class, USNR, was among the men of our amphibious Navy who helped carry Allied ar mies across the Rhine. He is the son of Mrs. Annie GaPer, R. F. D. f, Appomatox, Va. Nevor be fore had the Army called a the Navy to heln it cross an inland river. The Navy did the job 200 miles from the nearest ocean. Gal- lier was thus pari of the - forces which made Naval history. He and his fellow amphibians trained se cretly for months along smaller rivers in France and Belgium. Thqy even wore army uniforms and helmets, and slogged through mud with he doughboys. Even their boats were disguised.. hulls painted the Armys olive- drab. Many of the boats were trans- ror ed as far as 300 miles, along blasted roads, makeshift t bridges, and village streets. Manned by Qallier and his mates, LCMls and LCVPs are still racing back and forth across the Rhine, their bow- ramps disgorging soldiers, tanks, runs and supplies on the east bank for the final drive through Germany."}, "highlight": {"text": {"matched_tokens": ["cross"], "snippet": "Navy to heln it <mark>cross</mark> an inland river. The"}}, "highlights": [{"field": "text", "matched_tokens": ["cross"], "snippet": "Navy to heln it <mark>cross</mark> an inland river. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
