{"document": {"bbox": [1679.48, 452.63, 1844.48, 894.46], "bbox_id": "9023c3e65f", "file": "AppomattoxNewspapers_1918-1922a_0080.pdf", "page": 1, "text": "Whereas, Since the last meeting of the Citizens Party I of Appomattox County, Dr. D. Mott Robertson, the Chairman of the Party, has been taken from us by the hand of death therefore be it resolved by the Party this day assembled in mass meeting in the Court house at Appomattox as fol 0 vs, to-wit I That in the death of Dr. Robertson the Citizens Party has sustained a great loss.  His devotion to the principles of the Party, his tireless enery and effort in behalf of its principles, his fearless courage under all circumstances and 1 gainst all obstacles, in behalf  of what he believed to he right, and for the welfare of all the people of Appomattox county, endeared him to us all individ ually and collectively. The memory of his life and work will long remain, and be an inspiration to the living in the further pursuit of the work which his untimely death has left unfinished. II. That the sincere sympa I thy of the Party is hereby ex tended to his Widow, Family, and Relatives, who must so  deeply feel the sorrowful affLic tion which has befallen them Pr. Robertson was a prominent citizen of our county. His life was a useful one, and he leaves behind tbe respect and esteem of a multitude of friends. The world is better that he has lived in it."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Appomattox County, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the Chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Appomattox County, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the Chairman of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [252.49, 1495.49, 576.39, 1846.34], "bbox_id": "b7f5baad78", "file": "AppomattoxNewspapers_1918-1922a_0087.pdf", "page": 1, "text": "Whereas, our beloved brother, Dr. D. Mott Robertson, has gone from us to join the hosts above therefore be it resolved by the Fourth Quarterly Con ference, of t h e Appomattox circuit, 1. That we greatly miss our brother, who was so faithful in attendance and in the perfor mance of his duties, and feel that our charge has sustained a gieat loss. II That we hereby extend to his family our heartfelt sympathy in their sore bereave xnent, and pray that He who tempers the winds to the shorn lam b may have them in his tender care III. That these resolutions be recorded, a copy sent to his fam ily, and a copy to the Rich mond Christian Advocate and tbe Times-Virginian for publi cation. C. W. T homas , M ilton isbell , A. B. J. R ice . _ ,  .... , Farmers Good Wrk. Somo people find it impossible to do The President is having large two things at the same time. The Crowds tO hear him whereve he j farm er often does four, and does them appears in defense of the treaty 16mile8 aU at once. of nations. V 1 _ _______________"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "our beloved brother, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, has gone from us"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "our beloved brother, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, has gone from us"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [745.7, 247.22, 1276.17, 816.2], "bbox_id": "fdba90855c", "file": "AppomattoxNewspapers_1915-1918a_0015.pdf", "page": 1, "text": "We see that a movement has been started to put into the field an independent ticket against the nominees of the Democratic Party, nominated according to the primary election law of the State of VhginM, and who are entitled to the support of every Democrat in the county. We the Democra tic. County Committee, therefore address this appeal to the Democratic voters of the county. The Democratic Party is in power in the Nation, State and County. By reason of the splendid and patriotic administration of President Wilson it is likely to re main in power in the nation for years to come. By reason of its splendid administration in State affairs for many years, its lease on power in the State of Virgina is indefinite. No less indefinite is the control of Appomattox County by that Party, because its control has enured -to the benefit of the people and the upbuilding of the county. Since 1902 there has been no serious opposition to the Democratic party in tjhis county and the result has been a great development in our county along all lines. Ve notice published in the Times-Virginian, a call is made by Dr. D. Mott Robertson inviting the people to attend a meeting at Appomattox Court House on Friday, August 20th, for the pur pose of nominating a full ticket in opposition to the ticket nominated in the Democratic primary. This movement purports to be by independents but from the personnel of the leaders it smacks of Republicanism. The call invites all voters of the county to attend who believe in low taxes the election of Dis trict School superintendents and school trustees by the people who are opposed to the issuing of county bonds and who favor the one-room schools having as long session as the other schools. These are general propositions, without details of how their accomplishment can be brought about, and probably many of the voters are in favor ,of one or more of them. Certainly everybody is in favor of a lower tax rate if the governmental affairs can be run on such a rate without seriously impairing the progress of the State or County. Many of our citizens are in favor of election of district school superintendents and school trus tees by the people, and we have no doubt if a sufficient number of citizens would so petition, the re presentative ot this county would introduce in the Legislature an amendment to the Constitution providng for the election of district school superintendents by the people, and upon a similar petition would introduce a bil in the legislature providing for the election of school trustees by the people. There is no question before the people as to the issue of county bonds as there is no need for or demand for such an issue in bur county. We have no doubt every citizen of Appomattox would be in favor of the one-room schools having as long sessions as the other schools of the county if that could be done without increasing the rate of taxation or reducing the length of session of the other schools. The call is inconsistent in that on one hand he advocates lower taxation and on the other a larger expenditure for school purposes. You may get one but you cannot get both you cant have longer school sessions without paying an additional amount of money for them and this money comes in the shape of taxes from the people. Our Democratic Nominees will go before the voters at the November election upon their re cords with the belief that the masses of the people, who think at all, have approved and will ratify their policy by reelecting them. Neither will the voters be misled by any insinuations and fault-find ing proclamations, of that coterie of citizens who are out of office, and public favor, and who are seek ing an issue upon which to get in. We appeal to the Democrats and the thoughtful independent voters not to allow the Republican leaders of the county and a lew disappointed Democrats to lead them into the Republican party."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "is made by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> inviting the people to"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "is made by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> inviting the people to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [394.55, 274.38, 564.8, 1425.57], "bbox_id": "ee3518863a", "file": "AppomattoxNewspapers_1892-1898a_0242.pdf", "page": 1, "text": "We did not, in last weeks issue, give our readers an account of the occurrences at the Spout Spring recinct on election day, because we did not know, when we went to press, the true facts in the case and preferred to say nothing on the sub ject until we were fully informed thereon. We have heard the statements of the three judges and constable, F. Martin, all of which we give as well as the general facts we have gleaned that our readers may draw their own conclusions. The election at this precinct be gan in a quiet and orderly manne with Messrs. Lantech Jones, It. G Whorley and G. W. Diuguid as udges, Mr. F. L. Martin as consta bleand Messrs. F. B. Jones and John Overton as clerks. After nine votes had been regularly polled, negro named Henry Hughes weut into the booth to get Constable Mar tin to fix his ticket. Mr. Martin told him he would assist him by pointing ont the names to him. Thi Mr. Martin d id and poiu ted c u tTren tl name and Floods name both of which he scratched and then pointed out Smiths name which he scratche when the negro stopped and said You have scratched Mr. Colli us name, the very man 1 wanted vote for. The constable replied, You are a d ----- -n liar  if you dont like that ticket get anothe one and fix it to suit yourself. The negro then folded the ticket up and without makiug the slightest com plaint voted it. He weut out and iu about ten minutes Mr. E. F. Col tinswent into the election room and demanded the removal of the con stable, on the ground that he was not treating him fairly. The judges refused to make the removal. After short interval Collins, D. V McKinney and Hughes went int the room and behind them on the porch and on the ground was crowd of between twenty and thirty McKinney in a very excited way de maiided the removal of the consta ble and threatened blood-shed if he was not removed. The judges again refused to remove him, when Me Kinney and his backers grew mor violent. Mr. Diuguid, the liepuii can judge,was m favor of the rernov aud finally Mr. Whorley, because he thought otherwise that violence would be done the constable, advis ed him to leave. This the consta ble refused to do. But Mr. Whor- ieys suggestion to Martin, that lit leave, being construed iuto his con sent to his removal he was hustled out anti a Populist constable putin. At the time of this occurrence there was but one Democrat ou the grounds, besides the election officers. Mr. Martin was not a.new consta ble, but the same one who acted at the same place last Fall and one Whtr gave satisfaction tw-all parties, as is shown by the depositions of Dr. D. Mott Robertson and Mr. E. F. Collins, both of whom testified iu the Yost-Tucker contest, to his fairness and honesty. Here is what the officers of elec tion say about the occurrence. Mr, Lamech Jones appended to the certificate on the poll books the following statement Mr. K. G. Whorley also signed this statement, but later scratched his name off as he was one of the Commissioners of Election. The statement is as follows  As Judges of Election at Spout Spring, at the election held for officers, May 23d, 1895, we wish to make a statement as to the removal of Fitz Lee Martin, the regularly appointed constable."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the depositions of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and Mr. E. F."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the depositions of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and Mr. E. F."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2237.98, 529.61, 2397.18, 648.46], "bbox_id": "2674b4bdbf", "file": "AppomattoxNewspapers_1892-1898a_0059.pdf", "page": 1, "text": "V IRGINIA InthoClrouit court of Appo mattox oouuty 3 The Board of SuperiSors o f . Appomattox county AOAINST    a S . H, c. Shearer, late Treasurer of Appomat- tox county, J. it. Fraftklin, H. E. Gilliam, Martha J. Franklin and W. W. Statham. his sureties, and D. Mott Robertson. EXTRACT FROM DKORKE AT THE OEC. TERM 91. On consideration whereof the court doth adjudge, order and decree that this causo be ferreo to one of tho Commissioners of this referrcHPJVniivmpnMPmpMiarempiniMPMmp court, with direction to take,state and settle the accounts of tho defendant, H.O, Shearer, os late Treasurer of Appomattox oounty, in so far as the plaintiff is oneorned thoreiu frote thè beai nñing of his term of ornee, July 1st, 1887, until his removal therefrom  and ft"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Statham. his sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DKORKE AT"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Statham. his sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DKORKE AT"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2232.25, 752.19, 2391.46, 976.26], "bbox_id": "c8918b8497", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "uibginia . 1 in tbe Circuit court of Appo mattox oounty. The Board of Supervisor of Appomattox oounty. AGAINST H. o. Shearer, late Treasurer of Appomat tox oounty. J. H. Franklin, H. B. Gilliam, Martha J. Franklin and W. w. s tat ham, ms sureties, and D. Mott Robertson. EXTRACT FROM DECREE AT THE DEC. TERM HI. On consideration whereof the court doth adjudge, order and decree that this oausebe ref erred to one of the commissioners of this oourt with directions to take, state and settle the account of tbe defendant, H.C. Shearer, as late Treasurer of Appomattox oounty, in so far aa the plaintiff is concerned therein, from the beginning of his term of oflioe, July 1st, 1887, until his removal therefrom  and ft is ordered that the mid H. C, Shearer do lay before said commissioner a full statement of bis transactions as suob Treasurer during bis term of olBoo, including all books and papers pertaining to his said office. EXTRACT FRO It DECREE ATTHl-JuNS TERM, !iS And It is ordered that the cause be referred to R. B. Poore, as a special commissioner, to take the accounts herein ordered. com h iss to Bits O f f ic e , I A ppomattox G. H., V a ., June 19,1888, f Notice is hereby given to the parties to this suit, that I have appointed July 22d, 1886, as the time and tee law office of H. D, Flood, at Appomattox 0. H., Va., as the place foa tee execution of thh said order of referenoe, and"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ham, ms sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DECREE AT"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ham, ms sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DECREE AT"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1146.22, 172.3, 1312.62, 1193.78], "bbox_id": "d5a248e1f2", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "to run less than nine months we would lose about 3,300, which we get from tiie State and if the ihoolsi at Stonewall, Oakville, ower Mill, Vera, and Pamplin were run less than eight months we uld lose a considerable amount of mey that comes from the State i-easury, and which, if we did not et it, would go to schools in other unties of the State. He complains about the debts we fowe for school buildings. The bool hoards of the County do owe ePLlterary Fund for money bor rowed to aid in building the Appo- mattox high school, the Stonewall high school, and the graded schools at Oakville, Tower Hill, Vera, and Pamplin, but they are paying what they owe as it falls due, and the in terest on what they owe, out of the school levy, and will continue to do so. We also owe the Literary Fund for part of the money necessary to build the dormitory at Appomattox but we borrowed tiffs money on 15 years time at 3 interest, and the small rental charged teachers t and scholars for rooms in this dormitory will pay the interest and retire the debt as jt matures. This is un doubtedly a good business proposi tion, but no sound business proposi tion ever penetrated the head of D. Mott Robertson. The Appomattox high school, in eluding grounds, building, and equipment, has cost not less than 30,000, over twice as much as the court-house and jail cost. The County of Appomattox has only subscribed 2,000 of this amount. The rest of it was given by the State subscribed by patriotic citizens, anc borrowed from the State. The original amount we borrowed to build this school was 7,500. The interest on this and 4,500 of the principal has been paid out of the school levy. Future interest and the other 3,000 will be paid in the same way. A safe business proposition oi! this kind in the interest of the children of Appomattox County does not appeal to D. Mott Robertson because he is opposed to the children of any part of the County havin the same advantages the children of other counties have at least, his letter justifies the conclusion that such is his opposition. We are for the schools, for good schools all over the County, and with the present rate of taxation, before many years roll around we will have good schools within the reach of every child in the County, . Dr. Robertson alludes with much bombast to the time when he was Treasurer, as if he ran the whole business. We know that the Boar of Supervisors to which he refers Messrs. Ligon, Thornhill, and Jones were .capable and honest officials and progressive men, and un doubtedly would have done more for the development of the County if Dr. Robertson had promptly paid over the taxes he collected. We herewith append an extract from the Board of Supervisory records mdp in 1900, showing that Dr..BeSetisoh had retained in his possession money belonging to the County for evry year he had been Treasurer To bal. due County, Levy 1891 ........... 1,276.84 To bal, due County, Levy 1892 .............................. 1,30579 To bal. due County, Levy  193 3,071.86 To bal. due County, Levy 1894 . 1,152.38 To bal. due County, Levy 1895 ................ .. To bal. due County, Levy 1896 ............................ To bal. due County, Lev? 1897 . ................."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "penetrated the head of <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. The Appomattox high school,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "penetrated the head of <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. The Appomattox high school,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2154.48, 970.67, 2315.44, 1539.22], "bbox_id": "1ecf7d7393", "file": "AppomattoxNewspapers_1902-1905a_0140.pdf", "page": 1, "text": "The Prim ary Plan. Our primary plan requires tha one of the judges of election shall propound two questions to every per son who offers to vote. These ques tions are to be asked every persoi who offers to vote, even of the mem bers, of the Democratic committee and even of Dr. D. Mott Robertson the chairman of that committee s no person, from the highest 10 th humblest, can possibly tuke offeno on the ground that he is being die criminated against. The first question is,  Are you n DemocratP     .   The second aud last question ii-  Will you support tile uuminees o this primary? This is propel When the ticket ie nominated, th whole ticket become the Democrat ic ticket, and every person 4 . ho hai helped lo make that ticket ought t stand by it as a whole. These ruhs are liberal. A Repub lican of yesterday can become a De mocrat to day, and vote in this pri mary. He may never have voted oui ticket iu his life but, if he lias de termiuid to act with us in the fut ure, he is eligible. This does not mean that .he will always be a De ruociat, because he may again change his views and become a Republican  but. it simply means that bis present intention is to act with the Demo cratic party. Our political contests for years to come will be settled in Democratic- primaries. The elimination of tin- negro vote has fixed them, and thi fact accounts for the liberal rule.- adopted by the Democratic commit tee. Its members knew that then were many men who had heretofon acted with tbe Republican party who should and would in future ac with the Democratic party, becausi they are too intelligent to cut them selves off from all participation in the selection of their public officials and tbe only way iu which they can give expression to their choice is in our primaries. Let all such men come in. W give them a hearty welcome.Tb Southside Virginian."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "and even of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> the chairman of that"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "and even of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> the chairman of that"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [768.24, 1109.65, 926.24, 1298.32], "bbox_id": "b712f35821", "file": "AppomattoxNewspapers_1898-1902a_0303.pdf", "page": 1, "text": "The Mass-fleeting Last Thursday, There was a large and enthusiastic masi-meeting held here on court day to elect-delegates to the congression al nominating convention, which is to meet in Buena Vista August 1. The meeting was called to order by Chairman S. L. Ferguson. Dr. D. Mott Robertson was then elected permanent chairman, with Dr. Thos. R. Rucker as secretary. The members of the different dis tricts adjourned, on motion, to sepa rate rooms, aud nominated delegates to the convention. A motion was made, aud unaui-"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "S. L. Ferguson. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was then elected permanent"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "S. L. Ferguson. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was then elected permanent"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.16, 1535.31, 1671.21, 1739.96], "bbox_id": "695a87c796", "file": "AppomattoxNewspapers_1892-1898a_0217.pdf", "page": 1, "text": "the following was appointed mem bers of the last named committee  H. D- Flood, W. C. Franklin, J, R- Atwood, D. Mott Robertson, W. D.  Thornton, the president and secre- j tary. This committee will go to j Washington early uext week. While  it is too late to hope that the park i hill can he gotten through at this j session, yet if it can he referred and, a favorable report from the com mittee secured, it may make its pas -, sage by the next Congress more easilv an quickly accomplished. Tlie following committee on by laws for the Association was appint- ed  Joseph Button, S. C. Stratton and R, F, Burke."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson", "D"], "snippet": "Franklin, J, R- Atwood, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, W. <mark>D</mark>.  Thornton, the"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson", "D"], "snippet": "Franklin, J, R- Atwood, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, W. <mark>D</mark>.  Thornton, the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [824.13, 215.96, 1440.91, 532.45], "bbox_id": "d0e25851e0", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "the figures to me, he referred me to Mr. R. F. Burke, Treasurer I made application to Mr. Burke a i -  th e nrorpri -7, QePoéi month since, he promised me the Appomattox, Va., Oct. 18, 1915. P e o n n t v   6 tre  3 figures two weeks ago but I have To the Voters and Citizens of Ap-1 T . or other fugS not received report as yet. Why pomattox County Î Î K Î iJJidiiSV h 4 to 5 this holding back information that My attention has been called to order.jiend.ng the appiicJS the people are entitled to know? a letter signed by Mr. S. L. Fer-1 ,  . , the purpoJ When Dr. D . Mott Robertson gUSon in which he very adroitly  V 311 t h  a r e rahT to be uses statements which by .some Provided, however, tUt 3 remembered period when school might be construed as a. denial of I . - , he six teachers had to discount their war- what I most emphatically state  1 . .. f hecountyjj rants, thé rate of school taxation I a fact. I have repeatedly stated! P _ ue- was 15 cents. in this county and elsewhere that I . i I would say in reply to this on Jan. 0 th, 1914 Mr. S. L. Fer-1 COPIESFROM THE SENATl that if there be any school teach-1 guson wroteme a letter mvitmgl JOURNAL  ers who had to discount their war-1 me to a conference at the C._H. on M ONDAY, M arch 2 ltuij A f TEKNOOU SE 88 I 0 V some mailers ui      36,670 26, under R. F Burkes rants as stated above if they will Friday, Jan. 9th, 1914 to discuss adm inistration for only t w o senj me the amounts of discount with you me some matters of sears. Now, Mr. Voter, who has m is-represented this question of taxation D. Mott Robertson and the C itizens Party, or jh e Supervisors, viz L. E. Sm ith, 0. M. Drinkard and M. W. Oar son. W hy, this m isrepresentation of the peoples affa rs to the people. Are n ot the peop!e en titled to the truth, the whole truth and nothing but the"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the purpoJ When Dr. <mark>D</mark> . <mark>Mott</mark> <mark>Robertson</mark> gUSon in which he"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the purpoJ When Dr. <mark>D</mark> . <mark>Mott</mark> <mark>Robertson</mark> gUSon in which he"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [368.14, 1555.58, 532.99, 1783.77], "bbox_id": "022e7f0f37", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "The Farmers In stitu te. .  At at meeting held here court day of the committee on Farmers In-, stitnte for this county, the subjects for discussion, plan, aud date for holding same were discussed by the members of the committee, and a complete organization was perfected as follows C ommittee . A. H. Clement, chairmen. S. L. Ferguson, secretary. Hon. H. D. Flood, Judge D. A. Christian, W. H. Ligon, Maj. J. W. Flood, J. K. Hannah, J. R. Horselev, Dr. D. Mott Robertson, Dr. T. W. Evans, L. E. Smith and J. F. Pur- dum. The following committee ou pro-"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "J. R. Horselev, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Dr. T. W. Evans,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "J. R. Horselev, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Dr. T. W. Evans,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [249.07, 447.91, 413.06, 1223.26], "bbox_id": "1024d6fe6d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "TH E COUNTY CLERKSHIP. A right pretty political fight is to take place in this county for the clerkship, which is the best-paid office within the gift of our jieople The present clerk holds od for two more years, and then the will be made for an eight-year term Dr. D. Mott Robertson, late county- treasurer, who resigned that office last summer, has announced to sono of his friends that he will stand fo the Democratic nomination for tb clerkship, and that he will, if elect ed, run the office for the fees alone This would be a saving to the tax payers of nearly 600 per annum, or nearly 5,000 for thè term. The election is some distance be fore us, and it is not our purpose to stir up the candidates or the people upon the subject thus early  but we shall fill the field of a newspaper and keep our readers informsd of events as they occur. Among tbi possible candidates we feel warrant ed in mentioning our present sheriff. Mr. S. P. Coleman, who would be u formidable opponent for any aspir ant H. Winston McKinney, the ef ficient deputy clerk, who is perhapi more familiar with the duties of the office, and better qualified for theii discharge, than any other available man. Should he enter the race, he would undoubtedly have the warm support of Mr. George T. Peers, the present clerk  and Mr. Peers would, no doubt, remain in the office for a time to aid him in his work. Mr. J Rolfe Horsley, whom Mr. Peers de feated for the office in 1899, is also likely to be a candidate. Mr. Hors ley last Week resigned the position of private secretary to Congressman Flood, which oarried a salary of 1, 200 per annum paid by Congress and assumed the management of the Southside Virginian. The resigna tion of Mr. Horsley probably caused Dr. Robertsons early announcement of his candidacy. We are satisfied that there will be other candidates. The people are being quietly sounded as to thiB and that man, bat the great majority of them will hardly bind themselves to any one at this stage of the game- none, perhaps, except a few whc be lieve that they ought to be allowed  to shape all the public policies of the connty, and to name all of the officeholders years in advance of the election. We respectfully dissent, and Bhall await developments before we bind ourselves to the tail of any"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "an eight-year term Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, late county- treasurer, who"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "an eight-year term Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, late county- treasurer, who"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.07, 1208.18, 1681.07, 1457.0], "bbox_id": "83e95eaa70", "file": "AppomattoxNewspapers_1892-1898a_0264.pdf", "page": 1, "text": "Taxes. All persons wishing to save the 5 per cent chargeable on the first day of December,1895, will meet me at the times and places specified be low, and pay their taxes for the year 1895. Spout Springs, Nov. 21 lb95. West Appomattox, Nov. 22, 1895. Evergreen, Nov. 23, 1895. Pamplin City, Nov. 25, 1895. Hixburg, Nov. 26, 1895. Tower Hill, Nov. 27, 1895. Oakville, N qv . 28. 1895. Mineral, Nov. 29, 1895. Stonewall, Nov. 30, 1895. West Appomattox Court day Deo. 5, 1895. Very Respectfully, D. Mott Robertson, Treasurer Appomattox Co.,"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "5, 1895. Very Respectfully, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Treasurer Appomattox Co.,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "5, 1895. Very Respectfully, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Treasurer Appomattox Co.,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2269.21, 953.94, 2433.48, 1335.57], "bbox_id": "8acef2640e", "file": "AppomattoxNewspapers_1892-1898a_0465.pdf", "page": 1, "text": "TA X ES ! All persons wishing to sivo the L per cent, chargeable on the first daj of December, 1897, will meet mo a the times and places specified below, .nd pay their taxes for 1897. Spout Spring ___ November 19th West Appomattox  ------ 20th Evergreen ___ 22nu Pamplin City  ___  ____ 23ro Hixburg - ------- 24th Tower H ill ....... ............. 25th i Oakville --------------- ------ 26th Mineral ------------------------- 27th Stonewall, _______ 29tl W. Appoimit.ox,- Court Day, December 9 th x After the abbva datoi uViguniv.ii.i ickot will be doiyarel to my Deji- tries with itdtrueridi-t to oolicoi mme.inaceordaicu wii.n the following law   It shall be the duty ol tie. treujurer, after the first day of Deo ember to call upon each person chargeable with taxes and levy, who has not paid the same prior to that time, or upon the agent, if any, of such person resident within the county or corporation, for payment thereof and upon failure or refusal of such person Mr agent to pay the same, he shalLMooeed to collect them by distress omStberwise. Very wespectfully, D. MOTT ROBERTSON,  Treasurer of Appomattox County, tdc."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "distress omStberwise. Very wespectfully, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>,  Treasurer of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "distress omStberwise. Very wespectfully, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>,  Treasurer of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1602.92, 833.22, 1764.38, 888.52], "bbox_id": "1a77ac78ff", "file": "AppomattoxNewspapers_1892-1898a_0009.pdf", "page": 1, "text": "Supervisor Meet The Board of Supervisor m et Tues day, the 10th, aud dispatched muoh bus iness, a part of which was a partial set tlem ent with County Treasurer D. Mott Robertson, who paid up hi due promptly."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ent with County Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, who paid up hi"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ent with County Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, who paid up hi"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [937.89, 1684.46, 1093.04, 1933.29], "bbox_id": "61d2d2a0df", "file": "AppomattoxNewspapers_1898-1902a_0594.pdf", "page": 1, "text": "Spout SpringThursday, Novem ber 21st, 1901. West Appomattox  Friday, No vember 22 nd, 1901. EvergreenSaturday, November 23rd, 1901. Pamplin,City Monday, Novem ber 25th, 1901. Hixburg  Tuesday, November 26th, 1901. Tower HillWednesdav, Novem ber 27th 1901. OakviJe  TI uJ 28th, 1901. MineralFriday 1901. KarlSaturday, November 30th, 1901. West Appomattox Court Day December 5th, 1901. Fiye per cent., penalty will he added to all taxes not paid the above dates. D. MOTT ROBERTSON, County Treasurer."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [414.02, 357.93, 733.32, 490.77], "bbox_id": "2bff719734", "file": "AppomattoxNewspapers_1918-1922a_0050.pdf", "page": 1, "text": "Spout Spring VVhat has become of Sp ut Spring? It must have fallen asleep. We are glad to see real spring once more. Mr. Will Caldwell, who has been very ill is convalescent. Dr. D. Mott Robertson s serious condition gradually improves much any part of the recent appro 1 to the consolation of bis many priation by the Federal Govern- friends."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ill is convalescent. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> s serious condition gradually"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "ill is convalescent. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> s serious condition gradually"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [891.36, 1930.44, 1048.55, 2050.62], "bbox_id": "c3c476543e", "file": "AppomattoxNewspapers_1898-1902a_0043.pdf", "page": 1, "text": "Spout Spring. Misses Gough and Carter, of Six Mile Bridge have been visiting Mrs. Dr. D. Mott Robertson. Miss Della Farrar, of Lynchburg, is the guest of Mrs. Inge. Misses Mary and Edith Patterson and Miss Daisy Watson, Lynchburg, are spending a week at the home of Mr. C. N. Garrett."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "been visiting Mrs. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Miss Della Farrar, of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "been visiting Mrs. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Miss Della Farrar, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [806.42, 779.05, 966.37, 1189.42], "bbox_id": "443c5c73fe", "file": "AppomattoxNewspapers_1898-1902a_0064.pdf", "page": 1, "text": "Spout Spring. After  long silence yonr corre spondent will again attempt to con tribute a few items. Farmers have finished cutting tobacco and are sowing wheat. Gathering apples is no trouble this fall as there are none to gather. Mr. Robert Brightwell, of Con cord visited friends here last week. Mrs. Dr. D. Mott Robertson and children went on a visit to Lynch- bu-g last week. Misses Lula and Hattie Garrett, returned Monday from a pleasant visit to the Misses Colèman near Wildway. Misses Oilie and S. K. Singleton and Vir.ie Bates went to Concord, to attend the meeting at Bethleham last week. We regret to say that little George youngest child of Mr. Dave Bates is very ill.  Mr. Jno, Robertson, Mrs. Dan. Evans and Miss Bettie Glover went on a flying trip fo Lynchburg Sat urday. Mr. Rusford, of W. Va., is visiting Mr. Buckley, the night operator at this place. Mr. Oscar Martin,- of Campbell, who was in this vicinity last week, is now visitiug friends near Hollywood."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "last week. Mrs. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and children went on"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "last week. Mrs. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and children went on"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [240.76, 906.12, 400.03, 1073.77], "bbox_id": "ef8b69e549", "file": "AppomattoxNewspapers_1902-1905a_0121.pdf", "page": 1, "text": "SOUTH5IDE DISTRICT. There are rumors afloat that Hon. J. C. Jones will not be a candidate for reeleerion to the office of Super visor, but that he will stand for the nomination for . Road Commissioner, and that Mr 8atnl Lee will also be in the fight for the place. Dr. D. Mott Robertson and Mr. Edward Barvey are spoken of for Super visors. Surety the old Soutbeide is to be the scene of a warm political battle. l t the fight wax warm they are all good fellows."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "for the place. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and Mr. Edward Barvey"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "for the place. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and Mr. Edward Barvey"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Plunkett, S. R. Franklin, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, R. F. Burke and"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Plunkett, S. R. Franklin, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, R. F. Burke and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1756.54, 1271.5, 1920.87, 1714.99], "bbox_id": "b87d8bef3c", "file": "AppomattoxNewspapers_1915-1918a_0464.pdf", "page": 1, "text": "She had only been married four weeks she was married jin Columbus, Ohio, on Sept. 17, where sue visited her broth- Mr- Wesley Driscoll sbe i taken sick while there. Her husband brought her back to her fathers home, where Dr. D. Mott Robertson gave her the best medical aid, all that loving hands could do was done for her by mother, hus band, father and sisters. She bore her sufferings with Chris tian fortitude she was resign ed to death. The deceased was 25 years old she had been a member of old Wesley Chapel church ever since her early girlhood she was an earnest, consistent member, was held in the high est eBteem and affection by her church members and Sun day School class she was a kind, good girl, and loved her 8aviour, her church and her people sincerely and .was al wa s ready to visit thè sick and help the needy This death has cast a gloom over our entire community, for all who knew this sweet girl had learned to love her, both old and young. She was laid to rest in the family burying ground at her fathers home. Funeral tar-"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "fathers home, where Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> gave her the best"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "fathers home, where Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> gave her the best"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1427.5, 380.86, 1586.65, 412.16], "bbox_id": "83dd15bbff", "file": "AppomattoxNewspapers_1902-1905a_0466.pdf", "page": 1, "text": "See card of Dr. D. Mott Robertson announcing his cindidacy for the clerkship."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "See card of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> announcing his cindidacy for the clerkship."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "See card of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> announcing his cindidacy for the clerkship."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1473.85, 1536.5, 1591.18, 1559.2], "bbox_id": "89f17f87f5", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "Public Speaking. D- Mott Robertson, Hou. J,"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Public Speaking. <mark>D</mark>- <mark>Mott</mark> <mark>Robertson</mark>, Hou. J,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Public Speaking. <mark>D</mark>- <mark>Mott</mark> <mark>Robertson</mark>, Hou. J,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [332.87, 785.78, 498.88, 1589.41], "bbox_id": "7235aad83b", "file": "AppomattoxNewspapers_1898-1902a_0489.pdf", "page": 1, "text": "permanent ch.iirmau, aud Mr. A. Ii. Clemeut as secretary. On motion of Mr. S. L. teigusou, it was decided that twenty-two dele gates be chosen to cast the eleven O votes to which Appomattox is enti tled, each delegate to cast half a vote. Mr. Ferguson then moved that three persons, one from each magis terial district, be chosen to recom mend- to the meeting twenty-two persons who would be suitable dele gates. auil who would probably be wtlliug to give the time and expense involved in attending the conven tion. A substitute was offered by Uolouel Poore that the old-fashioned method be folllowed of dividing into districts for the purpose of selecting delegates but the original motion prevailed, and Messrs. L. A. Smith, S. C. Stratton, aud E. P. ears were appointed to recommend delegates. Lhese gentlemen, after consultation, reported the following, who were unanimously chosen as delegates Messrs, ii. D. Flood, W. H . Lew is, Dr. E. E. Waiker, J . O. Jones, i . J . Stratton, A, ii. Element, John R. Horsley, J . H. Robinson, Thomas A. Smith, Joseph Button, R. L. Burke, J . W. Oveitou, S. P. Coleman, R. B. Poore, S. L. Ferguson, T. E. Owen, Dr. D. Mott Robertson, T. W. Moses, Dr. J . B. Abbilt, B. C. Childress, Judge D. A. Christian, aud R. W. W horley. A resolution was adopted author izing the delegates to appoint alter nates, and instructing those present to cast the entire vote to which the county is entitled. Upon motion of following resolut-1-  i . anting vote without a  . ,,eeoived, That the delegates se ated by this meeting to the Demo- ratic convention which is to assem ble in Norfolk on August 14 be, and re hereby, instructed to vote for ion. Edward Echols for the nomi nation for Governor as long as his name is before said convention. Upon motion of Mr. J . H. Abbitt, ne following was adopted  Resolved by the Democrats of Appomattox, in mass-meeting assem bled, that the delegates this day elected be instructed to vote for the nomination of Hon. John L. Jeffties, of Culpeper, for the office of Attor- nev-General. Mr. Saml L. Ferguson offered the following, which was adopted  Whereas Hon. J . Taylor Elly son, our present efficient State chairman, has signified his willingness to serve longer in that capacity, aud whereas"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "T. E. Owen, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, T. W. Moses, Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "T. E. Owen, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, T. W. Moses, Dr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.8, 1190.67, 1949.6, 1808.62], "bbox_id": "c29d5c39d4", "file": "AppomattoxNewspapers_1892-1898a_0081.pdf", "page": 1, "text": "P am plin City B udget. Misses Annie and Irene Marshall left for their schools in North Caro lina on the evening of the 8th instf Misses Bristow, of Hixburg, took the train here on Friday en route for the Worlds Fair. Mr. Eugene Locke, of Crewe, has been visiting his friends and college- mates, Mr. J. H. Franklin, of this place, and Mr. Leslie N. Liggon, of Hixburg, for the past week. Mr. Pusley M. Hannah came down on Saturday with a load of forty watermelons which averaged forty pounds. Mrs. E. B. Brady made a short visit to Prospect last week. Mr. N. A. Davis, operator at Roan oke, was in town on Sunday last. Dr. And Mrs. E. H. Grigg left on yesterday for Buckingham,where they will spend a few days visiting rela tives and friends. Miss Lizzie Pankey returned on the west bound train yesterday from Spout Springs, where she has been visiting the family of Dr. D. Mott Robertson. Mr. Christopher Atkinson passed through town this morning en route for his cousins, Mr. J. K. Hannah. Mr. A. is just returning from a trip to the Worlds Fair. Miss Sallie E. Rice returned a few days ago from a visit to her friends, Dr. and Mrs. Robert M. Davis, of Evergreen. Mr. Marshall Morton leaves to day for Hampden Sidney College where he matriculates for the ses sion. Mrs. Anderson M. Jennings, one of the oldest ladies of our town, died this morning in the 75th year of her age. She leaves a husband aud five children to mourn her loss. Mrs. S. E. J. Walker, of Peters burg, is in town with the view of purchasing a store-house and lot of Mr. John R. Franklin. P. H. E. Sept. 12, 1893."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the family of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Mr. Christopher Atkinson passed"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the family of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Mr. Christopher Atkinson passed"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [298.8, 322.76, 454.26, 453.96], "bbox_id": "f7a10f84e7", "file": "AppomattoxNewspapers_1898-1902a_0362.pdf", "page": 1, "text": "OUR OFFICERS judge of Circuit CourtGeo. J. Hundley. Courts, first day of April and October. Judge of County CourtD. A. Christian. Courts, Thursday after first Monday. Clerk of Circuit und.nunty CourtsGeo. T. Peer. 4  Atorney for CommonwealthH. D. Flood. Sheriff8. P. Coleman. Treasurer D. Mott Robertson. Hoard of SupervisorW. H. Llgon, chair man  S. O. Stratton and J. C. Jones. Board meets on Wednesday after first Monday in March. June, September, and December. RELIGIOUS APPOINTMENTS."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Sheriff8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Hoard of SupervisorW. H."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Sheriff8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Hoard of SupervisorW. H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [334.28, 339.79, 490.38, 456.68], "bbox_id": "e23d04a65d", "file": "AppomattoxNewspapers_1898-1902a_0406.pdf", "page": 1, "text": "OUR OFFICERS.  j ge of Circuit CourtGeo. J. Hundley Courts, first day of April and October. Judge or County CourtD. A. Christian. Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Peers. Atorney for CommonwealthH. D. Flood. Sheriff 8. P. Coleman. Treasurer D. Mott Robertson. Hoard of SupervisorsW. H. Linon, chair man  S. C. Stratton and J. C. Jones. Board meets on Wednesday after first Monday in March. June. September, and December."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Hoard of SupervisorsW. H."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Hoard of SupervisorsW. H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [524.63, 260.42, 840.59, 504.46], "bbox_id": "6587594db3", "file": "AppomattoxNewspapers_1915-1918a_0474.pdf", "page": 1, "text": "osition in the Legislature, and only a few days before the adoption of vour resolution calling on me to support it, I had expressed myself as op posed to the measure. On the other hand my opponent, Dr. D. Mott Robertson, I believe had publicly declared himself in favor of the election of these officers by the direct vote of the people. U n d e r the circum stances, the logical effect of the adoption of your resolution at such a time is obvious. At the same time 1 will be slow to be lieve that the mambers of the Farmers Union will disregard the record I bave made in fa vor of their interests, and vote against me simply because I do not favor this one proposition I Japan professes loyalty to t h e I submitted to me by the Farm 1 v r - - - I era Union. Trusting I have made myself"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "hand my opponent, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, I believe had publicly"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "hand my opponent, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, I believe had publicly"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [164.91, 738.53, 337.31, 1490.37], "bbox_id": "3344a64e36", "file": "AppomattoxNewspapers_1902-1905a_0550.pdf", "page": 1, "text": "ory to anj candidate wanted a square deal. Mr. Flood replied to Mr. Clem ot and cbancterized his proposition as an insolent one, which had only been exceeded by the oDe lately made in Richmond, to have be committee of that city allow three gentlemen to name one judge at each precinct. Mr. Clement closed the discussion by saying he was forty years old and a lifetime server in the parry and that he had always esteem d i his right and privilige toTer sug geslions and -.peak in the council of his party, and always intended i do so. He disclaimed any intent on or reflection upon the characre- of the judges wbr bad been conduct ing the regular elections, but he ap pealed to the committee to popular ize the primary by appointing u- best men, in whom the people had confidenceto those whose dully walk was upright and correct The regular judges were elected with the exception of the Republl can judge, -hose place is to be fillet by the committeemen from their re spective precinct. No notice as given to the appeal of Mr. Clement. It is said that every judge in the county U for Senator Martin except poss bly three. Tbe action of the commi tei is not phasing to many Democrat especially in view of the fact that there is a very large illiterate vote in the county. Captain T. J. Stratton read a res olution relieving the candidates of all assessments. W. H. Ligoii bad passed a resolution forbidding the Soliciting 1 1 votss on election day by judges. The following resolution off .-red by Captain Stratton was adopted That every person voting thereb pledges himself to support the nom inees of the primary, and that if the democracy of any person offer, ng to vote is questioned the judges or one of them shall ask, are you a Democrat ? Do you pledge to support every nominee of the pri mary ? All candidates are required to no tify Dr. D. Mott Robertson, Ohuir man, of their candidacy on or Le fore Aug. 10th. As the matter stands the Judges appointed to date are"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "to no tify Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Ohuir man, of their"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "to no tify Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Ohuir man, of their"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [190.1, 1344.27, 517.79, 1536.47], "bbox_id": "9932dcc270", "file": "AppomattoxNewspapers_1892-1898a_0442.pdf", "page": 1, "text": "on the Carolina coast for filibusters. This sort of work must bo more or Beale E h csa disgusting to the ofljjcevs and    men in our revenue marine Bervice, hut they have no choice in the mat ter. They must obey the orders of Horsley, J . E. Chick, A. B. Thorn-1 the Secretary of the Treasury, even J k- J f ------- j ........... dictated by the vhill. M a j. J. W. Flood, Large, ALTERNATES. R. W. Bristow, J. W. Clark, 0. A. Trent, W. H. Lewis, B. N. Tanner, W. H. H. Walker, G. H. Coleman, J. W. Uarnefix. Dr. D. Mott Robertson, Alternate  at Large."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "J. W. Uarnefix. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Alternate  at Large."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "J. W. Uarnefix. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Alternate  at Large."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [460.8, 1248.23, 789.46, 1620.87], "bbox_id": "41d1864d98", "file": "AppomattoxNewspapers_1918-1922a_0107.pdf", "page": 1, "text": "offer for sale at public auction at the late rtsidence of Dr. D. Mott Rob ertson, about five miles south from Spout Spring, a station on the Nor folk  Western Railroad, the following valuable real estate on Falling River and the public road leadiug from Spout Spring by Salem church 1. THE HOME PLACE of th late Dr. D. Mott Robertson containing 341 acres on Falling River, upon wnich is located a com bination frame end stone dwelling of ten rooms, threo tenant houses, horse barn with stalls for twelve horses, gran rv, ice house, smoke house, two corn cribs, garage, chicken house and four or five tobacco barns. About fifty seres of this land is woodland, with sufficient wood for domestic purposes. Theie is an orchard of 400 apple trees, and about 200 seres of the remainder is iu a high s ale cf cultiva tion, and is, perhaps, as fine highland as is o be found in thi3 sec tion of the Staie. The farm is well fenced aDd cross fenced. 2  THE S LLIE ARRiNGTON TRACT of 163 acres, sit- nited a short distance frtm the home place and upon winch there is located a small tenant house and th-ee tobacco barns. There are about fifty to sixty acr.-s of this trrct in woodland and the remainder is under cultivation. This land is regarded as exceptionally good tobacco land aid is one of tbe meat productive farms in the countv. This tract of land will be sold snbj c. to a lease foi the year 1920, the purchaser to receive, of conrse, toe rents for that year. 3  THE BRICK HOUSE TRACT of 59 81 acres on both aides ot Falling River and a skoit distance from the nome p ace and the Salhe Airmgton Tiact. About ooe-haf of this tract is civered by woods and the remainder is under cultivation. i3 THE WOOD LAND BRICK HOUSE TRACT of 43 46 aares of wood.and. Tois tract adjoins No. 2the Salhe Ar rington Traceand No. 4the J. R Atwood Tract. 4 THE J. R. ATWOOD TRACT of 35.S acres of wood land acjoining No. 2the Sallie Arrington Tractaud No Wood Land Brics House Tract. These are exceptionally fine productive farms and in a high state of"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of th late Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> containing 341 acres on"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of th late Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> containing 341 acres on"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.54, 710.25, 2168.41, 739.94], "bbox_id": "f815b9dacd", "file": "AppomattoxNewspapers_1918-1922a_0085.pdf", "page": 1, "text": "Of the Personal Prop ty of the Late   Dr. D Mott Robertson of  jj Spout Spring, Va. J g"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Of the Personal Prop ty of the Late   Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> of  jj Spout Spring, Va. J g"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Of the Personal Prop ty of the Late   Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> of  jj Spout Spring, Va. J g"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1788.49, 418.36, 1952.09, 1738.99], "bbox_id": "4a33cdbf1c", "file": "AppomattoxNewspapers_1892-1898a_0098.pdf", "page": 1, "text": "of Appomattox county, and Miss Annie L. Plunkett, the lovely and accomplished daughter of the late Willis A. Plunkett, for many years the highly esteemed Sheriff of this county. The church was artistically decor ated, thé altar lined with beautiful flowers and brilliantly illuminated with colored lights. Immediately in frontof the chancel was an arch of flowers, from the centre of which was suspended a floral design in the shape of a horseshoe with the inscription! Good tu c k . It was under this the young couple stood to plight their troth, the Gne to the other. At the appointed time the bridal party entered the church in the fol lowing order  First came the ushers, Mr. Hunter Smith and Mr. Walter Cheatham, down the right and left isles respect ively. Then came the bridesmaids and groomsmen  Miss Elma Shearer with Dr. J. H. Abbitt Miss Susie Jones with Mr. W. J. Trent. . - ,  , -, -. Miss Daisy Lawson, of Bróoknéal, with Mr. Charlie Hunter. Miss Florine H u n t,, of Prince Edward, with Mr. Joseph Button.  Miss Sallie Rica with , Mr. John Overton. MisS Annie Abbitt with Mr. R. W. Stratton. Miss Jessie Cheatham with Mr. Hicks Rice. Miss Vashti Reynolds, of Brook- neal withMr. Hunter Tones. Mr. Robert Harvey immediately preceded the bride and Miss Hattie Plunke the groom. The bride, witlfher sister,Miss Minnie Plunkett, as maid of honor, came down the left isle, and the groom, with his best man, Mr. L. H. Gilliam, came down the right, and met under the arch, where they were declared man and wife in a solemn and impressive man ner by the Rev. Mr. Royall, of the Baptist Church. The arrangement of the bridal party abont the altar, the mellow lights and profuse decorations creat ed a scene of beauty rarely witnessed. The Bride was becomingly attired in a white surah silk, en train, a tulle veil caught up by a diamond brooch. A bouquet of Maréchal Neil roses, tied with white satin ribbon, was carried in her hand. The bridesmaids were air attired in white silk, wifh natural flowers, the gfoomsmen in conventional black. After the ceremony was over ,the bridal pgrty, together with other in vited guests, repaired to the residence of Mrs. D. P. Robertson, mother of the groom, where a reception was tendered them. There was also present the bridal party of Mr. Robert G. Robertson, another son who had been married that morning in Amherst county. After a season of merry-making among the yonng folks, and on the part of the older ones, indulging in reminiscences of similar scenes in which they were the central figures, the assembled party was invited into supper. And such a supper ! A long table, a d o r n e d with flowers, in the centre of which was a large floral pyramid. It was laden with the choicest viands, and beg gars description. . Suffice it to say that it was an old-time Virginia spread,! which the guests did ample justice. It was not until the wee s ma hours that the guests departed, wishing the newly wedded ones, long and happy lives. Besides the two bridal parties there were present, Shearer, Katie Thomas, Annie Col lins, Mary Evans, Mrs. Rufus Bates, Mrs. C. Inge, Mrs. Dan Evans, Mrs. John Hanter, Dr. and Mrs. D. Mott Robertson, Mr. and Mrs. C. T. Plunkett, of Lynchburg, Mr. and Mrs. W. C. Nowlin, Mr. and Mrs. Geo. Hunt, of Prince Edward, Mr. and Mrs. F. W. M cKinnney, Mr. and Mrs. Daniel McK inney, Mr. and Mrs. 3D. R. Abbitt, Mr. A. Plunkett, of Lynchburg, Mr. H. C. Shearer, j Mr. Walton McKinney, and a host of others."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Hanter, Dr. and Mrs. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Mr. and Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Hanter, Dr. and Mrs. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Mr. and Mrs. C."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1897.19, 1367.9, 2056.03, 1761.02], "bbox_id": "2b99e17598", "file": "AppomattoxNewspapers_1902-1905a_0431.pdf", "page": 1, "text": "O akville. Christmas has passevLaWayaud will be remembered by many as the most enjoyable that has been for a Ion 4 time. Mr. J. A. Owen and family who have been  quarantined with small pox have all recovered. Mr. John P. Hughes of Lynch burg, spent part of tbn Christmas in the village, comeagain John, we are always glad to see yon. Misses Katy and Francis Rtiner of Rockbridge county, spent the Christmas here. They left Wed nesday much to the regret of their friends. Miss Luta Jennings whoAMtne down to attend the Uarvey-Abbitt wedding, returned to her home in Lynchbnrg Monday. Mr. Lee Davidson happened to a serious accident Christmas eve iu trying to extinguish a lighted squib it exploded in his right hand tear ing it so it had to be amputated at tbe wrist. Dr. D. Mott Robertson performed the operation. Mrs. B. 8 . Thorpe of Lynchburg, visited her father-in-law, Mr. F. 8 . Thorpe daring tbe Cbristtnai. A happy and prosperous New Year for tbe T imes ."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "at tbe wrist. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> performed the operation. Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "at tbe wrist. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> performed the operation. Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [661.16, 188.52, 855.55, 1144.9], "bbox_id": "c563cbbae5", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "NOTICE Spout Spring, y., Oct. 16,1915. To the V oters of Appom attox County Gentlemen I notice that Messrs. L. E. Sm ith, Chairm an C. M. Drinkard and M. W. Car- son, constituting the Hoard of Supervisor ?, have circulated generally over the county a circular in which thrv briiv direct charges again t m yself aud the C itizens Party. I will now proceed to answ er said charges but before doing so, I w ish to lay dow n this pr nciple There is but one rule of con duct for a manto do th right thing The cost m ay be dear in m oney, in friends, in in fluence, in labor, in a prolong ed and painful sacrifice but the cost not to do right is far more dear you pav in the in t grity of your m anhood, in honor, in truth, in character. You forfeit vour pou I s content, and for a tim ely gain you bar ter the iufinities. They say,  Statem ents have been m ade in their platform , in anonym ous circulars and car toons and by word of m outh by the candidates of the so-cal le d Citizens P arty that th e y  truth, favor a reduction of taxation . We certainly claim and stand for a reduction in taxation and this can be accom plished by an honest and econom ical adm inis tration of the countys affairs, w ithout hurt or injury to schools or roads. W e are in favor of im proving the schools of the county and to this end we favor the elections by the people of School Superinten dents and Trustees.  W ould they reduce the am ount of m oney being expend ed on public roads? We would ieduce the am ount of m oney being expended on special roads and for the bene fit of the ring, believing that ihe countys m oney should be expended for the benefit of the m asses and not for the classes.  The m oney can not be ex pended unless it is raised by taxation This is a fact but w e have been told that the people do not p a y such and such a debt as it is paid by the State, trying o m ake the pe pie believe w hat is false in principle as w ell as in practice  W e call attention of he voters to tho fact th at the rate of taxation im posed last year for State and county purposes was exactly the sam e th at it w as in 1901 when Dr. D. Mott Robertson w as . Treasurer of this C ounty. This is a statem ent m ade to deceive os the follow ing figures will prove Amount of levy for 1901 for State and all County purposes 1 20. A m ount of levy for 1914 for State and Go. purposes 1.55 m aking a difference againt last year of 35c. plus 50c. capitation tax. Let us go still farther into this rate of taxation we w il compare tw elve years unde the adm inistration of D Mott Robertson as Treasurer w ith tw elve years under R. F Burke as Treasurer and note the difference Twelve years under D. Mott Robertson, Treasurer"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "in 1901 when Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> w as . Treasurer of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "in 1901 when Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> w as . Treasurer of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [830.64, 637.81, 991.03, 1720.05], "bbox_id": "607ff9d15a", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "NOriCE. To the Voters of Appomattox County The long communication of Dr. D. Mott Robertson, published in the T imes -V irginian of October 20th, and covering three columns, is so full of misrepresentations and false conclusions that we deem it neces sary in the interest of truth to reply to it. Dr. Robertson, towards the con elusion of his article, says Mr Good Citizen, if you believe that 1 havq shown wherein the Board of Supervisors has misrepresented the facts in their circular, I ask you to go to the polls on November the 2d and Cast your vote to rebuke such an administration.  This is a direct charge that our circular issued to the voters of Ap pomattox County contained mis representations. I f we have, let Mr Good Citizen vote against us. Ii Dr. Robertson has, let Mr. Good Citizen administer to the Doctor the medicine he has prescribed, and go to the polls on next Tuesday ant. vote against him and the ticket he has put in the field. First. The Robertson letter at tacks our statement in reference to the tax rate. We stated that the tax rate for County and State purposes in 1914 was the same that it was in 1901 when Dr. Robertson was Treasurer. We further stated that the rate for school purposes was 15c on the 100 worth of property in 1901 and 50c in 1914. Dr. Robertson claims that that statement is incorrect, and undertakes to mislead his readers by mixing the tax rate for school pur poses with that for Coupty purposes, when we have distinctly separatee the two. We thought even D. Mott Robert son could understand this distinc tion. We were aware of his habit of always muddling things and espe cially matters relating to finances and more especially when it was tc his interest to muddle them, but we did not see and do not now see, how he understood our circular as he pretends in his letter to have mis understood it. You will observe that iu his letter he fixes the rate of County taxation in 1901 at 80c. He embraces in this the 15c levied for school purposes. Deducting 15c from the 80c, leaves the tax rate for County purposes 65c. The rate of State taxation _ 1901 was 40c. Add 40c to 65c and it makes 1.05, which was levied ii 1901 for State and County purposes, outside of the County levy for school purposes. The rate of taxation ir 1914 outside of that levied for schoo. purposes is 70c, the State rate was 35c, making 1.05 for County and State purposes, outside of the County levy for school purposes. The two figures are exactly the samejust what we said in our circular. Now we 88k the people Who is undertaking to misrepresent the facts? Second. Dr. Robertson takes - sue with the Board in the wisdom of having built some improved roads with ffie aid, not only of the State, but of private subscriptions. He seems to think that it is both illegal and immoral to have done so. That such a course was legal is evidenced by the fact that it is approved by the laws of Virginia that it is perfectly moral is recognized by everybody but Dr. Robertson. The State of Virginia enacted some laws for the permanent im provement of roadb and bridges. Other laws provide that it would put up one-half of the money or a convict force for the building 0f these roads and bridges. The County of Appomattox at first accepted money, and, with the money gotten from the State and supplemented by just as much from the County treasury, built seven permanent bride As County at"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "long communication of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, published in the T"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "long communication of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, published in the T"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [531.07, 786.97, 688.84, 1043.95], "bbox_id": "364a9b838a", "file": "AppomattoxNewspapers_1915-1918a_0043.pdf", "page": 1, "text": "n o t i c e Appomattox, Va., Oct. 4,1916 Dr. D. Mott Robertson, Chairman of Oinzens Par y. My dear SirI notice from pro- .eding of a mass meeting of your party held at Anomattox on August 20th, that 1 was nominated on your ticket for Justice of the eace. While 1 appreciate the confidence implied by this nomina- on, yet I wish to say, that I am the Democratic nominee for Jnst ce cf the Peace. I have always been a Democrat I am one now, and 1 shall vote a straight Democratic Ticket, as I think every Democral ought to do. I cannot understand how somt people can say that they are Demo crats, and then in the same breath II you that it is their in ten ion to vote against one or more of the De mocratic nominees. Respectfully yours, adv W. L. B row ."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Va., Oct. 4,1916 Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Chairman of Oinzens Par"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Va., Oct. 4,1916 Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Chairman of Oinzens Par"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1583.99, 266.43, 1743.19, 750.22], "bbox_id": "5e806c55b1", "file": "AppomattoxNewspapers_1902-1905a_0370.pdf", "page": 1, "text": "MR. THOS. F. CARSON. Mr. Thos. F. Carson, aged 8 ii. died at his home near Spout Spring.- Sunday. All of his children were present in the last hour. Revs. E. V. Carson, of Albemarle, and A. L. arson, - of Accomac E. P., A. 1., T. B., E. G., V. B. Carson, and Mrs. Bernard Chick, .if Appomattox. Mr. Carson was born in this coun- y and loved his home and his coun ty people, among whom he spent his whole lif j . It is said of him that he never was sick a day in his life. He was pros perous, energetic aud an ideal citi zen. The deceased was a devout mem ber of Salem Methodist Church for half a century, was a most gallant Confederate soldier and his deeds of kindness and love and zeal for his church will ever live in the memory of those who knew him. The funeral service was conduct ed at Salem Church by his pastor, Rev. M. S. Elliott, in the presence of the largest congregation ever seen there, tyst Monday. The burial took place in the churchyard. He is survived by his widow, in addition to the above children, who is 71 yea 8 of age well, hearty aud active. Suielv the Lord has been good to this happy couple. The body of thier dead friend was borue from the church to the grave by Dr. D. Mott Robertson, E. . rank Jones, Roht. Thomas, A. Hunter Howerton, David Alyis and H. Clay Shearer."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the grave by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, E. . rank Jones, Roht."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the grave by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, E. . rank Jones, Roht."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [609.85, 1830.46, 768.67, 1963.8], "bbox_id": "b2056fc176", "file": "AppomattoxNewspapers_1898-1902a_0226.pdf", "page": 1, "text": "Mr. J. R.Horgley has appointed the following delegatee to the De- mofiratic convention which meets at Campbell Courthouse on the 30th inataut Messrs. S. P. Coleman, S. L. Ferguson, J B. Abbitt, D. Mott Robertson, A. H. Howerton, H. D. Flood, W, H- Digon, J. W. Wright, R. P, Sears, A. B, Thornhill, S. C, Stratton, M. W. Carson, W. D, Doss, J. S. Phornbill, R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Ferguson, J B. Abbitt, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, A. H. Howerton, H."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Ferguson, J B. Abbitt, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, A. H. Howerton, H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.5, 1034.61, 2184.65, 1535.0], "bbox_id": "e56792e8ac", "file": "TimesVirginian_1984a_0063.pdf", "page": 1, "text": "Mport given , it for a paper is more the diild r i its constituents tium of those responsible for its weekly appearance. In other w ords, if patronage is liberal the result will be a bigger mid better paper and the greater will be the credit to the party it represents. The column went on to declare that everything published in , tile paper would always remain demi and free from unseemly controversy and. bickerings, bat public dfficials will be duly critized when condtions warrant it.  . The editorial continued....we desire to state that we are hot aiming to crowd the field of our esteemed contem porary the Times-Virginiaa whose editor has always dealt fairly with the people of this section and has mode many sacrifices in the interest of the people of this county .... We are not entering the field as a local newspaper but as an advocate aninst that dreaded monster,Ring-rule and bos sism. M g .  It seems, according to Mrs. Burke, that this issue was the one and only issue of the Citiasns Journal. The headlines of the lead story on page one of this old paper read  Citisens Party Polls Big Vote. the kicker read, Appomattox County Determined To Put Down Boss Rule. According to the news story S.R.Martin and W.H. Ligon, nominees of the Citisens Party for Supervisors were elected and Other Citizens candidates made a good run. F.W. McKinney .Citizens candidate for the office of sheriff received 883 votesDr. D. Mott Robertson, Citi zenss candidate for treasurer was only defeated by 58 votes. J.W.Cawthorn was defeated by 103 votes W.C.Frank- Un defeated by 140. votes and R.P."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "sheriff received 883 votesDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Citi zenss candidate for"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "sheriff received 883 votesDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Citi zenss candidate for"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2091.6, 912.84, 2255.6, 1204.55], "bbox_id": "4c93a05871", "file": "AppomattoxNewspapers_1892-1898a_0062.pdf", "page": 1, "text": ".J K I Uuly 22d. UBS, as the time and the lav offioe o t EL D. i f Appomattox C. H., V a , aa the place _____ execution of thh said order of reference, and if not concluded on that day It win be con tinued from time to time until completed, HPfiHBnsaHpHpnHM B. B. P o o r e , Spedai Com fi. D. F lood , p. q. June nrr. une224w K IBGINIA In tbe Circuit Court of Appo mattox oounty. The Board of Supervisor of Appomattox oounty AGAINST John B. FrankltrUate Treasurer of Appomat tox oounty W. D. Thornton, J. F. Connolly and S. R. Franklin, ms sureties, and D. Mott Robertson. EXTRACT FROM DECREE AT THE JUNK TERM, 88. On consideration whereof the oourt doth adjudge, order and decree that this cause be referred to one of the commissioners of this court, with direction to take, state and settle the aeoounts Of defendant J. H. Franklin as i late Treasurer ot Apotnattox county in at  tar as the Plaintiff la concerned therein, from the beginning of his term to tbe end thereof, and It Is ordered that the said J. R. Franklin do lay before said commissioner a full state ment of his transaction as suoh Treasurer during his term of offioe aforesaid, including all books and papers pertaining to said offioe. EXTRACT FROM DECREE AT TBE JUNE TERM, 98. And it to ordered that this cause be referred to B. B. Poore as a special commissioner to e the accounts ordered therein. C ommissioner  s O ffice Appomattox C. H., V a , June 19, Notice is hereby given to the parties to this suit that I have  M the time, and AiiyartiwTvHP execution of the said order of reference, and If not concluded on that day it will be contin ued from time to time untf"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Franklin, ms sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DECREE AT"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Franklin, ms sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT FROM DECREE AT"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson", "D"], "snippet": "A. North, J . Randolph, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, <mark>D</mark>. P. Robert son,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson", "D"], "snippet": "A. North, J . Randolph, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, <mark>D</mark>. P. Robert son,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.83, 1500.75, 1605.98, 1558.5], "bbox_id": "9e10f5503e", "file": "AppomattoxNewspapers_1892-1898a_0236.pdf", "page": 1, "text": "In another column we reproduce thè announcement cards of Messrs W. C. Franklin, E. F. Collins ant D. Mott Robertson all of whom are funning as Independents."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "In another column we reproduce thè announcement cards of Messrs W. C. Franklin, E. F. Collins ant <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> all of whom are funning as Independents."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "In another column we reproduce thè announcement cards of Messrs W. C. Franklin, E. F. Collins ant <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> all of whom are funning as Independents."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1652.15, 1053.67, 1814.5, 1426.51], "bbox_id": "21e2129873", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "Important Notice. Feeling the importance and great esponsibility upon ns iu providing creditable dinner for the immense crowd which will attend the Farm ers Institute here on July 30th aud 31st, we urge the people of AppJ- mattox comity to co-operate with us and help ns make this part of onr programme up to the long estab fished standard in this connty. Let us know at the very earliest conven ience what each family can give the Committee on Dinner for each day and the committee will advise yon promptly. The committee respect fully asks for the following princi pal articles of food Beef, veal, mutton, shoat, hams, chickens, pickels, c.,all cooked. The committee will take charge of articles for the Institute. Please notify any member of the committee what you can give, or address Thos. A. Smith, W. Appomattox W. H. Ligon, Hixbnrg Dr. D. Mott Robertson, Spout Springs Joel T. Cawthorn, Evergreen J. F. Pnrdum, W. Appomattox. Committee on Dinner."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "H. Ligon, Hixbnrg Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Spout Springs Joel T."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "H. Ligon, Hixbnrg Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Spout Springs Joel T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [821.99, 1198.12, 981.69, 1379.27], "bbox_id": "2b2fb6cbb5", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "Import nt Meeting. There will be an important meet ing  the last one the committee will have at the T imes  office at 2 p. m., next Saturday. The entire com mittee is urged to be present, as this meeting will wind up the business of the Institute. We publish the committee in full as appointed by Mr. Jas. R. Kemper, who has com plete charge of the Institiue committee on dinner . W. H. Ligon, T. A. Smith, Joel Cawthorn, D. Mott Robertson and R. K. Pnrdum."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "A. Smith, Joel Cawthorn, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and R. K. Pnrdum."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "A. Smith, Joel Cawthorn, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and R. K. Pnrdum."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [835.84, 223.2, 991.0, 439.34], "bbox_id": "dafe81f96a", "file": "AppomattoxNewspapers_1915-1918a_0445.pdf", "page": 1, "text": "iH ti conditio as he will the lp-ia na.  w va con .c. wtil leave the fi-i  f iii-i m o nr.r-.ii .0 iff, R L. B u ik e  As for myself I do not want bun. to withdraw. i want bun to rnn until election dav when the voters of this county will repudiate ois falsehood and p u c ture bis overweening vanity as they hvh dntfe 0 often before. To the people of Appomatox county 1 would sy t at 1 have no injycgjl inveelf into this contest,bn that it ha  Keen forced uion me by the false, malicious and gratuitious charges of Dr. D Mott Robertson. 1 have lead an bo est 1 fe and I have neverbefore had my integrity ques tioned, and Ido not intend to eubmit to it being questioned now. V ery respectfullv you-s, R. F B u r k e"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "gratuitious charges of Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>. 1 have lead an"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "gratuitious charges of Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>. 1 have lead an"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2233.45, 974.04, 2393.11, 1255.64], "bbox_id": "773de36330", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "if not concluded on that day it will be oon-  ime to time until compie H. B. Poona, Spedai Oommr, H . D. F lood , p. q. Juno 82 tw VIRGINIA Y  In the Ciroult Court of Appo mattox county. The Board of Supervisors of Appomattox oounty AGAINST John R. Franklin Jato Treasurer of Appomat tox county W, D. Thornton, J. F. Connally and S. R. Franklin, his sureties, and D. Mott Robertson. EXTRACT PROM DECREE AT THE JUNE TERM, 88. On consideration whereof the oourt dote adjudge, order and decree that this cause be referred to one of tho commissioners of this court, with dlreotlon to take, state and settle tee accounts of defendant J. R. Franklin as late Treasurer ofApomatiox oounty In so far as tee Plaintiff is concerned therein, from tee beginning of his term to tee end thereof, and It is ordered that the said J. R. Franklin do lay before said commissioner a full state ment of his transaction as such Treasurer during his to rn of office aforesaid, including all books and papers pertaining to said office. EXTRACT THOM DECREE AT THE JUNE TERM, H6. And it is ordered that this cause be referred to R. B. Poore as a special commissioner to e tee aooounts ordered therein. C o m m is s io n e r  s O f f ic e , I Appomattox C. H., Va., June 1971888.  Notice Is hereby given to tee parties to this suit teat I have appointed July 22nd, 1898, as the time, and tee law office of H. D. Flood, at Appomattox C. H., Va., as the place for the execution of the said order of referenoe, and if not concluded on that day It will be contin ued from time to time until completed. R . B. P o o r e , o m r, H. D . F l o o d , p. q. June 22 4w."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Franklin, his sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT PROM DECREE AT"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Franklin, his sureties, and <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. EXTRACT PROM DECREE AT"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1513.21, 244.73, 1682.62, 656.09], "bbox_id": "5c2cb82192", "file": "AppomattoxNewspapers_1922-1923a_0475.pdf", "page": 1, "text": "I D eatb o f Mrs. C lem entine P ort- w ood B loxton. Died of kidney disease at her home near Reedy Spring Church, in this county, on June 10th, 1907, at 1130 p. m., Mrs. Clementine Port- wood Bloxton, wife of C. B. Blox- ton. She had been confined to her room for several months previous to her death. Mrs. Bloxton has been a constant member of the Baptist Church ever since he girlhood, and was a daughter of the Rev. George Portwood, who died soon after the close of the war between the States,  and is survived by four sous, and  two daughters as follows, Rev, F. E. Bloxton, of the Wilmington Con. ference, M. E. Church North Wal ter A. Bloxton, Roanoke, Va J. W. Bloxton, Greensboro, N. C. Benja min Bloxton, Richmond, Va  Mrs. Cora DeShaza, Leaksville, N. C., and Miss Ella Bloxton, Covington, Va., land three sisters, Mrs. Elvira Daw son Mr -. M. A. Jennings and Mrs. L. V. Woodson. The burial services will take place at Reedy- Spring! ! Church, Wednesday evening, June 12th, at 2 oclock. The pall bear ers were, Dr. D. Mott Robertson, A. H. Thompson, Geo. W. Cheatham, W. B. Marshall, J. H. Morris and Hubbard Cheatham."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "bear ers were, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, A. H. Thompson, Geo."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "bear ers were, Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, A. H. Thompson, Geo."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [392.88, 1109.88, 1674.36, 1223.28], "bbox_id": "4705876ff7", "file": "AppomattoxNewspapers_1898-1902a_0186.pdf", "page": 1, "text": "I and MORE and always More for I.F.SN money than  Mrs. L. E. Rutledge, who was suc cessfully operated on last week foi tumor, is now out of danger. An enormous tumor, weighing not le.-- than pounds, was taken iron her abddaaen. Dr Julian Abbitt was ssikM pn thp operation by Drs. TalferrrtfofPamplin City Dew, of Lviiobborg D. Mott Robertson"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "City Dew, of Lviiobborg <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "City Dew, of Lviiobborg <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [516.2, 1241.15, 675.33, 1707.25], "bbox_id": "d57b433c1f", "file": "AppomattoxNewspapers_1915-1918a_0445.pdf", "page": 1, "text": "i a n  Dr. D. Mott Robertson has pub lished over his signature in the Nottoway Record an article wh cb contains serious reflections upon me, and he has reiterated the statements of bis published artiicle in speeches be has made in this county. His artiole and his speeches are based upon statements that are fla grantly, viciously and knowingly false. I wish to make reply and ask space in your paper for that purpose. Dr. Robertsons artiole contains these definite charges FirstThat I as Treasurer of Appomattox oounty iu the fall of 1915 authorized n ones to be placed ou the eligible list contrary to law and for the purpose of unlawfully benefiting the Democratic ticket of that year. SecondThat Mr. A. H Hower ton illegally destroyed the ballots that were not used at Oheatwood Precinct in the election of L915, for the purpose of aiding the Democrat ic ticket of that year. ThirdBy reason of my action and Mr. Howertons he was defeat ed for Treasurer of Appomattox oounty in the election of 1915, and other candidates of the so called Gitizens party were also defeated. I will deal with these charges in the order in which they are stated. First, were tuere any names plac ed on the eligible lists by my au thority contrary to Law? I do not believe so. I do not believe that the voters of the county believe so. I do not believe that any honest, fair minded man can be fonnd in the county who will disapprove of what I did. What was done was this after"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "i a n  Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> has pub lished over"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "i a n  Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> has pub lished over"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1451.29, 1330.63, 1843.79, 1368.23], "bbox_id": "eea8fdd705", "file": "AppomattoxNewspapers_1902-1905a_0177.pdf", "page": 1, "text": "I , 19-23-tf. West Appomattox, Va. Iand D Mott Robertson vs. G. H, said Attorney- Chilton, Mary E. Chilton and J. P, Carbon dale I Mr. Charles A. Staples, who shot Moorman. Deed set aside to de to do"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "West Appomattox, Va. Iand <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> vs. G. H, said"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "West Appomattox, Va. Iand <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> vs. G. H, said"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.7, 1487.0, 1621.25, 1700.35], "bbox_id": "3ae8b9320e", "file": "AppomattoxNewspapers_1892-1898a_0280.pdf", "page": 1, "text": "Hundley Springs Notes. During the wiud storm that raged Wednesday the 19, there was a barn blown down on the woodlawn farm, formerly owned by Mr. N. alton, but recently purchased by Mi. Whit Agee, destroying 2,000 pounds of tobacco for colored man that lived on the farm. It is reported that Dr. D. Mott Robertson had a barn blown down also. The wind blew very hard for several hours in this vicinity and there was a cold wave that followed for a few days. The farmers are busy preparing to seed their oats. Mr. W. H. Lewis had a very fitie c o lt crip p led Sunday n ig h t by g e t"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "is reported that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> had a barn blown"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "is reported that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> had a barn blown"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [340.99, 1590.26, 501.71, 2003.15], "bbox_id": "a8eab21258", "file": "AppomattoxNewspapers_1898-1902a_0489.pdf", "page": 1, "text": "his eleven years of service have been marked by an unbroken chain of successes, and whereas the Detno- cras of Appomattox county desire to show their appreciation of his un selfish devotion to the Democratic party therefore, he it  Resolved by the Democrats of Appomattox county, iu mafes-meet- iug assembled, That the delegates to the Norfolk convention be, aud they are hereby, instructed to vote for bis re-election as State chairman. Upon the motion of Dr. D. Mott Robertson, the delegates were in structed to vote as a unit upon ali questions that may come before the con ven tiou. Thereupon the mass-meeting ad journed, and the joint discussion be tween Mr. Flood and Mr. Franklin came on. Mr. Ferguson was called to preside over the meeting, and. an nounced the terms of the discussion, as follows Mr. Flood to open in 30 minutes, Mr. Franklin to follow for 50 minutes, and Flood to conclude in 15 minutes. Mr. Flood devoted his opening speech largely to a vigorous and drastic dissection of Mr. Franklins position on the questions of suffrage and public schools, as set forth in his published card announcing his candidacy. He dwelt at length up on the flagrant inconsistency of Mr."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the motion of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the delegates were in"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "the motion of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the delegates were in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2349.08, 1149.19, 2520.33, 1397.3], "bbox_id": "f5cf972b8e", "file": "AppomattoxNewspapers_1939-1943a_0309.pdf", "page": 1, "text": "He is survived by his parents, Mr. anL Mrs. William C. Chilton a brother, W. C. Chilton, Jr., of Rich mond and the following sisters Miss Nannie Sue Chilton, of Dur ham Miss Eleanor Chilton, o f -Lynchburg Miss Harriett Chilton, of Washington Miss Ava Chilton, of Danville Miss Hazel Chilton, of Cincinnati and Miss Lois Chilton, of Appomattox. Funeral services were held from the Salem Methodist onurch, Spout Spiing, with interment in the church cemetery. Active pallbearers were Howlett Morris, D. Mott Robertson, Norman Hunter Jones, John Tay lor, Hunter Dickerson and Dawson Staples. Town Council Met Monday"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "pallbearers were Howlett Morris, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Norman Hunter Jones, John"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "pallbearers were Howlett Morris, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Norman Hunter Jones, John"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [901.7, 1909.5, 1055.93, 1957.85], "bbox_id": "bd0bc521f6", "file": "AppomattoxNewspapers_1898-1902a_0601.pdf", "page": 1, "text": "Fiye per cent, penalty will be added to all taxes not paid the above dates. D. MOTT ROBERTSON, County Treasurer."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "Fiye per cent, penalty will be added to all taxes not paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "Fiye per cent, penalty will be added to all taxes not paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [882.66, 617.05, 1037.8, 665.19], "bbox_id": "e5c2be244b", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "Fiye per cent, penalty will be added to ail taxes not paid the above dates. D. MOTT ROBERTSON, County Treasurer."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "Fiye per cent, penalty will be added to ail taxes not paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "Fiye per cent, penalty will be added to ail taxes not paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, County Treasurer."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.0, 250.32, 1701.25, 273.32], "bbox_id": "8319ec48a9", "file": "AppomattoxNewspapers_1912-1915a_0494.pdf", "page": 1, "text": "Dr. D. Mott Robertson is im- I proving."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> is im- I proving."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> is im- I proving."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [547.44, 254.04, 709.86, 949.09], "bbox_id": "ee8054c2f9", "file": "AppomattoxNewspapers_1892-1898a_0302.pdf", "page": 1, "text": "Democrats of Appomattox Hold an Enthusiastic Mass-Meeting. A large and enthusiastic mass- meeting of the Democrats of Appo mattox was held at the Court House n Courtday to elect delegates to the Staunton convention. The meeting was called to order by Mr. Joseph Button, county chairman. Mr. W. II. Ligon, was elected chairman, and Mr. S. L. Ferguson, secretary of the meecing. The following delegates and alter nates were elected Delegates at large ton, It. B. Poore, H. D. Mott Robertson. Alternates at large ton, J. R. Atwood, T. J. and J. K. Hannah. Southside districtDelegates . John Overton, J. C. Jones. R. F. Burke and W. II. Lewis. Alter nates, S. P. Coleman, A. H. Abbitt, C. N. Abbitt and G. A. Walton Stonewall districtDelegates  I. M. Golliday, S. C. Stratton, Walter Forbes, and D. A. Christian. A1 ternates J. R. Horsley, J. W. Davidson, E. A. Walton and M. F. Kyle. Clover Hill districtDelegates  W. H. Ligon, W. B. Forbes, E. E, Chism, and S. L. Ferguson. Alter nates  R. W. Bristow, L. A. Bagby, W. J. Trent and F. W. McKinney. The following resolutions were introduced by Senator H. D. Flood and adopted with but one dissenting voice. Resolved, by the Democratic party of Appomattox county,in mass meet ing assembled First. That we reiterate and re affirm our allegiance to the Demo cratic party, and pledge our heatty support to the nominees of the Dem ocratic convention, national and dis trict. Second. That we favor the free and unlimited coinage of silver at the ratio of 10 to 1 , without reference to the position of any other nation on this questin, and hereby instruct our delegates to thcState convention not to vote for any oue as a delegate to the national convention who does not favor this policy."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "It. B. Poore, H. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Alternates at large ton,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "It. B. Poore, H. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Alternates at large ton,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [563.04, 934.62, 888.24, 1139.97], "bbox_id": "05b2971869", "file": "AppomattoxNewspapers_1892-1898a_0406.pdf", "page": 1, "text": "Democratic Mass-Meeting. At n meeting held in the Court House on Thursday last for the pur- pose of nominating District officers to be voted for at the coming elect ion, May 27th, it was moved that Dr. D. Mott Robertson be made chair mail and F. W. McKinney, secretary The county then divided up in districts and repaired to the ante-rooms, and after some de- . . , . . . . liberation reported the folloaiag nominations to the mass-meeting.   know what has restored them to OLOVEA HILL DISTRICT. I fuhoteof tWstewspapers In Iowa. SupervisorW. H. Ligon. Con-1 writea from Bloomfield la., Aug 181896. My stableP. W. M eK inae,., W. J . Trout, W. 1. Hix, R. H."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "was moved that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> be made chair mail"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "was moved that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> be made chair mail"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [558.01, 898.26, 723.33, 1404.84], "bbox_id": "8309361ae8", "file": "AppomattoxNewspapers_1892-1898a_0407.pdf", "page": 1, "text": "Democratic Mass-Meeting. At a meeting held iu the Court House on Thursday last for the pur pose of nominating District officers to be voted for at the coming elect ion, May 27th, it wus moved that Dr. D. Mott Robertson be made chair mau and F. W. McKinney, secretary The county then divided up in districts and repaired to the ante-rooms, aud after some de liberation reported the foRowing nominations to the mass-meeting. OLOVE.I HILL DISTRICT. SupervisorW. H. Ligon. Con stableF. W. McKinney. . Justices W. J. Treut, W. D. Hix, U. H. Beale. Overseer poorE. E. Chism. STONE WALL DISTRICT. SupervisorS. C. Stratton. Con stableH. C. Babcock. Justices- J. W. Davidson, N. W. Owen, J. S. Thornhill OverseerG. L. Fer guson. SOUTH SIDE DISTRICT. SupervisorJ. C. Jones. Con stableA. H. Abbitt. Justices- Juo. T. Lee, Simeon Harvey, Lamech Jones. Overseer poorS. E. How erton. Themassmeeting was well-attended aud the tiominees are all good strong meu. They pledged themselves to the service of the party by accepting the nominations and will all makej an effort to get out the full vote of the party on Thursday May 27tb. The offices have been well distributed over the county and good true men selected to fill them. Now, je sore that you do your duty and each of them will be elected."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "wus moved that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> be made chair mau"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "wus moved that Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> be made chair mau"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.45, 590.27, 1825.4, 722.0], "bbox_id": "c3ecca01b4", "file": "AppomattoxNewspapers_1892-1898a_0411.pdf", "page": 1, "text": "Death of a Popular Lady. Mrs. Sarah Francis Abbitt, wife of Dr. W. H. Abbitt died yesterday morning at 8 oclock of paralysis at her home here. She was strickeu down with the fatal stroke on las 1 Saturday and uever recovered, though retained consciousness until iter death. Dr. Dew, of Lynchburg and Dr. D. Mott Robertson, were called in consultation with the three"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Lynchburg and Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, were called in consultation"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Lynchburg and Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, were called in consultation"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2015.97, 1103.32, 2146.16, 1113.36], "bbox_id": "9825b09481", "file": "AppomattoxNewspapers_1918-1922a_0087.pdf", "page": 1, "text": "D Mott Robertson, deceased"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, deceased"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, deceased"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1819.9, 246.45, 1985.27, 587.14], "bbox_id": "5f56262a19", "file": "AppomattoxNewspapers_1892-1898a_0411.pdf", "page": 1, "text": "D. Mott Robertson and others, Appomattox G. H., V a. G entlemen  Yonr petitiou for a Farmers Institute, to be held at Ap pomattox O. H., received, and in reply thereto, will say that it will give me pleasure to comply with yonr request, and will take steps to accomplish the same. Yours respectfully, J ames R. K emper , Member Board Agl. 10th District. To further the cause of the Far mers Ibstitqte and perfect the ar rangements for holding same the following committee has been ap- appointed by Mr. Kemper, which committee is called to meet at the courthouse next couuty court day  J. R. Horsley, D. Mott Robertson, H. D. Flood, Judge D. A. Christian, T. W. Evans, L. E. Smith and A. H. Clement This is to be the most important meeting of the kind ever held in the county, aud the T imes will keep the farmers posted as to its progress. No date can be given ntil after the committee meets, but we are informed that it will be held about August 1 st."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and others, Appomattox G."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> and others, Appomattox G."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [511.91, 783.7, 634.41, 829.24], "bbox_id": "0b47670ab9", "file": "AppomattoxNewspapers_1892-1898a_0415.pdf", "page": 1, "text": "D. Mott Robertson  aids. Burke, R. C. Harvey, Lut Grand, Richard Burke, Fit guson, Hubbard Coleman"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>  aids. Burke, R. C. Harvey, Lut Grand, Richard Burke, Fit guson, Hubbard Coleman"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "<mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>  aids. Burke, R. C. Harvey, Lut Grand, Richard Burke, Fit guson, Hubbard Coleman"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1383.53, 927.5, 1704.41, 1188.29], "bbox_id": "20e64acc14", "file": "AppomattoxNewspapers_1922-1923a_0546.pdf", "page": 1, "text": "D e ath o f M rs D. M. R obertson. Mrs. D. Mott Robertson died at her home in Appomattox county at three oclock Sunday afternoon, after an illness of several months duration.  The remains were taken to Old Concord church Tuesday evening where Rev. Mr. Jett con ducted the simple but beautiful burial service. The choir softly aang I Would Not Live Alway, and Asleep in Jesus, after which the body was interred in the family burying gronnd at Old Concord in the presence of a large assem blage of friends of the family. The pall bearers were Messrs. E. P. Carson, Hunter Howerton, Rich closed a weeks engagement here on lard Smith, Glover Goff, Leslie Mor- last Monday night. They present-1 ris and Mosely Hunter. The flower ed good plays and the people around I bearers were Messrs. Watkins Now- enjoyed them."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "M. R obertson. Mrs. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> died at her home"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "M. R obertson. Mrs. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> died at her home"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [244.11, 510.62, 400.41, 733.87], "bbox_id": "b7b80acfb5", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": "COUNTY T A X E S. Dr. D. Mott Robertson, the pleas ant and efficient tresurer of Apjjo- mattox county, has begun his rounds collecting taxes for the year 1894. The tax payers will observe that the county lerj is 40 cents on the hundred dollars worth of property instead of 65 cents as it was for 1893. The county levy for 1893 was laid to meet appropriations made by a Republican Hoard of Supervisors, that for 1894 to meet those made by the Democratic Board elected in May 1893. The tax-payers should note tnis and remember that a Democratic Board hu6 reduced the couuty levy more than one-third."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "X E S. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the pleas ant and"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "X E S. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, the pleas ant and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [459.85, 1049.36, 784.49, 1243.45], "bbox_id": "1a57bc40eb", "file": "AppomattoxNewspapers_1918-1922a_0107.pdf", "page": 1, "text": "Commissioners Sale Valuable Appomattox County Farms D. Mott Robertson Lands As Commissioner of the Circuit Court of Appomattox county. Vir gioia, in the chancery suit of Mary A. Roiertson et als ve. Ella E. Rob ertson, and in pursuance of a decree of sale entered in the said cause at the October Term, 1919,1 will, on Saturday, 13th day of December, 1919, at 11 oclock A. M."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Valuable Appomattox County Farms <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Lands As Commissioner of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Valuable Appomattox County Farms <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Lands As Commissioner of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.05, 1063.92, 769.4, 1253.96], "bbox_id": "fcd718505e", "file": "AppomattoxNewspapers_1918-1922a_0105.pdf", "page": 1, "text": "Com m issioners Sale of V alu ab le Appom attox County Farms D. Mott Robertson Lands As Commissioner of tbe Circuit Court of Appomattox county. Vir giuia, in tbe chancery suit of Mary A. Robertson et als vs. Ella E. Rob ertson, and in pursuance of a decree of sale entered in the said cause at I the October Term, 1919,1 will, on Saturday, 13th day of December, 1919, at II oclock A. M."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Appom attox County Farms <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Lands As Commissioner of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Appom attox County Farms <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Lands As Commissioner of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.29, 1318.85, 1732.31, 1702.4], "bbox_id": "6f897389b2", "file": "AppomattoxNewspapers_1905-1912a_0423.pdf", "page": 1, "text": "Circuit Court Circuit Court convened here Mon day with Jndge Geo. J. Handley sitting. The following orders, de crees, Ac. vere entered Commonwealth vs. Auna B.Phelps on an indictment for selling whis key she plead guilty and was fined 50. There are two 0 th  cases against her ahich were continued. Commonwealth vs. Archer H. Stephens upon an indictment for the sale of liquor. Dismissed and accused discharged. Commonwealth vs. G. C. Step hens, upon an indictment for the sale of liquor. Fined 50. There are two other indictments against the accused which were continued. R. R. Davis vs. A. W. Pan let t motion for judgment dismissed. D. Mott Robertson qualified ai guardian of his infant children. C. H. Be.isley A Bro. vs. H. C. Wright judgment  to plaintiffs for 467.99. Laura A. Walker qnalitied as gnardian of Mary E. Gooding. Lovena Litbgo qualified as guar dian for Jno. T. Gooding. NOTICE I Jno. D. Abbitt vs. N. A W. By. Manruge and death notices must I Go., for killing mule on track of"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "motion for judgment dismissed. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> qualified ai guardian of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "motion for judgment dismissed. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> qualified ai guardian of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.11, 1106.67, 1774.21, 1345.88], "bbox_id": "ddc7c9620a", "file": "AppomattoxNewspapers_1915-1918a_0470.pdf", "page": 1, "text": "Card From Mr. Coleman Editor Timee-Virginian In o ir issue of Oot 3, Dr. D Mott Robertson published a state ment which 1 signed as Olerk at tbe lection at Gheatwood precinct, No vetnber, 1915, which reads ae fol lows This certifies that the bal lots at Gheatwood precinct were not counted after the election November, 1915. Therefore we can not awear that all unused ballots wee burned some distance from the voting place. In this statement 1 did not mean to convey the idea that the ballote which were voted at that election were not oonnted, for they were counted, and dealt jvith according to law but the nnused ballots were not oonnted, but were burned. S. P. C oleman ."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Oot 3, Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> published a state ment"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of Oot 3, Dr. <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark> published a state ment"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [233.75, 429.88, 390.8, 691.88], "bbox_id": "7353e33ad4", "file": "AppomattoxNewspapers_1892-1898a_0240.pdf", "page": 1, "text": "Below we give the vote of the county for the various offices as ascertained by the Commissioners of Election. Tbev have not counted the vote of Spout Springs precinct, as they adjourned over until Monday to consider some irregularites of that point. As ascertained by them the vote stands as follows  For Treasurer. D. Mott Robertson..................... 705 W. J. Trent................................. 496 For Commonwealth Attorney. H. D. Flood................................. 639 W.C. Franklin .......................... 575 For Sheriff. S. P. Coleman ............................. 1168 Commissioner Revenue. L. E. Smith................................. 753 E. F. Collins ................................ 398 Supervisors."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "as follows  For Treasurer. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>..................... 705 W. J. Trent................................."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "as follows  For Treasurer. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>..................... 705 W. J. Trent................................."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [601.89, 1312.78, 924.79, 1645.77], "bbox_id": "4c17200f13", "file": "AppomattoxNewspapers_1898-1902a_0303.pdf", "page": 1, "text": "be 18 instead of 9 delegates, each to be entitled to one half a vote. The meeting was again called to order, and the following gentlemen, nominated by district meetiugs, were elected by the mass-meetihg  Clover-Hill DistrictR. B. Poore, W. H. Ligon, Joel Watkins, O. A. Trent, J. P. Ferguson, and Walter Forbes. Southside DistrictDr. D. Mott Robertson, S. L. Ferguson, W. A. Moses, E. W. Taylor, L.Er Smith, and J. B. Abbitt. Stonewall DistrictS. 0. Strat ton,. R. Horsley, Dr. Thomas R. Rucker, Jos. Button, A. B. Thorn hill, and W. C. Abbitt. The followiug resolution was then adopted  Resolved by the Democrats of Ap- commiitee was appointed, and it was p 0 niattox, iu mass-meeting assem- decided to enlarge and improve the bled, that the delegates this day elected to the convention which as sembles at Buena Vista on Angust 1 st to select a standard-bearer for the coming congressional election be instructed to vote foi the foremost Democrat of the county, who is, in"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Walter Forbes. Southside DistrictDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, S. L. Ferguson, W."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Walter Forbes. Southside DistrictDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, S. L. Ferguson, W."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [673.49, 1432.48, 832.12, 1724.52], "bbox_id": "50db75301f", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "Average for 12 years R. F. Burke. Tr. .96 2-3c. Average for tw elve years D Mott Robertson, Tr., 67 1 12 c. Increase taxation under K. F Burkes, 29 7-12c , plus 50c capitation tax since 1906, an the State levy had been reduc ed 5c on 100 w hich they failed to state- W e w ill consider again the increase of taxes under R. Burke, Treasurer, and Dr D Mott Robertson, Treasurer Amount of m oney expendec for tw elve years under R.  Burke, Treasurer, 115,347 54 Am ount of m oney expended for tw elve years under D Mott RobertBon, Treasurer, 78,178.- 01 . Increase under R. F. Burkes, 37,169 53. During the tw elve years of D. Mott Robertsons incui benev, the Court H ouse, ahd jail waa built as w as the road m achine and road team s boug and all paid for county out of de for county purposes w  ii"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "for tw elve years <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, Tr., 67 1 12"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "for tw elve years <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, Tr., 67 1 12"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [535.69, 1554.19, 690.68, 1716.79], "bbox_id": "e590f360f1", "file": "AppomattoxNewspapers_1902-1905a_0362.pdf", "page": 1, "text": "At a meeting of the Democratic Executive Committee held here last Saturday Dr. D. Mott Robertson was elected county chairman and the precinct committees were ap pointed to get out the vote. Mr. J. R. Horsley was made secretary of the committee. It was understood that another would be elec ed to serve as chairman of the committee, but the Doctor was present and the committee saw in him the material for a good servant and elected him without oppostion."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "here last Saturday Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was elected county chairman"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "here last Saturday Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was elected county chairman"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [191.5, 1049.57, 363.95, 1629.09], "bbox_id": "f9f47738ca", "file": "AppomattoxNewspapers_1892-1898a_0431.pdf", "page": 1, "text": "At a largely attended meeting ot the Committee, on Farmers Institute held at this office last Saturday the committee decided to postpone the Institute until Friday and Saturday, August 20 and 21. This action of the committee was taken mainly with the view of changing the dates from a busy Beason with our farmers so that all the agriculturalists of the county might be in attendance. Also to avoid the dates of the Baptist Associations which would have con flicted with the former dates. The committee urged the importance of a meeting here next court, Aug. 5tb of all the farmers from each pre cinct in the county, for the purpose of ascertaining the amount of pro visions each precinct in the county will furnish. The general commit tee was increased, which now stands as follows Committee on Dinner  W. H Ligon, T. A. Smith, Joel Cawthorn D. Mott Robertson J. F. Purdum, H C. Babcock, S. C. Stratton, James D. Martin, J. K. Hannah and Maj. J. W. Flood. Committee called to meet court day. Committee ou ArrangementsT. A. Caldwell, W. J. Trent and J. H. Robertson. Meet court day. Committee on PublicationL. E. Smith and A. H. Clement Meet court day. Committee ou MusicC. A. Ab bitt, Clinton Cawthorn, C. W. Han cock, J. R. Caldwell and Peter Strat ton. Meet court day. Other members ave J. R. Hors ley, Dr. T. W. Evans and Judge D A. Christian. Every Appomattox farmer is in vited to attend these committee meetings, especially the precinct meetings which will be held here on next court. _ __________"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "A. Smith, Joel Cawthorn <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> J. F. Purdum, H"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "A. Smith, Joel Cawthorn <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> J. F. Purdum, H"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [942.25, 1621.27, 1098.35, 1932.91], "bbox_id": "4b9743dd3f", "file": "AppomattoxNewspapers_1898-1902a_0597.pdf", "page": 1, "text": "As required by law, I will be at the following places, either in per son or by Deputy, on the. days and dates named below, for the purpose of receiving Taxes and Levies for the year 1901 Spout SpringThursday, Novem ber 21st, 1901. West AppomattoxFriday, No vember 22nd, 1901. EvergreenSaturday, November 23rd, 1901. Famplin CityMonday, Novem ber 25th, 1901. Hixburg  Tuesday, November 26th, 1901. Tower HillWednesday, Novems ber 27th 1901. Oakvi.le  Tfnrsday, November 28th, 1901. MineralFriday, November 29th, 1901. KrlSaturday, November 30th, 1901. West AppomattoxCourt Dav December 5th, 1901. Fiye per cent, peualty will be added to ail taxes not paid the above dates. D. MOTT ROBERTSON, Conntv Treasurer."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Conntv Treasurer."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "paid the above dates. <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Conntv Treasurer."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1993.0, 746.69, 2168.69, 841.89], "bbox_id": "3c32d4e41a", "file": "AppomattoxNewspapers_1918-1922a_0085.pdf", "page": 1, "text": "As administrator of the M- lt  D Mott Robertson, I will rffir fo r! sale at public auction lo the highest  l bidder, at the late residence of Dr.  Robertson, about 5 miles south of I I 8pout Spring, a station on the Nor   folk  Western railroad, in A ppo- mattox county, on 11"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of the M- lt  <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, I will rffir fo"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of the M- lt  <mark>D</mark> <mark>Mott</mark> <mark>Robertson</mark>, I will rffir fo"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [395.99, 1046.97, 561.07, 1383.19], "bbox_id": "91e20c4f99", "file": "AppomattoxNewspapers_1892-1898a_0514.pdf", "page": 1, "text": "Appomattox, Va., May 5 thThe Democra ts of Appomattox couuty met today at the courthouse at 12 oclock for the purpose of electing delegates to the Democratic conven tion to be held at Covington on June 22nd. The meeting was called to order by S. L. Ferguson. Dr. J. B. Abbitt was elected chairman, W. II. Burke and A. H.Clement, secretaries. The following delegates were elected  Southside DistrictDr. D. Mott Robertson, T. A Smith, S. L. Fer guson, J. W. Harvey, J. II. Robert son aud W. H. Burke. Clover Hill DistrictMajor J. W. Flood, W. H. Ligon, It. W. Beal, W. J. Trent, E. E. Chism and R. W. Bristow. Stonewall Distrist T. J.Stratton, I. A. Christian, Jesepli Button, M. F. Kyle, J. H. Featherstone, and J. R. Horsley. On the motion of Dr. Robertson, the following resolution was unani mously adopted  Resolved, by the Democrats of Appomattox couuty, in mass-meet ing assembled, tliat the delegates this day electe.i to the congn.ssional convention which meets in Coving ton, Va., on June 22, 1898, are hereby instructed to vote for her favorite son, Hon. H. D. Flood, so"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "were elected  Southside DistrictDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, T. A Smith, S."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "were elected  Southside DistrictDr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, T. A Smith, S."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1591.2, 219.81, 1897.11, 383.46], "bbox_id": "86eab557af", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "and Miss Ura Harris, of Roanoke, I the courthouse here Saturday, j Dr. D. Mott Robertson was nom inated for the Legislature, to oppose Hon. R. L. Burke, the nominee of the Democratic par ty. This will be a warm con test, as both candidai as are I popular and have many friends. The Citizens Party put forth j an extension platform of prin ciples among the planks is one endorsing woman suffrage. The election in November will de cide the contest."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "here Saturday, j Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was nom inated for"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "here Saturday, j Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was nom inated for"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [574.81, 758.05, 746.3, 964.6], "bbox_id": "c49dade633", "file": "AppomattoxNewspapers_1947-1949a_0260.pdf", "page": 1, "text": "And how many doctors do you think there were in Appomattox County at that time? One or two? Youre wrong! Travel wasnt easy then. A doctor could serve only a H mi tod territory. The  following were practicing medicine in Appo- matto County when Dr. Christian started Dr. R. A. North, at Oak ville Dr. D. Mott Robertson, near Spout Springy Dr. James Abbitt, at Appomattox Dr. D. N. Twyman, i at Appomattox Dr. Chap Jones,! at Appomattox Dr. F. H. .Lukin,  at Pamplin  Dr. Hart, at Pamplin  - Dr. Walker, at Evergreerj, Dr. I Northington, at Stonewall and at Concord, just across the county line, Dr. W. L. Ould was practic ing. That makes eleven doctors in the area !"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "at Oak ville Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, near Spout Springy Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "at Oak ville Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, near Spout Springy Dr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1772.66, 804.06, 1929.01, 1017.05], "bbox_id": "9bc24b0891", "file": "AppomattoxNewspapers_1915-1918a_0449.pdf", "page": 1, "text": "amine the past elections in this county t.nd especially the one in the fall of 1915, you will see that I have unearthed enough off-hand to con vince any intelligent man that enough fraud was committed to de feat me and other candidates of the Citizens Party. Mr. R. F. Burke says, I have not inj cted myself into this contest,but tbac.it has been forced npoe me by the false, malicious and gratuitous charges of Dr. D. Mott Robertson. 1 have led an honeBt life and I have never before had my integrity qnes tioned. and I do not intend to sub mit to it being questioned now. Yon can see from the law I have not charged Mr. R. F. Burke, with anything the iaw does not sustain me in, his lawyers to the contrary notwithstanding."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "gratuitous charges of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. 1 have led an"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "gratuitous charges of Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. 1 have led an"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [905.71, 764.09, 1062.39, 881.82], "bbox_id": "e0c92c7db9", "file": "AppomattoxNewspapers_1898-1902a_0097.pdf", "page": 1, "text": "All persons wishing to save the 5 per cent, chargeable on tb 6 first day of December, 189, will meet me at the timesand places specified below, and pay their taxes for 1896. Spout Spring, November 28th. West Ap omattox. November 39th. Evergreen, November 30th. PamplinCity, December l wt.  Hixburr,  3nU. Tower Hill.  3rd. Oakville,  5th. Mineral,  6 th, Stonewall,  7th. West Appomattox, court day, December 6 . Very Respectfully, D. MOTT ROBERTSON, Treasurer of Appomattox Count j."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "December 6 . Very Respectfully, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Treasurer of Appomattox Count"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "December 6 . Very Respectfully, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Treasurer of Appomattox Count"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [949.51, 1322.79, 1105.68, 1439.77], "bbox_id": "251db5c7c3", "file": "AppomattoxNewspapers_1898-1902a_0089.pdf", "page": 1, "text": "All perrons wishing to save the 5 per cent, chargeable on th6 first day of December, 1898. will meet me at the times and places specified below, and pay their taxes for 1898. Spout Spring, November 28th. WestAp omattox. November 29th. Evergreen, November 80th. Pamplin City, December 1st. Hixburg, 2nd. Tower Hill.  3rd. Oakville, 44 5th, Mineral, 44 dth. Stonewall. 44 7th. West Appomattox, court day, December 8. Very Kespeetfufiy, D. MOTT ROBERTSON, Treasurer of Appomattox County."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "December 8. Very Kespeetfufiy, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Treasurer of Appomattox County."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "December 8. Very Kespeetfufiy, <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, Treasurer of Appomattox County."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.53, 461.62, 1180.15, 539.67], "bbox_id": "c21e4c90aa", "file": "AppomattoxNewspapers_1892-1898a_0358.pdf", "page": 1, "text": "All parties n o t owning land in th e ir own nam e w ill please call fo r such tic k e ts and save th e 5 p er cent, p en alty . A ll persons w ho are in arrears fo r tax es fo r th e y ear 1895 m ust m eet me a t th e above nam ed p laces and se ttle fo r sam e th u s saving y o u r p ro p erty and saving me from th e u n p leasan t d u ty or levy ing and save you rom e x tra co st im posed by law. V ery resp ectfu lly . D. MOTT ROBERTSON, T reas. A p pom attox C ounty."}, "highlight": {"text": {"matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "ery resp ectfu lly . <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, T reas. A p"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "MOTT", "ROBERTSON"], "snippet": "ery resp ectfu lly . <mark>D</mark>. <mark>MOTT</mark> <mark>ROBERTSON</mark>, T reas. A p"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [545.29, 374.96, 707.05, 1193.81], "bbox_id": "9290639623", "file": "AppomattoxNewspapers_1915-1918a_0462.pdf", "page": 1, "text": "A V A L U A B L E L A W M A K E R . fCSatan rww Orrirw. In the Tenth Congressional district there is but one county in which there appears to be strong opposition to the Demo cratic nominee for the House of Delegates and that county is Appomattox. Hon. R L Burke is the present represent stive in the House from Appo m atter county and is the nomi nee of the Democratic party for re-election. Dr. D. Mott Robertson is opposing Mr Burke and we believe is the nominee of some party, the name of which is not recogniz ed by either Republicans or Democrats. During the one term be has s e r v e d in the House of Delegates Mr. Burke has given a good account of himself. He is acquainted with legislative machinery, is popu lar with the members, about fifty per cent of whom will be admitted to the Democratic caucus and given important committee assignments. His opponent will have no such op portunity u serve his constitu ents in theeventof his election, which we trust is doubtful. For these-sod added reasons, the people of Appomattox conn ty should return D e l e g a t e Burke to the House by an in creased m ajority. There is nothing to gain by electing Dr. Robertson, who is an untried man in the halls of legislation. Besides, the last named gentle man is not a Democrat and would be very much like a fish out of water when it came to securing any legislation for the benefit of his people. We can bear testimony to the fact that Mr. Burke was attentive to hii duties in the last House. H was punctual on the see sions of the larger body and seldom missed a meeting of any of his committees. If oar memory is not at fault, he missed few roll calls, thus showing his deep interest in the work he wsb called upon to perform for his county. The good people of Appomattox county will make a mistake if they fail to vote for Mr. Burke, a m istake we trust they will not be led into On the night of the election we hope to hear of oar friend victory and by such a majority that it will forever bury the op position to Democracy in the county above mentioned."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "party for re-election. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> is opposing Mr Burke"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "party for re-election. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> is opposing Mr Burke"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1771.79, 411.59, 1931.49, 480.59], "bbox_id": "c41eb28b97", "file": "AppomattoxNewspapers_1915-1918a_0531.pdf", "page": 1, "text": "A t the sale of the M ethodist parsonage lots on Saturday, lo No. 1 was bought by Mr J . E . M artin nd lot No. 3 by Dr. D. Mott Robertson. The prioe paid, was 1000 each."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "No. 3 by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. The prioe paid, was"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "No. 3 by Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. The prioe paid, was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1693.69, 769.26, 1852.51, 874.76], "bbox_id": "0dd6c2fd3c", "file": "AppomattoxNewspapers_1902-1905a_0491.pdf", "page": 1, "text": "A t a largely attended meeting of the farmers here last Saturday a County Organization was perfected as follows of the A, S. E. J . F. Purdum, President, Edward Cald well, Secretary, A. H . Howerton, County Organizer. Dr. D. Mott Robertson was made temporary Chairman."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Howerton, County Organizer. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was made temporary Chairman."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Howerton, County Organizer. Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> was made temporary Chairman."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [669.35, 200.09, 826.09, 1106.4], "bbox_id": "5363db5bbe", "file": "AppomattoxNewspapers_1915-1918a_0453.pdf", "page": 1, "text": "A CARD I d tbs September 7, 1917, issue of The Nottoway Record-, there ap peared an article headed  D. Mott Robertson Makes Statement. My duty to the citizens of Appo mattox county and my duty to my self impels me to make reply to this statement. In this article, Dr. Robertson, re ferring to the election in 1915 for the Treaanryahip of Appomattox connty, uses the following langnage Now, Mr. Voter, yon can see that we were defeated by this illegal act, logether with the illegal act of Mr. A. H How erton, who claimed that the law said the nnnsed ballots most be burnt. Read the law below and yon will see that the word burn does not occur save in the imagination of Mr. A. H How erton, who evidently wished to procure some ballots for some purpose known only to himself and his allies. Briefly stated, the facts, insofar as my connection with said election e concerned, are as follows I was one of the three judges of election at the precinct known as Oheatwood. When the p o l l s closed, I and the other judges pres ent were of the opinion that the unnaed ballots should be burnt. As matter of fact the statute do s not use the word burnt, hut uses the word destroyed. It is true that the ballots we-e not destroyed be fore the ballot-box was opened, be cause, being under the impression that they should be burned, it was thought wisest not to burn them on the inside of the old and dilapi dated house in which the election was being held. They were, how- ver, turned over to Mr. 8. P. Oole- man, jr , who in a short time there after, and on the outside of the house, burnt them, with two of the judges present witneeeing the burn mg. The failure of myself and the other judges to destroy these ballots before opening the ballot box bad absolutely no effect whatever upon the resalt of the election at that precinct, for the simple reason that not one of the an used ballots was ever used for any improper purpose, each and every one of them being destroyed. There were only two candidates for Treasurer, Mr. R. F. Burke,who was elected, and Dr. D. Mott Rob ertson, who was defeated. At m precinct of Oheatwood, Hr. Bnrke only received eight votes, which were counted for him, and I am hereto attaching the signed state ment of the eight men who vofed for him on that occasioo We, wnose names are signed to this pap -r, do certify that we voted for R. F. Bnrke for Treasurer of Appomattox Goan- tv, Virginia, in the General Election held in November, LSI 5, at Oheatwood precinot, Appomattox connty, Va. This September 19,1917.  Signed 8. P. C oleman , J r ., W. D. Doss, D S. E vans , E. T. D ickerson , J. F. H olt , J. G. G entry , G. T. Doss, A. H. H owerton ."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "peared an article headed  <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Makes Statement. My duty"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "peared an article headed  <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> Makes Statement. My duty"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [461.75, 314.3, 618.95, 481.52], "bbox_id": "985dfd6f1c", "file": "AppomattoxNewspapers_1898-1902a_0429.pdf", "page": 1, "text": "7 CAL AND liißSO NAL - ------ - -jjfef c   OUR OFFICERS. APPOMATTOX, COUNTY ornciu. Judge of Circuit CourtGeo. J. Hundley luui is. Krst day of April and October. judge of County Court--D. A. Christian. Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. leer,. Attorney for CommonwealthH. D. Flood Vherilf8. P. Coleman. Treasurer D. Mott Robertson. Commissioner of FevenueL. B. Smith, iioard of SupervisorsW. H. Ligon, chair man 8- C- Stratton and J . C. Jones. Board nisstt on Wednesday after first Monday in March. June, September, and December."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Vherilf8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Commissioner of FevenueL. B."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "Vherilf8. P. Coleman. Treasurer <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>. Commissioner of FevenueL. B."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [440.16, 1549.45, 766.51, 1837.89], "bbox_id": "d194b51ce8", "file": "AppomattoxNewspapers_1918-1922a_0105.pdf", "page": 1, "text": "3 THE WOOD LAND BRICK HOUSE TRACT of 43.46 aares of w odiand. This tract adjoins No. 2the Sallie Ar rington Tractand No. 4tbe J. K. Atwood Tract. 4 THE J. R. ATWOOD TRACT of 35.8 icres of wool- laud adjoining No. 2tbe Sallie Arrington Tractand No. 3the Wood Land Brick House Tract. These are exceptionally fine productive farms and in a high state of cultivation. A plat of the lands can be seen at the Olerks Office at Appomattox Court House, or tbe office of the Commissioner, No. 402 Krise Building, Lynchburg, Va. TERMS OF SALEOne fourth cash, and as to the balance of the purchase money upon a credit of one, two and three years, the purchasers to execute their obligations for the deferred payments of the purchase money, bearing interest from the date of sale, which interest shall be payable semi-annually the title to the property to be retained until the entire purchase money has been paid HENRY M. SACK ETT,  ommissioner. The bond required of Henry M. Sackett, Commissioner, by the de cree of sale in the above suit has been executed by him. O. W. SMITH, Clerk. Immediatelv after tbe sale by Henry M- Sackett, Commissioner, of tbe above land, 1 will off r for sale at tb same place the following per sonal property One pair mules, one iwo-horre wagon, about 200 basn ets of wheat, 75 to 100 barrels ol corn, aui about ten sucks of hay. R. G. ROBERTSON, Admr., , D. Mott Robertson, Dtcd."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "R. G. ROBERTSON, Admr., , <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Dtcd."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "R. G. ROBERTSON, Admr., , <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, Dtcd."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [456.0, 1311.1, 755.9, 1411.65], "bbox_id": "e4a141962c", "file": "AppomattoxNewspapers_1918-1922a_0105.pdf", "page": 1, "text": "1. THE HOME PLACE of the late Dr. D. Mott Robertson oontaimng 341 r-jres on Falling River, upon which is located a com bination trame aud stone dwelling of ten icoms, three tenant houses, horse barn with tails for twelve horses, grantrv, ice house, smoke house, two corn cribs, garage, chicken home and four or five tobacco barns. About fifty acres ot this land is woodland, with sufficient wood for domesc purposes. Theie is an orchard ol 400apple trees, apd about 200 teres of the r?maiuder is in a high state of cultiva tion, end is, perhaps, ae fine highland as is o be found ia this sec tion of the Slat1. The farm is well fenced and cross fenced."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of the late Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> oontaimng 341 r-jres on"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "of the late Dr. <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark> oontaimng 341 r-jres on"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.05, 310.43, 1604.0, 637.47], "bbox_id": "1d5829ec2d", "file": "AppomattoxNewspapers_1962-1965a_0422.pdf", "page": 1, "text": ". Mae Irvin Vaug- L of Janies Melvin  of 204 Westover Blvd., Lyncb- t , g died Tueday  burg, a retired farmer, died at 5    a.m. Thursday, June 4, at his Charlotte home after a brief illness. Born in Appomattox County, he was the son of Chapman Hunter and Mary Elizabeth El liott Chilton. He was a member of Salem Methodist Church at Spout Spring. His wife was the late Jemima Sue Cheatham Chil ton. He is survived by six daugh ters, Eleanor Chilton, Ava Chil ton and Mrs. Lois Fantini, all of Lynchburg Mrs. B. W. Lance of Asheville, N.C., Harriest Chil ton, of Falls Church, and Mrs. H. A. McDaniel of Altanta, five grandchildren and one great grandchild. Funeral services were conduct ed at 11 a.m. Saturday at Salem Methodist Church by the Revs. B. L. Livingston and Norwood Montgomery. Burial was in the church cemetery. Pallbearers were Raleigh H. Chilton, Phillip Myer, D. Mott Robertson, H. S. Jones, Raymond Rosser and E. D. Jones."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "H. Chilton, Phillip Myer, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, H. S. Jones, Raymond"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "H. Chilton, Phillip Myer, <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, H. S. Jones, Raymond"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [152.41, 1558.26, 326.87, 1782.84], "bbox_id": "44b8b3d817", "file": "AppomattoxNewspapers_1892-1898a_0100.pdf", "page": 1, "text": "_____ I support We presume not, for while claiming to be a Populist he declined to snp- . port D. Mott Robertson, their can-j- didate for Congress last Fall. Will the Republicans sup We presume not, for he knifed E. F. Collins, their candidate for Clerk last Spring. Collins only received twelve votes at Thornhills precinct Will th e Democrats support him ? Certainly no true Democrat will lend aid and comfort to a man who is running against the regular nominee a hk party. So the conundrum will remain un answered until election day, and we are strongly inclined to the belief it will so remain for some time"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "declined to snp- . port <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, their can-j- didate for"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "declined to snp- . port <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, their can-j- didate for"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [577.5, 1794.28, 727.09, 2003.08], "bbox_id": "fdb5e56d12", "file": "AppomattoxNewspapers_1898-1902a_0190.pdf", "page": 1, "text": "_ C O U N T Y O FFICER S, treasurer- D. Mott Robertson, 733.  AttocV. for the CommonwealthH. e A y P. Coleman, 761. Jgk of County and Circuit Courts EPeers. 42 J . K. Horsley. 13. JBpmmissioner o f the RevenueL , E. , 47Y H . C. Babcock, 404. D IST R ICT O F FIC E R S. S o u t h s id b D is t r ic t . PJr SupervisorJ . O. Jones. 229. For ConstableA . H . Abbitt, 232. For justicesJ . T .A ee, 187 Lantech Jones,-  j . R. H ill, 82 S. E . Howorton, 74 E. G. vey, 180, C 1 .OVKR--H 11 .L D is t r ic t . Ir SupervisorW . H . logon. 233. Er Constable-C. W. Inge, 126 for W. B. EfjustlcesP. M. Hannah. 167 William J. it 188 J- H. Forbes, 69 P. H. Fore, 184. overseerof PoorJ. W. Wright, 224. S t o h b w a ia , D is t r ic t . SupervisorS. c. Stratton, 234. fonstableH. C. Doss, 127 J. E. Chick, JusticesA. B. Thornhill, 141 J. C. 1 160- W C. Abbitt, 170 N. W. Owen, Vi! Stratton, 39 J. H. Thornhill, 38 kidson, 23."}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "O FFICER S, treasurer- <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, 733.  AttocV. for the"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "O FFICER S, treasurer- <mark>D</mark>. <mark>Mott</mark> <mark>Robertson</mark>, 733.  AttocV. for the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [136.79, 579.75, 279.14, 1228.62], "bbox_id": "1a47c0eeff", "file": "TimesVirginian_1976_0460.pdf", "page": 1, "text": "the stoveit had fallen down on three different occasions, causing quite a disturbance each time. Arriving at the store just on the dot of seven, Reggie saw Dr. James just unlocking the door. He knew immediately that something must be wrong-Dr. James was always early. Sure enough, as they began readying the store for the day ahead. Dr. James complained of feeling extre mely weak and tired. Now both Reggie apd Dr. James knew how busy they would be with so many people sick with flu in the town of Appomattox and surrounding county. Dr. D. N. Twyman. Dr. Mott Robertson, and Dr. D. .A. Christian were working, night and day to meet the needs of so manv people stricken with fiu. Reggie was not the only employee of Dr. Charles F. JamesHarold Y. Spencer, pharmacist also worked at the corner drug store. It was Dr. James and Harold who kept the prescriptions filledusually a black pill, followed by a.dose of castor oil, the amount to be determined by the age and the condition of the patient in need. some families, every mevnber was bedridden with flu andean outsider had to see to getting the medication and .Attend to the needs of that family. In more than one instance several members of a family lost their lives to the dreaded sickness. About the middle of the morning Dr. James decided to give up and go on homeflu had become his master for a time! Oh well, thought Reggie, as he went about straightening up stock and waiting on the customers, even though Harold will be overworked he can take care of the prescriptions. It was an unusually busy afternoon. Reggie kept taking prescriptions to the rear of the store and leaving then, for"}, "highlight": {"text": {"matched_tokens": ["Mott", "Robertson", "D"], "snippet": "D. N. Twyman. Dr. <mark>Mott</mark> <mark>Robertson</mark>, and Dr. <mark>D</mark>. .A. Christian were working,"}}, "highlights": [{"field": "text", "matched_tokens": ["Mott", "Robertson", "D"], "snippet": "D. N. Twyman. Dr. <mark>Mott</mark> <mark>Robertson</mark>, and Dr. <mark>D</mark>. .A. Christian were working,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [564.95, 408.19, 729.25, 1109.91], "bbox_id": "6a3289b2bf", "file": "AppomattoxNewspapers_1926-1933a_0250.pdf", "page": 1, "text": "Miss Leo Wagel, of New ferk, has been visiting in the lome of Mr. and Mrs. T. H jpencer. Miss Sarah Bates has been isiting relatives in Lynchburg Mr. and Mrs. R. D. Wilson pent the week-end in Farm ille. Miss Lucille Bates and Miss Nannie Jones spent last week in Lynchburg. Miss Lena Morris, of Blue leld, W. Va.,is visiting her sis- er, Mrs. W. E. Dickerson. Miss Dorothy Cawthorn, of Alexandria, is visiting relatives here. Miss Frances Coleman has eturned from a visit to Phila delphia, Pa. Miss Mamie Cullop is at lome on her vacation, after at- ending summer school at East Radford. Miss Elizabeth Robertson ias been visiting her grand mother, Mrs. D. A. Bondurant, it Six Mile Bridge. Mr. C. W. Adams, of Little- on, N. C., spent the week-end n the home of Mr. and Mrs ft. H. Bates. S a l e m and Old Concord Churches of Spout Spring held a picnic jointly at Miller Park on Wednesday, August 6, both churchescarrying dinner. Mrs. Lester Morris, of Farm rille, visited her sisters, Misses Rissa and Maggie Chilton last week. Mrs. H. S. Jones had as her guests last week, Rev. and Mrs. Earle V. Conover, of Sloomfield, N. J., and Mrs. Ed. Chamberlayne, of Roanoke. Miss Dorothy Cawthorn, of Alexandria, is visiting her fa ther, Mr. Russell Cawthorn. Mr. and Mrs. R. L. Schools nd son, Ray, of Portsmouth, Va., are visiting in the home of Mr. J. H. Robertson. Mrs. Nina C. Robertson and children, D. Mott and Dorothy of Farmville, are visiting rela tives here. Mrs. Tommie Jennings spent ast week with her parents, Rev. and Mrs. Burnette at Vera. Mrs. Eugene Chick is getting along as well as could be ex pected after a recent operation at Memorial hospital, Lynch burg."}, "highlight": {"text": {"matched_tokens": ["Robertson", "D", "Mott"], "snippet": "Robertson. Mrs. Nina C. <mark>Robertson</mark> and children, <mark>D</mark>. <mark>Mott</mark> and Dorothy of Farmville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Robertson", "D", "Mott"], "snippet": "Robertson. Mrs. Nina C. <mark>Robertson</mark> and children, <mark>D</mark>. <mark>Mott</mark> and Dorothy of Farmville,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.69, 1080.55, 2560.09, 1485.55], "bbox_id": "955ad0b540", "file": "AppomattoxNewspapers_1915-1918a_0107.pdf", "page": 1, "text": "Main Offices at Scottsviüéj.  a . ill are slowly im proving under  the skilful treatm en t of D r I Mott Robertson, whose very! presence inspirea confidence. I M r. S. J- Lees boys have the m um ps. Mrs. S. J. Lee is on th e sick list.  Mr. H utson H arvey leaves today to accept a position w ith A insli e-M ar tin. W e are sorry to see our good boys leav in g ,  we need them in th e commu-1 n ity an d church.  Miss R osa Reynolds, one of our girls, accom panied her sis ter, Mrs. W . F. Barbee to City  P oin t and w as quietly m arried I to Mr. Geo. B uchsuan, of North  C arolina thereby giving he, friends ju st a little surprise. Our best w ishes for their future happiness.  Mr. R. C. M artin visited his j home people Sunday.  Miss M adian Lee, of Lynch burg, visited hom e Saturday  and Sunday accom panied by  Miss M ary Gilliam . I Since our la st w riting our!  h earts have been deeply grieved  by the death of Mrs. S. G. Har- before"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "treatm en t of <mark>D</mark> r I <mark>Mott</mark> <mark>Robertson</mark>, whose very! presence inspirea"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "treatm en t of <mark>D</mark> r I <mark>Mott</mark> <mark>Robertson</mark>, whose very! presence inspirea"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.55, 296.95, 1850.91, 554.11], "bbox_id": "75db2548f2", "file": "AppomattoxNewspapers_1898-1902a_0246.pdf", "page": 1, "text": "what nominal for the preses iw - _ hat Umifsualuuaimtv2.J,,dre of  treult Court-Geo. .1. Hi i there will not tie much April and October, i .?   ? .8ee!s- it is ot County Court P. A. ChJ I yet known howthe Thursday after flm Wonilaj. Pfc,IllHHClerk of Circuit aud county Court H er. Atorney for CommouweaHhII. D. 8lwriff8. P, Coleman.  Treftsurw-D. Mott Robertson. Bcwrd of SupirrviaorsW. II. U k  ii J iaii S. C. Stratton and J. C. Jones teeth on Wednesday after first M iaruba JunOa Settcmber. and Doeen  Attention, Farmers! We it I file hove in low prices on Hard J Vfouei, aud Farm Tools. T uce for luck. We never slt-ei M eyers  M artin . Hardware Huslert Lynch burg, M C  --------------------- - -- FINE HOR5ES FOR SALE. As i do not travel anyone in lm counties of Appornaitox uckiiighani, and often find ossiblo to attend these counsel will be glad to answer an"}, "highlight": {"text": {"matched_tokens": ["D", "Mott", "Robertson"], "snippet": "er. Atorney for CommouweaHhII. <mark>D</mark>. 8lwriff8. P, Coleman.  Treftsurw-D. <mark>Mott</mark> <mark>Robertson</mark>. Bcwrd of SupirrviaorsW. II."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Mott", "Robertson"], "snippet": "er. Atorney for CommouweaHhII. <mark>D</mark>. 8lwriff8. P, Coleman.  Treftsurw-D. <mark>Mott</mark> <mark>Robertson</mark>. Bcwrd of SupirrviaorsW. II."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
