{"document": {"bbox": [1321.88, 1538.85, 1469.96, 1568.95], "bbox_id": "55e446484f", "file": "AppomattoxNewspapers_1933-1936a_0190.pdf", "page": 1, "text": "Z . 1880 , this county. .ofa B udge David A. Christian AgmS Thornhi11 Christ-"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Z . 1880 , this county. .ofa B udge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> AgmS Thornhi11 Christ-"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Z . 1880 , this county. .ofa B udge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> AgmS Thornhi11 Christ-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2213.28, 833.52, 2387.26, 1806.39], "bbox_id": "dd7202fdca", "file": "AppomattoxNewspapers_1954-1955a_0223.pdf", "page": 1, "text": "Wounded in the gun battle and charged with the crime is Frank Mayberry, 47 of Evergreen. It appears that Tucker was slain on the back porch of the residence in Evergreen in which he and his wife, her mother, and her brother, May berry lived. This shooting apparently occurred sometime after 10 oclock Friday night. Called to the scene from his home in Appomattox, Dr. Christian was on an errand of mercy. From a re construction of the events, it appears that the popular young doctor was shot as he approached the door of the -house. Christians body was found on the walk to the house, and removed only after a terriffic gun battle between the posse and Mayberry. Nearly two hours passed between the shooting of Tucker and the flni arrest, of May- berry- Mayberry was Yelled by a shotgun blast near a garage hide out from which he had fired from 30 to 50 shots from a pistol and a shotgun at the surrounding officers. Mayberry was given medical treat ment here and sent to Rlctnond Saturday morning. His wounds are said not to be serious. The midnight sounding of sirens and the use oi flares to light up the scene attracted the attention of a sizeable gathering of spectators and details of the tragedy have been the topic of interest here since. Funeral services for the victims were held Monday. Serviced for Mr. Tucker were conducted from the Evergreen Baptist Chunch, by the pastor, the Rev. D. L. Bailey. Mili tary services were conducted by the grave by American Legion Post 104. Burial was in the Evergreen Ceme tery. Funeral services for Dr.Christlan were held here Monday at 11 A. M., from Appomattox Court House Pres byterian Church, conducted by his pastor, Dr. Twyman Williams, as sisted by Dr. C. A. Collins, Jr., and the Rev. B. T. Price. A great concourse of friends gath ered for the services. An outpour ing of floral tributes and messages of condolence bore testimony to the esteem in which th1 young physician and his family are held. Son of Dr. D. A. Christian, Jr. the physician began his practice here following service in the Navy during World War II. He occupied the office his father had used for a generation of service to the people of this area. Affectionay known as Young Doctor David, he endeared himself to the public by his skill as a physician and the charm of his personality. He was serving as a member of the Appo mattox Town Council and recently organized a group here to further the cause of physical education at the Appomattox school. As a mark of respect, local busi ness places closed during the funeral hour. A movement has begun to have an appropriate memorial in his hon or. A meeting of friends was held this week to organize a memorial movement, and another meeting will be held Monday night. Dr. Christian is survived .by his wife, the former Louise Campbell of Staunton three children, Mary, 6 Pamela, 4, and David A. Christ ian, IV, 7 months his father, Dr. David A. Christian, Jr and the fol lowing sisters and brother Mrs. George L. Koos, of Tangent, Ore- - gon Mrs. Worth Harris, La Crosse, Florida Mrs. Harold E. Thompson, Jr. Staten Island, New York Mrs. W. J. Byerly, of El Paso, Texas . Mrs. John E. Cox, Jr., Fall Rive  I  Continued on .Page r .-"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "months his father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr and the fol"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "months his father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr and the fol"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "in this county, Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> being the teacher. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "in this county, Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> being the teacher. Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [176.61, 673.59, 348.68, 858.59], "bbox_id": "45e43cda69", "file": "AppomattoxNewspapers_1939-1943a_0121.pdf", "page": 1, "text": "When the class of 1940 gradusH next week at the Appomattox hB school, two boys will carry off f 1 tonors. Professor L. Crawley togp announced that at a faculty m i j ing this morning, James Sites,  Gladstone had been designatsd   validictorian of the class and Charle s Thomas Moses had been designatfl as salute to rian. James Sits was a awarded the Burke scholarship mfl al. -i  1 The following list of Seniors re-3 ceived honorable mention was anjJ pounced by Professor Crawley ConjK Btaneo .Fulp, David Christian, A  drew Paulette, Josephine Murrayj Eugene Walton. Frances Harveyj Ilah Buchanan and Mary Ellen Joht son."}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley ConjK Btaneo .Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark>  drew Paulette, Josephine Murrayj"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley ConjK Btaneo .Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark>  drew Paulette, Josephine Murrayj"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [171.6, 671.69, 342.0, 856.39], "bbox_id": "e98dd98d95", "file": "AppomattoxNewspapers_1939-1943a_0118.pdf", "page": 1, "text": "When the class of 1940 gradúa next week at th? Appomattox h  school, two boys will carry off honors. Professor L. Crawley todjHj announced that at a faculty m H ing this morning, James Silos, M Gladstone had been designated S i validictorian of the class and Charles Thomas Moses had been designatnj as salutltorian. James Sits was a f awarded the Burke scholarship m B al. m The following list of Seniors re-2 ceived honorable mention was and Bounced by Professor Crawley Corn stance Fulp, David Christian, A s drew Paulette, Josephine M urray Eugene Walton. Frances Harvej Ilah Buchanan and Mary Ellen Joh son."}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley Corn stance Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark> s drew Paulette, Josephine"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley Corn stance Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark> s drew Paulette, Josephine"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [174.49, 672.64, 341.5, 857.59], "bbox_id": "a88e937193", "file": "AppomattoxNewspapers_1939-1943a_0114.pdf", "page": 1, "text": "When the class of 1940 gradtuK next week at th? Appomattox school, two boys will carry off VK honors. Professor L. Crawley totfif announced that at a faculty mX ing this morning, James Sites,  Gladstone had been designated NB validictorian of the class and Charlt Thomas Moses had been designate as sal-utiitorian. Jaimes Sits was  awarded the Burke scholarship m l al. -j The following list of Seniors re ceived honorable mention was an nounced by Professor Crawley Coni atanoo Fulp, David Christian, A t drew Paulette, Josephine Murray Eugene Walton. Frances Harveys Ilah Buchanan and Mary Ellen Johr son."}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley Coni atanoo Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark> t drew Paulette, Josephine"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "A"], "snippet": "Crawley Coni atanoo Fulp, <mark>David</mark> <mark>Christian</mark>, <mark>A</mark> t drew Paulette, Josephine"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1706.64, 1449.67, 1877.21, 1796.66], "bbox_id": "01c8aeb802", "file": "AppomattoxNewspapers_1954-1955a_0228.pdf", "page": 1, "text": "We present below a statement from the family of Dr. David A Christian, Jr. The tragic death of Dr. David A. Christian, III, Feb. 25 saddened the oemmunity and was the occasion of widespread expres sions of respect for the family I have had expressions of sym pathy from hundreds of people  many, many cards and every imag inable thing that could be done to show the love that everyone had for my son, David A. Christian, III. Words cannot express, pen ox pencil trace, the deeds that have been done in the love of the com munity, and the desire to lighten the load on me and my sons wife and childrenGod walks in a mys terious way His wonders to per formHe plants His footsteps on the sea and rides upon the storm. I do not doubt Gods wisdom and I pray that I may meet my son in Heavenand I ask the prayers of everyone to help me.  My last great want, absorbing all Is, when beneath the sod, And summoned to ray final call, The mercy of my God. Extract of A Letter By A Friend of the Family I am thankful that we do not have to understand these strange"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "the family of Dr. <mark>David</mark> <mark>A</mark> <mark>Christian</mark>, Jr. The tragic death"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "the family of Dr. <mark>David</mark> <mark>A</mark> <mark>Christian</mark>, Jr. The tragic death"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2187.88, 299.77, 2359.33, 383.46], "bbox_id": "0772bafc34", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "W. Diuguid Christian, 43, died at Medical College Hospital, Richmond Thursday morning. He was born in Appomattox County, son of Mrs. David A. Christian and the late Judge Christian. Funeral services will be conducted Friday afternoon at 330, from the Christian family cemetery near Vera."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "County, son of Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and the late Judge"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "County, son of Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and the late Judge"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2229.3, 560.61, 2401.05, 1170.47], "bbox_id": "2027856763", "file": "AppomattoxNewspapers_1952-1954a_0385.pdf", "page": 1, "text": "Tuesday of this week, Sunset at Appomattox, a documentary film,, produced in Hollywood, had its pre miere before a blue ribbon list of dignataries in Lynchiburg. Nearly 200 saw the advance showing, and came away thrilled at the splendid reproduction of the events of April 9, 1865 at Appomattox. At a dinner at the Virginian Ho tel preceding the showing, Represen tative W. M. Abbitt was toastmaster. Fred Helsaibeck, vice-mayor of the City of Lynchburg, gave the invoca tion. Distinguished guests, including educators and historians, were intro duced. Major-General U. S. Grant, III, grandson of Ulyssis S. Grant, spoke briefly, praising the peace at Appomattox reuniting the na tion. Rev. Richard H. Lee, a kinsman of R. E. Lee, spoke in the same vein. William A. Hart, director of adver tising, E. I. DuPont Company, pro ducers of Sunset at Appomattox, told the story of how the film, was made. Conrad L. Wirth, Director, National Park Service, thanked the DuPont Company for this documen tary contribution. Sunset at Appomattox will be televised nationally on DuPonts Cavalcade of America program, over ABC network, Tuesday night, Oct. 20. We understand WLVA - TV, in Lynchburg carries this program at 730 P. M. Attending the luncheon and the Premiere ... from Appomattox were r Mr. and Mrs. W. M. Abbitt, Mr. and Mrs. Chas. T. Moses, Judge and Mrs. Joel W. Flood, Mr. and Mrs. H. A. Gurney, Mr. and Mrs. D. T. Robert son, Mr. and Mrs. George Abbitt, Jr. C. W. Smith, Mr. and Mrs. J. A. Burke, Mr. and Mrs. C. T. Moses, Jr. Mrs. Charles Crawley, Mrs. C. M. Stratton, Mr, and Mrs. Calvin H. Robinson, Miss K u li a Ferrell, Mrs. E. Carroll Smith, Mr. and Mrs. J. H. OBrien, G. B. Buchanan, Miss Illah Buchanan, Mrs. J. C. Caldwell, Mr. and Mrs. W. W. Burke, Mr. and T. DeWitt Evans, Mrs. Richard G. Janatka, Garland Plunkett, Mr. and Mrs. David A. Christian, III Rev. B. T. Price, Mrs. J. R. Lawson, Mrs. F. C. Dresser, Mr. and Mrs, Otis P. Dewberry, Mr and Mrs. Carl A. Collins, Jr. Mr. and Mrs. Richard D. Robinson,"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Plunkett, Mr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III Rev. B. T."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Plunkett, Mr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III Rev. B. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [572.13, 336.51, 2493.07, 742.63], "bbox_id": "5c65975ca3", "file": "AppomattoxNewspapers_1947-1949a_0260.pdf", "page": 1, "text": "TO BUY OR SELL USE OUR CLASSIFIED COLUMN Church N Dr. David A. Christian has been practicing medicine in Appomattox County for foitv years. On May 20 he observed his. 68th birthday and that date also marked the ap proximate lorthie. anniversary of his service as a beloved physician here. Interviewed at hjs home last we. K-end, Ur. Christian took time out to recall many interesting ex periences of four secvice-crowded decades. Ilia grandfather, William D. Christian was a doctor. Dr. W. D. Christian graduated at Hampden- Sydney and studied medicine at the University of Pennsylvania. He is remembered by many . of the older citizens of the county,.- And Dr. Christians father, David A. Christian, Sr. was Appomattox County Judge for 15 years. He also served as statistician in the State Board of Education. The present Dr. Christian com pleted his medical study at the Medical College of Virginia in 1908. It is interesting to note that in 1904 and 1905, he was a rural mail carrier on a route out from the Vera post office. In May, 1908, he set up his of fice as a young doctor. This office was at the old Christian home, 1 miles from Vera. The home diace wap ,known as Mountain"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "COLUMN Church N Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> has been practicing medicine"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "COLUMN Church N Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> has been practicing medicine"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [587.76, 742.46, 756.24, 912.56], "bbox_id": "d2e5abfa76", "file": "AppomattoxNewspapers_1954-1955a_0262.pdf", "page": 1, "text": "This is to serve notice that I have qualified as Administrator of the estate of the late Dr. David A. Christian, III. Anyone having claims against this estate, kindly present statement of same at once. To those indebted to this estate, take notice that the office of the late Dr. Chris- ian has been closed, and all accounts are payable to the undersigned at The Farmers National Bank, Appo mattox, Va. Prompt settlement will be appreciated. T. DeWitt Evans, Administrator, Estate of Dr. David A. Christian, III 3-24-4tc"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [748.81, 476.38, 917.61, 636.12], "bbox_id": "eedb938c04", "file": "AppomattoxNewspapers_1954-1955a_0256.pdf", "page": 1, "text": "This is to serve notice that I have qualified as Administrator of the estate of the late Dr. David A. Christian, III. Anyone having claims against this estate, kindly present statement of same at once. To those indebted to this estate, take notice that the office of the late Dr. Chris- ian has been closed, and all accounts are payable to the undersigned at The Farmers National Bank, Appo mattox, Va. Prompt settlement will be appreciated. T. DeWitt Evans, Administrator, Estate of Dr. David A. Christian, III."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1771.69, 332.47, 1944.09, 614.12], "bbox_id": "8247966818", "file": "AppomattoxNewspapers_1952-1954a_0016.pdf", "page": 1, "text": "The wedding of Miss Joice Ham per Christian, daughter of Dr. David A. Christian, Jr., and the late Bessie Stratton Christian, of Appomattox, . John Edwin Cox, Jr., son of Mrs. Jjhn Edwin Cox and the late Mr. ox, of Fall River, Mass., took place S aturday, June 14, at 4 P. M., at the h rme of the bride in Appomattox. The Rev. W. M. Thompson, of nglewood Baptist Church, Lynch burg, officiated before an improvsed altar of ferns. The home was deco- j  ated with white gladioli and mag nolias. The bride, given in marriage by , her brother, Dr. David A. Christian, I III, wore a gown of white embreid- ered organdy over taffeta, fashioned with tight bodice and short sleeves. The skirt, trimmed with panels of embroidered organdy, was worn over hoops and ended in a full train. Her! Inger-tip veil of silk illusion fell from a coronet of seed pearls. She j  arried a bouquet of stephanotis cen- ! ford with an orchid. Mrs. Worth Harris, of LaCrosse, Pla., Wat her sisters matron of"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Christian, daughter of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., and the late"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Christian, daughter of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., and the late"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1484.16, 632.05, 1656.74, 978.99], "bbox_id": "1814432323", "file": "AppomattoxNewspapers_1954-1955a_0269.pdf", "page": 1, "text": "The Solicitation Committe for the Christian Memorial Fund met last night and is pleased to report that approximately 6,000 has been raised in cash and pledges. All committee members want to to take this chance to thank each and everyone for their wonderful support in this project. The Memorial Quarter drive in the schools has been very successful. The children and teachers have giv en full cooperation, with excellent results to date. Blueprints for the proposed Me morial Building should be ready in the near future. Anyone having suggestions as to a suitable site for the Memorial Building. Contact Dr. C. G. OBrien, chairman of the Memorial Board of Directors. The committee is pleased to an nounce that the Appomattox High School Athletic Association is spon soring a Variety Show about May 1st, and the proceeds are to go to the Memorial. This is a splendid ges ture on the part of the students and coaches. Contributions may be maield to Dr. David A. Christian III Me morial Fund, Box 47,7, Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "be maield to Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Me morial Fund,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "be maield to Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Me morial Fund,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1699.66, 600.74, 1867.26, 819.53], "bbox_id": "547bcdbbd9", "file": "AppomattoxNewspapers_1954-1955a_0307.pdf", "page": 1, "text": "The saga of events following the shooting of two men at Evergreen on the night of Feb. 25, ground to its final chapter here yesterday, as Frank Mayberry was sentenced to a second life term in the state peni tentiary. Judge J. W. Flood order ed the second life term, after May berry entered a plea of guilty to the shooting of his brother-in-law, Jack Tucker. The trial yesterday was in contrast to the one two weeks ago, when packed court rooms heard, the defendant receive a life imprison ment sentence after two days of le gal battle on indictment for the slaying of Dr. David A. Christian, III. Dr. Christian had gone to the Mayberry - Tucker home in Ever green Feb. 25 on an errand of medi cal duty, only to be shot as he"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "the slaying of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Dr. <mark>Christian</mark> had"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "the slaying of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Dr. <mark>Christian</mark> had"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.84, 1232.08, 2055.58, 1822.87], "bbox_id": "92504c3c3b", "file": "AppomattoxNewspapers_1952-1954a_0568.pdf", "page": 1, "text": "the recent Model General Assembly in Richmond. These two students expressed their appreciation for having been given the opportunity to attend this youth assembly, and spoke briefly of the benefits deriv ed from the three-day session. iMrs. Crawley, as a delegate to the annual state convention of the Federation of Virginia Womans Clubs, gave an interesting report of the constructive sessions she at tended. She said during her associ ation there with members of other clubs, she learned new ideas and worthwhile projects which could be adopted by the local club. Mrs. Flood also attended this convention with Mrs. Crawley. Mrs. David A. Christian, III treasurer, gave a detailed report of the clubs financial transactions for the past two years. This report was accepted as read. At the request of Mrs. Thelbert M. Trent, chairman of the Conserva tion dpartment, it was agreed to sponsor a delegate to the Nature Study Camp to be held at Holliday Lake this summer. The selection of this delegate will be made by Mrs. Trent and her commitee. The fine arts committee report was given by Mrs. Richard Janatka, chairman. She cited the number -of art exhibits put on display and the showing of the work of local talent. She also gave a report of the book reviews, and by whom given. Mrs. R. M. Mann, chairman of the welfare department of the club, told of the activities of club members in civic drives and their willingness to cooperate in this wide scope of work. The budget for the coming year was read by the treasurer, and was adopted. A report of the ways and means committee was submitted by Mrs. H. A. Gurney, chairman. This re port showed the untiring efforts of the committee members and the fine results. Mrs. Flood, the initial president of the club, which was organized two years ago, gave a resume of the clubs growth and its support of dis trict and state projects. She ex- Continued on Page Five"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "a"], "snippet": "with Mrs. Crawley. Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III treasurer, gave <mark>a</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "a"], "snippet": "with Mrs. Crawley. Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III treasurer, gave <mark>a</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [395.74, 608.54, 566.09, 1157.12], "bbox_id": "64bb8cb9f6", "file": "AppomattoxNewspapers_1954-1955a_0224.pdf", "page": 1, "text": "The most pressing need of the hour in Appomattox is to devise some inducement to add another doctor to our communitys staff. The passing of the beloved young David A. Christian, III, gives us occasion to observe that by and large, this community has overworked and underpaid its medical men. Young doctors have scant incentive to go to rural areas, with the long hours, endless driving, and small compen sation, in comparison to what is offered in larger centers. These things the hours, the driv ing, and small compensation, are the handicaps we must face. But face them we must, for Ap pomattox cannot ocntinue to over burden the medical men we do have available. Our best thinking must be done to seek the solution to this pressing problem. Appeals must be made to the medical schools and placement groups, but to back up those appeals we must be prepared with data. A long -range solution to this problem, which is but typical of the same situation all over the country, is for the armed forces to release to civilian service some of the young doctors they are holding in service. Vast numbers of the civilian doctors are over-age, but simply cannot retire. Young doctors arent getting the experience in general practice they used to get they are spending their first years as doctors in the armed services as specialisits and many have no taste for general rural practice when they complete their tours of duty. Again, our medical schools must be expanded, and more young men induced to go through the years of study and preparation for a career as doctors. But these long range sugestions do not help us right now. Let us cooperate so far as possible to lighten the load on our doctors, and use what means may be avail able to induce another young doctor to settle in our midst."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the beloved young <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, gives us occasion"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the beloved young <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, gives us occasion"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [277.2, 1347.41, 438.88, 1529.01], "bbox_id": "55371e1995", "file": "AppomattoxNewspapers_1898-1902a_0613.pdf", "page": 1, "text": "The Hon. David A . Christian assumes charge this week of the Chase City Progress. The Judge enters the field of journalism with tbe best wishes of a host of friends. We regret that Appomattox county is to lose so valuable a citizen, but the Constitutional Convention by its judiciary report has abolished the Judges office, and he at once turns his talent to the wide newspaper field. We welcome the Progress to our exchange list, and predict for it a new era of prosperity and useful ness."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "The Hon. <mark>David</mark> <mark>A</mark> . <mark>Christian</mark> assumes charge this week"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "The Hon. <mark>David</mark> <mark>A</mark> . <mark>Christian</mark> assumes charge this week"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2091.85, 287.06, 2261.85, 673.65], "bbox_id": "2ce041864b", "file": "AppomattoxNewspapers_1955-1957a_0346.pdf", "page": 1, "text": "The following proposals by the Board of Directors were unanimous ly adapted during a mass meeting of contributors Wednesday even ing, November 7 First That the Christian Me morial Funds be used for the col lege education of the children of the late David A. Christian, III. Second Should the Christian Memorial Fund for some reason not be used for the education of the children of David A. Christian, III, then it is reoommended that the fund be made available as a loan fund to medical, dental, or nursing students who are citizens of Appo mattox County or adjoining coun ties. Third That the funds now on hand or that are later contributed be invested at the direction of the Board of Trustees in order that the funds anight produce an income until such time that they are used as sot forth m the first and second- recommendation. Dr. C. G. OBrien, chairman of the Board of Directors, points out that an expression f the wishes of donors was necessary because of in adequacy of the funds collected for the original objective. Any donor, not concurring in the proposals ol the Board of Directors as approved should call at the office of Dr. OBrien or W. C. Dudley, treasur er, before December 1."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Second Should the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Second Should the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.43, 556.69, 1727.83, 941.82], "bbox_id": "cd376dee05", "file": "AppomattoxNewspapers_1955-1957a_0332.pdf", "page": 1, "text": "The following proposals by the Board df Directors were unanimous ly adopted during a mass meeting of contributors Wednesday even ing, November 7 First That the Christian Me morial Funds be used for the col lege education of the children of tihe late David A. Christian, III. Second Should the Christian Memorial Fund for some reason not be used for the education o f the children o f David A. Christian, III, then it is recommended that -the fund be made available as a loan fund to -medical, dental, or nursing students who are citizens of Appo mattox County or adjoining coun ties. Third That -the funds now on hand or that are later contributed be invested at the direction of the Board of Trustees in order that the funds might produce an income until such time that they are used as set forth in the first and second recommendation. Dr. -C. G. OBrien, chairman of the Board of Directors, points out that an expression of the wishes of donors was necessary because of in adequacy of the funds collected for the original objective. Any donor, not concurring in the proposals ol the Board of Directors as approved should call at the office of Dr. OBrien or W. C. Dudley, treasur er, .before December 1. ll-15-3t"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "children of tihe late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Second Should the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "children of tihe late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Second Should the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1713.35, 1004.01, 1885.8, 1552.04], "bbox_id": "8b64fea996", "file": "AppomattoxNewspapers_1954-1955a_0085.pdf", "page": 1, "text": "The following committees have been announced by Commander R. D. Robinson of American Legion Post 104 Americanism Committee C. T. Moses, Jr., chairman Eames A. Powers, Carl A. Collins, R. D. Rob inson, Frank F. Carr, Fred Smith Joel W. Flood and Robert A. Sears. Publicity Committee William T. Evans chairman Ivey Holland, Carl A. Collins, R. D. Robinson. Attendance Committee Berkley H. Guill, chairman George W. Wooldridge, L. C. MacKenzie. Visiting Committee Carl A. Coll ins, chairman L. Preston Brown. Membership Committee Dr. D. A. Christian, III and Berkley H. Guill, chairmen George W. Wool dridge, Robert Trivett, James L. Blackwell, Sr. W. E. Layne, Lyle Garrette, L. C. MacKenzie, H. B. Lucado, George C. Jennings, Allen L. Wood, Jr. Entertainment and Refreshment Committee William D. Morris, chairman Malcolm A. Booker, Char lie C. Carter, Edwin Carter, Larry Young, John Hall, Peyton Harvey. Child Welfare Commitee Fred C. Smith, chairman Murrell Ferguson, John P. Taylor, David A. Christian, C. T. Moess, Jr. Clifford E. Har vey. Calendar Committee David T. Robertson, chairman Ivey Holland Curry Harvey, William Hunter, John P. Taylor. Athletic Committee Lathan Har vey, chairman David A. Christian Post Historian C. Kendall Hunt er. Legion Grounds Committee G. W. Wooldridge, chairman Marvin House, William J. Covington, Gil bert E. Mays, Charlie W. Scruggs. Elmer L. Stanley, Martin L. Webb John C. Cole. Legion Building Committee T. C. Harvey, Jr., chairman Ray Fer guson, Edwin Carter, A. R. Har wood, Jr. Larry Mays, Archie Gaines, Ollie C. Hall, E. L. Fields Service Officer John P. Taylor."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Ferguson, John P. Taylor, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, C. T. Moess, Jr."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Ferguson, John P. Taylor, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, C. T. Moess, Jr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [403.16, 1041.79, 574.61, 1203.53], "bbox_id": "2547b2905d", "file": "AppomattoxNewspapers_1954-1955a_0271.pdf", "page": 1, "text": "The Evergreen P.-T. A. met on Monday night, with a good attend ance. The devotional period was con ducted by Mrs. Reba Bruce and Mrs. C. J. Paueltte. The program consisted of two parts, given on The School  Age Child and Their Problems. The sum of 10.00 was given to the Dr. David A. Christian III Me morial Fund. It is planned to have a food sale n May 7 in Appomattox for the benefit of the playground equip ment fund."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "given to the Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Me morial Fund."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "given to the Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Me morial Fund."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1867.18, 972.64, 2037.01, 1429.57], "bbox_id": "731cd53f2b", "file": "AppomattoxNewspapers_1954-1955a_0296.pdf", "page": 1, "text": "The dramatic . trial of Frank Mayberry, 47 year old railway weld ers helper, of Evergreen, accused in the shot-in-the-dark killing of Dr. David A. Christian, III, on the night of Feb. 25, came to an end here late Saturday night, when a jury summoned from Cumberland County brought in a verdict of guilty of murder in the first degree with punishment fixed at imprison ment In the state penitentiary for life, f Mayberry was taken to Richmond -Monday to begin his term. Decision has not been made by his attorneys, W. F. Watkins, Jr., and J. B. Wall, Jr., of Farmyille, as to an apepal of the conviction nor has a decision been announced by the Commonwealth as to prose cution of a second indictment, charging the murder of Mayberrys brother-in-law, Jack Tucker. The trial began Friday morning and ended as midnight approached Saturday. The court room was pack ed during most of the two days, pnd the case attracted wide publici ty. High-water mark of the trial came when Mayberry took the stand to testify, and in a calm, quiet man ner declared, I feel mighty bad about it. For myself, and for the doctors family, and my people. The Story of the Trial At 1005 A. M. Friday, the sheriff, D. T. Robertson, brought the defendant, Frank Mayberry, into court, before a crowded courtroom. At 1008, the sheriff opened court, and at 1010, there was a delay a- waiting the arrival of George Ab- Continued on Page Nine"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "shot-in-the-dark killing of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, on the night"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "shot-in-the-dark killing of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, on the night"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [413.05, 384.27, 587.6, 807.56], "bbox_id": "4abd7593d8", "file": "AppomattoxNewspapers_1954-1955a_0339.pdf", "page": 1, "text": "The Dr. David A. Christian, III, Memorial Fund has been increased by a 792.06 contribution from the employees of the Appomattox Gar ment Company. One hundred and eighty envelopes, containing dona tions from this number of individual employees was turned over to W. C. Dudley, treasurer of the fund, Tues day afternoon. It is understood that other employees have made pledges to swell the total Garment Company contribution to this project. Commenting on the fine support of the Memorial Fund effort, by the Appomattox Garment Company and its employees, C. T. Moses, Jr., the chairman of the fund raising com mittee said, This is an outstanding example of what can be done to achieve our goal. The Appomattox Garment Company employees ap proached this drive in an organized manner. Each employee was given an opportunity to make a definite pledge to the Memorial. A goal wa3 set as to the amount to be collect ed. We are indeed grateful for their support. It is understood that total pledges at the Appomattox Garment Com pany amounted to over 1,000. and that the cash turned over Tuesday will be increased as the pledges are paid. The Christian Memorial Fund was set up here shortly after the tragic shooting and the death of young Dr. Christian when on a mercy call to Evergreen in late February. The"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "The Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, Memorial Fund has"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "The Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, Memorial Fund has"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2221.64, 883.68, 2402.41, 1488.63], "bbox_id": "55d4b2bf26", "file": "AppomattoxNewspapers_1949-1952a_0219.pdf", "page": 1, "text": "The Christian family is unique in that so many of its members have been associated with the medical profession. His grandfather, the late Dr. Wm. D. Christian, was a be loved doctor. His son, Dr. David A. Christian, III, is a doctor. A daugh ter, Mrs. Harold Thompson, is a former medical technician. Another daughter, Miss Cathryn Christian, is a medical technician at the Medical College of Virginia. And another daughter, Miss Jpice OhrtMian, is a pre-medical student Wellesley College. His newphew,. Thomas Jennings, is a senior a,t the Medical College of Virginia, and Dr. Jen nings wife ns a doctor. The late Dr. Wm. Albert Thornhill was a be loved physician, of Charleston, W. Va., and he was a double first cou sin of Dr. Christian. And, Dr. Wm. Albert Thornhill, Jr. is practicing in Charleston. Another cousin was the late Dr. Carroll James, of White Plains, N. Y. Other more distant kinsmen have followc 1 the medical profession. Among members of Dr. Christ ians family here and who will at tend the ceremony Saturday, are  Mr. and Mrs. George Koos, Jr. and two daughters, Kristin and Cathryn, of Tangent, Oregon! Mrs. Harold Thompson, and daughter, Sue Ann, of Natick, Mass. Miss Joice Christ ian, a student at Wellesley College, Wellesley, Mass. Mrs. Worth Har ris, of LaCross, Florida Lt. J. G. and Mrs. David A. Christian, III, and daughter, Mary Kathryn, of Quantico, Va. Dr. Christian, III is stationed at the Marine Base Miss Cathryn Christian, of Richmond, and Chesley Christian, of Appomattox. Others expected from out f Mrs K. H. Sisson, Mrs. J. H. Eld er, Mrs. Edwin Pauli, Mr. and Mrs. Bob Wheeler, Mrs. Wesley Higgins, Mrs. J. H. Elder, Jr. and two sons, all of Richmond Mr. and Mrs. S. B. Gilliam, of Dillwyn Mr. and Mrs. Parks Jennings, of Stonewall Mr. and Mrs. Tom Christian, of Cov ington, and William J. Byerly, II, of Winston-Salem, N. C. All those who desire to join in this testimony to a beloved citizen are urged to be present promptly at 300 P. M. this Saturday at the court house."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "a"], "snippet": "doctor. His son, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, is <mark>a</mark> doctor."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "a"], "snippet": "doctor. His son, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, is <mark>a</mark> doctor."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2196.72, 1112.32, 2529.87, 1384.41], "bbox_id": "21851dcbcc", "file": "AppomattoxNewspapers_1943-1947a_0352.pdf", "page": 1, "text": "The Appomattox Post No. 104 of the American Legion asks all veterans, having a honorable dis charge, to join the Post. The local veterans organization is growing rapidly. Some of the recent new members are  Daniel Henry Almond, Thomas P. Almond, William Irving Ayers, Warren C. Barlow, Henry H. Beal, Arthur A. Blackwell, Thomas E. Burks, James P. Burton, Hubert Hunter Caidwell, Jr., Lyle F. Cald well, James Otis Carter, Frank Chandler, Russell Aubrey Cheat- ham, David A. Christian, Helen Ab- bitt jColeman, Rebecca Coleman, Sidney A. Conner, Raymond T. Crawley, Thomas Hunier Dicker- son, Ernest S. Forbes, Alexander Franklin, David Marie Franklin, James H, Garrett, James ST Gor don, Jr., Fred Godsey, Richard Henderson Gowin, Berkley Hay wood Guill, James Middleton GuiU, Alfred R. Harwood, Jr.,- Landon James Hudson, Richard George Ja- Mr. Troy Mitchell Roberts died tka, John D. Johfriston, Jr.,"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Russell Aubrey Cheat- ham, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Helen Ab- bitt jColeman,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Russell Aubrey Cheat- ham, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Helen Ab- bitt jColeman,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1889.02, 705.65, 2062.17, 964.24], "bbox_id": "d698b47111", "file": "AppomattoxNewspapers_1952-1954a_0403.pdf", "page": 1, "text": "The Appomattox Chapter of the American Red Cross makes an ap peal for at least 50 walk-ins to come to Liberty Baptist Church base ment tomorrow, Friday, Oct. 30, and give a pint of blood. The chapter will fall short of the 135 pint quota unless others who have not already signed blood donor pledge cards give. Dr. David A. Christian, III, local physician issued this statement to day in making an appeal for blood donors The Red Cross Bloodmobile will visit Appomattox again on Friday, Oct. 30, between the hours of 1100 A. M. and 500 P. M., in the base ment of Liberty Baptist Church. The cessation of active conflict in Korea does not lessen the need for blood by the Red Cross. Appomattox being a participating County in the Red Cross Blood Bank program has made it possible for citizens of this county to receive hundreds of pints of blood free. One"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "pledge cards give. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, local physician issued"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "pledge cards give. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, local physician issued"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.9, 942.06, 1609.91, 1809.19], "bbox_id": "18e17810dc", "file": "AppomattoxNewspapers_1952-1954a_0508.pdf", "page": 1, "text": "t it. iO U n ccv u v a i tobacco commission mer- bacco leaf dealers and no 22 chewing tobacco manu- were listed. Tobacco ware- re Friends, Lynchs, Lib- j-tins, Moormans, Paces, Sc. George A. Diuguid   undertakers at 46 Main, e Lynchburg was disposed directory, on page 195, ets around to the miseel- ppartmer And therein at Appomattox County was fth Judicial CircAiit, with stavus A. Wingfield hold- ere the 15th of March and of September. He served, rounties of Bedford, Camp- nd I Amherst, as well as the f Lynchburg. Henry T. Parrish judge of the county court in  u b x , holding court the firs daw after the first Monday in mofth. is alnost incredible to find out H er of secret, benovolent ther societies and organizations d in the 1880s. Marshall 39, Hill City Lodge No. iburg Chapter No. 10, De r kmandery No. 4, Covenant 12, Star of the West e, Prince Hall Lodge No. 29, hapter No. 5, Knights of ujth two lodges, I. O. txyo lodges, I. O. R. M., gbities, Legion of Honor, mm, Knights of Honor, ite with four units, St. eneficial Society, St. viers, Ladies of the Al- en add in the Garland lub, Oliver Twist Club, ty Boat Club, The Gentle- ng Club, Ladies Glee ordia Glee Club, Mozart ___ and Opera House. Gee, sver stayed at home no won- m didnt need television! to newspapers, there were The Lynchburg News pub- evefcr morning except Mon- WHfgjplso got out a tri-weekly 1 onlMonday, Wednesday and i, and on top of that a weekly  enlThursday. That seems to P toJTEN issues a week. The bum Virginian and the Daily lC j tbe same, except that dvaniee got out a semi-weekly  fa tri-weekly on top of its and weekly issues it all indi- tbai 29 papers a week were led.A. Waddill was proprie- ThigNews and a young fellow 8 6Pne of Carter Glass was ditor. JgjBpomattox way, N. H. Rag- ras mstmaster and ran a gen- aerchndise store. The school nown as Budwells High L mbert P. Pattei son was the  daitor. Joel W. Flood was  cattle dealer, as was W. tneyUEdward G. Hix ran the loteLIWilliam H. Gills was the 7 hwosurer, David A. Christian I William A. Plunkett aeriff, John Robertson was the akerand T. P. Taylor was e of peace. John and Will- osser ran stores. Leading farm- nr w Woodson, John .M   Sears, Charles H. Sack- ilhsjgb,e, William Trent. Allen pings Conner, Ed S. -ontmfced on Page Four"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "A"], "snippet": "was the 7 hwosurer, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> I William <mark>A</mark>. Plunkett"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "A"], "snippet": "was the 7 hwosurer, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> I William <mark>A</mark>. Plunkett"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1068.0, 798.26, 1235.15, 999.14], "bbox_id": "7671a56762", "file": "AppomattoxNewspapers_1949-1952a_0325.pdf", "page": 1, "text": "Stonewall, April 10.-, We are sure having rain for the spring flowers 0 blossom and the grass to get gieen. We still have lots of sickness around here. We hope they will all soon be well. Mr. and Mrs. Irby Wheeler and family visited relatives in Roanoke last week-end. Dr. David A. Christian and fam ily, of Appomattox vi-jFcd his sis- ler, Mrs. Parks Jennings, and Mr. Jnnings on Sunday night. He has just returned from a vacation in Florida. Miss Anne Carson has rcturmd Li her work in Lynchbu.- after be- ng sick for a week at the home ol her parents, Mr. aid c d"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Roanoke last week-end. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and fam ily, of"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Roanoke last week-end. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and fam ily, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2235.54, 1392.28, 2402.8, 1841.03], "bbox_id": "d569f28799", "file": "AppomattoxNewspapers_1954-1955a_0186.pdf", "page": 1, "text": "some bf his old company yester day. They were taken from Battery and put into active service in the fight near Drewrys Bluff. Two were killed, Nathan Wright and William Hardin, and three were wounded. Charles Phelps, and David Abbitt and another one I do not remember his name. David Abbitt was serious ly wounded through the shoulder. I have not heard from Overtons company for over two weeks at last account they had not left their battery, I think. Brother George mentioned in our letter about Jim mie Featherstons horse being shot from under him while he was fol lowing General Hill. Capt. Adams captured a little Yankee Negro a few days ago. He was waiting on a Yankee orderly sargent of the north and when they left our front, he was left asleep. He is a smart little fellow about 11 years old and from his account has been in the service for three years. Jessie has been sick, but has recovered. I most of our Corps here have been sick have had the Diarrhoea slightly. Jimmie Featherston expects to get a detail to come home and get a horse he may possibly get it I think it doubtful. I think that you all might write twice a Week, while this campaign  last, for a week seems to me as long as a month generally is. Write every opportun ity. I will send this letter the first opportunity. Brother Georg  is off duty as a eourier. I have written al I could think of that would be at all interesting. Write as soon as you receive this short scroll. Your Affectionate Son, David A. Christian."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "scroll. Your Affectionate Son, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "scroll. Your Affectionate Son, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "T. Par-  rish and <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>. TRIAL JUSTICEST. R. Horseley"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "T. Par-  rish and <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>. TRIAL JUSTICEST. R. Horseley"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1782.53, 808.05, 2033.04, 929.15], "bbox_id": "7420652a58", "file": "AppomattoxNewspapers_1962-1965a_0421.pdf", "page": 1, "text": "She was chosen from among A W 9 r f l several local applicants for the  1110 a n a i u award. She is the years district treasurer for the Honor Society, French Club secretary, member of the Booster Club, Speech Lea gue, First Methodist Church in Lebanon, and has been active in 4-H for eight years. Miss Koos is the granddaugh ter of the late Dr. and Mrs. David A. Christian of Appomat tox."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "late Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> of Appomat tox."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "late Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> of Appomat tox."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [789.86, 1031.4, 948.51, 1363.3], "bbox_id": "10ff385329", "file": "AppomattoxNewspapers_1912-1915a_0071.pdf", "page": 1, "text": "School Officials Given Presents. Joseph D. Eggleston and R. C. Stearnes, the outgoing and incoming Superintendent of Public Instruc tion of Virginia, were presented with handsome tokens of regard by mem bers of the department and its allied activities. A loving cup was the pres ent handed Mr. Eggleston, while for Mr. Stearnes a gold-headed cane was the portion. The retiring superintend ent, just back from Washington, was opening his mail and setting his house in order for final withdrawal, while the new official was receiving mes sages and letters of congratulation. Then the entire office force descended upon the twain, who were forced to stand up and take their medicine. Judge David A. Christian, the office statistician and acting secretary to the State Board of Education, spoke up first. Regretting in the beginning that he did not possess the eloquence of a Cicero or Demosthenes, Judge Christian left those worthies not far behind. He referred to the work done by Mr. Eggleston in the office, but leaving this phase to the future his torian, he dwelt upon the affection felt by the subordinates  for the man who now becomes National Supervisor of Rural Schools. In conclusion he pre sented the beautiful loving cup to Mr. Eggleston, who responded as well as he could under affecting circum stances."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "take their medicine. Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, the office statistician and"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "take their medicine. Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, the office statistician and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [792.66, 1033.53, 950.83, 1365.91], "bbox_id": "027b79c1cc", "file": "AppomattoxNewspapers_1912-1915a_0072.pdf", "page": 1, "text": "School Officials Given Presents. Joseph D. Eggleston and R. C. Stearnes, the outgoing and incoming Superintendent of Public Instruc tion of Virginia, were presented with handsome tokens of regard by mem bers of the department and its allied activities. A loving cup was the pres ent handed Mr. Eggleston, while for Mr. Stearnes a gold-headed cane was the portion. The retiring superintend ent, just back from Washington, was opening his mail and setting his house in order for final withdrawal, while the new official was receiving mes sages and letters of congratulation. Then the entire office force descended upon the twain, who were forced to stand up and take their medicine. Judge David A. Christian, the office statistician and acting secretary to the State Board of Education, spoke up first. Regretting in the beginning that he did not possess the eloquence of a Cicero or Demosthenes, Judge Christian left those worthies not far behind. He referred to the work done by Mr. Eggleston in the office, but leaving thi3 phase to the future his torian, he dwelt upon the affection felt by the subordinates. for the man who now becomes National Supervisor of Rural Schools. In conclusion he pre sented the beautiful loving cup to Mr. Eggleston, who responded as well as he could under affecting circum stances."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "take their medicine. Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, the office statistician and"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "take their medicine. Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, the office statistician and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [870.49, 377.53, 1038.79, 484.48], "bbox_id": "e746155e9f", "file": "AppomattoxNewspapers_1955-1957a_0023.pdf", "page": 1, "text": "Pamplin Vicinity, Nov. 22.- This community was saddened to hear of Dr David A. Christian, Jr., death. He has left many memories. He was such a good doctor, as well as a good man. Mr. and Mrs. Carlton Woodall and family attended the funeral of Mrs. W. E. Childers, of Phenix, on Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "to hear of Dr <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., death. He has"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "to hear of Dr <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., death. He has"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2220.47, 400.63, 2389.32, 459.88], "bbox_id": "6c32024df9", "file": "AppomattoxNewspapers_1954-1955a_0224.pdf", "page": 1, "text": "Pamplin Vicinity, March 1.- We extend deepest sympathy to the bereaved family of our dearly be loved Dr. David A. Christian, III, who met his death Friday night."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Pamplin Vicinity, March 1.- We extend deepest sympathy to the bereaved family of our dearly be loved Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, who met his death Friday night."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Pamplin Vicinity, March 1.- We extend deepest sympathy to the bereaved family of our dearly be loved Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, who met his death Friday night."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [958.8, 352.62, 1128.6, 381.32], "bbox_id": "4782fe5449", "file": "AppomattoxNewspapers_1943-1947a_0401.pdf", "page": 1, "text": "Or. David A. Christian and his family spent Sunday with Mr. and Mrs. Parks Jennings."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Or. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and his family spent Sunday with Mr. and Mrs. Parks Jennings."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Or. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and his family spent Sunday with Mr. and Mrs. Parks Jennings."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [318.95, 682.25, 487.4, 718.9], "bbox_id": "49d5742286", "file": "AppomattoxNewspapers_1939-1943a_0599.pdf", "page": 1, "text": "Mt. and Mrs. George Leo Koos, .1., spent the week-end in the home  f h parents, Dr. and Mrs. David A. Christian."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mt. and Mrs. George Leo Koos, .1., spent the week-end in the home  f h parents, Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mt. and Mrs. George Leo Koos, .1., spent the week-end in the home  f h parents, Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2025.58, 1025.67, 2193.22, 1310.4], "bbox_id": "26925e844b", "file": "AppomattoxNewspapers_1949-1952a_0509.pdf", "page": 1, "text": "Mrs. Reggie W. Stanley was hos tess to the Tuesday Night Bridge Club this week. High score honors went to Mrs. David E. Caldwell, Jr and Mrs. S. A. Lawson received the low score prize. Little Miss Jane Hamner Stanley presented each guest with unique lapel pins made by her mother. Mrs. Harold E. Thompson and daughters of Natick, Mass., Miss Joice Christian, a student at Wellsley College, Mass., and Mrs. Worth Har ris of Florida, were called home dur ing the past week on account of the illness of their father, Dr. David A. Christian, Jr., a patient at the Vir ginia Baptist Hospital. The doctors condition is reported to be satisfac tory at this time. Visitors in the home of Mrs. Fred Franklin. Sunday were Mr. and Mrs. Freel Lines of England, Mrs. Oscar Stenan of Salina, Kan. Mr. and Mrs. Elmore McFadden of Washington, Mrs. W. D. Fad den of Roanoke. Mr. and Mrs. W. H. Harris and family of Vinton."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "a"], "snippet": "of their father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., <mark>a</mark> patient at"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "a"], "snippet": "of their father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., <mark>a</mark> patient at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.49, 1053.18, 1871.59, 1373.02], "bbox_id": "a3f6921f2d", "file": "AppomattoxNewspapers_1952-1954a_0137.pdf", "page": 1, "text": "Mrs. Mary Elizabeth Tucker Me- Dearmon, wife of Clarence Stickley MeDearmon, died Tuesday at her home here after an illness of about three years. She was born at Nysalta, in Am herst County, the daughter of the late John Wilbur Fiske Tncker and Mary Richard Smith Tucker. She at tended schools in Amherst County and the Gooch School in Danville. She was a member of Memorial Methodist Church. Besides her husband, she is sur vived by three sons, James Wilbur and C. Lewis MeDearmon, of Appo mattox, and John Richard Tucker MeDearmon, of Richmond three daughters, Mrs. Frances McD. Cheat ham, of Appomattox Mrs. Sam B. Witt, Jr., of Fichmond, and Miss Mildred MeDearmon, of Columbia, S. C. and five grandchildren. Funeral services were held Wed nesday at 330 P. M, at the resi dence. Burial was in Liberty Ceme tery. Active pallbearers were Dr. David A. Christian, HI Claude W. Smith, J. A. Burke, Robert Doss, S. L. Ferguson, Jr. Harry MeDear mon, Floyd A. Porter and Walter Tucker, Jr."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Active pallbearers were Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, HI Claude W. Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Active pallbearers were Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, HI Claude W. Smith,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.26, 1178.1, 1902.69, 1428.84], "bbox_id": "7f2aae71f4", "file": "AppomattoxNewspapers_1952-1954a_0576.pdf", "page": 1, "text": "Mrs. L. L. Gayle entertained at three tables of bridge on Tuesday evening. Guests included   Mes dames D. E. Caldwell, Jr. R. W. Stanley, J. R. Lawson, Calvin Robin son, Charles R. Thomas, John S. Grinels, T. DeWitt Evans, H. B. Pack, C. S. Booth, C. G. OBrien, W. E. Hancock, and S. A. Lawson. Top score prizes were awarded Mrs. Stanley and Mrs. Thomas. Consolo- lation prizes went to Mrs. Pack and Mrs. Robinson. Mrs. Charles R. Thomas entertain ed at three tables of bridge Wednes day evening. Guests included Mes dames L. L. Stanley, G. F. Abbitt, Jr. Calvin H. Robinson, H. Y. Spencer, H. C. Pulliam, H. E. Kerr, Mark Saurs, A. R. Gordon, John S. Grinels, T. DeWitt Evans, H. W, Runkle, and David A. Christian III Mrs. Abbitt was awarded high score trophy and Mrs. Robinson the low score."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "H. W, Runkle, and <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Mrs. Abbitt was"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "H. W, Runkle, and <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Mrs. Abbitt was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.49, 895.14, 609.33, 943.74], "bbox_id": "9db7a44f93", "file": "AppomattoxNewspapers_1955-1957a_0318.pdf", "page": 1, "text": "Mrs. David A. Christian III and three children, of Staunton, visit ed here Sunday in the homes of Mr. and Mrs. Heilbert Runkie and Mr. and Mrs. J. R. Redding."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III and three children, of Staunton, visit ed here Sunday in the homes of Mr. and Mrs. Heilbert Runkie and Mr. and Mrs. J. R. Redding."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III and three children, of Staunton, visit ed here Sunday in the homes of Mr. and Mrs. Heilbert Runkie and Mr. and Mrs. J. R. Redding."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [766.55, 1782.1, 934.49, 1832.45], "bbox_id": "c63fc4a4b1", "file": "AppomattoxNewspapers_1954-1955a_0313.pdf", "page": 1, "text": "Mrs. David A. Christian, III, and three children, Mary Catherine, Pa mela and David IV, have moved to Staunton, Va., where they will make their home. Mr. and Mrs. Jesse T."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, and three children,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, and three children,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [779.74, 1144.44, 946.91, 1298.69], "bbox_id": "317429dc2a", "file": "AppomattoxNewspapers_1955-1957a_0110.pdf", "page": 1, "text": "Mrs. D. E. Caldwell, Sr. Mrs. L. C. McKenzie Mrs. C. F. James Committee. IN MEMORY In memory off Mr. Luther E. Morris and Dr. David A. Christian IH, who died a year ago, Feb. 25, 1955. One year has passed away, dear friends, Since God has called youall home To be with Him in heaven, Around the snow white throne. Mrs. Ida Paulette Allan."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "a"], "snippet": "E. Morris and Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> IH, who died <mark>a</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "a"], "snippet": "E. Morris and Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> IH, who died <mark>a</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [910.8, 451.07, 1079.28, 630.31], "bbox_id": "380d078b6b", "file": "AppomattoxNewspapers_1954-1955a_0230.pdf", "page": 1, "text": "Mr. and Mrs. Willie Beale and son, Walker were Wednesday night guests of Mr. and Mrs. Percy Gar- rette. Those on the sick list in this neighborhood are Mrs. Homer Reyn olds and son, Cecil and Miss Caro lyn Childers. Friends are shocked and hurt over the death of our Dr. David A. Christian, III. Our hearts go out in sympathy to his dear father, his wife and all of the family. The Vera P.-T. A. will sponsor a minstrel, The Vera Dixie Doodles March 19, at 890 at the school."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "death of our Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Our hearts go"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "death of our Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Our hearts go"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1549.34, 1020.89, 1718.02, 1189.53], "bbox_id": "29b1e46cd6", "file": "AppomattoxNewspapers_1952-1954a_0346.pdf", "page": 1, "text": "Mr. and Mrs. Parks Jennings en tertained Mrs. Jennings family, the Christians, at a family reunion at their home August 9, with a picnic lunch. Guests included Mr. and Mrs Tom Christian, their daughter and family, of Covington Drs. Thomas Jennings and family, Rev. Charles Spain and family, of Alabama Mr. and Mrs. Keeling Sisson and family, of Richmond Dr. D. A. Christian and son, Chesley Dr. David A. Christian, Jr. and family, of Appo mattox Miss Mary Frances Jen nings, of Richmond and George Jen nings and family alsq Mrs. H. B. Jennings."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "and son, Chesley Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. and family, of"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "and son, Chesley Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. and family, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2174.91, 451.26, 2316.26, 774.0], "bbox_id": "64c9327728", "file": "AppomattoxNewspapers_1974-1975a_0095.pdf", "page": 1, "text": "Mr. and Mrs. George L. Koos, Jr., Route 1, Box 189, Tangent, Oregon, announce the engagement of their daughter, Kathryn Adele Koos, to Rich ard Orrie Cundiff, son of Richard R. Cundiff, Bishop, California, and Mrs. Bilie Cundiff, Los Angeles. Miss Koos is a graduate of Albany Union High School, Albany, Oregon, and the University of Oregon, Eugene, Oregon. She is now employed as a Social W orker for the Veterans Administration in Eugene. Mr. Cundiff graduated from Franklin High School, Los Angeles, California, and is currently attending the Uni versity of Oregon, Eugene, Oregon. The wedding will be held in the First United Methodist Church, Lebanon, Oregon, at 730 p.m. on Saturday, Decem ber 28,1974. Miss Koos is a granddaugh te r of the former Dr. and Mrs. David A. Christian, Jr. of Appomattox."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "former Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "former Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. of Appomattox."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1413.85, 699.75, 1574.62, 734.5], "bbox_id": "386411bd2c", "file": "AppomattoxNewspapers_1912-1915a_0181.pdf", "page": 1, "text": "Mr. and Mrs. D. A. Christian, of Richmond, are on a yieit to their son, Dr. David A. Christian, here."}, "highlight": {"text": {"matched_tokens": ["A", "Christian", "a", "David", "A", "Christian"], "snippet": "Mr. and Mrs. D. <mark>A</mark>. <mark>Christian</mark>, of Richmond, are on <mark>a</mark> yieit to their son, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, here."}}, "highlights": [{"field": "text", "matched_tokens": ["A", "Christian", "a", "David", "A", "Christian"], "snippet": "Mr. and Mrs. D. <mark>A</mark>. <mark>Christian</mark>, of Richmond, are on <mark>a</mark> yieit to their son, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, here."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1398.67, 386.27, 1550.59, 525.42], "bbox_id": "629726ecea", "file": "AppomattoxNewspapers_1947-1949a_0153.pdf", "page": 1, "text": "Miss Constance Fulp, of Richmond ffa home for the week-end. Dr and Mrs. David A. Christian, II, of Dallas, Texas have arrived to visit his father here. Mrs. H. M. Hurt, of Blackstone, spgnt the week-end in the home of Miss Lula Irby. Mr and Mrs. Hurley Ferguson, of Lynchburg visited Mrs. L. E. Morris Sunday. Mrs. Morris is recovering from a recent illness."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "week-end. Dr and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, II, of Dallas, Texas"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "week-end. Dr and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, II, of Dallas, Texas"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [257.32, 1462.23, 357.41, 1808.22], "bbox_id": "64410cafdd", "file": "AppomattoxNewspapers_1933-1936a_0028.pdf", "page": 1, "text": "Mayberry, William T. Childsrs, William T.  Morgan, Nelson Christian. David A.  Garrett, William T. Coleman, Walter L. Scruggs, Silas Coleman, Joseph P.  Coleman, Herbert S. Coleman,, Joel T. Coleman, James T. Nash, L. T.  Covington, Edgar A. Cole, John T  Son j Covington, Wm. J. Jrl Davidson, Jessie D. r Davidson, Thomas B. Davidson, Jessie 0.  Dickerson, Jesse E  Drinkard, Laur- , I ..................... nee M.  Almond, Henry C.  Drinkard, Samuel C. Saundeis, Andrew j Durrum, John W. Ferguson Bros. Flood, Joel W. I Johnson, Charlie L. i Flood, Joel W. Carter, Warner C. Flood, Joel W. Attyl Smith, Edward H. Flood, Joel W. Attyl Ferguson, John M. Ferguson, Sam L.  Ferguson, Ernest  Ferguso a Sam L. Garrett, Monroe L. Garrett, William C."}, "highlight": {"text": {"matched_tokens": ["Christian", "David", "A"], "snippet": "William T.  Morgan, Nelson <mark>Christian</mark>. <mark>David</mark> <mark>A</mark>.  Garrett, William T. Coleman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Christian", "David", "A"], "snippet": "William T.  Morgan, Nelson <mark>Christian</mark>. <mark>David</mark> <mark>A</mark>.  Garrett, William T. Coleman,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [624.5, 1015.4, 793.55, 1074.84], "bbox_id": "630782d457", "file": "AppomattoxNewspapers_1955-1957a_0341.pdf", "page": 1, "text": "Many friends and relatives will be in Appomattox for the unveiling of the oil painting of the late Dr. David A. Christian, III, at Appo mattox C. H. at 2 P. M. Friday. It is a tribute to a family that"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, at Appo mattox"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, at Appo mattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1870.29, 1111.34, 2045.5, 1808.72], "bbox_id": "0fbc14245f", "file": "AppomattoxNewspapers_1954-1955a_0226.pdf", "page": 1, "text": "LETTER LAUDS DR. CHRISTIAN Note Permission has been ob tained to publish the following let ter.  j Pamplin, Va, February 28, 1955. Dr. David A. Christian, Jr. Dear Dr. Christian, I must write this letter before another day is gone. Perhaps you consider this letter as one coming from the entire population of the little town of Pamplin and the sur rounding community. My vocabulary and education are far too limited to properly express the deep feeling of loss suffered by the tragic death of Dr. David, III. Everyone who had ever been ac quainted with him either socially or professionally loved him. His daily life and the practice of his profession was a shining example of witnessing for Christ. His was a life of service, daily practicing to the letter the Hippo cratic Oath. Many times he was called to out town, and always he came willingly and quickly, giving to all his pro fessional skill and kindness, re gardless of race, color or creed. His serene manner brought order out of chaos to many homes, and when nothing more could be done he left comfort and courage in those homes. This must have stem med from a deep abiding faith in God. I am a graduate nurse R. N. and became well acquainted with him. Often he sent patients to me for medicine or treatment which I could give, thus saving time and money for many of his patients who other wise might have had to wait until his busy schedule gave him time to come to them. Whatever our questions may be as to why death came to him in the way it did, I feel he died doing what he had always done, giving loving unselfish service to his fellow man. Im sure the Master said, Well done, when He welcomed Dr. David home. I never had the pleasure of meet ing Mrs. Christian socially, but I am very sure God will take her hand and yours, and give His loved ones the strength and help you will need in the long hours ahead. You must have been a wonderful father to have had such a fine son My husband, family and all the people here join me in this expres sion of sympathy. Sincerely, Mrs. Richard F. Williams"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "February 28, 1955. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. Dear Dr. <mark>Christian</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "February 28, 1955. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. Dear Dr. <mark>Christian</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1868.16, 1113.42, 2043.57, 1810.62], "bbox_id": "fda8265119", "file": "AppomattoxNewspapers_1954-1955a_0225.pdf", "page": 1, "text": "LETTER LAUDS DR. CHRISTIAN Note Permission has been ob tained to publish the following let ter. - j Pamplin, Va, February 28, 1955. Dr. David A. Christian, Jr. Dear Dr. Christian, I must write this letter before another day is gone. Perhaps you consider this letter as one coming from the entire population of the little town of Pamplin and the sur rounding community. My vocabulary and education are far too limited to properly express the deep feeling of loss suffered by the tragic death of Dr. David, III. Everyone who had ever been ac quainted with him either socially or professionally loved him. His daily life and the practice of his profession was a shining example of witnessing for Christ. His was a life of service, daily practicing to the letter the Hippo cratic Oath. Many times he was called to oui town, and always he came willingly and quickly, giving to all his pro- fessionaly skill and kindness, re gardless of race, color or creed. His serene manner brought ordei out of chaos to many homes, and when nothing more could be done he left comfort and courage in those homes. This must have stem med from a deep abiding faith in God. I am a graduate nurse R. N. and became well acquainted with him. Often he sent patients to me for medicine or treatment which I could give, -thus saving time and money for many of his patients who other wise might have had to wait until his busy schedule gave him time to come to them. Whatever our questions may he to why death came to him in the way it did, I feel he died doing what he had always done, giving loving unselfish service to his fellow man. Im sure the Master said, Well done, when He welcomed Dr. David home. I never had the pleasure of meet ing Mrs. Christian socially, but I am very sure God will take her hand and yours, and give His loved ones the strength and help you will need in the long hours ahead. You must have been a wonderful father to have had such a fine son. My husband, family and all the people here join me in this expres sion of sympathy. Sincerely, Mrs. Richard F. Williams"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "February 28, 1955. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. Dear Dr. <mark>Christian</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian", "Christian"], "snippet": "February 28, 1955. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. Dear Dr. <mark>Christian</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1905.26, 1532.62, 2075.89, 1813.41], "bbox_id": "1446a08713", "file": "AppomattoxNewspapers_1954-1955a_0192.pdf", "page": 1, "text": "land, Mrs. A. R. Harwood, Jr. Mrs. F. F. Carr and Miss Beulah Ferrell were among those present. A mo ment of silent prayer followed in memory of Miss Anne Caldwell and Mrs. David A. Christian, Jr., former presidents. Charter members were then recognized and those present were also presented a corsage. These included Mrs. H. Y. Spencer, Miss Flora Williams, Mrs. Lucy Crawley and Mrs. James. It was announced by Mrs. A. R. Harwood, Jr. that Appomattox is in eluded again this year in the His toric Garden Week in Virginia tour, with the McLean House, the Tav ern and Longacre, the home of Mrs. F. C. Dresser open to the pub lic. Plans for a Spring Flower Show were discussed, with a possibility of having a show during Garden Week again this year. Mrs. K. C. Gregory was awarded blue ribbon for her Dish Garden and also for her Terranium, while Miss Flora Williams won a yellow"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Anne Caldwell and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., former presidents. Charter"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Anne Caldwell and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr., former presidents. Charter"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1208.38, 304.25, 1377.54, 534.8], "bbox_id": "48bba104a1", "file": "AppomattoxNewspapers_1939-1943a_0474.pdf", "page": 1, "text": "Jones. , The honorary pallbearers included several who were former members of Miss Jones Junior Confederate organization Hon. Charles T. Moses, Judge Joel West Flood, Alfred Rice Harwood, Sr., Dr. Charles F. James, Leanord E, Smith, Thomas W. Moses, Prof. Lindsay Crawley, William A. Moses, Ragland Featherston, Wat kins Moorman Abbitt, George F. Ab- bitt, Jr., Dr. David A. Christian, James T. Caldwell, Harvey Alexan der Caldwell and Charles Franklin Jones. Miss Lula Graf Irby, Mrs. John Edward Sears and Mrs. Jerry Allen Burke were among those attending the serveices representing the form er members of the Con foredate Jun iors organized by Misi Jones. The members of the Appom ittox Chapter of the United Daughters of the Con federacy acted as flower bearers and carried the Confederate flag."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Ab- bitt, Jr., Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, James T. Caldwell, Harvey"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Ab- bitt, Jr., Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, James T. Caldwell, Harvey"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [484.11, 978.07, 660.45, 1228.06], "bbox_id": "27344afdac", "file": "AppomattoxNewspapers_1952-1954a_0384.pdf", "page": 1, "text": "its new members and the teachers of Appomattox County with a tea on Friday afternoon from 3 oclock to 5 oclock in the dining room of 1 the McLean House. The dining room presented a beautiful setting for the decorations which carried out a motif of blue, silver, and rose. Mrs. Martin Wf-,1-.1 headed . the committee for general arrange ments. The following members of the Executive Board had charge of refreshments Mrs. Joel Flood, Mrs Charles Crawley, Mrs. David A. Christian, Mrs. Jerry Burke, Mrs. Charles Thomas, Mrs. C. Kendall Hunter, Mrs. George Abbitt, Mrs. Howard Kerr and Mrs. Hubert Gur ney. The decorations were -planned by Mrs. Bessie V. Caldwell and Mrs. Robert Hubbard Mrs. Hazel Mann and Mrs. Roger Norfleet were in charge of correspondence."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs Charles Crawley, Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Mrs. Jerry Burke, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs Charles Crawley, Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Mrs. Jerry Burke, Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2136.49, 1080.63, 2304.79, 1239.93], "bbox_id": "c8b668bb36", "file": "AppomattoxNewspapers_1949-1952a_0433.pdf", "page": 1, "text": "It was announced here this morn ing that Dr. David A. Christian, III will be released by the U. S. Navy within the next ten days, in order that he might return to his practice at Appomattox. Dr. Christian was called back to the U ! , a year ago, and is stationed now at Quantico, Va. Appomattox has experienced a serious medical problem during re cent months, and the shortage of doctors and great need for addition al practicianers, led local citizens to seek the release of Dr. Christian from the Navy."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "morn ing that Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III will be released"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "morn ing that Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III will be released"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [630.67, 295.96, 1410.51, 790.99], "bbox_id": "ad28deb92a", "file": "AppomattoxNewspapers_1952-1954a_0607.pdf", "page": 1, "text": "I Ï Ï 5 a    . April 9th Surrender Scene Described by Eye-Wi Un Editors note We are pleased to publish below an eyewitness descrip tion of the Surrend.-r at Appomat tox, written by Judge David A. Christian, father of Dr. D. A. Christ ian, 11. April 9, 1865 There are days in all of our lives in which scenes occur that impress themselves indelibly upon our mem ory, some of joy, some of sorrow. Purely the ninth of April 1865 was one of those days. At its recurrence each year our minds eye goes back to that ever memorable day and re views the scenes that then occurred. This scribe, though then only a boy in his teens, was one of the 8,000 soldiers that surrendered his musket on that occasion, and well does he remember the feeling of despair that filled his bosom when the dreadful news came that General Lee had sent forward the flag of truce and was negotiating the terms of surrender. Every hope that had brought him to the heroic struggle for liberty, was then thought forever gone. Oh, how vividly do we remember seeing our dearly beloved Lee coming back on his noted war horse Traveller and bringing the sad, sad news that he had surrendered. As he approached, his old soldiers gathered around him, soldiers of all ages and conditions of life, from boys in their teens to the old wrinkled veterans, from men who bore the proudest names in our Southland to those who could not even write their own names but who clung to their beloved leader with no less devotion, all bound together as one man by a common cause, a common love for their countrv, those"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "tox, written by Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, father of Dr. D."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "tox, written by Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, father of Dr. D."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1437.84, 401.11, 1527.19, 556.52], "bbox_id": "844bf68591", "file": "AppomattoxNewspapers_1954-1955a_0151.pdf", "page": 1, "text": "í!, 1  , 0 oclock I She   he United Na- I was sponsored by the ifairs and Education- Affairs  1 , th  of the club, under the fMrs H. A. Gurney, re served the mem- guests from a table  tmas decorations. The the afternoon were MeS L. Burke, Kenneth Jerry A. Burke, David David A. Christian"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Jerry A. Burke, David <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Jerry A. Burke, David <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.29, 322.47, 1662.45, 357.42], "bbox_id": "179bf11bec", "file": "AppomattoxNewspapers_1922-1923a_0316.pdf", "page": 1, "text": "Hon. David A. Christian is at home near Vera where he has sev eral children down with dypthcria"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Hon. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> is at home near Vera where he has sev eral children down with dypthcria"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Hon. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> is at home near Vera where he has sev eral children down with dypthcria"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2127.58, 351.17, 2294.48, 458.87], "bbox_id": "0cd4c5d400", "file": "AppomattoxNewspapers_1949-1952a_0393.pdf", "page": 1, "text": "Herald-Post of July 11 Mr. and Mrs. William J. Byerly of 1137 Arizona Street have as their house guests Mrs. Byerlys father, Dr. David A. Christian, his daughter Joice and son Chesley, all of Appomattox, Va., and Mrs. Byerlys cousin, Miss Frances James, of Charlottesville, Va. Mrs. Byerly is the former Miss Catherine Christian, of Appomattox. Mr. Byer ly is assistant city plan engineer."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. Byerlys father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, his daughter Joice and"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mrs. Byerlys father, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, his daughter Joice and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2209.19, 669.5, 2376.84, 777.3], "bbox_id": "20cb029671", "file": "AppomattoxNewspapers_1952-1954a_0573.pdf", "page": 1, "text": "heartily endorse the Red Cross Blood Program. Blood is of great value to the Armed Forces. Its use in the treatment of emergencies cannot be over- estimated. Dr. David A. Christian III"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "be over- estimated. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "be over- estimated. Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.33, 1104.83, 1746.76, 1426.81], "bbox_id": "9b17824c18", "file": "AppomattoxNewspapers_1952-1954a_0566.pdf", "page": 1, "text": "Funeral services for Willie Wirt Woodson 76 retired f 3 i,m 6 r who died at his home at Spout Spring last Friday morning after an illness of six weeks, were conducted from the Liberty Baptist Church Sunday at 3 P. M. Burial was in Reedy Spring Cemetery. He was born in Appomattox Coun ty in 1878, the son of Richard and Victoria Portwood Woodson. His first wife was the late Mrs. Cheatham Woodson. His second wife, Ella Rush Woodson, survives him. He is also survived by three sons, Clyde W. Woodson, Newport News Paul C. Wodson, Washington and Samuel R. Woodson, Appomattox five daugh ters, Mrs. Celene Taylor, Norfolk Mrs. Ethel Nash, Bedford Mrs. Doro thy Martin, Amherst Mrs.Beatrice Denapoly, Williamsburg Mrs. Ber nice Overstreet, Bedford, and a sister. Mrs. Myrtle Wattles of Huston, Tex. In addition he is survived by 16 grandchildren and 3 great-grandchil dren. He was a member of Liberty Baptist Church. Active pallbearers included Dr. W. M. Wattles, Dr. David A. Christian III, Walter Woodson, Russell Wood- son, E. F. Hastings, iSammie Oakes,"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "W. M. Wattles, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III, Walter Woodson, Russell"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "W. M. Wattles, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III, Walter Woodson, Russell"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.83, 587.77, 2134.18, 1148.82], "bbox_id": "05a9ab2847", "file": "AppomattoxNewspapers_1955-1957a_0021.pdf", "page": 1, "text": "Funeral services for Dr. David Alexander Christian, Jr., 75, who died at his home here at 530 A. M. Friday, were conducted Monday at 330 P. M. from the Liberty Baptist Church. Burial was in the Christian family cemetery near Vera. The beloved veteran physician had been in declining health for some months, but had remained active and had ministered to patients in recent weeks, both at his home office and calls to .their homes. Horn in Appomattox County, he was the son of the late Judge David A. Christian and Mrs. Agnes Thorn hill Christian. He attended South side Chase City Academy and grad uated from the Medical College of Virginia in 1908. The same year, he began the practice of medicine in Appomattox and continued until his death. In 1916, he married Miss Bessie Stratton, who died in 1944. He was a member of New Hope Baptist Church, of Monroe Masonic Lodge, American Medical Associa tion and American Association of Railway Surgeons. His grandfather was the late Dr. William D. Christian, who for many years attended to the medical needs of the community. His father was the late Judge of Appomattox Cir cuit Court. He is survived by five daughters Mrs. George L. Koos, Jr., Tangent, Oregon Mrs. Harold E. Thompson, Jr., Aelxandria Mrs. Worth Harris, Lacrosse, Florida Mrs. William J. Byerly, Richmond Mrs. John _E. Cox Jr., South Swansea, Mass. one son, Chesley Stratton Christian, Appomattox two sisters, Mrs. G Parks Jennings, Appomattox, and Mrs. K. H. Sisson, Richmond one brother, Thomas L. Christian, of Covington and 14 grandchildren. Funeral services were conducteij by Dr. 0t A. Collins Jr., the Rev Charles Addington andthe Rev. ,W M. Thompson. Pal-bearers were Joel W. Flood, Harold Spencer, Chas. T Moses, Jerry Burke, J. A. Bingham Charlie Lewis, Wilson Thor.ihill and Walker OBrien."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and Mrs. Agnes Thorn"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Judge <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> and Mrs. Agnes Thorn"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1827.54, 1403.24, 1998.06, 1580.03], "bbox_id": "5933b4d2fc", "file": "AppomattoxNewspapers_1954-1955a_0271.pdf", "page": 1, "text": "FUND STILL GROWNG The fund raising drive for  the Dr. David A. Christian III Memor ial is progressing with sustained in terest. W. C. Dudley, fund treasur er, stated this week that a number of contributions had been received from Roanoke and vicinity as a re sult of an article in the Roanoke daily newspaper. The memorial is planned to honor the beloved local physician who was murdered while in the line of duty Feb. 25. The plan calls for a medical center building here. The fund has a goal of 20,- 000, and the project now has some 6,000 in cast and pledges."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "drive for  the Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Memor ial is"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "drive for  the Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Memor ial is"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2267.75, 1396.0, 2445.36, 1556.8], "bbox_id": "29e3a587a8", "file": "AppomattoxNewspapers_1960-1962b_0088.pdf", "page": 1, "text": "Friends here are distressed to hear -that Karl Koos, 2, son- of Mr. and Mrs.. George L. Koos, of Tan- gent, Oregon, was killed late Sat urday. The childs mother is the former Virginia Christian, the daughter ofhe-toto-Pr -David A Christian, J.r., of Appomattox. We are informed that the child, who have been three yearn old in. Octo ber, was fatally injured when hit ly a tractor.  Funeral services were -held Tues day in Tangent, Ore. In addition to the parents, h is survived by four brothers and sisters ------- -"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Christian, the daughter ofhe-toto-Pr -<mark>David</mark> <mark>A</mark> <mark>Christian</mark>, J.r., of Appomattox. We"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Christian, the daughter ofhe-toto-Pr -<mark>David</mark> <mark>A</mark> <mark>Christian</mark>, J.r., of Appomattox. We"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2063.24, 1390.84, 2231.73, 1838.88], "bbox_id": "5d47268c1d", "file": "AppomattoxNewspapers_1954-1955a_0186.pdf", "page": 1, "text": "Editors note We are indebted to Dr. D. A. Christian Jr., for the privilege of publishing the follow ing letter, written by his father on May 9, 1864, from Mechansville to his parents. David A. Christian was the son of Dr. W. D. Christian and his wife Lucy Christian, who was a daughter of David Bailey Patteson. This letter is only one of the many treasured documents in the collection of Dr. Christian, and this paper and its readers are al ways appreciative of the opportuni ty to read this material. -Editor. Dear Parents I wrote home a few days ago while our Army was around Hanover Court Junction. We have since mov ed down here within 2 miles of Mechanicsville and 8 miles north of Richmond, Va. I do not know any thing about where we are go ing. We stopped here last night. Probably we may leave here this evening or we may stay here sev eral days, I can not tell. Our Army came down parallel with the Yan kees. I think this move of General Grants is equivalent to an acknowl edgement of defeat. He has certain ly failed to carry out his first pro gramme. He has now, I suppose, adopted the plans of McClellan. He may think he can take Richmond like he did Vicksburg but he will find quite a different man from Peimbertan to interpose his pro gress To change the subject very much. I saw Charles Wingfield day before yesterday. He is as usual complain ing and when I saw him was hunt ing a hosptal. He says Bob Wing field is well. Brother George saw"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Mechansville to his parents. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> was the son of"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Mechansville to his parents. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> was the son of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [407.75, 337.98, 571.89, 427.87], "bbox_id": "aedde3076f", "file": "AppomattoxNewspapers_1952-1954a_0083.pdf", "page": 1, "text": "Editors note We are glad to be gin today the publication in in stallment form, a travalogue written by Dr. David A. Christian, II. The beloved Appomattox physician made an extended cross country tour last year, and from his extensive notes has written the following inter esting accountEditor."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "travalogue written by Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, II. The beloved Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "travalogue written by Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, II. The beloved Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1713.6, 1161.05, 1880.38, 1270.18], "bbox_id": "bf6997dfba", "file": "AppomattoxNewspapers_1954-1955a_0314.pdf", "page": 1, "text": "Dr. Stanley C. Boyce will occupy the office, of the late Dr. David A. Christian, HI, as of July 1. Mrs Elsie Lucado, who assisted Dr Christian as nurse, will assist Dr. Boyce. His office telephone number will be the same as that of the late Dr. Christian 3011. Dr. and Mrs. Boyce will reside in the home of the late Mrs. J. B. Abbitt, located at Lee-Grant and Burke Streets."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, HI, as of July"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, HI, as of July"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.31, 1511.45, 1862.14, 1613.59], "bbox_id": "11421dd02d", "file": "AppomattoxNewspapers_1943-1947a_0125.pdf", "page": 1, "text": "Dr. S. S. ObenShain, head of V. P. I.s department of soils. Citing a rix-yeur experiment car ried on at Staunton, he says that George Almond, U. S. Navy,, of the crop increased 15 in value Bainbridge, Md., has arrived to visit1 each year from an expenditure of bis parents, fig r. and Mrs. A. W ., 50 to 75 cents for lime. Almond. The lime, used in addition to ni- .......  trogen, phosphorous and potash, David A. Christian, III, U. S. N. gave an increase of approximately R., left Monday to enter the U. of 13 bushels of corn, 8 bushels of"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "trogen, phosphorous and potash, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, U. S. N."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "trogen, phosphorous and potash, <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, U. S. N."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.27, 922.79, 1865.57, 1275.48], "bbox_id": "2b34edac88", "file": "AppomattoxNewspapers_1954-1955a_0066.pdf", "page": 1, "text": "Dr. David A. Christian, III, was elected president of the Appomat tox IPTAY Club, at a meeting held last Friday evening at the Ap pomattox High School auditorium The meeting was called for the purpose of nominating and electing officers. The nominating committee was composed of Hugh Brown, Mrs Louise T. Brown, Mrs. H. C. Pulliam T. T. Martin and Charles Thomas. The following officers were nomi nated and elected President, Dr. D. A. Christian, III Vice president, John S. Grinels. Secretary and treasurer, Burke Guill. Directors were named as follows Judge J. W. Flood, football. Mrs. H. W. Runkle, summer pro gram. R. M. Ferguson, basketball. Ned Hancock, baseball. The president appointed the fol lowing committees membership, Charles Thomas, chairman, and Ver- nell Mitchell. Special activities, Mrs. H. C. Pulliam. The new club takes its name from the words, I Pay Ten a Year  the membership fee being ten dol lars a year contributed to aid the athletic and recreational program at Appomattox High School."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, was elected president"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, was elected president"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2211.08, 741.74, 2384.49, 936.33], "bbox_id": "b68db0b98c", "file": "AppomattoxNewspapers_1947-1949a_0246.pdf", "page": 1, "text": "Dr. David A. Christian announ- 1 ces the marriage of his daughter, 1 Mildred - Colyer Christian, to Joe I Worth Harris, son of Mr. and Mrs. I I. C. Harris, of Lacrosse, Florida.  The wedding took place on April 13, 1948, at 330 P. M. in Folks- ton, Georgia. Mrs. Harris is a graduate of. Appomattox High School and Mad-i iMn College, Harrisonburg, Va.  She is a member of Pi Kappa Sig ma Sorority. Mr. Harris attended the Univet- sity of Florida and is a member of Pi Kappa Alpha Fraternity. Mr. and Mrs. Harris are at home in Lacrosse, Florida, where he is engaged in business."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> announ- 1 ces the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> announ- 1 ces the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2042.9, 574.82, 2211.61, 906.91], "bbox_id": "c35b827ae6", "file": "AppomattoxNewspapers_1954-1955a_0223.pdf", "page": 1, "text": "Dr. C. G. OBrien has released the following statement to the people of the county I realize that all of us are sad dened by the untimely death of our beloved Dr. David A. Christian, III. And what we say will not relieve this empty feeling we have. He was more than a close friend and a physician to me because he gave me much inspiration in our daily con tact. And the only comfort that I can get is in my faith in the Heaven ly Father. I am sure He must have a better place for him. We have never received into our midst a duplicate of David Christian. But we are trying to contact some physi eian that would be interested in iO eating here. And until we do get help, I beg of you to continue to give me your cooperation. And if you will be patient, 1 will see all that call me for medical aid. My office office will continue 10 A. M. to 12 Noon, and 4 to 6 P. M., everyday, Wednesday in cluded and Sundays at 9 A. M. I will not remain in my office on Sunday after I finish seeing patients that are there at 9 A. M. C. G. OBrien, M. D."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of our beloved Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. And what we"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of our beloved Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. And what we"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.95, 642.47, 1857.73, 722.6], "bbox_id": "c02c179296", "file": "AppomattoxNewspapers_1954-1955a_0031.pdf", "page": 1, "text": "Dr. and Mrs. David A. Christian III, have announced the birth of son, David A. Christian, IV, born Saturday, July 17, at the Kings Daughters Hospital, Staunton, Va Mrs. Christian and infant son re turned to their home here last Thurs day."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III, have announced the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "Dr. and Mrs. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III, have announced the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [990.53, 1025.83, 1455.73, 1074.23], "bbox_id": "7700b3b418", "file": "AppomattoxNewspapers_1933-1936a_0126.pdf", "page": 1, "text": "David Christian a Lynakburg h, ed that h. has tvi WO SAID in   ìf Äi  Beot. I Alue... Kou  know Ut grott i"}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "a"], "snippet": "<mark>David</mark> <mark>Christian</mark> <mark>a</mark> Lynakburg h, ed that h. has tvi WO SAID in   ìf Äi  Beot. I Alue... Kou  know Ut grott i"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "a"], "snippet": "<mark>David</mark> <mark>Christian</mark> <mark>a</mark> Lynakburg h, ed that h. has tvi WO SAID in   ìf Äi  Beot. I Alue... Kou  know Ut grott i"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1661.31, 352.2, 1827.28, 456.29], "bbox_id": "407c43fd85", "file": "AppomattoxNewspapers_1939-1943a_0574.pdf", "page": 1, "text": "David A. Christian, III, USNR, who received his degree at Hamp- den-Sydney last week, spoke to Mrs. Helene Welchs English classes on luesday, Navy Day. His subject was Great Naval Heroes of Amer ican History. Mrs. Helen Alvis, of Richmond, spent the week-end with her moth er, Mrs. H. B. West."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "<mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, USNR, who received"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "<mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, USNR, who received"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.37, 978.23, 1824.38, 1014.87], "bbox_id": "d03302dd20", "file": "AppomattoxNewspapers_1939-1943a_0567.pdf", "page": 1, "text": "David A. Christian, III, AS, U. S N. R., left Sunday for the XT. S. Naval Hospital, where he will be stationed until the end of the year"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "<mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, AS, U. S N. R., left Sunday for the XT. S. Naval Hospital, where he will be stationed until the end of the year"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "<mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, AS, U. S N. R., left Sunday for the XT. S. Naval Hospital, where he will be stationed until the end of the year"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.93, 488.46, 1841.38, 615.81], "bbox_id": "eb2a27f075", "file": "AppomattoxNewspapers_1947-1949a_0048.pdf", "page": 1, "text": "Daughter of the late Albert and Lucinda Lowry Thornhill, born on farm which came to the Thornhill family by grant from Thomas Jef ferson, as Governor of Virginia, a part of which is still in the posses sion of the descendants of that family. In 1878 she was united in marriage to David A. Christian, one of the .leading citizens of Ap pomattox County, later judge of the county, who preceded her to the grave by 16 years."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "united in marriage to <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, one of the .leading"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "united in marriage to <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, one of the .leading"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2025.31, 338.28, 2193.56, 395.83], "bbox_id": "c6330622d5", "file": "AppomattoxNewspapers_1954-1955a_0227.pdf", "page": 1, "text": "dale, Ala., is visiting her parents, Mr. and Mrs. Parks Jennings, after being called here by the death of her cousin, Dr. David A. Christian, III."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "dale, Ala., is visiting her parents, Mr. and Mrs. Parks Jennings, after being called here by the death of her cousin, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "dale, Ala., is visiting her parents, Mr. and Mrs. Parks Jennings, after being called here by the death of her cousin, Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [708.94, 650.91, 1324.15, 753.58], "bbox_id": "ab9bf7f080", "file": "AppomattoxNewspapers_1955-1957a_0056.pdf", "page": 1, "text": "crease the total, he said. A number of individuals made contributions to the Memorial Fund at the time of the funeral of Dr. David A. Christian, Jr. While the present total is substantial, C. T.j Moses, Jr., Chairman of the fund raising committee, points out that a renewal of effort is necessary to reach the established goal. p P  patron-we want to eay"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "the funeral of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. While the present"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "the funeral of Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. While the present"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [649.42, 664.09, 818.72, 1059.04], "bbox_id": "c1a01dbce2", "file": "AppomattoxNewspapers_1955-1957a_0345.pdf", "page": 1, "text": "Christian Memorial Fund Proposals are A dopted The following proposals by the Board of Directors were unanimous ly adopted during a mass meeting of contributors Wednesday even ing, November 7 first That the Christian Me morial Funds be used for the col lege education of the children of the late David A. Christian, 1H. Second Should the Christian Memorial Fund for some reason not be used for the education of the children of David A. Christian, III, then it is recommended that the fund be made available as a loan fund to medical, dental, or nursing students who are citizens of Appo mattox County or adjoining coun ties. Third That the funds now on hand or that are later contributed be invested at the direction of the Board of Trustees in order that the funds might produce an income until such time that they are used as set forth in the first and second recommendation. Dr. G. G. OBrien, chairman of the Board of Directors, points out that an expression of the wishes of donors was necessary because of in adequacy of the funds collected for the original objective. Any donor, not concurring in the proposals.oi the Board of Directors as approved should call at the office of Dr. OBrien or W. C. Dudley, treasur-"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, 1H. Second Should the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, 1H. Second Should the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [715.7, 579.82, 883.68, 698.76], "bbox_id": "54ead5721a", "file": "AppomattoxNewspapers_1955-1957a_0032.pdf", "page": 1, "text": "CARD OF THANKS We widh to express our sincere appreciation to the good people of Appomattox and the surrounding area for all of their expressions of sympathy and of love and respect for our father, the late Dr. David A. Christian, Jr. You who were his people will always be our friends, too. His Children. ltc"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "father, the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. You who were"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "father, the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, Jr. You who were"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1409.32, 525.5, 1572.64, 727.94], "bbox_id": "9c67e3134d", "file": "AppomattoxNewspapers_1955-1957a_0070.pdf", "page": 1, "text": "By c. h. r. Editors Note The following eart-warming story vs found nong the papers of the late Dr A. Christian, Jr. It was wiStten , the late Dr. David A. Christian, I. He passed away before ne mpleted the story. However, the uman qualities, the sense of be- called to be a physician, and ,e wonderful spirit of fellowship stween beloved father and beloved n are revealed in the portions E the story he did write. Surely, ad the story been completed, it ould have made a valuable book, he Times-Virginian is indebted to membet of the Christian family r the privilege of presenting this anuscript to our readers."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "wiStten , the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, I. He passed away"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "wiStten , the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, I. He passed away"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1428.7, 1274.82, 1586.13, 1439.32], "bbox_id": "2cb09e33e4", "file": "AppomattoxNewspapers_1902-1905a_0277.pdf", "page": 1, "text": "Aubrey Browning became involved in a difficulty here Friday with Holcomb Woodson and during the fight Woodson was struck over the head with a stick which knocked him down he is still suffering from the effects of the blow, but was re ported to-day to be out of danger. Browning was arrested and bailed to-day by Commissioner David A. Christian in the sum of 500 with J. R. Horsely and R. F. Burke as surety for his appearance at the next term of the court."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "bailed to-day by Commissioner <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> in the sum of"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "bailed to-day by Commissioner <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> in the sum of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2069.73, 626.52, 2240.1, 1054.86], "bbox_id": "993ce48c46", "file": "AppomattoxNewspapers_1955-1957a_0304.pdf", "page": 1, "text": "At a meeting of the Board of Di rectors and Advisors of the Christian Memorial Fund, it was recommend ed that a meeting be called of all those who contributed to the fund and all other i nterested persons. This meeting has been scheduled for Wednesday, Nov. 7, 1956, at 730 P. M., The meeting will be held in the Court House at Appo mattox. The purpose of the meeting is to consider ways and means of manag ing the funds now on hand and oth er funds that may be contributed. The following proposals are re commended First That the Christian Memor ial Funds be used for the education of the children of the late David A. Christian, IH. Second Should the Christian Me morial Fund for some reason not be used for the education of the chil dren of David A. Christian, III, then it is recommended that the fund be made avaialble as a loan fund to medical, dental, or nursing students who are citizens of Appomattox County or adjoining counties. Third That the funds now on hand or that are later contributed be invested at the direction of the Board of Directors in order that the funds might produce an income un til such time that they are used as set forth in the first and second re commendations. All interested persons are urged to attend and bring their friends t this call meeting on Nov. 7, 1956, at 730 P. M., -g Appomattox Court House."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, IH. Second Should the"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "children of the late <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, IH. Second Should the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1571.32, 1529.89, 1741.89, 1668.74], "bbox_id": "bf904f6734", "file": "AppomattoxNewspapers_1952-1954a_0355.pdf", "page": 1, "text": "At a called meeting of the Appo mattox town council last night, C. F. James was appointed to serve the two-year term as mayor begin ning now. G. B. Buchanan had been elected to this office by the voters in June, but did not qualify, having instead been appointed to serve out  an unexpired term as county treas urer. David A. Christian, III, was appointed to the vacancy on the council created by the appointment of James as mayor. C. T. Moses, Jr. was appointed council president."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "as county treas urer. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, was appointed to"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "as county treas urer. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, was appointed to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.48, 520.37, 2367.33, 650.37], "bbox_id": "0ba4db04fc", "file": "AppomattoxNewspapers_1954-1955a_0290.pdf", "page": 1, "text": "Arrangements were virtually complete today for the Appomattox Cir cuit Court to meet its Friday date for trial resulting from the widely- publicized shooting spree at Evergreen on the night of February 26, when two men fell dead and the countryside was thrown into panic from as yet unexplained motives. A jury has been summoned from Cumberland County to hear the case of Commonwealth vs Frank Mayberry. Mayberry, 48, is accused of shooting to death his brother-in-law, Jack Tucker, and then shooting Dr. David A. Christian, III, popualr young Appomattox physician, who had gone to the Evergreen home on an errand of mercy. The case"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "and then shooting Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, popualr young Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "and then shooting Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, popualr young Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.41, 1507.53, 1895.33, 1741.67], "bbox_id": "c3865a32d2", "file": "AppomattoxNewspapers_1955-1957a_0332.pdf", "page": 1, "text": "An oil portrait of the late Dr. David A. Christian, III, will be un veiled in the Appomattox County Court House at 200 P. M., Friday, November 23. The following tribute to the late physician was written by a friend Future generations, who could not have known him, will gaze upon this portrait and ask this question Who was this young man? The most complete answer possible to that question is and will foe, He was a Christian. A Christian in name long dear to the citizens of this community the fourth generation of these Christian public servants consisting of three physicians and a judge. A large volume could be written about the tireless, generous and compassionate public services ren dered by each of these four men"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, will be un"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III, will be un"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [388.78, 596.31, 557.96, 844.35], "bbox_id": "36e6e888a8", "file": "AppomattoxNewspapers_1954-1955a_0272.pdf", "page": 1, "text": "Americans have lavished honors, medals, citations, ribbons, pensions, and many other honors and titles upon the herios of WAR. We have neglected the heroes of PEACE. Currently, there is discussion of how the nation might honor Dr. Salk, for his contribution to the de feat of paralysis from polio. He merits something more than a stack of editorials. In Appomattox, a worthwhile movement is under way to build a memorial to the late Dr. David A. Christian, III. The Times-Virginian does not be lieve in the democracy of establish ing in America of titles such as Sir. Lord, Duke, Count and Baron. But we do believe in suitable honors for the HEROES OF PEACE who have contributed to the GOOD of man kind. This concept should be ad vanced."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "to the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. The Times-Virginian does"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "to the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. The Times-Virginian does"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [408.93, 1001.7, 578.97, 1183.54], "bbox_id": "31d587d171", "file": "AppomattoxNewspapers_1954-1955a_0244.pdf", "page": 1, "text": "ADMINISTRATORS NOTICE This is to serve notice that I have qualified as Administrator of the estate of the late Dr. David A. Christian, III. Anyone having claims against this estate, kindly present statement of same at once. To those indebted to this estate, take notice that the office of the late Dr. Chris- ian has been closed, and all accounts are payable to the undersigned at The Farmers National Bank, Appo mattox, Va. Prompt settlement will be appreciated. T. DeWitt Evans, Administrator, Estate of Dr. David A. Christian, ni. 3-24-4tc"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, III. Anyone having claims"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [411.85, 1613.14, 577.49, 1796.44], "bbox_id": "d8084fbb06", "file": "AppomattoxNewspapers_1954-1955a_0252.pdf", "page": 1, "text": "ADMINISTRATORS NOTICE This is to serve notice that I have qualified as Administrator of the estate of the late D David A. Christian, IH. Anyone W ing claims against this estate, kindly present statement of same at once. To those indebted to this estate, take notice that the office of the late Dr. Chris- ian has been closed, and all accounts are payable to the undersigned at The Farmers National Bank, Appo mattox, Va. Prompt settlement will be appreciated. T. DeWitt Evans, Administrator, Estate of P r- David A. Christian, HI. t-4-4te"}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "of the late D <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, IH. Anyone W ing"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "of the late D <mark>David</mark> <mark>A</mark>. <mark>Christian</mark>, IH. Anyone W ing"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1542.44, 672.18, 1710.89, 811.78], "bbox_id": "1fcb10f4bc", "file": "AppomattoxNewspapers_1954-1955a_0228.pdf", "page": 1, "text": "A meeting was held herq Monday night at the school auditorium to consider ways and means of meet ing a two-fold goal to secure addi tional medical services in the coun ty, and to perpetuate a memorial to the late Dr. David A. Christian III. Well over 100 attended the meet ing and visiting medical authorities were present to lend counsel. A number of committees were appointed to further the two-fold projects."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "to the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III. Well over 100"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "to the late Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III. Well over 100"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.55, 1751.69, 1860.35, 1831.99], "bbox_id": "392356c828", "file": "AppomattoxNewspapers_1954-1955a_0396.pdf", "page": 1, "text": "A group from here went to Gret na yesterday to visit the new medi cal center building there, to get in formation helpful in shaping plans for the proposed Dr. David A. Christian III Memorial Building here. A fund-raising effort is still in progress here for the building."}, "highlight": {"text": {"matched_tokens": ["David", "A", "Christian"], "snippet": "for the proposed Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Memorial Building here."}}, "highlights": [{"field": "text", "matched_tokens": ["David", "A", "Christian"], "snippet": "for the proposed Dr. <mark>David</mark> <mark>A</mark>. <mark>Christian</mark> III Memorial Building here."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [347.04, 467.72, 507.5, 681.51], "bbox_id": "49e0e79691", "file": "AppomattoxNewspapers_1908-1909a_0534.pdf", "page": 1, "text": "Mrs- R. W. Nowlin, R. W. Nowlin, Jr., and Frank Robert son, of Greensboro, N. C., will spent Sunday in the home of Mr. J, H. Robertson. __ Mr. and Mrs Wî D. Marsh all, of Roanoke, and Mr. and Mrs. E. M. Schaubach and son, Eddie, Jr., of Crewe, were week-end guests of Mr, and Mrs. R. E. Caldwell, Sr. .They also attended the home com ing at Liberty Baptist church. Two little boys celebrated their birthdays at Sunday School. David Christian h a s reached the age of eight and Walton Jamerson follows with the age of five years."}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "a"], "snippet": "birthdays at Sunday School. <mark>David</mark> <mark>Christian</mark> h <mark>a</mark> s reached the age"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "a"], "snippet": "birthdays at Sunday School. <mark>David</mark> <mark>Christian</mark> h <mark>a</mark> s reached the age"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [185.51, 620.6, 507.95, 768.69], "bbox_id": "ab9a55cf79", "file": "AppomattoxNewspapers_1926-1933a_0534.pdf", "page": 1, "text": "ing at Liberty Baptist church. T w o little boys celebrated their birthdays at Sunday School. David Christian h a s reached the age of eight and Walton Jamerson follows with Miss Florence Caldwell  the age of five years, spent the week-end with her Misg Grace Caldwell and H. to sister, Miss Anne Cialdwell.  g Marshall will motor Mrs. White, of Lynchburg,1 Crewe t0 visit the fomerissis- visited her mother, Mrs. L. E- ter, Mrs. E. Smith, Sunday."}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "a"], "snippet": "birthdays at Sunday School. <mark>David</mark> <mark>Christian</mark> h <mark>a</mark> s reached the age"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "a"], "snippet": "birthdays at Sunday School. <mark>David</mark> <mark>Christian</mark> h <mark>a</mark> s reached the age"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1798.58, 1155.89, 1966.8, 1304.39], "bbox_id": "4c7a5f5c0f", "file": "AppomattoxNewspapers_1947-1949a_0456.pdf", "page": 1, "text": "The following solicitors have been announced for the Cancer Drive Mrs. Calhoun Moore, Mrs. LeRoy Smith, Mrs. Jessie Carwile, Mrs. Garland Holt, Mrs. W. A. Coleman, Mrs. A. R. Harwood, Jr. W. S. Jones, Mrs. C. T. Moses, Jr. Mrs. Ivey Holland, Miss Beulah Ferrell, Mrs. Ned Hancock,Mrs. R. W. Stan ley, Mrs. C. D, Staples, Mrs. J. T. Irby, Mrs R A. Glenn, Mrs. David Christian, III Mrs. David Caldwell, Jr., Mrs. L. W. Garrett, Mrs."}, "highlight": {"text": {"matched_tokens": ["A", "David", "Christian", "David"], "snippet": "T. Irby, Mrs R <mark>A</mark>. Glenn, Mrs. <mark>David</mark> <mark>Christian</mark>, III Mrs. <mark>David</mark> Caldwell,"}}, "highlights": [{"field": "text", "matched_tokens": ["A", "David", "Christian", "David"], "snippet": "T. Irby, Mrs R <mark>A</mark>. Glenn, Mrs. <mark>David</mark> <mark>Christian</mark>, III Mrs. <mark>David</mark> Caldwell,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [842.65, 454.41, 1009.37, 545.43], "bbox_id": "f2e2211d07", "file": "AppomattoxNewspapers_1943-1947a_0108.pdf", "page": 1, "text": "D E A T H O F IN F A N T David Christian, the four month old child of Mr. and Mrs. Bascom Powell, died early Tuesday morn ing and- was buried 1st Central Church Wednesday afternoon. Fu- eral services -were conducted by Rev. H .F Jones. Besides his par ents, he is survived by one broth er and one sister."}, "highlight": {"text": {"matched_tokens": ["A", "David", "Christian"], "snippet": "O F IN F <mark>A</mark> N T <mark>David</mark> <mark>Christian</mark>, the four month old"}}, "highlights": [{"field": "text", "matched_tokens": ["A", "David", "Christian"], "snippet": "O F IN F <mark>A</mark> N T <mark>David</mark> <mark>Christian</mark>, the four month old"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1422.71, 371.5, 1601.17, 1184.56], "bbox_id": "272389db34", "file": "AppomattoxNewspapers_1926-1933a_0539.pdf", "page": 1, "text": "M The tobacco crop is quite this county. Umising  rhe cannery is not running this year. No sumac warehouse is being  Srperated here this year. Miss Annie Hancock is visit- ig in Rice, , V a- Rain is much needed in this section. The B. Y- P. U. of Liberty Church had a lawn party Tues day evening and cleared 8. Mr and Mrs. O. R. Tumes and family. motored to Rich m ond Tuesday. Mrs. JY. H. 3- Barlow a n d in, P h, were visitors in ampMTuesday. A series A revival , meetings isjiave just been completed at Spout Springs Baptist Church. Miss Jesselyn Hancock is back at work after having been sick for a few days. Little David Christian who has been very ill with blood poison, is now better. Alfred Harwood, Jr-, is sick in bed. His condition is not serious. Lowell Ayers of Richmond, Va., visited John Curtis Cald well this week-end. Mr. Baxter Marshall was taken to Stauntonhospital last week for treatment. - More wheat is being shipped from Appomattox than for twenty years. These piping hot days o u r ice factory is quite indespensa- ble- The Sunbeams had a good meeting at the home of Caro tin Smith Tuesday afternoon. Edith and Joyce Cole a r e visiting their uncle in Bucking ham. . Little Edna Stanley, of Vir ginia Beach, is visiting her cousin, Miss Catherine Burge. Miss Edith Anderson of Dan ville is visiting her aunt, Mrs. W. P- Coleman. Mr. W. H. S. Barlow has re turned to West Virginia after a visut to his family here. Mr. and Mrs. S. L- Ferguson Jr., were recent visitors to the sea shore. Misses Evelyn and Christine Robertson spent two days with friends in Lynchburg last week. Miss Anna Cosby, of Rich"}, "highlight": {"text": {"matched_tokens": ["a", "David", "Christian"], "snippet": "having been sick for <mark>a</mark> few days. Little <mark>David</mark> <mark>Christian</mark> who has been very"}}, "highlights": [{"field": "text", "matched_tokens": ["a", "David", "Christian"], "snippet": "having been sick for <mark>a</mark> few days. Little <mark>David</mark> <mark>Christian</mark> who has been very"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.67, 591.55, 1594.72, 1419.01], "bbox_id": "0bdfa483ec", "file": "AppomattoxNewspapers_1908-1909a_0539.pdf", "page": 1, "text": "amphifej?Tuesday. A series A revival-meetings have just been completed at Spout-Springs Baptist Church. Miss Jesselyn Hancock is back atwork after having been . sick for a few days. Little David Christian who has been-very ill with blood poison, is now better. Alfred Harwood, Jr-, is sick fat bed. His condition is hot serious. Lowell Ayers of Richmond, Va., visited John Curtis Cald well this week-end. Mr. Baxter Marshall was taken to Stauntounospital last week for treatment.  More wheat is being shipped . from Appomattox than for twenty years. These piping hot days o u r ice factory is quite indespensa- ble. v .. jpv,. Y . - -A .  - The Sunbeams had a good meeting at the home of Cdro- lih Smith Tuesday afternoon.  Edith and Joyce Cole A r e  visiting their uncle in Bucking- ham. - Y-- ? Little Edna Stanley, of Vir ginia Beach, is . visiting, her Rcousin, Miss CatherineBurge. Miss Edith Anderson of Dan ville 1 b visiting her aunt, Mrs. W. P Coleman. Y - V n Mr. W. H. S. Barlow has re turned to West Virginia after a viedt to his family here.  Mr. and Mrs. S. L- Ferguson Jr., were recent yisitora to tlu sea shorn. .... -Misses Evelyn and Christine Robertson spent two days with  friends in Lynchburg last week.  Miss Alina CosBy, of YRich- , mond, is visiting Miss Catherine Gills.  -Jean Phillips, of Richmond, . Va., visited in the home of A- RPHarwood this week-end. . Mr. and Mrs. Mercho of Bal timore, Md., have been visit ing in the home of S. J Evans. Miss Blanche Babcock h a s been sick since Saturday but is. up now. g  Mrs. Lottie Bledsoe and Ruth Potts were visitors Jn Brookneal yesterday. Rev. Omqh Burnettwill be-  gin revival at .New Hope Sun day Morning.   .! v  Miss Virginia Minor, of Wil liamsburg, is visiting her aunt, Miss Ocie Jones, this week,"}, "highlight": {"text": {"matched_tokens": ["a", "David", "Christian"], "snippet": "having been . sick for <mark>a</mark> few days. Little <mark>David</mark> <mark>Christian</mark> who has been-very ill"}}, "highlights": [{"field": "text", "matched_tokens": ["a", "David", "Christian"], "snippet": "having been . sick for <mark>a</mark> few days. Little <mark>David</mark> <mark>Christian</mark> who has been-very ill"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1753.89, 755.7, 1923.1, 866.25], "bbox_id": "0e8aaa3da9", "file": "AppomattoxNewspapers_1943-1947a_0562.pdf", "page": 1, "text": "a .?ettiT,e of Chirstmas greens, white flowers, poinsettias and tall standards bearing lighted tapers, Miss Louise Montgomery Campbell, daughter of Dr. and Mrs. Glenn C. Campbell of Staunton was married to David Alexander Christian, III th? A- Chiistian and the late Mrs. Christian, of Appo mattox, at four oclock on Friday December 27, Rev. Dunbar H. Og den, Jr. performed the ceremony"}, "highlight": {"text": {"matched_tokens": ["David", "Christian", "A"], "snippet": "Staunton was married to <mark>David</mark> Alexander <mark>Christian</mark>, III th? <mark>A</mark>- Chiistian and the late"}}, "highlights": [{"field": "text", "matched_tokens": ["David", "Christian", "A"], "snippet": "Staunton was married to <mark>David</mark> Alexander <mark>Christian</mark>, III th? <mark>A</mark>- Chiistian and the late"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
