{"document": {"bbox": [297.36, 972.56, 442.17, 1128.95], "bbox_id": "3ae335b2a4", "file": "TimesVirginian_1981a_0011.pdf", "page": 1, "text": "Zane G. Snead of Logan, W. Va. two sisters, Mrs. N. H, Fortune of Virginia Beach and Mrs- J. T. McLain of Sarasota, Fla. slfc grandchildren, and five great-grandchildren, Gravesfde services were conducted Thursday at 11 a.m. in Spring Hill Cemetery by the Rev. V. Barrow Jr. The family has requested memorials be made-to Amherst Rescue Squad. Diuguid Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "made-to Amherst Rescue Squad. <mark>Diuguid</mark> Funeral Home was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "made-to Amherst Rescue Squad. <mark>Diuguid</mark> Funeral Home was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.24, 986.02, 1485.93, 1331.24], "bbox_id": "0cd1e6d14a", "file": "TimesVirginian_1980a_0220.pdf", "page": 1, "text": "y m  - -A lfred T.W U t Alfred Thomas Witt, 64, of 102 Twin Oak Drive, LynohbUrg, died Wednesday June 25, in Lynchburg General Hospital. Born in Bedford County, he was a son of Heriry Thomas and Sofie Ash well Witt. He was a retired supervisor for the U.S. Postal Service and was a member of Chestnut Hill United Methodist Church. He is survived by his wife, Hazel Gray Witt two sons, Larry T. Witt of Appomat tox and Robert  . Witt of Forest three daughters, Linda W. Nelson of Lynch burg, Mrs. Fay W. Brown of Nama and Mrs. Jane ,W. S Olsen of Lynchburg two sisters, Mrs. Abbie W. Baber of Hampton and Mrs. Emma W. Compton of Hurt, and 11 grandchildren. Funeral services were conducted at 2 p.m. Friday at Diuguid Memorial Chapel by the Revs. Norman S. Chattin, Richard Baber and Donald Seely. Burial was in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "2 p.m. Friday at <mark>Diuguid</mark> Memorial Chapel by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "2 p.m. Friday at <mark>Diuguid</mark> Memorial Chapel by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1357.4, 179.16, 1491.97, 885.38], "bbox_id": "ee69718bed", "file": "TimesVirginian_1980a_0376.pdf", "page": 1, "text": "y CA88IE BALDWIN Election Day was rainy. That has gone Labor Day, Halloween and Columbus Day all gene. So we look forward to the days growing shorter and Thanksgiving and Christmas coming. Helen Inge and Louise Roach attended the World Day of Prayer at Spout Spring Baptist Church on Monday. Phyliss Richardson and Ruby Almond attended the graveside service at Ever green for Malcolm Womack on Monday morning. The Friendship Circle met with Florence Ranson on Tuesday afternoon. Eleven were present. Mrs. Margaret Marshall entered Virginia Baptist Hospital on Tuesday after noon.  Mr. and Mrs. Mark Hipps went to Roanoke Tuesday night to get their son, Gregg who had been stationed in  Texas for sometime. He will be here for several weeks. Randy Hipps Qf Blacksburg will spend the weekend here. Mr. and Mrs. Leslie Webber Mr. and Mrs. James Daubenspeck were called to Lynchburg Sunday due to the death of Mrs. Mattie Webber at Lynch burg General Hospital. Funeral was held at Diuguid Funeral Home on Tuesday in Madison Heights. Henry Ray Webber was  pall bearer. Ida Ledbetter was Mrs. Mattie Webbers sister. Sympathy is extended to these families. Katherine Dickerson sp ent Wednesday night with Pearl Wilson who is back home after a stay in the hospital for a few days. A speedy recovery is wished her. Zane Hamlin was rushed to Lynchburg General Hos pital Thursday morning early and operated on. He was quite sick for awhile, but moved to a room on Friday. May he have a speedy recovery. Lloyd and Otis Richardson and Toby Inge went to see Zane Hamlin on Thursday"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Funeral was held at <mark>Diuguid</mark> Funeral Home on Tuesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Funeral was held at <mark>Diuguid</mark> Funeral Home on Tuesday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [311.31, 224.89, 484.59, 920.56], "bbox_id": "88f8528901", "file": "TimesVirginian_1983a_0076.pdf", "page": 1, "text": "Wirt Cabell Jr., and a daughter. Lisa Cabell, all of Lynchburg daughters Mrs. Liane Scheffler of Tulsa. Okla. and Kathleen Cabell, Sante Fe. New Mexico. He is also survived by three brothers, Paul Cabell. Overland Park, Kansas, Henry R. Cabell. Houston. Texas, and Clifton Cabell, Lake Charles. La., two sisters, Alice Cabell, New York City, and Mrs. Anne Giles, Lynchburg. A memorial service was held Saturday from Diuguid Rivermont Chapel. David Fatten Evans David Fulton Evans, 58, of Route, I, Concord, died Tuesday at Virginia Baptist Hospital. His wife is Pauline Holly Craghead Evans. Bora in Campbell County, he was the son of Florence Godsey Evans of Concord and the late William David Evans. He was a dairy farmer for 41 years, a graduate of Concord High School, president of the senior class and track team and a member of New Concord P re s b y te ria n Church. In addition to his wife and mother, he is survived by two aims, James D. Evans and William C. Evans and two daughters, Susan E. Wilburn and Esther E. Grubbs, all of Concord one brother, Robert S. Evans of Lynchburg two aunts, Edith E. Trice of Handenaville and Ada Lee Johnson of Lynchburg an uncle, William E. Godsey of Roanoke one niece. Lennie Raye Burnson of Houston, Texas, and seven grandchildren. A graveside service was conduct ed in New Concord Presbyterian Church cemetery by the Revs. Elwood Torrence andi W. Duke Johnson. Diuguid Rivermont Chapel was in charge of arrangements. Horace L. Huff APPOMATTOX - Horace Lafaye tte Huff, 64, of Route 2, died Sunday, March 13 at 915 p.m. at his residence. He was the husband of Shelby Newman Huff. Bora in Hillsville, he was a son of John Thomas Huff, Hillsville, and the late Mary Watson Huff. He was a member of Hillsville Christian Church and the Masonic Lodge 688 of Mariette, Ga., and was a veteran of World War n . He was a graduate of VPISU with a 6.8. in Mechanical Engineering and was a retired mechanical engine1 with the Bellwood Defense General"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "was held Saturday from <mark>Diuguid</mark> Rivermont Chapel. David Fatten"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "was held Saturday from <mark>Diuguid</mark> Rivermont Chapel. David Fatten"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [269.49, 284.09, 413.01, 482.74], "bbox_id": "b5049b09b4", "file": "AppomattoxNewspapers_1962-1965a_0236.pdf", "page": 1, "text": "WILLIAM R. LEE  William Robert Lee, 42, died Friday at 645 p.m. at his home after a long illness. Bom in Appomattox County, he was the son of Mrs. Virginia Sandidge Lee, of Lynchburg, and the late Norman B. Lee. For 11 years he was plant manager for Pooles Ellersie Dairy Inc., in Petersburg. A member of First Baptist Church and the Ameri can Legion, he was a veteran of World War II. - In addition to his mother, he is survived by his daughter. Bar bara Jean Lee, of Lynchburg. A funeral service was held Monday at 2 p.m. in Diuguid Memorial Chapel with burial in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "at 2 p.m. in <mark>Diuguid</mark> Memorial Chapel with burial"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "at 2 p.m. in <mark>Diuguid</mark> Memorial Chapel with burial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [407.71, 322.18, 538.5, 606.97], "bbox_id": "3d86d0f0e0", "file": "TimesVirginian_1980a_0423.pdf", "page": 1, "text": "William Letcher Edwards William Letcher Edwards 88 , of 1244 Krise Circle, died Sunday morning in Camelot Nursing Home. He was the husband of the late Laura McCollum Edwards. Born in Henry Coifnty, hf? was son of James William Edwards and Ora Mitchell Edwards. He was a member of the First Christian Church, Eden, N.C. He is survived ,by one son, Robert L. Edwards of Lynchburg one daughter, Mrs. Rebecca Moore of Appomattox one sister, Mrs. Ella Robertson of E den,. N.C.-, and five grandchildren. -  Graveside services were conducted Tuesday .at 11 a.m. in the Overlook Cemtery, Eden, N.C. Diuguid Funeral Home was in charge of arrange ments."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Overlook Cemtery, Eden, N.C. <mark>Diuguid</mark> Funeral Home was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Overlook Cemtery, Eden, N.C. <mark>Diuguid</mark> Funeral Home was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1351.82, 209.29, 1503.61, 552.92], "bbox_id": "5f554f4eaf", "file": "TimesVirginian_1976_0090.pdf", "page": 1, "text": "William Diuguid Pattest Sr., 94 of Rt. 3, Appomattox, died at 3 a.m. Wednesday, March 3,1976 at his residence. He was the husband of Mrs. Edna Beale Patteson. Born in .Appomattox County, he was the son of John Hunt Patteson and Bety Nowlin Pat- iftoson. He was a member of Mt. Comfort United M ethodist Church and a retired farmer. In additimi to his wife, he is survived by five sons, Robert B. Pattest and Charles C. Pat teson, both of Lynchburg, W. Diuguid Patteson Jr. and Ed L. Patteson, both of Chatham, and Tpmmy C. Patteson of Appo- mattox three daughters, Mrs. 43etty P. Clark and Mrs. Bdrbiira P. Reynolds, both of . Lynchburg, and Mrs. Lucy P. Cyrus of Charlottesville 19 grandchildren, and five great- r grandchildren. J Funeral services were con ducted Friday at 130 p.m. from , Robinson Funeral Home by the Ejev. L. A. Lawrence. Burial Was in the Patteson family cem- Jery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "William <mark>Diuguid</mark> Pattest Sr., 94 of"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "William <mark>Diuguid</mark> Pattest Sr., 94 of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [867.34, 197.08, 1010.56, 405.82], "bbox_id": "c2bf52b0c9", "file": "AppomattoxNewspapers_1974-1975a_0401.pdf", "page": 1, "text": "William Alexander Cker- nault. 87, of 1703 Union St., Lynchburg, died Monday in Lynchburg General Hospital. Born in Appomattox County, he was the son of the late William Wesley Chernault and Nannie Marsh Chernault. He was retired and a veteran of World War I. He was a member of Sandusky Baptist Church, j where he served as a deacon. His wife was the late Etta Flood Coleman Chernault. Funeral services were con ducted at Diuguid Memorial Chapel Wednesday at 2 p.m. by the Rev. Ralph Jackson, with interment in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "were con ducted at <mark>Diuguid</mark> Memorial Chapel Wednesday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "were con ducted at <mark>Diuguid</mark> Memorial Chapel Wednesday at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [418.29, 739.27, 555.65, 760.27], "bbox_id": "43e37df1e3", "file": "AppomattoxNewspapers_1974-1975a_0303.pdf", "page": 1, "text": "Whatever happened to Bur- grub Diuguid?______________"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Whatever happened to Bur- grub <mark>Diuguid</mark>?______________"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Whatever happened to Bur- grub <mark>Diuguid</mark>?______________"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [394.55, 274.38, 564.8, 1425.57], "bbox_id": "ee3518863a", "file": "AppomattoxNewspapers_1892-1898a_0242.pdf", "page": 1, "text": "We did not, in last weeks issue, give our readers an account of the occurrences at the Spout Spring recinct on election day, because we did not know, when we went to press, the true facts in the case and preferred to say nothing on the sub ject until we were fully informed thereon. We have heard the statements of the three judges and constable, F. Martin, all of which we give as well as the general facts we have gleaned that our readers may draw their own conclusions. The election at this precinct be gan in a quiet and orderly manne with Messrs. Lantech Jones, It. G Whorley and G. W. Diuguid as udges, Mr. F. L. Martin as consta bleand Messrs. F. B. Jones and John Overton as clerks. After nine votes had been regularly polled, negro named Henry Hughes weut into the booth to get Constable Mar tin to fix his ticket. Mr. Martin told him he would assist him by pointing ont the names to him. Thi Mr. Martin d id and poiu ted c u tTren tl name and Floods name both of which he scratched and then pointed out Smiths name which he scratche when the negro stopped and said You have scratched Mr. Colli us name, the very man 1 wanted vote for. The constable replied, You are a d ----- -n liar  if you dont like that ticket get anothe one and fix it to suit yourself. The negro then folded the ticket up and without makiug the slightest com plaint voted it. He weut out and iu about ten minutes Mr. E. F. Col tinswent into the election room and demanded the removal of the con stable, on the ground that he was not treating him fairly. The judges refused to make the removal. After short interval Collins, D. V McKinney and Hughes went int the room and behind them on the porch and on the ground was crowd of between twenty and thirty McKinney in a very excited way de maiided the removal of the consta ble and threatened blood-shed if he was not removed. The judges again refused to remove him, when Me Kinney and his backers grew mor violent. Mr. Diuguid, the liepuii can judge,was m favor of the rernov aud finally Mr. Whorley, because he thought otherwise that violence would be done the constable, advis ed him to leave. This the consta ble refused to do. But Mr. Whor- ieys suggestion to Martin, that lit leave, being construed iuto his con sent to his removal he was hustled out anti a Populist constable putin. At the time of this occurrence there was but one Democrat ou the grounds, besides the election officers. Mr. Martin was not a.new consta ble, but the same one who acted at the same place last Fall and one Whtr gave satisfaction tw-all parties, as is shown by the depositions of Dr. D. Mott Robertson and Mr. E. F. Collins, both of whom testified iu the Yost-Tucker contest, to his fairness and honesty. Here is what the officers of elec tion say about the occurrence. Mr, Lamech Jones appended to the certificate on the poll books the following statement Mr. K. G. Whorley also signed this statement, but later scratched his name off as he was one of the Commissioners of Election. The statement is as follows  As Judges of Election at Spout Spring, at the election held for officers, May 23d, 1895, we wish to make a statement as to the removal of Fitz Lee Martin, the regularly appointed constable."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Whorley and G. W. <mark>Diuguid</mark> as udges, Mr. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Whorley and G. W. <mark>Diuguid</mark> as udges, Mr. F."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.06, 806.77, 1835.94, 854.52], "bbox_id": "89d125c408", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "We are informed that Mr. and Mrs. W. D. Pattesson have been notified -.hat Pvt. William Diuguid Patterson is reported mining in action on the Western Front."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "We are informed that Mr. and Mrs. W. D. Pattesson have been notified -.hat Pvt. William <mark>Diuguid</mark> Patterson is reported mining in action on the Western Front."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "We are informed that Mr. and Mrs. W. D. Pattesson have been notified -.hat Pvt. William <mark>Diuguid</mark> Patterson is reported mining in action on the Western Front."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2187.88, 299.77, 2359.33, 383.46], "bbox_id": "0772bafc34", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "W. Diuguid Christian, 43, died at Medical College Hospital, Richmond Thursday morning. He was born in Appomattox County, son of Mrs. David A. Christian and the late Judge Christian. Funeral services will be conducted Friday afternoon at 330, from the Christian family cemetery near Vera."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "W. <mark>Diuguid</mark> Christian, 43, died at"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "W. <mark>Diuguid</mark> Christian, 43, died at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2198.69, 284.66, 2325.79, 294.66], "bbox_id": "0d893f65fe", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "W. DIUGUID CHRISTIAN"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. <mark>DIUGUID</mark> CHRISTIAN"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. <mark>DIUGUID</mark> CHRISTIAN"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2395.19, 1122.65, 2556.35, 1190.4], "bbox_id": "f67a579244", "file": "AppomattoxNewspapers_1922-1923a_0596.pdf", "page": 1, "text": "W. D. DIUGUID Successor to Geo, A. TDluyuid  Son. L IC E N SE D B M B A L M E R  ---- AND ---- , F U N E R A L D IR E C T O R LYNCHBURG. VA.  j"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> Successor to Geo, A."}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> Successor to Geo, A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2273.77, 540.53, 2406.6, 580.9], "bbox_id": "c2dc6f3007", "file": "AppomattoxNewspapers_1908-1909a_0508.pdf", "page": 1, "text": "W. D. DIUGUID INOORPOBAT 1 D funeral directors"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INOORPOBAT 1 D funeral directors"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INOORPOBAT 1 D funeral directors"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1875.1, 1110.12, 2011.1, 1206.18], "bbox_id": "d0eb2023b3", "file": "AppomattoxNewspapers_1908-1909a_0511.pdf", "page": 1, "text": "W. D. DIUGUID INCORPORATED funeral directors Special Service Rendered To Appomattox people when x in need of our services ,H O lH 111-S38 LYNCHBURG, V A . AMBULANCE SERVICE"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED funeral directors Special Service Rendered To Appomattox people when x in need of our services ,H O lH 111-S38 LYNCHBURG, V A . AMBULANCE SERVICE"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED funeral directors Special Service Rendered To Appomattox people when x in need of our services ,H O lH 111-S38 LYNCHBURG, V A . AMBULANCE SERVICE"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2432.15, 386.96, 2565.46, 426.7], "bbox_id": "1e644545f7", "file": "AppomattoxNewspapers_1926-1933a_0542.pdf", "page": 1, "text": "W. D. DIUGUID INCORPORATED FUNERAL DIRECTORS"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED FUNERAL DIRECTORS"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED FUNERAL DIRECTORS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2282.4, 557.98, 2414.98, 598.3], "bbox_id": "678c50c476", "file": "AppomattoxNewspapers_1926-1933a_0508.pdf", "page": 1, "text": "W. D. DIUGUID INCORPORATED FUNERAL DIRECTORS"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED FUNERAL DIRECTORS"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCORPORATED FUNERAL DIRECTORS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [547.69, 1348.42, 681.14, 1443.25], "bbox_id": "a804613138", "file": "AppomattoxNewspapers_1908-1909a_0506.pdf", "page": 1, "text": "W. D. DIUGUID INCOKPOKATSD FUNERAL DIRECTORS Special Service Rendered To Appomattox people when in need of our services lil ies LYNCHFITTHO, VA AMBULANCE SERVICE"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCOKPOKATSD FUNERAL DIRECTORS Special Service Rendered To Appomattox people when in need of our services lil ies LYNCHFITTHO, VA AMBULANCE SERVICE"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark> INCOKPOKATSD FUNERAL DIRECTORS Special Service Rendered To Appomattox people when in need of our services lil ies LYNCHFITTHO, VA AMBULANCE SERVICE"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1150.8, 350.45, 1280.77, 367.45], "bbox_id": "b080ff69e6", "file": "AppomattoxNewspapers_1926-1933a_0540.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1158.95, 236.92, 1288.42, 252.92], "bbox_id": "e733fc6677", "file": "AppomattoxNewspapers_1926-1933a_0537.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [209.5, 1654.39, 340.03, 1671.39], "bbox_id": "288ea56cf8", "file": "AppomattoxNewspapers_1926-1933a_0531.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [398.92, 1476.52, 529.65, 1493.52], "bbox_id": "80a21da780", "file": "AppomattoxNewspapers_1926-1933a_0527.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.26, 1156.52, 1984.78, 1174.52], "bbox_id": "e1aff69f11", "file": "AppomattoxNewspapers_1926-1933a_0513.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1878.95, 1135.44, 2008.9, 1152.44], "bbox_id": "8079adc1ca", "file": "AppomattoxNewspapers_1926-1933a_0511.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [555.37, 1370.01, 684.72, 1387.01], "bbox_id": "8f1fc49511", "file": "AppomattoxNewspapers_1926-1933a_0506.pdf", "page": 1, "text": "W. D. DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W. D. <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [395.31, 1452.3, 527.96, 1469.3], "bbox_id": "ae4c767bb1", "file": "AppomattoxNewspapers_1908-1909a_0527.pdf", "page": 1, "text": "W. D. DIUGÜID"}, "highlight": {"text": {"matched_tokens": ["DIUGÜID"], "snippet": "W. D. <mark>DIUGÜID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGÜID"], "snippet": "W. D. <mark>DIUGÜID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [946.12, 527.7, 1140.4, 987.48], "bbox_id": "08b653a89a", "file": "TimesVirginian_1984a_0022.pdf", "page": 1, "text": "W akr DeWItt Carwfle W altr DeWitt Carwfle, 69, of Route 2, Rustburg, died Wtotoioaday to Vksfoia Baptist HoepitaL He was born to Charlotte County, a son of the late W alter Rice Carwfle and Sallie Hendrick Carwfle. He was a retired former-and a veteran of World W ar 1, where he served to the Army. He was a member of Mt. Zion United Methodist Church abor Gladys for 70 years, and taught Sunday School for about 80 yoafo. He sold produce fm- tnore than 60 years on the City Maiket in Lyndiburg- - H e is arrived by Us w ife, Mae . Finch Carwfle two sons, Walter DeW itt Cartoflo, Jr., ThaxUm, and  Henry Oliver Carwfle, Rustburg one htgnter, Mrs, Louise C. Hancock, Rbstburg two brothers, Ray D. Carwfle amiClaude W. Carwfle, both of Lynchburg one sister, Mrs. Dorothy C. W ilkerson, Lynchburg four grandchildren, Mrs! Wendell Johnson, Thaxton, Mrs. David Causer, Franklin, Train., Mrs! Daniel Robinson, Roanoke, mid James H. Hancock, Ht, Rustburg three great-grandchildren, Heather Alicia Johnson, Danielle Nicole Causer, add Charif Annette Robinson. Funeral services were conducted from Mt. Zion United Methodist Church Friday at 2 p.m. fay the Revs. Gene Condrey, Douglas Gibson and Floyd Wingfield. Interment was in Chapel Baptist Church cemetery. Diuguid Rivermont Chapel was to charge of arrangements. Rnby Childress Glam Ruby Childress Glass, 71, of Route 1, Gladys, died Thursday, Jan. l9M964, to Lynchburgpeneral Homutai."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Chapel Baptist Church cemetery. <mark>Diuguid</mark> Rivermont Chapel was to"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Chapel Baptist Church cemetery. <mark>Diuguid</mark> Rivermont Chapel was to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1182.71, 1275.22, 1309.26, 1288.22], "bbox_id": "51de4da6fc", "file": "AppomattoxNewspapers_1922-1923a_0479.pdf", "page": 1, "text": "W . D . DIUGUID"}, "highlight": {"text": {"matched_tokens": ["DIUGUID"], "snippet": "W . D . <mark>DIUGUID</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["DIUGUID"], "snippet": "W . D . <mark>DIUGUID</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1178.65, 303.5, 1365.24, 793.78], "bbox_id": "16929d44e4", "file": "AppomattoxNewspapers_1960-1962b_0072.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomat tox Qouinty. Wade Ferguson, Appomattox, Vir ginia, vs.  Charles H. Diuguid, et als. Tio Oharles H. Diuguid, if living, and if not, to the widow and heirs, devisees and successors in title of Chailes H. Diuguid, Parties Un known. Frances Isbell, Alice Bow man, Marcia Isbell, John Diuguid, David Diuguid, James Diuguid1, Hen ry Diuguid, George Diuguid, Rich ard Diuguid, if he be living, and if any or all of the immeditely here tofore named persons be dead, then to their respective widows and wid owers and heirs, devisees and suc cessors in title, Defendants by the general description of Parties Un known. , You are hereby notified that a tract or lot of land standing on the Commissioners books in Clover Hill District, County of Appomat tox, Virginia, as follows  Diuguid, Charles - Appomattox, Nr. Old C. H. ZV 2 . acres was solid for delinquent taxes, levies inter est and cost to the Commonwealth of Virginia for 1951 taxes on Mar. 215, 1954 on Dec. 13, 1954, for 1952 taxes on Deo. 12, 19551, for 1953 taxes on Dec. 10 - 56 for 1954 tax es on Dec. 9, 1957 for 1955 tax- est and on Dec. 8 , T958 for 1956 taxes, and application for the pur chase thereof has been filed in this office. And it appears from the re cords in this office that you are in terested in said land, you are fur ther notified to appear in four months from the date of this no tice and do what may be neecssary, to protect your interests."}, "highlight": {"text": {"matched_tokens": ["Diuguid", "Diuguid", "Diuguid"], "snippet": "Isbell, John Diuguid, David <mark>Diuguid</mark>, James <mark>Diuguid</mark>1, Hen ry <mark>Diuguid</mark>, George"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid", "Diuguid", "Diuguid"], "snippet": "Isbell, John Diuguid, David <mark>Diuguid</mark>, James <mark>Diuguid</mark>1, Hen ry <mark>Diuguid</mark>, George"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [290.89, 985.5, 432.71, 1060.1], "bbox_id": "93b66b00ed", "file": "TimesVirginian_1976_0240.pdf", "page": 1, "text": "V o p d J  i f j H . ufg aflntw d sisters, Airs. Wyatt B. Woody of Lynchburg and Mrs. Elizabeth W. Wright of Madison Heights. Diuguid Memorial Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Wright of Madison Heights. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Wright of Madison Heights. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.82, 212.86, 1754.83, 638.79], "bbox_id": "423befe51d", "file": "TimesVirginian_1980a_0257.pdf", "page": 1, "text": "unty, widow of Hubert W. Hickman,- she retired from Schewel Furniture Company and was a member of Chestnut Hill Baptist Ch urch. - She is survived by a number of nieces and nephews. Graveside services were conducted at 3 p.rh. Thurs day in Spring Hill Cemetery by the Rev. Paul Blevins. Diuguid Funeral Service was in charge of arrange ments. Mrs. Minor H. Marks Mrs. Carmen Hendrick Marks of 4223 Almora Ave., Richmond, died Thursday morning in fC mond hospital. .Born in Campbell County, she was a daughter of the late Joseph Hendrick and Lucille Ware Hendrick. She is survived by her husband, Minor Hughes Marks a daughter, Mrs.. Florence M. Martin of Richmond a son, Minor H. Marks Jr. of Key West, Fla. a grandson, Robert Minor Mkrtin two brothers, Jo Hendrick and Johnny Hn- drick, both of Lynchburg two sisters, Mrs. Frances Dodson of Lynchburg and Mrs. Mildred Carey of Raleigh, N.C, a half-bro-. ther, Wyatt Hendrick of North Carolina and two"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "the Rev. Paul Blevins. <mark>Diuguid</mark> Funeral Service was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "the Rev. Paul Blevins. <mark>Diuguid</mark> Funeral Service was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1511.22, 1114.64, 1672.81, 1184.14], "bbox_id": "1830dbe778", "file": "AppomattoxNewspapers_1902-1905a_0130.pdf", "page": 1, "text": "Two more rural routes from Con cord are to be opened on July 15 one to Karl, the other to Diuguid. It is now understood-that Mr. R. W. Str.ftton will carry the mail on the Karl route."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Karl, the other to <mark>Diuguid</mark>. It is now understood-that"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Karl, the other to <mark>Diuguid</mark>. It is now understood-that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [792.49, 1015.72, 918.02, 1130.37], "bbox_id": "e5a7b90e25", "file": "AppomattoxNewspapers_1939-1943a_0470.pdf", "page": 1, "text": "Top Left, reading down Clara Whitney Moses Elmira McCormick Aubrey McFadden Laura Mae Nunley Betty Patterson Top Right, reading down Blanche McConchiè Ida Virginia McÇormick Laura Louise McFadden Charlie Page Diuguid Patterson, Jr."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Louise McFadden Charlie Page <mark>Diuguid</mark> Patterson, Jr."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Louise McFadden Charlie Page <mark>Diuguid</mark> Patterson, Jr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1152.48, 396.07, 1325.96, 537.2], "bbox_id": "a7b2ce18ab", "file": "AppomattoxNewspapers_1960-1962b_0067.pdf", "page": 1, "text": "To Charles H. Diuguid, of  living, and if not, bo the widow and heirs, devisees and successors in title ol Chailes H. Diuguid, Parties Un- known. Frances Isbell, Alice Bow man, Marcia Isbell, John DSwgjud, David Diuguid, James Dragwid, Hen ry Diuguid, George Diuguid, Rich ard Diuguid, if he be living, and if any or all o f the immeditely here tofore named persons be dead, then to their respective widows and wid owers and heirs, devisees and snc-   n r s in title, Defendants by the"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "To Charles H. <mark>Diuguid</mark>, of  living, and if"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "To Charles H. <mark>Diuguid</mark>, of  living, and if"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.3, 1383.99, 1653.95, 1569.33], "bbox_id": "ffb4db86a1", "file": "AppomattoxNewspapers_1905-1912a_0288.pdf", "page": 1, "text": "tist Ohurch and was a Christian! gentleman. Mrs. Mary A. Diuguid died at her home at Snapps Mill, near! I Spout Springs in this bounty, yes terday at the ripe old ag of 88 years. She was the widow of the lie Augustus Diuguid, whose fam ily is among the oldest in our coun ty. The deceased was a member of Ked O k Baptist church. Her re mains were interred yesterday evening at her late heme,, the ser- I vice being conducted by the Rev. I Judd Davidson, of Hebron church,"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "gentleman. Mrs. Mary A. <mark>Diuguid</mark> died at her home"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "gentleman. Mrs. Mary A. <mark>Diuguid</mark> died at her home"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [968.65, 302.16, 1284.11, 460.55], "bbox_id": "6cb9b91e34", "file": "AppomattoxNewspapers_1926-1933a_0501.pdf", "page": 1, "text": "tian and daughter visited in the home of S. T. Megginson, Sr., Sunday. Mrs. Bonnie Glass and sons, of Lynchburg spent Sunday with Mr. and Mrs. W. T. Chil ders. Mr. and Mrs. M. R. Reynolds and Mrs. Lorene Martin and children visited relatives in Lynchburg Sunday. Mrs. S. T. Megginson, Jr, and sons, Jimmie and Wallace, 1 pent several days in Bucking- dren and Mrs. Diuguid Chris- j bam visiting relatives."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Bucking- dren and Mrs. <mark>Diuguid</mark> Chris- j bam visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Bucking- dren and Mrs. <mark>Diuguid</mark> Chris- j bam visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1744.27, 896.62, 1905.17, 977.92], "bbox_id": "5887ee9a6d", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "This is evidently a healthy local ity as will be seen Horn the fact that only one person has died in this sec tion for several months, that of Maria Diuguid, a colored woman, who died of paralysis near Oakville last Sunday.-"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "months, that of Maria <mark>Diuguid</mark>, a colored woman, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "months, that of Maria <mark>Diuguid</mark>, a colored woman, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1744.55, 1138.31, 1905.85, 1808.98], "bbox_id": "691f2527c9", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "Third Party Mass Meeting A t a mass meeting of the Peoples party of Appomattox county, held at the Court House thereof, on July 19th, 1893, pursuant to the call of the Chairman, to send delegates to the State Convention to be held in Lynchburg, August 3d, 1893, and to complete the organization of the party, at which C. T. Moses was made chairman and J. P. L. Fleshuan, secretary. The following precincts chairmen were elected to fill vacan cies in their respective precincts  Pamplin precinct, J. D. Caw- thon  Turners Mill precinct, John H. Martin. The following delegates and alter nates were elected to the Lynchburg Convention  Pamplin precinctC. S. Cawthon delegate S. H. Martin alternate. Walkers ChurchC. W. Abbitt, delegate M. L. Covington alternate. Fores StoreR. P. Bryant dele gate Sylvester Beusley, alternate. Megginsons MillH. P. Harvey, delegate  Wm. Thornhill, alternate. Turners Mill J. H . Martin, dele gate G. W. Diuguid, alternate. OakvilleW. C. Harvey, delegate T. H. Martin, alternate. Stone WallJ. W. Davidson, dele gate Wm. Jennings, alternate. Spout SpringsF. B. Jones, dele gate  J. H. Robertson, alternate. Appomattox C. H.B. K Pur- dum, delegate  J. P. L. Fleshman, alternate.  Clover H illJ. W. Tweedy, dele- agte  H. C. Torrence, alternate. ChapJ. T. Cawthon, delegate  C. B. Bloxton, alternate. Resolved, That any delegates or al ternate who may attend the State Con vention in the absence of any dele gates from Appomattox county are instructed to cast rhe whole vote of the County. 2. Resolved, thus a copy of these proceedings be sent to the Virginia Sun and to the Appomattox and Buckingham times for publication. On motion the meeting adjourned. C. T. m oses , Chairman. J. P. L. F leshman sec  t ."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "dele gate G. W. <mark>Diuguid</mark>, alternate. OakvilleW. C. Harvey,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "dele gate G. W. <mark>Diuguid</mark>, alternate. OakvilleW. C. Harvey,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.22, 637.86, 2235.23, 1733.83], "bbox_id": "868cb0cbb2", "file": "AppomattoxNewspapers_1960-1962b_0515.pdf", "page": 1, "text": "The matron of honor was M ts . Norman Russel Adams of Farm ville. Her street length dress was emerald Green velvet, princess lino, trimmed with an obee knot in the back. She carried a bouquet of red poinsettas. The bridesmaids were Mrs. .Terry, Arnold George of Appomattox, Mrs Robert Higgins, of Richmond, and Miss Margareta Blanton Spencer, also of Richmond. They wore street length, Christmas Rose red velvet dresses, princess line and trimmed with an obee knot. They carried bouquets of white poinsettas. Percy Wilson George, of Appo mattox, father of the groom, was best man. Utoers were Jerry Ar nold George, brother of the groom of Appomattox, Daniel Gordon Co leman of Appomattox, Robert Ted Younger of Lynchburg, and Rich ard Diuguid Moss, brother of the bride, of FarmviMe. A reception was held at Long- wood Estate immediately following the ceremony. After a wedding trip to New York City, the couple will live ini Lynchburg. Stonewall, Jan. 1.- I want to wish -QiiH good. Editor and his bel ter half, a most happy and prosper ous New Year, and every one of our readers of The Times-Virgin ian the heist of everything in toe year 1962. The Rev. and Mis. John Leiitner spent the holidays in Richmond and Portsmouth with their home folks. So glad they are back in th par sonage.  So glad to know Mrs. M. B. Tay lor has returned home from, the hospital and rnludh improved. Hope she will spon be- feeling real weD again. Mr. and Mrs. John Kemp, of . C., and Mr. aind Mrs. Norman iCarson, of Philadelphia, have re- iturned heme ajfiier spending toe Christmas holidays with Mr. and Mrs. C. D. Carson.  Miss Martha Carson, of Lynch burg spent the holidays with_jthe Messrs. Carey and Eugene Gamson Pind families. , Mr. and Mrs. Lester Carson spent last Wednesday with Mr. and Mlrs. Harry Nash, at Bookneal Mr. and Mrs. Clayton Drinkard, Sr., of Lynchburg spent last Wed nesday with Mr. and Mrs. E. L Chick, Clayton Jr., and wife, and Mr. ihd Mrs. Henry Beard and Lawkncte and Mr. C. D. Drinkard, visited in the Chick home  over the week-end. Mr. and Mrs. Lyle Thomas, Mrs. R. H. Routon and boys, Walter Shelton and John Mr. and Curtis Wooten and Mike, Mr. and Mis. E. L. Chick and Mr. Philhp Scruggs were the dinner guests of Mr. and Mrs. Wilton Routon and family last Tuesday. Mr. and Mrs. Wallace Bondsuranii and family and Mr. and Mrs. Tom Davidson and children spent Sun day with Mrs. Bondurant s mother, Mrs. Sallie Younger, and her sis ter, Mrs. Ruby Oaks, at Rustburg.  Mr. Walter Lee, of Culpeper, spent the holidays with Mr. and Mis. Rufus Burnette. The children of the Burnettes were all home fijx Christmas. Mr. ahd Mrs. V. R. Burnette, at Lynchburg visited Mr. and Mrs. Rufus Burnette on. Saturday. Mr. and Mu. Cantrell Smith and girls and Mr. and Mrs. E. O. Si waiter and Steven visited Mr. and Mrs. C. D. Cainson for Christmas. Little Shirley Kudd, of Ports mouth is spending some time with her grandparents, Rov. and Mrs. John P. Leitneir. She .is always a welcome guftet in our community. Mr. and Mrs. Parks Jennings had all their children and in-laws iwith them on Christmas."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Lynchburg, and Rich ard <mark>Diuguid</mark> Moss, brother of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Lynchburg, and Rich ard <mark>Diuguid</mark> Moss, brother of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.91, 1489.63, 1743.42, 1810.17], "bbox_id": "6730c421db", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "The followers of the Third parly in Appomattox assembled here on Wednesday to send delegates to the Lynchburg Convention, which meets on the 3d day of August. There were eighteen Third party people present, not enough to act as delegates and alternates from the county, as Apppmattox is entitled to eleven delegates and eleven alter nates. Thos.O.Diuguidwasoneofthe speakers of the occasion. He made some wild statements in regard to the T imes , but constdering the fact that Mr. Diuguid when attempting to make a speech is like a wild bull in a china shop, we were not sur prised that his speech should have partaken of that character. Mr. Diuguid was replied to by Mr. S. L. Ferguson, the representative of the T imes present, to whom the courte sies of the floor were extended. A f ter Mr. Ps speech, Mr. Diuguids motion was promptly voted down. A more detailed statement of the meeting is given in another column."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "the fact that Mr. <mark>Diuguid</mark> when attempting to make"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "the fact that Mr. <mark>Diuguid</mark> when attempting to make"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.86, 181.41, 1892.46, 223.1], "bbox_id": "ae8b2e9898", "file": "AppomattoxNewspapers_1974-1975a_0092.pdf", "page": 1, "text": "The family is at the residence. Diuguid Funeral Home is in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "The family is at the residence. <mark>Diuguid</mark> Funeral Home is in charge of arrangements."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "The family is at the residence. <mark>Diuguid</mark> Funeral Home is in charge of arrangements."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1893.85, 283.66, 2059.04, 700.83], "bbox_id": "e678d8f2aa", "file": "AppomattoxNewspapers_1922-1923a_0589.pdf", "page": 1, "text": "T ow er H ill. ... . - One 6f the most enjoy abfe occasions _of the season was the Christmas tree at Liberty Chapel on Christmas day. The church wur beautifully deoorated with evergreens and shaded linnr8 arid .with-theTree in the ftalplt forming a uuck ground, loaded with gi- ts and toys, presented a pretty scene J uSt before these gifts were , delivered by Santa Claus, Mr. Torn Goodwin.a nicely arranged pro gramme was carried into effect as follows  Opening chorus ty spijool,,. Gjxistmas Greetingsby Thelma Hammersley, Our -Christmas Scans- b y Hal lie Smith, Little Folks Welcomeby Robert Dluguld, Let the Bells Ring Outtbelr JoyP ari Thornhill anil tula Smith, The Shepherds Vision- Nancy Diiiguidj Santa Claus Misjudged- by Ben Thofnhlli, Songby school, America The ChilaUuas1Xr-e-jMelvitt ChiMers, Jos Fore ChristmasWiley Garrett.  Under tbb Kings BarinerLillian, Wfeej -and Percy Garrett. Marcia and Percy Childers ai d ,Nanoy Diuguid, Tommy! prayer-Pearl Thornhill, Boj s RightsWalker Thornhill, A Bit of HollyFlorence Diion, A Little Secret-Thelma Hammersley. Hello! Santa Willie Smith, TheChristmas GuestMarcia Childers,t Lillian Garrett, Kula Smith and Pearl Thornhill. Gifts to the King Florence Diion, The Priceless GiftHarry Doss, Song,1 Praise Him, Praise Himby school Grandmas MistakeMary Goodwin, Christ, mas ChimesFlorence Dixon. Alice Smith, Pearl Thornhill, Ethel Welts uul Mary. Good win, What Means this Glory Marcia Childers The First Christmas Lillian Garrett, Kook of AgesEtta Goodwin, Christmas Li lian Garrett. Marcia Childers and Nancy Diuguid Lasca-Mary Garrett, DontJohn Robert Thornhill, A Christmas- Dream Mary Smith The Quarrel -Perry Childers, I Want to see My Mama Eula Smith, Dolly Christmas TreeSusie Booker, Annies and Willies Prayer Mabel-Garrett, A Merry Chrfptmas -Annie Smith, Closing AddressBranch Harris, Song, God Be .With Youby sohool. Each child was presented with a bag, of candy from, old Santa t lahs alter the exer cises. AH present seemed, to enjoy the oc casion,"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Childers ai d ,Nanoy <mark>Diuguid</mark>, Tommy! prayer-Pearl Thornhill, Boj"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Childers ai d ,Nanoy <mark>Diuguid</mark>, Tommy! prayer-Pearl Thornhill, Boj"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.9, 942.06, 1609.91, 1809.19], "bbox_id": "18e17810dc", "file": "AppomattoxNewspapers_1952-1954a_0508.pdf", "page": 1, "text": "t it. iO U n ccv u v a i tobacco commission mer- bacco leaf dealers and no 22 chewing tobacco manu- were listed. Tobacco ware- re Friends, Lynchs, Lib- j-tins, Moormans, Paces, Sc. George A. Diuguid   undertakers at 46 Main, e Lynchburg was disposed directory, on page 195, ets around to the miseel- ppartmer And therein at Appomattox County was fth Judicial CircAiit, with stavus A. Wingfield hold- ere the 15th of March and of September. He served, rounties of Bedford, Camp- nd I Amherst, as well as the f Lynchburg. Henry T. Parrish judge of the county court in  u b x , holding court the firs daw after the first Monday in mofth. is alnost incredible to find out H er of secret, benovolent ther societies and organizations d in the 1880s. Marshall 39, Hill City Lodge No. iburg Chapter No. 10, De r kmandery No. 4, Covenant 12, Star of the West e, Prince Hall Lodge No. 29, hapter No. 5, Knights of ujth two lodges, I. O. txyo lodges, I. O. R. M., gbities, Legion of Honor, mm, Knights of Honor, ite with four units, St. eneficial Society, St. viers, Ladies of the Al- en add in the Garland lub, Oliver Twist Club, ty Boat Club, The Gentle- ng Club, Ladies Glee ordia Glee Club, Mozart ___ and Opera House. Gee, sver stayed at home no won- m didnt need television! to newspapers, there were The Lynchburg News pub- evefcr morning except Mon- WHfgjplso got out a tri-weekly 1 onlMonday, Wednesday and i, and on top of that a weekly  enlThursday. That seems to P toJTEN issues a week. The bum Virginian and the Daily lC j tbe same, except that dvaniee got out a semi-weekly  fa tri-weekly on top of its and weekly issues it all indi- tbai 29 papers a week were led.A. Waddill was proprie- ThigNews and a young fellow 8 6Pne of Carter Glass was ditor. JgjBpomattox way, N. H. Rag- ras mstmaster and ran a gen- aerchndise store. The school nown as Budwells High L mbert P. Pattei son was the  daitor. Joel W. Flood was  cattle dealer, as was W. tneyUEdward G. Hix ran the loteLIWilliam H. Gills was the 7 hwosurer, David A. Christian I William A. Plunkett aeriff, John Robertson was the akerand T. P. Taylor was e of peace. John and Will- osser ran stores. Leading farm- nr w Woodson, John .M   Sears, Charles H. Sack- ilhsjgb,e, William Trent. Allen pings Conner, Ed S. -ontmfced on Page Four"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Paces, Sc. George A. <mark>Diuguid</mark>   undertakers at 46 Main,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Paces, Sc. George A. <mark>Diuguid</mark>   undertakers at 46 Main,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [140.9, 1053.42, 286.6, 1361.7], "bbox_id": "47db59e782", "file": "TimesVirginian_1981a_0422.pdf", "page": 1, "text": "survi vies. He was a retired carpenter and a member of First Baptist thurch of Monroe. In addition to his wife, he is survived by two daughters. Frances H. Robertson. Con cord, and Norma Turns. Lynchburg four- sons, Elbert Peery. Concord. Kenneth L. Peery and William G. Peery. both of Evington. and Henry B. Peery, South Carolina  two sisters. Mrs. Hugh Walker. Gladys, and Mrs. Lottie Jones. Wilson. N. !. one brother, Franklin Jefferson. -Greer. S. 29 grandchildren, many great grandchildren and one great great grandson. Funeral services were con ducted from First Baptist Church-of . Monroe at 2 p.m. Friday, with the Rev. Charles P. Anderson Jr . officiating. Interment followed in Fort Hill Memorial Park. Diuguid Funeral Home was in charge of the arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Fort Hill Memorial Park. <mark>Diuguid</mark> Funeral Home was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Fort Hill Memorial Park. <mark>Diuguid</mark> Funeral Home was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1187.76, 1292.36, 1312.95, 1313.48], "bbox_id": "4271342c12", "file": "AppomattoxNewspapers_1922-1923a_0479.pdf", "page": 1, "text": "Successor to Geo. A. Diuguid St Son. LICEN SED EMBALMER!"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark> St Son. LICEN SED EMBALMER!"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark> St Son. LICEN SED EMBALMER!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1160.89, 1308.91, 1291.55, 1329.84], "bbox_id": "02c87534ca", "file": "AppomattoxNewspapers_1922-1923a_0494.pdf", "page": 1, "text": "Successor to Geo. A. Diuguid  Son. L IC E N S E D E M B A L M E R"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark>  Son. L IC E N S E D E M B A L M E R"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark>  Son. L IC E N S E D E M B A L M E R"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1199.04, 1287.18, 1323.31, 1330.08], "bbox_id": "f39ee580c2", "file": "AppomattoxNewspapers_1922-1923a_0483.pdf", "page": 1, "text": "Successor to Geo. A. Diuguid  Son.   L IC E N S E D EMBALJ1EBÍ ---- AND F U ÎN E R A L DIRECTO"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark>  Son.   L IC E N S E D EMBALJ1EBÍ ---- AND F U ÎN E R A L DIRECTO"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Successor to Geo. A. <mark>Diuguid</mark>  Son.   L IC E N S E D EMBALJ1EBÍ ---- AND F U ÎN E R A L DIRECTO"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [594.49, 819.99, 753.68, 877.94], "bbox_id": "deec7571dc", "file": "AppomattoxNewspapers_1898-1902a_0586.pdf", "page": 1, "text": "Stephen Sampson Diuguid, a for-1 iner resident of Appomattox, but now of Brooklyn, N . Y ., spent Sun-1 day and Monday in visiting friends and relatives here."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Stephen Sampson <mark>Diuguid</mark>, a for-1 iner resident of Appomattox, but now of Brooklyn, N . Y ., spent Sun-1 day and Monday in visiting friends and relatives here."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Stephen Sampson <mark>Diuguid</mark>, a for-1 iner resident of Appomattox, but now of Brooklyn, N . Y ., spent Sun-1 day and Monday in visiting friends and relatives here."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.77, 408.45, 1772.72, 896.7], "bbox_id": "6f7f4c8dfa", "file": "AppomattoxNewspapers_1892-1898a_0280.pdf", "page": 1, "text": "Spring M ills Item s. Quite a pleasant sociable was held at the new and pretty residence of Mr. Jack Cardwell on the evening of the 14. After the girls had found their corresponding hand kerchief they repaired to the din ing-room, where a most, sumptuous repast awaited them. Rarely has it beeu our pleasure to see a prettier table. The evening was spent very delightfully in music and games and not tell the wee sma hours of the morn did the pleasant party think of disbanding. The gentlemen present from a distance were Messrs. Richard Webb Diuguid, John Overton, Elbert Jones, Marvin Jones, Spout Springs Eddie and Ben Caldwell, West Appomattox. Mr. Moore, from Lynchburg. Mr. and Mrs. John Davis cele brated their fifth anniversity by having a wooden wedding. Many nd nsef nl were the wooden presents tendered them. Mr. Harvey Dedaker and wife spent several weeks with their son, J. W. Davis, dinings and tea-parties were the order of the day during their stay. They left amid the egrets of all, and wishes for a speedy return. The gentlemen seem to be waiting for the reversion of the order of things as it is leap year as they have sent out but few valentines. But the girls are sure to take ad vantage of the le-p year privilege.  L eon adas ."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "were Messrs. Richard Webb <mark>Diuguid</mark>, John Overton, Elbert Jones,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "were Messrs. Richard Webb <mark>Diuguid</mark>, John Overton, Elbert Jones,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [747.62, 753.8, 904.02, 955.29], "bbox_id": "22872b7a3f", "file": "AppomattoxNewspapers_1898-1902a_0519.pdf", "page": 1, "text": "Spout Spring. Mrs. Ed. Chamberlayne and little son Charlie of Staunton, are visiting her parents at this place. Mrs. Mandy Duncan, of this place, is visiting her daughter, Mrs. Pngh. of Campbell county. Mr. A. M. Goodman is this week employing Mr. Fol in repairing his house. The colored people seemed to en joy the Fourth of July. We enjoyed a splendid sermon at Salem on the fifth Sunday, preached by Rev. George Wiley, of Richmond. Mrs. Thomas Diuguid continues quite ill. Miss Virginia Bates, of Chap, is visiting relatives and friends at this place."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "of Richmond. Mrs. Thomas <mark>Diuguid</mark> continues quite ill. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "of Richmond. Mrs. Thomas <mark>Diuguid</mark> continues quite ill. Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [442.3, 207.79, 587.65, 352.75], "bbox_id": "ca2f1bc892", "file": "TimesVirginian_1981a_0158.pdf", "page": 1, "text": "sica Uhda Zearfoss. of West chester, Pa. Funeral serviras were con ducted from Diuguid Memorial Chapel Tuesday, May 26 was at 11 a.m. by Durk Douglas Zearfoss. Interment was in Fort Hill Memorial Park. Diuguid Memorial Chapel was in charge of arrangements. Oakville"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "were con ducted from <mark>Diuguid</mark> Memorial Chapel Tuesday, May"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "were con ducted from <mark>Diuguid</mark> Memorial Chapel Tuesday, May"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [452.15, 236.81, 603.96, 883.78], "bbox_id": "2f5eafd744", "file": "TimesVirginian_1981a_0396.pdf", "page": 1, "text": "She is survived by two sons, William Richey Jobe Jr., Amherst, and Horace David Jobe Sr., Gladstone one daughter, Mrs. James Oscar Ruth Givens, Newport News one sister, Mrs Gladys Akers Bay, Newport News eight grandchildren, and five great- grandchildren. Graveside, services were conducted at 11 a.m. Monday in Amherst Cemetery.  pi Driskill Funeral Chapel was in charge of arrangements. Mrs.-Ricbard A. Moore Lena Harris Graham Moore, 88. Route 3, Rustburg, died Saturday morning, Nov. 14 in Liberty House Nursing Home. She was born in Appomatox, a daughter of Isaac Newton and Mollie James Martin Harris. She was twice married, the widow of. David Hugh Graham and Richard Adrian Moore. She was a chart member of . Southview United Methodist Church. She is survived by two daughters, Mts. W. H. Leona Wooldridge, Rustburg, and Mrs Robert Melvin Aleene Moore, Lynchburg one son, David Calvin Graham, San Diego, Calif. four stepsons, Charlie B. Moore, Herman H. Moore, Tommie V. Moore and Richard A. Moore, Jr., all of Lynchburg two sisters, Mrs. J. L. Barbieri, Rustburg, and Mrs. L. A. Neunam, Parkesburg, Pa. six grandchildren, and six great -grandchildren. Funeral services were con ducted at 2 p.m. Monday in -Diuguid Memorial Chapel by the Revs. L. A. Trent and U. G. Bailey. Burial was in Spring Hill Cemetery. Robinson Funeral Home was in charge of arrangements. Elizabeth Smith Ford Re jmoids Elizabeth Smith Ford Rey nolds, 74, died unexpectedly Wednesday afternoon, Nov. J l. She was the widow of Gobel Reynolds. Born in Appomattox Countv. She was a daughter of L. E. Smith. She was a member-of Liberty Baptist Church. Fidelis"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "2 p.m. Monday in -<mark>Diuguid</mark> Memorial Chapel by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "2 p.m. Monday in -<mark>Diuguid</mark> Memorial Chapel by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1041.85, 302.54, 2359.16, 447.69], "bbox_id": "926717fc36", "file": "AppomattoxNewspapers_1960-1962b_0077.pdf", "page": 1, "text": "SfffMg!?, In A Growing Town, VIRGINIA In ttoe Clterks umce of tibc Circuit Court of Appomat tox County. . Wadte Ferguson, Appomattox, Vir ginia. VS Charles H. Dduguid, et ala TV Charles H. Diuguid, if living, and if not, to the widow and heirs, devisees and successors in title of Chailea H. Diuguid, Parties Un known. Frances Isbell, Alice Bow man, Marcia Meli, Jo Dfiuguid,"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "ala TV Charles H. <mark>Diuguid</mark>, if living, and if"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "ala TV Charles H. <mark>Diuguid</mark>, if living, and if"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [236.9, 537.58, 666.11, 1214.1], "bbox_id": "a2e719a115", "file": "TimesVirginian_1983a_0014.pdf", "page": 1, "text": "sad, died in Phsnh - Beulah Puckett Sublett, Hospital Thun- 64, Star Jtouto.Phenix, died Friday 8. He was too morning at her bento sorge Jefferson. She was born in Charlotte County t .. rti April 1,1912, Feb. 27,198, a daughter of the late he was a .son of the late Notan Christophér Douglas Puckett and Jefferson and Blanche Hall Jaffer- the late Mattie Puckett Puckett, ton. He was. a member of New She was a member of Midway Prospect Baptiat Church and a Baptist Church. Her husband was retired employee of Winebarger. the late Charles Spurgeon Sublett. In addition to Ms rife, he is 8r. survived by two brothers, Willie Surviving are three stepdaugh- Jefferson, Charlotte Court House, tors, Mrs. Eunice Guthrie, Brook- and Bluford Jefferson, Madiaon neal, Mra. Thelma Austin and Mrs. Heights, and one sister, Mrs. Hasri Sarah Mason, both of Phénix a Williams. Philadelphia, Pa. atepdaughtor-ln-law, M rs. Lois A funeral service was conducted 8uMott, Phénix one brother. Jack at 2 p.m. Sunday by the Revto Puckett, Brook neal six sisters, Robert Reese and H.F. Hamilton Mrs. Estelle Beeler, Gladys, Mrs. Jr. at New Proapeet Baptist Church Mahal Holt and Mrs Louis Holt, with burial to Gretna Burial Ptork. both of Brooknoal, Mrs. Lucille Finch Cad Finch. Funeral Home Allen, Lynchburg, M rs. Lisste was in charge of arrangements. Htrnhes, Fitzgerald, Ga and Mrs. f M rF ito s Mildred Peak, Long Island 11 Margaret Fitxgerald McFadden. nd 10 stepgreat- 84, of Appoanattox, dfed 4 1840 . . .  m MnnHiiy jtw  jg in Virginia  Funeral iif vices were conducted Bantist Hosoital at 2 p.m. Sunday at Midway Baptist ll,. w u i,e wa rjy jg  Church by the Rev. Elton McFadden. She was the daughter of Burirf s in the church Florence Bryant Fitxgerald, Appo-  .  __ , mattox. and tip lato Carrington , .,  ,MirronJ upr1Hony James Fitxgerild. ,   !  armbgeiuent. . In addition to her mother and M rs.C.E TemHnson husband, she is survived by a Mildred MarahaU Tomlinson, 78. daughter, Sandra Carol McFadden, Route 1. Lynchburg, died Jan. 5 at and n son, Shane Thomas her home. She waa the wife of McFadden, both of Appomattra Cornelius Earl Tomlinson, and three latere, Joyce F. She was born to Appomattox McCormick. Gladstone and Haasl F, County, n daughter of John P. and Ferguson and Helen F. Dorn, both of Rova Cheatham Marshall. She was a Appomattox. retired auhur fer Dr. Edwin A. ... . . . . te s    Harpmand was a member of Shiloh Maacnto Ledge held Wednesday at p.m. at Liberty United Methodist Church. Cemetery. 4   faadditiifetoBér IiusbanCseV 1 Robinson Funeral Home waa In survived by one son, Richard M. charge of arrangements. c  Taylor. Bedford County  two -  FraadsN Piekerell step-daughtora, Mrs- June T. Frauda N. PickiroU. 78, of Route H j  ? W    Ry r Tbornhfll. 24, Appomattox, died Friday, both of Lynchburg three brothers, December 81 in M orristown Hmmra P. Marshall. Lynchburg. Memorial Hospital. N. J. Rom in      Priiic, G mt , , Coonty, Md, h , J-H  V 8g - S frty in Appmnattox for nine yean. ïr  ? aictora, mra. Frances M. moving here from Gillette, N.J. Nwton4nehbug. Mrs. lVymn He ratind in 1878 from Allan . Appomattox and Mra. Mnrriwi PiiM iw ? Emmett Brunson, i Chester, 3.C. Surviving are Ms wife, Enaiice Bfwortapgwnddifldren. Pldwrall one daughter, Mra. Amm j L aaryieca rare conducted Kitt of Bedminiator,N.J. two sons,  A Ji pm . in Diuguid Everette PickereU of Warren. N J. Chapel  th and Franeta Pickerell. J r. f O J.W iadH eS r.B urialw asto Pennsylvania. . Preabjrterian Cemetery. Arrangements ware by Gallaway. _ Diuguid Rivermont Chapel waa in"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "A Ji pm . in <mark>Diuguid</mark> Everette PickereU of Warren."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "A Ji pm . in <mark>Diuguid</mark> Everette PickereU of Warren."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [161.5, 202.95, 431.99, 529.53], "bbox_id": "ca6ff33a51", "file": "TimesVirginian_1980a_0360.pdf", "page": 1, "text": "S f Ueorge F. Branch Diuguid Funeral Service George Frederick Breach, was in Charge of arrange- 77, of Wingina, died Wed- meats. Hesday in i Lynchbürg Hadwitak He j  u the Robert B.TsyferJr. husband of M artha T. . Robert Barry Taylor Jr., -Branch of Wingina. , 16, cf Route 1, Concord, died piHe was a . tuhsd. em- Wednesday morning in ployee of the CaO Raüroad Lynchburg General Hospi- and a member of the George ai Masonic Lodge No. 32, Born in Lynchburg,, he Howardsvflle. was a son of Robert Barry  In addition to his wife, he Taylor and Nancy Walker is survivedby a son, Charles Taylor of Concord. He was a Douglas Branch of Glad- junior at Rustburg High H t,  School and a member of tne m Funeral services were Rustburg Future Farmers of inducted at 3 p.m. Friday America.  worn Woodland Methodist in addition to his parents, Church, Buckingham. In- he is survived by his ferment was in the church paternal grandparents, Mr. Cemetery. c . ... and Mrs. James C. Taylor of T h ack er Bros. Funeral Dallas, Tex. his maternal .Home. Scottsville was in grandmother, Mrs. Elsie C. jp d u lu  arrangements. Walker of Lynchburg and f  . , . two brothers, Jason C. m T Taylor and Jeremy T. W Taylor, both of Concord. . . . D -  Funeral services were v Ä conducted at 3 p.m. Friday from Whitten Timberlake Ch.1 by t  R.v Robert"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "f Ueorge F. Branch <mark>Diuguid</mark> Funeral Service George Frederick"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "f Ueorge F. Branch <mark>Diuguid</mark> Funeral Service George Frederick"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2041.41, 221.16, 2185.53, 303.71], "bbox_id": "da72ba7062", "file": "TimesVirginian_1981a_0203.pdf", "page": 1, "text": "Rochester, New York a son, James W. Connor of Winston- Salem, N. C. and four grandchildren. Funeral services were con ducted from, Diuguid Memorial Chapel at 1 p.m. Wednesday by the Rev. William W. Laughlin"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "were con ducted from, <mark>Diuguid</mark> Memorial Chapel at 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "were con ducted from, <mark>Diuguid</mark> Memorial Chapel at 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1676.37, 714.46, 1803.56, 957.97], "bbox_id": "2edbaab07c", "file": "TimesVirginian_1976_0099.pdf", "page": 1, "text": "Robert M. Moore Robert Melvin Pete Moore, 52, of 1120 Heath Ave., died Tuesday at his home. Born in Campbell County, he was a son of Josie Johnson Moore and the late Gordon F. Moore. He was a member of Chestnut Hill United Methodist Church, Moose Lodge No. 715 and Fallen River Country Club of Appomattox. He was the manager of the mechanical maintenance department at the Babcock and Wilcox NFD. Other than his mother, he is survived by his wife, Aleene Graham Moore a son, Stanley D. Moore of Concord a brother, James T. Moore of Hyattsville, Md., and a grandson. Funeral services will be con ducted at Diuguid Memorial Chapel at 2 p.m. Thursday, with burial in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "be con ducted at <mark>Diuguid</mark> Memorial Chapel at 2"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "be con ducted at <mark>Diuguid</mark> Memorial Chapel at 2"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [265.69, 263.7, 404.88, 586.38], "bbox_id": "a2b542dd6f", "file": "AppomattoxNewspapers_1974-1975a_0334.pdf", "page": 1, "text": "Robert Julian Jenks Jen kins. 74, of 3521 Demott St., died Saturday at Virginia Baptist Hospital. He was married to Alma Inge Jenkins. His first wife was Beulah Crews Jenkins of Altavisita. Born in Appomat tox, he was the son of Addie Cawthorne Jenkins of Lynch burg and the late Robert Smith Jenkins. He was a member and on the Administrative Board of Park View United Methodist Church. He was a member of Travelers Protection Associa tion and the Quarter Century Club. He worked at Craddock- Terry Shoe Corp. for 42 years. He is survived by one son, Richard L. Jenkins of Pitts burgh, Pa. two brothers, Harry L. Jenkins of Appomat tox and Richard T. Jenkins of Luthersville, Md. one sister, Mrs. Francis Abbitt of Lynch burg, and two grandchildren. Funeral services were held at 3 p.m. Monday at Diuguid Memorial Chapel, with burial in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "3 p.m. Monday at <mark>Diuguid</mark> Memorial Chapel, with burial"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "3 p.m. Monday at <mark>Diuguid</mark> Memorial Chapel, with burial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1391.39, 759.4, 1536.94, 1029.18], "bbox_id": "a980e3cd61", "file": "TimesVirginian_1981a_0369.pdf", "page": 1, "text": "Robert Bruce Patteson  Robert Bruce Patteson, 62, 2621 Main St., died unexpected ly, Wednesday, Oct. 21, in Lynchburg General Hospital. 3 He was born in Appomattox County, a son of the late William Diuguid Patteson and Bdna Beall Patteson. He was a mechanic with the Adams Motor Co. c He is survived by a devoted Mend and her family, Mrs. Irish Harrison and Cheryl, Robin,- Ralph and Bobby Harrison, all of Lynchburg bur brothers, Charles C. Patteson, Lynchburg, W. Diu guid Patteson ana Ed L. Patteson, both of Chatham, and Tommy C. Patteson, Appomat tox three sisters, Mrs. Betty P. g"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "of the late William <mark>Diuguid</mark> Patteson and Bdna Beall"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "of the late William <mark>Diuguid</mark> Patteson and Bdna Beall"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.98, 298.32, 2101.66, 1508.96], "bbox_id": "9f4ca2c810", "file": "AppomattoxNewspapers_1902-1905a_0522.pdf", "page": 1, "text": "Rev. John Ward, 78 years old, a well- known Baptist clergyman of Isle ol Wight county, was found dead in bed. Mr. Ward, who was chaplain of the Cal- ott-Wrenn Camp of Confederate Vet erans, delivered the prayer at Isle ol Wight Courthouse -uesday, when the Confederate monument was unveiled in the presence of 4,000 persons. He was in his usual health at bed time. The deceased is survived by a widow and two sons Dr. J. W. Ward and Robert Ward. As the result of an accident on May IO, when he was bruised internally by being thrown from a buggy, Frank E- Stallings, a justice of the peace, at Buckhorn, Nanseniond county, dit-i iged 50 years. Justice Stallings horse became frightened at a pile-driver, and he jumped to escape more serious dam- ige. Mrs. ouise Fletcher oreene, of Rap pahannock, has been appointed to rep resent the Valley of .Virginia at the reunion of Confederate veterans to be held in Louisville this month. She lias selected Miss Brucie Funkhouser, of Strasburg, as her maid of honor. Major F. R. Lassiter sued the city of Petersburg for 3,560 because the ity erected a smallpox hospital on a farm adjoining his estate. J. C. Reed, of Evansville, Ind., was held in Petersburg charged with being passer of bogus checks. A syndicate has been formed to bund an electric railway to connect Ocean View and Pine Beach. The distance is ave miles, but 300,000 capital will be raised to build hotels and cottages along he line. Stewart Terry, the 15-year-otd son of Mr. W. L. Terry, a well to-do farmer, living near Lynchburg, was kicked by horse and is probably fatally injured. Jose Antone Peria, a fireman on the steamer City of Augusta, which has taken the place of the Hamilton between Norfolk and New York, is in St. Vin cents Hospital, Norfolk, seriously wounded, and Eugene Lianas, a Portu guese mess boy on the same steamer, is in jail charged with attacking him. The boys fought. Perias wounds are in the shoulder and were inflicted with a sharp carving knife. , A dispatch from King William Court house says that Henry Lipscomb, a farm er of Manquin, that county, is probably fatally injured as the result of an attack made on him with a pitchfork by a small negro boy. The boy became angered at something said to him by Lipscomb, and attacked the farmer, driving the fork into his body 15 timds. The reunion of Independent Order of Odd Fellows of the Valley, under the auspices of the lodges of Shenandoah county, occurred at Mount Jackson There were about 1,500 persons present. Dr. C. A. R. - Moore, Mayor of Mount Jackson, made the address of welcome This was followed by a speech of ReV E. E. Northern, past grand master of Winchester, upon the origin and growth of the Order of Odd Fellows. Mr. F. P. Brumback, of Woodstock, introduced the orator of the day, Gov. A. J. Mon tague, who made a splendid speech on Odd Fellowship, which was enthusias tically received. Sands  Oliver, contractors for the first 100 miles of the Tidewater railway, have begun clearing the rights of way at Suffolk for the roadbed. Managet Dupuy is ready to advertise for bids fot another section of the road. Thomas S. Nunnally and George By rum were indicted in the Corporatioi Court at Norfolk for non-support. Nun nally was required to give bond of 120 to insure the payment to his wife of 30 every three months, and Byrum was re quired to give a bond of 150 for the payment of 3 a week to his wife. Th order in each instance is to remain in force for 12 months, with the alterna tive of staying in jail. John P. Branch, one of Richmond wealthiest bankers, has giveh 30,000 to Randolph-Macon College, at Ashland, to be used in the erection of a dormi tory. Mr. Branch is a stanch friend of the college and has heretofore made large donations. Concluding a six days trial in the Circuit Court of Surry county, the 5,000 damage suit of James H. Dillard against Mayor George H. Woods and Police Chief Kemtnerer, of Claremont, ended in a mistrial. The suit was warmly contested by five attorneys. Dillard seeks damages because of alleged illegal arrest on account of his refusal to pay town license claims. Laughton Diuguid, aged 22 years, son of William D. Diuguid, a prominent bus iness man of Lynchburg, killed himself at his home shortly before noon by blow ing the top of his head off with a Win chester rifle. The young man was suf fering from nervous breakdown, caused by overstudy during the past term at school in Philadelphia, where he was taking a course in chemistry. He had to return home some weeks ago and was to be taken to Richmond for special treatment. He did not want to leave home, and the departure was delayed. Diuguid secured the rifle, went to hts room, and, placing the muzzle against his right temple, fired. The Elks have begun the erection of their  Home, on High street, Char lottesville, opposite the Courthouse. United States Marshal Morgan Treat will remove the headquarters of the Eastern district from Newport News to Richmond. The Merchants and Farmers Bank has been organized at Smithfield, with 30,000 to 50,000 capital stock. The officers are W. P. Wilson, president B. P. Gay, vice-president W. R. My ers, cashier."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "town license claims. Laughton <mark>Diuguid</mark>, aged 22 years, son"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "town license claims. Laughton <mark>Diuguid</mark>, aged 22 years, son"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1614.94, 528.62, 1745.39, 650.21], "bbox_id": "45af54f355", "file": "TimesVirginian_1980a_0349.pdf", "page": 1, "text": "ren. Funeral services were conducted at 11 .m. Friday from Diuguid Memorial Chapel by the Revs. Alden Hicks and Paul Blevins. Interment was in Fort Hill Memorial Park. Memorial may be made to the Chestnut Hill Baptist Church and the Lynchburg Life Saving Crew."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "11 .m. Friday from <mark>Diuguid</mark> Memorial Chapel by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "11 .m. Friday from <mark>Diuguid</mark> Memorial Chapel by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [119.3, 722.27, 264.21, 1097.81], "bbox_id": "d6b8ff1364", "file": "TimesVirginian_1976_0331.pdf", "page": 1, "text": "Raleigh Hunter Chilton, 64, of Smith Mountain Lake, died Wednesday morning, Septem ber 8,1976 at his home. He was the husband of Anne DuPuy Cfeitton. Born in Appomattox County, he was a son of the late Raleigh1 Hunter Chilton and Elma Shearer Chilton. He was a retired construction superin tendent for C. L. Lewis Construction Co. He was a veteran of World War H, serving as a navigator in the U. S. Marine Corps, and was a member of Covenant Presby terian Church. In addition to his wife, he is survived by a son, Raleigh Hunter Chilton of Rdhie, N. Y. two daughters, Mrs. John Rumsey of Laurel, Md. and Mrs. James Hall of Alexandria two sisters, Mrs. Robert Bell of Norfolk and Mrs. Bruce Dixon ofVtrginia Beaeb and two grandsons, Raleigh Hunter Chilton and John Chapman Chilton.  Graveside services were held at 1030 a.m. on Friday in the Concord Cemetery. Diuguid Funeral Home was j in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in the Concord Cemetery. <mark>Diuguid</mark> Funeral Home was j"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in the Concord Cemetery. <mark>Diuguid</mark> Funeral Home was j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [141.6, 569.41, 307.39, 978.62], "bbox_id": "d148daa320", "file": "TimesVirginian_1983a_0212.pdf", "page": 1, "text": "Plymouth Monday morning, June 18, at Seven Hills Health Care Center. His wife was the late Vera Henry Harding. Born May 12,1894 in Appomattox County, he was a son of the late Charles Jackson Harding and Mary Jane Crews Harding. He was a member of Centenary United M ethodist Church, u n til bia retirement, he was plant manager for Lynchburg Planter Manufactur ing Co. He is survived by his daughter, Barbara Graham Harding, and a brother, Jessee A . Harding, both of Lynchburg several nieces and nephews. . Funeral services were conducted W ednesday at 10 a,m . from Centenary United Methodist Chur ch by the Rev. William W . LaughHn Jr . Interment was in 8pring Hill Cemetery. Diuguid Rivermont Chapel was in charge of arrangements. Maud Yenag Harvey Maud Young Harvey died June 8, 1988, in Atlanta, Ga. She was born Fab. 14, 1890, in Pamplin, the daughter of the late Thomas C . and Nannie 8. Young. She is survived by one son, W illiam T . H arvey, and two grandchildren, Patricia Lee Harvey and William B. Harvey, all of Atlanta four nieces, Hilda Hoffman of Pennsylvania, Catherine Rowland and W ilma JP iercey, both iff"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in 8pring Hill Cemetery. <mark>Diuguid</mark> Rivermont Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in 8pring Hill Cemetery. <mark>Diuguid</mark> Rivermont Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [334.56, 270.49, 502.19, 685.62], "bbox_id": "69545dfc9c", "file": "TimesVirginian_1983a_0080.pdf", "page": 1, "text": "Park, Kansas, and several nieces and nephews. She was preceded by one week in death by a brother, William Wirt Cabell of Lynchburg. Funeral services were conducted at Diuguid Funeral Chapel at 2 p.m. on Saturday, with burial in Spring Hill Cemetery. Jacob Thomas Diamond Hill, Jr. Jacob Thomas Diamond HiU, Jr., 73, 1316 Oakwood Court, Lynchburg, died Thursday, March 17, at his home. He was the husband of Nora B. Hill  Born in Lynchburg, he was a son of the late Jacob Thomas Hill and Lillie Williams HilL He was a member of Centenary United Methodist Church and was retired from Appalachian Power Company. In addition to his wife, he is survived by two daughters, Mrs. George M. Nancy Burnett, Jr., Lynchburg, and Mrs, Alan W. Linda Bridwell, Alexandria two brothers, R. Oakley HiU, Hampton, and Charles D. HiU, Appomattox two granddaughters, Elisabeth H. Burnett and Sarah W. Burnett. Graveside services were conduct ed Saturday at 11 a.m. in Spring HiU CemetOry. Diuguid Rivermont Chapel was in charge of arrangements. Hoimsey Inge, Jr. Holmsey Inge, Jr., 63, of Route 2 lay, Lynchburg General Hospital."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "services were conducted at <mark>Diuguid</mark> Funeral Chapel at 2"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "services were conducted at <mark>Diuguid</mark> Funeral Chapel at 2"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [619.45, 683.54, 761.28, 840.7], "bbox_id": "5329ddad13", "file": "AppomattoxNewspapers_1971-1973a_0044.pdf", "page": 1, "text": "P a  .ppemattox County she was a daughter of James W. Johnson and M rs. An ni e Worley Johnson. A retired em ploye of Appalachian Power Co., she was a member of River- mont Avenue Baptist Church. She is survived by a daugh te r, Mrs. Phyllis B. Martin of Lynchburg a sister, Mrs. Cal- lie J. Straus of Atlanta three grandchildren, and five great grandchildren. Diuguid Memorial Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "and five great grandchildren. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "and five great grandchildren. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [672.5, 241.91, 845.62, 1300.46], "bbox_id": "f731d7eeb5", "file": "TimesVirginian_1983a_0132.pdf", "page": 1, "text": "Open Door Baptist Church. In addition to her husband, she is survived by three daughters, Eulalia Greene and Anne Trent, both of Lynchburg, and Elnora Tolley. Madison Heights stepson, Dave Holland of New Jersey two stepdaughters. Myrtle Burley, Moneta and Pamela Lewis of Greensboro, N.C. a brother, Paul Ferguson, Lynchburg two grand children, Roy Allen Tolley, Madison Heights, and Audrey Lee, Lynch burg a great- granddaughter. Stephanie Tolley, Madison Heights and number of stepgrandchildren. Funeral services were conducted at 1 p.m. Tuesday at Whitten Park Avenue Chapel by the Rev. Darrell Campbell. Burial was in Fori Hill Memorial Park. Whitten Park Avenue Chapel was in charge of arrangements. Walter Pettit Parrish ARRINGTON  Walter Pettit Parrish, 92, died Monday, April 11, at Liberiy Nursing Home, Lynch burg. Born in Nelson County June 22, 1890, he was the. son of the late William Henry Parrish and Lucy Poindexter Parrish. His stepmother was the late Mary Katherine Hight Parrish, he was a member of Bethlehem United Methodist Chur ch in Roseland and a retired employee of American Cyanamid Corp. He is survived by his wife, Cora Bell Witt Parrish of Lynchburg five sons, Stephen Poindexter Juny Parrish of Gladstone, William Henry Parrish, George Witt Parrish and Herbert Preston Parrish, all of Madison Heights, and Malcolm Pettit Parrish of Arrington three daughters, Genoa Elizabeth Sis Parrish Mawyer and Mildred Pierce Parrish Texter, both of Richmond, and Mary Ann Parrish Tyree of Arrington two sisters, Lucy  Anderson Parrish of Lovingston and Bessie Payne Parrish of Lynchburg 15 grandchildren and 13 great grandchildren. Funeral services were conducted Thursday at 2 p.m. at Preston Parr Fiineral Chapel, Roseland. by the Revs. Michael Kubat and John Campbell. Interment followed in Bethlehem United Methodist Chur ch cemetery. iJm Preston Parr Funeral Chapel, Roseland. was in charge of arrangements. N. Hunter Tanner N. Hunter Tanner, 501 Washing ton Street. Lynchburg, died Saturday. April 16, in Lynchburg General Hospital. Born in Appomattox County, he was the son oi the late Neal Arthur Tpnne.and Annfo Jones Tanner. He was a retired superintendent of the foundry yard of Lynchburg Foun dry He was a member of First Baptist Church whore he was a member of the Highway Bible Class and chairman of the Board of Deacons. He was a member of Marshall Lodge 639, Lynchburg Shrine Club, Kazim Temple of Roanoke and the United Commerc ial Travelers Assoc. He is survived by his wife, Alice Lee Freeman Tanner three brothers, Marshall E. Tanner and Milton A. Tanner, both of Lynchburg, and Jones V. Tanner, Gladys and three sisters, Mrs. E, W. Wade md Mrs. William F. Isaacs Jr., both of Lynchburg, and Mrs. Preston Coates, Gladys. Funeral services were conducted from First Baptist Church at 11 a.m. Monday by Dr. Kenneth B. Bryan and the Rev. Maurice Grissom. Interment was in Spring HiH Cemetery. - Diuguid Rivermont Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in Spring HiH Cemetery. - <mark>Diuguid</mark> Rivermont Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in Spring HiH Cemetery. - <mark>Diuguid</mark> Rivermont Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.04, 381.63, 2323.86, 848.06], "bbox_id": "eeecacff7c", "file": "AppomattoxNewspapers_1902-1905a_0140.pdf", "page": 1, "text": "On Wednesday evening at  Spring Dale. the beautiful home of Mr. J . C . Shearer, Mrs. Shearer entertained her Snnday-echool class and a few immediate friends, iu a very delight ful mauner. From six oclock till dark the time was pleasantly spent, in playing broquet then the parti cipants were invited to partake of delicious refreshments, which were, most appropriately, served on the lawn. The lawn, having been light ed up, and small tables placed here and there, made a beautiful scene. Having done full jiiBtioe to the re freshments, those present spent the rest of the time in conversation and music. Miss M ary Diuguid and Miss Mattie Grow saug several sweet selections, accompanied by the gui tar. Shearer Brothers played their violins with the- usual sweetness, and there were several piano solos. A t ten ocjook the party broke up, hav ing spent a most delightful eveuiug. A ll pronounced Mrs. Shearer an ad mirable hostess, and will be glad to be present whenever another such occasion comes off. The couples who participated in croquet were as follows Mr. Strat ton Taylor and Miss Mary Diuguid, Mr. O. E. Shearer and Miss Jennie Stone, Mr. Eldridge Martin and Miss Mállie Grow, Rev. and Mrs. L . 0. Shearer, Mr. Herman Moore anc Miss Annie Martin, Mr. Glenwooc Shearer and Miss Minnie Shearer, Mr. Tom Martin and M ísb Pearl Grow, Mr. Grover Grow and Miss Susie Moore, Mr. A-bner Grow and Miss Annie Drinkard. Others pre sent were Misses Birdie Shearer Nellie Weakley, and Messrs. Sbeai er Weakley, Clarence Drinkard am and Mrs. Mary Angle. Ju ly 27, 1903."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "music. Miss M ary <mark>Diuguid</mark> and Miss Mattie Grow"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "music. Miss M ary <mark>Diuguid</mark> and Miss Mattie Grow"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1446.22, 274.62, 1605.17, 404.12], "bbox_id": "fb8546e2d4", "file": "AppomattoxNewspapers_1892-1898a_0113.pdf", "page": 1, "text": "On Monday, Jauuary 8th, between 11 and 12 oclock, the house of Washington Diuguid, a colored man living near Oakville, was entirely consumed by fire. He lost all of his household furniture, his clothes, ex cept what he had on, and was unable to save anything hut one box of meat. Mr. C. W. Harvey and other neighbors came to his assistance, hut it was too late to accomplish anything."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "the house of Washington <mark>Diuguid</mark>, a colored man living"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "the house of Washington <mark>Diuguid</mark>, a colored man living"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [530.41, 224.35, 711.53, 432.84], "bbox_id": "d10ac04cb0", "file": "TimesVirginian_1983a_0339.pdf", "page": 1, "text": "On June 18 of this year Mr. and Mrs. John Diuguid of Sykesville, Md., along with their son and grandson, three generations of Diuguids, witnessed the placing of a brass bar emblem at the base of the grave of George Duiguid. It was in the fall of 1962 that John Duiguid contacted the Lynchburg Chapter of the National Society of the Daughters of American Revolution to have his ancestors grave marked with 9 DAR marker. He contacted the Lynchburg Chapter because in his research on George Duiguid, he found that a Miss- Mabel Davidson of Appomattox had joihed the Lynchburg Chapter in 1916 as a descendant of George Duiguid and his wife, Nancy Sampson Duiguid. According to Miss Davidsons"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Mr. and Mrs. John <mark>Diuguid</mark> of Sykesville, Md., along"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Mr. and Mrs. John <mark>Diuguid</mark> of Sykesville, Md., along"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [343.87, 799.07, 1211.11, 1009.76], "bbox_id": "4ca633c8e7", "file": "TimesVirginian_1983a_0178.pdf", "page": 1, "text": "OFFICERS FOR THE Appel attex Primary Scheal PTA have been selected for 1983-84. They are Cram toft Charlene Lawson, vice president Virginia Tweedy, secretary Ruby Inge, treasurer and Jim Softer, president. Annette WUHnms will serve es reporter. A PTA workshop Is planned for Jene 2 at neon at foe school to establish committees, programs, projects and goals for 1183-84. Suggestions are welcome. GaWeesChurch all of Lynchburg. Funeral services were conducted from Diuguid Rivermont Chapel at 11 a.m. Friday by the Rev. James E. Wood. Interment was In Fort Hill Memorial Park. Diuguid Rivermont Chapel waa in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "services were conducted from <mark>Diuguid</mark> Rivermont Chapel at 11"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "services were conducted from <mark>Diuguid</mark> Rivermont Chapel at 11"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.99, 1355.69, 1698.21, 1662.34], "bbox_id": "2211b8752a", "file": "AppomattoxNewspapers_1939-1943a_0538.pdf", "page": 1, "text": "Officers for 1943 of the W C. T. U. are as follows President, Mrs Tom Collins Secretary, Mrs. Luther Morris Treasurer, Mrs. R. C Wagner Cor. Secy., Mrs. R. B. Hudgins Department directors are social morality and child welfare, Mrs. H.  M. Burge Christian education and evange lism, Mrs. Barlow Christian citizenship, Mrs. G. O. Gordon Medical temperance, Mrs. Hudgins Peace, Mrs. J. Stanley Flower mission, Mrs. Lottie Bled- soeScientific temperance, Mrs. C. T. Moses. The meeting for November will be held Tuesday, November 21, at the l ome of Mrs. ioitie Bledsoe. This is the month for collecting dues for the year. All members re requested to be present. Mrs. J. F. Diuguid, of Lynchburg, president of the bi-county organization, Till be , present and will bring news from the recent convention in Richmond, and will also aid in formulating plans for work."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "present. Mrs. J. F. <mark>Diuguid</mark>, of Lynchburg, president of"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "present. Mrs. J. F. <mark>Diuguid</mark>, of Lynchburg, president of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.58, 213.13, 1617.07, 547.06], "bbox_id": "db9280c172", "file": "TimesVirginian_1980a_0257.pdf", "page": 1, "text": "niece, Mrs. Harvey E. Henderson, in Concord,.Va., where she had made her home for the past two years. She is survived by two sisters, Mrs. Agnes M. Evans of Concord and Miss Josephine McGregor of Lynchburg and a number of nieces, nephews, great- nieces, great-nephews and great-great-nie c e s a n d great-great-nephews. She was educated in Lynchburg schools and was graduated from Randolph- Macon Womans College. For many years, she was a legal secretary, both . in Charlottesville and in Lyn chburg. She was a member of Rivermont Presbyterian Church. Funeral services were conducted at 11 a.m. Tuesday at Diuguid Mem orial Chapel by the Rev. Lowell B. Sykes. Interment was in Spring Hill Ceme tery. - Diuguid Funeral Service was ii charge of arrange ments."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "11 a.m. Tuesday at <mark>Diuguid</mark> Mem orial Chapel by"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "11 a.m. Tuesday at <mark>Diuguid</mark> Mem orial Chapel by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [554.65, 241.48, 722.25, 1057.42], "bbox_id": "c1c05de332", "file": "AppomattoxNewspapers_1892-1898a_0242.pdf", "page": 1, "text": "ngry and excited manner of said ollins and McKinney and the large crowd at their.back a number of oters were intimidated and the re- ult of the election changed from hat it would have been had their been no illegal behaviour. We ned the poll books because they only certified the number of the otes, and the certificate of remov- not because we thought it right, but simply to carry the election in. L a m ec h J o n e s . Mr. R. G. Whorley 8 statement agreed almost entirely with M Jones  he did not believe Mr. lartin had done anything wrong or ntended to do anything wrong that he did not consent to Mr. Mar- ns removal, but advised him to leave because he feared violence ou Id be done him. Mr. Geo. W. Diuguid said he be- ieved the only wrong Mr. Martin did was to swear in the booth and for that reason he was in favor of moving him. That when McKin ney, Collins and Hughes came iu he voting room with the large crowd it their back, McKinney said unless Martin was removed blood would be pilled. . Mr. Martiu being seen said, that he had been constable in the Fall lection and had then performed his luties fairly and honestly that he had no other intention in this election, that he had never received i suggestion or an instruction from my one as to his duties, except a .opy of the election law that he intended to point out the names honestly to all parties who asked his issistance aud told him they could not read that he did this for Henry Hughes and that said Hughes liad scratched Flood, Tent and Smith from the ticket, that Hughes said to him you have scratched Mr. Collins name, the very man I want to vote for. This naturally incensed him aud he cursed the negro, and told him if he did not like that ticket to get another one and fix it to suit himself. Hughes then picked the ticket up and voted it without mak ing any complaint to the judges, that complaint was made against him and he was told by one of the judges that if he did not leave he would be mobbed. His. reply was let me stay.here until they mob me, In some way he was removed. He did not leave voluntarily and never would have done so. The above are the facts of this matter and we do not believe that any law-abiding citizen will approve the high-handed and lawless meth ods adopted by the Republicans on this occasion."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "him. Mr. Geo. W. <mark>Diuguid</mark> said he be- ieved"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "him. Mr. Geo. W. <mark>Diuguid</mark> said he be- ieved"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1768.1, 630.97, 1931.39, 1749.55], "bbox_id": "448885dc7c", "file": "AppomattoxNewspapers_1926-1933a_0538.pdf", "page": 1, "text": "newall Some farmers are busy threshing wheat this week. A big crop made thru this section, only 50 cents per bushel- What will become of the poor farmers? We have nice rains every few days and corn and tobacco are looking fine. Veg etables are plentiful. Miss Virginia Carson of Ap pomattox visited Miss Ethel Al- vis for the week-end. John Alvis, Jr., of Blacks burg, was home for the week end. Miss Elsie Lowry Christian, of Covington is spending some time with her grandmother, Mrs. C. E- Carson. Mr. and Mrs. Keeling Sissin and children of Richmond, were guests of Mr. and Mrs. Parks Jennings last week, hav ing been called here by the death of Judge Christian. Mr. and Mrs. Frank C. Drinkard a n d Frances, spent the week with Mrs- Drinkards mother, Mrs. W. H. Drinkard, and attended the Drinkard and Chick reunion Sunday at Mr. A. F. Drinkards. Elkton Hamilton of Chicago, is the guest of his parents, Mr. and Mrs. B. H- Hamilton- Supervisor S. E. Anderson and family and Mr. O. R. Turnes and family returned Wednesday from a trip to Nor folk, Va. Beach and other cities. Mrs- Alice Jacobs and little daughters, Bettie and Dot, John Howard Elder, Jr-, a n d Mary Cornelia Elder, of Rich mond, are spending this week with Mrs. C. M. Stratton, Jr. Tilden Lee, of Ohio is visit ing his mother, Mrs. Anna Lee- Miss Elva Stratton, of Uni versity of Va-, is expected home for the week-end. The revival begins at Tririi- ty Ghurch 4th Sunday, conduct ed by the pastor, Mr. Lewis. Mrs. J. P. Alvis, Miss -Annie Alvis and Miss Lizzie Rice are on a motor trip to West Vir ginia and. Tennessee. Miss Sue Taylor a n d Mrs. Elizabeth Snavely, of Lynch burg visited Mrs- Parks Jen nings last Sunday. Quite a number of friends and relatives of Lynchburg and other places visited in this home and attend ed the funeral of Judge Chris tian- Mr. O. R. Turnes has a new Chevrolet. ------------ o- ----------- Honorary Pall Bearers The following were named honorary pallbearers for th e late Judge D. A. Christian, the first 14 being confederate com rades of the deceased R. E. Caldwell, C. H. Cole man, D- P. Ferguson, C. C. Ferguson, J. W. Perdue, Appo mattox G. W. Cheatham, Spout Spring, R. H. Thornhill, Spout Spring, Milton Isbell, Lynchburg, J. B. Nowlin, Lynchburg, S. T- Marsh, Oak ville, J- F. Connelly, Pamplin, S. M. Ranson, Pamplin, C. E. Cardwell, Concord Depot, J. C. Whitaker, Crewe. George Diuguid, Lynchburg, B- P. Thornhill, Lynchburg, Robert Thornhill, Lynchburg, Dr. W. B. Thornhill, Lynch burg, George M. Tarry, Rich mond, Dr. Paul Redd, Rich mond, Dr. Manfred Call, Rich mond, A. R, Harwood, Appo mattox, Col. Joel Flood, Appo mattox, Hon. S- L. Ferguson. ------------ o ------------ Memorial Methodist Church G. D. Coffey, Minister. Sabbath School9 30 A. M. Morning service1030 A. M."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "C. Whitaker, Crewe. George <mark>Diuguid</mark>, Lynchburg, B- P. Thornhill,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "C. Whitaker, Crewe. George <mark>Diuguid</mark>, Lynchburg, B- P. Thornhill,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [161.5, 543.03, 431.53, 851.83], "bbox_id": "67ac13fa43", "file": "TimesVirginian_1980a_0360.pdf", "page": 1, "text": "n t  S T i V k  l nty.Jxn. as, iW7, ne was a m  . __ -i . . on! of the late Charlie Whlttcn k  Johnson and Ruth Smith Chapel   charge of Jbhnaoh. He was a retired arrnSments- leather inspector- for the  Craddock Terry Shoe Carp.,. Lloyd Patterson served as a staff sargeant in Lloyd Patterson departed World War II with the 118th this life on October 26, at the Chemical Import .Co. in the .Virginia Baptist Hospital in Asiatic-Pacific Theater, a Lynchburg, Va. member of the Evergreen He was born September 5, Baptist Church, Appomat- 1913 in Appomattox County, fox, and a member of the A son of tw late Charlie and Craddock-Terry Quarter Ce- Hattie Patterson, fiuijr Club. -He attended Addison In addition to his wife, he High School and joined the is survived by five brothers. Hill St. Baptist Church in lio ii Johnson, Cawthorn E. Roanoke, Va. Johnson, Williard Johnson, He is survived by a Charlie Jehnson, and Milton daughter, Mrs. Gladys Law- Johnson, all of Appomattox son, a son, Mr. James and a sister, Celene Tuck of Patterson of Pamplin,. Va. Lynchburg. Six sisters, Mrs. Gladys Funeral services were Cheatham, Mrs. Doris Wr- conducted at 11 a.m. ight, Mrs. Henrietta John- Thursday from Diuguid son, and Mrs. Audrey Memorial Chapel by Dr. Shears all of Appomattox, John L . Suttenfield. Inter- -Va. Two brothers, Mr. merit was in Fort Hill Monroe Patterson of Bronx, Memorial Park. N. Y. and Mr. Vincent"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Henrietta John- Thursday from <mark>Diuguid</mark> son, and Mrs. Audrey"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Henrietta John- Thursday from <mark>Diuguid</mark> son, and Mrs. Audrey"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1388.36, 194.71, 1536.87, 518.9], "bbox_id": "d75f352787", "file": "TimesVirginian_1978_0152.pdf", "page": 1, "text": "Mrs. WUHam S. Booth  Mrs. Bernice Coleman Booth, of Rt. 1, Concord, died ednesday night, March 29. 78, in Guggenheimer Memor- pd Hospital. f Born in Campbell County, gjhe was the daughter of the late Mack D. Coleman and Fetna fweedy Coleman. She was the jpridow of William S. Bill jpooth. She was a member of flew Chapel Baptist Church. 5j She is survived by one daughter, Mrs. - Annie Booth Thompson of Concord two ions, Billy S. Booth and Kyle Booth, both of Concord, nine grandchildren and eight great grandchildren. Funeral services, were con ducted from New Chapel Baptist Church near Rustburg at 2 p.m. Saturday by Rev. CarroU Welch and Rev. Terry Woodard. Interment was the church cemetery. Diuguid Memorial Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "was the church cemetery. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "was the church cemetery. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [327.59, 855.79, 481.05, 1398.45], "bbox_id": "5211da79d9", "file": "AppomattoxNewspapers_1971-1973a_0044.pdf", "page": 1, "text": "Mrs. Maude Garbee Winston, 85, of Rt. 1, Rustburg, d i e d Tuesday at the home of her daughter, Mrs. Louise Oben- shein of Forest. She was the wife of the late George Alex ander Winston. Born in Campbell County, she was the daughter of Robert E. i and Janet Withers Garbee. She 1 was an active member of Whites United Methodist Church, and had written the history of the church dating back to its found ing in 1812. She was also a member of the Womens Christian Temperance Union, the Womens Society of Christian Service, Yellow Branch Home Demonstration Club, the Colonial William Byrd Chapter . of the Daughters of the Ameri can Colonies and Fort Loudoun Chapter of the Daughters of the American Revolution. In addition to her daughter, she is survived by seven sons, Ernest T. Winston of Chesa peake, Charles J. Winston of Branson, Mo.,.G. Alexander Win ston Jr. of Gladys, Clark S. Winston of Rustburg, Cabell G. Winston of Richmond, Bowling H Winston of San Juan, Puerto Rico, and Robert C. Winston of Appomattox five other daugh-, ters, Mrs. Etta Elliott of Lynch-j burg, Mrs. Annie Carbough of j Stephen City, Mrs. Eleanor Alvis  of Roanoke, Mrs. Mattie Bersch of Forest and Mrs. Alice May Tilman of Rustburg one brother, W. Cabell Garbee of Lynchburg two sisters, Mrs. Marion Bell of Lynchburg and Mrs. Ella Phil lips of Gladys 33 grandchildren and 31 great-grandchildren. A funeral service will be held at 11 a.m. Wednesday at Whites United Methodist Church. Burial will be in the church cemetery. Funeral services were held at 11 a.m. Wednesday at Whites United Methodist Church. Bur ial took place in the church ce metery. Diuguid Funeral Home is in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "the church ce metery. <mark>Diuguid</mark> Funeral Home is in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "the church ce metery. <mark>Diuguid</mark> Funeral Home is in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [159.61, 808.05, 298.27, 1036.81], "bbox_id": "349ddc3b39", "file": "TimesVirginian_1981a_0247.pdf", "page": 1, "text": "Mrs. Mary Lucy. Drinkard, 87. Concord, died Saturday b Lynchburg General Honrftel. Born in Appomattox County, she was a daughter of John B. and Mary Lucy Stratton Drinkard. She was the widow of Douglass Drinkard. and a member of the First Church. She is survived by one sister, Mrs. Aubrey Thomas, Concord, and tw o nieces and tw o nephews. G raveside services w ere conducted at l l .m. Monday at Hebron Baptist Church ceme tery fck the Rev, jBeuaSh Bryan. I v . V Diuguid Funeral Home was in charge of arrangements Austin"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Bryan. I v . V <mark>Diuguid</mark> Funeral Home was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Bryan. I v . V <mark>Diuguid</mark> Funeral Home was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [526.78, 566.86, 663.79, 796.45], "bbox_id": "b2c4e9bcec", "file": "AppomattoxNewspapers_1971-1973a_0396.pdf", "page": 1, "text": "Mrs. Mary Lou Carson, 85, of 1415 Nelson Drive, died Wed nesday, July 19, at St. Johns Nursing Home. She was the wife of James Palmer Carson. Born in Appomattox County, she was a daughter of E. A. Chick and Ann Elizabeth Strat ton Chick. She was a member of First United Methodist Church. She is survived by two daugh ters, Mrs. Elizabeth Hansber- ger and Mrs. Mabel C. Over- street of Lynchburg a sister, Mrs. R. W. Franklin of Lynch burg three grandchildren, and five great-grandchildren. Funeral services were con ducted at 2 p.m. Friday, July 21 at Diuguid Funeral Home Chapel. Burial was in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Friday, July 21 at <mark>Diuguid</mark> Funeral Home Chapel. Burial"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Friday, July 21 at <mark>Diuguid</mark> Funeral Home Chapel. Burial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [331.2, 916.58, 464.5, 1198.47], "bbox_id": "0b7ebcf4bd", "file": "AppomattoxNewspapers_1971-1973a_0593.pdf", "page": 1, "text": "Mrs. Lorraine Sweeney Cardwell, 98, of 2312 Lafayette Ave. died Monday in Greens boro, N. C. She was the widow of W. Halsford Cardwell. Born in Appomattox County, she was- a daughter of Alfred Alexander S w e e n e y and Blanche Babcock Sweeney. She was a former member of Court Street United Methodist Chur ch. She is survived by a son. Dr. Willard W. Cardwell of Greensboro a brother, Bradley B. Sweeney of Lynchburg two sisters, Mrs. N. C. Perrow and Mrs. Boyd Braden of Lynch burg two grandchildren and five great-grandchildren. Funeral services were con ducted at 11 a.m. Wednesday, Jan. 3, at Diuguid Memorial Chapel by the Rev. George W. Jones. Burial took place in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Wednesday, Jan. 3, at <mark>Diuguid</mark> Memorial Chapel by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Wednesday, Jan. 3, at <mark>Diuguid</mark> Memorial Chapel by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1840.78, 174.36, 1985.78, 515.8], "bbox_id": "c56cafebd9", "file": "TimesVirginian_1980a_0009.pdf", "page": 1, "text": "Mrs. Jelm W . Burley Katie High Burley, 76, of 1601 V j Bedford A ve., Lynch burg, died -Tuesday morning, Dec. 18,1979, biGuggenheimer Hospital. Born in Appomattox County, she was a daughter of the late Joseph T. Sligh and Eutchron T. Iee Sigh . Twice married, her first husband was the late Raymond M. Campbell, and her second. husband was the late John -W. Burley. Shs was a member of Eternal Baptist Church. She is survived by five sons, J . R . CampbellH. E . CampbelL C. S. Campbell and L . 0 . Campbell, all of Lynchburg, and F. L . Campbell of Tallahassee, Fla. a sister, Mrs. H. G. Beatrice Thompson of Lynch burg two brothers, K . T. Sligh Jr . and Clarence 0 . Sligh, both of Lynchbnrg 25 grandchild ren, 17 great-grandchildren and two great-great-grandchildren. Graveside services were conducted at 2 p.m. Friday, Dec. 21, 1979, i Fort HtH Memorial Park.  Diuguid Memorial Chapel, Lynchburg, was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Fort HtH Memorial Park.  <mark>Diuguid</mark> Memorial Chapel, Lynchburg, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Fort HtH Memorial Park.  <mark>Diuguid</mark> Memorial Chapel, Lynchburg, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1587.03, 790.86, 1766.17, 1245.3], "bbox_id": "eefbc5e9fe", "file": "AppomattoxNewspapers_1933-1936a_0544.pdf", "page": 1, "text": "Mrs. J . H. Patteson, of near Ap- pomatox, celebrated her 90th birth day on Sunday, September 6 at her home All of her children and most of her grand children and great grand children as well as their re latives and friends were present fa make it a happy day for her Al though Mrs. Patteson is confiened to her bed most of the time from rheumatism, she takes a gr eat inter est in present affairs. A picnic spread was served in the dining room and the table was covered with good things to eat. Those present were Mrs. Patteson. H. C. Patteson, Mrs C . P . Patteson, M r. and Mrs W D Patteson and children, Rob ert Diuguid, Bettie, Charles, Bar bara, Thomas, Lucy, Edmund Lee J R Patteson, Mr. and Mrs. K. A. Hamilton, Misses Kathleen and Lorraine Hamilton Rob, Billy and Hunt Hamilton, Mr. and Mrs Rich ard Hamilton and Caroline M r. and Mrs. L R. Hamilton and daugh ters, Kitty and Jack Mr.and Mrs. Bennie Beale and daughter, Yvonne, Miss Virginia Seale, Mr. and Mrs I R D Hughes, Misses Majone and, Lids Hughes, Mr. and Mrs John P. Hughes and children, Polly, John Sallie and Holcombe Mr and Mrs. Robert Hughes and son, Bobby Mr and Mrs. W. A Harris Jr. and daughter. Emma Mr J ttnV  rin k - A . Drinkard, Mrs. W . H . , ni ard, Mr.and Mrs. C .T . Drinkard, and children Delia Gregory, Edythe Jones, Mr. and Mrs E. L Chick, Misses Sue Jones Virginia Beale, Virginia Allen E. P . T  Miss Cornelia Thornhill, Mrs- P -1 Smith, Mrs. John Turnes, Coleen and Douglass Agee, Miss Thelma Turnes, Elliott Turnes, Mrs. W W . OBrien, Miss Phoebe OBrien, Mrs. Ben Nowlin, Mr. and Mrs. J  Nowln, Mrs. W. B. Dove and son and nephew Archer Bailey."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "and children, Rob ert <mark>Diuguid</mark>, Bettie, Charles, Bar bara,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "and children, Rob ert <mark>Diuguid</mark>, Bettie, Charles, Bar bara,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [622.1, 531.41, 769.05, 791.7], "bbox_id": "50f00733ec", "file": "AppomattoxNewspapers_1971-1973a_0235.pdf", "page": 1, "text": "Mrs. Indie Wooldridge Far rar, 81, of 2122 Hanover St., Lynchburg died at 9 a.m. Fri day at her home after a long I illness. She was the wife of the l late Eddie Willis Farrar. Born in Appomattox County, she was the daughter of John and Fannie Holt Wooldridge. She was a member of Fairview Unit ed Methodist Church. She is survived by two brothers, Ted Wooldridge of I Madison Heights and Archie Wooldridge of Lynchburg and two sisters, Mrs. J. C. Cockran of Eden, N. C., and Mrs. D, M. Whitehead of Lynchburg. A funeral service was con ducted at 11 a.m. Monday at Diuguid Funeral Chapel by Dr. John L. Suttenfield and the Rev.  Henry B. Sudduth. Burial took I place in the Presbyterian Ce metery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "11 a.m. Monday at <mark>Diuguid</mark> Funeral Chapel by Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "11 a.m. Monday at <mark>Diuguid</mark> Funeral Chapel by Dr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [149.06, 482.65, 329.41, 732.19], "bbox_id": "58bc90c43b", "file": "TimesVirginian_1983a_0430.pdf", "page": 1, "text": "Mrs. Granville Lewis Dedd Myrtice Spiggle Dodd, 80, of 106 Berkshire Place, Lynchburg, died Wed.. Nov. 28, in Lynchburg Nursing Home. She was horn in Appomattox County, a daughter of the late Charles B. Spiggle and Mildred W. Spiggle. She was a retired employee of Craddock- Terry Shoe Corporation, where she was a member of the Quarter Century Club, and was a member of Chestnut Hill Baptist Church. She Is survived by one daughter, Evelyn 0. Abromatis one sister, Mrs. Pauline S. Hicks, one grandson, Calvin E. Greene, Jr., and one great-grand son, Paul Ellis Greene, all of Lynchburg. Funeral services were conducted from Diuguid Rivermont Chapel Saturday at 2 p.m. by the Rev. Alden L. Hicks, with interment in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "services were conducted from <mark>Diuguid</mark> Rivermont Chapel Saturday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "services were conducted from <mark>Diuguid</mark> Rivermont Chapel Saturday at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [473.29, 240.03, 619.04, 592.71], "bbox_id": "b46c4d9e5e", "file": "AppomattoxNewspapers_1971-1973a_0593.pdf", "page": 1, "text": "Mrs. Elizabeth W 0 0 1 r i d g e Campbell, 74 of Rt. 1, Forest died Thursday, December 28, 1972 at Lynchburg General- Marshall Lodge Hospital. She  was the widow of Houston B.  Campbell. Born in Appomattox County,  she was a daughter of Richard j Layburn Woolridge and Mary Doss Woolridge. She owned and 1 operated a dairy farm and was j a member of Forest United i Methodist Church. She is survived by a step-son ! M. R. Campbell of Lynchburg j four step-daughters, Mrs. Alma Witt of Forest, Mrs. Sue Puckett Mrs. Louise Bersch and Mary Jane Campbell of Lynchburg three brothers, Richard A. Woolridge of Roanoke, Lyle A. Woolridge of Prospect and Earl Woolridge of Forest two sis ters Mrs. Callie Gordon of Vinton and Susie Woolridge of Forest and a number of neices and nephews. Funeral services were con ducted at 2 p. m. Sunday at Diuguid Memorial Chapell by the Rev. Richard H. Hoagland, Burial took place in Forest Baptist Church Cemetery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "p. m. Sunday at <mark>Diuguid</mark> Memorial Chapell by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "p. m. Sunday at <mark>Diuguid</mark> Memorial Chapell by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1353.15, 545.61, 1495.22, 805.25], "bbox_id": "bb159f358d", "file": "TimesVirginian_1976_0456.pdf", "page": 1, "text": "Mrs. Elizabeth Boothe Felps 11 West Princeton Circle lied Wednesday night, Dec. 8, 976 in McGuire Hospital. Born in Appomattox County, he was a retired employe of tivermont Beauty Shop and Iras retired from the U. S. Air Force, She was a daughter of lie late W alter Boothe and Hizabeth Sears Booth, and was member of Holy Cross Roman Stholic Church. She is survived by a brother, Fohn Boothe, Jr. of Binghamp- pn, N.Y, Funeral services were con ducted at 930 a.m. Saturday at Joly Cross Roman Catholic Jhurch, with interment in pring Hill Cemetery. Diuguid Memorial Chapel, ynchburg, was in charge of rangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in pring Hill Cemetery. <mark>Diuguid</mark> Memorial Chapel, ynchburg, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in pring Hill Cemetery. <mark>Diuguid</mark> Memorial Chapel, ynchburg, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [419.05, 196.47, 560.86, 592.86], "bbox_id": "f776975e1b", "file": "AppomattoxNewspapers_1974-1975a_0433.pdf", "page": 1, "text": "Mrs. Elizabeth Beasley Brooks, 81. of 310 Lakewood St., Lynchburg, died at St. Johns Nursing Home at 1159 p.m. Friday. Born in Appomattox County, she was the daughter of the late Xing E. Beasley and Saliie Ann Davidson Beasley. She was a retired employee of Craddock- Terry Shoe Corp. and a member of West Lynchburg Baptist Church where she was a member of the Philathea Class. She is survived by her husband, Herbert A. Brooks two sons, Herbert A. Brooks, Jr. of Roanoke and Ronald E. Brooks of Orlando, Fla. two daughters, Mrs. E. Roy Godsey and Mrs. Hugh H. Godsey, Jr., both of Lynchburg two brothers, C. G. Beasley of Lynchburg and Raymond E. Beasley of Richmond three sisters, Mrs. H. M. Clingempeel and Mrs. Helen Falwell, both of Lynchburg and Mrs. L. H. Morris of Pensacola, Fla 12 grandchildren and two great grandchildren. Funeral services were con ducted at Diuguid Memorial Chapel Monday at 2 p.m. by the Rev. Paul Brunner and Dr. Jerry Falwell. Burial was in Fort Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "were con ducted at <mark>Diuguid</mark> Memorial Chapel Monday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "were con ducted at <mark>Diuguid</mark> Memorial Chapel Monday at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [427.89, 408.3, 560.39, 734.88], "bbox_id": "7f3dfb2692", "file": "TimesVirginian_1980a_0139.pdf", "page": 1, "text": "Mrs. Edward T. Trent, Sr. Mrs. Lee Anna Poe Trent, 92, of Route 3, Hyland Drive, Rustburg, died in Lynchburg General Hospital Friday. She was born in Appomat tox County, the daughter of the late Robert Lee Poe and Lee Anna Jamerson Poe. She was the widow of Edward T. Trent Sr. She was a member of Central Baptist Church at Altavista. Surviving are two sons, Sydnor S. Trent of Lynch burg and Edward T. Trent Jr. of Rustburg two daughters, Eltha T. Winston and Vivian-. Crowder, both of Rustburg a sister, Mrs. Valia Pruitt of Hopewell 12 grandchildren 13 great grandchildren and two great-great-grandchildren. Graveside services were conducted at Fort Hill Memorial Park Monday at 1 p.m. Diuguid Memorial Chapel was in charge of arrange ments."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Monday at 1 p.m. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Monday at 1 p.m. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2118.77, 726.87, 2281.0, 1084.16], "bbox_id": "2cfcab36b5", "file": "AppomattoxNewspapers_1902-1905a_0493.pdf", "page": 1, "text": "Mrs. Dabney Anderson, who spent most of the winter in South Carolina, is now at home lo the de light of her many friends. Miss Willie Bell has returned from a visit to her sister iu Onmberlaud county. Miss Verona Bell is now iu Luidi burg, w here lie s iuploying Imr skillful huger iu making beautiful dresses. She is very nii.oh uiitseil at home tnd abroad. Miss Jennie Turner, after a pro longed viit in Lyucbburg, lias i t turned to our midst. We welcome her to our hearts aud homes. Mnny thanks to the nice compli ments to the Glenfall corre-pondeut by Bouthside. This oorrespouden has ho idea who.Southside is, bu greatly  appreciate the honorab I mention. Why does not the Andersonvill correspondent wake up? We t! not wish him lo rest any longer. Mr. Gus. Diuguid is snfferi from tuberculous, at his Inline lie. here. He has .he sympathy of .ll tbe people iu the community. April 17,1905."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "any longer. Mr. Gus. <mark>Diuguid</mark> is snfferi from tuberculous,"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "any longer. Mr. Gus. <mark>Diuguid</mark> is snfferi from tuberculous,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [136.1, 591.48, 274.52, 1017.16], "bbox_id": "6877d8e956", "file": "TimesVirginian_1980a_0401.pdf", "page": 1, "text": "Mrs. CartThomas Canipe f Mrs. Rosella Babcock Canipe of Route 2, Rust- burg, died st her home Thursday. She was the wife n Carl Thomas Canipe. f She was born in Appomat tox County, a daughter of tile late Thomas Honier Babcock and Lottie Martin pabcock. She was the Commissioner of-Revenue of CampbellCounty from 1971- 1975 and she worked as a deputy commissioner in the revenue office for 33 years. She was a member of the Central United Methodist Church in Rustbur?. g In addition to her hus band. she is survived by five brothers. Dwight M. Bab cock and Thomas H. Babcock Jr., both of Rustburg, Charles H. Babcock of Blackstone, Wallace H. Babcock of Richmond, and Walter Babcock of Louisa One sister, Mrs. Frances Nelson of Richmond, and 11 nieces and nephews. A funeral service was conducted at II 7 a.m. Saturday from the Central -United Methodist Church by the Rev. David C. Moore- J field. Interment was in the Babcock family cemetery. Appomattox County. Diuguid Memorial Chapel was in charge of arrange ments. ."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "family cemetery. Appomattox County. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "family cemetery. Appomattox County. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [117.1, 991.08, 269.26, 1451.81], "bbox_id": "2a639d4d88", "file": "TimesVirginian_1980a_0052.pdf", "page": 1, "text": "Mrs. Carlton R. Harvey M. Ina Moore Harvey, 77, of Route 3, Lynchburg, died at her home Monday morning. Her  husband is Carlton Reeves Harvey.1 Born in Appomattox County, she was a daughter of the late Carnelius A. Moore and Frances Burge Moore. She was a member of the Indian Hill United Methodist Church and also a member of the United Methodist Womens Club and the U.D.C. She is survived by two sons, Thomas C. Harvey of Lynch burg and Robert G. Harvey of Rustburg a daughter, Mrs. Robert Virginia Beale of Lynchburg two brothers, Robert C. Moore and B. Rice Moore, both of Appomattox three sisters, Mrs. Elizabeth M. Burge, of Lynchburg, Mrs Virginia M. Hamilton of Richmond and Mrs. Blanche M. Phelps of Appomattox four grandchildren, Clayton Harvey, Suzanne Harvey, Kimberly Beale and Rhonda Beale, all of Lynchburg Funeral service was conduct ed from Indian Hill United Mtathodist Church, Campbell County, at 11 a.m. Wednesday by the Rev. Steve D. Parker. Interment was in the church cemetery. Diuguid Memorial Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in the church cemetery. <mark>Diuguid</mark> Memorial Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in the church cemetery. <mark>Diuguid</mark> Memorial Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [124.55, 256.64, 265.68, 525.63], "bbox_id": "ebdf8dcac2", "file": "TimesVirginian_1976_0171.pdf", "page": 1, "text": "Mrs. Arlene Francis Nuckles of 714 Dinwiddle St., Lynch burg, died Wednesday, May 5, 1976 in Virginia Baptist Hospital. She was the wife of Dewey McKinley Nuckles. Born in Gladys, she was a daughter of the late Walter Francis and Bell Martin Francis. In addition to her husband, she is survived by a son, Haywood M. Nuckles of Spout Spring three daughters, Mrs. Carolyn Lindsay of Winston- Salem. N.C., Mrs. Norma Lee Coffey of Norfolk and Miss Kathleen Nuckles of Lynch burg, and six grandchildren. Funeral services were con ducted at 11 a.m. Saturday at Diuguid Memorial Chapel by the Rev. Lawrence A. Trent. Burial was in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "11 a.m. Saturday at <mark>Diuguid</mark> Memorial Chapel by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "11 a.m. Saturday at <mark>Diuguid</mark> Memorial Chapel by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [556.06, 368.61, 742.17, 965.64], "bbox_id": "bf4c3fb4c2", "file": "TimesVirginian_1984a_0044.pdf", "page": 1, "text": "Mrs. Alice Cash Adaasa, 70 rf Pamplin, died Sunday, January 28, 1984 at - the Hahrwraity of Virginia  Hospital in Chat iettoey fife She was the wife of the late Raleigh MartiA Adams.  Born in Amherst County, V a,, daughter of the late Lawrence Kinckle Cash andCanunie WhitesaB Cash.9fta. - Adams was a tneniber of Eton Baptist Church whord she taught Sunday School She was a m etabeirof tift Pamplin Chapter, AARPandhad serve as past president of tfais group. She is survived by her son and dMghter-in-law, Lawrence Wade and Katar  Adams of Pamplin two granddaughters, Cheryl S. Strong, Norfolk Gina A. Mitchell, Pamplte one sister M rs. Cleo C. Joyner Courtland six brothers, L. W. Cash, Madisonville John S. Gish and H. L. Cash both of Sflver Springs, Colorado E. W. Cash, South Boston UL-Cash, Greensboro, N. C. B. B. Cash, Dolphin, Aia.  -  - Funeral services were conducted at 1 p.m. Thursday, February 2, 1964 at Eton Baptist Church by the Rev. Danny Owen and the Rev. Ospanee Bowen. Burial took place ill Spring Creek Baptist Church cemetery at Darlington Heights. Robinson Funeral Home was hi charge of arrangements. J.KytoBaeth J. Kyle Booth, 57, of Route 1, Concord, fied Wednesday,. Feb. 8. He was born hi Campbell County, the son of the late William S. Booth and Bernice Coleman Booth. He was the coowner of Booth and Moaee Grocery Store in Rustburg, an Army veteran of World War H, and a member of New ChapelBaptist Churdi. He is survived by his wife, Bettie Cox Booth two daughters, Crysti Lee BootnNand Cindy Dawn Booth one brother, BBhr Booth and one sister, AnnieBoOthThompson, all of Concord. A funeral service was conducted from -New Clapel Baptist Church Saturday at 2 pan. by the Revs. Carroll Welch and Dmgtas Gibson. Interment was in the churdi cemetery. Diuguid Watertick Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "in the churdi cemetery. <mark>Diuguid</mark> Watertick Chapel was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "in the churdi cemetery. <mark>Diuguid</mark> Watertick Chapel was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [163.18, 1243.28, 309.81, 1472.67], "bbox_id": "1137351ae1", "file": "TimesVirginian_1978_0241.pdf", "page": 1, "text": "Mrs. Alford M. White Mrs. Josephine P h e l p s White, 83, widow of Alford Montague White, died Sunday in Medical Care Center. Born in Appomattox County, she was a daughter of the late Joseph J. and Alice Virginia Epps Phelps. She was a member of Court Street United Methodist Church. She is survived by a son, Alford M. White Jr. of Hampton. Graveside services were conducted at 1030 a.m. Tuesday in Spring Hill Ceme tery by the Rev .Hugh E. Nichols. Diuguid Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Rev .Hugh E. Nichols. <mark>Diuguid</mark> Funeral Home was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Rev .Hugh E. Nichols. <mark>Diuguid</mark> Funeral Home was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [919.45, 447.03, 1308.03, 881.5], "bbox_id": "5e798ed249", "file": "TimesVirginian_1984a_0038.pdf", "page": 1, "text": "Mrs, Ahnet Johteon Wileoah UL 2917 LanghernRosd, Lynchburg,- Friday k Vlrgtais B w tìst She w m th i indow fa Dééra She ww bora in Dickenson County, the daughter of the late Roby Johnson and Rachel SotrihfefaT Johnson. b ww a retired employee fa Hfaterfi JohnsonsJRestaurtet and afam nbardf Garden Cliapel Church in Bknfatvflle Tenn. v  v j She is survhfad by three dsufaitèrs, Mrs. Clyde M arw Bmidunnt . fa Concord, Mrs.- David Loisj Msykey fa Madison Heights and rMre. Wflfiam Faye Farrar fa Lynchburg aeven sons, Richard L Wilson, Jam telM Wilson. Ralph B. Wibon. Charles R. Wilson, Guy E. Wilson ted Jerry v- Wilson, all of Lynchburg, and Loriy É. Wilson fa Madfeoo Height two fasters, M rs. V irginia sm ith fa Kingsport Tenn., and Mr? .,  Frasier fa Bristol two brotherjL Rev. Judge B. Johnson fa N,, and C orbett Johnson fa Harrisonburg 14 grandchildren arid four great-grandchildren.  A funeral m rfiri wm conducted from . Diuguid W aterlock . Chapel Saturday at 2 p.m. by the Rev. H. A Enochs, frrtormeut ww ip Fort Hill Memorial Park. Diuguid Waterliek Chapel ww in charge of arrangements m  Galilee churcjrnews nates"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "rfiri wm conducted from . <mark>Diuguid</mark> W aterlock . Chapel Saturday"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "rfiri wm conducted from . <mark>Diuguid</mark> W aterlock . Chapel Saturday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1686.95, 373.89, 1842.62, 558.19], "bbox_id": "51c2f77bae", "file": "AppomattoxNewspapers_1915-1918a_0340.pdf", "page": 1, "text": "Mr Thomas O. Diuguid, aged 69, died yesterday at the Oitv Home, following an ill nees of four hours duration, paralysis being the cause of death. Mr. Dinguid was in os tial health, Monday, and early yesterday morning suffered stroke of paralysis from whioh he never rallied. He is sur vived by one daughter, Miss Aunie Diuguid, of Danville, and two sons, Mr. Conway Diu guid, of Appomattox oounty, md Mr. Robert Diugnid, of this city Lynchburg News."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Mr Thomas O. <mark>Diuguid</mark>, aged 69, died yesterday"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Mr Thomas O. <mark>Diuguid</mark>, aged 69, died yesterday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.7, 430.46, 1817.98, 749.35], "bbox_id": "a275968458", "file": "AppomattoxNewspapers_1955-1957a_0559.pdf", "page": 1, "text": "Mr, and Mrs. Leonard Anderaon and daughters,. Linda and Betty, will spend this week-end at their cottage at Deltaville. Howlette Burge Martin Jr. will arrive today by plane from Colorado Springs, Colorado, for a viist with his parents at their home at Spout Spring. On Sunday Mr. and Mrs. H. D. Wooldridge, Mrs. Hunter Jameraon, Misses Margaret Jane Glenn and Patricia Anne Bentley motored over tiie Skyline Drive. Mr. and Mrs. Watts Moo-re, Mr. and Mrs. Alfred Moore and daugh ter and Mr. and Mrs. Di-ck Martin spent last week-end at Virginia Beach. Supper guests -in the home of Mr. and Mrs. Mundy Moore Tues day were Mr. and Mrs. Claude Jen nings and Mr. and Mrs. Clarence Franklin and Edward. Mr. and Mrs. Richard Martin and daughters, Mr. and Mrs. Bobby Fer guson and Mr. Diuguid Petteraon visited Mr. and Mrs. Thomas Pat terson and daughter on Sunday."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Fer guson and Mr. <mark>Diuguid</mark> Petteraon visited Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Fer guson and Mr. <mark>Diuguid</mark> Petteraon visited Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.27, 804.51, 1779.42, 823.66], "bbox_id": "1f896d50ac", "file": "AppomattoxNewspapers_1939-1943a_0349.pdf", "page": 1, "text": "Mr. and Mrs. Keeling Sisson and family, of Richmond, Diuguid Chris-"}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "Mr. and Mrs. Keeling Sisson and family, of Richmond, <mark>Diuguid</mark> Chris-"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "Mr. and Mrs. Keeling Sisson and family, of Richmond, <mark>Diuguid</mark> Chris-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.67, 629.58, 1873.36, 1220.34], "bbox_id": "79e6eecc91", "file": "TimesVirginian_1978_0407.pdf", "page": 1, "text": "Mr. and Mrs. George A. Martin, Sr. held their Annual Picnic on Monday, September 4,1978.. .from 1 to 7 p.m. The I following friends from New York, New Jersey, Lynchburg, Virginia, Appomattox, Virginia and Philadelphia, Pa. enjoyed the lovely weather and fellowship Mrs. Virginia Hughes, Mamie Briggs, Mr. and Mrs. Louis I Plenty, Mrs. Florence Meyer, I Mrs. Lillie Stevens, Mr. and Mrs. Charles M c C o r m i c k , George W. Barnes, Mr. and Mrs. Leon Stovall, Mr. and Mrs. Paul Miller, Jr ., Mrs. Armeta S. Jordan, Mr. and Mrs. S. D . Ferguson, Mrs. Eva I Allen, George E . Stevens, Robert Watson, Dr. and Mrs. H. S. Diuguid, Mr. and Mrs. A . S. West, Mrs. Patricia Bolling, Misses Dana Bolling, Charade Bolling, Dannette M cCarn, Mrs. Cordelia Davis Pinn, Mrs. Fannie S. Womack, Mr. and Mrs. F . T- Hughes, Mr. and Mrs. William B. Turner, Misses Gwen and Tamara Turner, Miss , Elizabeth H . Jordan, Miss Ruth J Turner, Sir. and Mrs. F . Hallman,Mr. and Mrs. Walter T.  Walker, Mr. and Mrs. William Spencer, Mrs. Reaver A . Spencer, M r. M . W . Thornhill, Jr ., Dr. and Mrs. Harry Ferguson, Miss Bettie I. Davidson, Miss Helen Stevens, Mr. and Mrs. Lawrence A. Ferguson, Miss Robin Lynne Ferguson, Mr. John Watson, Mr. Tony J . Allen, Miss Evelyn Franklin, Mr. and Mrs. Leon A . La wing, Mr. John W. Preston. A delicious menu was served, first franks, hot sausages and hamburgers were enjoyed, then at 4 p.m. the main meal was served.. .barbecue chic ken, minced bar-b-que pork, potato salad, macaroni salad, mixed green salad, crackers, pickles etc. Cake and lemonade."}, "highlight": {"text": {"matched_tokens": ["Diuguid"], "snippet": "and Mrs. H. S. <mark>Diuguid</mark>, Mr. and Mrs. A"}}, "highlights": [{"field": "text", "matched_tokens": ["Diuguid"], "snippet": "and Mrs. H. S. <mark>Diuguid</mark>, Mr. and Mrs. A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
