{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Edward", "Woodson"], "snippet": "D. Isbell, Crawford Jones, <mark>Edward</mark> <mark>Woodson</mark>, T. J. Thornhill, David"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward", "Woodson"], "snippet": "D. Isbell, Crawford Jones, <mark>Edward</mark> <mark>Woodson</mark>, T. J. Thornhill, David"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1608.12, 625.06, 1742.51, 909.66], "bbox_id": "beeca47a11", "file": "TimesVirginian_1980a_0224.pdf", "page": 1, "text": "The marriage of Miss Connie Frances Woodson to Edward Alvin Hall took place Saturday evening, June 28, 7 oclock in Reedy Springs Baptist Church in Spout Spring. The is the daughter anM rs. Sammy T. 4fcM r Woodson of Appomattox and the bridegroom is the son of Mr. and Mrs. Elbert R. Hall of Riistburg. Rev. James E. Simpson, pastor of the church, officiated at the dobule ring ceremony. The bride was escorted by her father and given in marriage by her parenti. Miss Sheerie Covington of Spout Spring was maid of honor. Mr. Hall was best man for his son. The brides dress was fashioned of white qiona and. Venice lace. The empire"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "of Miss Connie Frances <mark>Woodson</mark> to <mark>Edward</mark> Alvin Hall took place"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "of Miss Connie Frances <mark>Woodson</mark> to <mark>Edward</mark> Alvin Hall took place"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [144.24, 924.07, 485.76, 1851.02], "bbox_id": "7113eac1b1", "file": "TimesVirginian_1983a_0043.pdf", "page": 1, "text": "I l PUBLIC NOTICE A b re q u irtd by the Constitution and the Code of V irg in ia, Appom attox County has purged its voter registration records of a ll persons who have failed to vote in at least E one election during the last four consecutive calendar E years. A ccordingly, the persons named on this list have illPutfDNy a f r m J i f f t f T p r n r d B m . -   E ach of ihese persons so nam ed has the righ t to appeal - the deletion of h it name from the voter registration roster if, in fact, he can prove he has voted in any election w ithin the la st four years. Such evidence m ay  be presented in the O ffice of the G énéral R egistrar not latar than ten days from the date of this notice on sny Tuesday or Thursday between the hours of 9 a.m . to 5 1 p.m . or a n t person m ay apply for registration to vote by m appearing in person at th is off ice. Betty K. Ford, G eneral Registrar, Appom attox County laSCourt St., Appom attox, V irg in ia 24522 1 . William Weert ArtlgMs Tressie Ferguson Í1 Viole Sarbeur Austin ,, irono H. Franklin t Frances Gey la Baldwin Virginia Loo Franklin  Rlizábefti Willis Bates Denny Arthur Garrett Alice Woody Bayee , SuoCorbett Garrett I Michael Lowell Balter Carrie P. Gilbert  Joiette Elelne Booker L. E. Giles, Jr.   e  LutherWeihtngtonSooker Dorothy Gobble I Marilyn Leo Booker - Amma Freeman Godsey   Ann Brinkley Boyce  Virginia Dillard Goode JemeeJerry Boyce Leslie B. Goodrich Female Louise Bryant Nancy Hughes Grishew   Marilyn Ruby Buckner , Virginia,S. Hill ,  Mark Alan BurmeWor - Alma Spiggie Harris, f t Barbara Fatsy Buirell Annie Harvey Goodrfoh Frank O. Cawthorne Lonzy Haskins fl, Rachel FvCawthorn Mary Jane HoHmon  Themes Harold Chambers .William Allen Hinter, Jr. J Frances Miles Cheatham Emmett W. Jamerson   petty Brown Childs Robert Joseph Jendzurski Edgar Honry Chilton  Mary Elizabeth Jenkins Ramona Oown Clemmer - Larry Lee jqhss Beverly R. Coleman QueenieJones  Deborah Tomlin Conner Donald Dene Cenipe  Bettye Boxter Crabtree Joseph Raymond Lawson  Alteon Does James Larry Ledford T . Louganie Patterson Doss Jonny Kidd Ltdford v Nettie Ethel Ellor  James Newton Lap Eleonor Fetrlcla Ferrer Carolyn W. Lewis Ronald William Lewis I Thao Boswell Lewis Catotyn Nash Thompson f t Mary Ellin Lucado . Noll Cawthorne Thrdfhor John Thomas Lylo Codi Bryant Tillery, Jr. .t,y f t Ksren Lamoin Lyles Bill NMN Tolbert ft Joseph Winfred Marshall, Jr. Emmitt El wood Tolbert  L. C. Marshall Joseph Scott Tolbert ttaroldMoriin William Anderson Tolbert f t -Inez Blozor Martin HaroktThomesVessar Joel David Martin Lewis Watkins f t Robert HarrlAortln Donna Joyce Webb Phyllis AlmomWMcCormlck George Monroe Webb,  Valetta Sylveste McCoy Claude Newton Wost I Carol AnrtMcFodon Thelma June Baldwin West  Effie C. Moon Ttfomos Arvel West I Thomas Kinckle Moore Ricky Lynn Woods  Cynthia Nan AOorris Giotiys B. Woodson Harry Edward Moses Pamela Sue Worley  waiter Norcross MyrtteHoiland Booker  Hilda Kay Paulette Ruth Hipps Arrington Rlohwrd L. PuMlem Vivian Lorraine Bryant .ft Piney Ragland  . Joan Wright Chenault Harry Wurston Ranson J annette Daniel Christian Marsha Ray Bagby Raid Michael Andrew Covington Jacqueline Clay Robinson Mary Ann Culley - . 1, Bobbl Alton Seey Jonathan Ferguson  Anne Nelson Smith Amy Diano Glenn J. Wittpetin Smith Sherry Ogden Goln John AAtea Smith, Jr. Lonnie Evan Hix Henry Mi Stanley, Sr. Betty Wright Hudsop Howard S. Stanley Doris-Mae Hughes Jan Harriot Stanley James Wesley Hunter ft Mary A. Staples Michael Kent Jamerson Done Herwedia Steppe Linde Kayo Kidd  f Barbera H. Stratton Martha Ellen Maxwell Letia M. Sweeney v  Michael Dean Shorter  . Pauline Wharton Thomas Beverly Christine Tweed"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Nan AOorris Giotiys B. <mark>Woodson</mark> Harry <mark>Edward</mark> Moses Pamela Sue Worley"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Nan AOorris Giotiys B. <mark>Woodson</mark> Harry <mark>Edward</mark> Moses Pamela Sue Worley"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [825.61, 256.73, 984.62, 1166.32], "bbox_id": "a31d6616c6", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "536, Thomas Rosche vlaxey 548, Herbert Lee Moubry 126, Roy all A Brown 786, James Nicholas Wright 755, Cornelius Benj train Taylor 107, George Ernest Booker 616, Hubard Patterson 373, Roy Dew Heckler 775, James Vawter 486, Alfred Lee 692, Emmet Norwood Shores 600, Henry Perkins 810, Robert Washington 507, Guy Mc.Craw 309, El wood Gary 437, Arthur Preston Johnson 604, William Miller Payne 43, orris Andrews 420, Earty Warren Jamerson 514, George Washington Moss 433, Booker Johnson 10, Charlie Agee 487, Gordon Lewis 797, Charles Woodson 140, Edward Booker 432, William Henry Jones 18, Nick Allen 652, Arthur Edw id Rush 739, Gilliam Coy Smith 601, Luther W Patteson 606, William Horsley Perkins 182, Garrett Elwood Catlett 513, George William Moss 46, Alfred Austin 223, Enis Cunningham 117, Bee Brown 602, Willie Oscar Parson 390, Joseph Stuart Hughes 75, Augustine Lee Brooks 772, William Malcolm Trent 721, Frederick vpencer, jr. 786, Richard J White 280, Forrest Richard Etling 757, Thomas Tyree 333, Oscar Gough 379, James Walter Harris 542, James E Miller 194, Harsball Henning Coleman 552, Alexander Cobb Motley 298, Phillip Ford 675, Thearon fceay 343, Roy Willard Gary 726, Waverly Francis Snoddy 15, Furman Hill Agee 452, John Jackson 355, Thomas Ray Guthrie 530, Robert Lee McFadden 609, Gjorge William Wise 645, Massie Lee Ragland 218, French Call 620, William Leak Putney 550, Carson Jefferson Martin 574, John Weetley Newton 31, John Price Anderson 770, Preston Taylor 677, Edward Miller Sheppard 749, Tyler Turner 525, Hubard Mosley 760, Stewart Everett Thomas 183, John Alfred Call 56, William Madison Andrews 792, John Pierce Word Sidney Adcock ..50, Marion Agee Glover 54, David Edward Ayres 549, W ashington Muny 440, Albert Jones, jr. 741, Frank Shoemaker"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Gordon Lewis 797, Charles <mark>Woodson</mark> 140, <mark>Edward</mark> Booker 432, William Henry"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Gordon Lewis 797, Charles <mark>Woodson</mark> 140, <mark>Edward</mark> Booker 432, William Henry"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2178.0, 839.96, 2444.55, 1001.14], "bbox_id": "fa32dad6bb", "file": "TimesVirginian_1980a_0207.pdf", "page": 1, "text": "The wedding of Connie Francis Woodson and Ed ward Alvin Hall will take place June 28.1980 at Reedy- Springs Baptist Church in Spout Spring. The 7 p.m. nuptial will be an open-church affair. All ids and rela friends and relatives are cordially invited to attend. Connie is the daughter of Mr. and Mrs. Sammy T.  - Woodson of Appomattox. . __ -Edward is the son of Mr. and .  J1 ktives art m F j . Elbert R. Hall of invited to attend  . Rltburg."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "and Mrs. Sammy T.  - <mark>Woodson</mark> of Appomattox. . __ -<mark>Edward</mark> is the son of"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "and Mrs. Sammy T.  - <mark>Woodson</mark> of Appomattox. . __ -<mark>Edward</mark> is the son of"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [531.6, 1041.09, 785.9, 1150.05], "bbox_id": "3eebd90522", "file": "AppomattoxNewspapers_1926-1933a_0329.pdf", "page": 1, "text": "Forest Fire Protection DeWitt HarveyFire spppression ............ Hudson HarveyFire Suppression .......... 4 jó I Dean PughFire Suppression . .. .. .............. g oo I Travis Woolridge Fire suppression 3 20 H L. BlackwellFire suppression . ............ 1 001 Courtney WoodsonFire Suppression . . . g oo I Taul Woodson Fire suppression ........ Edward SmithFire suppression............... Eldridge MartinFire suppression . . . . . ."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Woodson", "Edward"], "snippet": "suppression . ............ 1 001 Courtney <mark>Woodson</mark>Fire Suppression . . . g oo I Taul <mark>Woodson</mark> Fire suppression ........ <mark>Edward</mark> SmithFire suppression............... Eldridge MartinFire"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Woodson", "Edward"], "snippet": "suppression . ............ 1 001 Courtney <mark>Woodson</mark>Fire Suppression . . . g oo I Taul <mark>Woodson</mark> Fire suppression ........ <mark>Edward</mark> SmithFire suppression............... Eldridge MartinFire"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [559.91, 1017.6, 781.95, 1126.55], "bbox_id": "16f7ffb703", "file": "AppomattoxNewspapers_1908-1909a_0329.pdf", "page": 1, "text": "Forest Fire Protection DeWitt HarveyFife spppression - ------ - - Hudson HarveyFire Suppression . . . . . . Dean PughFire Suppression . . . . . . . . . . Travis Woolridge Fire suppression J. L. BlackwellFire suppression . . . . . . . Courtney VopdsonFiye Suppression . . . Paul Woodson Fire suppression ........ .. .. Edward SmithFire suppression ..  ........ Eldridge MartiFire suppression . . . . . ."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Courtney VopdsonFiye Suppression . . . Paul <mark>Woodson</mark> Fire suppression ........ .. .. <mark>Edward</mark> SmithFire suppression ..  ........ Eldridge MartiFire"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Courtney VopdsonFiye Suppression . . . Paul <mark>Woodson</mark> Fire suppression ........ .. .. <mark>Edward</mark> SmithFire suppression ..  ........ Eldridge MartiFire"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [262.11, 766.31, 751.05, 930.91], "bbox_id": "35ad3b0b95", "file": "AppomattoxNewspapers_1908-1909a_0182.pdf", "page": 1, "text": "Ocie Ferguson, Florence Marks, Elizabeth OBrien, Lula Smith, Floyd Dinkins, John Harvey, Virginia Chilton, Sara Dickerson, _ _____ 1 I Florence Gilbert, Landis Laug-1 Stratton, who has been in Lynch han, Christine Martin, Samanthal burg for treatment for several that church, Sunday morning  pippin Dorothy Woodson, Will  am Ford, Edward Ramsey, Katherine Chocolate, Lillian Fer- which is, The Relation of Me morial Church to the Communi- I ty of Appomattox., In this I sermon there will be mention made of the spiritual and secu lar interests of every member of I the church. The subject for"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Sunday morning  pippin Dorothy <mark>Woodson</mark>, Will  am Ford, <mark>Edward</mark> Ramsey, Katherine Chocolate, Lillian"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Sunday morning  pippin Dorothy <mark>Woodson</mark>, Will  am Ford, <mark>Edward</mark> Ramsey, Katherine Chocolate, Lillian"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2322.29, 1185.66, 2491.4, 1340.1], "bbox_id": "85abfd4f5d", "file": "AppomattoxNewspapers_1947-1949a_0362.pdf", "page": 1, "text": "Mrs. Alvis was born in Appomat tox County, the daughter pf George Edward and Julia Tuggle Woodson and was an active member of the Hebron Baptist Church, and parti cipated in many community activi ties. Besides her husband, she is survived by two sons, John P. Al vis, Jr. and James Kenneth Alvis  and two daughters, Mrs. T. DeWitt Evans, of Appomattox, and Miss Annie Harvey Alvis, of Richmond, Ky. Deepest sympathy is extended to the bereaved loved nes."}, "highlight": {"text": {"matched_tokens": ["Edward", "Woodson"], "snippet": "the daughter pf George <mark>Edward</mark> and Julia Tuggle <mark>Woodson</mark> and was an active"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward", "Woodson"], "snippet": "the daughter pf George <mark>Edward</mark> and Julia Tuggle <mark>Woodson</mark> and was an active"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [510.95, 572.99, 675.95, 635.49], "bbox_id": "265fe3ca88", "file": "AppomattoxNewspapers_1933-1936a_0530.pdf", "page": 1, "text": "Miss Nettie Drinkard, of Raleigh, N C ., is visiting her sister, Mrs. W .J . LeGrand .  o --- Mr. and Mrs. J . N . Woodson, Mr. and Mrs. Edward Weiss, of Richmond, and the Rev R .C . Welch"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "and Mrs. J . N . <mark>Woodson</mark>, Mr. and Mrs. <mark>Edward</mark> Weiss, of Richmond, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "and Mrs. J . N . <mark>Woodson</mark>, Mr. and Mrs. <mark>Edward</mark> Weiss, of Richmond, and"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2240.18, 671.94, 2372.64, 1262.52], "bbox_id": "ec70fe9d21", "file": "AppomattoxNewspapers_1952-1954a_0574.pdf", "page": 1, "text": "Joyce Ann Davis Shirley Ann Davis Barbara Allyn Doss Loretta Virginia Goggin Shirley Lee Harris Mazie Alice Harvey Lavana Lea Hawley Mary Alice Henry Ceiil Kay Hillsman Barbara Ann Jamerson Barbara Fay Johnson Margaret Lorraine Johnson June Juanita Martin Dorothy Laverne McFadden Martha Lie McFadden Shirley ONeil Mitchell Helen Frances Moore Peggy Virginia Moore Annie Rebecca Moore Mary Louise OBrien Joyce Lee Paulette Merle Elizabeth Reynolds Goldie Mae Rush Opal Jean Smith Stella Agnes Thomas Sandra Gayle Wood Billy Andrew Almond Everette Robert Beale Thomas Benjamin Beasley GíOrffP B Pnolinnnn u r v i g e 2-3. O U V J i Z i i i d t i l William Richard Cheatham John David Chernault Charles Sidney Coleman Samuel Lewis Ferguson Edward Joseph Giles G. Leo Godsey Carlton W. Guill Jesse T. Guill, Jr. Harry Ottoway Guill Willard lrvinf.. III.  Tadd W, Jennings Roland Wayne Lee Bradley Lee Mann Harold Le-wis Martin William Childs Martin r S y v  ?  u  . j  f . . Ó v i .1 VS JHVtit Lewis Edward Moore Roy Donald Nash Richard Howard Nash Robert Clifford OBrien Raymond Braxton Page Edmund L. Patteson Howard Cornelious Phelps Wilton Murrell Routon, Jr. William M. Runkle Lloyd Gray Walton Clarence H. White Paul Edward Wilbun William Carter Woodson Carl Douglas Woody."}, "highlight": {"text": {"matched_tokens": ["Edward", "Woodson"], "snippet": "Clarence H. White Paul <mark>Edward</mark> Wilbun William Carter <mark>Woodson</mark> Carl Douglas Woody."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward", "Woodson"], "snippet": "Clarence H. White Paul <mark>Edward</mark> Wilbun William Carter <mark>Woodson</mark> Carl Douglas Woody."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1299.32, 813.46, 1402.56, 1678.28], "bbox_id": "92fd7ab7d3", "file": "AppomattoxNewspapers_1954-1955a_0075.pdf", "page": 1, "text": "PBW, Ch,,. P. Clover Hill. Powell, J. M. Dead Purdieu, W. D. Transferred House. Perdieu, H. C. Transfer! wood. Robertson, T. P. Dead. Reynolds, Milton R. Ded Robertson, Geo. W. Deal Robertson, Thos. H. Dead. Ragland, S. P. Dead. Reynolds, W. R. Deid. Reynolds, Mrs. Lizzie I red to Court Home. Robertson, Herman E. to Nelson Co. Robertson, Elizabeth. Court House. Spiggle, C. B. Dead. Spiggle, J. W. Transferred stone. Smith, Napoleon. Out of Ce Scruggs, J. W. Transferred 1 er Hill. Spiggle, Robert. Transferredl ville. Scruggs, E. R. Out of Coal Spradlin, R. F. Transferredl pomattox. Spradlin, S. H. Transferred well. Stephens, Geo. T. Transfer Oakville. Smith, C. Rolling. Transient Clover Hill. Scruggs, Louise. Dead. Spiggle, Geo. W. Transfer Walkers Ch. Spiggle, J. H. Transferred M ville. Spiggle, Mrs. Estelle. Trim to Walkers Ch. Thornhill, A. B. Dead. Thornhill, J. H. Dead. Thornhill, C. W. Dead. Turner, C. E. Dead. Turner, G. E. Dead. Turner, E. C. Dead. Thornhill, L M. Transferred land. j Thornhill, Lee. Transferred tel er Hill. Thornhill, 0. W. Transffl Lynchburg. Toddey, H. B. Dead. Trent, T. H. Transferred W ville. Trent, Mrs. Bessie. TransW Oakville. Thornhill, J. W. Transferredl Abingdon. ,  Thornhill, J. W. Transfer Court House. Thornhill, H. C. Transferred Lynchburg. Totty, Leslie. Transferred  ville. Wells, Alonza. Dead. J Wingfield, B. F. Transfe j Lynchburg. Woodson, J. 0. Dead. Woodson, Thos. S. Dead. J Watson, J. F. Transferred! House. Webb, 0. J. Dead. Woodson, Mis. Nora  j Wootton,. W. J. Dead. Watson, Bettie L. Dead. J Woodson, Jacob S. D! prince Edward Watson, Susie L. Court House. , J Wells, Roy W. Transferred Ville. fnjM Woodson, Mrs. NanW  to Prince Edwari."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Bettie L. Dead. J <mark>Woodson</mark>, Jacob S. D! prince <mark>Edward</mark> Watson, Susie L. Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Bettie L. Dead. J <mark>Woodson</mark>, Jacob S. D! prince <mark>Edward</mark> Watson, Susie L. Court"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1118.39, 342.33, 1289.68, 926.66], "bbox_id": "0e6c042359", "file": "AppomattoxNewspapers_1955-1957a_0563.pdf", "page": 1, "text": "First Sergeant Nathaniel Gray Jones and Mrs. Jones. She was two years old at the time of the Surrender in 1865. She is reanarkedly active and mentally alert, and relates in teresting incidents of her childhood and at the same time makes com parisons of Then and Now. In her own words, she tells this story When I was a baby, lying on the floor on a pillow, four Yankee sol diers came by our home. One of them asked my mother how old I was and she told them. Then he ask ed my name and my mother proud ly told him, Emma Lee, named for the General. The soldier c-ursed-and said they killed all babies named after Lee. At that time my Aunt Lou rushed in from the kitchen and said my name was Emma Leeola, which quick thinking on her part saved my life. Mrs. Woodson proudly tells that her late father, First Sgt. Jones, was ordered by General Robert E. Lee to stand up on the buggy and call out and tell the soldiers I have surrendered. She said My father was an un dertaker. While he was delivering a coffin one afternoon, a customer came in and wanted a coffin. I ask ed if he brought the measurements with him and he said he did. I cut the lumber by the measurements, made the coffin and Stained it, made the delivery and collected the 3.00 before my father returned. Mrs. Woodson recalls traveling from Prince Edward County to Ap pomattox in a wagon with her fam ily to witness the Dedication of the New Court House here. She is the mother of three chil dren and one adopted son. Now liv ing is her son in Florida and her adopted son, Leroy Woodson, of Bal timore. Md. Her late husband was a carpenter and he could raise a house as good as anybody, said Mrs. Woodson. For a number of years, Mrs. Woodson was a practical nurse, hav ing nursed in every hospital in Rich mond. When asked how many times she has been a patient in a hospital,"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "my father returned. Mrs. <mark>Woodson</mark> recalls traveling from Prince <mark>Edward</mark> County to Ap pomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "my father returned. Mrs. <mark>Woodson</mark> recalls traveling from Prince <mark>Edward</mark> County to Ap pomattox"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [947.28, 352.91, 1115.01, 543.15], "bbox_id": "b0db71cabf", "file": "AppomattoxNewspapers_1955-1957a_0563.pdf", "page": 1, "text": "Aboarding a PiedSnomt Plane at Preston-Glenn Airport Friday morn ing will be a quaint little lady, low in statue, with a natural wave in her gray hair and a twinkle in her eyes in anticipation of her trip to Cucamonga, California namely, Mrs. E. L. Woodson who is now in her 96ith year. Mrs. Woodson will be ac companied to the Air Pont by Mr. and Mrs. J. W. Jack Martin, whom she has been visiting here frequent ly for a number of years while mak ing her home with a son, Freddie Woodson in DeLand, Florida. She is Mrs. Martins aunt by marriage. Mrs. Woodson, a native of Prince Edward County, was the former Mi Emma Lee Jones, daughter of"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "aunt by marriage. Mrs. <mark>Woodson</mark>, a native of Prince <mark>Edward</mark> County, was the former"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "aunt by marriage. Mrs. <mark>Woodson</mark>, a native of Prince <mark>Edward</mark> County, was the former"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1126.27, 335.65, 1294.29, 623.34], "bbox_id": "799416c485", "file": "AppomattoxNewspapers_1952-1954a_0550.pdf", "page": 1, "text": "Mrs. Mattie Walton Purdum, 89, died April 6 in Front Royal, during a visit with her daughter, Mrs. Har old Stossell. She had been ill for ten days. She was born in Appomattox County, the daughter of the late Thomas A. and Martha Woodson Walton. She was the widow of Edward E. Purdum, and the second oldest member of Liberty Baptist Church. Her body will rest at the church from 1230 until 230 P. M. Thurs day. Graveside services will be con ducted at 300 P. M. Thursday by Dr. Carl A. Collins, Jr., at Liberty Baptist Church Cemetery. Besides her daughter, she is sur vived by four sons, Dr. E. A. Pur- dum, of Hot Springs, Ark. C. W. Purdum, of Niles, Ohio Dr. R. B. Purdum, of Elkins, W. Va.,-and Ru fus Purdum, of Front Royal and three sisters, Mrs. Annie Staples, of Concord Mrs. Ella Jamerson and Mrs. Carrie Moses, both of Appo mattox."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "Thomas A. and Martha <mark>Woodson</mark> Walton. She was the widow of <mark>Edward</mark> E. Purdum, and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "Thomas A. and Martha <mark>Woodson</mark> Walton. She was the widow of <mark>Edward</mark> E. Purdum, and the"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2209.21, 972.6, 2376.27, 1814.46], "bbox_id": "150eb852e9", "file": "AppomattoxNewspapers_1922-1923a_0612.pdf", "page": 1, "text": "Concord.. Miss Grace Gross was hostess to the Friday evening Social Olnb on last Monday night at a call meet ing for the purpose of electing new officers. Muoh important business was transacted after which the fol lowing officer were elected Pres ident, Mrs. R. W. Stratton Vice- president, Miss Jean Howerton Secretary, Miss Helen Hilldrup, Asst. Secretary, Miss Grace Gross, Treasurer, Mrs. W. T. Gross. The Ulub held its usual social meetirg at the residence of Mrs. R. W Stratton, at which the most inter esting feature was the initiation of Prof. J. G. Fisher, which was enjoyed by all, not excepting the Professor himself. Rev. W. B. Jett, who has been snffering so severely with head and ear trouble, is again able to be out and attending to his work. Miss Maggie Wilson, of Lynch burg has been visiting at tbe home of her father, Mr. B. B, Wilson, of this place, Mrs. D. H. Groas is visiting iu the Hill City. Bob Jack, the little sob of Mr. J. M. Carson, who has been so ex tremely ill with pneumonia, was able to be out for the first time yesterday. Miss Anne Steele has leturned from a short stay in Lynchburg. Mrs. A. B. Crate, of Giewe, has been visiting her mother, Mrs. V Hilldrup. Mrs. W. T. Grose aud Mrs. Char lie Staples have returned from Lynchburg, where they attended the burial of their grandmotner, Mrs. Elizabeth Holt, on last Thurs day afternoon. The remains of Mrs. Mary A. Sweeney were brought down from Lynchburg last Monday morning and buried at th old home bury ing ground, near Goncord, at 2 p m of the same day. The children of Goncord enjoyed a delightful candy stew at the old store House of Mr. R. W. Stratton last Saturday. Those present were Louise Akers, Viola anil Mary Jett. Annie Stratton, Beulah Woodson Carrie and Loveline Staples, Nan cy Paul and Viola Jamerson, Car roland Herman Ould, Bruce ad Holt Str.ples, Lyle Woodson, Hill drup Stratton, Bennie Wilson and Edward Mayberry. Miss Ethel Anderson, of Lynch burg has been visiting Miss Nellie Abbott Miss Daisy Callahan is at Mrs. W. G. Akers for  short visit. Miss Mary Holt, of Lynchburg has been visiting Mrs. W. T. Cross at her home here."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "ad Holt Str.ples, Lyle <mark>Woodson</mark>, Hill drup Stratton, Bennie Wilson and <mark>Edward</mark> Mayberry. Miss Ethel Anderson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "ad Holt Str.ples, Lyle <mark>Woodson</mark>, Hill drup Stratton, Bennie Wilson and <mark>Edward</mark> Mayberry. Miss Ethel Anderson,"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2126.4, 368.78, 2282.13, 912.31], "bbox_id": "680bd14ff8", "file": "AppomattoxNewspapers_1952-1954a_0549.pdf", "page": 1, "text": "Mrs. Thomas Reed, April 22. Mrs. Claude Elder, April 29. Ernest Reed, April 30. Miss Odelle Blackwell, April 1. Mrs. Ella Jamerson, April 1. Mrs. Bennie Beale, April 13. Mrs. Calvin Robinson, April 12. Eleanor B. Wooldridge, April 28. Norman E. Wooldridge, April 10. Mrs. Annie C. Babcock, April 21. Mr. iSamuel Collins, April 21. Mrs. Jack Williams, April 3. Tiny Cyrus, April 3. Jerry Cyrus, April 14. Doris Baldwin, April 9. Earl Wayne Baldwin, April 14. Mable Webber, April 9. Mrs. Clarence Webber, April 26. Mrs. Juilan Garrett, April 18. Mrs. J. P. Johnson, April 4. Mrs. J. P. Johnson, Jr., April 9. Dianne Johnson, April 7. Elaine Wilbun, April 11. Ruth Slagle, April 6. James Terry Garrett, March 27. Miss Janie Woodson, April 12. Linda Carol OBrien, April 9. Edward F. OBrien, April 29. Hester Ayers, April 7. Donnie DeGrange April 12. Mrs. E. P. DeGrange, April 19. Jerry Ayers, April 26. Mrs. Harry Ferguson, April 21. Joyce Marie Nester, April 8. T. M. Ford, April 12. J. A. Gilley, April 29. C. K. Hunter, Jr., April 18. Miss Frances Smith, April 10. A. T. Inge, April 16. Mrs. D. A. Conner, April 16. Anne Evans, April 11. Mary Watt Stanley, April 22. Betty Hamner Harwood, April 14 Richard Leigh Burke, April 20. Dr. L. L. Gayle, April 18. W. H. Guill, April 22. Mrs. Fred Smith, April 26. Mrs. F. W. Hanenkrat, Sr., April 30. Mrs. W. L. Turnes, April 27. Dennis Turnes.Brown, April 26. Miss Lucy Smith, April 26. Carroll Goodrich, April 19. Mrs. Leslie Goodrich, April 10. John P. Taylor, April 17."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "March 27. Miss Janie <mark>Woodson</mark>, April 12. Linda Carol OBrien, April 9. <mark>Edward</mark> F. OBrien, April 29."}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "March 27. Miss Janie <mark>Woodson</mark>, April 12. Linda Carol OBrien, April 9. <mark>Edward</mark> F. OBrien, April 29."}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2074.7, 705.79, 2396.29, 1025.06], "bbox_id": "60a1213673", "file": "AppomattoxNewspapers_1902-1905a_0476.pdf", "page": 1, "text": "again. It used to be considered that only urinary troubles were to be traced to the kidneys but now modern science proves that nearly A rie lle . I all constitutional diseases have their begin There is au epidemic of mumps in  nl8ln kidney trouble.  r 1 If you ate sick you ci this locality. Mrs. B. H Woodson has bten sick for several days. Maser Edward Co tilling hum is in Richmond under ttbi.uneiif. Mr. V. if. Aioiia t was ill tiiir Ueighborhoo i last w  k. Mr. . R. M ickle is now on  visit o Appoma lor. Mr. Louiinr-y Voodon, of API1 maltox, w a s v i c i i i i i g fnetnls h i m relatives near tins place lutt wnek. Misses Loll i i Woodson, Nuniii Mickle and Mr. Courtney Woodeo were the guests of Miss Lizzie Oake lust Sunday and Monday. Mestrs C. R. Mickle and J . A Oakes sold tobacco last week and un well satisfied with the pr.ee. A mink visited the home of Mi.-v Nannie Mickle in this . ectiou and killed several ducks ami chicken- last week."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "locality. Mrs. B. H <mark>Woodson</mark> has bten sick for several days. Maser <mark>Edward</mark> Co tilling hum is"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "locality. Mrs. B. H <mark>Woodson</mark> has bten sick for several days. Maser <mark>Edward</mark> Co tilling hum is"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2187.31, 731.52, 2433.89, 1026.65], "bbox_id": "773cc6837b", "file": "AppomattoxNewspapers_1902-1905a_0477.pdf", "page": 1, "text": "A telle. There is an epidemic of mumps in I nlIJS ln kidney trouble. r c  If you are sick you c this locality. Mrs. B. H. Woodson has been sick jor several days. Maser Edward Cnuuinghum is in Richmond uuder tii..linent. Mr. W. il. .tiwriiii was in till iieigliborlion I las, w ck. Mr. . It. Mickle is now on  visit in Appouia in. Mr. Couriney Woodion, of Api,n mattox, w a s viriiing friends him relatives near tins place laflt wnek. Misses Loll it Woodson, Nuiitii1 Mickle and Mr. Courtney Woodeo were the guests of Miss Lizzie Oak- last Sunday and Monday. Mesirs C. R. Mickle and J. A Oakes sold tobaccu last week and hi well satisfied with the pr.ee. A mink visited the iioiue of Mi. Naunie Mickle in this  eotiou nil killed several ducks aud chickein last week. Sw"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "locality. Mrs. B. H. <mark>Woodson</mark> has been sick jor several days. Maser <mark>Edward</mark> Cnuuinghum is in Richmond"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "locality. Mrs. B. H. <mark>Woodson</mark> has been sick jor several days. Maser <mark>Edward</mark> Cnuuinghum is in Richmond"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.79, 1345.88, 1662.85, 1684.48], "bbox_id": "a4964ed2f6", "file": "AppomattoxNewspapers_1918-1922a_0056.pdf", "page": 1, "text": "The ladies of the Presbyteri an church of Evergreen will give a lawn party Saturday evening at 8 oclock. The pub ic is cordially invited to at tend. The Price of Our Redemption will be the subject of the ser mon at Memorial church Sun day. We invite all, who will, to come to this service. Sun day school at 10 a. m. Dr. J. Wiley Bledsoe is visit ing at the home of Mr. A. H. Clement. The doctor is now attending a meeting of the Trustees of R a n d o lp h - Macon School system at Ashland this week. M i s s Louise Carwile of Prince Edward, Miss Carrie Jordan of Charlotte, Misses Hettie and Cornelia Woodson of Rustburg, were guests of Misses Lougenia and Gladys Patteson for the commence ment."}, "highlight": {"text": {"matched_tokens": ["Edward", "Woodson"], "snippet": "Louise Carwile of Prince <mark>Edward</mark>, Miss Carrie Jordan of Charlotte, Misses Hettie and Cornelia <mark>Woodson</mark> of Rustburg, were guests"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward", "Woodson"], "snippet": "Louise Carwile of Prince <mark>Edward</mark>, Miss Carrie Jordan of Charlotte, Misses Hettie and Cornelia <mark>Woodson</mark> of Rustburg, were guests"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1668.22, 661.08, 2004.89, 735.93], "bbox_id": "efd16803e7", "file": "AppomattoxNewspapers_1939-1943a_0444.pdf", "page": 1, "text": "Johnny Jeris Moore, Wilson Drewry Scruggs, Eugene Arnold Cuneo, Ed- Adams, Holland McLain Cyrus, Ran- ward Herbert Baldwin, William Her- dolph Deleware Guill, Ernest David- I bert Richardson, John Clifton Har- son, Ryland Wilson Staples, Charlie vey, William Rouse Mann, James E Perdieu. Francis Edward Hamil- Morton Fulcher, Paul Cheatham ton volunteered, Jack Thomas, Woodson, John William Crews, Price, Walter Leonard Eagle, Jesse Thomas Pervis Almond, Arthur Allen Malcolm Inge, Curtis William Blackwell, Robert Burl Smith, Tyler"}, "highlight": {"text": {"matched_tokens": ["Edward", "Woodson"], "snippet": "James E Perdieu. Francis <mark>Edward</mark> Hamil- Morton Fulcher, Paul Cheatham ton volunteered, Jack Thomas, <mark>Woodson</mark>, John William Crews, Price,"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward", "Woodson"], "snippet": "James E Perdieu. Francis <mark>Edward</mark> Hamil- Morton Fulcher, Paul Cheatham ton volunteered, Jack Thomas, <mark>Woodson</mark>, John William Crews, Price,"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2166.48, 852.71, 2300.87, 1084.7], "bbox_id": "549d8780a2", "file": "TimesVirginian_1980a_0218.pdf", "page": 1, "text": "Miss Connie Frances Woodson was honored with a miscellaneous shower at the home of her grandmot her, Mrs. Rachel Mitchell, on June 23. Honoring Miss Woodson were her aunt, Mrs. Sandra Woodson, and great aunts, Mrs. Dorothy Hunter and Mrs. Christine Harvey. Guests included Mrs. Sammy Woodson mother of the Bride, and Mgs. Rachel Mitchell, grandmother of the bride, as well as numerous relatives and friends. Miss Woodsons marriage to Mr. Edward Alvin Hall wa. an event of Saturday, June 28 at 7 p.m. inReedy. Springs Baptist Church, - Spout Springs."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Edward"], "snippet": "relatives and friends. Miss <mark>Woodson</mark>s marriage to Mr. <mark>Edward</mark> Alvin Hall wa. an"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Edward"], "snippet": "relatives and friends. Miss <mark>Woodson</mark>s marriage to Mr. <mark>Edward</mark> Alvin Hall wa. an"}], "text_match": 1157451436678709369, "text_match_info": {"best_field_score": "2211880894464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436678709369", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [563.34, 951.38, 1332.84, 1055.05], "bbox_id": "a7f18382f7", "file": "AppomattoxNewspapers_1908-1909a_0143.pdf", "page": 1, "text": "you m aUng 150 weekly! near you without experlenSH U mer Medicines a ed homrfiljl You drive your own oar or Mal anddo business on our ospitai M permanent-business tor farmery Mrs. Edward Van Dusen and son, Mrs. H. L Daugherty and son, Bruce, of Youngstown, O., Miss Viola Woodson, Mr. Wyatt Mays, Mr. Thomas Richardson and Mrs. Claude Harvey and son, of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "permanent-business tor farmery Mrs. <mark>Edward</mark> Van Dusen and son,"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "permanent-business tor farmery Mrs. <mark>Edward</mark> Van Dusen and son,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [585.05, 246.72, 736.76, 912.89], "bbox_id": "cafbc4e37f", "file": "TimesVirginian_1976_0394.pdf", "page": 1, "text": "With the Vice President Dr. Merwyn Williamson presiding in the absence of the President, Mr. Gilbert Lusk, the Appomat tox County Historical Society held its regular October meeting recently. The resignation of the President, due to a transfer of professional duties to Gettys burg National Park was accepted with regrets. Highlight of the October meeting focused on a seven hundred dollar donatimi for historical research from the Woodmen of the W orld, donation of 1914 news articles and other documents concern ing the late Congressman Henry D. Flood, and the Birth Pangs of Appomattox County depicted in a talk by Mr. Ron Wilson. Mrs. Harry Clark Rucker presented the Flood news articles to the Glory of God and to the members of the society. To her the beauty of any possession is dependent on  the degree to which it is shared i with others. Amy possession to predoifl to share is not worth  having. The thing then becomes j the master of the man. Mrs. Rucker, the former j Helen Nowlin, the great-grand-1 daughter of Lawyer John Woodson whose office is one of ! the restored buildings at J Appomattox National Park, is i the daughter of the late Annie ! Thornhill and Albert Sidney ! Nowlin. Her mother, from the I Hollywood area of the county, and her father, from the! Oakville area, are widely j related throughout the county. The firuest speaker for the evening, Ron Wilson, Historian at Appomattox Court House Rational Historic Park, spoke on th e Birth Pangs of Appomattox County,1845 - 1870. The speech, based on research, one by Dr.  John Moore, Research H istorian, University of Virginia, depicted the February 8,1845 birthing of Appomattox County from the parent counties of Buckingham, Campbell, Prince Edward and"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "daughter of Lawyer John <mark>Woodson</mark> whose office is one"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "daughter of Lawyer John <mark>Woodson</mark> whose office is one"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.58, 244.26, 1891.16, 589.08], "bbox_id": "495f1d1e88", "file": "AppomattoxNewspapers_1971-1973a_0249.pdf", "page": 1, "text": "William Edward Dickerson, 93, of Spout Spring, died Tues day at his hom e. He was the husband of the late Nannie Mor ris Dickerson. Born in Appomattox County, he was a son of Elijah Thomas Dickerson and Sallie Woodson Dickerson. He was a member of Salem United Methodist Church. He was a merchant in Spout Spring for 55 years. He is survived by three sons, Claude M. Dickerson of Spout Spring, Earl H. Dickerson of Lynchburg and W. E. Dickerson Jr. of Chatham six daughters, Mrs. H. B. Martin, Erna Dick erson of Spout Spring, Mrs. H. C. Babcock of Lynchburg, Mrs. E. W. Elkstrand of Alexandria, Mrs. E. H. Frazier of Altavista and Mrs. G. M. Turemau, Jr, of Richmond five sisters, Mrs. J. P. Scruggs of Elkton, Mrs. Mit- tie Wooldridge and Mrs. D. S. Evans of Lynchburg, Mrs. M.H. Jones of Princeton, W. Va.,and Mrs. E. H. Howerton of Logan, W. Va., 17 grandchildren and nine great-grandchildren. Funeral services will be con ducted at 2 p.m. Thursday to-"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "William <mark>Edward</mark> Dickerson, 93, of Spout"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "William <mark>Edward</mark> Dickerson, 93, of Spout"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [383.05, 686.11, 558.35, 1246.51], "bbox_id": "e7b6467032", "file": "AppomattoxNewspapers_1908-1909a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. fith.grade, Touiae Lewis, Cur- tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, Eli zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, I Garland Harding. 1st grade, Mabel Martin, Ola Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb.Oarl Carson. I A p pomattox A. H. S. 4th year, Luciile Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary Jamerson, Louise Scruggs, Floyd Dinkins. 2nd year. Verta Simms, Hallie Chilton, Kathleen Paulette, Dora Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman- I tha Pippin, Homer Babcock, Edith OBrien, I 1st year, Bertha Rogers Fay I Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, i Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw-"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Dolly Carson. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Billy"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Dolly Carson. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Billy"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [387.33, 695.11, 568.88, 1670.83], "bbox_id": "ffd7552000", "file": "AppomattoxNewspapers_1926-1933a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. 5th grade, Louise Lewis, tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, Garland Harding. 1st grade, Mabel Martin, Ola I Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb, Carl Carson. A ppomattox A. H. S. 4th year, Lucille Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary I Jamerson, Louise Scruggs, I Floyd Dinkins. I 2nd year. Verta Simms, Hallie I Chilton, Kathleen Paulette, Dora I Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman tha Pippin, Homer Babcock, Edith OBrien, 1st year, Bertha Rogers Fay Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw ley, John Hesson, James Morris, Charles James, Holcomb Cald well. 7th grade, Lucille Crailt, Eve lyn Dickerson, Adelina Fergu- Ison, Josephine LeGrand. j 6th grade, Mandane Anderson, Nellie Bloxton, Carrie Jamerson, I Hilda Moore, Eloise OBrien, I Claudine OBrien, Mary Smith, I Elizabeth Trent, Billie Hubbard, I Garland Plunket. 5th grade, Ruby Cole, Marion Agee, Margaret Carter, Eliza beth Cralle, Mary Clark, Leilas Davis, Mabel Hall, Thelma Mor ris, ary McNally, Annie Mar shall, Mabel Smith, Dorothy Tweedy, Elliott Torrence, Ray mond Jamersoh, Lawrence Moore, Harry Lee. 4th grade, Geneva Wingfield, Willie Guthrie Anderson, Erna Dickerson, Loraine Handy, Christine Caldwell, Roberta Dinwiddle,  Edith Franklin, Cecil Torrence, Billy Smith, John Cole, Charles Guill, Davie Carter. . 3rd grade, Anna Carter, Yir- I ginia Christian, Edith Cole, Net- I tie Davidson, Olla May Dinkins, Hattie Guill, Virginia Epes Irby, I Edith Lucado, Susie Plunkett,"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Dolly Carson. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Billy"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Dolly Carson. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Billy"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [258.0, 304.38, 417.2, 518.12], "bbox_id": "b14db7feee", "file": "AppomattoxNewspapers_1902-1905a_0093.pdf", "page": 1, "text": "Venner. Several speak of at.endiug the Lynchburg carnival ou Monday liexi, Mr. Courtney Woodson, near Hun dley Spring, was the guest of lii sister Mrs. JohiT Oades, on Saturday and Sunday last. Mr. B. T. Kosser made a business trip to Lynchburg Saturday lust. Mr. Henry Womack visited his sister, Mrs. Edward Robertson, near Charlotte C. H., a few days ago. Miss Nannie Michle is visiting friends and relatives in Appomattox. Mr. Waverly Franklin, of Char lotte, was the guest of his uncle Mr D. G. Womack, near this place, a few days ago."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Monday liexi, Mr. Courtney <mark>Woodson</mark>, near Hun dley Spring,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Monday liexi, Mr. Courtney <mark>Woodson</mark>, near Hun dley Spring,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.75, 451.28, 2378.85, 697.9], "bbox_id": "821a5fa304", "file": "AppomattoxNewspapers_1908-1909a_0572.pdf", "page": 1, "text": "V era H onor Roll Grade IBlanche McChon- cie, Emma Catherine Garrette, Thomas Woodall,  Stratton Franklin, Joseph Watson, Ruth Carter, Gertrude Franklin. Grade IIKatherine Wood- all, Dorothy Ferguson, Doris Lee Reynolds, Carrington Mar tin, Robert Edward Trent, Har ry Steffans. Grade IIIEarl Goweri, Hi ram OBrien, Frank Woodall, Eula Mae Carter, Ila Jean Car ter, Marion Drinkard, Roberta Robertson, Irene Trent, Helen Fay Turnes, Doris Watson, Ka tie Woodson. - ------------ -o --------- j Dillwyn, April 12.-There will be an Easter dance at Dill wyn Lake Friday night of this week. . ."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Carrington Mar tin, Robert <mark>Edward</mark> Trent, Har ry Steffans."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Carrington Mar tin, Robert <mark>Edward</mark> Trent, Har ry Steffans."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [186.95, 307.87, 354.57, 1084.75], "bbox_id": "5a37fae10a", "file": "AppomattoxNewspapers_1902-1905a_0235.pdf", "page": 1, "text": "V e rn ier. Christmas was imcsnally quiet but very pleasant, and now the new rear has oeguu, we are ready foi work and duties of various kinds. Mrs. Ernest llsser left foi hi home in Newport News last week Mrs. it seer Ims a wide circle oi friends here ahd ilse here,add she .ill be greatly missed by old am. vouug. We will gladly welcome her backtô lier fofiibèr hhflHfat any tinte. Mr, and Mfs. IL I. Baker were guests of their father, Mr. ltobei Baker, last Saturday and Sunday. Mies Lizzie Reynolds returner back to her school at this plac- Mouduy, ufter spending Chris ma at her home near Prospect, much U the d light of her many friends. Miss Béftlah Bikerspeiit seÇfeta days w.th her little cousins, Jess i May and Lucite Walker, of Pamplii City. Mrs Bettie Motl-y returned to bet horn- a few days ago, afie  a very pleas mt visit to Lynch urg, R.a nuke and other points. Mrs. Ben Woodson continuer qui e sick at her home near here We wish for her a speedy recovery Mr. Erie Glenn, of Prospect, spent several days last week with hi c tusin, Mr. J . W. Glenn, of thn place. Misses Daisy atd Edna Baker, who have been visiting their mother and father, Mr. and Mrs. Marsh It Buker, mar Vincen , returned t their home in Richmond las. Sa ur- day. Mr. D. G. Womack, of this place, spent la t week with his daughter Mrs. Edward Robertson, of Charlotte Courthouse. Mrs. Robersons three children were poisoned from eating canned corn, but we a e glad to Bay they gre all out of danger and are getting on ve y nicely now under the skill ful treatment of Dr. Gibbs, of Char lotte Courthouse. M iss Lizzie Baker last week spen sever 1 days in Appomattox. Sbe was the guest of her cousin, Mist Eyie Puule te. She reports a pleas ant, .time. Mrs. Jim Franklin, who has been with her mother, Mrs. Robert Oakes for the past three monthc, expects to leave for her home in Baltimore jn a few days. Best wishes for a happy and suc cessful new year for T h e T imes . January 11, 1904."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "other points. Mrs. Ben <mark>Woodson</mark> continuer qui e sick"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "other points. Mrs. Ben <mark>Woodson</mark> continuer qui e sick"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [676.09, 207.84, 837.5, 1114.03], "bbox_id": "66d6182769", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "tox r f d 4 688 Howard D. Appomattox r f d 4 539 Robert Peniz, 540 Albert Daniel Beckham 541 Judge Hayse McDaniel, Bent Creek 642 John James Humbl-s, Vera 543 Frank Moses, Appomat tox r f d 4 544 John William Trent, Ap pomattox r f d 4 545 William Edward Patter son, Appomattox 546 Matthew Madison, Oak ville 547 Robert Larkin McDaniel, Bent Creek 548 William David Ferguson, Appomattox r f d 4 649 Jesse D. Booker, Oakville r f d 1 550 Robert Hubert Woodson, Bent reek 551 Fleming Martin, Oakville r f d 1 552 John Clarence Spiggle, Appomattox 553 William Broadus Taylor, Appomattox 654 Fiecell McKinley Parks, Vera 555 John Alex Harris, Appo mattox r f d 4 556 Richard Braury Cole man, Bent Creek r f d 1 557 Thomas Underwood Oil bert, Vera r f d 1 558 Thomas Kenneth Moore, Oakville 559 William Joseph Dixon, Bent Creek 560 Samuel Bernard Page, Appomattox 561 William Thomas Deaner, Oakville r f d 1 562 Ernest Wilson Smith, Bent Creek 663 William Clay Bell, Oak ville 564 Major Perry Cumbie,Ap pomattox r f d 4 565 Hubert Hunter Cald well, Appomattox r f d 3 566 Irby Banks Wheeler, Ap pomattox 567 Frank Lee W oolari, jr. Appomattox 568 Charlie Berkley Perdieu Bent Creek 669 John Wesley Moss, Appo mattox 570 Taylor Horsley Coleman Appomattox 571 Samuel Alviu Bell, Oak ville 572 Herbert Moore, Beckham 573 Henry Gibbs Martin Beckham 574 Howlett Burge Martin Oakville 575 Judson Crawford David son, Appomattox 576 Charles Baxter Page Oakville"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "d 4 545 William <mark>Edward</mark> Patter son, Appomattox 546"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "d 4 545 William <mark>Edward</mark> Patter son, Appomattox 546"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1811.99, 685.33, 1981.18, 1755.67], "bbox_id": "153f7927b0", "file": "AppomattoxNewspapers_1905-1912a_0112.pdf", "page": 1, "text": "The new school at Oakville held ta first commencement exeroiaes on the 3rd, 4tb and 5th of April. The bonse was crowded to overflowing and mnoh enthusiasm was shown by the patrons as well as the pnpils. On Sunday night the 3rd, Rev. H. T. Allison preached a most ex cellent edncational sermon whioh was enjoyed by all present. On Monday night the small chil dren entertained the crowd with recitations, songs, drills and panto mimes. Master Dnrnard Thomas antomimed Old Black Joe, and also reeited A Burlesque on Wom ans Rights, whiebbrought down the house. Dnrnard is a talented boy and imitated a  darkey so well that some of the visitors really thonght he belonged to that race. After the exroisea Mr. R. F. Burke made a most interesting address on schools and the importance of ed ucation. He also presented the prises to the pnpils of the primary room. May. Harvey received the prize on spelling, Cornelia. Woodson, writing, Hettie Woodson, reading and Alex Btarria, arithmetic. On Tuesday night the grammar and high school department held 8way. The exeroise opened with America, whioh was snag and pantomimed by the school. Mr. James Lueado made the salutatory address which was enjoyed by all. James is a cool-headed speaker and haa talent that ie worth cultivating. Again, we had recitations, drill, marches, dialogues, pantomiems and tableanx. Special mention ahonld be made of Mr. William Albert Owen w h o declaimed Patrick Henrys famous speech end wcaclao valedictorian. He poaesses rare oratorical powers and held the au dience spellbound. At the beginning ot the session Hon. A. F. Thomas gave 10.00 with whioh to bay books as prises for the students. Midi Myrtle Thomas received the prises on geography and physiology, Miss Ethel Marsh on reading and com position, Miss Mary Harris, on grammar and arithmetic, Miss Go- lena Martin, composition, Mr. Tom Owen and Miss Myrtle Thomas tied tor the history prise, so it was divided between them. Mi sea Lois Lueado and Mary Harris each re ceived a prize on writing and Mr. William Albert Owen received the debaters prise. The scholarship mfcdal offered by Messrs. Ferguson, Owen and Thomas, was awarded to Miss Mary Harris. Prof. J. G. Fisher, of Stonewall High School delivered the medal. The music rendered by Messers. Edward and Lndwell Childress, on the violin and banjo added mnoh to the occasion These musicians are both talented and accomodating. The exercises closed with  Oakville High School, one of the school songs. The school made rapid progrrss daring the short time it was in ses sion only three months end thir teen days. Mnch credit is dne to the Principal Mias Frances Moss, and her sister Miss Mattie, in tbe training of these pupils. May this school grow better year by year and in time become one of the best in the State."}, "highlight": {"text": {"matched_tokens": ["Woodson", "Woodson"], "snippet": "prize on spelling, Cornelia. <mark>Woodson</mark>, writing, Hettie <mark>Woodson</mark>, reading"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Woodson"], "snippet": "prize on spelling, Cornelia. <mark>Woodson</mark>, writing, Hettie <mark>Woodson</mark>, reading"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.76, 660.42, 1812.63, 1080.8], "bbox_id": "50a1d2dd92", "file": "TimesVirginian_1976_0382.pdf", "page": 1, "text": "The marriage of Miss Greta Renee Woods to John Edward fones took place at 630 Saturday evening in Diamond Hill Baptist Church. The bride is the daughter of Mrs. Yvonne W. West and Bernard R. Woods of Concord and the bridegroom is the son of Mrs. Willie B. Jones of Appomattox and the late Mr. Jones. The Rev. Haywood Robinson, pastor of the church, officiated at the double ring ceremony. A program of nuptial music was presented by Mr. Hiawa tha Johnson and Mr. Timo- theues Lawing. The bride was escorted and given in marriage by her father. Mrs. Jesse Payne of Concord was matron of honor and Miss Valerie Clark of Rustburg was maid of honòr. Attendants were Mrs. Jacqulyn McCoy and Mrs. William Woodson of Concord, cousins of the bride, Miss Celia Austin and Miss Doris Austin -ef -Appemattox, cousins of the bridegroom, nd Miss Brenda Porter, Miss Phyllis Porter and Miss Karen Ware of Lynch burg. Warren Lamberth of Appo mattox was best man, and sènior ushers were Raymond Washington of Blackstone and"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Renee Woods to John <mark>Edward</mark> fones took place at"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Renee Woods to John <mark>Edward</mark> fones took place at"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.18, 453.89, 2435.94, 596.46], "bbox_id": "f27b4244d5", "file": "TimesVirginian_1978_0281.pdf", "page": 1, "text": "The Appomattox High School Class of 1928 held their 50th reunion on Saturday, June 10th. Attending? shown above, front row, left to right, were Susie Moon Martin, Mary Jamerson Har . Onormorreei Wright Witt, Helene Welch Harvey, teacher Landis Laughan Kofeldt, Sarah Dickerson Ekstrand, Lula Smith Jamerson and on back row, left to right, Floyd Dinkins, Marshall Stratton, Lucy LeGrand Furney, Florence Marks Ranson, Christine Martin Moore, Elizabeth OBrien Bendler, Evelyn Cullop Ferguson, and Blance Babcock Poe. Class members not attending were Hallie Burnett Harlow, Kathryn Chocklett Bailey, Ocie Ferguson Brown, William Ford, Francis Hamilton, and Dorothy Woodson Martin. Deceased members are Lillian Ferguson Paris, Florence Gilbert Coleman, Rebecca Harvey, Samantha Pippin Clifton, Louise Scruggs Marshall, John Harvey, and Edward Ramsey. Teachers present but not in photo were Elaine McDearmon Spencer and Kate OBrien. Gladys Morton, teacher, was not able to attend. Class of 1928 Holds Reunion"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Francis Hamilton, and Dorothy <mark>Woodson</mark> Martin. Deceased members are"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Francis Hamilton, and Dorothy <mark>Woodson</mark> Martin. Deceased members are"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1911.22, 1253.22, 2074.15, 1811.85], "bbox_id": "d36357b84a", "file": "AppomattoxNewspapers_1892-1898a_0073.pdf", "page": 1, "text": "Teachers E xam ination. Examinations for the white teach ers for the white schools of Appo mattox opened Angnst 15th, 1893, with the following applicants pres ent Misses Rosalie Wheeler, Judith W. Coleman, Grace L. Watts, Sallie M. Bnrke, Maggie S. Smith, Cora Blox- ton, Eunice S. Cheadle, Bertha Wool dridge, Sallie E. Bice, Evie F. Conch, Pattie F. Womack, Onie S. Jennings, Myrta M. Woodson, Sallie Dawson, Lula V. Dawson, Addie Dawson, Mattie S. Moss, Alpha A. Feather ston, Juddie E. Coleman, Helen L. Abbitt, Maggie V. Chilton, Anna B. Moss, Mattie A. Coleman, Lucy C. Thornhill, Maggie Thornhill, Etta Bloxton. Messrs. C. F. Morton, H. 9. B. Martin, F. W. Swan, Fred C. Hunt. Miss Bose -Womack, of Prince Edward, a full graduate of the State Female Normal School at Farmville, Va., presented her diploma and signed the teachers blank. She is preparing to submit an application for a school. The number of applicants present promises ns a sufficiency of teachqfs. An expert, while looking on, re marked that the schools of Appo mattox must be on the upward march for those in attendance evinced much intelligence and a remarkable im provement, and that their appearance was splendid. Our representative can most heartily echo these words of praise. Mr. Chap. Chiltou deserves to be highly commended for-the careful discipline he exercises over these ex aminations. He is evidently deter mined that they shall be a fair and honest test, and every one should ac cord him a well-merited approbation."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "S. Jennings, Myrta M. <mark>Woodson</mark>, Sallie Dawson, Lula V."}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "S. Jennings, Myrta M. <mark>Woodson</mark>, Sallie Dawson, Lula V."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2309.2, 838.2, 2479.04, 1362.98], "bbox_id": "c5009e330b", "file": "AppomattoxNewspapers_1952-1954a_0275.pdf", "page": 1, "text": "tatory, using as her subject, Man, the Noblest of Gods Work. Miss Rebecca Babcock will give the Vale dictory, using the subject, Creators of the Future. The speaker of the evening will be introduced by Robert Burkey. Mr. Harry Green, of Lynch burg, will make the address to the Seniors. Principal H. E. Kerr will award diplomas to the graduates. Musical selections will be rendered by the class. Members of the class are Edward Earl Agee Samuel Hendricks Almond Robert Lamont Burkey Francis Frederick Carr, Jr. James Robert Dinkins Henry Allen Do a Jackson Delaware Doss Jesse Payton Harvey Kenneth Warren Jamerson Maymbad L  ter Mitchell Hunter Maraou Moore Richard Eugene Smith David Wilson Spiggle John Henderson Stratton Don Wilson Thornhill Joseph Franklin Vaughan James Ray Wingfield William Carter Woodson Rebecca Lou Babcock Betty Faye Burks Louise Gills Burnett Sallie Lee Campbell Dorothea Minor Meredyth man Sara Ann Cyrus Mattie Lora Fleshman Barbara Anne Gilbert Elizabeth Lena Hanenkrat Norma Christine Herndon Sara Elizabeth Irving Bettie Jane Layne Joyce Irene McCormick Shirley Anne McCormick Mary Anna Megginson Lucy Burns Patteson Frances Viola Ragland Peggy Merle Taylor Mary Elizabeth Trent Bertha Louise Wheeler Margie Ann Woodson."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "of the class are <mark>Edward</mark> Earl Agee Samuel Hendricks"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "of the class are <mark>Edward</mark> Earl Agee Samuel Hendricks"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.6, 522.05, 2058.6, 898.49], "bbox_id": "7d47d7ac7b", "file": "AppomattoxNewspapers_1952-1954a_0297.pdf", "page": 1, "text": "Substantial decreases were shown by King and Queen 14-1, Prince Edward 11-1, Alleghany 11-2, and Spotsylvania 20-9. On the other hand, deaths rose considerably in Hanover 15-29 and Dinwiddle 7-16. Both Elizabeth City and Warkick entered the statue of cities during the year but each showed healthy reductions. For the cities, Richmond led with 26 deaths although Staunton, with three, had the worst rate based on deaths per 100,000 population. In the above-50,000 population group decreases were shown by Roanoke 9-71, Norfolk 23-16, and Rich mond 39-26, but increases occur red in Portsmouth 6-9 and Alex, andria 5-9, For the entire state, pedestrian deaths dropped from 251 to 201 . However, Col. Woodson pointed to the continuing and alarming rise in the deaths of servicemen which reached 127 during the year. This was a substantial increase over the 84 of 1951, Total accidents rose from 53,633 to 58,825 and 820 of these killed one or more persons each. Previous fatal accident score was 785. There were 25,218 people injured against 23,898 of the pre ceding year and economic and prop erty losses exceeded 90 million. For the year, traffic volumes were about 7 per cent higher than in 1951."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "and Queen 14-1, Prince <mark>Edward</mark> 11-1, Alleghany 11-2, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "and Queen 14-1, Prince <mark>Edward</mark> 11-1, Alleghany 11-2, and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.53, 906.06, 2155.8, 1345.45], "bbox_id": "c7a4af0282", "file": "AppomattoxNewspapers_1892-1898a_0079.pdf", "page": 1, "text": "Spring M ill Item s. Foremost in the news of last week is the mention of the severe wind storm on last Monday. It did much damage in the way of bruising snd otherwise injuring the tobacco crop, Mr. Sam Cheatham is said to have an abundance of nioe melons this si son. No donbt he has many visitors, joth daily and nightly, as the lovely nights of the past week served to ight one to the patch very nicely, he writer, however, has not tres passed as yet, though greatly tempted  doeo. Mrs. O. L. Burch, of Lynchburg, visiting relatives at this place. Miss Brazeal, of Bedford City, who ias been visiting Miss Lilian Harvey, las retamed to her home. Miss Emma Barksdale has retur ne ic Nashville, Tenn. Mrs. Thos. Tanner, of W. Va., is expected at her fathers, Mr. Nathan Tanner, this week. Miss Julia Woodson has just re turned from a lengthy visit to rel atives in Prince Edward. The protracted meeting at Union ! Ell, which was continued from the first Sunday in this month, closet yesterday, with the promise of a meet ing later on, as the rain last week evented a regular attendance. There will be preaching at the Promised Land next Sabbath at oclock p. m. Let everybody attend."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "this week. Miss Julia <mark>Woodson</mark> has just re turned"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "this week. Miss Julia <mark>Woodson</mark> has just re turned"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [894.72, 192.45, 1051.59, 1047.98], "bbox_id": "41b75cf033", "file": "AppomattoxNewspapers_1922-1923a_0154.pdf", "page": 1, "text": "spent the holidays .with th. formers parent Mr. T. J. Nash Mr. and Mrs. L Laughiin and baby of Lynchburg spent the holidays with tbe latters parents, Mr and Mrs. T il Ford. Mr. and Mrs Edward Harris of Charlotte, spent a few days during Xmas with the latters parents, Mr. and Mrs Z M Jones Mrs. Robert Marsnali better known as Grandma Fel is so enthused over the many nice gifts from childred grand and great - grand children and friends also, she feels like pro claiming as tbe rich man in the Bible, That she has not room to store her goods. Hurrah for this amiable lady, may she live to see many more Xmases like this. Mr. Wallace Woodson is visit ing his brother, Ernest, near Cape Charles, Va. Messrs. Da vid N ash and J oan Shackleford of Lynchburg motored to the home of Mr. R. W. Martin aud spent a few of the holidays. Mr. and Mrs. J A Martin spent a few days last week with the 1 liters parents Mr. and Mrs. A S Wooldridge. JohtMarshall of Lynchburg, Miss Mary Dug Marsaall of near Pamplin, Mr. aud Mrs. W W. Oerton aid chilirau of Brookneal, Mr. Henry White of Richmond, spent the holi days at the home of N D Marshall Mr. Wiliium Marshall and brother, David, of W. Va , weie visitors in this neighborhood last week. Miss Mattie Farrar of Ever green, visited in the home of Mr. and Mrs. Floyd Puckett last week Misses Laura and Mattie Nash Everdita Ferguson and Elisha Jones spent the week end in the home of Mr. Cecil Nash. x Mr. T O. E der has moved near Brookneal.  Mr. and Mis. W. T. Nash and children spent last Saturday with Mr. and Mrs. T H Inge. Sunday School at Pettys Fork school house closed last Sunday. On Xmas eve the children had a little program, afterward they were presented with a bag of candy and candy handed around to older pupils Our public school teacher, Miss Eva Harvey changed her name Xmas. I guess we will aave another sent in to take charge to-day. Wishing the Editor and Printer a happy New Year."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Ford. Mr. and Mrs <mark>Edward</mark> Harris of Charlotte, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Ford. Mr. and Mrs <mark>Edward</mark> Harris of Charlotte, spent"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [550.08, 281.06, 712.45, 1167.8], "bbox_id": "70354dcc1f", "file": "AppomattoxNewspapers_1962-1965a_0071.pdf", "page": 1, "text": "Ronald Gowin. Herbert Handy, Everett Hendricks, Carlton Mann Wayne Moore, Rosa Baars. Geor- gie Brannan, Donna Hubbard, Leonda Hudson, Elizabeth John son, Sharon Johnson. Laura Mann. Linda Jo Moses, Cynthia Nash, Sandra Pitsenberger, Eve lyn Powell. Amy Scott. Kay Tho mas. 4th Grade  burkey William Allen Bryant. Jolifrny Cole, Robert Moore. Dale Hughes Ryland Mann. George Norris, Charles Phillips, Gary Thomas, Ray Tweedy, Mark Weatherly, Stephen Wilson. Amanda Austin. Jane Goin. Claudia Gordon, Cor nelia Guill, Patricia Harden, Re becca Harris, Lucy Lewis Mar tin. Patricia Mays, Margie Bea Morris. Judy Perdieu, Helen Rog ers. 4th Grade  Marlin Danny Ray Bryant, Edward Dix- 1 on. Jack Lee Giles, David Hamil ton. Calvin Hooper, David Mc- Craw, Stephen Marshall, Tho mas Mayberry, Ronald Nash David Scruggs, Alvin Wilch, John Williams, Danny Wayne Wooten, Carol Benmer, Deborah Caldwell, Carolyn Ann Franklin, Rebecca Harvey, Carolyn Rose Hudson, Kathy Scott, Aileen Torrence Sharon Johnson. 4th Grade  Gordon Robert Hendericks. Joseph W. Lewis, David Page, Dolls Giles, Linda Harvey. Kathryn Woodson 3rd Grade  Gordon i Kenneth Inge, Richard Lawson, Jack Layne, Warren Seay, Pame la Goin, Diamne Ferguson, Jane Ferguson, Fay Paulette. 3rd Grade Burkey Elmer Beamer, James Chandler, Phillip Coleman, Daniel Gallier, David Harris, Joseph Lawson, Harold T. Nash, Jr Gary Woold ridge, Nelwyn Coleman, Karen Cabaniss, Iris Cordell, Janice Doss, Teressa Franklin, Sue Ellen Giles, Mary Frances Goin, Cathy Gowin, Virginia Rives Gordon, Dianne Henkiel, Debra Pierce, Dianne Smith, Dianne Williams. 3rd Grade  Inge Micheál Ayers, Lee Conner, Char les Daniels, Kenneth Henderson, Emmitt Knight, Steven Lawson, Lee Montgomery, Curtis Snow, Tony Trent, Mary Ayers, Pettis Bowling, Carol Burnette, Cathy Godsey, Jane Hill, Freda Jones, Monty LeGrand, Dorothy Litch- ford, Betty Mayberry, Carrie Lynn Moore, Eleanor Painter, Kathy Sears, Sandra Smith, Wen dy Sperry, Marsha Welch. 3rd tirade  Rogers Ronald Campbell, Douglas Doss, Allen Ferguson, William Harvey Keith Martin, Calvin Mitchell, Patrick Quinn, David Seay, Joan Coleman, Constance Guill, Kay Honeycutt, Brenda Perdieu, Cath erine Powell, Donna Stanley, Su san Weatherly, Elizabeth Wilson, Suzanne Hendricks. 3rd Grade  Smith Bradley Almond, Ray Conner, Glenn Cumbie, T. C. Harvey, Bill Lewis, Nathan Powell, John Smith, David Snow, Bill Stanley, Dennis Stanley, L. M. Thomas, James Torrence, Douglas Webb, David Wheeler, Sherry Blood- worth. Brenda Bryant, Pamela Chenault, Joarfhe Elder, Melanie Folks, Julia Hesson, Kitty Simp son, Ella Wilson."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Marlin Danny Ray Bryant, <mark>Edward</mark> Dix- 1 on. Jack"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Marlin Danny Ray Bryant, <mark>Edward</mark> Dix- 1 on. Jack"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [421.45, 1461.98, 517.42, 1807.53], "bbox_id": "929968e9dd", "file": "AppomattoxNewspapers_1933-1936a_0028.pdf", "page": 1, "text": "Ragland, Henry D. Patteson, Wm. D. Patteson, HenryC. Paulett, Philip O.i  Paulett, Robert J. Paulett, Joe P.  Reynolds, Jesse H. Christian, Totty Robertson, James O. Scott, Walter W. Scruggs, Wm. W. Scruggs, John W. Sears, Edward P. Smith, Ri,hard W. Smith, Richard W. Harris, Sam R. Smith, Mahlon C. Smith, Sydney G. Stratton Bros. Thomas, Charlie W. Thornhill, George C Torrence, Jessie L. Turnes, J. H.  Son Walton, Willie J. Walton, Walker S. Walton, W J  W S ftcCoyt, Stephen Watson, Thomas R. Weakley, W. A. Williams, E. H . Williams, M. J. Wool ridge, Harry D. Foulks, John M. Whitten, Joseph T. Wheeler, Irby B. Woodson, W irt W. Wright, Thomas !H. Sweet Briar College Davis, Thomas B."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Scruggs, John W. Sears, <mark>Edward</mark> P. Smith, Ri,hard W."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Scruggs, John W. Sears, <mark>Edward</mark> P. Smith, Ri,hard W."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [650.45, 563.0, 822.82, 1261.34], "bbox_id": "2cdd8d07b2", "file": "AppomattoxNewspapers_1918-1922a_0564.pdf", "page": 1, "text": "Peoniman, Drewrys Bluff am. Petersburg, where they have been visiting relatives. The had a most enjoyable trip. Little Erna Wooldride was taken to Lynchburg Hospital last wee where she underwen a very serious operation which was pronounced bloodpoison of the leg We hope for her a peedy recovery. Mr. EveretteFergusoff, Misses Mattie FergusoD, and Laura Nash were visitors at the homo f Mr and Mrs. R. W. Martin itring the holidays. Mr. W. T Nash is walking t.ouod very proud, Its a boy Messrs, bchuyler, Abbitt aod David Marshall, of West Va., were visiting home folks Xmas. Mr. and Mrs W. W. Overton and children, of Brooknea1, Va , Mary Doug Marshal!, of Prince Edward, and Mr. John Mar shall, of Lynchburg, visited their parents, M . and Mrs. N D. Marshall, Xmas. Mrs. Thos luge accompanied by her two daughter j , Mis 3 es Della and Oladys, visited her daughter, Mrs. W. T. Nash, during tbe holidays. Miss Eunice Woodsoo, of Lynchburg, spent the holidays with her parents, Mr. and Mrs. Lucian Woodson Miss Petrie Ford and Mr. Lawrence Laughlin, of Lynch burg, were married Xmas day. They were visitors at the home of tbe formers parents, Mr. and Mrs, T, H. Ford, during the holidays? Miss Leia Jones and Mr. Edward Harri? of Charlotte county, were married Xmas. We wish these two cpuples much happiness and prosperity, The writer wishes to extend her most sincere sympathy to the family of Mrs. R C Mann, who died last week and was buried at her old home place Saturday, in the presence of a large crowd of friends and rela tives We know this good woman will be missed, Rhe ha"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Doug Marshal!, of Prince <mark>Edward</mark>, and Mr. John Mar"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Doug Marshal!, of Prince <mark>Edward</mark>, and Mr. John Mar"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1766.41, 1137.79, 1922.16, 1549.03], "bbox_id": "a1de2b5b2c", "file": "AppomattoxNewspapers_1915-1918a_0492.pdf", "page": 1, "text": "P iney M ountain People are very busy in our neighborhood stripping tobac co. Miss Cassie and Mr. Harry Woodson will move back to tbeir fathers this week, and Mr. Snyder will move into the bouse tbe now occupy. Mr. Johp Bingham and son Curtis, wno have both been confined to their beds with pneumonia, are getting along nicely now and we hope to see them out soon. Some of the hunters who have visited our neighborhood have had splendid success kill iog turkeys and birds Mr. Edward Ferguson seems to be quite hapoy helping to care for his wife and new little daughter. We want to ask for a chick en from every family that be longs to Herman church, to send to our Orphanage for Christmas. If you dont have the opportunity to send it, b sure to come to Herman on the third Sunday morning iu this month and bring your chicken with you. You can leave it at J. E. Childers, right on your road."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Cassie and Mr. Harry <mark>Woodson</mark> will move back to"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Cassie and Mr. Harry <mark>Woodson</mark> will move back to"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2039.99, 1064.19, 2211.25, 1765.11], "bbox_id": "16bd0661fc", "file": "AppomattoxNewspapers_1912-1915a_0533.pdf", "page": 1, "text": "P in ey M ountain Team Out Strong. JVith fourteen men out for the team last Saturday the Mount aineers are anticipating the strongest team in the history of their base ball career. Not withstanding the fact that the diamond is a little rough tbe men had a light workout m the field and a stiff drill in the pol ling art, at which they seem to be up to their old standard. Len Ohilders the little Ap pomattox champion at receiv ing, will resume his old posi tion, and on him the team is counting for a part of her bat tery. Lud Childers will do the twirling un ill Chris Christian returns from Richmond college, when he will tae his place on the staff. And on the initial sack Leslie Gordon the left- hand star will perform, on sec ond there is the old veteran Harry Woodson and at short Jim Childers the fast little de mon will be the main stay at third Ira Lucado will be sta tioned. In the field there are Delbert Gordon, Edward Fergerson and Jim Luoado, and in the sub-line, Ed Childers, Kenneth Barlow and Little Lucado are doing good work. If the old men dont get a hustle on and play fast ball some of these so called rats will boost them out of a place on tbo varsity team As the manager of he team has not arranged any definate schedule the exact time of the first game is not known but will probably be staged at Oakville with the Oakville High School lads. The team regrets very much the loes of two valuable men, Jim Megginson catcher, who has signed up with Liberty Chapel High School and Elmo Wilkerson pitcher, who is un able to plav on aeoount of an injured leg."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "the old veteran Harry <mark>Woodson</mark> and at short Jim"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "the old veteran Harry <mark>Woodson</mark> and at short Jim"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [968.39, 491.15, 1129.89, 1381.99], "bbox_id": "619516dc4b", "file": "AppomattoxNewspapers_1898-1902a_0030.pdf", "page": 1, "text": "Oakville. T imes Mr. S- Walker Nowlin of Lvnchburg. who has been visiting his relatives at this place for the past week returned home last Frida. Mrs. J. W. North of Lvnehhnr, with her little danghter Mary, is visiting her mother Mrs. V. C. Hughes. Mr. Herman Lewis, of Pamplin Citv and his sisler Miss Fay Lewis were in the village Saturday nf te - noon. Miss Susie 0. Nowlin, of Lynch burg. and Mr. Watkins Nowlin, of Spout Spring, spent Sunday eve ning with the Misses Nowlin of thi-- place. Messrs. J. C. and H. P. Woodson, and Master Gipson spent a day or two with their sister, Mrs. J. H. Nowlin lately. Miss Sissie Stratton is confined to her room on account of sickness. Miss Julia Nowlin has gone on a visit to her annt Mrs. M. E. Overton of Spout, Spring. Miss Lucy Patteson, of Vermillion spent last week with her sister Mrs. K. D. Hughes. Mr. Jesse Harvey, who has been sick with fever is out again. Miss Mattie Sue Moss was in the village last Wednesday. Miss Lncy C. Thornhill -and Mr. J. Rolf Horslev visited the home of Mr. J. H. Nowlin last. week. Miss Ellen Hubbard expects to go to Prince Edward one day this week to stav a while. Misses Mary. Eugie and Lottie Nowlin visited their great-annt Mrs. A. P. Nowlin near Vermillion lst week. Mr. Bernard Thorps valuable water-melon patch was washed away by rain recently. Mr. J. A. Owen is having a new store house pnt np at this place. C arl . This letter should have appeared the first week in August, hut was de layed in reaching this office.E d . THI DIBINO SOr.DniR IN CUB!. A eeldler l-i y dielng In Cuba, Hia life blood was fast ebbing aw ay And bis cheeks were flushed and fallen, That told his death was to-day. As he lay on the battle field. He thought of the happy days gone by When a school hoy in America, The happy land of the brave and free. And as his thoughts still wandered. He thought of the heart th at was beating For th at brave young soldier boy. That died in the battle to day. He thought of his sweetheart. When they vowed theyed be true. But now they are never to meet Until Gods Judgm ent Day. Faintly the words he whispers To others standing around. Tell m other and sweetheart I love them But never shall I see them again. One more look at Old Glory, The soldier raises his ej es. And gaze a t the battle flag That represents the country he adores. The clock ticks his last second. The soldier closes his eyes And one more name is w ritten. On the death roll to-day. X."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "C. and H. P. <mark>Woodson</mark>, and Master Gipson spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "C. and H. P. <mark>Woodson</mark>, and Master Gipson spent"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.96, 316.0, 1644.94, 545.6], "bbox_id": "7d0d1b26b9", "file": "AppomattoxNewspapers_1943-1947a_0109.pdf", "page": 1, "text": "Oakville, Jan. 5.- Corp. Clarence Edward Wilkerson, of Camp Shel by, Miss., spent several days last week with his parents, Mr. and Mrs. Elmo Wilkerson. Other visitors in this home were Archer Wilkerson, of Norfolk Mrs. John Bingham, Mr. and Mrs. Robert Gilbert and dauighsefr, i Barbara  Anne,- Mrs. Gladys Woodson, of Lynchburg, Mr and Mrs. James Whitehead and son Arnold, and Miss Marie Roberts. Mrs. Bernice Doss visited rela tives in Lynchburg last week-end. j Miss Dorothy Ferguson returned home with her to spend Sunday, j Miss Ella Bruce Lewis, who has had mumps, is able again to be at school. Mr. and Mrs. J W. Childers jyQB daughters, Opal and Betty, sent the week-end recently with"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Jan. 5.- Corp. Clarence <mark>Edward</mark> Wilkerson, of Camp Shel"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Jan. 5.- Corp. Clarence <mark>Edward</mark> Wilkerson, of Camp Shel"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1471.19, 266.6, 1756.77, 450.35], "bbox_id": "488968bd14", "file": "AppomattoxNewspapers_1962-1965a_0240.pdf", "page": 1, "text": "nearer his work. They will be missed in the community. I want to thank all of my friends who rememlbered me on my 91st birthday with their visits cards, letters and gifts. They were all appreciated. I hope that they may live to be as old as Those visiting her were Mrs. J .  I am - It is sweet to be nemem- H. OBrien, Mrs. Len Mosete, j bered by our loved ones. Mrs. Ora Coleman, Mrs. Leslie j Mr. and Mrs. Edward OBrien Coleman, Miss Rachel Gilbert,and children, Wanda Ferguson Mrs. Gladys Woodson, Mrs. i ani Mrs. J. D. Harris visited Wade Ferguson, Mrs. Emma Reynolds, Mrs. Ernest Ferguson, Mr. and Mrs- Grover Carter and family, of Norwood Sunday, also Mrs. L. H. Watson, Mrs. Emma  Mr- and Mrs. George OBrien Lemon, Mrs. Gus Torrence, Mrs ant family. Ada Gibson, Mrs. Mildred Wär ters, Mr. Len Harvey, Mrs. Thel- Mr. and Mrs. D. tertained with î H. Kanipe en- watermelon"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "j Mr. and Mrs. <mark>Edward</mark> OBrien Coleman, Miss Rachel"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "j Mr. and Mrs. <mark>Edward</mark> OBrien Coleman, Miss Rachel"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.29, 1058.39, 2294.74, 1330.39], "bbox_id": "f0aa86a0a3", "file": "AppomattoxNewspapers_1905-1912a_0393.pdf", "page": 1, "text": "N THE GLBBKS OFFICE OF THE CIB- oult Court of the County of Cumberland on the 28th day of July, 1911. UOT UU Drewry H ughes Co., Plaintiff, against . H. French and Clarence French and ala. Defendants IN CHANCERY, The object of this su it Is to recover of the defendant, H. H. French, the sum of 102.74 evidenced by note dated March 14, 1907 with Interest thereon from May 14, 1907 payable two m onths after date to Drewry Hughes Company, and to attach and subject the I state of the said K. H. French to the pay-1 raent of said am ount, and more particularly the following real estate, to-w lt The un divided one-sixth in ter st In 180 acres of land, subject to tbe dower Interest of his m other, Nannie Fri neb, widow of Hugh French, decd., adjoining the lands of J. H. Jenkins, Jo h n Beager. Edward Bverley, the public sebool house lot of land and lying near Bunnyside. on tbe northerly side of the I D O J u  n . , Buckingham Hoad and the Tidew ater and  2 4 M a i n S t r e e t , Western Hal I road.  7 And an affidavit having been niade and filed that the defendants K. H. French and l a r e n c e F r e n c h a r e n o t resi s ts of tbe State of Virginia, it is ordered that they do appear here within fifteen days after due publication hereof, and do what may be necessary to protect their interest in this suit. And it Is further ordeied that a copy be published once a week for four weeks in the T im b s - V ik g in ia n , a newspaper published In the county of Appomattox, and that a copy be posted at the front door of the court-house of this county on the 7th day of August, 1911, that being the next succeeding rnle day after this order was entered. A copyTeste.  m  C. K. 8ANDB80N, Clerk. B. Woodson, p. q. 8-8-4t"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Jo h n Beager. <mark>Edward</mark> Bverley, the public sebool"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Jo h n Beager. <mark>Edward</mark> Bverley, the public sebool"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1071.62, 198.2, 1230.62, 379.46], "bbox_id": "5c1efeb84c", "file": "AppomattoxNewspapers_1915-1918a_0580.pdf", "page": 1, "text": "Mrs. Victoria Woodson is visiting her daughter, Mrs. Ja lia Olkas, in  rince Edward. We are glad to have Rev. G. A. Ohocklett in onr town. M os dames J. L. an 1 C. R. Wood- son motored to Appomattox last week. We are glad to hear that Mr. W. D. Ferguson is better. Mrs, Elva Overton, of Crewe, is visiting her home people, M. and Mrs. N. D. Marshall. Misses Otlene and Ethel Woodson have retamed to Appomattox to st ud school"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Mrs. Victoria <mark>Woodson</mark> is visiting her daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Mrs. Victoria <mark>Woodson</mark> is visiting her daughter,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1583.5, 231.53, 1743.0, 941.8], "bbox_id": "35d015acfc", "file": "AppomattoxNewspapers_1971-1973a_0424.pdf", "page": 1, "text": "Mrs. Vara Robertson of Lov- ingstoo spent the week end with Mr. and Mrs. R. M. Webb and family. Tommie Gene Barton of Rich mond, grandson of Mrs. C. R. Barton was operated on l a s t week in a Richmond hospital. We wish him a speedy recovery. Mr. and Mrs. Bennett Gil- I liam of FarmviUe spent a few days last week with Mrs. W. T. j Covington. Mr. Richard Jenkins of Balti more was called home Sunday due to the illness of his mothec Mrs. Addie Jenkins. We hoDe she may soon be feeling better. Mr. and Mrs. La wr e nc e Woodson of Lynchburg spent Wdenesday with Mr. and Mrs.  L. L. Webb and family. Mr. and Mrs. Arnold Childers spent Thursday in this home. Mr. and Mrs. Kenneth Deaner and two daughters of Richmond spent a few days last week with Mr. and Mrs. W. H. Wing field and family. We were very sorry to hear of the death last week of Miss Amanda Woodson. Much sym pathy is extended to her loved ones. Mr. and Mrs. Benjamin Beas- j ley, Lisa and Susan of Luray, Mr. and Mrs. Claude Hawlett and Brenda of Hurt, and Mr. and Mrs. Grover Beasley Jr. and Tye of Appomattox visited Mrs. Grover Beasley Sr. dur ing the week end. Mr. Louis Tweedy is a pa tient in the Lynchburg General I Hospital. We wish for him a speedy recovery. Mr. and Mrs. Bennett Gil liam, Mr. and Mrs. Robert Coleman, Rev. and Mrs. Otis Smith and Mrs. W. T. Cov ington spent Thursday with Mr. and Mrs. Frank Hancock and family of Richmond. Mr. and Mrs. H. W. Jenkins called in the houses of Mrs. Charlie Bagby and M ts . f T h . Wingfield Monday morning. Mr. and Mrs. Edward Greer and family of Hampton visited Mr. and Mrs. L. L. Webb and family Saturday. Dinner guests Sunday of Mr. and Mrs. Henry Covington were Mr. and Mrs.- Frank Schawpel, Mr. and Mrs. Edwin_Schawpel, Mr. and Mrs. Arnold Childers,"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "wr e nc e <mark>Woodson</mark> of Lynchburg spent Wdenesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "wr e nc e <mark>Woodson</mark> of Lynchburg spent Wdenesday"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.5, 615.9, 2642.57, 687.99], "bbox_id": "00adc39a55", "file": "AppomattoxNewspapers_1971-1973a_0204.pdf", "page": 1, "text": "Mrs. Olivia R . Woodson announces the engagement of her step-granddaughter, Kathy Darnelle to Herman Edward Rag land, son of Mr. and Mrs. Lewis Ragland of Appomattx. Miss Woodson is a graduate of Appomattox County High School and is employed at Appomattox Garment Company. Mr. Ragland is employed by his brother in Appomattox. The wedding is planned for February 18, 1972."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Mrs. Olivia R . <mark>Woodson</mark> announces the engagement of"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Mrs. Olivia R . <mark>Woodson</mark> announces the engagement of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.1, 768.77, 1180.21, 1180.76], "bbox_id": "754a76b5c2", "file": "AppomattoxNewspapers_1952-1954a_0232.pdf", "page": 1, "text": "Mrs. Mark Saurs, April 1. Rev. W. M. Thompson, April 1. Mary Anna McDearmon, April 1. Mrs. Albert Baird, April 2. Jane Goin, April 3. G. F. Abbitt, Sr., April 6. W. W. Scott, April 7. Mrs. Nancy Scott Goode, April 9. Walter Edward Hancock, April 10 Linda Dell Anderson, April 9. Hazel Johnson, April 9. Mrs. Lula Beale, April 8. Mrs. J. P. Johnson, April 4. Mrs. Vara Hanenkrat, April 8. Susan Nell OBrip Anvil 19 S. G. Anderson, April 11. Mrs. Fred Robertson, April 11. Katie Woodson, April 14. Anne Abbitt, April 18. Gwendolyn Shuford, April 2, Mrs. L. E. Giles, Sr., April 5. Mrs. Hubert Godsey, April 16. Mrs. Lillie Martin, April 9. Mrs. Martin will be 83! Congratula- tions. Nancy OBrien, April 3. Harry G. Plunkett, April 10. Mrs. Virginia Zastrow, April 12. S. R. Hubbard, April 2. Emmett Dinkins, April 5. Joyce Ferguson, April 5. Kara Ann Smith, April 12. Helen Taylor, April 12. Ellen Taylor, April 12. Mrs. Toby Inge, April 24. Pete Plunkett, April 14. Mrs. Don Moses, April 15. Mrs. Frances Mayberry, March 2. Louise Mayberry, March 28. Mrs. Wiley Morris, April 16. Mrs. J. F. Harvey, April 18. C. K. Hunter, Jr., April 18."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Goode, April 9. Walter <mark>Edward</mark> Hancock, April 10 Linda"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Goode, April 9. Walter <mark>Edward</mark> Hancock, April 10 Linda"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.17, 204.54, 2194.87, 885.81], "bbox_id": "c403860967", "file": "AppomattoxNewspapers_1971-1973a_0424.pdf", "page": 1, "text": "Mrs. Charles Torrence and James, Mr. and Mrs. David Torrence, Stephanie and Sher ry, Mr. Allen Torrence, Connie and Linda, Mrs. Russell Con ner, Mr. and Mrs. Sonny Con ner, Steve and Richard, Mrs. Mary C. Garris, Cathy, Kay and Bryant, Mrs. Mildred OB. Alvis, Miss Kate OBrien, Miss Edith OBrien, Joe and Pete OBrien, Mr. and Mrs. Richard Webb, Mr. and Mrs. Ricahrd Ha mil ton , Mrs. Vara M. Ro bertson, Mr. and Mrs. Leonard Day and granddaughter, Mr. and Mrs. Dan Jennings, Mr. and Mrs. Willie Morris and Scot- tie, Mr. and Mrs. Harold Mor ris and Mr. and Mrs. Earl Morris. Mrgi_Aj_B. Torrence, Mr. and Mrs. Wallace Torrence, Mr. and Mrs. Earl Torrence and Mrs. James Booth. Mr, and Mrs. Alfred W. Torrence, Mr. and Mrs. Garland Torrence, Mr. and Mrs. James Monroe Foster, Joyce and Janice, Mr. and Mrs. Lacy Torrence, Mr. and Mrs. Edward Dickerson, Mrs. Eugene Sams and Chris, Mr. and Ms. William Newman, Karen and Billy, Mrs. John Newman and Todd Newman. Mrs. Maggie Woodson Reid, Mr. and Mrs, E. M. Reid, Susan and Nancy, Mrs. Virginia Reid L a s s w e l l , Mrs. F. D. Douglass, Mr. and Mrs. Dillard Woodson and Dee, Miss Cor nelia Woodson, Mrs. Hettie W. Hope, Mrs. Gladys B. Woodson! Mrs. Estelle Agee Marshall, Mrs. Polly t . Ayers, Miss Cecil Torrence, Mr. and Mrs. Clarence Ellett and Ann Barton. The Rev. and Mrs. Holiday and children were guests, as well as Miss Mary Jane John ston, Mrs. Virginia Hancock, Jim meyers, Arthur Morris and Mrs. Slaughter. This was the ninth consecu tive reunion for this family. The officers are Dennis Tor rence, President, Mrs. Thelma T. C o nn e r , Vice-President, Miss C e c i l Tor r e n c e, Trea- surer and Mrs. Annie ElletL Secretary. Of special interest this year was a coat-of-arms made by Dennis and Larry Torrence."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Torrence, Mr. and Mrs. <mark>Edward</mark> Dickerson, Mrs. Eugene Sams"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Torrence, Mr. and Mrs. <mark>Edward</mark> Dickerson, Mrs. Eugene Sams"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.8, 663.27, 2016.25, 764.47], "bbox_id": "9717353ce6", "file": "TimesVirginian_1980a_0197.pdf", "page": 1, "text": "Mr. and Mrs. Sammy T. Woodson of Appomatox announce the engagement of their daughter, Connie Fr ances to Edward Alvin Hall, son of Mr. and Mrs. Elbert R. Hall of Rustburg. Miss,,Woodson is a 1979 graduate of Appomattox County High School. She is"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "and Mrs. Sammy T. <mark>Woodson</mark> of Appomatox announce the"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "and Mrs. Sammy T. <mark>Woodson</mark> of Appomatox announce the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1836.22, 366.61, 2014.64, 779.1], "bbox_id": "3a729e4b08", "file": "AppomattoxNewspapers_1939-1943a_0183.pdf", "page": 1, "text": "Mr and Mrs K. L. MksClenny and daughter, Betty, of Farmville, spent Sunday with the former s mother, Mrs. N.L. McClenny. Mrs. Gladys Woodson, of Clear water,  Florida, was a recent gues of Miss Flora Bell Williams. Miss Carrie Pankey, of Appomat tox spent the week-end at her home here. Miss Ludy Rice, who has been visiting her brother, Clyde Rice, of Washington has returned to her here for ta few weeks. The Womans Missionary Society, of Elon Baptist church met . in the home of Miss Lucy Rice Wednesday I afternoon. I Miss Merle Davis, of Richmond, recently spent- the weak-end wi.h her mother, Mrs. Jessie Davis. Mr. and Mrs. Alberti Baird, of Buckingham spent last Sundaly with the laters parents, Mr. and Mrs. F B . Fitzgerald. Mr. and Mrs. Edward Davis re cently visited the latters parents, Mr. and Mrs. George Wood, of Worsham. Mr. and Mrs. R. E . McClenny and children recently visited in the home of W.A. Swan, of Hixburg. Mr. and Mrs. N.S.Topping, of Hixlburg, were recent guests in the home of Mrs. C. C. Rosser. Miss Eurelan Rosser, of Spout Spring, spent last week-end at her home here."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "N.L. McClenny. Mrs. Gladys <mark>Woodson</mark>, of Clear water,  Florida,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "N.L. McClenny. Mrs. Gladys <mark>Woodson</mark>, of Clear water,  Florida,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1132.51, 658.62, 1280.7, 1003.9], "bbox_id": "7567f69842", "file": "AppomattoxNewspapers_1962-1965a_0013.pdf", "page": 1, "text": "Mr. and Mrs. Braxton Garrett and family, Mr. and Mrs. Rolfe Allen Garrett and little Rolfe, of Richmond and Mr. and Mr?. Terry Garrett and family, of Lynchburg spent Sunday with Mrs. Spencer Garrett and La- Verne.    Mrs. D. H. Kanipe and chil dren visited her mother, Mrs. Spencer Garrett.    Mr. and Mrs. Paul H. Bugg visited friends in Richmond Sun day.    Misses Jayne Martin and Har- riette Carson left this week for Radford College where they are students.    Jane Woodson, Appomattox, 13, daughter of S. R. Woodson and the late Mrs. Woodson, is now permitted to have company at her home. Having been in the hospital for seven weeks. Jane will welcome friends coming to call.    Thomas Edward Holland re turned to his studies at V. P. I. after a stay of two weeks with his parents, Mr. and Mrs. Ivy I Holland."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "they are students.    Jane <mark>Woodson</mark>, Appomattox, 13, daughter of"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "they are students.    Jane <mark>Woodson</mark>, Appomattox, 13, daughter of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.36, 1095.98, 1861.93, 1550.46], "bbox_id": "628bc6b801", "file": "AppomattoxNewspapers_1954-1955a_0358.pdf", "page": 1, "text": "Mr. and Mrs. Bennie Smith and daughter, Marin, of Smithfield, Va. Mr. and Mrs. Richard .Smith and son, Ray, of Lenoir, N. C. Mr. and Mrs. Edward Smith, Mr. and Mrs. Earl Smith, and Mr and Mrs. Jake Smith, of Ashland, Va., spent the week-end here due to the illness of Mrs. Berta Smith, who is in the Lynchburg Gen eral Hospital due to a heart attack. Mrs. Hunter Jamerson returned to her home Sunday from the Virginia Baptist Hospital, where she was a patient for several days. Those visit ing Mrs. Jamerson since her return home were Mr. and Mrs. J. G. Goff, Mrs. H. S. Jones, Mr. and Mrs. Eb- bit Jones and son, and Miss Betsy Jones all of Lynchburg, and Mr. and Mrs. Floyd Coleman and fam ily Mr. and Mrs. J. R. Jamerson, Mrs. David Harvey, Miss Patsy Mitchell, Mrs. Russell Woodson, Mrs. Norman Ferguson, Mrs. Ernest Fer guson and Mr. and Mrs. C. R. Mc Cormick. Mr. and Mrs. M. W. Williamson and children, Skippy, Rhonda and Joe arrived Friday A. M. to spend the month of August with his par ents, Mr. and Mrs. W. L. William son. They have been in Austin Texas for the past year, where Mr Williamson has been working on his Ph. D. degree in English at the University of Texas. During the last week in August, Mr. and Mrs. Will iamson will go to Camp Miniwanca Michigan, for a Danforth Founda tion Conference on Christianity and Higher Education. Mr. Williamson has received a Danforth Foundation Teacher Grant for his studies in 1955-56."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "C. Mr. and Mrs. <mark>Edward</mark> Smith, Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "C. Mr. and Mrs. <mark>Edward</mark> Smith, Mr. and Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [291.11, 248.74, 442.3, 1375.22], "bbox_id": "141d0fafa3", "file": "AppomattoxNewspapers_1962-1965a_0527.pdf", "page": 1, "text": "Miss Flora Williahis has had many visitors since her return j from California on Saturday, Oct 17. The Rev. Carl Paughf, Mrs j .Edward Davis, Mrs. Richard  Williams, Mrs. Robert Fore, Mr. j Robert Davis, Mrs. Ernest Bate man, Mrs. Martha Nash, Mrs. Eunice Baldwin, Mrs. Cecil Li-1 gon, all of Pamplin Mrs. Vir-1 ginia Babcock, of Amherst j Senator C. T. Moses, Mrs. Gladys Woodson, Mrs. Henry Pack, Miss Emma Smith, Mrs. Rachel Law-1 son, Mrs. Tim Trent, Mrs. Fan nie Willie Phelps, Mr. and Mrs. Calvin Robinson, all of Appomat tox and Mrs. Oscar Pond, of Lynchburg. Mr. and Mrs. Thomas Cald well have returned to their home here after spending some time with her brothers family in Richmond. A. J. Ponton, Jr., of Newport News, was guest in the McCall home Friday, October 23. Miss Margaret  Dill, of Rich mond, was overnight guests of the McCalls, Oct. 23, Saturday morning Miss Dill and Mrs. Mc- Xiall motored to Millsboro Spring where they spent Saturday and -Sunday- at Miss Dills home with her mother and relatives. Miss Dill returned to Richmond Mon day morning. Pfc. Lawrence Hamlett, of Fort Dix, N.J. spent a week end at his home here recently. Mr. Rosha Layne, of Cullen, called in the home of Dr. and Mrs. C. H. McCall last Wednes day afternoon. W. Bascom Williams is con valescing in McGuires Hospital in Richmond after having had surgery several days ago. . Mr. and Mrs. Sandy Deaner, of Richmond, were last Sunday guests of Beulah Cobb.  Mrs. Therman Wayne returned to her home in Centerville, Va. the first of last week after an extended visit here and in Lynch burg with relatives. She is miss ed by both friends and relatives. Mr. and Mrs. G. C. Maxwell visited their daughter and son- in-law, Mr. and Mrs. Kenneth Elder, Sunday afternoon in Ap pomattox. Mr. and Mrs. Philip Lucado and small son, of Danville, spent the week end here with his par ents, Mr. and Mrs. Percy Lucado Miss Jean Cumby spent last week end in Roanoke with her uncle and aunt, Mr. and Mrs. Ralph Lucado. Mr. A. J. Ponton, of Newport News, was overnight guest of D and Mrs. C. H. McCall last F ri-, day, Oct. 30. Mr. and Mrs. Joe Morris, of , Lynchburg, were overnight guest In the McCall home Saturday.j The Tivis Reeve family also call-! ed Saturday evening. Saturday and Sunday visitors , in the McCall home included M r.1 and Mrs. Tivis Reeve and family  Mr.-and Mrs. Edward Booker, I Mr. and Mrs. Z. T. Moran. Dr.  McCall has not been so well for the past week. Mrs. C. W. Slayton and C. W. Slayton, Jr. visited over the week end Mrs. Essye Gibson and family, Mr. and Mrs. Jessie Ken drick and Mrs. Sallie Holley,, all of Callands, and Mr. and Mrs. Robert Atkins, of Penbrook, Mrs. Sallie Johnson, of Farm- ville, spent the day, Sunday, with .hefc jetor-abd brother-in- law, Mr. and Mrs. Robert Fore. Miss Judy Ramsey, a student at Randolph Henry High School with her class attended the high school newspaper clinic Univer sity of Richmond, last Saturday Mr. Campbell Ramsey and son Jeff, of Charlotte, N.C., gave his parents, Mr. and Mrs. C. C. Ramsey, a nice surprise when they drove up Saturday after noon for a short visit with them. They returned home on Sunday.  Mr. and Mrs. Clayton Beale were luncheon guests of their son and daughter-in-law, Mr. and Mrs. Barry Beale, of Appomat tox, Sunday. In the afternoon they visited relatives in Lynch burg and Amherst. Recent guest of Mr. and Mrs. N. E. Farrar was her nephew, Mr. H. D. Cawthorne, of Mont gomery, Alabama."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Carl Paughf, Mrs j .<mark>Edward</mark> Davis, Mrs. Richard  Williams,"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Carl Paughf, Mrs j .<mark>Edward</mark> Davis, Mrs. Richard  Williams,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1790.4, 701.57, 1931.6, 1127.7], "bbox_id": "1d9ca60725", "file": "AppomattoxNewspapers_1962-1965a_0108.pdf", "page": 1, "text": "Margie Morris, Judy Perdieu, Debbie Pierce, Helen Rogers, Neville Torrence. 4th Grade  Martin Edward Dixon, Barry Elder, Da vid Hamilton, Calvin Hooper, Da vid McCraw, Ronald Nash, Da vid Scruggs, Alvin Welch, John Williams, Danny Wayne Wooten, Jerry Lynn Smelcer, Carol Beami er, Elizabeth Brown, Carolyn Ann Franklin, Rebecca Harvey, Catherine Scott, Aileen Torrence. 4th Grade  Gordon Robert Hendrick, Joseph W. Lew is, David Page, Etta Baldwin, Doris Giles, Linda Harvey, Kath ryn Sharp, Kathryn Woodson. 3rd Grade  Gordon Richard Lawson, Jack Layne, Warren Seay, Sherry Covington, Mary Lou Garrett, Fay Paulette, Susan Williamson. 3rd Grade  Burkey Elmer Beamer, James Chandler, Phillip Coleman, Danny Gallier, David Harris, Joseph Lawson, Harold T. Nash, Jr., Wayne Simp son Nelwyn Coleman, Janice Doss, Catherine Go win, Evelyn Lane, Connie Scott, Dianne Smith, Judy Johnson, Dianne Williams. 3rd Grade  Inge Michael Ayers, Lee Conner, Ed ward Davidson, Stephen Lawson, Lee Montgomery, Curtis Snow, Tony Trent, Mary Ayers, Pettis Bowling, Pamela Canter., Jane Hill, Marty LeGrand, Betty May berry, Carrie Lynn Moore, Elea nor Painter, Kathy Sears, Wendy Sperry, Marsha Witch. 2nd Grade  Smith Bradley Almond, Glenn Cumbie,"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Torrence. 4th Grade  Martin <mark>Edward</mark> Dixon, Barry Elder, Da"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Torrence. 4th Grade  Martin <mark>Edward</mark> Dixon, Barry Elder, Da"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1603.17, 540.26, 2254.44, 713.71], "bbox_id": "39c3e0b9f9", "file": "AppomattoxNewspapers_1915-1918a_0043.pdf", "page": 1, "text": "Luther Morris offers 1.00 for  best ear of white corn. E. L. Smith offers 1.00 for I ing Mre. Joe If fon misB the T imes -V irginian !burg and was crippled for life, Ibest ear of yellow corn. mond. the local news of your oounty is al- j though able to go about. He I Willis Inge offers  1.00 for j j r9   McQlure of Lynch so missed. Send it to your distant  was in his s e v e n ty  h c year, best for burg was Sunday guest of Mrs by his w ei I best trio chickens, 1 male, 2 fe -1 James Carson. Mrs Florence Quid, Mieses j 2 00 or  Nellie Abbott and Beulah a Ha-1 Woodson attended the recent j John T. Pa00, of P!jer8bftur for be?t shoai. 4-6 m onths old. W O. T. U. Convention in also by two sisters, Mrs. S. E. I g Caldwell offers 4.00 Lynchburg. J. Binford of Petersburg anMpair Bostonian Shoes for best I Mrs. R. D. Apperson, of Mrs. William B.- Binford, ofcolt sired by Red Amber. Yancey Mills is visiting her Prince Edward County L , oarents Rev. and Mrs. C. R"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "and Beulah a Ha-1 <mark>Woodson</mark> attended the recent j"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "and Beulah a Ha-1 <mark>Woodson</mark> attended the recent j"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [229.2, 186.26, 390.1, 654.19], "bbox_id": "96bdc6efc9", "file": "TimesVirginian_1980a_0440.pdf", "page": 1, "text": "Lucy Woodson Ferguson  Lucy Woodson Ferguson, St-, 89, of 2106 Rivermont Ave., day Lynchburg, formerly of Hfi Appomattox, died at 7 p.m. Boa- Thursday - at St. .Johns Nursing Homo. Her Husband nty, was the late Ernest Fer- tfie guson. own Born hi Appomattox Co- ber unty, she was a daughter of tist the late W. D. Woodson and hod Olivia Torrence Woodson, ano She  was a member of the Liberty Baptist Church. Eva She is survived by six sisters, Mrs. B. S. Reid of five Florida, Mrs. H. 0. Miranda, and Miss Cornelia Woodson, of Miss Mary A. Woodson and t ...of Mrs. J. y. Hope, all of Jett  Lynchburg, and Mrs. Henry tovi Dodd of Chesapeake and iho one brother,. Dillard D. ohn Woodson of Mrytle Beach, and s.C. of Funeral services were fit- conducted at 2 pan- today at ta Robinson Funeral Home, w Burial was in Liberty ,y Cemetery. Robinson Funeral Home day was in charge of arrange- w ments. rria - in RnsacBC. Morris Sr. L LYNCHBURG - Russell me- Qayton Morris Sr., 87, of the 606 Pearl St., died at 305 ew, a.m. Friday at Lynchburg srri General Hospital. He was . of the husband of Inez Baldwin Morris. Born in Cuba Ohio, he was a son otthe late Edward Clayton and  Lola Moon"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Woodson"], "snippet": "Lucy <mark>Woodson</mark> Ferguson  Lucy <mark>Woodson</mark> Ferguson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Woodson"], "snippet": "Lucy <mark>Woodson</mark> Ferguson  Lucy <mark>Woodson</mark> Ferguson,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.29, 1046.35, 2217.34, 1370.25], "bbox_id": "05c5b5401e", "file": "AppomattoxNewspapers_1902-1905a_0243.pdf", "page": 1, "text": "loss is hs eternal gaiu. greatly misled at Roclo church. Mr. Tom LeGraud is at home awhile. Mr. Floyd Wooldridge, of thi county, brukemau on N.  VV., says bis train ran over and killed a young youug lady near Salem, Va., Iasi week. Mr. 0. R. Woodson was in town last week taking orders for enlarged pictures. We wish him success Miss Alice Siisbley returned yesterday to her home at Mr. John Evans, after a weeks visit to her old home in Prince Edward. Miss Nannie Wooldridge left to day for the Hill City with her cousin, Mr. W. A. Wooldridge, Mr. Neal Cawthorn and sou, Tommie, are in Lynchburg to sell tobacco this week. . Our school is closed until the market yet. presum e that mer- weather gete better. 0 u r teltcher chants and commission men aie or will become impatient ere bacco money is realized. . Mi88 MaUJe of tlia"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "week. Mr. 0. R. <mark>Woodson</mark> was in town last"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "week. Mr. 0. R. <mark>Woodson</mark> was in town last"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [144.51, 634.77, 660.94, 1124.3], "bbox_id": "2af17361cc", "file": "TimesVirginian_1983a_0025.pdf", "page": 1, "text": "Jan. 17  Gladys Morris of BefhsSdnt Maryland was home for the weekend to attend tile fonerai of her imde, Lawrence Woodson at Lynchburg. .. 1, The n u l hunters and their families got together 8starday at by home of Sir. and Mrs. Don Mr. Raymond Archer returned this week in little Rock, Arkansas Morris for their annusi barbecue home Friday from the hospital We on business. supper.Approximately0attended, hope hell soon be weU. Mr. and Mrs. Ray Lrnme snd Edward T. Cook, Kenheth and M r Guy Dooley una supper JUSst Missy ware supper guest of Mr. and Randy of Prospect, Mr. and Mrs. of Mr. and lira. Raymond MfuHns Mrs. Richard Nash Sunday. They William L. Carter of Burkevule had and boys Sunday night. Mae visited Mr. and Mrs. Winifred lunch Saturday with their parents. Mr. and Mrs. Clyde Nash were Nish ana family Sunday afternoon. Mr. and Mrs. W.T. Cook, dinner guest of Mr. and Mrs. Chap Mrs. Twyman NaSh and Todd Nash Sunday. visited Mr? and Mitt. Lacey 8harp Mr. and Mrs. Skinney Woolridge, 8unday afternoon. Mr. Paul Mqfflns and Mr. and lu i. Mrs. Lelia Mann wifi enter the Pete Banton visited Mr. end Mrs. Lynchburg Generiti Hospital on Emery Mullins over the week end Thursday and will underge surgery -.a te Lucille Mallina and lirs. on Friday. Ws wish for bar a spesdy Virginia Banton visited Mr. and recovery, lb s Wayne Moors and fiunfly Mrs. Lelia Maim visited Mr. Sunday afternoon. Stafford ChOdress of Lynchburg on Aagdis Moore, daughter of Mr. Monday and afro Mrs. Bessie and Mrs. Wayne Moore, ia spending Chewning of Rustburg. sometime at tbe University of Mrs. Undo Cyrus and Stacey and Charlottesville Hospital undergoing Lson Howard visited Mr. and Mrs. treatment. Our prayers and best Elfiott Nash and Dawn Sunday wishes ire with her for a spesdy afternoon.  K W - d i M j m .M r. Roger Covington la back in Phfflip Benton spent the week and the Lynchburg Generiti Hospital, with hie grandmother, Mrs. Amtit We hope liell be better soon and B anton M s. ,T 7 Visitors of Mf. and Mrs. Fete Banfon SttSunday were Mie. Emory Muliina, M rau m y Evans and girls and Mrs. Annie Banton. afra. Banton is spending this week to thto home. . gjgi-, Mrs. 8ally Jones is on thesick list. We wish her a speedy recovery, h Mrs. W apa Item anti son, Rtthsrd, visited Mr. and Mrs. Nelson Item , Tony and Mike Sunday evening."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "of her imde, Lawrence <mark>Woodson</mark> at Lynchburg. .. 1, The"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "of her imde, Lawrence <mark>Woodson</mark> at Lynchburg. .. 1, The"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1140.01, 186.56, 1302.38, 952.14], "bbox_id": "f9f29344f7", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j Serial No. Name j 416, Floyd Custis Gordon  617, George Wiley Harding  526, Lewis L Doss  613, Cleveland Eagle 609, Harry S. Drinkard 316, Russel Jenkins 274, James Burton 546, Hunter Milton Moore 511, Thomas Vawter 206, Shelton Herry Hudson 342, Sam Henry Goin 293, Charles Willie Orange 460, Charlie W. Soruggs 427, Joel Thomas Morris 666, Geo. Washington Green 241, Ed Reed 40, Kenneth W Furbush 100 , Samuel Arlington Per dieu 572, Harry Tucker Woodson 167, Benjamin Patterson 214, Lawrence Mann 236, Floyd Wyatt Harvey 647, Willie A. Weakley 629, Oolonel Thomas Mays 29, Walter Emerson Durham 533, Robert Thomas Kyle 61, Eugene Watson Harris 114, Easel LeRoy Smith 151, James Leonard Moss 618, Wm. Edward Harris 603, Joseph Owen Carson 33, Arthur Fleshman 209, Walter Clifton Lee 32, Ernest Ferguson  63, Odell Howerton I 362, William Lee Goode I 371, William Henry Marshall j 529, John Samuel Guill j 64, O. Kendall Hunter 382, Robert Odie Abbitt  224, Ernest Reid 449, Geokge Wesley Wright 41, Lawrence E. Furbush 38, Marshall Hubert Franklin j 48, Wiley W Godsey 640, Stratton Marvin Ander- son  668, Luther Johtr-Hubbard 88, David P Moon 127, Samuel D Whitaker j 287, Herbert H u d s o n Jen- niugs  260, Joseph P Panlett ! 473, Freeman Thomas Tinsley 586, Samuel Johnson 527, William Herman Guill 254, Daniel W Dinkins 446, Alfred Berkley Turnes 89, Wm. Archer Moon 358, Wiley Young 573, George Washington Aus tin 451, R Childress Wright"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "dieu 572, Harry Tucker <mark>Woodson</mark> 167, Benjamin Patterson 214,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "dieu 572, Harry Tucker <mark>Woodson</mark> 167, Benjamin Patterson 214,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "nklin and E . R . <mark>Woodson</mark>, Pam plin City and"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "nklin and E . R . <mark>Woodson</mark>, Pam plin City and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1977.79, 1260.95, 2132.34, 1814.33], "bbox_id": "01fdae0517", "file": "TimesVirginian_1976_0262.pdf", "page": 1, "text": "Industry and activity are adjectives applicable to Hazel Harvey and the Bicentennial year is her forte. The orginator of the Appo mattox historical doll collection Mrs. Harvey has just returned from a trip in Virginia, West Virginia, Maryland and North Carolina, where she exhibited her dolls and spoke to various groups. A native of Covington she lives in a historic house at Vera, where she and the late Thomas Harvey, her husband, raised their family in an early 18th century house which was once a stage stop. Her! book, Bicentennial U. S.A., Historical Dolls and Sketches by Hazel Harvey is a salute to Peacetown, Appo mattox. In her Acknowledgement she states This booklet is a tribute to Elvira W oodson Harvey 1838-1927 from whom the local stories and pictures were obtained. The facts can be substantiat ed by the History of New Hope Baptist Church, Appomattox, Virginia, records in Appomat tox, Frince Edward and Buckingham counties... Appomattox played a great part in. uniting our nation in 1865. The local people and events are duly recognized here. As we commemorate the Bicentennial of our nation 1976 Let Us Salute Peacetown, USA. T Mrs. Harveys doll collection feature Virginia Dare, the Presidents Wives, the Dough- girl, Mrs. Woodson who was dubbed Doughgirl by the , Confederate soldiers for whom"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "in Appomat tox, Frince <mark>Edward</mark> and Buckingham counties... Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "in Appomat tox, Frince <mark>Edward</mark> and Buckingham counties... Appomattox"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1206.23, 394.94, 1378.07, 528.79], "bbox_id": "19faf7a7d6", "file": "AppomattoxNewspapers_1949-1952a_0333.pdf", "page": 1, "text": "I Born in Prince Edward County, ! March 23, 1878, she was a daugh- I ter of George Frederick and Mary I Feuqua Woodson. She made her , home in Appomattox County for .0  years. She was a member of the i Liberty Baptist Church. I She is survived by her Ir.-band, ! end three ch-ldr!. Mrs. J. W. Mar , tin, Mrs. J. P. Almond w f Elisha j Ferguson, all of Appomattox, and , one sister, Mrs. Davii Ferguson, of Richmond."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "I Born in Prince <mark>Edward</mark> County, ! March 23, 1878,"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "I Born in Prince <mark>Edward</mark> County, ! March 23, 1878,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [855.58, 268.24, 1198.28, 513.18], "bbox_id": "049b9338e6", "file": "AppomattoxNewspapers_1960-1962b_0606.pdf", "page": 1, "text": "Her. W infred Elder preached a inspiritg sermon on M others Day Sunday night a t C entral Church. Mr. and Mrs. Frank Moore and family visited Mr. and Mrs. Melvin Moore of Concord Sunday. Mr. ar.d M m Wealey Newcomb and daughter of Appotr-fctox visited M m A. D. M arshall, Mias Emma H aar and Miss Roth Woodson Mon day. Mr. and Mrs. V eruie Jones vis ited Mrs. Edward H arris of Phenix Saturday afternoon. Mr. and M m Atwiil Powell of Lynchburg, visited Mr. and M m Vernie Jones Saturday night. Mrs. E lliott Nash and f in . Nel son Maim w ere dinner, guests F ri day of Mrs. Shirley K err of Ap- Saudaj seas M others Day a n d ! pomattox tW ujone who oat- a m other shoaSd Mr. and M m Nelson M ann vk- appa-eciate them more each day. ited Mr. and M m H. D. Jennings M m W . H. E ider and girls of I and OarroH of Lynchburg, Sat-"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "aar and Miss Roth <mark>Woodson</mark> Mon day. Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "aar and Miss Roth <mark>Woodson</mark> Mon day. Mr. and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2026.68, 222.42, 2170.0, 479.36], "bbox_id": "d7710e34b6", "file": "TimesVirginian_1981a_0101.pdf", "page": 1, "text": "he was a son of the late George Ewen Perdieu and Aver Woodson Perdieu. He was a retired employee of Vaughan Chevrolet and Cadillac Inc. and a member of Trinity United Methodist Church. In addition to his wife, he is survived by a son Robert Edward Perdieu, Lynchburg a Sister, Mrs. Carl Lipscomb, Lynchburg a grandson, Robert E. Perdieu Jr., Lynchburg a granddaughter, Mrs. Donna Lynn Hutcherson, Charlottes ville, and one great-grandson, Zachary Alexander Perdieu. Funeral services were con ducted at 11 a.m. Thursday at the- Whitten Park Avenue Chapel by the Rev. Stephen Hassmer. Burial was in the Presbyterian Cemetery. Whitten Park Avenue Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Ewen Perdieu and Aver <mark>Woodson</mark> Perdieu. He was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Ewen Perdieu and Aver <mark>Woodson</mark> Perdieu. He was a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.57, 669.86, 2179.32, 824.1], "bbox_id": "0e24f6cc5f", "file": "AppomattoxNewspapers_1949-1952a_0279.pdf", "page": 1, "text": "He is survived by his wifi, Mrs. Edna Oahoon Torrence two daugh ters, Mrs. Eugene Barclay, o Br.eoni- all, Pa., and Mrs. Geo. Nichols, of Alexandria, Va. stepsons Whitney, and Edward C. Booth four sisters, Mrs. Charles Agea, of Farmville Mrs. F. A. OBrien, of Appomattox Mrs. .W. D. Woodson, of Lynch burg, and Mrs. R. W. Morris, of pomattox five brothers, A. B. Tor rence, of Elkton D. E. Torrence, of Appomattox J. L. Torrence, of Ap pomattox  I. G. Torrence, of Lynch burg, and J. H. .Torrence, of Ap pomattox and four grandchildren."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Va. stepsons Whitney, and <mark>Edward</mark> C. Booth four sisters,"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Va. stepsons Whitney, and <mark>Edward</mark> C. Booth four sisters,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1464.46, 284.37, 1640.97, 1186.16], "bbox_id": "a3a948d4de", "file": "AppomattoxNewspapers_1926-1933a_0097.pdf", "page": 1, "text": "GOLD HILL 6th grade, Mary Gowin. 4th grade, Edward Webb. 3rd grade, Donald Webb, Billy Inge. 2nd grade, Malcolm Coleman. Primer, Lizzie Webb. spout spring Beginners, Charlie Johnston. 1st grade, Frances Howerton. 2nd grade, Alice Garrett, Will iam Moon 4th grade, Viola Reynolds, Evelyn Martin, Christine Rob erts. 5th grade, Ruth Robertson, Eleanor Martin, Katie Wool ridge. 6th grade, Nannie Jones.  7th grade, Horace Shirley, Annie Martin. A ppomattox A. H. S. 4th year, Corinne Hancock, Lucille Joy, Richard Jenkins, Frankie McKinney. 3rd year, Hallie Burnette, Sara Dickerson, Mary Jamerson, Lucy LeGrand, Floyd Dinkins. 2nd year, Virginia Puckett, Kathleen Paulette, Homer Bab cock, Verta Simms, Grace Bur nette, Louie Cawthorn, Edith OBrien, Dora Abbitt, Virginia Lee Thompson, EleanorHarwood. 1st year, Virginia Carson, Eliza- bethRobertson, Mary Grey Sears.  Charles James, Gladys Inge, Bil ly Dickerson, Alfred Harwood, Berta Rogers, Charles Crawley, Mary Woodson, Fay Babcock, John Hesson, Virginia Holt, James Morris, Lottie Lucado, Annie Giles, Nollie Lewis, Gert rude Stewart. 7th grade, Josephine LeGrand, Evelyn Dickerson, Betty Bloxton, Addie Lena Ferguson, Lucille Cralle, 6th grade, Mandane Anderson, Nellie Bloxton, Carrie Jamerson. Hilda Moore, Claudine OBrien, Eloise OBrien, ElizabethvTrent,  James Davis, Billy Hubbard, Ed ward Marshall,Garland Plunkett. 5th grade, Ruby Cole, Marion Agee, Leilas Davis, Mary McNal ly, ThelmaMoris, DorothyTweedy, Annie Laurie Marshall, Ma- belle Smith, Mabel Hall, Elizabeth Cralle, Raymond Jamerson, El liott Torrence, Lawrence Moore, Harry Lee. 4th grade, Christine Caldwell, Geneva Wingfield, Cecil Connor, Elna Smith, Willie Guthrie An- i derson, Erna Dickerson, Roberta  Dinwidde, Lorraina Hardy, Billy Smith, David Carter. 3rd grade, Anna Carter, Vir ginia Christian, Edith Cole, Net tie Davidson. Olla Mae Dinkins, Hatti Guill, Virginia Epes Irby, Edith Lucado, Eleanor Rosser, Dordthy Sears, Erna Stanley, Cathrine Tweedy, Frances Smith, Thelma Torrence. 2nd grade, Caroline Moses I Virginia Hall, Virginia Almond Rachel Trent, Kathleen Trent, Bess Christain, Pat Sears, Lucille Ferguson, Eunice Smith, Ola Furbush, Dick Dickerson, Joshua Pretlow, Alfred Torrence, C.G Smith.  Grade 1, B, Emma Hicks. Edith Smith, Ruth Handy, Carrie Guill, Marie Mays, Rachel May- oerry, Lucille Godsey,  Richarc"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Mary Gowin. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Donald"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Mary Gowin. 4th grade, <mark>Edward</mark> Webb. 3rd grade, Donald"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1807.46, 243.83, 1968.88, 1263.71], "bbox_id": "b531343034", "file": "AppomattoxNewspapers_1892-1898a_0362.pdf", "page": 1, "text": "Goiu,Saml H , est ....... 703 12.9 Goin, Jas M ................ 10 3 Haycock, Maggie W... 125 1.3! Harvey, Jno F ............ 249 2.61 Hollovan, Mary E ....... 60 1.81 Gull, Otho .................... 60 1.51 Hix, Williams est ..... town 21 4af lot Johnson, Richard est..-store  4.2 house Jones, L D ...... . .......... 300 6.3C  Jennings, Phoebe...... 214 5.63 JoDes. W D ....... ?. ........ 239 3.76 Kyle, Ro R .................. 403 6.39 Lewis, Shedruks est.. 188 3.11 LeGrand, A A e s t ...... 233 3.68 Meadows, Ro P ............ 12 51 Mitchell, B W and 10 2 2.17 Jane. Phelps, Wms est ....... 1 1 1 28 Pauktt, Sarah ............. . 54 2.00 Paris Elijah., ............. 34 57 Riuison, Elizabeth T.. 27 86 Raymond, Sarah J..... 75 2.75 Scruggs, Edward ....... 23 80 Thornhill, Mildred est 10 0 2.63 Thornhill, Eliz ............ 146 3.87 Walker, Wms est ....... 124 2.07 Woodson, Abadiah est 117 1.87 Wingfield, Wm AT.... 55 1.16 Webb, Nancy M ...... 50 1.58 Webb, Merry and H. 200 3.15 Goins est. COLORED. Abbitt, John and 17 38 Elijah Clark. Diuguid, Ch H ............ 2  3.03 Durphey, Dennis...... town 63 lot Elam, Nelsons est ..... 8 78 STONEW ALL DISTRICT. Abbitt, Lucy O ............ 1 2 1  2.06 Barrick, J W T r for 115 4.87 Geo Barncks. Evans, Dr D R ............ 10 28 Foster,M A, C J, M R, 1 Ò 2 1 Eliza and E. A. Pear man. Foster, H J heirs ..... 1 2  28 Harris, Jno est ............ 1  8 Harrison, Wm D ....... 175 5.55 Hundley, Eliza A ..... 1 1  51 Moore, Sampson .......... 801 2.52 Neister, Willis W ....... 60 3.16 Phelps, J C aud wife 6 38 PearmaiijC Rand wife 1 2  28 Reid, Wm. .................  2 10 Shearer, Henry B ....... i 2 1  30 Walton, J C and J W  9 aud S P Vawter, - COLORED. Coleman, Geo ........... . 33 1.05 Moore, Henry .............. 4 63 SOUTHSIDE DISTRICT. Clark fc Collins .......... town 1.58 lot Clayton, Lucy A ....... 125 2.63 Davis, Temple T r for 33 74 S Baldwin. Elliott, Andrew A ..... 149 1.58 Elliott, Jas W .............. 528 5.54 Farrar, M aryW . ........ 30 63 Farrar, Southeys est 1 1 0 1.75 Fore, Reuben est ....... 148 3.89 Farrar, Chas. H ......... 28 49 Farrar, O W ................ 84 1.25 Giles, Josiahs est ..... 12 0 1.58 Jones, Tho J, Ann O 15 59 and G S. Lee, Catherine G ....... 39 1.24 Martin, Chas ................ 69 91 Marshall, J M est ....... 503 13.21 Marshall, Jno W est.. 26 70 McKinney, John ....... 6501 13.70 Meadows, Fannie A... 104 2.75 Morris, Mary R. ....... .  28 Paulett, Presley B est 126 3.99 Ragsdale, Mary E and 460 12.08 children. Smith, Maria B and 108 2.55 others. Stewart, Duncan ....... 124 3.43 Toney, Jno M est ....... 200 2 .10 COLORED. Bakers, Jno est ............ 107 3.40 Cheatham, Lewis ....... 6 31 RECAPITULATION. T otal Southside District.. 81.95 Clover Hill-District 108.03 Stonewall District.. 22.35"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "J..... 75 2.75 Scruggs, <mark>Edward</mark> ....... 23 80 Thornhill, Mildred"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "J..... 75 2.75 Scruggs, <mark>Edward</mark> ....... 23 80 Thornhill, Mildred"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [773.26, 419.02, 927.38, 1296.41], "bbox_id": "fd08ae7480", "file": "AppomattoxNewspapers_1918-1922a_0368.pdf", "page": 1, "text": "Forest View Tbe earth is clad iu a, mauti of enow and everything it beautiful The X nas h- lida s passed off qufoily ami the younu pe ple seemed t en j y them ir. and Mrs J A Martin returned 1 ft week from a two weeks visit to Grifton, N. O., Eat tern Shore of Virginia, Peaniman, Drewrys Bluff au Petersburg, where they have oeen visiting relatives They had a most enjoyable trip. Little Erna Wooldride was taken to Lynchburg Hospital last weeK where she underwen a very serious operation which was pronounced bloodpoison oi the leg We hope for her a speedy recovery. Mr. EveretteFerguson, Misses Mattie Ferguson, and Laura Nash were visitQrs at the home f Mr and Mrs. R. W. Martin during the holidays. Mr. W. T Nash is walking wound very proud, Itd a boy. MBsrs. Schuyler, Abbitt and Uavjd Marshall, of West Va., were visiting home folks Xmas. Mr. and Mrs W. W. Overton and children, of Brookneal, Va , Mary Dong Marshall, of Prince Edward, and Mr. John Mar shall, of Lynchburg, visited their parents, M-. and Mrs. N D. Marshal1, Xmas. Mrs. Thos luge accompanied by her two daughters, Misses Della and Gladys, visited her daughter, Mrs. vV. T. Nash, during the holidays. Miss Eunice Woodson, of Lynchburg, spent tbe holidays with her parents, Mr. and Mrs. Lucian Woodson Miss Fettie Ford and Mr. Lawrence Laughlin, of Lynch burg, were married Xmas day. They were visitors at the borne of the formers parents, Mr. and Mrs. T. H. Ford, during the holidays. Miss Lelia Jones and Mr. Edward Harris, of Charlotte county, were mafried Xmas. We wish these two couples much happiness and prosperity. The writer wishes to txtenu her most sincere sympathy to the family of Mrs. R C Mann, who died last week and was buried at her old home place Saturday, in the presence of a large crowd of friends and rela tives We know this good woman will be missed, she has taught us a lesson of patience and everyone who knew her loved her Much success to the Times- Virgiuian."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Dong Marshall, of Prince <mark>Edward</mark>, and Mr. John Mar"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Dong Marshall, of Prince <mark>Edward</mark>, and Mr. John Mar"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.36, 905.94, 1775.08, 1118.97], "bbox_id": "8b3caf0377", "file": "AppomattoxNewspapers_1926-1933a_0486.pdf", "page": 1, "text": "ene Woodson were dinner guests of Mr. and Mrs. Hunter amerson Thursday. Mr. and Mrs. C. W. Potts and Mrs. Bledsoe Clement and Son, Johnny, of Lynchburg, were guests of A. Ji. Clement Sunday. Mrs. Edward C. M artz and Mrs. Bud Fletcher, of H arri sonburg, were . guests in the hcfme or A. H. Clement for the week-end.- ,  Miss Corinne Hancock has gone to Bluefield to join her sisters, Misses Annie and Jess- elyn, in a visit with relatives there, F. L. Martin and J. K. Pul- will attend the Carriers"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "ene <mark>Woodson</mark> were dinner guests of"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "ene <mark>Woodson</mark> were dinner guests of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1954.9, 321.75, 2284.0, 491.15], "bbox_id": "0e23c57649", "file": "AppomattoxNewspapers_1926-1933a_0121.pdf", "page": 1, "text": "Died at the home of her sister  This young girl succumbed to Mrs. Florence Price at Pamplin  the rages of measles at her home last Thursday in the 76th year six miles south of here yesterday of her age. She was buried Fri-in the 18th year of her age. She day afternoon at Olive Branch  was the daughter of Courtney R. Church, of which she was a Woodson and the grief and sor- member since her early childhood  row at her unexpected death is days. She leaves to mourn their  indescribable. Her remains were losB four brothers and one sisterinterred today at 5 P. M. at her Walter Hubbard, of Washington, I late home. ID. C., Robert and Sam Hubbard, I of Prince Edward Co., W. B. Hubbard, of Hixburg, and Mrs. I I Florence Price, of Pamplin. ROCKS NEWS"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "which she was a <mark>Woodson</mark> and the grief and"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "which she was a <mark>Woodson</mark> and the grief and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.92, 598.48, 1827.32, 1143.4], "bbox_id": "6509df22eb", "file": "TimesVirginian_1976_0235.pdf", "page": 1, "text": "Dickerson, Ricky Dickerson, Lynn Dodd, Pam Dodd, Robbie Dodd, Rhonda Doss, Kim Drinkard, Scot Drinkard, Shel by Dunnam, Mary Dyess, Karl Ewers, LaTrelle Ewers, David Eye and Garlene Gaines. Also, Renee Glover, Susan Godsey, Peggy Goin, June Harris, Trudy Harris, Bobby Cindy Howard, Sandy Jamerson, Debbie Johnson, Jennifer Johnson, Kathy John son, Kim Johnson, Susan Johnson, Cheryl Martin Kerr, Maria King, Debbie Lawson, .Bonnie Kaye Layne, Paula Lea, Kathy Lewis, Laura Magann, Cheryl Matthews, Robin Mar tin, Roxanne Martin, Kim Maxwell, Regina McCormick, Donna Mitchell, Kristie Mitch ell, Shiraine Montgomery, Gail Moore, Terri Moore, Cindy Morris, Nancy Morris, Susan Morris, Gray Nash, Tamara Nash, Terri Nash, Elizabeth Pierce and Darrell Puckett. Also Lisa Puckett, Gayle Pugh, Leslie Ranson, Suzette Ranson, Ann Redman, Sheryl Redman, Laura Redman, Amy Roberts, Lisa Roberts, Donna Robinson, Kinekle Robinson, Diana-aShert Debbie Smith, Unda St. John, Eve Thomas,Brenda Thomp son, Unda Torrence, Harold Vassar, Sherry Vassar, Faith Vaughn, Teresp Warmer, Re nee Wells, Julio Gail Williams, Renee Wilhams, Angela Wood- son, Cynthia Woodson, Donna Woodson and Merry Weight. These students are from Appomattox Campbell, Am herst, Prince Edward counties and Lynchburg, V a. Students receiving Gold Certificates from the Virginia"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Woodson"], "snippet": "Angela Wood- son, Cynthia <mark>Woodson</mark>, Donna <mark>Woodson</mark> and Merry"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Woodson"], "snippet": "Angela Wood- son, Cynthia <mark>Woodson</mark>, Donna <mark>Woodson</mark> and Merry"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1895.75, 247.16, 2053.8, 996.62], "bbox_id": "61f555dfb5", "file": "TimesVirginian_1981a_0259.pdf", "page": 1, "text": "death, he Was employed as administrator for toe gover nors committee on employ ment of handicapped in the Division of Vocational Rehabili tation of tiie Delaware De partment of Public Labor. In addition to Ms wife, the former Ellen Ruth Blattspieler, he is starvivtd by throe brothers, N. C. Terry, Crite, J. B. Terry, Appomattox, and G. A. Teriy, Chevy Chase, Md. four sfeteto, Mary T. Robinson, Richmond, Sallie T. BaiOio, Norfolk, Elizabeth T. Wing field, Pamplin, and Ann T. Lindenblad, Arlington, and a number of nieces and nephews. Funeral services wereheld in Wilmington on Tuesday morn ing and graveside services were heldi at 11 a.m. Wednesday atSpring Creek BaptfetChurch, Prince Edward County. Robinson Funeral Home was in charge of local ariange- ments. James Howard Viar PHENIX - James Howard Viar, 68, Star Route, Phenix, died Monday evening, Aug. 3 near his home. He was born Dec. 4,1912, in Charlotte County, a son of the late James Henry Viar and Hattie Cobbs Gilliland Viar. He waa a member of Staunton River Baptist Church and was retired from Southern State Co-operative. He ia survived by his wife, Myrtle Lee Viar three sons, Ronald Wayne Viar, Harold Roland Viar, both of Phenix, and Donald Lee Viar, Lynch burg two daughters, Miss Emily Jane Viar, Phenix, and Mrs. Sandra V. Herman, Red Bank, N. J. a granddaughter, . Stephanie Lee Viar a brother, John Viar, Akron, Ohio four sisters, Mrs. H. T. Guthrie, Lynchburg, Mrs. Norman Br ooks, Kenbridge, Mrs. Lewis Williams, Charlotte Court House, and Mrs. Donald Barr, Virginia Beach. Funeral vices were con ducted a t 3 p.m. Thursday at Staunton River Baptist Church by the Revs. Harold Beagle and W.S. Wallace. Burial was in the church etm etorr. Henderson Funeral Home waa in charge of arrangements. Janie A. Weedseu Janie A. Woodson, 77, Route 3, died at 1280 p.m. Sunday, A a M Ata .fcpntheurg JBnMrak- Hoapttel. v"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "atSpring Creek BaptfetChurch, Prince <mark>Edward</mark> County. Robinson Funeral Home"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "atSpring Creek BaptfetChurch, Prince <mark>Edward</mark> County. Robinson Funeral Home"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [160.57, 958.1, 642.17, 1240.03], "bbox_id": "0d5621a1e6", "file": "AppomattoxNewspapers_1908-1909a_0510.pdf", "page": 1, "text": "dav I tioh is improving, it is said.  been at his bed side Mr and Mrs W S Comine There was a reorganisation I Mrs. T. H. Ford u sick. JfcSi C hlco,   su n d ., -hoc? of t h . . U  . M f f n i. not  well spending some time on their Presbyterian church here laBt j at this writing, farm here. I Sunday Elder R. L. Price was Mr. and Mr J. D. Johnson ihosen as teacher of the Bible ahd children, of Lynchburg, class, Bascomb Price, as teach- apent the week-end with 1 Mrs. er of the advanced class. Miss Cora Johnson Crawley as teacher of the in- Mrs. J F HarvdV Mr. and I termediate class, and Mrs. C. I her home at Wesley Chapel, Mrs. Oscar Cole and Miss Emi- A. Allen of the primary class after spending a week with her ly Harvey spent Sunday in Dur- and Mr. Moore, who h a s so  parents, ham, N. C., visiting relatives, faithfully superintended the Mrs. Kate Parker and family I school for many years was re- of Norfolk, paid a short visit to elected.  her cousin, Miss Emma Smith, Edward McCracken, of Wm- Tuesday afternoon.  Chester, Ohio, is here on a visit J. N. Woodson and family to his grandmother, Mrs. Me of Richmond, visited in the jCraCken, and h is other reia- home of Mr Helene Welch tives in tiie county. Sunday I J. P. Richardson, 84, died at Mr and Mrs. T. A. Moses bis home near Piney Ridge and Mr. and Mr F. C. Dree-1 church on last Sunday  ser visited Mrs. Mary Moses, I O 0 near Vera, last week l l_ SOUTHSIDE Frank Gilliam of Roanoke I O   9 spent several days l a s t week I SOUTHSIDE,Mr A. A."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "cousin, Miss Emma Smith, <mark>Edward</mark> McCracken, of Wm- Tuesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "cousin, Miss Emma Smith, <mark>Edward</mark> McCracken, of Wm- Tuesday"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [526.52, 257.47, 711.39, 707.21], "bbox_id": "26ce10566b", "file": "TimesVirginian_1983a_0435.pdf", "page": 1, "text": "Covington with Mrs. Woodalls parents, Bfr. and Bfrs. Clarence Coffey. Bfrs. Lave Torrence sjpent the week end with her daughter, Bfrs. James Conner and Bfr. Conner. Bfrs. Conner and Bfrs. Torrence visited Bfrs. Edna Covington at the Spout Spring Home for the Aged Saturday. Mrs. L. L. Webb, Bibs Joyce Webb and Mrs. Marshall Goin visited Bfrs. Bettie Woodson of Lynchburg Satur day, Bfrs. Viola K. Franklin died early Sunday morning at the Guggenheimer Nursing Home in Lynchburg. Our sincere sympathy and prayers are with her loved ones and friends. We were very sorry to hear Bfrs. Russell Glady M. Turns of Amherst died Sunday. Our prayers and sincere sympathy are extended her loved ones. Visiting Mr. and Mrs. Robert Coleman were Bfr. Edward Conner, Bfr. Richard Carter, Bfr. Johnnie Carnefix, Bfrs. James Conner, Bfr. ,Calvin Smith and Bfr. and Bfrs. Bobby Smith. i Bfr. and Bfrs. David Franklin visited Mrs. Edna Covington at the Spout Spring Nurisng Home Sunday after noon. Bfr. and Mrs. Henson Bforris and Bfr, and Bfrs. Harold Bforris visited Bfrs. L. L. Webb and daughter, Joyce, Sunday. Mr. and Bfrs. Elliott Torrence spent Thanksgiving week end with their son, Bfr. Larry Torrence and Bfrs. Torrence and family, of Woodbridge, Va. Kieth and Becky Webb spent the week end with their, grandparents, Bfr. and .Bfrs. Monroe Webb. Others visitinjg in this home were Mr. and Bfrs. Jim Webb, Bfrs. Marshall Goin, Miss"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Goin visited Bfrs. Bettie <mark>Woodson</mark> of Lynchburg Satur day,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Goin visited Bfrs. Bettie <mark>Woodson</mark> of Lynchburg Satur day,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.28, 542.91, 1785.67, 1809.3], "bbox_id": "a58fb947a3", "file": "AppomattoxNewspapers_1892-1898a_0081.pdf", "page": 1, "text": "Concord News. A joint convention of the Peoples party of Appomattox and Campbell counties met in Evans Hall, this place, at noon last Friday to nominate a floater to the legislature, from the above named counties. Chas. T. Moses, of Appomattox,, was chosen chairman, and Dr. T. W. Evans, of Campbell, secretary of the conven tion. Wm. A. Thornhill, of Appo mattox, was nominated by acclama tion- as the floater candidate. There were about thirty delegates in attendance and considerable enthus iasm prevailed in their ranks. Ed ward Moormaw, Dr. T. W. Evans, C. B. Bloxton, Jas. P. Fleshman and others responded to calls for speeches. Each speaker seemed to he quite sanguine of the success of their ticket, and well pleased with the general outlook for their party in the State. A very ludicrous, if not significant, incident occurred while the conven tion was in session. A large flock of scavenger birds, commonly known as tnrkey buzzards, after hovering for a while over the Convention Hall took flight in direction of Charlotte county. It was a custom amongst the ancient augurs to predict success or failure of any enterprise from the flight of birds and it may be that onr Third party brethem can gather some consolation from this question able omen. However, a local wit comments on the incident in this manner These birds were in hot pursuit of the defunct remains of the Third party, and after locating it in the Convention Hall, immedi ately took flignt to Charlotte, where it had been previously announced, that there would be a similar gather ing of the same party on Monday. Rev. J. W. Hilldrup has been con ducting protracted services at Salem church, during the past week. Seven persons united themselves with Bethlehem church at this place on last Sabbath, as a result of a series of meetings held with the above-men tioned church, and conducted by Rev. Mr. Hilldrup, assisted by Rev. L. B. Betty, of Court street church, Lynchburg. Rev. Wm. Fisher returned from Clays Crossing last Friday, where he had been assisting his son, Dr. W. F. Fisher, in a series Of meetings. Miss Coston, of Salisburg, N. C., has accepted a situation as teacher, in the family of Mr. Jos. Cardwell, for the next session. Miss E. P. Abbott, a recent gradu ate of the Methodist Female college, Danville, Va., will teach a select school at her home, Edgewood, dur ing the fall and winter. - j Prof. Ruse Evans, formerly of this place, has been elected assistant instructor in New London Academy, Bedford connty. Mr. Osman Howerton, who has been quite ill with fever, is now con valescent. Mr. James Akers has recovered sufficiently from his recent attack of rheumatism, as to appear in town again Saturday. Jim may have been low in spirit, bnt he holds on to the avoirdupois just the same.. Mrs. Victoria Arrington, in com pany with her daughters, Misses Sallie and Florie,is visiting her sister, Mrs. Woodson, in Lynchburg. Misses Annie and Della Steele, of this place, will leave for Roanoke, Wednesday the 15th inst. Miss L. B. Pan key, of Pamplin City, is visiting Mrs. Dr. Mott Rob ertson, near Spout Springs. Misses Taylor and Bondurant, stu dents in the South Side Female Insti tute, left for Burkeville, Wednesday. Dr. Edward D. Fisher, of Durham, N. C., reached here Monday morning on a visit to his old home. Your paper is extremely popular in our place, and we wish you all success iu your worthy enterprise. Q uid nunc ? Sept. 11, 1893."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "visiting her sister, Mrs. <mark>Woodson</mark>, in Lynchburg. Misses Annie"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "visiting her sister, Mrs. <mark>Woodson</mark>, in Lynchburg. Misses Annie"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1269.09, 844.5, 1382.36, 1049.38], "bbox_id": "6e0e6dd37c", "file": "AppomattoxNewspapers_1955-1957a_0212.pdf", "page": 1, "text": "Clarence Alfred Agee, Jr, in his sleep at his home here -day morning. Born in Appr February 9, 1920, he was f old, and the son of Clare- Agee, Sr., and M argie 8 Agee both of whom survive, Other survivors include on ter, Mrs. Allen L. Wood Jr, a brother, Edward Earl Agee, of Appomattox. He was a of Liberty Baptist Church Funeral services were held Liberty Baptist Church Tr 4 00 P. M., conducted by the tor, Dr. Carl A. Collins, Jr7 was made in Liberty Ceme Pallbearers were Ralph rence, Lankford Torrence, Woodson, Reese Thompson, Agee and Waldell Cheatham."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Wood Jr, a brother, <mark>Edward</mark> Earl Agee, of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Wood Jr, a brother, <mark>Edward</mark> Earl Agee, of Appomattox."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [133.2, 568.12, 365.4, 1800.2], "bbox_id": "bc43312d4a", "file": "AppomattoxNewspapers_1912-1915a_0038.pdf", "page": 1, "text": "c o r r e s p o n d e n t an interesting aooount of his first trial at growing tobacoo on Virginia soil. He sold the crop in this market and at prices ranging from eight to fifteen dollars per huudred. Having been compli mented on his succeat at his maiden venture he andidly gave all the credit to au old negro who had managed the crop from start to finish. Reared as he was on a farm in England he should be congratu lated on the readiness with which he caught on to Virginia methods. Let all new comers go and do like wise asd there will be no such word as failure in the histoiy-of any far mer who comes to oast in his lot with os.  Mr. B B. Woodson, of Cumber land, was in town on Monday, hav ing made the trip in his fa. t-going auto and was all smiles as he moved on our smooth avenues. With the coming of the machine good road ways in winter as well as summer may follow and the thing of most practical value to this section will have been ccomplished. The rural mail carriers may yet be teen flying about in tbeir cars. And parcels post packages will then have no terrors for them. Mr. I. 0. Johuaon and family have been feasting on the second crop of strawberries for the season And they aie perfect in shape, red ness and flavor. Bears the Lettuce growers are busy sowing signature o f the seeds for another crop and many will be tempted to make the venture. If they ony learn to grow the plants as the oid Confederate has done they will be richly rewarded for their labors. Professor Martiu, principal of the Farmville high tehbol, has recently had thp patrons to meet with te faculty and no v parents and teach ers are in closer touch and this must mean better results. The nsw buildiug is now promised for De cember 1st. The foot ball team of the school suffered distressing defeat at the hands of thé Blackstone Institute team, but nothing daunted they will go to the Blackstone grounds and try again. Be it said, however, in favor of the home team fia t the Blackstone beys are very much heavier, almost men compared with boy t. In these modern days ball must be playing hob with books Anyhow it lookB so to an outsider He, however, may be an old fogy and a back number. Governor Mann still giving out no names for members of the Nor mal Board. References made by the Lynch bnrg papers to the exhibits at the Fair made by G rman farmers now working Virginia soil,made interest ing reading. We hve some of lik kind in Prince Edward but there room for othersuany others. On-, of the number who is engaged ii trucking near town, is securing a brilliant success. He has bought laud on time and will pay for it il be lives. Little Buffalo is now bridged by concrete and big Buffalo is b dag spanned by an iron sructnre. Th Tne work having been well done re pairs will not be in cons ant de mand. Whats tine of bridges i just as true of the roadways in gene ral. When worked on the work should be of such nature ai to t end permanent. We have be?n playing on roads all too iorg. The meetiug at the Baptist Church, which lasted for two weeks, resulted in 80 professions of faith, 24 of whom will unite with that church, the pieachmg being doue Rev. Waterfield, pas or of Clay street Church, Richmond. Laige crowds a.tended the services and listened to the pare gospel earnestly preached. This may be followed mm mother meeting at the Piosi-y ffrirtiT church is the near fuiure"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "os.  Mr. B B. <mark>Woodson</mark>, of Cumber land, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "os.  Mr. B B. <mark>Woodson</mark>, of Cumber land, was"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [143.04, 260.15, 325.55, 708.68], "bbox_id": "4f1a7fb402", "file": "TimesVirginian_1983a_0435.pdf", "page": 1, "text": "By MARY BAGBY Go ye therefore, and teach all nations, baptizing them in the name of the Father, and the Son, and of the Holy Ghost Matt 2819. Our sympathy is extended the family and loved ones of Mr. Edward Almond of Roanoke, who passed away last Week after a long illness. Mr. and Mrs. Alfred Almond, Mr. and Mrs. Jerry Kendrick, Jeff and Jodie Kendricks, Mr. and Mrs. James Almond and family, Mrs. Wayne Smith and Mrs. Tim Ramsdetl attended the fUneral Friday morning in Roanoke of Mr. Edward Almond. We extend sincere sympathy to the family and loved ones of Mr. Tom Edd Woodson who passed away at his home last week. We extend sincere sympathy to the family and loved ones of Mr. Luther Nash who passed away iast week. We are very sorry to hear Mr. David Marie Smith is a patient in the Lynchburg General Hospital. Our prayers are with him and his love ones. May he have a speedy recovery. Mrs. Nancy Coleman Farmer is a patient in a Fredericksburg hospital. Our get well prayers are with her and her love ones. Our prayers are with Mrs. Gladys C. Wilkerson who remains very iU in the Southside Hospital in Farmville. Mr. Kenneth Deaner was a supper guest of Mr. and Mrs. Billy Franklin and family Thanksgiving evening. Mr. and Mrs. James Mawyer and family had as their Thanksgiving supper guest Mr. John Donoughe, of Pennsylvania, Mrs. Willie Riley and Mr. and Mrs. Earl P riw , of"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "loved ones of Mr. <mark>Edward</mark> Almond of Roanoke, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "loved ones of Mr. <mark>Edward</mark> Almond of Roanoke, who"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1286.14, 246.32, 1470.11, 1608.66], "bbox_id": "7931a86129", "file": "TimesVirginian_1983a_0139.pdf", "page": 1, "text": "By MARY BAGBY Come unto me, all ye that labor and are heavy laden, and I will give  you rest. Take my yoke upon you, and learn of me, for I am meek and lowly in heart, and ye shall find rest unto vour souls. For my yoke is easy and my burden is light Matt 1128-30 Our hearts were deeply saddened when word came Monday of the tragic death of Staff Set. Ben H. Maxwell who was killed in a terrorist attack in Beirut, Lebanon. He was a native of Appomattox and a member of Hollywood Baptist Church. Ben was liked and loved by all that he came in contact with. Our deep and heartfelt sympathy is extended his mother, Mrs. Virginia Maxwell, his wife, Sirs. Maxine Maxwell, five sisters, Barbara, Nancy, Lelia, Janie and Martha and other- loved ones and friends. We wish to extend our sincere sympathy to Rev. and Mrs. W. H. Elder and family in the death of his mother, Mrs. Cary Elder of Halifax who passed away at the Virginia Baptist Hospital Thursday. Our prayers and love are with her family and loved ones. Chucky Daniel, the infant son of Mr. and Mrs. Wayne Moss of Dfilwyn, died suddenly Friday. Mrs. Moss is the former Jane Ferguson and a daughter of Mr. Nat Ferguson. We extend our sincere sympathy and prayers to the family and loved ones.  We are so glad Mr. Henry Earl Covington, who is still a patient at the University Hospital at Char lottesville, is improving somewhat. We wish him a speedy recovery. Mr. Ernest L. Day is still a patient in the Lynchburg General Hospital, but we are happy to hear he is improving. We wish him a speedy recovery. We hope Mr. John Goin, who isnt to well at this time, may soon be well again. We are very sorry to hear Miss Donna Franklin fell Saturday night and broke her leg in two places. Our prayers are with her. May she have a speedy recovery. We hope Mrs. Elmo Smith may be feeling better real soon. Mr. Lewis Harris remains ill in the University Hospital at Char-  lottesville. Our prayers are with him and his love ones. Among those visiting Mr. and Mrs. Robert Coleman were Mr. Calvin Smith and Mr. and Mrs. Allen Carmody. Congratulations and best wishes are extended to Mr. and Mrs. Louis Edward OBrien who were married Saturday afternoon, April 16, at Central Baptist Church in Altavista. Mr. and Mrs. L. L. Webb and Miss Joyce Webb visited their sister and aunt, Mrs. Lawrence Woodson, of Lynchburg, Friday. Among those visiting Mrs. Edna Covington last week were Mrs. Lave Torrence, Mrs. James Conner, Mr. Thomas Woodall, Mrs. Kather ine Wingfield and Miss Julia Wingfield. Kenneth Stuart Deaner was a supper guest Thursday night of his, grandparents, Mr. and Mrs. Kenneth Deaner and family. Mr. and Mrs. Rufus Wingfield of Roanoke, spent Friday and Satur day at their home in Appomattox. They visited in the homes of Katherine and Julia Wingfield and Mary Bagby. Mr. and Mrs. Sammie Inge spent Friday night and Saturday with Mrs. Madeline Inge. Mr. and Mrs. Henry Covington and Mr. Nat Ferguson visited in this home Saturday. Mr. Johnnie Bryant remains iU at the Lynchburg General Hospital. Our prayers are with him and his love ones. Among those calling in the home of Mrs. Mary Bagby were Mr. Frank Schampel, Mrs. Monroe Webb, Mrs. Shirley Franklin, Mrs. Kenneth Deaner, Mrs. Madeline Inge, Vickie and Robin Davis, Katherine and Julia Wingfield, Thomas, Ruby and Lisa Woodall. Mr. and Mrs. Monroe Webb visiteid Mr. and Mrs. Marshall Goin and family Saturday night. Mrs. Marshall Goin entered the Virginia Baptist Hospital Sunday and will have surgery Monday. We pray she will have a very speedy recovery. Mr. David M. Smith entered the Lynchburg General Hospital Sun day and will have surgery Tuesday. We pray he will have a very speedy recovery. Mr. and Mrs. Jack Reed, of Lynchburg, visited Mr. and Mrs. Kenneth Deaner and family Sunday afternoon. Mrs. Billy Franklin and Kenneth Stuart Deaner were dinner guests in this home Sunday."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Mr. and Mrs. Louis <mark>Edward</mark> OBrien who were married"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Mr. and Mrs. Louis <mark>Edward</mark> OBrien who were married"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [567.84, 328.49, 735.11, 660.33], "bbox_id": "e544f9f2f0", "file": "AppomattoxNewspapers_1955-1957a_0067.pdf", "page": 1, "text": "Browder. Edward will enter Mor gan State in February. Eugene Browder is now in the Navy, at Bainbridge, Maryland. We are in deed proud of our former gradu ates and the splendid progress they are making. We always like to have them back and visit us. Prior to our holiday, we were very glad to have two representa tives from the Row, Peterson Com pany visit our English classes. They serve in the capacity of Consult ants. Dr. Aubrey Keesee, Supervisor of Instruction, introduced Miss Grossenbacker, who gave a demon stration lesson to two English class es. Much helpful information was given on the use of the new English texts. Our next basketball game will be with Charlotte Court House, there, onWednesday night. The girls will play a preliminary game against the Charlotte girls. Friday night we play Carter G. Woodson High of Buckingham here. Girls will play the preliminary game. Dont miss the game! Until next week, our thought From contemplation one may be come wise, but knowledge comes only from study."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Browder. <mark>Edward</mark> will enter Mor gan"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Browder. <mark>Edward</mark> will enter Mor gan"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [416.91, 562.3, 589.57, 1055.24], "bbox_id": "d329fb3023", "file": "AppomattoxNewspapers_1926-1933a_0180.pdf", "page": 1, "text": "B. E. Megginson has been ap-1 pointed Special Constable in I Stonewall District, with R. L. j Burke as surety. I W. H. Meadows and O. E. I Peterson were appointed trustees I for Pamplin Methodist Church! property and Travis Harvy trus- tee for Evergreen Church prop erty. W. L. Johnson charged with unlawful shooting, upon his trial I was aquitted. Commonwealth vs. Edward Williams-bond forfeited and C. W. Smith was ordered to pay over .to Commonwealth the sum of 500 amount of bond forfeited. Commonwealth vs. L. C. God- seyupon a trial of his case hel was acquitted. I C. R. Woodson  Co. vs. W. j B. Harvyverdict of jury of 101 I damages was sustained by court, j Commonwealth vs. Ed. Lucado I -upon his plea of guilty was I sentenced to one year in the peni- tentiary and for good reasons I shown the Court, his sentence is I suspended until July 1 st. A. H. Clement vs. N.  W. Ry. Co., upon trial for damages as a result of fire, the jury rendered a verdict of 1,500. Don Moses, J. W. Flood, H. W. McKinney, S. L. Ferguson and C. W. Smith, a committee to in vestigate the cost and wisdom of installing water and toilets in Jail and Court House and repair court green fence."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "was aquitted. Commonwealth vs. <mark>Edward</mark> Williams-bond forfeited and C."}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "was aquitted. Commonwealth vs. <mark>Edward</mark> Williams-bond forfeited and C."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1776.94, 296.46, 1940.56, 1778.56], "bbox_id": "ae7800e215", "file": "AppomattoxNewspapers_1902-1905a_0571.pdf", "page": 1, "text": "Almost insane from jealousy, Capt, Edward W. Jones, commanding Com pany E , of the Seventy-first Regiment, prominent-in politics and business cir cles in Norfolk,-killed Maude Cameron, and then slashed his own throat at the the womans house. She went to Nor folk about a year ago, after graduation from a convent in Carolina. She met Jones, who became infatuated with her, and she returned his affection. Each, it is said, were intensely jealous of the other, and this jealousy caused the trag edy. Mr. John Johnson, an aged and re spected farmer of the Fork district, Warren county, was attacked on Main street, near Johnson Bros. confectionery store, by Janies E. Conner and cut in the neck, cheek and stomach, making three very serious wounds. Mr. John son was also hit across the head-by Ben jamin Sonner with a heavy club, which rendered his unconscious for a long time. There seems to have been a long-stand ing grudge between Johnson and Son ner. Johnson is being attended by Dr. M. L. Garrison. Both James E. Sonner and his son Benjamin were arrested. Mr. Johnsons condition is serious. Dorsey Mills, a young white man, aged about 23 , had his left foot crushed between the bumpers of two freight cars of a Southern Railway freight at Front Royal. Mills, it seems, attempted to cross the bumper, when the train gave a sudden lurch and caught his foot. Dr. Kipps was immediately upon the scene to render medical assistance. Amputa tion may be necessary. The cutting of the channel of the Ap pomattox River from Petersburg to James River, at City Point, to a depth of 12 feet and width of 40 feet, was completed Friday. The work was done by the United States Government, at a cost of  10 , 000 . The government will begin work immediately on the diversion of the Appomattox River, the cost of which will be  150 , 000 , to be paid for by the government. One man was killed and five others hurt by the bursting of a 28 -foot fly wheel in the bar mill of the Tredegar Iron Works, Richmond. The shed in which it was situated was wrecked, and the wheel, broken into several large pieces, flew in every direction, parts of it landing over on Gambles Hill Park, across the canal. The Old Virginia Copper Company, owned by Pittsburg and Indiana capi talists, has just been organized in Lu- ray. The company is to develop the mineral lands near Stony Man Camp, seven miles east of Luray. The home office is to be in Fort Wayne, Ind. The copper deposits at this place are said to be among the richest in the State. The police of Winchester are scouring the city and surrounding country for a young white man, supposed to be J. C. Rainey, of Jefferson county, West Vir ginia, who went by the name of M. C. Morgan, who is wanted for passing al leged worthless checks on Winchester merchants. The Henrico County Jail, built a few years ago, is about to collapse. Big cracks have occurred in the walls on account of the ground sinking. No pris oners are being kept in that part of the building because of the danger. A big sewer running under the jail is the probable cause of the trouble. In Lynchburg owners of all places of public resort, factories and boarding houses three stories or more in height have been notified that they must com ply with a new city ordinance which re quires the erection of iron fire-escapes. Mr. Gus Rock, a prominent farmer and citizen of Farnaham, was run over by a two-horse wagon loaded with to matoes. The wheel passed over his body, inflicting injuries from which he died. Thomas Parsons, colored, shot and killed Thomas Banks, another negro, at Rideway Church, in Buckingham, during a protracted meeting. Parsons claims self-defense, saying Banks hit him with his fist. Banks .is a bad name among the negroes of Buckingham, two of the name having committed atrocious mur ders recently. The annual convention of the Womans Christian Temperance Union of Win chester and Frederick county was held at Winchester in the Market Street Methodist Episcopal Church. Mrs. Amy Weech, State superintendent of evan gelistic work, responded to the address of welcome of Mrs. Arthur Leaf. Miss Lona A. Kerns, of Winchester, was elected president Miss Lizzie Arnold, of Stephen City, corresponding secretary Mrs. C. H. Buchanan, of Brucetown, re cording secretary, and Mrs. John Locke, of Stephen City, treasurer. Miss Lucy Anderton, of Tappahan- nock, on the Rappahannock River, and her guests had a narrow escape from drowning while sailing. In the boat were Miss Dorothy Hope and Mr. May, of Baltimore, and Mr. Henry Temple. The boat capsized in the channel and the occupants clung to it until rescued after a terrible experience by two negroes. Genevie Scott, the little son of Robert Scott, of Pocahontas, a suburb of Peters burg, attempted to jump on a freight train on the Norfolk and Western Rail road while passing through Blandford. He fell and had his right leg and arm so badly crushed that he died at the Home for the Sick. H. J. Fraley, a well-known citizen of Rappahannock county, is dead at his home near Sperryville, 14 miles east of Luray. His death was due to typhoid fever. Several other members of his family have the fever. Gideon Hoake, one of the oldest citi zens of Page county, died at his home near Ida, eight miles south of Luray. He was about 85 years of age and is survived by seven children. Mr. John H. Harrison, of Petersburg, and Mrs. Sallie Cordle, of Brunswick county, his sister, met in Petersburg for the first time in 20 years. Mrs. Cordle has been the mother of 10 children and the grandmother of 64 grandchildren. Nine of the former and 40 of the latter are now living, and she has three great grandchildren alive. Judge John D. Horsley fell down the steps at the Academy of Music, Lynch burg, in trying to save an old gentleman who had fallen. The Judge fractured his cheekbone. The incident probably will cause him to postpone a trip to Europe, which he was about to begin. I Magistrate Angle, of Henrico county, passed the death sentence on a dog train ed by three negro boys to steal .chickens and bring them to his masters. Many depredations have occurred by the use of this dog. The three negroesPercy Bundy, Charles Woodson and Benja min Joneswere sentenced for chicken I stealing. There was a head-on collision on the Norfolk and Western railroad at Suth erlands Station, Dinwiddle county, be tween a loaded easibound coal train and I an empty train going west. Both loco motives were badly damaged and five I cars wrecked."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "insane from jealousy, Capt, <mark>Edward</mark> W. Jones, commanding Com"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "insane from jealousy, Capt, <mark>Edward</mark> W. Jones, commanding Com"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [568.09, 547.8, 715.85, 1055.08], "bbox_id": "8d8d1ad615", "file": "AppomattoxNewspapers_1974-1975a_0398.pdf", "page": 1, "text": "A rthur Carwile, of Lynch burg, visited in the home of Mrs. Alma C. Almond on Sunday.    Those visiting Mr. W. A. Woodson from the Sunday School class of New Hope Baptist Church on Sunday were Mr. R. A. Chenault, Mr. Joe Coin, and Mr. Harry Ferguson, Jr.    Mr. Ralph Lewis, of Yonkers. New York Mrs. C ard Evans of Philadelphia, Pa. Mr. James Preston of Washington, D.C. and Mr. McKinley Lewis, also of Washington, D.C., visited in the home of Mr. and Mrs. Lewis Ferguson.    M rs. S. J . E vans has returned to her home here after spending some time in the home of Mr. and Mrs. C. D. Thomas of Pascagoula, Miss.   Visitors this week in the home of Mr. and Mrs. E. C. Rogers were Dr. and Mrs. John Rogers and family, David, Lucy, Philip, and Edward of i Spatesburg, Georgia, and Mrs. Guy Chetelate and daughter, Monique of San Anseimo, Calif. They also visited Mr. and Mrs. E. W. McClintic, of L and Mr. and Mrs. R. Pamplin.  e  Mr. and Mrs. John Tweedy, j Jr., Mr. and Mrs. William Martin, Tony and Tammy spent  last week in Nashville, Tenn., - touring the Smoky Mountains and K ings Dominion in  Richmond."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "visiting Mr. W. A. <mark>Woodson</mark> from the Sunday School"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "visiting Mr. W. A. <mark>Woodson</mark> from the Sunday School"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [982.3, 194.13, 1142.3, 1168.52], "bbox_id": "8d9b059536", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "711, Aubrey Chester Spencer 841, Spencer Watkins 688, Peter Floyd Rush 623, John Archer Powers 269, Edmund Smith Dennis, jr. 685. Southall Seay . 335, Robert Lee Gough 493, Ethelbert Tandy Loving 341, Selden Bruce Gilliam 391, Wiley James Hillard 353, John Gordon 637, Hubert Thomas Ragland 360, Leian Harris 571, William Neighbors 488, Walter Fletcher Logan 704, Charles Raymond Senger 72, James H. Briddie 356, James Harvey 112, Lewis Brown 128, Relius Walden Bartee 679, John James Sharp 805, John Daniel Wood 11, John Agee 363, Willie Hartwell 6, Thomas W Adcock 327, John Penny Godsey 664, Archer Richardson 93, Joe Broxton 345, Houston Letcher Gary 103, Robert Franklin Bransford 556, Ernest Agee Morgan 154, Charlie Bagby 51, Paul Ayres 717, Walter Brooks Shoemaker 30, William Andrew Anderson 199, Tom Cox, 388, Fred Walter Hellard 773, Thomas Vest 608, Charles J Pruvis 406, Frank Harris 519, John Alexajder Miller 25, John Randolph Amos 392, John Rocker 383, Samuel David Harris 588, Grover Cleveland Patteson 856, Frank Allen Zimmerman 705, Thomas Harrison Staton 576, John Nicholas 122, E iward Brown 642, Roy T Reynolds 222, Allen Floyd Christian 700, Frank Pharr Simms 297, Sidney Lee Fountaine 321, William Gregory 736, Gordon Lee Snoddy 707, James Wertley Sears 368, Percy Robert -Horsley 320, James Alex Gregory 656, Henry Harrison Rosen 814, Bernard Mayfield Wooten 738, John Ed Stanton 848, Meli Woodson 121, Aaron Brown 221, Robert Lee Childress 292, Sampson Ford 822, James Williams 504, John Edward MoBley 470, William Kane 312, Willie Gray 90, Ernest Norfield Banton 191, Cliff Chambers 477, Harry Clinton Landeree 753, Robert Samuel Toney 130, Carey Booker 858, Wesley Gray 168, James Oscar Christian 424, John Letcher Jones 840, George Watkins. 657, Bernice Gilmer Ranson 175, William Henry Clark 300, Charlie Gardner Fleming 278, George Russell Edwards 524, Clarence Maynard 532, James Earley Marshall 336, Charles Lightfoot Gunter"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "Ed Stanton 848, Meli <mark>Woodson</mark> 121, Aaron Brown 221,"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "Ed Stanton 848, Meli <mark>Woodson</mark> 121, Aaron Brown 221,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [687.62, 244.76, 851.16, 1246.24], "bbox_id": "55a2daa9f2", "file": "AppomattoxNewspapers_1915-1918a_0437.pdf", "page": 1, "text": "557, John Alexander Morris 622, Matt Wiley Powers 585, Henry Clay OBrien 781, Claude Roanoe Wood 323, Luke Dillard Goin 857, Wortley Booker 458, John Jones 441, William Goldman John son 357, Robert Harvey 23, Charles Randolph Allen 331, Howard Garrett 492, Evans Williams Logan . 565, John Hall Norvell 600, Parker Wright 715, Floyd Thomas Shoema ker 539, Thomas C. Maxey 346, John Robert Gormus - 562, John Nash 501, Robert Edward Mann 102, Frank Gayle Brown 714, Andrew Claiborne Bte- ger i 86, John Banks 71, Jesse J. Booker 555, William Motley 506, Frank Megginson 435, William Johnson 681, Albert Smith 713, Charles Harrison Shoe maker 450, Joe Jackson 113, Ralph Lewis Berkeley 725, Thomas E. Stinson 158, Wiley Bagby . 808, Samuel Woodson 780, Charles Henry Wood 267, William Johnston Davis 567, John Ernest Newton 421. Charles Jamerson 169, Thomas Edward Creasey 436, Richard Lee Johnston 396, H o 1 o w ay Christopher Hudgins 862, Ernest Lenwood Rad ford 257, Churchill Duncan 155, Charles Brown 284, Thomas Evans 133, George William Banton 807, John Woodson 185, Charles Early Call 265, George Howard Drake 285, Harry Eaton 560, Robert Thomas Morris 303, Lenwood Ford 563, Dave Nash 211, John Rover Crews 146, Westley Brown 843, Harry Delaware Wool dridge 228, Ernest A. Cole 410, Frank Pierce Johnston 299, John Waverly Ford 750, Harvey H. Tapscott 58, Juan Raymond Anderson 150, William Ernest Bryant 19, Alfonso Allen 400, Joseph Dabney Harris 4, William Hugh Adcock 115, Grover Bundey 832, John Raleigh Watson 206, Charlie John Crews 228, Joseph Campbell Chap pell 136, Emmett Elwood Banton 430, Richard Jones 328, Joseph Riley Guill 96, John Elmore Banton 624, Stobie Patteson 570, Sidney H. Neighbors 644, Leonard F. Maxey 747, Thomas Elwood Camp bell 138, Alfred Rogers Brown"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "John Nash 501, Robert <mark>Edward</mark> Mann 102, Frank Gayle"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "John Nash 501, Robert <mark>Edward</mark> Mann 102, Frank Gayle"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [516.0, 240.25, 678.08, 1027.64], "bbox_id": "21b481752b", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "503 John Newton Hubbard, 8pout Spring 504 William Henry Reed, 1805 Main St., Lynchburg 505 Boyd Willet Does, Staple- ton 506 Hale Patterson, Concord Depot 507 Howard McKinley Har ey, 1805 Main St., Lynchburg 508 Lacy Abbitt, Spout Spring 509 R e a lio u s Harrington Trent, Stapleton 510 Willie Ieaih Brown, Oak ville 511 Lee Turner, Oakville 512 Spurgeon Warner Austin, Oakville 513 Corbett Ferguson, Beck ham 514 Adolphus Era8tU8 Moses, Appomattox r f d 4 515 Thomas Eugene Trent, Appomattox 516 Judeon Cornelius Mc Daniel, Bent Creek 517 Robert Edward Patter son, Appomattox r f d 4 518 Sullivan Captain Fergu son, Beckham 519 Cervin Winston Booker, Oakville 520 Bernard Oscar Page, Ap pomattox 521 Walter Herbert Woodson, Bent Jreek 522 Alvin St. Clair Qreen, Beckham 623 Dallas Hobart MoCoy, Rivervile 524 Thomas Berry P e n ix , Beckham 525 Thomas Albert Jones, Oakville 526 John Hunter Page, Ap pomattox r f d 4 627 Isaac Patterson, Appo mattox r f d 4 528 John Henry J odsb , Appo mattox r f d 4 529 Sam Watson Page, Appo mattox r f d 4 530 Yancy Abbitt, Appomat tox r f d 4 531 Loyd Edward Humbles, Vera r f d 1 632 James Edward T r e n t, Appomattox r t d 4 533 Samuel Robert Jones, Appomattox r f d 4 534 John Johnson, B e n t Creek r f d 1 535 Arthur Booker, Oakville r f d 1 536 Joseph Andrew McCoy, Bent Creek 537 Scott Palmer, Appomat"}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Bent Creek 517 Robert <mark>Edward</mark> Patter son, Appomattox r"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Bent Creek 517 Robert <mark>Edward</mark> Patter son, Appomattox r"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [509.69, 729.66, 677.68, 1204.76], "bbox_id": "ec5a1e5871", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "179 James Berkley Mayberry W 180 Walter Vernie Jones W 181 William Carrington Woody Jr W 182 Samuel Clinton Turner W 183 John Richard Baker N 1-184 Curtis Lamb.it N -160 Samuel liiuen Lee W  -IÛU liooei e Vv atson N . o 1 tmuiiie billion Bagby N lOU ii.t.uiu ri. iiKu.i i uLw W . iÖJ uu . ju l.auijun uuin w  -1JU Lnuiles .award Harris N 1-liJl ien Allred Thornhill W 1-102 Marvin Ouell Christian N 1-103 George Daniel Kelso N 104 William Braxton Page W i.-105 Le-..e Kyle Cole...a., YV 106 Beverley Kinxle iviartm W 1-loY Leorge nunuiey onreve Vv 1-108 Leslie Nor in Martin w i-lao H-arry Wellington Jenkins w 1-UU Vvilliam Mania Jones s 1-201 Thomas Coleman Harvey w T-ZU2 Robert Llisna Bingham w 1-U3 Lretu vvnoiley w 1-ZU4 William Arcner Woodson Vv l-zuo Samuel iNorih Thornhill w U.-ÜU6 Robert Lee McCormicK w i-ZVI Joe nenry iviarsnail YV T-Z08 Robert L e e Layne W 1-200 John Whitcomb Gunter Vv 210 Frank Jenerson Nash W 211 William Edmund Calhoun N -212 Percy Alcon Garrett Vv 1-213 RiCitaru Meade wtoo Vv 1 - 2 1 4 Elisna Thomas Ferguson W 1-210 David North Robertson YV 216 Clifton Dalton Clements Yv 217 Oscar Emmett Caldwell W 218 Lawrence Anderson Harris W 219 William Anderson Gilbert W 220 Ernest Everett Johnson W 221 Robert McKinley Vaughter N 222 Paul Edward Gunter W 1 -2 2 3 Leighton McCormick W 224 John McKinley LeGrand N 220 w uliam Henry Morgan N 1 - 2 2 6 Spurgeon Junior Coleman W 227 Alfred Bernard Abbitt YV 228 Jonn David .Turner YV 229 Hal Flood Bryant W"}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "w 1-ZU4 William Arcner <mark>Woodson</mark> Vv l-zuo Samuel iNorih"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "w 1-ZU4 William Arcner <mark>Woodson</mark> Vv l-zuo Samuel iNorih"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1369.46, 622.86, 1817.43, 1026.7], "bbox_id": "23f4226a87", "file": "AppomattoxNewspapers_1915-1918a_0568.pdf", "page": 1, "text": "- Vera Arent we glad this warm weather is ripening our water melons and cantaloupes? Miss Laura Abbitt, of Lyneh- burg, is visiting her home peo ple here. Miss Gladys Tweedy ie spend ing this week at the home of her aunt, Mrs. Rosa Abbitt. Mr. and Mrs. T. O. Woodson, Mr. J. N. Woodson and little daughter, Edna, of Riohmond, spent the week-end at the home of Mrs Thomas Harvey at Rose Bower. Mr. and Mrs. R. A. Coving ton, of ROanoke, are spending a few days with the formers parents, Mr. and Mrs. W. J Covington. Miss Helen Morris haB re turned fiom a visit to her aunt, Mrs. C. J. Morris, at Anderson- Rev. McElroy and family are in Prince Edward oounty conducting evangelistic servio-vjjje es in 8pring Creek ohuroh. I j j r anj rli Henry Garnefix ilo donation of 10 .from I They will return on Saturday.  resumed on Monday to their W. A. through Miss 8usie Rev. R. D. Garland is expect-1 home in Richmond, after two 1 ed to preach at Liberty ohuroh I weeks spent with relatives here on Sunday at 1130 a. m. Reg I Revival services began a t alar set vices at night. You I New Hope last Sunday, with a he Appomattox Chapter. R. till have a lawn party on I i A. 8. school cainpifcis on day evening, Aug. 8 h,  I to 12. Ice cream of differ-"}, "highlight": {"text": {"matched_tokens": ["Woodson", "Woodson"], "snippet": "and Mrs. T. O. <mark>Woodson</mark>, Mr. J. N. <mark>Woodson</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson", "Woodson"], "snippet": "and Mrs. T. O. <mark>Woodson</mark>, Mr. J. N. <mark>Woodson</mark>"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.5, 468.41, 1894.07, 642.85], "bbox_id": "ecdabedd31", "file": "AppomattoxNewspapers_1892-1898a_0364.pdf", "page": 1, "text": "-------------- 7 ----------- v . . .   Raymond, Sarah J ..... Scruggs, Edward...... Thornhill,-Mildred est Thornhill, Ehz ........... Walker, Wins est ....... the morning of I Woodson, Abadiah est Wingfield, Wm A ..... Webb, Nancy M ...... Webb, Merry and H. Goins est. COLORED. Abbitt, John aud Elijah Clark. Diugnid, Oh H ..!...... . .. . I I Durphey, Dennis ....... gun. Most of the pieces were I pointed upward, and the bullets Elam, Nelsons est....."}, "highlight": {"text": {"matched_tokens": ["Edward"], "snippet": "Raymond, Sarah J ..... Scruggs, <mark>Edward</mark>...... Thornhill,-Mildred est Thornhill, Ehz"}}, "highlights": [{"field": "text", "matched_tokens": ["Edward"], "snippet": "Raymond, Sarah J ..... Scruggs, <mark>Edward</mark>...... Thornhill,-Mildred est Thornhill, Ehz"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2005.1, 414.16, 2165.39, 641.85], "bbox_id": "13a38aeb82", "file": "AppomattoxNewspapers_1892-1898a_0388.pdf", "page": 1, "text": "Vera. The farmers are very busy getting ready for another crop. Mr. W. J. Turne is the happy father of a bright little son. Mr. J. H. Woodsons little son who has been sick for a lo n g tim e with white swelling is iniD roving. Mr. J. 0. Williams wife who has been very sick is better. Mr. Tom Harvey lost a flue cow from eating tobacco. Mr. D. W. Ward has been very ill  he is very old man  he is in his 87th year. - Mrs. Coleman is very ill and it is thought she iB growing worse. Mr. Ira Farrar spent a few days iu . rince Edward recently.  W."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "son. Mr. J. H. <mark>Woodson</mark>s little son who has"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "son. Mr. J. H. <mark>Woodson</mark>s little son who has"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1646.12, 1194.92, 1954.23, 1489.62], "bbox_id": "d649f7609f", "file": "AppomattoxNewspapers_1915-1918a_0552.pdf", "page": 1, "text": "home of Mr. and. Mrs P. A. Goin. Mrs. W. J. Watson is visit ing her son, Mr. J. F. Watson, at Appomattox, . . Mr. A. A. Austin spent Sun day with his sister, Mrs. T. 8. The regulations provide that  Woodson,at Appomattox. . Mr. Aubrey Seay and sisters, Nannie and Pearl!, visited their uncle, Mr. Abner 8eay, near Andereonville en Sunday. Mise Berta Bryant spent last week with her uncle, Mr, Stan ley, at Toga. Little Florence Watson has returned home after a two weeks visit to her grandmoth er, Mrs. W. B. Seay , ! . Miss Minnie Mann received a card lart week announcing the safe arrival of ship on which her brother, Robert Edward Mann, had sailed."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "The regulations provide that  <mark>Woodson</mark>,at Appomattox. . Mr. Aubrey Seay"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "The regulations provide that  <mark>Woodson</mark>,at Appomattox. . Mr. Aubrey Seay"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [646.29, 232.07, 809.15, 1389.75], "bbox_id": "89ad388fcd", "file": "AppomattoxNewspapers_1902-1905a_0554.pdf", "page": 1, "text": "are almost swallowed up with grass. There is an abundance of apples, and almost every one is making cider. Peaches are a failure, so much wet weather caused them to decay and drop off before they were ripe. Messrs. Lewis and Woodsons new th-esher was in the neighborhood the past week. The wheat crop generally is not as good as wa-j ex pected, Mrs. J. W. North, of Ljnch! urg, was visiting Mrs. J. E. Coleman the past week. Mrs. Coleman has moved into her beautiful new home. We extend a warm welcome to her and her interesting family, and are glad to see this new home built up in the Southside. Prof, Anderson Fitzgerald, of Huntington, W. Va., was the guest of his aunt, Mrs. G. A. Coleman, recently. Miss Joe Warren, of Pamplin, spent last week with Misses Bernice and Landon Cole. Mr. Mayuard Fowlkes, of Luhen.- burg O. H., is summering with his grandparents here. Messrs. S. P. Coleman and T. N. Oder went to Richmond recently to see Mr. Ellis Oder, who was criti callv ill with typhoid fever. Tlii 3 is the third time that Mr. Oder has had this dread disease. Mr. S. F. Calhoun, an old Appo mattox boy, now the efficient ageiri of the N.  W. at Bel Spring, visit ed relatives at Mountain View Fri day and Saturday. He has been en joying a weeks outing at Pinev Beach, and is very enthusiastic in his praise of that new resort. Dave Plunkett, son of Mr. J. S Plunkett, had a bad fall from a horse cue day last week. He has his arm in a iling and we under stand one of the bones was broken. News was received here of the death at her faUieis home in Gra bam of little Mary Judson, th twelve-months-old baby of Mr. ano Mrs. Jos. W. Coleman. The littn body was brought to Lynchburg and laid to rest in beautiful Spring Hill cemetery. Two little grave guarded by the augels, two litil lambs safely housed in the Gooe Shepherds fold. Be comforted be reaved parents, they are not, lost only gone before. Mr. T. W. Oder was in the Ilil! City with tobacco on Thuisday. Miss Sadie Coleman expects t leave on Friday next for an extend ed visit to friends at Hurtsville and relatives in Prince Edward and Buckingham. Mr. John T. Cole is visiting his father, who is quite feeble iu Pitt sylvania. Thera will be a ministers and deacons meeting at Promise Land church colored on Saturday and Sunday i.ext. There is a good Sab bath School at this chnrch, and prayer meeting every Sunday even ing. Miss Elvyn Coleman has a patch of the finest tobacco we have ever seen this early. Some of the plants are almost as large as she is. The political pot has ceased to hoii in this section, or is it that it has not commenced, and candidates are conspicuous by their absence. Oh, yes. Mr. Editor, we see the waste basket but please allow us a little more space iu which o assure your Charlotte correspondent that we are Tery much awake, and wish she would rouse Carliue. It has been quite a lou  time since we heaid from her, and Lv.cinday wonders if hey are both married."}, "highlight": {"text": {"matched_tokens": ["Woodson"], "snippet": "ripe. Messrs. Lewis and <mark>Woodson</mark>s new th-esher was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Woodson"], "snippet": "ripe. Messrs. Lewis and <mark>Woodson</mark>s new th-esher was in"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
