{"document": {"bbox": [1787.07, 661.92, 1953.72, 881.67], "bbox_id": "0ccd4f3833", "file": "AppomattoxNewspapers_1955-1957a_0414.pdf", "page": 1, "text": "Concord, Jan. 30.- Mrs. James B. Marshall, 81, outstanding civic leader of the Falling River District of Campbell County and well known in the area as a lecturer, died at 92i5 oclockthis morning, after an extended illness. Born May 22, 1875, Mrs. Mar shall wlas the daughter of the -late Aifred A. Jones and Elizabeth King Jones. She was the former Jessie Bell Jones. Her husband died in 1945. Mrs. Marshall was a member of Glendlale Garden Club and of Cen tral Baptist Church. Survivors include three sisters, Mrs. Katherine Miller and Mrs. Rhoda Booth, of San Diego, Calif, and Mia. M. A. Johnson, of Con cord and one brother, Garfield Jones, of Aleppo, Pa.."}, "highlight": {"text": {"matched_tokens": ["Falling", "River", "District"], "snippet": "civic leader of the <mark>Falling</mark> <mark>River</mark> <mark>District</mark> of Campbell County and"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River", "District"], "snippet": "civic leader of the <mark>Falling</mark> <mark>River</mark> <mark>District</mark> of Campbell County and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.57, 1435.64, 2012.8, 1764.93], "bbox_id": "260459278a", "file": "AppomattoxNewspapers_1908-1909a_0380.pdf", "page": 1, "text": "PAMPLIN at 10 a estate, and personal property conveyed in said deed AU of that certain tract of land located about three miles S. W. of Appomattox C. H. Va., in Southside District, on Falling river, containing 25 acres more or less, together with the build ings and improvements therein and the water power and all rights and appurtenances there unto belonging, known a s Thomas Mill - Second At the same time I will offer for sale complete ma chinery for flour and grain mill, consisting of 3 stands of rolls, steel water wheel and other ma chinery of the very best make. There is a splendid dwelling of 7 rooms, oat buildings and some orchard on the property and the site is admirably situated for a mill, on- public road and phone line, with good water power, partly developed.  Interested parties will be shown over the property o n request Terms of Sale Cash. A. H. CLEMENT, T r u s t e e . 5-23-3t"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [546.92, 997.44, 707.73, 1326.69], "bbox_id": "4f93fb3bbe", "file": "AppomattoxNewspapers_1926-1933a_0377.pdf", "page": 1, "text": "at 10 a. m., the following real estate and personal property conveyed in said deed All of that certain tract of land located about three miles S. W. of Appomattox C. H. Va., in Southside District, on Falling river, containing 25 acres more or less, together with the build ings and improvements thereon and the water power and all rights and appurtenances there unto belonging, known a s Thomas Mill. Second At the same time I will offer for sale complete ma chinery for flour and grain mill, consisting of 3 stands of rolls, steel water wheel and other ma chinery of the very best make. There is a splendid dwelling of 7 rooms, out buildings and some orchard on the property and the site is admirably situated for a mill, on public road and phone line, with good water power partly developed. Interested parties will b e shown over the property o n request. Terms of Sale Cash. A H. CLEMENT, TRUSTEE, 5-23-3t"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1855.88, 1460.08, 2015.39, 1789.12], "bbox_id": "fc71412222", "file": "AppomattoxNewspapers_1926-1933a_0380.pdf", "page": 1, "text": "at 10 a. m., the following real estate and personal property conveyed in said deed All of that certain tract of land located about three miles S. W. of Appomattox C. H. Va., in Southside District, on Falling river, containing 25 acres more or less, together with the build ings and improvements thereon and the water power and all rights and appurtenances there unto belonging, known a s Thomas Mill. Second At the same time I will offer for sale complete ma chinery for flour and grain mill, consisting of 3 stands of rolls, steel water wheel and other ma chinery of the very best make. There is a splendid dwelling of 7 rooms, out buildings and some orchard on the property and the site is admirably situated for a mill, on public road and phone line, with good water power, partly developed.  Interested parties will b e shown over the property o n request. Terms of Sale Cash. A. H. CLEMENT, T rustee . 5-23-3t"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [717.35, 1094.17, 877.33, 1283.01], "bbox_id": "ff04568ccc", "file": "AppomattoxNewspapers_1926-1933a_0379.pdf", "page": 1, "text": "at 10 a. m., the following real estate and personal property conveyed in said deed All of that certain tract of land located about three miles S W. of Appblhattox C. H. Va. in Southside District, on Falling river, .containing 25 acres more or less, together with the build ings and improvements thereon and the water power and al rights and appurtenances there unto belonging, known a i Thomas Mill. Second - At the same time  will offer for sale complete ma chinery for flour and grain mill consisting of 3 stands of rolls steel water wheel and other ma"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va. in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, .containing 25 acres more"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va. in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, .containing 25 acres more"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [542.9, 978.97, 704.73, 1307.71], "bbox_id": "f8378f35ac", "file": "AppomattoxNewspapers_1908-1909a_0377.pdf", "page": 1, "text": "at 10 a. m., the following real estate and personal property conveyed in said deed All of that certain bract of land located about three miles S. W. of Appomattox C. H. Va., in Southside District, on Falling river, containing 25 acres more or less, together with the build ings and improvements thereon and the water power and all rights and . appurtenances there unto belonging, known a s Thomas Mill. Second At the same time I will offer for sale complete ma chinery for flour and grain mill, consisting of 3 stands of rolls, steel water wheel and other ma chinery of the very best make.  There is a splendid dwelling of 7 rooms, out buildings and some orchard on the property and the site is admirably situated for a mill, on public road and, phone  line with good water power, partly developed. Interested parties will b e shown over the property o n request.  Terms of Sale Cash. A. H. CLEMENT, TRUSTEE. 5-23-3t"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "river"], "snippet": "H. Va., in Southside <mark>District</mark>, on <mark>Falling</mark> <mark>river</mark>, containing 25 acres more"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.14, 688.59, 1673.18, 837.54], "bbox_id": "bc9d96f8b1", "file": "AppomattoxNewspapers_1933-1936a_0161.pdf", "page": 1, "text": "IN THE CLERKS OFFICE of the Circuit Court of the County of Appomattox on the 20th day of February, 1935 , James A. Martin and Others. Plaintiffs, E Against  Milton Martin, L. D. Martin, Daisy Snields, Loyd Nash and Others, Defendants. The object of this suit is to have legal partition of a tract of land 268 12 acres, mors or less, on Falling River in Southside District of Appomattox. County, Virginia, a- bout 12 miles south of Appomattox Court Houlsa, adjoining the lands"}, "highlight": {"text": {"matched_tokens": ["Falling", "River", "District"], "snippet": "mors or less, on <mark>Falling</mark> <mark>River</mark> in Southside <mark>District</mark> of Appomattox. County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River", "District"], "snippet": "mors or less, on <mark>Falling</mark> <mark>River</mark> in Southside <mark>District</mark> of Appomattox. County, Virginia,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.1, 1218.91, 1688.4, 1325.61], "bbox_id": "e7a6400e2d", "file": "AppomattoxNewspapers_1933-1936a_0156.pdf", "page": 1, "text": "Against Milton Martin, L. D. Martin, Daisy Shields, Loyd Nash and Others, Defendants. The object of this suit is to have cgal partition of a tract of land 268 12 acres, more or less, on Falling River in Southside District bf Appomattox County, Virginia, a- bout 12 miles south oCppomattox Court Houlse, adjoining the lands of T. H. F ordT . IV. iNash and"}, "highlight": {"text": {"matched_tokens": ["Falling", "River", "District"], "snippet": "more or less, on <mark>Falling</mark> <mark>River</mark> in Southside <mark>District</mark> bf Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River", "District"], "snippet": "more or less, on <mark>Falling</mark> <mark>River</mark> in Southside <mark>District</mark> bf Appomattox County, Virginia,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [261.87, 1040.05, 405.84, 1180.09], "bbox_id": "6125619f4c", "file": "TimesVirginian_1976_0142.pdf", "page": 1, "text": "Appomattox defeated Brook- - ville by six strokes in a Seminote District Golf Match at Falling River Country Club on April 13.  Jerry Conner was medalist with four over par 51 after twelve holes of play when the match was halted because of darkness. Ronnie Cheatham with six ovenpar 53 was low for the Bees who lost their first match this season after winning"}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "River"], "snippet": "strokes in a Seminote <mark>District</mark> Golf Match at <mark>Falling</mark> <mark>River</mark> Country Club on April"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "River"], "snippet": "strokes in a Seminote <mark>District</mark> Golf Match at <mark>Falling</mark> <mark>River</mark> Country Club on April"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1942.0, 1282.35, 2112.25, 1731.3], "bbox_id": "699822e656", "file": "AppomattoxNewspapers_1955-1957a_0416.pdf", "page": 1, "text": "S-heppe, Amherst T. E. Dickerson, and John Goin, Appomattox J. P. Thomas, Cumberland John Harri son and Robert Hankins, Camp bell and C. W. Crist, Jr., Bucking ham. C. N. Judy, Soil Scientist, works in the five counties of the District preparing Soil Conservation sur veys for use by the other techni cians. In addition to the perosnnel assigned on regular district opera tions, Mr. J. B. Terry, Who trans ferred from Cumberland County, is assigned to full time on water shed work. A summary of acompliaihiments by farmers with assistance from Soil Conservation Service technicians working in the district is as fol lows There were 74 new oooperatort in 1956 who started conservation plans. This brings the total of co operating farmers to 2,141 with 400,580 acres of land under con servation plan. The Soil Conservation Service assisted the District in the East Fork Falling River Pilot Watershed Work be s continued on such measures as tree planting, rood-bank stabilization, sod waterways, and stabilisation of badly eroded areas which produce silt. The first and second floodwater retarding struc tures were completed. The banks and dams were seeded. Engineering work was started on the third flood- water retarding structure and should be ready to contract in 1957. The Virginia Forest Service has assisted in a vital way in the upbuilding of a sound conservation program in the district."}, "highlight": {"text": {"matched_tokens": ["District", "Falling", "River"], "snippet": "Conservation Service assisted the <mark>District</mark> in the East Fork <mark>Falling</mark> <mark>River</mark> Pilot Watershed Work be"}}, "highlights": [{"field": "text", "matched_tokens": ["District", "Falling", "River"], "snippet": "Conservation Service assisted the <mark>District</mark> in the East Fork <mark>Falling</mark> <mark>River</mark> Pilot Watershed Work be"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [299.75, 1393.03, 492.72, 1656.53], "bbox_id": "2b6d2bb33f", "file": "TimesVirginian_1978_0563.pdf", "page": 1, "text": "Rt. 633 at N  W RR SOUtHSIDE DISTRICT Associates Discount Corp. Long Creek Lovelace, David and Wanda Falling River McCoy, Solomon Douglas Lot 3 STONEWALL DISTRICT Burruss Land and Lumber Gothards Hill Cochrane, Revel A. and Ezell, and Murray and Mona Hudson Hubbard, Samuel and Nellie Culpepper, Lyle Davis, Sarah E. Davis Thomas Future Homeowners Inc. Rt. 608 W. of Oakville McCormick,C.D. Near Bent Creek and Ethel L. Near Bent Creek Near Bent Creek Moseley, William E. Rt. 608 ami Jane E."}, "highlight": {"text": {"matched_tokens": ["Falling", "River", "DISTRICT"], "snippet": "Lovelace, David and Wanda <mark>Falling</mark> <mark>River</mark> McCoy, Solomon Douglas Lot 3 STONEWALL <mark>DISTRICT</mark> Burruss Land and Lumber"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River", "DISTRICT"], "snippet": "Lovelace, David and Wanda <mark>Falling</mark> <mark>River</mark> McCoy, Solomon Douglas Lot 3 STONEWALL <mark>DISTRICT</mark> Burruss Land and Lumber"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [456.01, 317.99, 609.48, 957.51], "bbox_id": "219bee4baf", "file": "TimesVirginian_1981a_0076.pdf", "page": 1, "text": "With two golfers returning from last years team. Coach Coty Dickerson is looking for help from six new players in the 1981 version of the Appomattox County High School golf team. Junior Richard Guill and Mike Smith, a sophomore, are both coming back from last, years Raider golf team. Newcomers include freshman Bobby C arter, sophomores Mike Williams and Jay Stew art, junior Mike Richardson, and seniors Dana White end Joe Brooks. According to Dickerson, Guill will likely be the number-one player on this years team. Dickersoq points out that Guill qualified for the regional tournament last year, and missed qualifying for the state tournament by only one stroke.  The Raiders will play nine dual matches this year, according to Dickerson, with the first scheduled for tomor row against Altavista at the Falling River Country Club course. We feel like, we have a lot of potential in thé young players, Dickerson says. Theyve been ehthuaigstic. and have worked very hard thus far in practice. Dickerson will have to fill the positions vacated by his number two, three and four players on last years team. John Simmons is playing baseball this year, and Steve Mayberry and Tun Tolley are both working this year. . Dickerson says that Gary Howard, the pro at Falling River Country Club, where the Raiders practice, has been very helpful and donated his time to help instruct the players. The district powerhouse? this year will likely indur Altavista, who won the distri tournament last year, ar.u Liberty, who has many players from the 1980 team returning to play this year. Qualifying rounds for the first match of the season were scheduled to be held yesterday Tuesday and today, according to Dickerson."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "against Altavista at the <mark>Falling</mark> <mark>River</mark> Country Club course. We"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "against Altavista at the <mark>Falling</mark> <mark>River</mark> Country Club course. We"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1944.95, 1571.46, 2116.53, 1661.35], "bbox_id": "08f2e87790", "file": "AppomattoxNewspapers_1960-1962b_0139.pdf", "page": 1, "text": "W. E. Caldhan, chairman, Robt. E. Lee  Soil Conservation District, has been notified that the jpint ap plication recently submitted by tne L ib ert E. Lee Soil Conservation District, Appomattox County Board of Supervisors and Camipbe Coun ity Board of Supervisors has been approved for Little Falling River"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "been approved for Little <mark>Falling</mark> <mark>River</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "been approved for Little <mark>Falling</mark> <mark>River</mark>"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [305.5, 1440.07, 688.15, 1818.75], "bbox_id": "2510dcd718", "file": "AppomattoxNewspapers_1892-1898a_0054.pdf", "page": 1, "text": "w a l k e r  s CHURCH p r e c in c t , gharch until it reaches a point just Beginning opposite Klines on the eagt 0f  p. Nowlins, and thence Prince Edward line, thence with the a0Ug the Megginson. mill precinct Pamplins precinct line up the rail-1 line to Oakville and Tower Hill road to the first crossing below Ever- Load at R. H. Wheelers school- green, thence with the Evergreen I bougCj and thence along Turners and Walkers church road to the fork j Mill precinct line to Brie Island of the old Rocks church road,thence creej  thence to Carsons mill a direct line to where the Walkers I aj. beginning. The voting place of church and Court House road inter-   g election district shall be Oak sect with the Poorhouse road, thence viue down the Walkers church and Poor s t o n e w a l l p r e c in c t . house road to near the estate of Mrs. Commencing at Carsons mill and Mary A. J. Dickerson, thence to the I along the Oakville precinct left following the road that crosses jinfl to South Side district line, and Appomattox river and passes from thence aiong gaid district line to He- Jesse Harveys to the Burnett road, I jj.on road near Concord, and thence thence down Burnets road to the I ai0Ug Campbell county line to James road leading to Joel W. Colemans I and thence along down James to Fish Pond creek, thence down the river to Wreck Island creek, thence creek to Appomattox river, thence I up Wreck island creek to Carsons down the river to the Prince Edward I at beginning. The voting place lineii, thence with the Prince Ed- j o thi8 election district shall be ward line to the beginning. The stone Wall. voting place of this district shall be ELECTION PRECINCTS OF Walkers Church. SOUTH SIDE DISTRICT. PAMPLIN CITY PRECINCT, HI Commencing with Cub creek at ,, i_p thence up said creek I Commencing to Ckm M  ir T f o r d , thence east and following Falling river to county  A i l d t o Old Bethany church, I Hne at Spring mills, thence with with road to u 3  I county tine to railroad at Concord, your work."}, "highlight": {"text": {"matched_tokens": ["Falling", "river"], "snippet": "thence east and following <mark>Falling</mark> <mark>river</mark> to county  A i"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "river"], "snippet": "thence east and following <mark>Falling</mark> <mark>river</mark> to county  A i"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.92, 489.43, 1642.57, 823.17], "bbox_id": "b3ad5fe75b", "file": "TimesVirginian_1976_0432.pdf", "page": 1, "text": "Vepco customers west of the Town of Appomattox wifi be without electric service for three hours on the morning of Saturday, Dec. 4, 1976, while crews convert lines in the area to a higher voltage. Service will be interrupted at 630 a,in. and will be restored by approximat ely 930a.m. The area to be affected begins just west of Maudes Restaurant and extends west through the communities of Spout Spring and Concord. Several subdivisions along R t. 691 including Falling River Acres, W alton Place and Country Club Estates wifi also be affected. The area northwest of Appomattox along Rt. 656 will not be affected, however. D . C. Stables, Jr ., District Manager of Virginia Electric and Power Company,, ?in Farmville, said the work being done, is necessary to provide for future load growth. He noted that growth in this area bad been rapid in recent years with numerous new homes and"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "R t. 691 including <mark>Falling</mark> <mark>River</mark> Acres, W alton Place"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "R t. 691 including <mark>Falling</mark> <mark>River</mark> Acres, W alton Place"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.71, 433.18, 1695.97, 1552.02], "bbox_id": "d5cf71bfdd", "file": "AppomattoxNewspapers_1926-1933a_0460.pdf", "page": 1, "text": "totftimg W,ater- The mi is a total wreck and the chanel of the stream is completely changed necessitating a new bridge at that pomt or change of location. The loss of Mrs. Thomas will exceed 7,000, and it is believed that the mill will not be rebuilt. Covingtons mill N. E. of town 1S. unnunfir by steam on account of the breaking of the dam. Strattons mill was damaged, but to what extent we have not heard. Bridges swept away- Norths  bridge greatly damaged, but road foreman Whitten promises to have it up by the end of the week. Several other low-water  bridges in Supervisor Andersons I district were destroyed, but he I is earnestly pushing ahead to get I them repaired. One at Strat- I tons mill and another at Wells I on David creek. The damage to bridges and I roads alone will amount to thou- I sands of dollars, and theloss sus- I tained by the farmers to grow- I I ing crops will exceed 25.000. Five bridges in southside dis- I trict were taken away, but I I Supervisor Moses thinks all will I I be in shape to-day except the I bridge at Thomas mill, where  the new channel will have to be I bridged. W. B. Harvey, who had much fine tobacco on low land is report ed to have lost the entire crop. The corn crop is on the ground and while highland crops have! not sustained so much damage! the low land crops are a total loss. Appomattox river was re-11 ported to be higher than any citi- II zen can recollect We have not been able to con fer with Supervisor OBrien, but I it is not believed that he lost any I bridges in his district. .Right I much damage was done to the new roads in his district how ever. The correspondent of the News writes about the destruction on I Falling river, no doubt much of this high water was occasioned by the breaking of the Thomas dam. Crawley mill, or Evol roller mill, situated ten miles east of Rustburgon Falling river, was washed away Saturday night, along with the iron bridge, a store house storage house, two I garages, two automobiles, one truck, an unoccupied dwelling, oil house, chicken house and a variety of other fanning equip- j , ment, all the property of H. W. I Carwile and brother. The prop- I erty was scattered along the j banks of the river for miles, and I some things were located later I in the tops of trees. One of the I automobiles and the truck have I been recovered, but the othre I car has not been heard from. I The mill and land were sold to I the Carwiles a few years ago I by A. B. Crawley.  The small dam at the mill was I left intact. Numerous large I trees were uprooted and other I damage done to property, besides _ overflowing, and flattening corn,  grain and other crops in low ground. Marshalls mill located on Motleys creek, about five miles from Crawley mill was also washed away and so were ,most of the bridges in that community."}, "highlight": {"text": {"matched_tokens": ["Falling", "river"], "snippet": "the destruction on I <mark>Falling</mark> <mark>river</mark>, no doubt much of"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "river"], "snippet": "the destruction on I <mark>Falling</mark> <mark>river</mark>, no doubt much of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1493.5, 208.06, 1623.33, 422.05], "bbox_id": "67dcf1b0a2", "file": "TimesVirginian_1980a_0088.pdf", "page": 1, "text": "this seasons prospects,- according to Dickerson. But if we get a break on the weather, I think we have the talent to have a pretty good team by the end of the year, he added. Dickerson says his good group of young men is tentatively scheduled to play a match each Tuesday through the season. Includ ed in this schedule are three non-district matches, as well as matches with each team inthe Seminole District. The first match re scheduled for March 18 against Altavista at the Falling River Country Club. Tee-on time is 330 p.m."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "against Altavista at the <mark>Falling</mark> <mark>River</mark> Country Club. Tee-on time"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "against Altavista at the <mark>Falling</mark> <mark>River</mark> Country Club. Tee-on time"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1010.16, 1256.19, 1476.46, 1458.48], "bbox_id": "0c457df99f", "file": "AppomattoxNewspapers_1915-1918a_0149.pdf", "page": 1, "text": "The property known as the Caldwell M ill Property situated in Southside District j the County of Appomattox, Virginia, about three and a half m iles southwest of the Coflrt House, on Falling River, containing twenty-five acres, more or less, with all the buiidinjjn and improvements thereon, which includes a dwelling house and all out buildings, tw M ill property and all machinery and m ill equipment of every kind and description, aij the blacksmith shop and tools, said 25 acres of land adjoin the lands of Chilton, R-   Caldwell and T . A. Caldwell, and being the same property which was this day conveyed the said T . J. Wooten by T. A. Caldwell, by deeu bearing even date with this deed. J Tire Wooten or Caldwell Mill property consists of a well j situated Mill site and twenty-five 5 acres of land. Thfoj water power mill is equipped with modern machinery whii turns out an excellent quality of flour and meal. The property is about three m iles from the railroad at Appomattox, being acceSf oyer a good road. Parties interested w ill find this an excellent opportunity to buy a go m ill at a moderate price."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "the Coflrt House, on <mark>Falling</mark> <mark>River</mark>, containing twenty-five acres, more"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "the Coflrt House, on <mark>Falling</mark> <mark>River</mark>, containing twenty-five acres, more"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.79, 1297.48, 1858.74, 1670.88], "bbox_id": "773be331b3", "file": "AppomattoxNewspapers_1955-1957a_0116.pdf", "page": 1, "text": "The Evans and Nash Construction Company, of Appomattox, has been awarded, a contract on a low bid of 24,960.6, for the construc tion- of a flood water retarding structure, Site 15, in the East Fork Falling River Pilot Watershed, this county. The announcement was made yesterday in Richmond. Work is ex pected to begin in 30 days. This is the first of three such pro jects to be undertaken in Appomat tox County. Bids for Site 21 will be opened next month. The Pilot Watershed protection program comprises about 34,000 acres in Appomattox and Campbell Counties. The site of the first work is about three miles northeast of the Town of Appomattox. W oic on the first project will consume about three months. Robert E. Lee Soil Conservation District is sponsor of the project. The project is designed to show what can be done with such a pro gram as a method of flood damage reduction and soil and water con servation within a small watershed. A dam will be so constructed that there will be a normal flow of wa ter when the season is normal. When heavy rains come, the flow of water below the dam will be only slightly accelerated and the area back of the dam will act as storage and let through overflow pipes at a slow rate of speed."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "in the East Fork <mark>Falling</mark> <mark>River</mark> Pilot Watershed, this county."}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "in the East Fork <mark>Falling</mark> <mark>River</mark> Pilot Watershed, this county."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [416.13, 342.55, 562.7, 1209.31], "bbox_id": "44b3e6a78e", "file": "TimesVirginian_1976_0085.pdf", "page": 1, "text": "SEW ERAGE PROGRAM Approximately three years ago, the Town Manager ran a stream assimilation study in accordance with State Water Control Board methods for a proposed regional sewage treatment plant. This study indicated that this plant should be located at thé confluence of Caldwells Creek and Falling River. The study was strongly influenced by the most cost- effective alternative, also tak ing into considergjtidn the anticipated sewerage needs of the Town and County for the future. L ater, Roy F . Westons Consulting Engineering Firm of Westchester Pennsylvania con curred with the Town study when they prepared  the Metropolitan Water Quality Managem ent Plan for the Central Virginia Planning Dis trict. The. Water Resources and Sanitation Technical commit tees of the Central Virginia Planning District Commission worked closely with this engineering firm in the development of this report. W illiam S . Slagle is the representative from Appomat tox on this committee, and has served as its chairman for approximately three years. Later, the 208 Basin Plans were prepared for both the Roanoke and Jam es, River Basins and the tfbwn was insistent upon maintaining the original stream classification and regional plan for Appomat tox. In March 1975, Councilman Spiggle and W. S. Slagle appeared before the State W ater Control Board in Richmond and made a strong plea for early funding of the proposed Appomattox regional sewage treatment plant. In the summer of 1975 the Town was notified that it would, upon application, be considered for Step I funding. We were notified on Feb. 26, 1976, that, our application for Step I  in  a d b e e iia B  p w h atii seep  or facilities pladiiingTs the first of a three step process toward the construction df a regional sewage treatm ent plant. Therefore, if we are success -1 ful in our application for Step II or detail design, we will be invited to apply for Step HI Which is construction funding. This sewerage program probably has more to offer the Appomattox Community than any other program for it will help determine the growth patterns that will emerge in the Appomattox Community. Of course, such programs are"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "of Caldwells Creek and <mark>Falling</mark> <mark>River</mark>. The study was strongly"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "of Caldwells Creek and <mark>Falling</mark> <mark>River</mark>. The study was strongly"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [923.98, 416.51, 1083.8, 763.59], "bbox_id": "483f1984d1", "file": "AppomattoxNewspapers_1898-1902a_0343.pdf", "page": 1, "text": "School Appointments. The school board of Southside district has made the following ap pointments, and expresses regret that it cannot open more schools. There is a possibility, however, of opeuing one more Bchool, and, if opened, it should be given to Evergreen. Miss Eddie V. Hardy, assistant in in high school M. Willie Huuter, Spout Spring Bessie Chilton, Sa lem Fork Emma Smith, Cheat hams Angle Sadie L. Coleman, Bushy Forest Bertha B. Wool dridge, Harveys Gate Alice Whit aker, Reedy Spring Mary M. Hun ter, Falling River Annie M. Lee, Pettys Fork M. Pearl Marshall, Loug Creek. The colored teachers appointed are Lacey Isbell, Depot school, and Annie R. Abbitt, Chap school. The redistriciing of the county has thrown uiauy schools very near the new hues, aud the boards show a disposition to discontinue schoo.s so situated. The boards should get together aud endeavor to remedy the trouble caused by the new lines."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "Mary M. Hun ter, <mark>Falling</mark> <mark>River</mark> Annie M. Lee, Pettys"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "Mary M. Hun ter, <mark>Falling</mark> <mark>River</mark> Annie M. Lee, Pettys"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2182.33, 228.07, 2338.07, 1085.02], "bbox_id": "54a7aea015", "file": "TimesVirginian_1981a_0103.pdf", "page": 1, "text": "route 727 thence along the southern boundary of Appomat tox County continuing to the north fork of the Falling River thence in a northerly direction along the north fork of the Falling River to its confluence with Martins Creek thence in a northeasterly direction along Martins Creek in a straight line to its intersection with secon dary route 645 thence in a southeasterly direction along the centerline of secondary route 645 to its intersection with 604 thence in a northerly direc tion along the centerline of 604 to its intersection with secon dary route 727 thence in a southerly direction of centerline of 727 to its intersection of secondary rotite 733 thence along the centerline of secon dary route 733 to its intersection with Big Cub Creek thence  along the centerline of Big Cub Creek in a southeasterly direc tion to the point of beginning. HI. STONEWALL ELECTION DISTRICT A. Oakville Precinct  Beginning at a point at the in tersection Of Bent Creek and secondary route 608 thence in a westerly direction along secon dary route 608 to its intersection with 657 thence along the cen terline of secondary route 657 to its intersection with secondary route 656 thence in a westerly direction along the centerline of secondary route 656 to its inter section with primary route 24 thence in a westerly direction along the centerline point of route 24 to its intersection with the corporate limits of the Town of Appomattox thence in a westerly direction along the corporate boundary to Norfolk and Western Railroad proper ty thence in a westerly direc tion along the Norfolk and Western Railroad property to the more westerly intersection of secondary route 674 thence in a westerly direction along the centerline of Secondary route 674 to its intersection with primary route 460 thence in a westerly direction along the centerline of primary route 460 to its intersection with secon dary route 647  thence along the centerline of secondary route 647 to its intersection with sècondary route 668 thence along the centerline of secon dary route 668 to its intersection with Wreck Island Creek then ce in a northerly direction along Wreck Island Creek to its inter section with secondary route 683theace in a northerly 4irec tion along secondary route 683 to its intersection with secon dary route 605 thence along the centerline of secondary route 605 to its intersection with Wreck Island Creek thence along the centerline of Wreck Island Creek to its confluence with the James River thence"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "north fork of the <mark>Falling</mark> <mark>River</mark> thence in a northerly"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "north fork of the <mark>Falling</mark> <mark>River</mark> thence in a northerly"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1889.72, 342.2, 2062.4, 1025.21], "bbox_id": "af106133d9", "file": "AppomattoxNewspapers_1926-1933a_0224.pdf", "page": 1, "text": "PURSUANT to a decree en tered by the Circuit Court of Campbell County in the suit of The Farmers National Bank vs D- W. Wood and others, the undersigned special commis sioner will offer for sale at public auction, on the premi ses, near Spring Mills, on SATURDAY, DECEMBER 13, 1930, at 2 P. M., a valuable farm of 111.3 acres on Fall ing River, in Rustburg District, Campbell County, Va.-, adjoin ing W. F. Wood, T. S. B o t h and others- THERE IS a splendid resi dence of nine rooms, in good repair, barn a n d other out juPciings also a good tenant house in good repair, and some orchard. A pipe line for mountain spring water is laid to the dwelling and the whole situation is an admirable one. THE LAND is very fertile and productive, and is a high state of cultivation, having a frontage on the west side of Falling River of 1144 feet, with approximately 60 acres of rich low ground. The farm is otherwise well watered with springs, branches and creeks. THIS FARM has recently been surveyed and platted, and copy of same may be had on application to undersigned This certainly is the b e s t property, considering the ac reage, improvements and its quality, the public has had an opportunity to buy at auction in many years- Terms One-third cash. _he residue on a credit of one and two years, the purchaser o execute interest bearing notes containing waiver of lomestead for deferred pay ments and title will be retain ed until all of the purchase money is paid but leave will be given the purchaser to pay all cash if desired. AH. CLEMENT Special Commissioner. IN THE CIRCUIT COURT OF CAMPBELL COUNTYV Bond required to A. H. Clement, Special Commissioner has been executed with appro ved security. C. W- Woodson, Clerk. Adv."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "the west side of <mark>Falling</mark> <mark>River</mark> of 1144 feet, with"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "the west side of <mark>Falling</mark> <mark>River</mark> of 1144 feet, with"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2028.53, 229.09, 2181.33, 1827.86], "bbox_id": "1d491c1ae0", "file": "TimesVirginian_1981a_0103.pdf", "page": 1, "text": "primary route 24 thence in an easterly direction along primary route 24 to its intersec tion with secondary route 656 thence along the Centerline of seccmdary route 656 to its inter section with secondary route 657 thence along the centerline of secondary route 657 to its in tersection with secondary route 608 thence in a southeasterly direction along the centerline of secondary route 608 to intersec tion of secondary route 616 thence in a southerly direction. along secondary route 616 to its intersection with secondary route 655 thence along the cen terline of seccmdary route 655 to. the centerline of primary route 24. thence along the centerline of primary route 24 to the Coun ty Boundary thence along the County Boundary to secondary route 614 thence in a south westerly direction along secon dary route 614 to its intersection with secondary route 626 then- in a southerly direction along the centerline of secondary route 626 to its intersection with secondary route  651 thence along the centerline of secon dary route 651 to its intersection with secondary route 614 then ce along secondary route 614 in a northwesterly direction along the centerline of secondary route 614 to its intersection with secondary route 618 thence along the centerline of 618 and in. direct alignment to the nor thern most tributary of the Ap pomattox River thence along the centerline of this tributary and the main stem to an un named tributary  thence up this unnamed tributary to secon dary route 627 thence in a southerly direction along the centerline of secondary route 639 thence along the centerline of secondary 639 to its intersec tion with secondary route 632 thence along the centerline of secondary route 632 to its inter section with 634 thence along the centerline of 634 with its in tersection with primary route 460 thence in a westerly direc tion along the centerline of primary route 460 to its inter section with secondary route 695 thence along the secondary routé 695 to the Centerline of Norfolk  Western Railroad property thence in a northerly direction along the centerline route of the Norfolk  Western Railroad property back to the point of beginning. E. Agee Precinct  Begin ning at a point at the County  Boundary  and primary route 24 thénee in a westerly direction along primary route 24 to its intersection with secon dary rpute 655 thence along secondary route.655 to its inter section with secondary. route . 616- thence along secondary route 616 to its intersection with secondary route 608 thence in a westerly direction along secondary route 608 to its .intersection with Bent Creek thence along Bent Creek to primary route 26 thence along 26 to the centerline of primary route 60 thence in a northerly direction along primary route 60 to the County Boundary thence along the County Boundary in a northerly and southeasterly direction back to the point of beginning. II. SOUTHSIDE ELECTION DISTRICT A. Courthouse Precinct - Beginning at a point at the in tersection of secondary route 720 and Big Cub Creek thence in a northerly direction along Big Cub Creek to intersection with secondary route 733 then-, ce along the secondary route of 733 to its intersection with secondary route 727 thence in a northerly direction in the cen terline of 727 to its intersection with secondary route 604 then ce along the  centerline of secondary route 604 to its inter section with secondary route 645 thence in a straight line down Martins Creek into its in tersection with the North Fork of Falling River thence along Martins Creek to its intersec tion with the north fork of the Falling River, thence in a nor therly direction along the north fork of the Falling River to its intersection with secondary route 647 thence in a northerly direction along secondary route 647 to the. Norfolk and Western Railway thence in an easterly direction along the Norfolk and Western Railway to the cor porate boundary of the Town of Appomattox thence in a nor therly, easterly and southerly direction around the Town of Appomattox to the Norfolk and Western Railway thence along the Norfolk and Western Railway in a southerly direction to secondary route 695 thence in a westerly  direction along secondary route 695 to its inter- . section with 635 thence along 635 and secondary route 720 in a southerly direction back to the - point of beginning. B. Chap Precinct  Begin ning at a point at the intersec tion of Cub Creek and the Coun ty Boundary on secondary route 638 thence in a westerly direc tion along seconda route 638 . which forms the .southern boun dary of Appomattox County, to its intersection with secondary"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "the North Fork of <mark>Falling</mark> <mark>River</mark> thence along Martins Creek"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "the North Fork of <mark>Falling</mark> <mark>River</mark> thence along Martins Creek"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [782.95, 1205.39, 944.8, 1594.28], "bbox_id": "1f914e3b6d", "file": "AppomattoxNewspapers_1898-1902a_0238.pdf", "page": 1, "text": "OUR SCHOOLS. The Soutliside School-Board met at Promised-Land schoolhoute on Monday, and appointed the follow ing teachers for the several schools of this district W h ite Miss E. V. Hardy, assistant Appo mattox High School I. o. Abbitt, Headwa ter E tta Bloxton, C-.reau Emma Smith, Spout Spring SaUie E. Kice, Salem Fork SaraU Taylor, Cheathams Angle Macca Simms, Bushy Forest Pearl Sears, New  Light Bertha Wooldridge, Harveys Gate Alice Whitaker, Keedy Spring Mary Chil ton, Falling River Elmer Shearer, Pettys F ork Addie Dawson, Long Creek. C olored Lacy Isbell, Appomattox Cora Wooldridge, Female Academy Edmonia Ab bitt, Promised Land Annie Hancock, Chap. Every applicant for a school in this district succeeded, except one. There appears to be a scarcity of teachers in this districtsomething unusual. Prof. J. G, Fisher and Miss E- V. Hardy will have charge of the High School again. Although much op position was developed against Miss Hardy, no application was made .or Iter school, and the board reappoint ed her. The session will last eight months, one month being taught as a private schooltwo weeks at the beginning and two at the end of the session. This schqqi vill begin on September 25, add ti e other schools, qf the Qouflty will begin October 9."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "Spring Mary Chil ton, <mark>Falling</mark> <mark>River</mark> Elmer Shearer, Pettys F"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "Spring Mary Chil ton, <mark>Falling</mark> <mark>River</mark> Elmer Shearer, Pettys F"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [571.9, 190.47, 719.01, 991.23], "bbox_id": "1eceaef2d0", "file": "AppomattoxNewspapers_1974-1975a_0510.pdf", "page": 1, "text": "Mother Natures soil, once badly exposed, is being covered with protective conservation measures by voluntary cooper ators in the Robert E. Lee Soil and Water Conservation Dis- trict. For nearly 38 years the  conservation district has provi ded conservation assistance to j help make her beautiful and ! fruitful again. When the conservation dis-  trict was organized in 1938, I erosion and stream pollution j were rampant. Local rivers j were said to be too thick to drink and too thin to plow. Reorganized in 1972, the conservation district now en compasses Amherst, Appomat tox, Campbell Counties and Lynchburg. To be effective, conservation measures must be i carefully planned, installed and maintained. Technical assist ance for planning and applying conservation practices is provi ded to the conservation district by the USD A Soil Conservation Service and other conservation agencies. Conservation work in the late 1930s was mostly installing terrace on tobacco land and stabilizing gullies. The war greatly increased the need for wheat, corn and forage crops for dairy and livestock product ion. Contour strip cropping, grassed waterways, pasture and hayland improvement, livestock watering facilities and drainage were the most popular practices. The 1950s and 1960s brought about many land use changes. Cropland was covert ed to grassland and open land to woodland at an unprecedent ed rate. Floods followed by droughts pointed to the need to better manage our water resources. Irrigation ponds were constructed at a record pace. Two water-shed projects, East Fork of Falling River and Little Falling River watershed projects, were completed. Six flood water retarding reservoirs wereconstructed and land throughout the watersheds adequately protected with acclerated application of con servation practices. The decade of the 1970s are presenting many challenges to the conservation efforts. Farm ers are using larger machinery and using cropland more intensively. Conventional con servation systems, such as contour strip cropping and crop rotations, are being abandoned by many to increase  grain acreages. Land without the benefit of adequate conserva-"}, "highlight": {"text": {"matched_tokens": ["Falling", "River", "Falling", "River"], "snippet": "projects, East Fork of <mark>Falling</mark> <mark>River</mark> and Little <mark>Falling</mark> <mark>River</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River", "Falling", "River"], "snippet": "projects, East Fork of <mark>Falling</mark> <mark>River</mark> and Little <mark>Falling</mark> <mark>River</mark>"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.51, 261.67, 1951.51, 535.9], "bbox_id": "0fbba5a913", "file": "AppomattoxNewspapers_1960-1962b_0591.pdf", "page": 1, "text": "Little Falling River Watershed is comprised of approximately 31,- 000 acres in- Appomattox and Camp bell -Counties, with a small acreage in Charlotte County. It is expected that a period of 5 to 6 months will be required for the completion of the survey, ac cording to John L. Harrison, local soil conservationist. Harrison pointed out that the de velopment of this watershed area will be of great benefit to the farm ers in the area. Besides improving the agricultural lapdk on the hills, it is anticipated that certain flood control measures will be thus reducing the hazards of flood ing on the bottom lands. This project is being sponsored by the Robert E. Lee Soil Conserv ation District Board, of Supervisors, Apomattox County Board! of Super visors Bind Campbell County Board of Supervisors, as a part of the flood control program authorized under Public Law 566."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "Little <mark>Falling</mark> <mark>River</mark> Watershed is comprised of"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "Little <mark>Falling</mark> <mark>River</mark> Watershed is comprised of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [636.7, 1093.24, 1589.73, 1331.6], "bbox_id": "6e5956978f", "file": "AppomattoxNewspapers_1892-1898a_0058.pdf", "page": 1, "text": "it LawA ttorney for the Comw lth -Appomattox C. H.,-Va. Appomattox, Buckiijgham, Lynch- t of Appeals a t Richmond,and Ü. 8 . SPOUT SPRINGS PRECINCT, Commencing at Hancocks mill, and following Falling river to county line at Spring mills, thence with county line to railroad at Concord, thence along county line to HebiOif road, thence down HebrijB-foad to a point south of thjgidThoraae place, thence alojr the old Stone Wall dis trictJiceto D. W. McKinneys road, tilfence south along said road to start ing point. The voting place of this election district shall be Spout Springs. CHAP PRECINCT, Commencing at county line at Spring mills, following it south to where Cub creek enters Charlotte county from Appomattox, thence"}, "highlight": {"text": {"matched_tokens": ["Falling", "river"], "snippet": "Hancocks mill, and following <mark>Falling</mark> <mark>river</mark> to county line at"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "river"], "snippet": "Hancocks mill, and following <mark>Falling</mark> <mark>river</mark> to county line at"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.45, 551.81, 1795.73, 1620.65], "bbox_id": "5362e6086c", "file": "AppomattoxNewspapers_1902-1905a_0568.pdf", "page": 1, "text": "is a thing of the past. A t this cinct, and as far as I can learn at all the prefcincts in this- county, it was by far the fairest ever held here. Only 550 votes were cast in the county, out of which M artins m ajority w is 138 M anns plurality  8 Egglestons m ajority was 397 Ellysons   303 Andersons   318 McRaes   J23 H ubards  -  37 There were about 900 votes cast in the last Democratic prim ary, and the Republicans are now seeking to make capital of the falling off in the vote, saying so many Democrats would not vote in the prim ary be cause they wanted to be free to vote as they pleased in the -regular elec tion, b u t the faot is a great many Republicans voted at the other p ri mary, and this time the questions propounded by the judges wers so arching and so much to the point that even ths class of voters kuown as a floater would not as a rule tultify himself by offering to cast his vote in the primary.  The meeting at the Tabernacle ontinued until F riday, inclusive, and there were several dances at private houses during the week, so we had politics, religion and frivoli ty alternately in the minds of our people. On Thursday eveuing we ha- an other electric storm after an inter val of more days than for some time l.ef re. M any cases of lightniu. ki ling live stock and its striking houses are report.-d. A number 1 trees in the woods were rtruck with terrific force. I saw one ecraegy old poplar th at had withstood the storms of at least half a century, and it was riven and torn in a man ner fearful to contemplate, demon straling the power of God to destroy any one and any tiling by , the word of his will, aud y et how.merciful He is to us. Mrs. A S. Maxey, of Well Water, has sold her farm and store-house to Mr. Charles L. Glover, the report ed consideration being 1,650. Mrs. Maxey expects o remove to Spott sylvania county and life with her relatives. A negro from Slate River district named Thomas Paisons, WiS lodged jail here by Constable Miller, charged with murder. Parsons en gaged in a dispute with another ne gro named Thomas Banks, wnen he claims Banks struck him a stunning blow with his fist which he resented by shooting his antagonist twice with a, 32-calibre British Bulldog pistol. Parsons freely admits the killing, aud eays he did not see eny weapon in the hands of the man he slew. Banks is a bad name among the colored people of this county two by that name having committed atrocious m urders in the last few years, for which one was hung, the other escaping. The School Trustee Electoral Board met here on th e 23rd and elected new school trustees to fill va- cancie 3 as follows Curdsvile Dis trict, Thomas McOraw, vice E. J. Steger, resigned, and J . L. Spencer to fill a vacancy in Maysville Dis trict The same members of the Demo cratic County Committee were elect ed by the prim ary th at have served"}, "highlight": {"text": {"matched_tokens": ["River", "district"], "snippet": "A negro from Slate <mark>River</mark> <mark>district</mark> named Thomas Paisons, WiS"}}, "highlights": [{"field": "text", "matched_tokens": ["River", "district"], "snippet": "A negro from Slate <mark>River</mark> <mark>district</mark> named Thomas Paisons, WiS"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1790.76, 469.22, 1954.69, 1731.87], "bbox_id": "3cae4ac4a2", "file": "AppomattoxNewspapers_1915-1918a_0021.pdf", "page": 1, "text": "Buckingham . Rev. J . E . Cook preached some very able sermons at Maysville Presbyterian Church during the past week and the services were unusually well attended until the rain came The late P. A . Forbes used to say that while he lived here he could not remember a time when protracted services had been begun and ended at Mays ville Presbyterian Church without rain falling. He said no matter if a dry spell was on hand when the meeting began that rain came before the meeting closed, and certainly the rain came this time.  H . of B. an office in New .Store church was here to hear some of the goad preaching. Mr. C. E . Zimmerman, of Farm ville, bought a drove of cattle in this county the past week, paying very fair prices The settlement of school ac counts which was conducted here on Tuesday of last week disclosed the fact that most of the districts were behind on teachers salary, however the treasurer paid the teachers and whatever the balances are, they are due to the treasurer. Mr. Robert A . Hall was ap pointed a school trustee in Jam es River District in place of Mr. 0. O. Johnson whose term had expired. The trustee Electoral Board meets here today Momay. Mr. Frank Ellis continues very unwell at the home of her sister, Mrs. A . 8. Hall. Mrs. Charles L. Glover, whose illness was mentioned in this correspondence, was much im- proved the past week. The new sand-clay road we dave is just fine and the Board of Supervisors will have to provide for the culverts and all other drains being kept from clogging. Sapling clover, timothy and red-top are being seeded, and it seems as if a good stand o f grass should be the result, as the rains will cause the grass to come up and grow rapidly. Miss Emma G Haskins has een elected by the School 3oard of Buena Vista as a teacher in the High School there. Miss Fannie Charleton, who taught so successfully in the Dillwyn School last session, will teach in West Virginia the coming year. I heard a plucky little wo man say she would teach for i20 per month until the county was free of debt if the other teachers would would do the same. Misses Johnson, Wood and Crews, and Master Knight Kyle, are among those who contemplate boarding here and ttending the High School the coming session. The people here have agreed to take pupils to board at a nominal price in or-ter to build up the school. September 14th Circuit Court opens here in regular session. Mrs. Nannie Peake, who be fore her mariage was Miss Sannie Hickok has been here With her sister, Miss Alice Hickok, for some time. Mr. and Mrs. Thomas B Hall had their infant bapt zed on Sunday last, her name is Elizabeth Swoope Hall. Mr. Dan Rice and his mother are both sick at their borne here and Mr. Thomas Rice is staying at home attending them. About the 12th of Septembe an interesting marriage is t take place snd many will b asking who the couple is?"}, "highlight": {"text": {"matched_tokens": ["River", "District"], "snippet": "trustee in Jam es <mark>River</mark> <mark>District</mark> in place of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["River", "District"], "snippet": "trustee in Jam es <mark>River</mark> <mark>District</mark> in place of Mr."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1575.34, 169.81, 1728.64, 1821.38], "bbox_id": "3264dc0b08", "file": "TimesVirginian_1981a_0111.pdf", "page": 1, "text": "along the centerline of 618 and in direct alignment to the nor thern most tributary of the Ap pomattox- River thence along the centerline of this tributary and the main stem to an un named tributary thence up this unnamed tributary to secon dary route 627 thence in a southerly direction along the centerline of secondary route 639 thence along the centerline, of secondary 639 to its intersec tion with secondary route 632 thence along the centerline of secondary route 632 to its inter section with 634 thence along the. centerline of 634 with its in tersection with primary route 460 thence in a westerly direc tion along the centerline of primary route 460 to its inter section with. secondary route 695 thence along the secondary route 695 to the Centerline o f, Norfolk  Western Railroad property thence in a northerly direction along the centerline route of the Norfolk  Western Railroad property back to the. point of beginning. E. Agee Precinct - Begin ning at a point at the County Boundary and primary route 24 thence in a westerly direction along primary route 24 to its intersection with secon dary route 655 thence along secondary route 655 to its inter section with secondary route 616 thence along secondary route 616 to its intersection with secondary route 608 thence in a westerly direction along  secondary route 608 to its .intersection with Bent Creek thence along Bent Creek to primary route-26 thence along 26 to the centerline of primary route 60 thence in a northerly direction along primary route 60 to the County Boundary thence along the County Boundary in a northerly and southeasterly direction hack to the point of beginning, II. SOUlHSiDE ELECTION DISTRICT A. Courthouse Precinct - Beginning at a point at the in tersection of secondary route 720 and Big Cub Creek thence in a northerly direction along Big Cub Creek to intersection with secondary route 733 then ce along the secondary route of 733 to its intersection with secondary route 727 thence in a northerly direction in the cen terline of. 727 to its intersection -with secondary route 604 then ce along the centerline of secondary route 604 to its inter section with secondary route 645 thence in a straight line down Martins Creek into its in tersection with the North Fork pf Failing River thence along Martins Creek to its iittersec-1 tion with tiie north fork of the Falling River, thence in a nor therly direction along the north fork of the Falling River to its intersection with secondary route 647 thence in a northerly direction along secondary route 647-to the Norfolk and Western Railway thence in an easterly direction along the Norfolk and Western Railway to the cor porate boundary of toe Town of Appomattox thence in a nor therly, easterly and southerly direction around toe Town of Appomattox to toe Norfolk and Western Railway thence along .the Norfolk and Western Railway in a southerly direction to secondary route 695 thence in a westerly direction along secondary route 695 to its inter section with 635 thence along 635 and secondary route 720 in a southerly direction back to the point of beginning.  B. Chap Precinct  Begin ning at a point at the intersec tion of Cub Creek and the Coun ty Boundary on secondary route 636 thence in a westerly direc tion along secondary route 638 which forms the southern boun dary of Appomattox County to its intersection with secondary route 727 thence along the southern boundary of Appomat tox County continuing to the north fork of the Falling River thence in a northerly direction along the north fork of the Falling River to its confluence with Martins Creek thence in a northeasterly direction along Martins Creek in a straight line to its intersection with secon dary route 645 thence in a southeasterly cfirection along the centerline of secondary route.645 to its intersection with 604 thence in a northerly direc tion along the centerline of 604 to its intersection with secon dary route 727 thence in a southerly direction of centerline of 727 to its intersection of secondary route 733 thence along the centerline of secon dary route 733 to its intersection with Big Cub Creek toencie along the centerline of Big Cub Creek in a southeasterly direc tion to the point of beginning. IU. STONEWALL ELECTION DISTRICT . A. Oakville .-Precinct  Beginning at a point at,toe in tersection of Bent Creek and secondary route 606 thence ip a westerly direction along secon dary route 606 to its intersection with 657 thence along the cen terline of secondary route 657 to . its intersection with- secondary route 656 thence in a westerly dirpetkm along the centerline of secondary route 656 to ita inter section with primary route 24 thence in a - westerly.direction along the centerline point of"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "north fork of the <mark>Falling</mark> <mark>River</mark>, thence in a nor"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "north fork of the <mark>Falling</mark> <mark>River</mark>, thence in a nor"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [671.49, 1468.87, 838.19, 1682.37], "bbox_id": "807c5b133c", "file": "AppomattoxNewspapers_1939-1943a_0029.pdf", "page": 1, "text": "All of the following described real estute, to-wt All of that certain tract or parcel .f real estate lying and being in Southside district of Appomattox Co unty, Virginia, containing 143 1-4 acres, more or less, lying and being on Falling River, adjoining the lands formerly owne-4 by DeMott Robinson, A . T . Cheatham, et als, and being described by meets and bounds in the Procession notes, Southside dis trict, page 158 said notes being re corded in the Clerks Office of the Circuit Court of Appomattox Coun ty, Virginia, and being the same tract of land that was owned by George T. Cheatham at the time of his death and being described in the Bill in the above irtfentig-ned Chan cery cause to which Bill and Deed reference is here made for a better description of said land."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "lying and being on <mark>Falling</mark> <mark>River</mark>, adjoining the lands formerly"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "lying and being on <mark>Falling</mark> <mark>River</mark>, adjoining the lands formerly"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1543.88, 869.58, 1715.38, 1050.68], "bbox_id": "50cda3c2aa", "file": "AppomattoxNewspapers_1939-1943a_0031.pdf", "page": 1, "text": "All of thab certain tract or parcel 0 f u-j e8.a6. lyius and being in Southside district of Appomattox Co unty, Virginia, containing 143 1-4 acres, more or less, lying and being on Falling River, adjoining the lands formerly owned by DeMott Robinson, A .T Cheatham, et als, and being described by meets and bounds in the Recession notes, Southside dis trict, page 158 said notes being re corded in the Clerks Office of the Circuit Court of Appomattox Coun ty, Virginia, and being the same tract of land that was owned by George T . Cheatham at the time of his death and being described in the Bill m the above mentioned Chan- fcary cause to which Bill and Deed reference is here made for a better"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "lying and being on <mark>Falling</mark> <mark>River</mark>, adjoining the lands formerly"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "lying and being on <mark>Falling</mark> <mark>River</mark>, adjoining the lands formerly"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1731.6, 1481.78, 1897.85, 1764.33], "bbox_id": "1db6347d4c", "file": "AppomattoxNewspapers_1908-1909a_0046.pdf", "page": 1, "text": "a the Clerk Office of the Circuit Court of the C o u atro f Appom attox on the 18th day of September 1896. Carrie O, Harvey and Other  Plaintiffs oselnet Thome G lean Cheatham and Others defendants The object o f t hia ault tato sell for petition tw o tract of laud In southslde M agisterial District. Appomattox County Va, lying near by each o tnsr but no t adjoining, the first containing 217 acres, more or less, sod ad Joining tne lands of A lbert Cheatham s belie, Mary F Morris. M 8 Noahs Estate, Allen Martins heirs end other, and lying on both tides of Big Falling River the second containing 241 sore, m ore or less, and ad  joining the lands of A B Martin, Mary F Morris. N L Cheatham and Other, a small part of of which latter tra c t lie across the Campbell County boundary tin, nnd both of which tract lie In the same genera neighborhood about one mile, from Spring g Ills and are assessed in thenam s of the late gncy J. Cheatham and werb owned la fee simple by br a t the lim e of her death. Itsppearlng by affidavit th at firaele C, Btaphons.Thomss GlennCheatham.BraFlesb man and Ura B Cbanault are not residents of tin s tate of Virginia it is ordered th a t they do appear within todays a fte r due publica tion hereof, aud do w hat may be neensaty to protect their interest in this suit, And.lt la further ordered th at n copy hereof be PUir llehed once a week for four succcstlve Seeks In 8h Times-Vlrslulau, n newspaper pub lished In the Jaunty of Appomattox, nnd th at a oopy be posted a t the front door of th e I Court house of this County on or before tbe 1 80th day of Spt. 126 th a t being the I next succeeding Rule day after this ordr w it entered. A copyTeste C. W. Smith. Clerk. Hobt. A. Russell, p q.  9 8u 86 4t"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "both tides of Big <mark>Falling</mark> <mark>River</mark> the second containing 241"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "both tides of Big <mark>Falling</mark> <mark>River</mark> the second containing 241"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.12, 1485.75, 1858.05, 1809.43], "bbox_id": "c15bd8c1ad", "file": "TimesVirginian_1981a_0148.pdf", "page": 1, "text": "A mighty effort by the a fresh orange. Appomattox County High Thanks to Mrs. S. L. Burks School baseball team resulted for mailing me a neat clipping in the Seminole District of a column from The tournament title. Liberty, of Kingsport, Teqn. POST. Mis. Bedford had been rated first Burks formerly , lived in and Gretna second, but both Appomattox and still reads fell by the wayside and the this newspaper each week, local Raiders topped Altavista Greetings, to carry off the crown. Kevin    Mitchell tossed a one-hitter. Have you ever watched a    basketball game and marvel- And while oh sports, let us ed at the sheer speed of the salute Jerry Conner, of action. I have and also I have Appomattox, who is a noted how impossible it would champion golfer. Has won the. be to do as they do in football, local Falling River Club change teams as th e . ball championship for some six passes from offense to years, and this week-end defense, added the Winton Club crown    at Amherst. Some 144 golfers Appomattox looks nice. For were in competition in the the first time in months I took fourth annual Patrick Henry a drive around and marveled Invitational. _ at new homes, yes, but also how well older homes and properties were maintained. In several cases saw entire families outdoors doing yard work. Lawns were well cared for and vegetable gardens looked great. Most every"}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "do in football, local <mark>Falling</mark> <mark>River</mark> Club change teams as"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "do in football, local <mark>Falling</mark> <mark>River</mark> Club change teams as"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1223.73, 824.0, 1367.52, 982.79], "bbox_id": "16bda12257", "file": "AppomattoxNewspapers_1947-1949a_0085.pdf", "page": 1, "text": "A certain tract of land, contu ing one hundred sixty-four lil acres, more or less, with the bill I ings and improvements theme situated in Southide Magi fee I District of Appomattox Count, ft  ginia, about four and oneJi miles south of the Court Iio, lying on Falling River, adjor the lands of John Chilton and Job Webb, Estates, and A. W. and Burton Carson, and being  same tract of land wuch was t, I veyed to C. E. and Mn Myrtietj Woody, from Mrs. Mack Maun rus et als."}, "highlight": {"text": {"matched_tokens": ["Falling", "River"], "snippet": "Court Iio, lying on <mark>Falling</mark> <mark>River</mark>, adjor the lands of"}}, "highlights": [{"field": "text", "matched_tokens": ["Falling", "River"], "snippet": "Court Iio, lying on <mark>Falling</mark> <mark>River</mark>, adjor the lands of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [547.19, 866.2, 714.2, 1451.4], "bbox_id": "99351b22a5", "file": "AppomattoxNewspapers_1908-1909a_0369.pdf", "page": 1, "text": "Mexico City.Mexicos fiercest war riors, the Yaquls, have at last agreed to be commanded by non-Yaqut lead ers. For 400 years300under Spanish rule, 100 under Mexicanthe Yaquls maintained their independence, refus ing to be conquered. Beaten at the end by.the government, with their country In ruins, they now go one step further in becoming Mexicanized by their acceptance of a foreign com mander. Four hundred Yaqhl soldiers are at Port Perote, a mountain near Orizaba, in the state of  Vera Cruz. This Is the group which for the first time IB his tory has submitted to havl z a non- Indian leader. The war offices an nouncement of a change In the organi zation of this Yaqul force was regard ed as signifying the disappearance of Yaquls 08 separate units. Hereafter they will be part of the army. Colonel Enrique Morfln Figueroa has been as signed to the group under the new arrangement. Manzo Conqueror of Yaquls. The actual conqueror of the Yaquls was Gen. Francisco Manzo, one of the leaders of the present rebellion who recently crossed the United States border at Nogales to escape falling Into federal hands. The Manzo campaign against the Yaquls, undertaken three years ago, was organized with 13,000 troops and equipment which Included nine airplanes. At that time the Yaquls controlled a region extending 100 miles north of Guaymas, in Sonora, and which I dp I eluded some of the best lands In the republic. The stretch under Yaqul ownership extended along the Yaqul river valley in a district larger than the Imperial valley of California and with water resources three times as great as those of the Imperial valley. Today the only Yaqul country left In Yaqul power Is In the Bacatete moun tains. But the power Is small. All the wnrrlora are gone or killed. Women and children and old men predominate In the tast citadel. As In the present revolution, the rphol Indians In YaqullaBd lost their light partly through the governments use. of .the most modern arm of war the airplane. The nine planes that Manzo had on his front flew poin stantly over Yaqul territory bomjjlnp and Spreading terror. The federal planes drove the Inhabitants of Bac- tCEe. the capital, into the qiountaIBF and-fiaaily-deatroj-ed-H--  . ------- plan Aided Ini Cortgupst,"}, "highlight": {"text": {"matched_tokens": ["river", "district"], "snippet": "extended along the Yaqul <mark>river</mark> valley in a <mark>district</mark> larger than the Imperial"}}, "highlights": [{"field": "text", "matched_tokens": ["river", "district"], "snippet": "extended along the Yaqul <mark>river</mark> valley in a <mark>district</mark> larger than the Imperial"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [548.39, 872.32, 720.65, 1666.16], "bbox_id": "ee790b0809", "file": "AppomattoxNewspapers_1926-1933a_0369.pdf", "page": 1, "text": "Mexico City.Mexicos fiercest war riors, the Yaquis, have at last agreed to be commanded by non-Yaqul lead ers. For 400 years300under Spanish rule, 100 under Mexicanthe Yaquis maintained their Independence, refus ing to be conquered. Beaten at the end by the government, with their country in ruins, they now go one step further In becoming Mexicanlzed by their acceptance of a foreign com mander. Four hundred Yaqul soldiers are at Port Perote, a mountain near Orizaba, in the state of Vera Cruz. This Is the group which for the first time In his tory has submitted to liavl z a non- Indian leader. The war offices an nouncement of a change In the organi zation of this Yaqul force was regard ed as signifying the disappearance of Yaquis as separate units. Hereafter they will be part of the army. Colonel Enrique Morfin Figueroa has been as signed to the group under the new arrangement. Manzo Conqueror of Yaquis. The actual conqueror of the Yaquis was Gen. Francisco Manzo, one of the leaders of the present rebellion who recently crossed the United States j border at Nogales to escape falling Into federal hands. The Manzo campaign against the Yaquis, undertaken three years ago, was organized with 13,000 troops and equipment which Included nine airplanes. At that time the Yaquis controlled a region extending 100 miles north of Guaymas, In Sonora, and which In cluded some of the best lands in the republic. The stretch under Yaqul ownership extended along the Yaqul river valley in a district larger than the Imperial valley of California and with water resources three times as great as those of the Imperial valley. Today the only Yaqul country left la Yaqul power Is In the Bacatete moun tains. But the power is small. All the warriors are gone or killed. Women and children and old men predominate in the last citadel. As In the present revolution, the rebel Indians In Yaqulland lost their fight partly through the government? use of the most modem arm of war the airplane. The nine planes that Manzo had on his front flew con stantly over Yaqul territory bombing and spreading terror. The federal planes drove the Inhabitants of Baca- tete, the capital, Into the mountains and finally destroyed it. Planes Aided in Conquest. Ammunition ran low after the wai had raged Incessantly for many months, the plane raids continued un ceasingly, and finally, cut off from the world and beleaguered from the air. the Yaquis surrendered. Their sur render, however, was conditional. They agreed to take service In the Mexican army provided their own chief. Gen ernl Ignacio Mori, should be permitted to continue as tlielr head. Their liberty curtailed by the rigid discipline of the army, the Yaquis were not always good soldiers, although their valor in lighting was unques tioned. The group at Ierote was for this reason perhaps little better ofl than prisoners. The Yaquis still preserve their undent language and customs. Al though they are Christians, In com inon with other. Indian tribes of Mex- they have mixed the symbols of"}, "highlight": {"text": {"matched_tokens": ["river", "district"], "snippet": "extended along the Yaqul <mark>river</mark> valley in a <mark>district</mark> larger than the Imperial"}}, "highlights": [{"field": "text", "matched_tokens": ["river", "district"], "snippet": "extended along the Yaqul <mark>river</mark> valley in a <mark>district</mark> larger than the Imperial"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.94, 282.44, 1992.23, 1177.04], "bbox_id": "2ec17a9a0e", "file": "AppomattoxNewspapers_1902-1905a_0162.pdf", "page": 1, "text": "Subject Death ef Saul and Jonathan, 1 Sam. tcxx I., 1-13Golden Text, Froe. xiv., IPMemory Verse, It, 7Com mentary on the Days lesson. 1. Men of Israel Fled It is supposed that the battle was being fought m the p.ain of Esdraeion and that the Israelites tied before their enemies to the slopes of Mount iGlboa, -vhitiier Tic Philistines fol lowed. Fell down s.ain It was impos sible for them to rally. Saul and his son fought like heroes and no doubt threw themselves into the forefront of the battle, but all in vain God was against them, 2 . Followed hard. The onset of the Philistines was directed mainy against that quarter where Saul and his eons were fight ing. Slew . . . Sauls sons. Jona than falls with the rest. 1. God would hereby complete the judgment that was te be executed upon Sauls house. 2. He would make Davids way to the crows clear and open. 3. God wonld alee show ue. that the difference between gesd and bad i t be made in thg other world, npt in this. Whatever may have been the character of the other who fell, Jona thans fate was not the result ef his per sonal transgression but of bis fethers sis, and says to us in plain ir.nguage that n siner heyrns ony nimsef. and that th good often in this world suffer be cause oi the bad. Ad relationships of lb have some influence upon our earthly des liny, but no other is so potent for good or ill as that which a parent hold to hi child. But .if Jonathan is a sad illustration of this truth, he is also a cheering proof that if a son must suffer for his fathers character he need r.ot walk ip that fathers footsteoa. II. The death f Saul vs. 3-8. ,T The archers. The men who shot, arrows with the bow. Hitoverworked. Aitei the death of Sauls sona the archer singled Saul out and pursued him. Theirmissiles were aimed at him and some of them may have hit him. Sore woundedgreat ly distressed. The Revised Version give the correct meaning. The word nowhere means to be wounded as our version has it here. He saw that he was the mark of the Philistine sharpshooters, and he there fore writhed and quaked with tc.sor at the thought of falling by such bends. 4. Would not. The arvnorbetrer, who, according to Jewish writers wo Deeg, would not. yield to Sauls entreaty. It ws his duty to protect the Kins, and he was respotisibe for Sad life. He dared net Wtrctcli forth his hand aeainat the Lerds anointed the very thought of sueh an aft filled him with fear. Fell upon it. Thruzt it-fhroigh himself by falling over upon it. It is believed by many, from the construction of tbe original, that Sanl ended his life with the sword of the ar- norbearer. If this be true, then Saul and Dseg both fell by that weapon with which they had before masscred the priests sf Rod 1 Sam. 3218. This account of Saul death is every way consistent with itself end with Sauls character, md i to be regarded as the true and authentic reran! f the sacred historian himself. The story f the Amslekite. who stoe the kings crown and bracelet and brought them t, David 2 flam. 14-10, is to be trsated as a fabrication. 5. 0. Saw that. Saul. etc. He probably drew the swerd _f-om the kings boav and. did what he cond to aye him, hut it was too late. He fell. Being answerable fot the kings life he feared punishment ot from a nobler motive of true fidelity, re fused-to survive hi master. So Saul died.- The real ground of Sauls lest dark act ol !f-dctruetion v not the extremity ol the moment for fear of insult from th enemy, but the decay of his inner life and the Complete severance of his Heart from God. He who would not leave the ordering l hi life to God would r.r- 1 - permit Him to order the manner sf his death Suicide is a great sin. 1 . Xofe the eanses II Not merely aceum.uated misfortunes, but long-continued wrong-doing. 2 Cow- srdly fear of -suffering, a Caring non for diggmee than for sin. 4 Abandon wont of trust in God. a to thi life and the futnre life. 2 . Note the effects  1  Othsr led by. the example into tlje cams jj. f 2  Personal dishonor not proven ted 3 A prawning apd.lusting reproach t the mans wemeTW- 4 The eternal loss of th Soul. All hi meri  Comparfe 1 Chrnn. I 8 lfl. Some think this refer to hi body guards and means tbr.t they were all slaiS h.p tbipt- the referenee is to al hi household who went with him to the wai and en whom his hopes for the future hunr. TfT. The PHlistires victor-oii fvs. 7-10. 7. Othr.side of the valley. The inhab itants on the opposite side of the great valleyof Jczree. The disiriet U- the nortV is meant, in which the tribes of Issachar, abulqn andtNapbtitii dwelt. Other side Jordan. Inc panic spread even t the eastern side of the Jordan. But possibly the nhrc here means or t-he ride of the Jordan, that la, in the district hetweea the battlefield and the river. Fled. It was very natural for the peope in th towns and village there to take fright and flee, for ad they awaited the arrival of the victors, they must, according to the"}, "highlight": {"text": {"matched_tokens": ["district", "river"], "snippet": "that la, in the <mark>district</mark> hetweea the battlefield and the <mark>river</mark>. Fled. It was very"}}, "highlights": [{"field": "text", "matched_tokens": ["district", "river"], "snippet": "that la, in the <mark>district</mark> hetweea the battlefield and the <mark>river</mark>. Fled. It was very"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1278.67, 601.84, 1435.38, 1737.38], "bbox_id": "8e1b15cda3", "file": "AppomattoxNewspapers_1898-1902a_0687.pdf", "page": 1, "text": "ViFgliiid derisions ÔflgiiiàlJosidb F. Haney, St. Elmo, 8. Increase resto rations, reissue, c  Edward Burns, Na tional Military Home, Elizabeth City, 8 Andrew Brooks, National Soldiers Home, Elizabeth City, 8  Charles F Reed, Salem, 10. Original widows, c special, accrued April 25 Mary A Shotron, Prospect Hill, 8. Original John Clark, Chuckatucl, 6. Increase Restoration, Reissue, etc.George W. Rileÿ.vNatiorisI Military Home, Eliza beth City, 10. Mexican W ar-M iles R Bahaman, dead, Lynchburg, i Origi nal Widows, etc. special, accrued April 28 Lucinda Morris, Portsmouth, 8 Increase Robert James Wilson, Nation al Soldiers Home, Elizabeth City coun ty, 10 John B. Weirouch, Reliance, 8 William Hawkins, National Soldiers Home, Elizabeth City county, 12 Jas. Cârf National Soldiers Home, Eliza beth City coutity. 8. A singular wreck occurred in the freight depot yard of the Norfolk and Western railroad, in Petersburg. As a train of 45 gondolas, loaded with coal from Lynchburg, was pulling into the yard the locomotive and five of the gon dolas left the track at a switch. The lo comotive after running a few yards was turned sideways and ran into the black smith shop building of the Petersburg Iron Works Company. The tender was overturned and one of the cars was thrown lengthwise across the track. The engineer jumped from his Cab and was not hurt.. Fireman VernOii Chandler re mained at his post and was caught be tween the end of the tender and firebox of the locomotive, in which position he was Wédged for more than half an hour while à large force of men were, kept at wofk endeavoring to extricate him. All this time a plug stream and buckets of water obtained from the river close by were thrown on him to prevent his being burned to death. Confederate Memorial Day was ob served in Norfolk with appropriate cere monies. The celebration was the largest in many years, veteran camps from Rich mond, Petersburg and other near-by cit ies, As. well aS the entire Seventy-first Virginia Regiment, participating ill the big parade, a feature of which was a division composed of 1,200 school chil dren. Much interest has been excited in Lex ington and Rockbridge county by the agitation in Baltimore for the sale of the Valley Railroad stock. Lexington has 25,000 invested in this stock and Rock bridge 420,000. The majority of the stock is controlled by Baltimore and the county of Rockbridge. Therefore the county is watching with great interest the course of events in Baltimore. Confederate Memorial Day will be ap propriately observed in Lexington on Tuesday, June 3. that day being the birthday of President Jefferson Davis. Lee-Jackson Camp, Confederate Veter ans, has invited Rev. Dr. G. W. Finley, of Augusta county, to deliver the memo rial address. Dr. Finley was a captain in the Confederate Army. Every arrangement for the Elks car nival at Staunton, May 26-31, is fast ap proaching completion, and it promises to be a magnificent affair. The decorations will exceed anything of the kind ever undertaken, the merchants having agreed to decorate, and are already getting ready. A large number of entries are al ready in for the floral parade. The academic class of the University of Virginia met and elected the following officers for the ensuing year  Charles S. Brent, Jr., of Lexington, Ky., president  Garrett Watters, of Norfolk, Va., vice- president James Hay, Jr., of Madison, Va., secretary and treasurer William Leigh, of Houston, Va., librarian. For thé death of his 12-year-old son, who was killed by a falling telephone pole that had rotted at the base. L. B. Moore, of Bristol, received a judgment in the Federal Court at Greeneville against the East Tennessee Telephone Company for 5,000 damages. Senator Carter Glass, of Lynchburg, lias announced his candidacy for the Democratic nomination for Congress in the Sixth district, to succeed the late Hon. Peter J. Otey. Senator W. P. Barkdale, of Halifax, has withdrawn and will support Mr. Glass. The large farm of the Brooke estate in Louisa county, containing over 1,000 acres, was purchased at auction this week by Messrs. W. J. and J. H. Crank for  5 , 5 - Walter Miller, who was indicted in the county court of Shenandoah county upon the charge of assaulting Charlie Cline on last Christmas day, was tried and acquitted. Judge B. A. Hancock, of the Circuit Court of Prince George County, has granted a charter of incorporation to the Charles N. Romaine Fireworks Manu facturing Company. The authorized capital is 50,000. A. C. Smith, editor and owner of the Bristol Evening News, and Mrs. Emma J. Meinfield, of Elmira, N. Y., were united in marriage in Washington, D. C. The couple will reside in Bristol. The Board of Pension Commissioners of Rockbridge county has cut down the list of names for pensions to 131 from 167. During the past year 23 deaths have occurred among the old soldiers. Mr. Charles Payne, one of the oldest citizens of Orange county, died at his home, near Lahore, at the advanced age of 94 years."}, "highlight": {"text": {"matched_tokens": ["river"], "snippet": "water obtained from the <mark>river</mark> close by were thrown"}}, "highlights": [{"field": "text", "matched_tokens": ["river"], "snippet": "water obtained from the <mark>river</mark> close by were thrown"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [613.21, 456.57, 781.75, 2003.96], "bbox_id": "edbf66a312", "file": "AppomattoxNewspapers_1898-1902a_0366.pdf", "page": 1, "text": "Ths United States District Court In Milwaukee, Wis., denied the petition of the Chicago Board of Trade for a temporary injunction restraining sev eral alleged bucketshops of Milwaukee from using the quotations of the Chi cago board, and referred the case to a referee. Capt. J. V. Henry, former assistant postmaster at Quincy, 111., was arrested on the charge of embezzlement from the National Railway Mail Service Benevolent Association. Theodore Furley was sentenced to 15 years in the penitentiary for attempted rape on Mrs. Sarah Bowers, near Darkeville, W. Va. The threatened race riot at George town, 8. C., was averted by the Gov ernor, who ordered the dispensary and beer privilege closed. President John E. Hudson, of the American Bell Telephone Company, DW suddenly in a railroad station in Beverly, Mass. A crowded trolley car ran away in Wichita, Kan., throwing 50 paasengers into a creek, of whom 30 were injured. Mrs. Frank Leslie retired from the management of Leslies Popular Monthly. General Colton Green, an ex-Con- federate, died at his home in Memphis. Tenn. A severed human head was found in a grain sack in Cedar Lake, Ind. Rev. Young Reeder, pastor of the Columbia S. C. Baptist Church, who had been warned by an opposing faction not to hold services, was shot dead while praying, and Rev. B. H. Williams, who was assisting him, was wounded. The Cunard Line steamer Campania arrived at New York from Liverpool and Queenstown after a very protract ed voyage, caused by dense fog, dur ing which the engines were slowed down. Sexto Lopez, formerly secretary of Agulnaldo, arrived in New York on the Cunarder Campania to explain to the American people, he says, the Fili pinos side of their fight against the Americans. Harry Bloomburg, a traveling sales man, from Hagerstown, Md., was found unconscious on the mountain road near Franklin Furnace, Pa. He claim ed to have been a victim of knockout drops. Julius Washington, the colored por ter of a Pullman car, shot and serious ly wounded A. E. Hindle, the Pullman conductor on the Florida express after a quarrel. Warner M. Newbold, a prominent of ficial of the Louisville and Nashville Railroad, committed suicide in Bir mingham, Ala. The nlnc-year-old son of S. W. Kalor, of Parsons, W. Va., was killed by falling from a chestnut tree. Col. David H. Elliott, land agent of the Southern Railway, died suddenly in Charleston, S. C. A serious blow to arbitration in the settlement of the coal strike has been dealt by the men of the Markle mines who have repudiated their agreement with their employers. The strike sit uation is otherwise unchanged, and President Mitchell is awaiting develop ments in the probable shape of a de finite offer from the operators. A New York story is to the effect that the of fer ts already formulated, only the de tails being left to be arranged. President Buffington, of the fltinois Steel Company, announced that a num ber of the mills would be shut down on account of a scarcity of orders, pur chasers awaiting the result of the presidential election. In Frankfort, Ky., Judge Cantrell overruled the motion for a new trial made in behalf of James Howard, con vlcted of killing Governor Goebel, and sentenced him to be hanged. Notice of appeal was given. Tim Murray, who represented him self as collector of political contribu tlons for both parties, was sent to the penitentiary for one year in La Crosse, Wis. The Manchester Va. police chased through the wilds of Chesterfield on the scent of a man they believed to be Topeka Joe. Fire broke out on the steamer American at New Orleans in the com partment in which 35,000 bushels of wheat was stored. Settlement of the coal strike is still distant President Mitphell says the proposed offer of a 10 per cent, increase to the miners would be unsatisfactory, and it is probable that the strikers would reject it. Quiet continues in the Lehigh Valley. The Jury in the Circuit Court in Alexandria, Va., gave Mrs. Laura Wat kins a verdict of 2000 against the Alexandria and Mount Vernon Electric Railroad Company. Solomon City, in Seattle, Wash., at tjie mouth of the Solomon River, was devastated by the storm and all the buildings were wrecked. A passenger train on the Southern Pacific ran into a ditch near the Utah- Nevada line. One person was killed and fifteen injured. General Charles G. Ileywood, of the Marine Corps, arrived at the Ports mouth Va. Navy Yard on his tour of inspection. Josiah R. Adams, a prominent law yer and clubman, of Philadelphia, com mitted suicide without apparent cause. Ex-Mayor Collier, of Atlanta, died from the effects of a pistol-shot wound received while chasing burglars. William Brown fc Sons, wool deal ers, of Philadelphia, failed, with lia bilities of one million dollars or more. John Williams and B. Thornton were held for the grand jury in Newport News, Va., on the charge of rape. Seymour Campbell tried to shoot his wife and another woman in Wakefield, Mass., and then killed himself. Deputy Sheriff Sloan was killed at Lake Charles, La., while defending a negro prisoner from a mob. John B a lle n g e r, a farmer, residing near Mount Vernon, Fairfax county, Va., committed suicide. Prof. John E. Gintner, of the Otter- beln University, died at his home in Westerville, O. Warrants were issued in New York against big concerns for violating the smoke ordinance. William Morse, colored, ran away from Norfolk with a young English nurse girl. Archie Kinsauls was hanged at Raleigh, N. C., for the murder of John .Herring. Charles Jones, the valet and Dr. WSlker Curry were the only  jso n s who followed the b o d y of William Marsh Rice to the Fresh Pond Crema tory, near New York. Lawyer Patrick mde a statement to vindicate himself. Charles A. Collier, president of the Cotton States Exposition of 1896. was shot by burglars at his home in At lanta, 6a."}, "highlight": {"text": {"matched_tokens": ["District"], "snippet": "Ths United States <mark>District</mark> Court In Milwaukee, Wis.,"}}, "highlights": [{"field": "text", "matched_tokens": ["District"], "snippet": "Ths United States <mark>District</mark> Court In Milwaukee, Wis.,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1565.29, 307.29, 1749.2, 1785.32], "bbox_id": "8cabaa41a3", "file": "AppomattoxNewspapers_1902-1905a_0500.pdf", "page": 1, "text": "The State Board of Education, which meets in Richmond, April 27, -will in vestigate the charges made by Prof. J. D. Eggleston, Jr., a candidate for the of fice of Superintendent of Public Instruc tion, that the Virginia Teachers Reg- IStu .en8 sod Tor 75 cents a copy to each of the 9,000 teachers in the State, costs only 25 cents to produce. It was said at the department that it is not known whp owns the Register copyright, but that no one connected with the de partment has ever owned it. It is under stood that Mr. Eggleston will be asked  to appear before the board and that he  in a position to show who owns the I fISer- The names of school officials have been connected with the publication of this book. The School Board at its meeting on the 27th will elect about 80 school superintendents. There are con tests in Albemarle, Alexandria, Alle gany, Amherst, Bedford, Bland, Bote-  tourt, Brunswick, Buchanan, Carroll, Campbell, Craig, Dickinson, Dinwiddie, Floyd, Goochland, Gloucester, Halifax, Hanover, Henrico, Highland, King George, Lancaster, Lee, Madison, Nel son, Northampton, Orange, Patrick, Powhatan, Prince Edward, Roanoke City, Rockingham, Russel 1, Shenandoah, Spottsylvania, Washington and Wise. The Interstate Fair Association of Lynchburg has been organized with these officers President, Congressman Carter Glass vice-president, H. P. Har man treasurer, S. T.-Willis. The 20,- 009 stock has been over subscribed. An effort in the Fredericksburg City Council to increase the liquor licenses from 350 to 500 was defeated., The dedication of the monument to Gen. Alexander Hayes on the Wilder ness battlefield, in Spottsylvania county, which was announced to take place May .5, has been postponed indefinitely, as the monument is not completed. A fire which started in a woodyard shed, in Portsmouth, at 11 oclock in the  morning, burned 15 stores and dwell- I ings in the district bounded by Chestnut, I t ondon Queen and Effingham streets. The fire was practically out at 3 P. M. The damage is- placed at 15,000. j Several days ago James E. Watson, residing in Petersburg, stuck a splinter I in his hand. He thought little of it at the time, but lockjay subsequently de veloped and he died. The Board of Aldermen and City Council of Petersburg invited the trus tees of Hampden-Sidney College- to lo cate the college there. A resident has offered to give a site. A destructive woodland fire occurred in Dinwiddie county, near the court house, which burned over a large area of land. An immense quantity of valu able standing timber and fencing was destroyed. The Methodist Church at Dinwiddie Court House narrowly es caped being burned. Capt. John W. Nicholson, of Ports mouth, was fined 35 and put under a peace bond of 500 for assaulting and pursing Col. John W. Oast in the street Colonel Oast is United States Super visor of the Norfolk Distdict, and Cap tain Nicholson was dismissed from the office of steamboat inspector on his rec ommendation for intemperance. There has been enmity between the men ever since and but ror the interference of friends there would have been a serious encounter. Work was started on the rehabilitation of the old furnace at Reusens, several miles west of Lynchburg, on the James River division of the Chesapeake and Ohio Railway. The furnace has passed I to the control of the Southern Develop ment Company, of Philadelphia, which I is to expend 40,000 in the next three months. The furnace will be operated I is soon as possible. To start with, it will have a capacity of 100 tons a day. The trustees of the George M. Jones Memorial Association have accepted the design of Frye  Chesterman, of Lynch- burg, for the 40,000 public library to be erected there by a bequest of George M. Jones. The building is to be of buff pressed brick, with Indiana limestone and terra cotta trimmings. Mrs. Jones has given a valuable site and an endow ment of 50,000. E. E. Walker, of Campbell county, was arrested in Lynchburg by Detective A. D. Williams, charged with burning the barn of S. M. Wisecarver, neat Rust- burg, three months ago. Five horses and other animals were destroyed. Norfolk will secure the annual meet ing of the Southern Wholesale Grocers Association to be held June 5, 6 and 7. President J. A. Van Hoose, of Birming- ham, Ala., writes as much to the Whole sale Grocers and Tobacconists Associa tion of Tidewater. The idea is to hold the convention either at Ocean View or Virginia Beach. Capt. Henry Kirn, the largest truck- raiser in the Norfolk section, estimates that the losses of farmers in Tidewater Vinginia will reach the vast sum of 1,- 000,000. He has individual losses of several thousand dollars. Mr. Kirn in speaking of the matter said that until the frost of a few nights ago there had been hone for four weeks, and crops, particularly strawberries, had had favor able conditions, the blossoms came early and the berries followed and were in fine condition. Mrs. Kelly Breeden, of Rose Hill, Charlottesville, stepped off a moving Main street car with her little son in hfr arms. The boy escaped injury, but it is feared the woman fractured her skull. Norwell Getses, of Boston, engineer on the schooner Catherine M. Monahan, was killed at the coal pier at Newport News. The schooner was being loaded with coal when Getses came on deck. Just as he came out of the campanion way a large lump of coal fell from the pier and crushed in his skull. He leaves a widow and one child in Boston. Charles Best died at Arvonia, Bucking ham county, of injuries received in the slate quarry, a heavy rock falling on him. He was a native of Albemarle county. After hiccoughing almost incessantly for 96 hours Austin T. Quick, a promi nent business man of Lynchburg, has been relieved. There seems to be no doubt now that Mr. Quick will recover speedily. The publication of his trouble brought the family a large number of letters, telegrams and even long-distance telephone messages suggesting remedies for the trouble. Some of these were tried, but they gave no relief. It was decided by the General Hospital Board, in session at Williamsburg, to have all tuberculosis patients in the Eastern and Western Asylums moved to the asylum at Marion. The will there be made to live in tents."}, "highlight": {"text": {"matched_tokens": ["district"], "snippet": "I ings in the <mark>district</mark> bounded by Chestnut, I"}}, "highlights": [{"field": "text", "matched_tokens": ["district"], "snippet": "I ings in the <mark>district</mark> bounded by Chestnut, I"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [941.28, 590.82, 1097.4, 1013.51], "bbox_id": "8c657946b1", "file": "AppomattoxNewspapers_1898-1902a_0647.pdf", "page": 1, "text": "St. Paul, Minn., Special. North Da kota and the Canadian Northwest are ex periencing the worst snowstorm in many years and railroad traffic is practically paralyzed. The Northern Pacific and Great Northern have not moved a wheel for nearly 31 hours in the blizzard-strick en district and have abandoned all efforts to run trains until the fury of the storm abates. The high wind has piled the snow in the mountains and packed it in solid masses, many deep cuts being entirely filled. The temperature has been grad ually falling and is now at or below the zero mark. Not a trans-continental train has arrived at St. Paul since Friday, and -none is expected for several days. Every effort is being made by the road to keep its passengers who are snowbound warm and well fed. For this reason trains are being held at stations where the accom modations are good rather than attempt to get them through, with a possibility of being tied up between stations. The Red River Valley division of the North ern Pacific between Frankfort and Win nipeg. Manitoba, has been entirely aban doned. The telegraph wires have been carried down by the burden of sleet that preceded the heavy snowfall. The Great Northern is tied tip entirely between Grand Forks and Williston, N. D., a distance of about 35 miles, and all wires have been lost beyond Fargo. All communication by wire with Western Dakota and Montana points has been lost. The branch of the Great Northern run ning to Winnipeg is also tied up. No trains have been started northward since Friday night, and those that were caught out on the road by the storm have been held at the station near the border. Winnipeg is reported entirely cut off from railroad communication with the outside world. The Canadian Pacific trans continental trains are snowbound somewhere west of there and no prospect of relief is yet in sight."}, "highlight": {"text": {"matched_tokens": ["district"], "snippet": "in the blizzard-strick en <mark>district</mark> and have abandoned all"}}, "highlights": [{"field": "text", "matched_tokens": ["district"], "snippet": "in the blizzard-strick en <mark>district</mark> and have abandoned all"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [786.68, 510.83, 950.21, 755.03], "bbox_id": "0e61dd41c1", "file": "AppomattoxNewspapers_1912-1915a_0120.pdf", "page": 1, "text": "Pittsburgh.The city of Pittsburgh forgot her own flood troubles for a few minutes and raised 25,000 to relieve sufferers in Ohio. In the Pittsburgh district 100,000 men are idle because of high rivers. Pittsburgh is partly Inundated. Rain is falling through this end of the State. Miles of streets in the down- town districts are submerged. The police patrol boats are out. At Sharon a woman and  five chil dren were drowned when their hom e, fell Into the Shenango River. The Shenango and Mahoning rivers at New Castle are higher than ever before. All manufacturing plants are shut down. One thousand homes are under water. Thousands of cattle are drowned. All the bridges between War ren and Jamestown, N. Y., have been washed away. The floods spread to Pennsylvania and In Western and Central New York rivers were rising rapidly and doing much damage, 1,000 persons being driven from their homes in Olean."}, "highlight": {"text": {"matched_tokens": ["district"], "snippet": "Ohio. In the Pittsburgh <mark>district</mark> 100,000 men are idle"}}, "highlights": [{"field": "text", "matched_tokens": ["district"], "snippet": "Ohio. In the Pittsburgh <mark>district</mark> 100,000 men are idle"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1258.79, 542.05, 1427.57, 1910.84], "bbox_id": "97025c3861", "file": "AppomattoxNewspapers_1898-1902a_0424.pdf", "page": 1, "text": "News of a sensational shooting oomes from Moab, Washington county. A band of thieves that has been Che terror of Chat community attacked the home of W. J. Kendrick, a well-to-do farmer, whom they had previously sought to entice from his home, prob ably for the purpose of robbery. Two members of Che family faced the band With Winchesters and a lively battle ensued in tho dark, the marauders finally disappearing. Search revealed that one of the band had been shot through the head. His hart, a piece of skull bone and a blood spot markpd the scene, hut the victims companions had carried him away. They were traced by the blood to the Holston River and the supposition is that the body was buried beneath the water. A man from the nearby knobs te miss ing. The Charter of Shenandoah Farmers Union, of Woodstock, has been record ed In the clerks office of the Circuit Court of Shenandoah county and au thorized the union to issue stock not to amount to over 5000 at 25 per share to purchase supplies for the farmers and sell Chelr products to conduct and operate factories, stores and warehouses, with its chief office at Woodstock. The officers for the first year are Joseph H. Sibert, presi dent W. J. Keller, secretary and treasurer John W. Hockman, Lev Coffman, W. H. Sheetz, G. A. Boyer, P. S. Rinker, George W. Fravel and J. F. Hotitel, directors. A Richmond policemans badge num bered 13 is believed by the supersti tious to have brought Its wearer any amount of trouble. The owner of tlhe badge te Roundsman Amos. It was worn by Policeman Austin when he was set upon by a gang of negro roughs and killed some years ago. Since It came into the possession of big Officer Amos that guardian of the peace has had many misfortunes happen to him, the latest being an accident while out rid ing. Amos may apply to he Police Commissioners to give him a number to which there is no hoodoo attach ment. In view of the meeting early this year of the Constitutional Convention attention has been called to the con- iitfon of the State House, where the sessions of his body will be held. Two resolutions were offered in the Legislature calling attention to this matter. In the Senate Mr. Fairfax, under a suspension of the rules, had adopted a resolution providing for tho appointment of a commission of five to investigate the condition of the old Capitol and if necessary provide a new roof and make other repairs. Archie Hunt, the negro who was jonvicted of the murder of Tom Gills, ilso colored, expiated hils crime on the gallows in the Lynchburg Jail. He was attended by Rev. Father Anciaux, the priest in charge of the colored mission, and Rev. Father McGuire, pastor of the Church of the Holy Cross. Hunt was calm and cool to the end and met his fate with remarkable fortitude. When asked if he had anything to say he answered I am about to be executed for killing a man in self-de fense, and thats all there Is to It. Since he death of three citizens in Stafford county and the narrow escape of 15 others from drinking the vile eoncodtlon known as schnapps, which is being sold in local option district through the State as a substitute for liquor, many heretofore strong advo cates of he local option system are now outspoken for license, as they think it is better for people to drink liquor made in the regular way, if they will persist in using these es sences of poisonous chemicals when they cannot buy whiskey. In the House Mr. Todd, of Augusta, introduced a bill providing capital punishment for whitecappers. This extreme penalty for this crime is pro posed in view of the defiant attitude of some lawless elements in Bedford county recently. These people have in some instances threatened to kill jus tices of the peace and other law offi cers who seek to arrest them for white- capping. There were two bills introduced in the House providing the details for assembling the Constitutional Conven tion. One of these, offered by Mr. Parks, fixes the membership of the convention a t 80, two for each State Senatorial district. The time of meet ing is July 1 and the date of the elec tion and other essential features are similar to the other propositions offer ed at this session. A dealer in skins of wild ani mate ait Lexington has bad a fair season since the winter set in in spite of the mild weather. He has shipped north 336 skunk skins, 257 rabbit, 209 coon, 148 opossum, 54 muskrat, 35 gray fox, 13 red fox, 12 mink, 4 bear, 4 wild cat, 4 civet cat, 1 deer, all killed or trapped in sur rounding country, and 6 house cat skins.  Raphine, a small station on he edge of Rockbridge, near Augusta line, shipped, during the past year for a firm of cattle dealers, 541 cattle, 177 veal, 1367 sheep and 2946 hogs. The price paid out to the people of that neigh borhood was 46,755.40, or an increase over the amount paid out by same dealers in 1899 of 5000. There was a falling off in number of cattle shipped but an increase In other stock. The trike of the coal trimmers em ployed on the Chesapeake and Ohio coal piers at Newport News is practi cally at an end. In addition to the new hands brought down, a number of the strikers have returned to work at the old scale. About 180 men are now at work. It requires only 200 men to operate the piers fully. There has been no disorder whatever in connec tion with he strike. Mr. W. H. Martin, a promising young man of Unionville, Orange county, died at hte home at that place of pneumonia, after an illness of only five days, aged 21 years. He leaves many relative. Sidney Palmer, of Phoebus, Is on the verge of death as the result of a serious cut received in a quarrel. George Wallace, his assailant, has been arrested. The two were playing pool When, it is claimed. Ws ice became enraged and tabbed Pa.mer in the teg. The latter nearly bled to death before assistance arrived."}, "highlight": {"text": {"matched_tokens": ["River"], "snippet": "blood to the Holston <mark>River</mark> and the supposition is"}}, "highlights": [{"field": "text", "matched_tokens": ["River"], "snippet": "blood to the Holston <mark>River</mark> and the supposition is"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.44, 278.66, 1720.86, 1712.01], "bbox_id": "28d18c11d0", "file": "AppomattoxNewspapers_1902-1905a_0475.pdf", "page": 1, "text": "John Gilliam, colored, was sent to the penitentiary by the Corporation Court of Norfolk for a term of io years hard labor. He committed a criminal assault on a little colored girl. Dr. Skelton, a Bloodfield physician, who has taken part in the crusade against the Bloodfield lawbreakers, announced that he had received warning that he would be assassinated. He fears tliai his enemies may try dynamite on him. and has removed from his office tem porarily. mel, of Frederick county, set fire to the house while trying to light a lamp with paper. Aroused by the childs screams, Mrs. Armel rushed into the room and rescued her daughter, after which the flames were extinguished. Mrs. Arme then fainted. The entire plant of the Vienna Bak- ery, Winchester, was destroyed by fire at an early hour the other moning, causjng a loss of several thousand dollars, partly covered by insurance. While running to the fire one of the Sarah Zane Fire Companys horses fell over a - pile of stone in the dark and was severely in jured. Mrs. Virginia Bond, widow of Thoma Bond, died at her home near Oronage Courthouse, aged 62 years. She is sur vived by two, sons and two sisters. The portrait of George Washington, owned in Fredericksburg by Masoni Lodge No. 4, which made him a Mason, has been pronounced by experts in Wash ington a genuine Gilbert Stuart paint ing. As Stuarts works are rare, this j original portrait is of considerable value. This is said to have been painted from life during Washingtons second term as President of the United States. Tra dition says it was a gift of Washington to his mother lodge. A young daughter of Mr. Amos Sulli van, of Stafford county, was badly burn ed last week by falling into an open fire. There was indignation in Norfolk on the receipt of the Congressional Record, which declares that the item in the River and Harbor bill as passed au thorizes a 25 and 30-foot channel to the navy yard in the Elizabeth river when the bill was drawn for a 30 and 35-foot channel. The channel is already 28 feet deep and vessels of 30-foot draft have passed out. If the item in the Congres sional Record be not a misprint the bill must have been tampered with. Phila delphia interests are suspected here. Benjamin Lovitt, a negro boy, was arraigned in Berkley, charged itith the malicious wounding of John Allen, son of D. V. Allen. Allen and other white boys were playing marbles when the negro boys approached and a quarrel en sued. Allen was stabbed in the back with a pocketknife. The wound is seri ous, and Lovitt is held to await the re- sult. The explosion of a bottle of nitre in the drug , store of Jerome P. Carr, of Portsmouth, set the place on fire. Mr. Carr failed to extinguished the blaze with a carbonater and called the Fire Depart ment. The stock and building are dam aged 1,000. Governor Montague has finally deter mined not to interfere jn the case oi Peter Dancy, the negro who was recently convicted of murder in the Circuit Court of Henrico county. Daney is sentenced ,to be hanged this Thursday. The State. Schoool Board, in its re port, vindicates Principal J. V. Hill, oi the Radford School, who had trouble of a personal nature some time ago with Superintendent of Schools Lucas. It is said that Radford will be merged with Montgomery county when the board meets in May to select superintendents. Dr. William W. Smith, chancellor of the Randolph-Macon System of Col leges, purposes to enlarge the Womans College at Lynchburg. He wants to raise 40,000 by subscriptions if the City Coun cil of Lynchburg will appropriate 10,- 000 to make the amount 50,000. Dr. Smith offers to erect during this year a science hall, costing 20,000, and an addi tional dormitory, which will aid him in increasing the attendance by too young ladies, if the city will make the asked for appropriation. This will bring the enrollment up to 550. Four prisoners escaped from the Lex ington Jail. They are John H. Maz- ingo, sentenced to four years in the pen itentiary for house-breaking S. C. Van landingham, sentenced to 12 months in jail for selling liquor in a local-option district, and Jack Lamb and Wade Gra ham, awaiting trial for house-breaking. The prisoners secured braces from their iron bedsteads and pried several bar from the bottom of the iron door. Crawling under the iron door, they used the bars as levers with which they pried open the outer wooden door leading into the hallway. They then pried the lock from the back door and escaped through the back yard. Apparently of its own accord a Southern railway passenger engine pulled out of the yards at Bristol and ran more than a mile down the Southerns main line, where it was found standing. Had it proceeded it would soon have collided with a freight train. All stations along the road were telegraphed to give warn ing of the runaway. Six unoccupied three-story houses at the corner of Virginia avenue and Twenty-eighth street, Newport News, were destroyed by fire. The buildings were owned by D. S. Jones and were valued, at ..about 5,000. When the Twenty-eighth street overhead bridge was erected its retaining wall was placed directly against the front porches of the tenements. Mr. Jones had sued the city to recover damages alleged to have been done by the wall. President W. M. Page, of the new Tidewater railway, which is to parallel the Norfolk and Western from Nor folk to the mountains, advertised for bids for the grading and masonry of 20 sectibris of the road, a distance of 100 miles west from Sewalls Point through Norfolk. He says the money is ready, and as soon as the bjds are accepted the work will begin. There is still some threat of opposition to the action of the city of Norfolk, even though the 95,000 that the Council appropriated for the right of way is at the call of the railway company. The Lynchburg Board of Trade and the Retail Merchants Association adopt ed separate resolutions calling upon the State Corporation Commission to defeat the effort to require the Southern and Norfolk and Western Railways to make connection at Burkeville if it will in any way manner be the cause of altering 1 he present schedules on the main line I of the Norfolk and Western."}, "highlight": {"text": {"matched_tokens": ["falling"], "snippet": "ed last week by <mark>falling</mark> into an open fire."}}, "highlights": [{"field": "text", "matched_tokens": ["falling"], "snippet": "ed last week by <mark>falling</mark> into an open fire."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2010.69, 1136.67, 2167.66, 1399.76], "bbox_id": "88092088b0", "file": "AppomattoxNewspapers_1915-1918a_0297.pdf", "page": 1, "text": "How Town Was Named. An Interesting story to told as to the origin of the name .Moose Jaw, as ap plied to a town in Canada. Some 60 years ago, so the story runs, a pioneer with his team of oxen and prairie schooner, while passing along the banks of the river, was obliged to camp at this point in Saskatchewan on account of an accident to his cart. A spoke had fallen out during the day, and the wheel was falling apart He looked about for something to In sert for a temporary brace fbr the  wheel, while his wife busied herself  with the evening meal. The pioneers child, while romping around, found the Jawbone of a moose, which she held up to her father, who by this time almost despaired of find ing anything with which to repair his cart He was delighted to find that the Jawbone exactly fitted the place of the missing spoke. The Indians thereafter named this district The Place Where the White Man Found the Moose Jaw. This, It Is said, accounts for the towns queer name.Washington Star."}, "highlight": {"text": {"matched_tokens": ["river"], "snippet": "the banks of the <mark>river</mark>, was obliged to camp"}}, "highlights": [{"field": "text", "matched_tokens": ["river"], "snippet": "the banks of the <mark>river</mark>, was obliged to camp"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [289.71, 481.28, 458.38, 1793.23], "bbox_id": "564c64ede7", "file": "AppomattoxNewspapers_1902-1905a_0482.pdf", "page": 1, "text": "HEN Pierre Fontaine mull Camille CliaQuette built their cabin on the bank of  the Beaver River, a trib-  utnry of the Upper George, in Northern Labrador, they looked forward confidently to a profita ble winter. Both had resigned only recently from the Hudson Bay Com panys corps of voyaguers, and this was to be their first season as independent trappers. Except for a few roving Montagnnis Indians, the district was quite uninhabited, but inured to soli tude, the hardy young hunters were not men to lament the dearth of neigh bors. Their store of pelts accumulated steadily. Early in the winter Pierre brought in a silver fox skin, and later Camille secured a black one. But skins of the marten predominated. It was, in fact, what trappers terra a marten year. Like the migratory car ibou and their faithful followers, the wolf paeks, these highly prized little animals oeeasionaliy forsake their reg ular habitat. Years, during which few or none are to be found, may elapse before they renppear in numbers.  Tis a rare run of luck, Pierre, said Cnmllle, one evening in January  If it holds, we shall have a fine freight for Fort CUimo when the ice goes out of the river. In April a serious mishap befell. For some time game had been growing scarce. Day after day the young men returned empty-handed to the cabin The furs already procured surpassed in value their expectations, but their sup ply of provisions was nearly exhausted and they were dependent in large measure for food on the result of their hunting. Except grouse and ptar migan, bird and beast alike had appar ently fled from that vicinity. Camille set out one forenoon to make the rounds of their longest line of traps which extended northwest in the same direction as the river. He expected to be gone two days. The route which i was Pierres turn to follow, and which lay in the opposite direction, was or dinariiy covered in half that time. Snow was falling when Pierre nr rived at the end of his line. Pereeiv lng that a severe storm was at hand he hurried homeward at his best pace, Presently a blizzard was roaring through the woods, and the driving snow-spray soon obscured the trail compelling the trapper to seek shelte In a rocky den amid thick clumps of spruce. There he remained a prlsone for forty-eight hours, suffering intense ly with hunger, thirst and cold, befor an Intermission in the gale permitted him to proceed to the cabin. Camille was not there! Filled with anxiety, Pierre was pr paring to search for his comrade, when he was again storm-bound. It was not until five dnys had elapsed since Camilles departure that Pier! was enabled to start on his errand . relief. But bis quest proved futile, No trace of his missing partner could he find. Stormy weather prevailed almost con tinually throughout April, keepin Pierre indoors much of the time. Nev before in his twenty-four years had In activity proved so hard to bear. T! sorting and packing of furs furnish some occupation, but this done, the hours dragged heavily. But except for an occasional pain in ills forehead, no premonitory symptoms heralded the singular affliction that impended. One evening, shortly before the ice in the river broke up, Pierre was cut ting spruce for fuel near the door of his cabin. The sun had just dropped behind the bald lulls to southwestward, when, as he stood with ax uplifted, something seemed to pass swiftly be fore ids eyes, blotting out the waning daylight.  Bewildered, lie let ids ax fall, and drew ids band across his face, then blinked and pereed about. Darkness eneompased him. He was blind, ut terly blind. In fear and trembling, Pierre groped his way into the cabin and threw him self despairingly upon the bales of furs piled beside his bunk. Then, gradually taking heart, he tried to comfort himself with the hope that his misfortune would prove to be only temporary.  It is the night-blindness! he cried. It will pass away with the dawn. He recalled cases, one of which he had himself witnessed, where others had been afflicted with that peculiar loss of sight which the voyageurs of the north term night blindness. By day, the vision of those who suffer with the malady is seemingly unim paired, but when deprived of sunlight they immediately become absolutely powerless to see. Some maintain that the same conditions which produce that dread scourge of high latitudes, scurvy, are also responsible for this curious visual trouble but whether it is scor butic or not, its origin has yet to be satisfactorily explained. To poor Pierre, awaiting in deepest anxiety the dawn which was to reveal whether or not his sight was perma nently lost, that night seemed infinitely long. Supperless, he crept Into his bunk, where he tossed hour after hour, starting up nervously at every sound. Once he fancied he heard Camilles voice, but when he strained his ears to listen, there was only the whisper ing of the wind. A pair of smoke-colored Labrador jays, chattering hungrily as they flut tered about the cabin, roused him. g his eyes, he sprang from his y. His sight Opc bunk with a loud cry was restored! Xt was broad day."}, "highlight": {"text": {"matched_tokens": ["River"], "snippet": "bank of  the Beaver <mark>River</mark>, a trib-  utnry of"}}, "highlights": [{"field": "text", "matched_tokens": ["River"], "snippet": "bank of  the Beaver <mark>River</mark>, a trib-  utnry of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.31, 419.9, 1633.25, 1209.8], "bbox_id": "6822afe574", "file": "AppomattoxNewspapers_1892-1898a_0330.pdf", "page": 1, "text": "-ft t.tin John II. Blossingame was killed hia home in Spartansburg, S. C,, by a colored burglar, who was arrested ---- A number of persons were killed in Virginia by jightning.TTlie steamer Oeeanica pud the propeMerWiliam Chisolm collided in Lake SL Cair, and botl were sunk. ---- An ex- pross train on the Chesapeake and Ohio road was derailed by train-wreckers at Ita- veuswortb,- Va.-r Bolect Councilman Wil liam Abbott Wllmnr, of Reading, li,, was arrested .on a charge of bribery-,-Two en gineers nnd a fireman were killed In a bead- end collision on thoB k O. Southwestern neRr Parkersburg, Va. ----- John Athey was ahdbaggod a d fobbed while asleep in his livery stable in Keyser, W. V a ----- The dond body of an unknown womun wa3 found near Richmond, O ----- Fire gutted the Woodruff ock, in Rockford, III, causing a loss of over 100,000, L. Goldman, who conducted n department store, Is the principal loser. ---- Five big firms of Chicago made assignments. A train on tbe Lake Shore was wrecked near Otis, Ind., and the engineer and fire man killed. ----- The Menhaerset Hotel, at Shelter Island, N. Y., was destroyed by fire. Miss Celia Rose, of Mansfield, O., is la jail, charged with poisoning her furnily. ---- - James W. Smith, cashier of the Liberty Sav ings Bank, ot Bedford City, Va., was sen tenced to three years imprisonment. ----- W. Thompson, of Mannlhgton, W. Va., com mitted suicide. ----- Frank Hall was fatally and his two children seriously injured in Williamsport, P a , by the falling of tha front wall of a new building. Hails brothel was drowned two weeks ago ia tbe river. ----- A flood did a good deal of damage in the district around Pittsburg, and many lives were lost George and Isaac Ferguson, aged ten and eight yea s respectively, were drowned while wading in the swift Wallkill River at Mid dletown, N. J. Their father was unable to swim and saw both of them drown. One of the bodies was recovered. ----- Four men were suffocated by sulphnrie acid gas white at work at the chemical works on tho outskirts of Camden, N. J. ----- Pauline Wagner died from the effects of the heat in New Yorki and her husband immediately aft rwards poisoned himself. ----- Lightning killed two men at Sandusky, O. ----- One tranp was kill ed nnd another probably fatally i-ijured in a collision between two sections o a Grand t Trunk freight train at, Lansing, Mich. ----- Fifty Hungarians, employes ot John Cap- stick A Sons, proprietors of the print mills at MontviUe, N. J., struck because of a reduc tion In their wages. Tbe nett were paid what money was duo them, and told not to return. ----- Tho management  of tho Luke Bros. Pulp Mill, of Davis, in Piedmont, W V a, notified the men of a out in wages from 1 40 to 1.20 per day. The men have quit work and the plant will probably be compell ed to close. Harry Alender shot and killed Miss Wally Fielder and V. Crossette in the streets of San Jose, Ca. He then attempted suicide. ----- Eleven persous lost their lives by the over turning of pleasure boats in Michigan and Illinois. ----- Three woman nnd two men were Irowhed in the Delaware.A runaw.iy trolley car on the Columbia and Donegal Railway in Lancaster, Pa , killed seven peo ple and injured fifty more. ----- Lightning truck the house of C C. Reppetoat Mounds- ville, W. V a, tearing down a chimney and one end of the house. ----- A. M. Brottn, of 6au Francisco, was drowned in the Lltle Kanawha near Wheeling while in bathing with a party of friends. The Pipe Creek Coal and Iron Company, a corporation do- ijjg business in Belmont county, VV. -Va, has gone into the hands of a roceiver."}, "highlight": {"text": {"matched_tokens": ["falling"], "snippet": "P a , by the <mark>falling</mark> of tha front wall"}}, "highlights": [{"field": "text", "matched_tokens": ["falling"], "snippet": "P a , by the <mark>falling</mark> of tha front wall"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1693.82, 884.08, 2182.17, 1124.53], "bbox_id": "b7b6001dc9", "file": "AppomattoxNewspapers_1905-1912a_0445.pdf", "page": 1, "text": "fine wild turkey hen Saturday, Ue 6 . For District No. 2 , 0 . C.l Concrete i better than plank for and a number of birds, a rab l Camden 482  M- L A. Moseley I floors. It is cold, bnt with plenty bit and a squirrel. The writer 1 12. I also append a list of the0f bedding it is more satisfactory, enjoyed hugely a portion of  supervisors and the vote that the turkey on Sunday, while I was cast for each oandidate the rain was falling. land in justice to Mr. A. 0 . Mr. Ewell Morgan killed a I Wood, who only received 34 fine turkey Saturday. He kil -1 votes it should be stated that led a fox the same day. the polls were not o. ened at So it can be seen that turkeys I Glenmore precinct at all and are more plentiful than usual, I this accounts in a great mea- owing to the dry drouth Igure for the small vote cast in which seemed to be unusually I James River Distriet. For conductive to the raising of supervisor ih Mays ville Diet- birds as well  riot, G. L. Spenoer 106  J. G. I Mrs. Ewell Morgan, accom- Spencer 13 , panied by Mrs. A. C. leave for where Mrs"}, "highlight": {"text": {"matched_tokens": ["District"], "snippet": "Saturday, Ue 6 . For <mark>District</mark> No. 2 , 0 . C.l"}}, "highlights": [{"field": "text", "matched_tokens": ["District"], "snippet": "Saturday, Ue 6 . For <mark>District</mark> No. 2 , 0 . C.l"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1884.93, 294.3, 2047.97, 1610.1], "bbox_id": "593c445b7b", "file": "AppomattoxNewspapers_1902-1905a_0345.pdf", "page": 1, "text": "During a storm, which passed over Winchester John McDonald, 50 years of age, was instantly killed by a large barn door falling on him. McDonald had gone to the barn to close the door against the storm, when the wind blew the door on him, crushing in his head and mangling his body. He leaves 13 children and a widow. Clinton C. Harlan, who committed suicide at the Midland Hotel, Kan sas City, Mo., left his home in Phoe bus two weeks ago for Independence, Mo., where he expected to reside. Harlan had been an inmate of this Soldiers Home for 15 years and was identified with the management of the homes theatre. His wife received th letter from him saying that he had made all arrangements for moving to his new residence. _He was a member of the Hampton Lodge of Elks. Sheriff P. M. Ball arrested and lodg ed in jail at Jonesville William Bell Wilson, alias William Anderson, who is. charged with murdering the sheriff at Falls Creek, Wis., some months ago. Sheriff Ball had seen Wilson in the county and suspected him on ac count of his peculiar conduct. When he received a letter from the Wis consin authorities giving a descrip tion of Wilson and stating that there was. an 800 reward for his capture he was prompt to act . Wilson is held for the Wisconsin officials. Edgar Dawes, secretary of the Board of Trade and Business Mens Association, and a prominent citizen of Norfolk, committed suicide at his summer home at Ocean View. He reached home early from the city and went to his room. Standing before his 12-year-old son Dawes placed a. pistol in his mouth and pulled the trigger. He was instantly killed. No cause for his rash deed can be learned. George Palmer is building a new store at Massaponax, Spottsylvania county. At a tent revival conducted by Rev. Mr. Knibb, in West Lynchburgr there have been 100 conversions. The Christian chuches of the South Piedmont district are holding theii annual convention in Snow Creek Church, Franklin county.  v . Mr. Ike Boltnotti a lineman of the Roanoke Electric Company, fell.from a pole at Crystal Spring and injured his back. Fourteen freight cars were wrecked on the James River division of the Chesapeake and Ohio railway at Westham, near Richmond. There was no loss of life. Mr. L. Shere, recently proprietor 9I the New Fords Hotel, Richmond, has opened the Hotel Norwood, opposite the passenger station, in East Rad ford.  Work on the new 30,000 Chesa peake and Ohio Railway station al the old Main Street Depot, Char lottesville, has begun. It will be 30x500 feet, of brick and stone, with a slate roof, and constructed in the Colonial style. Adjoining the station proper will be a shed running 300 feet westward and 200 feet eastward Col. John C. Summers, of Abing don, has suffered a second stroke of paralysis. His left side is affected and, while his mind is entirely clear, his speech is much affected. Winchester is preparing to annex the Neffstown suburb. Mr. Henry R. Bedinger, of Salem, Mass., is visiting Mr. W. Davis Con rad, at Winchester, He was for two years professor of English- at the University of Japan, in Tokio, and recently received the degree of master of arts at Harvard. Charles Southall, a 17-year-old ne gro, in a fight with another negro, named Maupin, at Ivy, was cut severely in the throat with a razor. John W. Davis, a Fairfax farmer, died at his home near Anandale. The cucumber crop along the Rap pahannock is being seriously injured by the wire worm. The annual reunion of the Confed erate Veterans of the Shenandoah Valley, under he auspices of Stovei Camp, Confederate Veterans, of Stras- burg, will be held at Fishers Hill, a famous battleground, on August 6. Hon. Claude A. Swanson, member ol Congress from the Fifth district of Virginia, will be the orator and Gov, A. J. Montague and staff and Lieut- Gov. Joseph Willard will be present and make addresses during tbe day. George Dillard Ford, of the real estate firm of Ford  Mosley, died at his home in Lynchburg, after ao illness of a month with typhoid fever Mr. Ford was 31 years of age. He was a deacon in Floyd Street Pres byterian Church and superintendent of the Sunday-school. The annual statement of the Vir ginia - Carolina Chemical Company, dated June 15, was made public. The net earnings were 3,293,109.27. Froir this must be deducted 1,862,757.78 comprising interest and discount, in terest on bonds and dividends on pre ferred stock and a surplus remains of 1.430,351.49 from this is to be de ducted 53,415.74, loss of Southerr Cotton Oil Company. A balance tr profit and loss remains of 1,376,- 935 - 75 - The years operating expen ses were 836,794.19. Hugh Wager was drowned Sundaj evening while boating in a strearr near Remington, Fauquier county, where he lived. Mr. Wager married Miss Cora Clapp, of Hagerstown. Charles Cultons sawmill, in Pow hatan county, with a quantity of lum ber, was burned. Loss, 10,000 nc insurance. An 8-year-old son of Robert Han cock fell overboard at Dreifus dock Alexandria, and had a narrow es cape from drowning. A negro wha was passing seized an oar and fished the youngester out. Samuel Hughes, a negro, in Alex andria, pleaded guilty to robbing car? in the yards of the Washington-South ern railway. He was sentenced tc six months in jail and fined 100. E. B. Swindell, of Hyde county North Carolina, bow lookout on the Old Dominion steamship Berkeley, was killed by lightning Saturday ! while the boat was en route iron- I Norflolk to Newport News. The same bolt split the flagpole of the Berkeley. During the storm a boa I containing 12 men capsized in New -"}, "highlight": {"text": {"matched_tokens": ["falling"], "snippet": "a large barn door <mark>falling</mark> on him. McDonald had"}}, "highlights": [{"field": "text", "matched_tokens": ["falling"], "snippet": "a large barn door <mark>falling</mark> on him. McDonald had"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.09, 367.8, 1687.32, 1290.2], "bbox_id": "6fc6331283", "file": "AppomattoxNewspapers_1892-1898a_0441.pdf", "page": 1, "text": "Duluths city funds are praotlcally ex hausted and the city employees will proba bly not be paid for many pay days to come. Diehl A Lords wholesale beer, cider and soda works, Nashville, Tenn, were almost totally destroyed by fire. Fire In the paper mill of Manning A Paine, at Troy, N. Y., damaged the building and maehlnery to the extent of  100  000 . The works of the Le Metzn Umbrella and Bicycle Handle Company, at West Brighton, S. I., burned. Loss, between 950,009 and 975,000. John Barnett, one of the oldest freight conductors on the Belvidere division of the Pennsylvania Railroad, fell nnder a train at Stockton, N. J., and wag ktllid. Henry Wlndell, an eccentric money lender and furniture broker of San Francisco was thrown from his buggy and instantly killed. WindeUJtved all ajone. Articles of incorporation hqve been filed with the Territorial Secretary of Arizona for the construction of a narrow-guage railway from Guthrie, on theArizona and New Mex ico Railway to Moreno, Ariz. A great deal of damage was caused at Middletown, N. Y., by a cloudburst. The rain came down in torrents. Cellers were filled and sewers flooded beyohfi their ca pacity. The loss will be heavy. John P. McDonald, an ex-Sheriff of Mil waukee county, and who at various times held responsible political positions in MU- waukee, whs sentenced to six months at the county term tor vagrancy. Simon Lowenthal, of Syracuse, N. Y., well known liquor agent, aged about 75, silent partner ofOlhibah, Justeln A Co., Cleve land, 0 ., was struck and Instantly killed by a New York Central fast freight at Oneida. A freight elevator in the Nelson Morris packing house, in East SI. Louis, dropped from the third story to the basement with J tour employes. Louis Been, William OBrien and Patrick Glllam were pioked up uncon- scious, the two tonner with broken legs. The CitizensUnion of New York deollned to entertain the request of all anti-Tammany organizations to postpone action on tho mayoralty, ana nominated Seth Low for the mayoralty of greater New York. Nora Miller, of Metropolis, 111., put poison in thb eggs she scrambled for the family, and her father and baby sister succumbed. Benjamin Newton, a student at thé Uni versity of California, was disfigured for life in a cane rush. Now gold fields are reported to have been discovered at Mlohicepoten. Attorney Carlisle submitted to Minister De Lome an opinion of the liability of the United States government on account of fili bustering expeditions. The Treasury Department figures show a remarkable falling off in the immigration daring July. Minister to Spain Woodford advised the department that he had left Paris for San Sebastian.  The safe of the District of Columbia tx collector was robbed of 99,000. Mrs. Croker, ot ceaar Junction, Kans., and her 9-year-old son, were killed by a Santa Fe passenger train, near there. Reports of frost came from a few points in Southern Minnesota and North Dakota. Garden truck was killed or badly damaged, but none of the reports speak of very serious injury to corn, except one from South Minnesota, which represents the damage as being heavy to oorn and late flax. Wheat Is unaffected, being mostly harvested. In Philadelphia the National Assoeiatlon of German-Amerlcan Journalists and Authors held their second and last session of the seventh biennial convention. These officers were elected President, Dr. G. Kellner vice- president, Louis Holler recording secretary Paul Epple financial secretary, E. W. Ditges, and treasurer, William Regenspurger. Ten saloons In Kansas City, Kan., were raided by the police, and 93,000 worth of liquor seized and poured Into thegutters. Saloon furniture and fixtures filling 10 big drays were seized and carted to police head quarters, where they will be burned. Similar aotion will be taken against Some 70 other saloons.  , Anxiety as to the fate of the Yukon River steàmer P. B. Weare, said to be laden with gold, is set at rest by Traffic Manager Charles B Hamilton, of the North American Trans portation Company, stating that he had advices that the Weare was tied up near Circle City, repairing her boiler flues. A Cleveland, Akron and Columbus engine, No. 27, attached to a south-bound freight train oh that road, exploded at Fredericks burg, 0 ., killing the engineer and fireman and badly scalding H,  hrake- man. _"}, "highlight": {"text": {"matched_tokens": ["falling"], "snippet": "figures show a remarkable <mark>falling</mark> off in the immigration"}}, "highlights": [{"field": "text", "matched_tokens": ["falling"], "snippet": "figures show a remarkable <mark>falling</mark> off in the immigration"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1923.88, 284.01, 2087.36, 1679.0], "bbox_id": "6f23d3cb32", "file": "AppomattoxNewspapers_1902-1905a_0567.pdf", "page": 1, "text": "Dr. J. G. Ferneyhough, State Veter inarian, and Dr. W. P. Ellenberger, of Knoxville, Tenn., representing the Bu reau of Animal Industry, have just com pleted an inspection of cattle in Camp bell county, which was made with a view to modifying, if possible, the quar antine against the Texas tick, which prevents cattle from that county from being shipped north of the lames River. More than 500 cattle were examined north of the County Courthouse, and no infection was found, though it was discovered south of the courthouse. The result of the trip will be that a recom mendation will be made that owners north of the courthouse be permitted to ship their cattle to the protected districts after securing a certificate from the vet erinarian that the stock is not infected. This virtually takes about one-third of Campbell county out of the prohibited district and will probably destroy Lynch burg as a market for beef cattle from counties in the quarantine.  Charles Cook, 30 years old, of Nor folk, has a dangerous knife wound in his side and is expected to die. The wound is alleged to have been inflicted by Frank Grubb, 21 years of age, who has not been arrested. J. S. Grubb, the father of the young man, has been ar rested and is held under a bond of 500 for his appearance because he is charged with advising his son to flee. The wound was, it is said, inflicted during a quarrel between the young men, growing out of an old grudge be tween them. Robert Moore and Miss Messick, of Crittenden, a small village about 18 miles from Suffolk, eloped to North Caro lina and were married. Tlie bride is 14 years old and wore short dresses. She left her home in such a hurry that she did not get her hat and was without it for 40 miles which the couple drove. When they returned to Suffolk the husband took his bride to a dry goods store, where a trousseau was purchased. Mr. T. A. Jones, of Norfolk, who was graduated from the Virginia Military Institute in 1898 , has been selected by Gen. Scott Shipp, superintendent, to fill temporarily the vacancy in the faculty oc casioned by the resignation of Col. Rob ert A. Marr, professor of. engineering. Mr. Jones was graduated with honors in his class, and he is now employed as an assistant engineer on the Sea board Railway. The appointment is only for one year, pending the election by the board of visitors next June. Mr. Allan Talbott was appointed Dep uty Collector of Internal Revenue at Richmond, to succeed Robert McCan- dish, removed. Mr. Talbot held a simi lar position under the late Collector Brady, and is appointed upon merit. Miss Minnie Morrison Supinger, daughter of Mr. S. B. Supinger, of Sum- nierd, Rockbridge county, was married to Mr. William Bryon oilman in Elli ott Hill Methodist Church. Rev. Dr. A. G. Buckner, pastor of Falling Springs Presbyterian Church, officiated. Miss Kate Supinger, sister of the bride, was maid of honor and Mr. J. R. Supinger was best man. Rev. T. B. Southall, of McDowell, Va., has accepted the call extended to him by the Lexington Presbyterian congre gation, to succeed Rev. Dr. Thornton Whaling, who resigned to go to Texas. The new pastor will begin his pastorate October 20 . The police of Lynchburg are looking for Frank H. Gibson, who gave Rich mond as his residence and left Lynch burg several days ago, leaving a board bill unpaid for himself and wife. Since Gibson left the city it has transpired that he widely advertised in the large cities of the West an alleged matrimonial bu reau, in which he offered for sale the names of too pretty Southern girls who desired to be married. It is not improb able that the postal authorities will be asked to endeavor to locate the head of the alleged bureau. A warrant was is sued for his arrest some days ago. The dead body of David Williams, colored, a Southern Railroad section hand, was found on the track near Stokesland at an eariy hour the other morning. The legs had been severed from the body. There were two ugly stabs on the right side and a pistol wound on the left shoulder. The theory is that Williams was murdered and placed on the railroad track by his as sailant. So far no arrests have been made. Charles Lowery, charged with beating Rachel Winter, 2 years and 6 months old, was held for trial as to insanity at Norfolk. The pretty little girl, who was brought to court to show the bruises on her face, could not tell her name. Dr. J. G. Riddick testified that he had cured Lowery of the morphine habit, but now he is a cocaine fiend. W. L. Tyler, of Portsmouth, a lamp trimmer employed by the Electric Light Company, was shocked to death and his body was found at the foot of the pole where he fell. The light was burn ing badly, and he climbed the pole to adjust it and touched a live wire in the darkness. He was 26 years of age, and leaves a widow and one child. He was i native of Richmond, but had lived in Portsmouth for several years. Robert Vance, mad with jealousy, dragged his wife from a construction car on the Norfolk and Western Rail way, near Abingdon, where she had taken refuge front rain in a car occu pied by men, and beat her so badly that she is expected to die. He clubbed her again and again until she was covered with blood. Probably she would have been killed except for the railroad hands, who dragged the husband from the helpless woman. Vance was given a hearing and sent on to the grand jury. Judge Scott, of the Circuit Court. Richmond, issued an order changing the name of William Dandridge Alexan der Anderson, son of the Attorney-Gen eral and a lieutenant in the United States Army. Mr. Anderson is per mitted to drop the family name of Dan dridge. The lieutenant desired the change simply as a matter of conveni ence. He is to be married in a few weeks. John Reid, a brakeman on the Norfolk and Western Railroad, fell from a train near Rich Depot and was instantly kill ed. His body was cut in two. Mr. J. Frank Turner has sold the Albert F. Davis farm, near Rippon, W. Va., containing n o acres, which he re cently bought, to Mr. W. O. Crompton for  6 , 000 . An eastbound coal train on the Nor-"}, "highlight": {"text": {"matched_tokens": ["River"], "snippet": "north of the lames <mark>River</mark>. More than 500 cattle"}}, "highlights": [{"field": "text", "matched_tokens": ["River"], "snippet": "north of the lames <mark>River</mark>. More than 500 cattle"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [736.09, 410.57, 893.27, 1211.12], "bbox_id": "3794d73993", "file": "AppomattoxNewspapers_1898-1902a_0501.pdf", "page": 1, "text": "Domestic. In the municipal elections in Havana the Nationalists claim the election of their candidate for mayor and the ma jority of the Council. The Nationalists won also in other places. Mr. Bryan gave out a statement in Lincoln, Neb., in which he attacks the Supreme Court decision in the insular cases, and calls upon the people to re pudiate the verdict. The Chicago grand jury refused to find indictments against Dowie and the other Zionists accused of causing the death of Mrs. Judd and her child. A little son of John Williams, of Richmond, Va., got his head into an ice cream freezer, and it required two plumbers and a doctor to get it out. Five or six hundred soldiers started a riot in the saloon district about the Presidio, near San Francisco, and wreck ed one of the saloons. Floyd Blackburn, the clerk of the Richmond School Board, w10 stole 84 from the school funds, got 60 days on each of two charges. The reformed Presbyterian Synod of America, in session in Pittsburg, Pa., denounced labor unions, as well as secret societies. It is reported that a company has been organized with a capital of 3,000,000. to build a shipbuilding plant at Chester, Pa. William Gallagher and a little child were killed by falling down the shaft of an apartment house in Jersey City. Joseph Harris was arrested at Ann Arbor. Mich., cn the charge of kidnap ping Albert Koskea, aged 14. Two sections of Buffalo Bills train collided at Bellwood, Pa., wrecking six cars. Reports to machinists headquarters in Washington show that many men jn the shops of the Southern Railway in Southern cities are on strike. The gen eral strike of machinists declared in Chicago will, it is claimed, involve over 20.000 men. The Hall of Fame was dedicated at the University of the City of New York, where the tablets to the memory of the 29 American immortals were un veiled. Senator Chauncey Depew de livering the oration. The monument erected at Freder icksburg. Va.. by Gen. Daniel Butter field to the soldiers of the Fifth Army Corps, which he commanded, was dedi cated with interesting exercises. A rowboat containing a pleasure party went over a dam in the Schuyl kill river, near Philadelphia, and five girls and two boys were drowned. Lincoln J. McCarty, aged 68 years, of Lexington. Ky.. died apparently of hydrophobia, having predicted his de.v.h three days before the time. A l monument to the soldiers of the Civil War was unveiled at Battle Creek, Mich., Senator Julius Burrows and General Otis being present. Thomas B. Spellman was acquitted in Winchester, Va., of the charge of setting fire to the Old Dominion Paper Companys plant. The tugboat Acorn, in a fog. struck the coal piers at Kenova, W. Va., and wrecked the entire fleet of eight coal barges. Rev. J. Preston Lewis shot Lewis Hunt, colored, who had found the preachers coat on a fence -and was ex amining it. - Minister Wu, of China, delivered the oration at the ceremonies at Grants tomb in New York. - Blakely Hall, Sr., died at his home in New Brunswick, N. J., from blood poi soning. Sidney Cole was indicted in Parkers burg for the murder of Capt. W. T. Terry. .  The General Assembly of the Unied Presbyterian Church, in session at Des Moines, Iowa, passed a resolution ex- ciuding members of secret societies from church membership."}, "highlight": {"text": {"matched_tokens": ["district"], "snippet": "riot in the saloon <mark>district</mark> about the Presidio, near"}}, "highlights": [{"field": "text", "matched_tokens": ["district"], "snippet": "riot in the saloon <mark>district</mark> about the Presidio, near"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1180.51, 389.48, 1342.46, 845.38], "bbox_id": "a487f2c56c", "file": "AppomattoxNewspapers_1915-1918a_0028.pdf", "page": 1, "text": "Berlin via London.  German forces have made a further advance on ths Russian fortress of Grodno, the only ine of their fortified positions near the German border which still re mains in their possession. Official an nouncement was made here of the cap ture of Lipsk, in northern Russian Poland, about 20 miles to the west of Grodno. The statement follows There are no special incidents to report from the western theater of war. Eastern theater Army group of Field Marshal Von Hindenburg The troops of General Von Bessler are sta tioned in tne region surrounding the bridge head south of Freidrlchstadt In an engagement east of the Nlemen the army of General Von Elchhorn reached a point northeast of Olita- An additional 1,600 prisoners and seven cannon were captured. In the direc tion of Grodno the town of Lipsk, on the Bohr River, was taken by storm and the enemy forced to surrender. The Widra, a tributary of the Sukelka, was crossed by our troops. The east ern border of the forest directly east of Dialystok has been reached at sev eral points. Army group of Prince Leopold In the Bielobiezh forest fighting goes on for possession of tne crossing over the upper Narcw. German and Austro- Hungarian troops under General Von Woyrsch drove the enemy out of his position at Suchodol, on the eastern border of the forest, and at Szereszowo and are now closely pursuing him. Army group of Field Marshal Von Mackensen In order to render pos sible the retreat of their rear-guard divisions through the marsh district, the Russians made a stand once mors on a line in the Koddubno district, south of Kobrin. They were defeated, although they brought back and threw into the battle some divisions which previously had been falling back."}, "highlight": {"text": {"matched_tokens": ["River"], "snippet": "Lipsk, on the Bohr <mark>River</mark>, was taken by storm"}}, "highlights": [{"field": "text", "matched_tokens": ["River"], "snippet": "Lipsk, on the Bohr <mark>River</mark>, was taken by storm"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.08, 500.56, 1772.29, 1674.76], "bbox_id": "a19e584b2d", "file": "AppomattoxNewspapers_1902-1905a_0275.pdf", "page": 1, "text": "B u c k i n g h a m .  Died at her home in Buckingham County in the 52nd, year of her age after a long and suffering illti-ss from the terrible affliction of cancer, Mrs. Jno. A. Burks duaghtcr of William Crews. , Mrs. Burks died a most triumphant death. Just as she was passing over the river she gave utterance to words that leave behind her the blissful assuranc that all was well with her soul. Her last words were open the door the Saviour has come. She was a consistent mem ber of Maple Grove Baptist church. She leaves behind her the husband, four daughters and five sons to mourn the loss of her. Blessed are the dead which die in the Lord. Yea, they do rest from their labor, and verily, their works do follow them. We are sorry to report the contin ued and unimproved lllneSB of Mr, J. B, Gilliam. Tha Drs. however give strong hope ot Mr. Gilliams case.- The speciul microscopist who has examined into and reported on Mr. Gilliams case does not report discourugingly at all. The Road Board meets today under tte new order of things brought about by the special .act concerning the roads of Buckingham. The sole management of the roads of the county now is in the hands of the Board of Supervisors. Each member is supposed to look after the roads of his district. Anything in reason for good roads. Bucking ham needs them as badly as any county and it is a thing that any county can ill afford to do without. Would that our people could be thoroughly aroused on this extreme ly important matter. Mr. Eddie Glover left for his home near Andersonville on Saturday, feeling very much indisposed and as he did not return to his place of business with Mr. A. C. Garnett, Jr. on Monday morning it is feared that he is still ery much indisposed. There are no new developments in the now very important Forbes burning case. Old Mr. Forbes is still very ill with chances for recovery very much against, him. The sym pathy and the -incere admiration of the thinking public of the entire county is with Miss Janie Forbes, the brave, noble and selfsacrificing daughter, who underwent such a terrible ordeal on the night of the burning. After parsing through such a trial of soul and body she on that memorable morning gave utter ance to a suggestion to the old color ed woman who was her only compan ion, save her helpless father, that will live in the memory of the people of the county to the credit of Miss Janie when her body will sleep in the dust Aunt Nancy,the birds are singing let us sing too. Can there be evil in the heart that could give expression to such sentiment as these? nay verily. Misses Lillie and Nannie Gilliam are on a visit to the home of Mr. A. C. Garnett, Jr. We are glad to see Miss Nannie so much improved iu health. Rev. Mr. Sanford preached a very fine sermon on the text she hath done what she could, to a small congregation at the Maysvills Baptist Church last night. He evidently gave the members of his church something to think of. And tbe injunction he gave to his members were equally applicable to members of other churches, who were present. We love to here Bro. Sanford. Mry he preach to us long and often. 1 close this letter while the snow is falling. I hope it is the last one of a severely cold winter. Merited success to the T iues . Q uoit . March 28th. 1904."}, "highlight": {"text": {"matched_tokens": ["river"], "snippet": "was passing over the <mark>river</mark> she gave utterance to"}}, "highlights": [{"field": "text", "matched_tokens": ["river"], "snippet": "was passing over the <mark>river</mark> she gave utterance to"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
