{"document": {"bbox": [1498.33, 1530.36, 1667.4, 1744.19], "bbox_id": "e7f5299d0e", "file": "AppomattoxNewspapers_1939-1943a_0293.pdf", "page": 1, "text": "You can depend on N. R. Feather- ston to supply something of interest about Appdmattox- county. This ISpek he to our office an old flpden-peg shingle, found on the Booker estate near Tower Hill. And when we say old, we n.ean just that. Mr? Featherston estimated that this olwstyle shingle was at least 160 years old. He left the shingle in our care, in case youd like to see it. C. W. Smith, county clerk, re- ttwte many inquires from people who desire to secure birth certifi cates. The demand for birth certi ficates is increasing each year, and epSain classes of jobs and pensions caHftot be secured with out them. ItHpight be noted that the county tin t cannot issue a birth certifi, cate. You should write to the. Bur eau of Vital Statistics, Richmond, Va., for the necessary form."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "n.ean just that. Mr? <mark>Featherston</mark> estimated that this olwstyle"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "n.ean just that. Mr? <mark>Featherston</mark> estimated that this olwstyle"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [298.11, 1022.61, 462.86, 1206.66], "bbox_id": "4d719ad9ef", "file": "AppomattoxNewspapers_1912-1915a_0387.pdf", "page": 1, "text": "Yera. A meeting of the young peoples club was held last Saturday at 830 p. m. A number of charter mem bers were enrolled and the club was given a name. It will be known hereafter as the Stratford Society. They have finished organizing now and are ready to get to work in earnest. Rev. J. G. Lepps spent Sunday with Mr. N. R. Featherston. Mr. John Harvey, who had very bad hand, is improvihg. Mr. J. N. Smith is very ill."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "with Mr. N. R. <mark>Featherston</mark>. Mr. John Harvey, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "with Mr. N. R. <mark>Featherston</mark>. Mr. John Harvey, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "David son, N R. <mark>Featherston</mark>, B. G. An derson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "David son, N R. <mark>Featherston</mark>, B. G. An derson,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1867.43, 681.87, 2035.98, 733.42], "bbox_id": "8dc0adfd0a", "file": "AppomattoxNewspapers_1939-1943a_0414.pdf", "page": 1, "text": "William C. Dudley spent Sunday at Amherst. Miss Patty Featherston, Mrs. J. B. Terry and N . R . Featherston motored to Lynchburg Friday."}, "highlight": {"text": {"matched_tokens": ["Featherston", "Featherston"], "snippet": "William C. Dudley spent Sunday at Amherst. Miss Patty <mark>Featherston</mark>, Mrs. J. B. Terry and N . R . <mark>Featherston</mark> motored to Lynchburg Friday."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "Featherston"], "snippet": "William C. Dudley spent Sunday at Amherst. Miss Patty <mark>Featherston</mark>, Mrs. J. B. Terry and N . R . <mark>Featherston</mark> motored to Lynchburg Friday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1084.32, 378.64, 1258.07, 441.69], "bbox_id": "9f34a31963", "file": "AppomattoxNewspapers_1943-1947a_0245.pdf", "page": 1, "text": "We are saddened to hear of the death today of Mr. S.M. dhornton. 1 Funeral arrangements had not I been made as we go to press. Miss Emily Featherston is visit ing re- itves in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "to press. Miss Emily <mark>Featherston</mark> is visit ing re-"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "to press. Miss Emily <mark>Featherston</mark> is visit ing re-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.33, 605.91, 1934.11, 743.57], "bbox_id": "821f205411", "file": "AppomattoxNewspapers_1943-1947a_0428.pdf", "page": 1, "text": "We are informed by Mr. N. R. Featherston that plans are being formulated to have a bust of the late Thomas S. Bocock placed in the state capital at Richmond. Mr. Bocock was a prominent leader of the Confederacy. Town Te Get New Light"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "by Mr. N. R. <mark>Featherston</mark> that plans are being"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "by Mr. N. R. <mark>Featherston</mark> that plans are being"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.55, 551.19, 1679.02, 1168.88], "bbox_id": "7cabb4600e", "file": "AppomattoxNewspapers_1939-1943a_0515.pdf", "page": 1, "text": "Watt Stanley, of Clifton Forge was home last week-end. Mrs. T. B. Collins spent the week- - nd in Portsmouth. Mrs. C. F. James spent the week end in Richmond. Miss Rachel Harvey, who is em-  loyed by the State Highway De partment at Chatham, has been trans ..erred to Fincastle. Lewis McDearmon spent- yester day in Richmond. Mr. and Mrs. C. M. Harvey and Mrs. H. A. Mitchell spent Friday in the -home of Mrs. H. A. Torrence. Mrs. W. D. Patterson spent Sun day in Lynchburg. Miss Eula Mae Carter, of Lynch- .-org spent the week-end at her home here. Miss Catherine Torrenae spent the week-end in Lynchburg. Mr. and Mrs. H. A. Torrence, liss Annie Torrence, Jim Lucado J, H.  Torrence and Misses Helen  nd Catherine Torrence spent Sun day in the home of Mrs. David Har- _ l s  in Lynchburg. Mrs. Emma Nowlin spent some imerlast week with Mrs. R. W. Morris. Capt. and Mrs. Charles F. James, Jr., of Fortess Monroe, have an nounced the birth of a daughter, Barbara Scott, born at the Medical Hospital of .Virginia, Richmond, on Friday September 11. Mr. and Mrs. F. C. Dresser ac- ompanied their son, Frankie, to V. M. , Lexington, Monday where be matriculated as a cadet. Mrs. James Carson and son, of Lynchburg were visitors in Appo mattox Saturday. Robert Allen Sears, who has been visiting his roommate in New York, hab returned to his home here nd will remain for -a few days be- ore leaving for V. P. I., Blacks burg. Emmett Dinkins, of Portsmouth, and Twyman Conner, of Lynchburg pent Friday night in the home of Mrs. T. U. Conner. Mr. and Mrs. R. B. Hudgins and Miss Patty Featherston spent sever al days this week in Richmond."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Hudgins and Miss Patty <mark>Featherston</mark> spent sever al days"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Hudgins and Miss Patty <mark>Featherston</mark> spent sever al days"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [425.27, 751.21, 581.12, 1517.04], "bbox_id": "3662f2692f", "file": "AppomattoxNewspapers_1922-1923a_0107.pdf", "page": 1, "text": "Watch Appomattox growl Bev. G. A. Cbocklett is on t  visit to friends here. If you have found a pair oi glaeees bring than to thisoffice Ground has been broken foi I Agricultural High Shool audi torium. Mr. and Mrs. Ned Wagers host their infant child Saturday E born dead. Supt. N. R. Featherston hat rented the Light property here lend will move by October let Dr. Ould is building four new business houses on soutbside of town. Hes a live member in I any town. Mrs. Margaret Hancock w  f I a week-end guest at the home I of her father-in-law, 0. W. Boncock. Misses Earle Patteson and Georgia Sheppard spent tht peek end with Mies Anna Jor- Idas, near Cullen, Va. The independent warehous, I of T. W. Moses is being rushec jto completion bnd will be ready for tobacco when the seasoi logins. Contractors are beginning work on the handsome mouse Ileum of the late H. D Flood ii  the courthouse Bquare. Rev, and Mrs. Doverspike, o  Ohio, are visiting her parents, I Ur. and Mrs. Frank Hanenkrat. The duets sung by this coupit  are pronounced to be of a high order of sacred music. Rev. Billy Sunday has I promised to preachat Liberty I church here one morning of uezt w e e k . We expect Icrowded house to hear this Ihmous preacher. A large crowd attended the religious services of Rev. Billy Biuday in Lynchburg from here Friday. He will return I nr call and preach here for us cue morning next week. Our merchants are beginning toahow fall goods and have ether signs of a brisk fall trade I lets made Appomattox a real  trading point for the greatest I lection of the State."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "dead. Supt. N. R. <mark>Featherston</mark> hat rented the Light"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "dead. Supt. N. R. <mark>Featherston</mark> hat rented the Light"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [550.53, 253.69, 709.67, 574.03], "bbox_id": "ff1d23f928", "file": "AppomattoxNewspapers_1926-1933a_0042.pdf", "page": 1, "text": "was never any intimation on my part, or the part of any one else, to Mr- Crawley, or anyone, that I would ask that his salary be increased, until after the fight was over, and no inducement of any kind was offered Mr. Craw ley by anyone to withdraw as an applicant for Superintendent of Schools of Appomattox County. I understand Mr. Featherston resigned as Superintendent of Schools to accept a more lucra tive position in Richmond, and not because of any agreement with or promise to the State Board of Education or yourself to resign. I am writing to ask you to write a letter, addressed to me, which I will with your permission, publish stating whether any agreement was made between the State Board of Education and Mr. Feather ston, or with you or anyone else, that he should resign at the ex piration of one year, and also, if appointment was not for a full four year term without any reservations of any kind, Sincerely yours, J. W. Flood."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "County. I understand Mr. <mark>Featherston</mark> resigned as Superintendent of"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "County. I understand Mr. <mark>Featherston</mark> resigned as Superintendent of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1438.1, 574.46, 1551.31, 759.66], "bbox_id": "3c53c2bbda", "file": "AppomattoxNewspapers_1943-1947a_0333.pdf", "page": 1, "text": "Walker, of White Sul- ,gs W. Va. visited the s here last Friday, en Richmond. featherston motored to irg, Lexington and White prings last weeft. ildred McDearmon, 10 S. C. is spending the rith her parents, Mr. and  McDearmon. Mrs. Havilah Babcock of S, C. will arrive this to spend the holidays at wmattox. hathdeeTi and Louise toivd to Farmville last"}, "highlight": {"text": {"matched_tokens": ["featherston"], "snippet": "last Friday, en Richmond. <mark>featherston</mark> motored to irg, Lexington"}}, "highlights": [{"field": "text", "matched_tokens": ["featherston"], "snippet": "last Friday, en Richmond. <mark>featherston</mark> motored to irg, Lexington"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.07, 729.53, 1951.02, 910.68], "bbox_id": "2778bacd56", "file": "AppomattoxNewspapers_1926-1933a_0107.pdf", "page": 1, "text": "W. T. Marshall, G. O. Thorn hill and E. LeRoy Smiththe Electoral Board met last Friday. Following judges and clerks were appointed to conduct primary election Aug. 2, 1927 C. H. R. F. Jamerson, N. R. Featherston, W. M. Hancock Lewis Doss and Lewis Ferguson, Clerks. Cheat woodJ. O. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, Cawthorn, T. H. Ford. E. W."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "F. Jamerson, N. R. <mark>Featherston</mark>, W. M. Hancock Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "F. Jamerson, N. R. <mark>Featherston</mark>, W. M. Hancock Lewis"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.53, 720.68, 1942.25, 901.13], "bbox_id": "0d6f67f31e", "file": "AppomattoxNewspapers_1908-1909a_0107.pdf", "page": 1, "text": "W. T. Marshall. G. 0. Thorn hill and E. LeRoy Smiththe Electoral B6ard met last Friday. Following judges and clerks were appointed to conduct primary .election Aug. 2,1927 C. H.R. F. Jamerson, N. R. Featherston, W. M. Hancock- Lewis Doss and Lewis Ferguson, Clerks. CheatwoodJ. 0. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, E. W. Cawthorn, T. H. Ford-"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "F. Jamerson, N. R. <mark>Featherston</mark>, W. M. Hancock- Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "F. Jamerson, N. R. <mark>Featherston</mark>, W. M. Hancock- Lewis"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [590.65, 742.57, 747.45, 841.08], "bbox_id": "015f691787", "file": "AppomattoxNewspapers_1918-1922a_0181.pdf", "page": 1, "text": "W Smith, county clerk ................ .. .......... 6C3 CC C W Smith, clerk road board . ............. .. 25 U C W Smith, clerk board supervisors... 80 00 Joel W Flood, com. attorney ................. SCO O H W McKinney, sheriff ................................ 300 00 H vv McKinney, sheriff and jailer.... 14 00 N R Featherston, supt. of schools.... 75 00 W H Ligon, member board super visors 1C meetings ................................... 72 00 g B Anderson same9 meetings .......... 61 80 L E Smith, same9 meetings.................... 54 80 D L Martin, janitor service..................... 12 00"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "14 00 N R <mark>Featherston</mark>, supt. of schools.... 75"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "14 00 N R <mark>Featherston</mark>, supt. of schools.... 75"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [337.46, 376.06, 482.21, 385.56], "bbox_id": "421a57d815", "file": "AppomattoxNewspapers_1947-1949a_0129.pdf", "page": 1, "text": "W ritten by N. R. Featherston"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "W ritten by N. R. <mark>Featherston</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "W ritten by N. R. <mark>Featherston</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.77, 405.0, 1610.81, 463.78], "bbox_id": "b1816f3ef8", "file": "AppomattoxNewspapers_1915-1918a_0258.pdf", "page": 1, "text": "w R Featherston, Supt., V era A. L e Appomattox J. R. Hanpiton, J a re e n - jp. w. Coleman, Pamplaa Tg S n f Pamplin C. E. .Lewis, fcrt- J. P- Alvis, Spout Spring J. Y Davidson, Appomattox F . A. Ibrien,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "w R <mark>Featherston</mark>, Supt., V era A."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "w R <mark>Featherston</mark>, Supt., V era A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [329.74, 211.71, 507.78, 1639.39], "bbox_id": "d71d014c3c", "file": "AppomattoxNewspapers_1912-1915a_0471.pdf", "page": 1, "text": "W B Harrison 8 00 1 Mrs W B H arrison 2 00 W C H arvey 5 00 Mrs J R Atwood 50 00 Mrs Annie Pretlow and S S class l 45 E E Gills 50 R L Burke 96 J T Mann 50 J W Caldwell l 00 W P Gills 5 00 T H Hancock l 00 Russell A bbitt 50 Cleveland Fore 25 Lynolee Atwoods class 75 Len Caldwell 1 00 Berkley W oolridge 1 50 Lloyd Goin 1 00 Mrs Lillie Gregory 5 00 Miss Jacqueline Atwood 1 00 Miss Louise Gills 50 Miss May W alton and class 3 46 C W Hancock 50 00 Miss Ella D rinkard 2 00 Womans M issionary So ciety of Liberty chureh 10 00 W T Davidson 2 00 Miss Odelle Woolridge 25 Mrs W S W oolridge 25 M C Caldwell 2 00 Miss jC V H ardy 1 00 W illis Inge 50 M L Erm an l 00 irs W alker Patterson 25 Mrs C A Hancock 1 00 tfiss Myrtle Inge 1 00 Hiss Maggie Flesbm an 26 R F Jam erson 1 60 tfyrtle Smith 10 Margaret Smith 10 Elizabeth Smith 10 Caroline Smith 10 R F Burke 1 00 Jam ie Gills 60 C A Hancocks class 2 40 Florence Caldwell 26 Mattie 8eiirs 25 Della Inge 10 Mr and Mrs T A W alton 7 00 Mrs M E Walton 1 00 Mrs Sallie Cheatham 2 26 Cash 56 Mrs G A Walton 50 Vay Abbitt 26 Ver nia Oden 26 Eva Woolridge 26 Earl Patterson 06 Lynolee Atwood 1 0 Bessie, Alice and Eleanor Harwood 2  Eloise Atwood 21 Carrie Giles Oi Inge  Morris 3 04 W S Taylor  Son 1 21 S D Sears l 01 W alter W oolridge l 04 M C Smith  fam ily 10 04 Mrs J B A bbitt i 04 Ilene Smith 24 J R  Chas Caldwell 5 0i Ed Dinwiddie 2 0 J W Uurrum 1 0. Miss E M Burke l  S D Cheatham 5 0 L F Ferguson 2 O J R Horsley 2 O Mrs C H Allen l o Miss Lennis Inge l 0 Mrs T H Inge l o De.la Morris 2 Bennie Morris 0 W F Burge 1 0 J T Cawtbon 5 0 E R A bbitt i o C S McDearman 5 0 Ed Harvey i 5 Miss Ida Jones 5 0 Mrs A F D rinkard 3 2 F B Jones 5 0 Mrs E M Ford 1 0 Mrs W T Steele 1 0 W C Nowlin 1 0 R W Nowlin 1 0 Mrs R W Nowlin 1 0 Jas A Webb 1 0 Phil H Gilliam 6 0 Floyd A Gilliam 2 0 H ix Bros 10 0 John H M arshall 2 5 Mrs John H M arshall 1 0 Joel W Coleman 1 0 Wm L Ford 1 u Mr and Mrs H C W heeler 1 5 Elijah F Baldwin 7 Lloyd Coleman 1 0 Mr and Mrs J W Davis 1 5 J R Fore 51 W W Vaughn  Thos H Glenn 51 Robt Biglow 51 Geo R Johnson  Roberts  Anderson 4 O Ragland Featherston 1 01 Mrs W F D rinkard 1 Oi"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Anderson 4 O Ragland <mark>Featherston</mark> 1 01 Mrs W"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Anderson 4 O Ragland <mark>Featherston</mark> 1 01 Mrs W"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [618.93, 309.59, 771.8, 437.45], "bbox_id": "ffa92fb507", "file": "AppomattoxNewspapers_1915-1918a_0384.pdf", "page": 1, "text": "W a lk ers C hurch P r e c in c t E P. Sears, Registrar W .T. Marshall, Asst. R egistrar Old Court House Precinct L E. Morris, R egistrar C. W. Smith, Aset. R egistrar W. I Sm ith, Asst. R egistrar Agee Precinct Jno. W. Davidson, R egistrar N. R. Featherston, Asst. Regis trar"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "R egistrar N. R. <mark>Featherston</mark>, Asst. Regis trar"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "R egistrar N. R. <mark>Featherston</mark>, Asst. Regis trar"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2086.31, 1624.99, 2247.43, 1649.59], "bbox_id": "6d49e236d1", "file": "AppomattoxNewspapers_1933-1936a_0360.pdf", "page": 1, "text": "W . H . Burke and R . R . Featherston returned Monday night from Roan oke."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "W . H . Burke and R . R . <mark>Featherston</mark> returned Monday night from Roan oke."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "W . H . Burke and R . R . <mark>Featherston</mark> returned Monday night from Roan oke."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1576.52, 1396.35, 1753.77, 1453.58], "bbox_id": "ecc4e28cbc", "file": "AppomattoxNewspapers_1943-1947a_0502.pdf", "page": 1, "text": "Visitors in the heme of Mrs. Mor ton Marshall Sunday were Mr. and Mrs. Roberf Sars, Rev. and Mrs. J.  H. Macrae, Harry Gilliam, Ragland Featherston, Wilson Hix and Joe Maxwell."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Macrae, Harry Gilliam, Ragland <mark>Featherston</mark>, Wilson Hix and Joe"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Macrae, Harry Gilliam, Ragland <mark>Featherston</mark>, Wilson Hix and Joe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1772.13, 1674.89, 1942.24, 1799.59], "bbox_id": "b41bf94fff", "file": "AppomattoxNewspapers_1943-1947a_0317.pdf", "page": 1, "text": "visit her son, Virginia Beach Misses Rosa Mae Wooldridge, Dot and Rebecca Johnson and Bet sy Lee Radcliffe and Mr, and Mrs. Calvin H. Robinson will spend Thanksgiving in Richmond, and at tend the Richmond U. and William and Mary football game. Miss Patty Featherston left Sat urday to spend several days with friends in Roanoke."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "football game. Miss Patty <mark>Featherston</mark> left Sat urday to"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "football game. Miss Patty <mark>Featherston</mark> left Sat urday to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [766.55, 1189.72, 935.73, 1379.27], "bbox_id": "f46d7ce5b6", "file": "AppomattoxNewspapers_1939-1943a_0132.pdf", "page": 1, "text": "ville won two out of three games from .he Appomattox ladies-at the local bowling alley Tuesday night. Misses Ruby Martin, Myrtle Will-  lame Mid Edith Martin and Charles T . Mioses J r ., Thomju Wilkerson and Herman .Moore spent peveral days recently at Sttaunton River State Park. Miss Doris Lucado, of Richmond spent last week with her parents, Mr. and Mm. J , H. Lucado. She alsb visited her sister, Edith in Lynch burg for several days. Miss Emily Featherston, of Roan oke, who h a s been visiting her sister. Miss Patty Featherston, left Monday for a trip to Washington and Philadelphia."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "several days. Miss Emily <mark>Featherston</mark>, of Roan oke, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "several days. Miss Emily <mark>Featherston</mark>, of Roan oke, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1617.83, 1028.4, 1779.92, 1458.96], "bbox_id": "48cab7d167", "file": "AppomattoxNewspapers_1905-1912a_0513.pdf", "page": 1, "text": "Vera. Traveling over our roads now we feel like Bro. Jones at the negro meeting. Brother Jones had beed ill with neuritis, rheumatism, fever and etc, finally he was able to go over to church. After the sermon they had an experience meet ing and the preacher said, Brother Jones I am glad to see you here after being away so long, get up and tell what the Lord has done for you. The old man hobbled out into the isle and said Well he has just about ruint me. We feel that the Board of Supervisors with their road machines have just ruint us. Mr. C. E. Grow has been ill with typhoid fever. He much better. Mr. Therms Robertsons little girl is convalescent, she has had pneumonia.  Mr. Collie Becketts boy better, he had pneumonia. Mrs. Lucy Baldwin has been visiting her brother Mr. N. R Featherston, she left for Roan oke Sunday. Mrs. Spradlin bought part of Mr. H. W. Kenneys farm and has moved into the house with Mr. Kennedy for the present."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "brother Mr. N. R <mark>Featherston</mark>, she left for Roan"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "brother Mr. N. R <mark>Featherston</mark>, she left for Roan"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [469.86, 1075.56, 640.29, 1417.75], "bbox_id": "f3801e6e1b", "file": "AppomattoxNewspapers_1943-1947a_0089.pdf", "page": 1, "text": ".Vatson, of Baltimore is spending this week here with the Langrans. M s T. M. Trent entertained at fou, tables of bridge on Tuesday vening. lop score prizes were pre-  mod Mrs. C. G. OBrien and Irs. Elizabeth Ford. Mis Majorie Gooden and Miss Mary Ccnson spent the week-.nd in Lynchburg. , Mrs. Carrington Price spent the . Vk-end in Brookneal. Mrs. Edd Green and children ar- . ived today to make their home in A pomattox. II. O. Blackard is improving from . recent illness. Mrs. R. E. Baldwin, of Rich- nnd is spending this week with or sister, Miss Emily Featherston. Mrs J. H. Wilson, who is recov- ring from an attack of flu, was visited Sunday by her mother, Mrs. Zada Haas and her sister, Miss Eli zabeth Finns, of Lynchburg. L. E. Morris, of Norfolk, will arrive this week-end to spend sev eral days. Miss Lucille Moon spent the week-end r.t her home at Spout Spring."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "or sister, Miss Emily <mark>Featherston</mark>. Mrs J. H. Wilson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "or sister, Miss Emily <mark>Featherston</mark>. Mrs J. H. Wilson,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1444.3, 597.06, 1589.3, 647.16], "bbox_id": "d15ffa8ba7", "file": "AppomattoxNewspapers_1915-1918a_0206.pdf", "page": 1, "text": "V R. Featherston, Supt., Vera A. T iiure Appomattox J. R. Hamilton,  p W Coleman, Pamplto, f eTP , P a n Ä C. E. .Lewis, Vera JP -A lvis, Spout Spnng J. 0 Davidson, Apnomattox"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "V R. <mark>Featherston</mark>, Supt., Vera A. T"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "V R. <mark>Featherston</mark>, Supt., Vera A. T"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.53, 308.52, 1901.5, 1078.85], "bbox_id": "aa998edfda", "file": "AppomattoxNewspapers_1939-1943a_0235.pdf", "page": 1, "text": "v lie spent the week end with her parents, Mr.and Mrs.C.C.Cralle. Mesdames G. F. Langran, C.G. OBrien and R. W. Stanley spent Wednesday in Richmond. Miss Ruth Gratz, of Atlantic City, is visiting her brother, Dr. M. Morton Gratz. Mr. and. Mrs. Edward Ransome have moved into the -Walton home on South Church Street. Frank Hanenkrat will drive to Radford Sunday, where he has ac- cepted a position. Friends are glad to hear tha Mrs. Florence Bingham is out after x recent illness. Otis Inge, of Lynchburg spent the weak end in the home of Mrs.F. T. Cawthorn. Mutt Cawthorn, of Petersburg returned today after spending sev eral days with his mother here. Marshall Babcock left yesterday for a years military service at For tress Monroe. W .T. Steele J r., of Richmond, p.nt Friday night in the home oi Mrs. James B. Abbitt. The U. D C will meet Thursday af.ernoon, February 20, with Mrs. H . B . Caldwell. Mr, and Mrs.David Caldwell left vVednesday for a weeks tr.p to W. Virginia. Mrs. J. R. Lawson and Mrs.S. L Ferguson spent Tuesday with Mrs. N. A Wagers in Lynchburg The Thursday afternoon bridge club meets today with Mrs. J . W. Flood. Harry Gordon Lawson will be tak en .o Memorial hospital, Lynchburg Saturday for treatment. Mrs. E . LeRoy Smith and daugh ter, Alice Lee, spent. Sunday ana Monday in Washington. I.he Appomattox high school base Bail team will begin practice on oi around March 1. Percy Car.er has returned to Ao- poma-tox and plans to operate a meat market in Babcocks Store. Local 4-H Club leaders plan to att-nd a club conference Monday in Lynchburg. Miss Mary Featherston, M.ss Em ily Featherston and N.R.Feather ston spent Sunday in Roanoke. Mr. and Mrs. Otho Godsey ana son, of Portsmouth, spent the week end with relatives here. Our former correspondent, W, A Swan, of Hixburg, was a visitor in The Rev. and Mrs. H Frederick the Times Virginian office luesday Jones visited her brother, Dr. W. M. Winn, in Clarksville last week. We are glad to report that J.W . Cawthorn is improving after a re cent illness."}, "highlight": {"text": {"matched_tokens": ["Featherston", "Featherston"], "snippet": "in Lynchburg. Miss Mary <mark>Featherston</mark>, M.ss Em ily <mark>Featherston</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "Featherston"], "snippet": "in Lynchburg. Miss Mary <mark>Featherston</mark>, M.ss Em ily <mark>Featherston</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.38, 1030.91, 1778.44, 1507.41], "bbox_id": "37e55dc270", "file": "AppomattoxNewspapers_1905-1912a_0512.pdf", "page": 1, "text": "V e r a . Traveling over our roads now we feel like Bro. Jones at the negro meeting. Brother Jones had beed ill with neuritis, rheumatism, fever and etc, finally he was able to go over to church. After the sermon they had an experience meet ing and the preacher said, Brother Jones I am glad to see you here after being away so long, get up and tell what the Lord has done for you. The old man hobbled out into the isle and said  Well he has just about ruint me. We feel that the Board of Supervisors with their road machines have just, ruint us. Mr. C. E. Grow has been ill with typhoid fever. He is much better. Mr. Therms Robertsons little girl is convalescent, she has had pneumonia. Mr. Collie Hffcketts boy is better, he had pneumonia. Mrs. Lucy Baldwin has been visiting her brother Mr. N. R. Featherston, she left for Roan oke Sunday. Mrs. Spradlin bought part of Mr. H. W. Kenneys farm and has moved into the house with Mr. Kennedy for the present. Miss Laura Tweedy has finished her school term at Airy Hill School, her school closed last week."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "brother Mr. N. R. <mark>Featherston</mark>, she left for Roan"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "brother Mr. N. R. <mark>Featherston</mark>, she left for Roan"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [981.16, 183.56, 1293.34, 193.06], "bbox_id": "5a476d3103", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "u w w Mr. N. R. Featherston, I ing flame of brotherly love, work"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "u w w Mr. N. R. <mark>Featherston</mark>, I ing flame of brotherly love, work"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "u w w Mr. N. R. <mark>Featherston</mark>, I ing flame of brotherly love, work"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1480.27, 387.71, 1627.03, 446.11], "bbox_id": "23f4f89a6a", "file": "AppomattoxNewspapers_1915-1918a_0280.pdf", "page": 1, "text": "u o Featherston, Supt., V era A. T luge, Appomattox J . R. H am utoa, FvMgmen P. W. Coleman, Pam pim  t T Ligón, Pam pim  C. E . Lewis, veIi  J. P. Alvis, Spout Spring J. 0 Davidson, A ppom attox It. A. o brien,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "u o <mark>Featherston</mark>, Supt., V era A."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "u o <mark>Featherston</mark>, Supt., V era A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2046.26, 780.92, 2218.21, 1521.3], "bbox_id": "1d28b3ae1d", "file": "AppomattoxNewspapers_1898-1902a_0709.pdf", "page": 1, "text": "Tower Hill. There have been so many nice, complimentary things said about the T imes sinoe it became an eight- page paper, that I have begun to think you will have to ohange cor respondents, so as to have things to match the paper. But I was only jesting. I think I know the A. aud B. Editor too well to believe that he would forsake old friends for new ones. We are quite satisfied with our present correspondents, end only wish that we had more like them. We are having lovely weather at present. Oar farmers are now done seediug wheat, and are gathering corn. The yield is somewhat .better ban was ones expected. Several have sold tobacco this fall, and have received satisfactory prices. Mr. L. M. Wright, of this place, and Mr. Barton, of Bedfordi have located at Rosebower for the pur pose of selling goods. Miss Alpha Featherston, who has charge of the Tower-Hill school, ia I making a good average and progress ing nicely, notwithstanding there arc several private schools within strik ing distance of this school. r. and Mrs. T. S. Beal spent the j last Saturday and Sunday of October with bis sister, Mrs. Jim Whitakei, who lives near Spout Spring. Mr. J. W. Dixon and his sister, Mies Ida, took their little niece Flor ence to visit her parents, Mr. and Mr. W. A. Dixon, and her grand mother, Mrs. Sallie Pankey, who live near Pamplin City, on the fourth Saturday, and returned on Monday. Mrs. T. R. Turner, of Lynchburg, returned on Friday last to her home  after a visit to friends and relatives in Appomattox.  Mr. W. P. Wells and sisters were visiting friends in Buckingham on Saturday and Sunday last  A oolored boyBernard Jones employed by Mr. Thomas Robertson,  was kicked in the face by a mule on Thursday last His jawbone was broken, and he was otherwise pain fully injured. Dr. Thornhill is at tending him.  Messrs. J. W. Dixon and Thomas Robertson expect to visit relatives Ad friends near Oak Ridge and Eimiugton, Nelson county, on Sat urday and Sunday next"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "selling goods. Miss Alpha <mark>Featherston</mark>, who has charge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "selling goods. Miss Alpha <mark>Featherston</mark>, who has charge of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [610.87, 1100.84, 770.39, 1588.64], "bbox_id": "69fd19ac47", "file": "AppomattoxNewspapers_1898-1902a_0068.pdf", "page": 1, "text": "Tower Hill. Mrs. S. E. Wells is visiting friends and relatives iu Lynchburg this week. She is accompanied by her daughter Miss Addie. Dr. R. A. North from Oakville, was in our vicinity today visiting his patients. Among whom is Miss Mildred Wright, we are sorry to say she is still confined to her room. The little ones went on their way to school rejoicing. They are highly pleased in getting their same teacher Miss Alfra Featherston back again, the school was largely attended to day     Miss Fannie Dixon expects to visit her Lynchburg friends soon. We are truly sorry to note the burning of Mr. John Harriss to bacco barn and stable. The barn was filled with fine tobacco he also lost some feed chat was in the stable. He has oar sympathy. Report says that our brave Capt. Pushfence speaks of building near Tower Hill. We give him a hearty welcome in our vicinity. Mr,, aud Mrs. Anderson Gilbert are the guests of their daughter, Mrs. John Rush this week. Miss Lou Robertson who spent several months a Tower Hill with Mrs. T. P. Robertson has returned to her home in Lynchburg. Madam rumor says there will be several marriages iu our community this fall. Farewell to the many readers of your interesting paper.  V e s t a ."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "same teacher Miss Alfra <mark>Featherston</mark> back again, the school"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "same teacher Miss Alfra <mark>Featherston</mark> back again, the school"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1059.12, 613.25, 2146.46, 727.9], "bbox_id": "15bc4f1d7d", "file": "AppomattoxNewspapers_1908-1909a_0373.pdf", "page": 1, "text": "Tomato Planta For Sale and were represented by Mes- home in N. C The pastor will be At reduced pricesPonde- church new Lynchburg rs. Alfred Harwood and Eston Harvey, while the seniors de-1 bated the negative and were .represented by Misses Dora Abbitt and Virginia Puckett. Miss Virginia Lee Thompson gave a reading and Miss Mary Featherston gave"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "reading and Miss Mary <mark>Featherston</mark> gave"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "reading and Miss Mary <mark>Featherston</mark> gave"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [857.73, 381.99, 1789.96, 583.04], "bbox_id": "3487475ce2", "file": "AppomattoxNewspapers_1939-1943a_0395.pdf", "page": 1, "text": "to his assistance. burg Rufus Burnette and son, Mrs. Bennie Wheeler, Mrs. Florence Car- son, Mrs. Max Wheeler, Branch Cole man, and son, Floyd, Mr. and Mrs. Clarence Moore, Ilene, Dot a n d Chandler Moore, Cottelle and Lu cille Phelps, Royal Coleman, and son, Harwood, Miss Cleo Reynolds, Mrs. Irene Rogers and son, Terry, Roland Smith Jr., N. R. Featherston, Mrs. R E. Smith, all of Appomat tox Mrs. Tndia Scott, of Richmond. Those who ca.ne from Richmond Sunday to see him were Mrs. Pearl Coleman, Mrs. Florence Clement, and son, Charles, Mr. and Mrs. Har ry Blanks, and Mrs. Dutr, of Lyhch- burg. The latter also visited Mr. and Mrs. T. E Owen the same day. Mrs. India Scott spent several days last week with her father,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Smith Jr., N. R. <mark>Featherston</mark>, Mrs. R E. Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Smith Jr., N. R. <mark>Featherston</mark>, Mrs. R E. Smith,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.19, 896.85, 1765.48, 1173.7], "bbox_id": "b84a796194", "file": "AppomattoxNewspapers_1962-1965a_0312.pdf", "page": 1, "text": "tne torces ana easily out - num bered them and have continued to do so until the present time. It is not surprising that the first public school in the countv should have been at the Old Courthouse and probably withir sight of what had once been Clov er Hill Academy. Mr. James Henry Featherston taught the first public school in the countv there in a log cabin in 1870. Thus we seethat Appomattox be gan her public school system that same year it was adopted by the Virginia Legislature. What he taught, how many pu pils he had or how long the term is not known. But it was a be ginning! A beginning of a new way of life, when every child regardless of status or station in life had an equal opportunity to get an education if he were willing to make sufficient sacri fice and effort. Locating buildings where school might be held was another prob lem that confronted the board,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Academy. Mr. James Henry <mark>Featherston</mark> taught the first public"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Academy. Mr. James Henry <mark>Featherston</mark> taught the first public"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.21, 387.41, 1790.75, 542.36], "bbox_id": "8136531b35", "file": "AppomattoxNewspapers_1905-1912a_0293.pdf", "page": 1, "text": "tives here. Mr. Ragland Featherston, of 0 tkville, waB the guest of Mr. C. S. McDearmon last week.  Mrs. Norman Dawson, of Lynch-  burg, visited friendi here last week. The Ladies Aid Society of the I Presbyterian Chuich will meet at I the home of Miss Annie Ragland on Wednesday afternoon of this week. Mrs. S. M. Thornton and Misses Frances and Mildred McDearmon! are on the siok list."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "tives here. Mr. Ragland <mark>Featherston</mark>, of 0 tkville, waB"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "tives here. Mr. Ragland <mark>Featherston</mark>, of 0 tkville, waB"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2139.34, 458.86, 2459.91, 714.94], "bbox_id": "f4ca2aad07", "file": "AppomattoxNewspapers_1908-1909a_0509.pdf", "page": 1, "text": "tiThe sixty-fifth . anniversary of . the Appomattox Court House Presbyterian church will be dbsetved w i t h fitting ser vices here Sunday. Trie pastor, the Rev. R. E. Redding, will use for his subject at the morning services the same subject used by the late Dr. Petrie at tife dedication of the present church building 31, years ago, Let jerusalem come into your mind. Some of thè first members of the churdv iowner members, who have moved away, friends and visitors from other church es and thegeneral public will Johns, AlfredAgee, John Will attend the service Sunday, i Gilliam and James Calhoun, el- Present elders of the church ders James Featherston and are  B. G. Anderson, C, S. Me Major J. ,W. Flood, deacons- Dearmon and JerryA.Burke The church was burned in Deacons are, S. J. Evans and 1892.   i fHarvey Caldtorell."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "the church ders James <mark>Featherston</mark> and are  B. G."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "the church ders James <mark>Featherston</mark> and are  B. G."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1385.09, 1461.07, 1544.28, 1686.72], "bbox_id": "ba6bcc0727", "file": "AppomattoxNewspapers_1908-1909a_0364.pdf", "page": 1, "text": "tire project md also totak- steps to interest persons o national importance wh might be inclined to assist ii development of the park as t philanthropic project simila. to that undertaken by John D. Rockefeller, Jr., at Williams burg. The hearty co-operation of the land owners and Appomat tox organizations and people generally will be necessary in order to get the ears of .Con gress in this program. Ap pomattox is grateful to Mr. Featherston and his club for interest and worlj manifested."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "is grateful to Mr. <mark>Featherston</mark> and his club for"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "is grateful to Mr. <mark>Featherston</mark> and his club for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1952.16, 503.39, 2123.49, 709.49], "bbox_id": "786538b44d", "file": "AppomattoxNewspapers_1943-1947a_0417.pdf", "page": 1, "text": "Those from this community who attended Mrs. Harry Gilliams fu neral in Lynchbuig Monday A. M. were Mr. and Mrs. Rercy Sears, airs. Morton Marshall, Mrs. E. W. Gilliam and Lester Seirs. Herbert Gilliam and Mr. and Mrs. L. K. Griffith, of Statesville, N. C., were with Mr, Sears and Mrs. H. M- Marshall over the week-end and attended Mrs. Hairy Gilliams funeral in Lynchburg. N. R. Featherston, Mr. and Mrs. J. B. Terry visited in the home of Mrs. H. M. Marshall on Sunday afternoon. John Wilson Hix has received his call from the local draft board and will leave for an induction center Monday, May 20."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "in Lynchburg. N. R. <mark>Featherston</mark>, Mr. and Mrs. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "in Lynchburg. N. R. <mark>Featherston</mark>, Mr. and Mrs. J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1426.8, 1623.55, 1746.16, 1769.0], "bbox_id": "a6dd5c30e7", "file": "AppomattoxNewspapers_1926-1933a_0289.pdf", "page": 1, "text": "This life-long citizen of the county died lit his home near here Monday after a short ill- J ness in .the 7 0th year of his ________ I age. Deceased is survived by MiaetSiandane Anderson an only son, Grove of Prince- Featherston, spent ton, W. Va. Remains interred   H ffin d in Farmville as in Liberty Cemetery yesterday te g  K f Miss Ruth Patter- morning, conducted by Rev. B  K a t e Teachers Col- G. D. Coffey, assisted by Rev. ge- W. M. Thompson."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "son, Grove of Prince- <mark>Featherston</mark>, spent ton, W. Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "son, Grove of Prince- <mark>Featherston</mark>, spent ton, W. Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.12, 470.2, 1868.27, 805.14], "bbox_id": "ab3c588f53", "file": "AppomattoxNewspapers_1952-1954a_0058.pdf", "page": 1, "text": "These people were Leslie Ligon an active church worker was on the program and he made a .good speech Mr. Witt Coleman, a former HiX burger, looked hale and happy Mrs Ernest Carson, a person of unique qualities, a wise giver of counsel and even when she herself was sick one could take his troubles to hei and leave her presence feeling like a different person Mrs. William Jones, who was not able to go into the church, chatted genially with many who came to her- car Mr. Alfred Harwood, a worker in Liber ty Baptist Church, seemed well and with no thought of departing this earthly home in the near future Mr. William Swan, the ever ready, helpful, generous neighbor his sis ter, Mrs. Ouida Topping, a diligent, liberal church worker Mrs. Myrtle Sears, a Sunday School teacher, and a splendid mother Mr. Rayland Featherston, the friend to all re gardless-of race or creed Mr. Her man Sears, a former Hixburger. whose brilliant smile and upright character endeared him to all who knew him Mrs. Joel Coleman, e faithful mother and Marshall, who had been a sufferer for many months, sat out in his car and enjoyed social communion with his many friends."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "splendid mother Mr. Rayland <mark>Featherston</mark>, the friend to all"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "splendid mother Mr. Rayland <mark>Featherston</mark>, the friend to all"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1210.95, 520.6, 1366.3, 1212.4], "bbox_id": "c3014b37d6", "file": "AppomattoxNewspapers_1918-1922a_0402.pdf", "page": 1, "text": "The State Board of Education an nounced the election of sixty-four di vision school superintendentsthese having no opposition. Elections were made for all the cities except Alex andria, Danville and Newport News. There is a single applicant for Dan ville, and the -passing of the city is a surprise. C. E. Crossland, president of Averett College, is understood to be the choice ot certain persons. Dr. Crossland and the trustees of his col lege are said to bare suffered a mis understanding over the question of dancing, and it is reported that he may resign. His friends are now urg ing that he be made superintendent of schools. Following aro the elections as an nounced Accomac, G. C. Joynes, Onancook Albemarle, A. L. Bennett, Charlottes ville Arlington, Fletcher Kemp, Rosslyn Alleghany, J. G. Jeter, Cov ington Amelia, W. R. Wrlggles- worth, Blackstone Amherst, W. L. Tucker, Amherst Appomattox, N. R. Featherston, Pamplin Augusta, F. M. Somerville, Staunton, R. F. D. 6 . Bedford, C. M. Abbot, Bellevue Botetourt, E. A. Fainter, Fincastle Brunswick, W. B. Balen tino, Raw lings Buchanan, M. L. Combs, Grundy. Charles City, Herman L. Harris, Toano Charlotte, E. H. Hall, Drakes Branch Clarke, L. D. Kline, Win chester. Dinwiddle, O. B. Zehmer, Dinwid dle. Elizabeth City, J. H. Brent, Hamp ton Essex, W. G. Rennolds, Center Cross. Fauquier, F. Osgood Smith, Wart renton Franklin, R. A. Prlllamn, Rocky Mount. Giles, R. H. Farrier, Newport Grayson, Lyle T. Cox, Independence. Halifax, H. J. Watkins, South Bos ton Hanover, J. Walton Hall, Ash land Henrico, A. C. Cooper, Rich mond, Henrico Courthouse Henry, W. B. Gates, Martinsville Highland, R. E. Mauzy, Hlghitown Isle of Wight, Gavin Rawls, Carrsville. Lancaster, Frank W. Lewis, Morat- tico Loudoun, O. L. Emerick, Pur- cellville. Mecklenburg, C. B. Green, Boyd ton. Nelson, W. E. Kidd, Lovingston Norfolk, James Hurst, Norfolk. Prince Edward, T. J. Mcllwaine, Hampden-Sidney Prince William, Woodstock -Smyth, B. E. Copenhaver, Pulaski, E. L. Darst, Dublin. Rappahannock, H. D. Hite, Front Royal Roanoke, R. E. Cook, Salem Rockbridge, R. M. Irby, Lexington Rockingham, John C. Myers, Harri sonburg Russell, R. N. Anderson, Le banon. Shenandoah, C. V. Shoemaker, Woodstock Smyth, B. E. Copenhaver, Marion Southampton, R. M. Newton,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Amherst Appomattox, N. R. <mark>Featherston</mark>, Pamplin Augusta, F. M."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Amherst Appomattox, N. R. <mark>Featherston</mark>, Pamplin Augusta, F. M."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2062.79, 1180.88, 2230.97, 1271.98], "bbox_id": "89fdabd5a0", "file": "AppomattoxNewspapers_1936-1939a_0030.pdf", "page": 1, "text": "The Sepetember meeting of the Robert Edward Lee Chapter, U.D. C. was held on Tuesday night at the home of Mrs. W . P . Gills, with five visitors and a large percentage of members present. Misses Cornel ia Gills and Mary Featherston were elected delegates to the state con vention to be held in Richmond in October,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "ia Gills and Mary <mark>Featherston</mark> were elected delegates to"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "ia Gills and Mary <mark>Featherston</mark> were elected delegates to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2061.83, 329.75, 2402.83, 636.19], "bbox_id": "0c0fab8f22", "file": "AppomattoxNewspapers_1954-1955a_0108.pdf", "page": 1, "text": "the Roanoke show. All had previous-1 PEST CONTROL ly won first place in local communl-! Pest control operators from four ty contests held in conjunction with states and the District of Columbia the Southern States membership have been invited to attend a pest meetings.  control operators short course of The soprano soloist, Mrs. Mary  VPI, November 10, 11 and 12. Vir- Jane Ransone, Cartersville won first ginia, Maryland, Tennessee, and prize in the contest. The second place winning group from Chase City was a duet composed of two sisters Misses Charlotte and Ed win a Little. Third prize and 25 in cash was won by a vocal trio from Gretna which included Miss Betty Lee Hamlett as leader, Miss Martha Blair and Miss Jane Mayhew. Winning honorable mention were the following acts Glen Ayers, guitar player and soloist, of Oneida, Va. a vocal quar tet including Miss Patsy Featherston leader, Miss Susan Rayten, Miss Ann Sadler, all of Kenbridge, and Miss Joan Taylor, of Dundas, Va. the nite Owls Jazz band, with Phil Francke as leader, of Cumber land Tommy Knight, of Farmville George Altmiller, Guinea Mills and Jimmy Bradshaw, of Rice, Va. and a singing trio composed of Mrs of Madison"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "tet including Miss Patsy <mark>Featherston</mark> leader, Miss Susan Rayten,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "tet including Miss Patsy <mark>Featherston</mark> leader, Miss Susan Rayten,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1350.97, 451.72, 1834.21, 503.47], "bbox_id": "01146004bc", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "The Rev. J. Howard Macrae and  Wiley Godsey spent several  , , last week at Volens, with her I N. R. Featherston spent Monday in You are a stranger here but once. r. jjrs g. E. West. 1030 A. M. Morning Worship. Sermon  Cries of Distress."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "her I N. R. <mark>Featherston</mark> spent Monday in You"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "her I N. R. <mark>Featherston</mark> spent Monday in You"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1958.14, 1099.66, 2139.95, 1402.69], "bbox_id": "f917d757c5", "file": "TimesVirginian_1983a_0409.pdf", "page": 1, "text": "The Research and Publication Committee of the Appomattox Count Historical Society continues to a help in obtaining genealogical infor tion of present and past residents. Response has been good to our earlier requests for information on area families and we feel sure there are others who would like to share in our efforts to update the N.R. Featherston book on the history of Appomattox, said Betty Drinkard, spokesman for the committee. There are a number of corrections that need to be made, information on families listed needs updating and other families need to be included in the material for the forthcoming book. It is our hope that the new book will aid individuals who have ancestors from this county who are seeking information on their families, said Drinkard. We have had a number of black families who have inquired as to whether or not they would be included in this county history. Yes, you are a part of our county and some of your families have contributed much to the"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "to update the N.R. <mark>Featherston</mark> book on the history"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "to update the N.R. <mark>Featherston</mark> book on the history"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [357.12, 205.45, 516.82, 423.82], "bbox_id": "807b57bff7", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "The Republican rtanagerle. When in playful wit, but biting 68 rearm, Yankee Allen said, the epublican State ticket had a mon key at its head, a lion at its tail, and lamb at its back, he forgot what a fascination each has for the darkey. Add to it an ogan grinder from Campbell and a fakir from Appomat tox,and they haveacombination show that will draw every negro voter from piney bills, and broom-sedge fields on thejday of election. Then let every white man rally aronnd the ild democratic flag, to the music of ixie, march to the poll, and vote, ud work for Featherston and Lig- n.Campbell Enterprise. There is little danger of the fakirs lection if the Democrats of Appo mattox will do their full duty."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "vote, ud work for <mark>Featherston</mark> and Lig- n.Campbell Enterprise."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "vote, ud work for <mark>Featherston</mark> and Lig- n.Campbell Enterprise."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1878.71, 1209.41, 2055.21, 1487.45], "bbox_id": "07cf58d1ad", "file": "AppomattoxNewspapers_1936-1939a_0013.pdf", "page": 1, "text": "The regular meeting of the Young People s Circle of toe Appomattox Presbyterian Church Auxiliary was held at the home of Mrs. Garnett Dean on Wednesday, August 16. .? Callie Cates, cifcle chairman, presided and had charge of the devotional. A most interesting pro gram was led by Mrs W E. ifan- c2cf the topic being What I Like of the Adults of My Church. Help ful selections 0 j this topic were read by several members. The regular circle meeting date was changed from Tuesday even ing after the second Sunday to Wed nesday evening after the second Sunday of each month. The next meeting will be held Wednesday evening, September 13th, at 800 at the home of Miss Mary Featherston. Mrs. Garnet Dean will lead the de votional and Mrs., Joel W. Flood will have charge of ITie program. Each member is urged to be pre sent. The meeting was closed with the Mizpah Benediction. Delicious refreshments were ser ved by the hostess. Mary Featherston, reporter."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "home of Miss Mary <mark>Featherston</mark>. Mrs. Garnet Dean will"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "home of Miss Mary <mark>Featherston</mark>. Mrs. Garnet Dean will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1908.63, 1145.05, 2087.25, 1211.5], "bbox_id": "b3e3f1292c", "file": "AppomattoxNewspapers_1943-1947a_0486.pdf", "page": 1, "text": "The Presbyterian Synod of Vir ginia convened at Hampden- Syd-1 ney last week. Those attending I from here were the Rev. and Mrs.  J. Howard Macrae, Mrs. S. M. Thornton, N. R. Featherston and ! S. G. Anderson."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "M. Thornton, N. R. <mark>Featherston</mark> and ! S. G. Anderson."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "M. Thornton, N. R. <mark>Featherston</mark> and ! S. G. Anderson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.26, 1643.29, 1785.13, 1804.49], "bbox_id": "86a6c9de77", "file": "AppomattoxNewspapers_1947-1949a_0358.pdf", "page": 1, "text": "The neighborhood was saddened by the sudden death of N. Ragland Featherston. He will be missed, es pecially in our Hixburg Presybyter- ian Church. Also as a friend and neighbor. Mrs, Jim Carson spent Friday with .er parents, Mr. and Mrs. W. S. Bryant, at Cullen.. Dr! W. Twyman Williams preach ed a fine sermon at t.e Hixburg C.-arc, Sunday night. He will be  back with us the first Sun. night. He expects to move his furniture J into the new manse at Appomattox this week."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "death of N. Ragland <mark>Featherston</mark>. He will be missed,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "death of N. Ragland <mark>Featherston</mark>. He will be missed,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1404.76, 1005.87, 1570.46, 1554.21], "bbox_id": "cac4c8c2dc", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "The local high school has many priorities. It was one of the first group of ten agricultural schools in Virginia, one for each congressional district. It claims to be the first to have a separate home economics cot tage. Dt was one of the very first to haul pupils, and it was one of the first to use what is now the 4-H club idea. Prior to professor Crawley, Mr. McDonald was principal here. Ear lier Mr John Fisher held forth for a number of years. Mr. Crawley had taught at Frederick Jollege, Mary land and also taught at Martins ville. There were six teachers at the local school in 1909. They got about the same salnries the teachers re ceive now, anw the local school al ways had a full nine-month term. The dormitory began its service in 1914. It cost 11,000. Pupils were boarded in a number of residences around town, and came here from nearby counties. Profes sor Crawley was the agriculture teacher for several years, as well as principal. Mrs. May Walton Green taught home economics. How many recall Miss Alene Houser? Stables were located near where the present home economics is lo cated. Professor Crawley says he helped get up the stumps where the present playground is! The auditorium went up in 1922. Mr. Featherston was superintendent then. We neglected to state that pro fessor Crawley also taught in Geor gia before coming here. The school board once leased him for a resi dence a dwelling next to the present Lee Theatre. Then, he lived in the dormitory five years. He has had many tempting offers to leave Appo mattox, but local folks wouldnt let him go. He says he knows of only one other principal who has matched his service tenure, that one being at Lexington. _We hope he is good for another thirty years! The local school has alumni in 26 states,.. but thats another story and welll try to get it written ere long. In the meantime, there is the news flash of the kilting of the premier of Rumania!"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "up in 1922. Mr. <mark>Featherston</mark> was superintendent then. We"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "up in 1922. Mr. <mark>Featherston</mark> was superintendent then. We"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [709.19, 332.9, 850.39, 698.58], "bbox_id": "68245ca60d", "file": "AppomattoxNewspapers_1974-1975a_0303.pdf", "page": 1, "text": "The last history of Appomat tox County was written in 1965 by Vera Smith Stanley. Prior to that, Nathaniel R. Featherston wrote a hardbound edition in 1948. Material for the book was gathered mostly from shirt cuff notes collected from Mr. Featherstons personal visits with many county residents. Our county has changed a great deal since 1948 and 1965, and the nations Bicentennial era offers an unprecedented op portunity to examine our past and present, while looking toward the future. The Appomattox County Bicentennial Commission is pursuing the idea of publishing, with photos, the family history of all families residing in Appomattox County as of July 4, 1975. Histories will be written by individual families, and photographs, old and new, can be included. Final editing and typing will be handled by Bicentennial volunteers. The hardbound book will sell for about 15 per copy, with advance ordering available. Who can be included in the county history? Any family, from the native resident to"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "to that, Nathaniel R. <mark>Featherston</mark> wrote a hardbound edition"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "to that, Nathaniel R. <mark>Featherston</mark> wrote a hardbound edition"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.39, 1109.63, 1681.7, 1423.77], "bbox_id": "3194ed52dd", "file": "AppomattoxNewspapers_1943-1947a_0145.pdf", "page": 1, "text": "The January meeting of the Ap- pomattox Chapter U. D. C., wich Miss M. Anna Jones as hostess, was well attended. Mrs. L. Crawley ser ved her first time as ti-easurer, suc cessor to Mrs. L, J. Morris, resign ed.  There was a splendid business session and several visitors and honorary members were present. . Mrs. L. Crawley gave an interest- paper on Matthew Fontaine Siflpiry and Mr. N. R. Featherston, county historian, gave a full paper onGen. Stonewall Jackson and his political history of Col. Thos. S. Bocock, speaker of the Confederate House for four years, was read by the president, who is emphasizing the local history of the Confeder- asy. Mrs. S. M. Thornton will give in the future a sketch of the Mc- Dearmon family Mrs. Ola Patte- son will give the part the Torrences andtPattesons played in the mak- ingpf Appomattox County. The February meeting will be held the third Thursday, at 330 P. M. Mesdames C. F. James and L. Crawley will be hostesses. Leaders of the program Mrs. R. C. Moore, the Cabinet Mrs. J. A. Burke, Dip lomatic History of the Confederate States Alexander Stephens and the Hampton Roads Conference, 1865."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "and Mr. N. R. <mark>Featherston</mark>, county historian, gave a"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "and Mr. N. R. <mark>Featherston</mark>, county historian, gave a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [409.45, 575.75, 574.68, 1715.47], "bbox_id": "7fc9f2c521", "file": "AppomattoxNewspapers_1926-1933a_0272.pdf", "page": 1, "text": "The good rain came in such good time. Some of the farm ers have finished planting to bacco over the first time, but the weather keeps so cool real ly cold. Plenty frost first  second mornings in June, A rare thing. The wheat crop will soon be ready to harvest. It looks very good in the field. Prof. Wilkins and Mr. Hud gins are giving some splendid talks and information on agri culture at Pettys Fork School House e v e r y Wed. night Everybody should attend. Last Friday was a holiday but I guess the farmers had the hardest day as there was a to bacco season. Mr. G. P. Martin and his mother, Mrs. J. E. Martin, o Roanoke, motored to the home of J. A. Martin last Friday and stayed until I Saturday P. M Then they were accompanied to the home of A. S. Wool dridge by the latter who spent the afternoon. They returned to their home in Roanoke Sun day. Messes Marvin Moses and Ellis Martin, Mrs. ,Edd Moses and little son, Lyle, spent last Sunday in the home of George Thompson, in Campbell. Mr. and Mrs. B. C. Sims and two children, Mr. and Mis Harris Murphy, of Lynchburg spent Saturday night and Sun day in the home of R. W. Mar tin. Mr., and Mrs. W. C. Lee and little Catherine, Mr. and Mrs. W. L. Ford were visitors in this home on Sunday. Mr. B. C. Sims and son, Otis, visited in the home of J. A. Martin last Sunday. Master Thomas Odor left last Sunday morning for his annual visit to the home of his rand-father, T. W. Odor. ---------------------- o --------------- Honor Roll for May 4th. Year Ethel Alvis, John Hesson, Virginia Carson, Bertha Rog ers, Thelma Gunter, Mary Sears, Elizabeth Robertson, Lucile Bates, Alfred Harwood, Sarah Bates, Charles Crawley, Eunice McNally, Madaline Bingham, Nollie Lewis, Lottie Lucado, Annie Gilbert, Vir ginia Chich, Virginia Holt, Lu cy Smith, Henry Pack, Mary Featherston, Gladys I nge, Charles James, Frances Cole man. 3rd Year Mary L. Stratton, Winifred Harvey, George Langran, Sam uel Ford, Lucile Crawley, Jos- hephine LeGrande, Ruby Cole man, Addie Lena Ferguson. 2nd Year Garland Plunket, Ruth Morris, Mandane Anderson, Catherine Lucado, Carrington Beard, Chapman C h i l t o n , Hilda Moore, Weslene Young, Billy H u b b a r d , Lula Drinkard, Clarkie Evans, Christine Paul- et, Claudine OBrien. 1st Year Dojrothy Tweedy, L o u i s e Lewis, Catherine Irby, Eliza beth Crawley, Lynwood Paul ette, James Ford, Ruby- Cole, Herbert Abbitt, Verna Kern, Elliot Turnes, Leilas Davis. 7th Grade John Cole, James Dorton, Hayilah Guill, Jean Anderson, Edith Anderson, Edith Frank lin, Nixie Guill,, Christine Roberts, Manie Smith, Geneva Wingfield, Evelyn Martin, Eleanor Martin, Erna Dicker- son, Helen Marshall, Willie G. Anderson, Virginia Christian, 6th Grade Edith Cole, Hazel Chilton, Nellie Davidson, Ella Mae Dinkins, Marion Giles, Marga ret Gobble, Virginia Eppes Ir- Edith iUicado, Margaret"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Smith, Henry Pack, Mary <mark>Featherston</mark>, Gladys I nge, Charles"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Smith, Henry Pack, Mary <mark>Featherston</mark>, Gladys I nge, Charles"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [368.16, 405.09, 524.53, 551.74], "bbox_id": "fff4844094", "file": "AppomattoxNewspapers_1908-1909a_0573.pdf", "page": 1, "text": "the first of January, is able to be out again. s  s Miss Evelyn .Hawthorne is visiting her sister, Mrs. F. H. Hawley. s s s Mrs. N, R. Featherston spent Sunday with her sister, Miss Jane Marshall, at Hixburg.   s Miss Lena Stratton, of Wil liamsburg, will spend Easter with Miss Thelma Morris."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "s Mrs. N, R. <mark>Featherston</mark> spent Sunday with her"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "s Mrs. N, R. <mark>Featherston</mark> spent Sunday with her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [204.66, 424.3, 525.41, 900.44], "bbox_id": "885659c82c", "file": "AppomattoxNewspapers_1926-1933a_0573.pdf", "page": 1, "text": "the first of January, is able to be out again.   Miss Evelyn .Hawthorne is visiting her sister, Mrs. F. H. Hawley.    Mrs. N. R. Featherston spent Sunday with her sister, Miss Jane Marshall, at Hixburg.    Miss Lena Stratton, of Wil liamsburg, will spend Easter with Miss Thelma Morris.   m Mrs. W. D. Griggs and chil dren of Hopewell visited her brothers, S. J. and C. M. Evans, last week.    Mr. and Mrs. B. H. Coleman and family and Miss Kathleen Coleman, of Mount Hope, W. Va., spent several days in the home of Mrs. E. R. Gleen last week.    Mr. and Mrs. T. J, Harvey, John Harvey, and Norvell Woodson, of Richmond spent Sunday in the home of Mrs. Helen Welch.   Misses Frances Spencer and Virginia Lee Thompson, of Randolph-M a eon College, Lynchburg, will spend the Eas- Miss Betty McGill, of Nor- j R  W  M h  m e  f the. folk, is spending this week in  W M Thompson. the home of R. L. Burke. m . t r   Mr. and Mrs. J. W. Meggin- Charles A. Truax will spend Kn and !c  ? illy of Lynch- thi, week-end with 7redTat  s T Mr and Pamplin. S T Me8gmson, near    here."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Hawley.    Mrs. N. R. <mark>Featherston</mark> spent Sunday with her"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Hawley.    Mrs. N. R. <mark>Featherston</mark> spent Sunday with her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1553.27, 1426.62, 1715.12, 1714.07], "bbox_id": "914dc6f3d0", "file": "AppomattoxNewspapers_1905-1912a_0435.pdf", "page": 1, "text": "The fiist of the Ljcenm Course was a graud success. Floyd Feat- hf-ston Co., of Washington, D. .0., was here iu the best of trim and made all kinds of music on all kinds of instruments. Indeed it has been pronounced by all tire best enter tainment that ever came to town. Mr. Featherston is one of the  beet joke tellers we have ever heard too- He kept a crowded house in an up roar for about two hours. He is oertainly a genius of the highest type. Financially the Course is a success too. Prof. Crawley re ports something over ljilOO up to tbe present. The young folks turned out en masse. Last week we re quested all the yonng fellows to bring their best girl, which so many of them did. We now wish to say that these girls expect yon to do so again on November 23rd. Dont fool them."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "came to town. Mr. <mark>Featherston</mark> is one of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "came to town. Mr. <mark>Featherston</mark> is one of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1643.73, 297.76, 1805.83, 502.91], "bbox_id": "734d0dd20b", "file": "AppomattoxNewspapers_1922-1923a_0463.pdf", "page": 1, "text": "The farmers arotffid are busy planting tobacco. Mr. J. W. Gil liam has planted over half his crop. Hixburg soon will be alive again with young people, as June is the month for schools to close. Mrs. Gertrude Ford and Miss Alice Gilliam expect to leave for a visit to their aunt, Mrs. Jack Da vis, of Bedford county the last of this week. Later will visit their brother, Mr. E. W. Gilliam, of Biistol, Tennessee. They shall be missed in our neighborhood. Messrs. Hartwell Stratton and Ragland Featherston visited this neighborhood last secoud Sunday."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Hartwell Stratton and Ragland <mark>Featherston</mark> visited this neighborhood last"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Hartwell Stratton and Ragland <mark>Featherston</mark> visited this neighborhood last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.56, 1134.92, 1688.25, 1774.01], "bbox_id": "6fef7a82be", "file": "AppomattoxNewspapers_1943-1947a_0132.pdf", "page": 1, "text": "The death angel has kept busy calling loved ones from Appomattox homes during the year just ended. The three subjects of this article were all originally Appomattox people. They came from the best and they gave the best to all who were fortunate to have been associ ated with them. Mrs. Wallace, before her mar riage to Mr. John Overton Wallace, of Albermarle County, was Miss Lizzie Walker, daughter of Mr. James A. Walker and Sallie Jones Walker. This splendid woman, tru ly of the old Virginia stock, led an Active life until a few years before per passing, but that life was not Spent for herself, for her first thought was of service to her Ma ker, her children, and then to man kind. She spent her last years in Rockbridge County and was laid to rest in the cemetery at Falling Springs Church. Mrs. Brandt, before her marriage to Mr. George Brandt of Amherst County, was Miss Maiy Ann Atkin son, daughter of Mr. Robert Atkin son and Fannie Thornhill Atkinson. She, too, was of the old Virginia stock, and her first thought was of service to her God and fellowman. While she was confined to her bed several years before her passing, she never complained, but bore her afliction with a smile, willing to let Gods will he done. She was laid to rest in Fort Hill Cemetery, Lynchburg, Va. Dr. George Tudor Thornhill, a first cousin of the two above men tioned, was the son of Mr. William A. Thornhill and Ellen Jones Thorn hill. He graduated in medicine at the University of Virginia and be gan practicing in the coal fields of West Virginia, later moving to Bluefield, West Virginia, giving up the practice of medicine and en gaging in coal, banking and other interests. He was a man liked by all, of a happy disposition, enjoyed a joke, and never missed an oppor tunity to get one off on a friend, and just as much enjoyed one on himself. He was laid to rest in a cemetery near Bluefield. These people were reared in re fined, Godly homes. All began an early Christian, life as members of Liberty Chapel Church in Appo mattox County, Va., and it is not surprising to learn that they were a power for good all through lifes journey. The writer was deeply dis tressed at the passing of these, his schoolmates and dear and life long friends. w-N- R. Featherston."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "long friends. w-N- R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "long friends. w-N- R. <mark>Featherston</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1418.15, 1040.6, 1728.62, 1309.15], "bbox_id": "a2237a3856", "file": "AppomattoxNewspapers_1926-1933a_0298.pdf", "page": 1, "text": "The club entertained the patrons of the school and the ladies of the community at a Silver Colonial Tea, at the practice cottage on Friday af ternoon, February 21, 1930 vail Connor werefr0m 3 to 5 oclock. Abou   e home of Mr. and fifty guests were present.  1  l f ,v The cottage was tastefully decorated with spring flowers and white tapers. A musical program of old love songs was rendered by the chorus class. Other numbers were A minuet by Miss Mary Featherston, Piano solos by Miss Catherine Gills and Man- j dane Anderson, Duets by Miss es McKie Laughan, Neolo Bar- low and Beatrice and Bernice Woodson, Readings by Misses"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "minuet by Miss Mary <mark>Featherston</mark>, Piano solos by Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "minuet by Miss Mary <mark>Featherston</mark>, Piano solos by Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.01, 1022.35, 1850.52, 1303.39], "bbox_id": "111634da01", "file": "AppomattoxNewspapers_1908-1909a_0298.pdf", "page": 1, "text": "The club entertained the J patrons of the school and the I B ladies of the community at a I Mrs. H. G. John- Silver Colonial Tea, at the Slaughter, Rebec- practice cottage on Friday af- Mrs. L. E Morris ternoon, February 21, 1930 wall Connor were from 3 to- 5 oclock. Abou e home of Mr. and fifty guests were present. The cottage was tastefully . decorated with spring flowers ! h a. m.. fke brok and white taper,. . arm oi Senate, A mualcal P  a m of old frpLTZni ,r  ss  Corporate limit, ol were  A minuet by Mi Mary  y - c Featherston, Piano solos by l om , Miss Catherine Gills and Man- llT e S S  S d dann eta by Mita- L rs ,evel dwell-  McKe Uh,n N l 0 B   ,, 4 , low and Beatrice and Bernice I wou n . . . Woodson, Readings by Misses P  o, yhtam McKie Lansban and Iueillelham, Appomattox,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Mi Mary  y - c <mark>Featherston</mark>, Piano solos by l"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Mi Mary  y - c <mark>Featherston</mark>, Piano solos by l"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [613.47, 352.7, 824.89, 703.58], "bbox_id": "e0e22059f9", "file": "AppomattoxNewspapers_1952-1954a_0461.pdf", "page": 1, "text": "the church. The bride entered on the T! left aisle, accompanied by her maid exhi of honor. Miss Anna Belle Moss, the The groom came up the right aisle will with his best man, Mr. Willie Meg- of 1 ginson. They met at the altar and cord were united in the holy bonds of tor. matrimony by Rev. W. E. Warren, of West Appomattox, in a beautiful. n, but in a solemn and verv impressive.i way ceremony. The bride wore a handsome brown ! broadcloth tailor-made suit. The maid realize j of honor, and the lady attendants pioneed wore white silk waists, black skirts,, and black picture hats. The gentle-!  men wore the conventional black, j The waiters were as follows James Scruggs and Miss Green, Dr.  E. O. Thornhill and Miss Grace Tay lor, Dr. W. A. Thornhill and Miss Belle Wright, Mr. Norman Taylor and Miss M. A. Atkinson, Mr. Street Thornhill and Miss M. S. Moss, Mr. Richard Anderson and Miss Ida Har vey, Mr. William Harvey and Miss Lola Abbitt, Mr. N. R. Featherston and Miss Lula Goodman, Mr. War- I ren Scruggs and Miss Fannie Moss, Mr. Kinkle Martin and ljss Laura I Hammersley. The ushers were as follows Dr. D. A. Christian, Jr., Mr. Tom Mr. Tom Davidson, and Mr."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Abbitt, Mr. N. R. <mark>Featherston</mark> and Miss Lula Goodman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Abbitt, Mr. N. R. <mark>Featherston</mark> and Miss Lula Goodman,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2227.87, 893.9, 2384.05, 946.25], "bbox_id": "190f1aea41", "file": "AppomattoxNewspapers_1926-1933a_0562.pdf", "page": 1, "text": "The Christian Endeavor So ciety was entertained at a jig saw party Monday evening by Miss Mary Featherston and Lucy Smith."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "The Christian Endeavor So ciety was entertained at a jig saw party Monday evening by Miss Mary <mark>Featherston</mark> and Lucy Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "The Christian Endeavor So ciety was entertained at a jig saw party Monday evening by Miss Mary <mark>Featherston</mark> and Lucy Smith."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2225.0, 874.0, 2381.64, 926.1], "bbox_id": "552bc47a05", "file": "AppomattoxNewspapers_1908-1909a_0562.pdf", "page": 1, "text": "The Christian Endeavor So ciety was entertained at a jig- isaw party llonday evening by Miss Mary Featherston and Lucy Smith."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "The Christian Endeavor So ciety was entertained at a jig- isaw party llonday evening by Miss Mary <mark>Featherston</mark> and Lucy Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "The Christian Endeavor So ciety was entertained at a jig- isaw party llonday evening by Miss Mary <mark>Featherston</mark> and Lucy Smith."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [832.55, 257.95, 991.76, 561.09], "bbox_id": "c092fed1b3", "file": "AppomattoxNewspapers_1926-1933a_0499.pdf", "page": 1, "text": "The B. Y. P. U. o Spout Spring Baptist churchfi gave a demonstration program at He bron church Sunday night. A very interesting program was render, d. There was a very large attendance. Misses Mary Featherston, of Appomattox, Eleuano and Elizabeth Davidson, Agnes jen- nings and Louise Turnes were guests in the home of Mrs. C. M. Caldwell Sunday. Miss Virginia Chick is spend ing sometime in Covington. Mr. and Mrs. Tom Christian and daughter, Elsie Laura, of Covington, were the guests of Mrs. C. E. Carson Sunday. Mrs. O. R. Turnes, who has been sick for the past few week, is ndt much improved. Mr. and Mrs. P. B. Stratton attended the funeral of Mrs. Strattons uncle, Mr. Steeves, of Roanoke, Friday. Miss Naomi Hancock, of Ap pomattox, spent a part of last week with Mrs. Paul Ferguson."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "large attendance. Misses Mary <mark>Featherston</mark>, of Appomattox, Eleuano and"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "large attendance. Misses Mary <mark>Featherston</mark>, of Appomattox, Eleuano and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2181.6, 517.43, 2353.8, 972.41], "bbox_id": "2705c2adbd", "file": "TimesVirginian_1983a_0258.pdf", "page": 1, "text": "The Appomattox County Histori cal Society is currently seeking help from Appomattox County residents in completing a geneaotogy survey. Information from the survey will he used in compiling a book on the history of Appomattox Countv. The project hi being coordinated bar Bob rad Vicki Jamerson and Jimmy rad Betty Drinkard. We are planning to update the history of Appomattox County Which was written by Mr. N.R. Featherston, notes Betty Drink ard. The hook includes much back ground information on Appomattox Comity, including information rela tive to the period when the county was formed, rad information about historic homes and places in the county. The book also includes consider able information on the lineage of many pf tim older families in Appomattox CoUnty. p fO ir aim is to gather more complete information on the families bt tne county, mfd to add any ibformstion we might be able to gather about tim background of the county and its historical places, Mrs. Drinkard says. The project was begun several years ago, when the Historical Society made u appeal to county residents to help in updating information in the Featherston book. W have received about 100 responses since then, and that has boM helpful. Were hoping that a  renewed emphasis on the project e tt get more people to fill out the llogy form s, notes Mrs."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "written by Mr. N.R. <mark>Featherston</mark>, notes Betty Drink ard."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "written by Mr. N.R. <mark>Featherston</mark>, notes Betty Drink ard."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2323.44, 1393.09, 2494.97, 1629.43], "bbox_id": "3a74a6d6be", "file": "AppomattoxNewspapers_1939-1943a_0346.pdf", "page": 1, "text": "The Appomattox Chapter of the U. D. C. is deeply grateful to the following contributors to the Lee Chapel and Mausoleum Endowment Fund N. R. Featherston, W. C, Franklin, Judge J. W. Flood, II. C, Pulliam, N. E. Farrar, C. K. Hunt er, Mrs. Dora Randolph, B. G. An derson, A. R. Harwood, R. L. Burke, Mrs, H. F. Jones, Jerry A. Burke, T W. Moses, R. E. Smith, C. W. Smith, A. R. Harwood, Jr., C. H. Robinson, Dr. F. H. Lukin, L. N. Ligon, J. D. McDearmon, Mrs. F. C. Dt-esser, Mrs. S. L. Ferguson, Mrs. D. E. Caldwell, Jr, Larry A. Young, Mr. and Mrs. F. L. Murphy, Mesdames Lillie Gregory, T. M. Trent, Emma Young Hunter, W. M. Abbitt, Judge L. F. herguson, C. S. McDearmon, C. T. Moses, Dr. C. F. James, G. B. Buchanan, Mrs. H. P. Davis, IMieses Naomi Hancock, Elva Stratton, Kate M. Franklin, and Elaine McDearmon, and W. E. Han cock."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Endowment Fund N. R. <mark>Featherston</mark>, W. C, Franklin, Judge"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Endowment Fund N. R. <mark>Featherston</mark>, W. C, Franklin, Judge"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [701.04, 643.72, 1026.81, 900.47], "bbox_id": "0eb05fe906", "file": "AppomattoxNewspapers_1933-1936a_0294.pdf", "page": 1, "text": "The annual meeting and picnic of the W. M. U. of Liberty Baptist was held at the home of loon at 330 instead of Friday, its  church regular meeting date. Mrs. Joel T. Cawthorn. A bountiful   Junch was served on the lawn, after Mrs. C. A. Hancock and daughter which an interesting program on Elizabeth returned to Huntington, Stewardship was presented by Mrs W. Va., today after visiting here I Don Moses, president of the organ- lor several days. j ization. About fifty members and   i guests were present. Mrs. E. E.  Gills,  Mrs. C. A. Mrs. Cawthorn, who is i her 83rd Hancock, Miss Louise Gills and Miss year, went to live in her present Elizabeth Hancock anj Robert Gills j nome sixty five years ago when she spent Tuesday in Richmond.  was the bride of Joel T. Cawthorn, i wh0 passed away fifteen years ago. Mr. and Mrs. S. V. Munsey and Her husband saw service in the daughter, Betty Vaughn, left Mon- Confederate Army, and liked to day for Gate City where they will  show visitors jn their hospitable make their home. j home the Bible which saved his life during the War Between the N. R. Featherston and Rev. R. States. He had the Bible in his E. Redding attended the Virginia pocket and when a shot was fired Presbyterian Synod in Richmond last! at him it lodged in the Bible, thus week.  preserving his life. v    Mrs. Cawthorn enjoys very goot Miss Phoebe OIBrienV left this health and is in possessioi of all morning to spend her vacation with her faculties, being only slightly friends! at Clifton Forge, Hot deaf. She is beloved by a host of Springy and White Sulphur Springes, friends arjd relatives, whr gather"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Between the N. R. <mark>Featherston</mark> and Rev. R. States."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Between the N. R. <mark>Featherston</mark> and Rev. R. States."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2199.1, 462.91, 2372.75, 641.2], "bbox_id": "e27a272f9e", "file": "AppomattoxNewspapers_1933-1936a_0091.pdf", "page": 1, "text": "The angel of death moves sraft- iv Tuesday -mortung of th weex, i dwth entered one of Appomartox. most d eem ed families w d w tftiy took to eternal rest the Deioveu mother, Mrs. N- R- Mrs. Featherston wm found deua  in the home shortly after her deaUi bv a high school pupil, Polly Sish. She had apparently been in 1 good health when her husba d ir t I Monday on a bumness trip jo Sout I west Vuginia. The only W J iMarv wa-i at work at tre ocaii I f ERA office. The boJy was found l lying in the room.  V I I Bef re her marriage, Mrs. Fea I therstou was Miss Ann Bell M.ii I S d-ughter of th, late John R l MarshVI. Sr. She mu.r.t.l N."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Mrs. N- R- Mrs. <mark>Featherston</mark> wm found deua  in"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Mrs. N- R- Mrs. <mark>Featherston</mark> wm found deua  in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2070.41, 395.59, 2244.86, 525.58], "bbox_id": "a64d19c420", "file": "AppomattoxNewspapers_1947-1949a_0523.pdf", "page": 1, "text": "The American Legion Post has obtained a limited supply of the re- j cently published History of Appo-  mattox and Service Record pf thej World Wars I and II, by the late N. R. Featherston, and urges the people of the county to purchase a  copy. The contract with the print-! er is running out and after a month the book will be out of print. Con tact the Adjutant, R. G. Janatka, Lee Theater Building, of T. Hunter j Dickersons store."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "the late N. R. <mark>Featherston</mark>, and urges the people"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "the late N. R. <mark>Featherston</mark>, and urges the people"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2002.02, 707.35, 2168.04, 795.63], "bbox_id": "7601e95dc6", "file": "AppomattoxNewspapers_1947-1949a_0405.pdf", "page": 1, "text": "The American Legion members are now making a canvass of the county taking orders for the His. tory of Appomattox, World Wars I and II, by N. R. Featherston. The sale of the book is being sponsored by the local Legion Post, and the members invite the public to place orders with them."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "II, by N. R. <mark>Featherston</mark>. The sale of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "II, by N. R. <mark>Featherston</mark>. The sale of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2079.37, 273.75, 2251.71, 420.34], "bbox_id": "ce71d58411", "file": "AppomattoxNewspapers_1943-1947a_0313.pdf", "page": 1, "text": "tended the funeral of Hon. Berkley D. Adams at Red Oak, Charlotte County, Monday. M iss Emily Featherston return rid Monday after visiting in Rich mond and Bluefield. Clareho 1 Mays, who underwent an operation in the Lynchburg hos pital, is getting along nicely. Gilbert Mays, S 1-C, who was aboard the U. S. S. Shangri-La, is spending a furlough with his wife and daughter. Mr. and Mrs. Burton Daye and daughter, of Richmond, Mr. and Mrs. Richard Bass and daughter."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Monday. M iss Emily <mark>Featherston</mark> return rid Monday after"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Monday. M iss Emily <mark>Featherston</mark> return rid Monday after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1354.32, 721.47, 1622.73, 1063.41], "bbox_id": "b0c4421a80", "file": "AppomattoxNewspapers_1926-1933a_0162.pdf", "page": 1, "text": "taVeanX S SaTr- Loie Lucado. John Hesson, I batur Charles James, Alfred Harwood. jberZotn. p ay Babcock, Virginia Carson,! W.Ogburn, of Chase Nonje LeWfcf Gladys Inge, Mary sfte week-end guest of w 00d80ni Frances Coleman, Mary  Featherston, B e r t h a Rogers, I James Morris, Virginia Holt,l Gertrude Stewart, Charles Craw- I ley. First YearHorsley Harris,  Josephine LeGrand, Addie Lena  to p iav rist watch I Ferguson, Evelyn Dickeaoc.Mar-l V RC on back, gray jgaret Candle, Lawson Lee, Alice nd, trimmed in blue Burge. Vernon Ragland, Lucille this office and receive Cralle, Horace Shirley, Frank ICawthorn Jr. Seventh GradeMandane An- j derson, Carrie Jamerson, Hilda ovember 19th, at W. I Moore, Claudine OBrien, Eliza-  from 330 till 10 beth Trent, Billy Hubbard, Gar- Proceeds benefit of I land Plunkett, Clarkie Evans. Sixth GradeElizabeth Cralle,  . far-I will haul to- M p, CUrk, Margaret Ca rto ,  er loads at reaonable I Mabel Hall, Adeline O Bnen, Thelma Morris, Mabel Smih, J. C. W omack , I Catharine Irby. Appomattox, Va. I grade  David Carter, r SaleBirkshire, Pol-1 Billy Smith, John Cole, Erna"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "00d80ni Frances Coleman, Mary  <mark>Featherston</mark>, B e r t"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "00d80ni Frances Coleman, Mary  <mark>Featherston</mark>, B e r t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [372.51, 1164.0, 534.35, 1696.52], "bbox_id": "5d7fe3d63f", "file": "AppomattoxNewspapers_1933-1936a_0264.pdf", "page": 1, "text": "t A t Mr. and Mrs. R. E. Baldwin and duughter of Bonair and Mrs. Lucye White of Philadelphia spent Sunday in it he home of N. R. Featherston. a a a J. T . and G . A . Abbitt of Bluefield West Virginia pent the weekend with their parents Mr. and Mrg.C. N Abbitt. a a a Miss Dorothy Davidson of Blue- field spent the weekend with Miss Elizabeth Abbitt. a a a Mr. and Mrs. W. D. Cofer who hav been visiting relatives in and around itown have returned to their home in Bluefield. a a a Mrg. Dabney Anderson is visiting in the home of Mrs. Robert Coleman. a a a T . F . Coleman is visiting in Rich mond.    Mrg. W. M . Thompson, Mrs. Flor ence Glenn and Mr. and Mis. Cam eron White were idinner guests of M iss Louisa Gills Monday evening.   V Miss Katherine Gills and mother have returned from a northern trip, a a a Mr. and Mrg. J.E . Dinwiddie and family moved to Sweet Briar Wed nesday.    Misg Sarah Frances Pretlow has returned to her home in Norfolk after spending some time with Misses Carolyn and Virginia Moseg.   a Owing to the recent ruling of the County Boand of Health that persons under 16 years of age should not at- tend public gatherings of any kind, the Baptist Sunday Schcol decided to postpone their play whch was to have been presented on Friday August 2. The date on which it will be given will be announced later.    Misses Helen and Frances Marshall of Lynchburg spent lagt week with Miss Susie Plunkett.    Mifeg Eloise Abbitt has returned from a visit in Victoria."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "home of N. R. <mark>Featherston</mark>. a a a J."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "home of N. R. <mark>Featherston</mark>. a a a J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1946.89, 1110.6, 2073.46, 1244.76], "bbox_id": "2fb240e9d6", "file": "AppomattoxNewspapers_1915-1918a_0083.pdf", "page": 1, "text": "supervisors.. J B Horsley, I board... .................... IF w McKinney, sheriff ........ sasiw F w MoKinney,jailor--. 88 m IN R Featherston, superin- tendent Of schools .......... . 1600 L B Smith,supervisor...... M l9 IM w Carson, supervisor-.... g g O M Drinkard, supervisor...  96 J w Paris, superintendent o f p o w  -  .1 240 IS G Harvey, overseer of the. I poor .............. .        UB D P Ferguson, overseer of 1 the poor... .........   Richard Phelps, overseer of thepoor .................. ..... 200 T O Hubbard, keeper or I Court Hom e... ........ .   John Reid, Janitor, elerk I offloe .... - ............................"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "88 m IN R <mark>Featherston</mark>, superin- tendent Of schools"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "88 m IN R <mark>Featherston</mark>, superin- tendent Of schools"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1565.76, 564.38, 1731.28, 1452.21], "bbox_id": "0b11435a97", "file": "AppomattoxNewspapers_1908-1909a_0026.pdf", "page": 1, "text": "STONEWALL Refreshing showers came, last week and the crops and gardens are green and growing again. Miss Elva Stratton left Mon day a. m. for a weeks visit ih Norfolk with relatives. Rob Stratton, of South Caro ina, is spending his vacation at lome and enjoying fox hunting. Messrs. LeGrahd, Morton, larvey, and Rev. Redding, of Appomattox, had a lively fox chase Friday night around Stone- wall. Ng Mr. and Mrs. John LeGrand, of Lynchburg, are the house guests of Mr. LeGrands sister,, Mrs. J. A. Stratton, and famllyi Mr. and Mrs. Don Isabell and ittle daughter, and Mrs, Laura Cabell, of Washington, will ar rive Wednesday to spend some time in the Stratton home. Miss Margaret Neighbors spent ast week with her brother, J. N. Neighbors, J r . and Mrs. Neighbors in Lynchburg. Sears Taylor, Kenneth Alvis and R. D. Chew arrived Thurs day by motor cycle from Fort Jlonroe, where they have been in camp since leaving V. P. I. Alvis and Chew left Saturday day a. m. for Staunton where hey will be Joined by Chews irother on fy trip to North Da cota, Canada and other places of interest. Miss Annie Alvis, who is a t tending Columbia University, passed the week-end with the Masses OBrien in Boston. Mr. Homesy Tanner, of Crewe, is visiting relatives here. Mr. and Mrs. S. E. Anderson, inddaughters, Mary and Jean Mr. wid Mrs. Tunkley Gunter, and little son, visited relatives in Lynchburg Sunday after noon. i Mrs. Rosa darson, of W. Va., is visiting her brother, B. L. Vheeler, and family. Mr. and Mrs. W. M. Drinkard, of Lynchburg, spent Saturday andSunday with Mr. Drinkard? parents, Mr. and Mrs. T. A. Drinkard. Sunday guestin the home of W. H. Drinkard included Glenn Drinkard, of Lexington Mr. and Mre. H. A. Drinkard, of Lynch burg Mr. and Mrs. E. S. Chicle and daughters, Virginia and Rachel. Rev. Redding and family, of Appomattox, were Sunday din ner guests of Tom Wright, and family. Mr. Ragland Featherston and wife, mother, and sister, were Sunday guests of G. A- Stratton, and family. Also Misses Le Grandes of Lynchburg,"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.09, 567.97, 1736.31, 1676.13], "bbox_id": "0ae581a59f", "file": "AppomattoxNewspapers_1926-1933a_0026.pdf", "page": 1, "text": "STONEWALL Refreshing showers came last week and the crops and gardens are green and growing again. Miss Elva Stratton left Mon day a. m. for a week 3 visit in Norfolk with relatives. Rob Stratton, of South Caro- ina, is spending his vacation at lome and enjoying fox hunting. Messrs. LeCrand, Morton, iarvey, and Rev. Redding, of Appomattox, had a lively fox chase Friday night around Stone wall. Mr. and Mrs. John LeGrand, of Lynchburg, are the house guests of Mr. LeGrands sister, tfrs. J. A. Stratton, and family VIr. and Mrs. Don Isabell and ittle daughter, and Mrs. Laura Isabell, of Washington, will ar rive Wednesday to spend some time in the Stratton home. Miss Margaret Neighbors spent ast week with her brother, J. W. Neighbors, Jr., and Mrs. Neighbors in Lynchburg. Sears Taylor, Kenneth Alvis and R. D. Chew arrived Thurs day by motor cycle from Fort llonroe, where they have been in camp since leaving V. P. I. Alvis and Chew left Saturday day a. m. for Staunton where they will be joined by Chews brother on a trip to North Da cota, Canada and other places of interest. Miss Annie Alvis, who is at tending Columbia University, passed the week-end with the hisses OBrien in Boston. Mr. Homesy Tanner, of Crewe, is visiting relatives here. Mr. and Mrs. S. E. Anderson, and daughters, Mary and Jean Sir- and Mrs. Dunkley Gunter, and little son, visited relatives in Lynchburg Sunday after noon. Mrs. Rosa Carson, of W. Va., is visiting her brother, B. L. Wheeler, and family. Mr. and Mrs, W- M. Drinkard, of Lynchburg, spent Saturday and Sunday with Mr. Drinkards parents, Mr. and Mrs. T. A. Drinkard. Sunday guests in the home of W. H. Drinkard included Glenn Drinkard, of Lexington Mr. and Mrs. H. A. Drinkard, of Lynch burg Mr. and Mrs. E. S. Chick and daughters, Virginia and Rachel. Rev. Redding and family, of Appomattox, were Sunday din ner guests of Tom Wright, and family. Mr. Ragland Featherston and wife, mother, and sister, were Sunday guests of G. A- Stratton, and family. Also Misses Le- Grandes of Lynchburg. Miss Frances Stratton passed the week-end in Lynchburg. Mr. and Mrs. Willie Farrar, and Mr. Tom Farrar, of Fluvnia county, and Miss Elizabeth Rice, of Richmond are the house guests of Hon. J. R. Horsely. Mr. and Mrs. Wood Burke and Miss Melisse Van Wagner, of Chicago, have been recent guests of Mr. Burkes sister, Mrs. Boyd Hamilton, and family. Mrs. Wiley Brook, of Atlanta, Ga., is guest of her sister, Mrs Marshall Stratton for a few days Miss Cordelia Scruggs, of New York City arrived Tuesday for a visit with her parents, Mr."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.98, 566.07, 1732.21, 1440.74], "bbox_id": "2ef982adc2", "file": "AppomattoxNewspapers_1908-1909a_0027.pdf", "page": 1, "text": "STONEWALL Refreshing shówers came - last week and the crops and gardens aré green and growing again. Miss Elva Stratton left Mon day a. m. for a weeks visit in Norfolk with relatives. Rob Stratton, of South Caro lina, is spending his vacation at home and enjoying fox hunting. Messrs. LeGrand, Morton, Harvey, and Rev. Redding, of Appomattox, had a lively fox chase Friday night around Stone wall.  Mr. and Mrs. John LeGrand, Of Lynchbürg, are the house guests of Mr. LeGrands Bister, Mrs. J. A. Stratton, and family Mr. and Mrs. Don Isabel! and little daughter, and Mrs. Laura Isabel, of Washington, will ar rive Wednesday to spend some time in the Stratton home. Miss Margaret Neighbors spent last week with her brother, J. W. Neighbors, Jr., and Mrs. Neighbors in Lynchburg. Sears Taylor, Kenneth Alvis and R. D. Chew arrived Thurs day by motor cycle from Fort Monroe, where they have been in camp since leaving V. P .1 , Alvis and Chew left Saturday day a- m. for Staunton where hey will be joined by Chews brother on a trip to North Da kota, Canadá and other places of interest. Miss Annie Alvis, who is at tending Columbia University, passed the week-end with the Misses OBrien in Boston. Mr. Homesy Tanner, of Crewe, is visiting, relatives here. Mr. and Mrs. S. E. Anderson, and daughters, Mary and Jean Mr. and Mrs. Dunkley Gunter, and little son, visited relatives in Lynchburg Sunday after noon. Mrs. Rosa darSbn, of W. Va., is visiting her brother, B. L. Wheeler, and family. . Mr. and Mrs, W. M. Drinkard, of Lynchbqrg, spent Saturday and Sunday with Mr. Drinkardts parents, Mr. and Mrs. T.  A. Drinkard. .. Sunday guests ip the home of W. H. Drinkard included Glenn Drinkard of Lexington Mr. and Mrs. H. A. Drinkard, of Lynch burg Mr. and Mrs. E. S. Chick and daughters, Virginia and Rachel.  Rev. Redding and family, of Appomattox, were Bunday din ner guests ofTom Wright, and family. Mr. Ragland Featherston and wife, mother, and sister, were Sunday guests of G. A- Stratton, and family. Also Misses Le"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "and family. Mr. Ragland <mark>Featherston</mark> and wife, mother, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [831.84, 572.55, 992.07, 1207.06], "bbox_id": "6330df51da", "file": "AppomattoxNewspapers_1908-1909a_0499.pdf", "page": 1, "text": "STONEWALL, June l.-T h e Rev. W. T. Henderson and wife attended the pastors confer ence at Ebenezer church, near Naruna, Monday. Miss Mary Featherston, of Appomattox, was week-end guest of Miss Doris Caldwell. Miss Susie Hitler,. of New -Canton, visitedthe- Rev. and Mrs. W. iT. Henderson last week for several days. Miss Fannie LeGrande, of Lynchburg, is visiting- her sis ter,HMrs-J. A. Stratton. Mrs. Mary Moore spent Fri daywith Mrs. Etna Tanner Steeves. The Rev. and Mrs W. T. Hendersons guests for dinner Sunday included Mr. and Mrs. W. W. Hughes, of Arvonia, Mrs. M. S. Jones and Miss Mi riam Jones, of Dillwyn, Mrs. Stanley Jeffrey and son, Stan ley, Jr., and Mr. Ned Roberts, of Arvonia. Mr. and Mrs. Irby Wheeler and sons spent Sunday with Mr. and Mrs.RufUs Burnett. Miss Glenn and Mr. Eugene Carson, of Prospect, visited the latters parents Sunday. Mr. and Mrs. C. T. Drinkard and son, Ty Cobb, and Mrs. W. H. Drinkard were dinner guests of Mr,- and Mrs. E. L. Chick Sunday. 1  Mr. and Mrs. A. B. Chick, Mr and Mrs. Clyde Carson and lit tle girls, Louise and Ann, were guests of Mr. and Mrs. Tom King Sunday. Masters Tom Davidson, Clay ton Drinkard, Jr., and Lloyd Jennings, visited George and Thomas Henry Jennings Sun day. Lawrence, Max and John Wheeler and Glenn Drinkard were in Lynchburg to1 see the ball game Sunday. Mr. and Mrs. Tom Tanner and baby and Miss Helen Scuggs motored to Richmond and other points of interest last week-end. The B.Y.P.U. of Spout Spring gave a demonstration program to the Hebon B. Y. P. U. Sun day night. Quite a large crowd-"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Naruna, Monday. Miss Mary <mark>Featherston</mark>, of Appomattox, was week-end"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Naruna, Monday. Miss Mary <mark>Featherston</mark>, of Appomattox, was week-end"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [832.55, 582.44, 993.28, 1217.7], "bbox_id": "5c835da790", "file": "AppomattoxNewspapers_1926-1933a_0499.pdf", "page": 1, "text": "STONEWALL, June 1.The Rev. W. T. Henderson and wife attended the pastors confer ence at Ebenezer church, near Naruna, Monday. Miss Mary Featherston, of Appomattox, was weekend guest of Miss Doris Caldwell. Miss Susie Hitler,, of New Canton, visited the Rev. and Mrs. W. iT. Henderson last week for several days. Miss Fannie LeGrande, of Lynchburg, is visiting her sis ter, Mrs. J. A. Stratton. Mrs. Mary Moore spent Fri day vith Mrs. Etna Tanner Steeves. The Rev. and Mrs. W. T. Hendersons guests for dinner Sunday included Mr. and Mrs. W. W. Hughes, of Arvonia, Mrs. M. S. Jones and Miss Mi riam Jones, of Dillwyn, Mrs. Stanley Jeffrey and son, Stan ley, Jr., and Mr. Ned Roberts, of Arvonia. Mr. and Mrs. Irby Wheeler and sons spent Sunday with Mr. and Mrs. Rufus Burnett. Miss Glenn and Mr. Eugene Carson, of Prospect, visited the latters parents Sunday. Mr. and Mrs. C. T. Drinkard and son, Ty Cobb, and Mrs. W. H. Drinkard were dinner guests of Mr. and Mrs. E. L. Chick Sunday. Mr. and Mrs. A. B. Chick, Mr and Mrs. Clyde Carson and lit tle girls, Louise and Ann, were guests of Mr. and Mrs. Tom King Sunday. Masters Tom Davidson, Clay ton Drinkard, Jr., and Lloyd Jennings visited George and Thomas Henry Jennings Sun day. Lawrence, Max and John Wheeler and Glenn Drinkard were in Lynchburg to see the ball game Sunday. Mr. and Mrs. Tom Tanner and baby and Miss Helen Scuggs motored to Richmond and other points of interest last week-end. The B.Y.P.U. of Spout Spring gave a demonstration program to the Hebon B. Y. P. U. Sun day night. Quite a large crowd"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Naruna, Monday. Miss Mary <mark>Featherston</mark>, of Appomattox, was weekend"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Naruna, Monday. Miss Mary <mark>Featherston</mark>, of Appomattox, was weekend"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1984.79, 1046.82, 2150.06, 1810.03], "bbox_id": "70b87a6f1f", "file": "AppomattoxNewspapers_1912-1915a_0465.pdf", "page": 1, "text": "STONEWALL DISTRICT N. R. Featherston Vera. Miss Ida Jones Oakville. Mrs. Lillie E. Dri kard, Stapleton Mrs W. T. Steele, Spout Spring Mrs. J. W. Neighbors, Concort I will from time to time name other members of my commit tee, and I hereby authorize and request that the members above named will get every in dividual possible to co-operate in this great work, and I wouk like to see a thorough canvas made of the entire county, ant give every individual an op portunity to contribute, let it be little or much, to this fund. I have made storage arrange ments with Mr. R. W. Nowlin at Spout Springs, Mr. E. Le- Roy Smith, and 1 will look af ter it at Appumattox, Mr. C. S. McDearmon at Evergreen, and Mr. L. N. Ligon, at Pamplin, and I hope that every indivi dual of the county will make a contribution to this fund, and carry whatever they wish to donate, whether cash, food stuff or clothing, to these par ties for storage and safe keep ing until orders are given for shipment. We hope the canvas and con tribution may be made and stored at once, as we are ex pecting a call for the shipment to be made between now and the holidays. I might say, that transportation will be free, and Virginia, is expect ed to fill one of her great steamers, with food and cloth ing for those suffering people, and for it to be carried to them in a Virginia ship, sailing un der the U. a. Flag. Any kind of clothing, whet her second-hand or not, and any kind of provisions which will be capable of easy hand ling and bear transportation, will be gladly accepted, and no one can have any excuse for failing to contribute at least something o this fund. I ex pect a liberal contribution from our County and believe that whatever anyone does in this cause will be a labor of love to"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "STONEWALL DISTRICT N. R. <mark>Featherston</mark> Vera. Miss Ida Jones"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "STONEWALL DISTRICT N. R. <mark>Featherston</mark> Vera. Miss Ida Jones"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.32, 1500.41, 529.14, 1784.67], "bbox_id": "d8e104e555", "file": "AppomattoxNewspapers_1892-1898a_0415.pdf", "page": 1, "text": "STONEW ALL DISTRICT. DelegatesJoseph Button, Jno. W. Davidson and Hon. S. C. Stratton. Alternates Judge D. A. Chris tian. Capt. James Featherston and J. R. Horseley. Mr. S. L. Ferguson offered the following resolutions which were 1 adopted ResolvedThat the chairman of the delegation elected by the meet ing be directed to cast the entire vote of the county in the Roanoke convention, on all questions, as a 41 majarity of the delegation may de- i termine. Hon. H. D. Flood then offered following resolutions, which lo were unanimously adopted. Whereas, Judge Wm. Hodgers Mann, of Nottoway county, one of the oldest lawyers in the State and one of the most eloquent and active advocates the Chicago platform had in Virginia during the late Presidential contest, is a candidate"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Chris tian. Capt. James <mark>Featherston</mark> and J. R. Horseley."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Chris tian. Capt. James <mark>Featherston</mark> and J. R. Horseley."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2110.87, 295.31, 2459.92, 633.7], "bbox_id": "6e5b2b3059", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "Spring. The County at that time had no money for poor pupils, in 1847, Barbara G. Wright petitioned the Legislature for pay . for educating poor pupils. She had conducted a School in that part of Prince Edward County which was cut off to Appomat tox County. Ten years later, in 1857, one William A. Swann petitioned the Legislature to pay him for pupils taught by him. He con ducted a School in Prince Edward County, but had some pupil from Appomattox. He asked for four cents per day per pupil, his bill amounting to 17.36. Two to four cents per day per pupil was the regular rate in free schools of that day. Pri vate schools were numerous, so good and so cheap, that only the poorest children attended free schools. A teacher in free schools in those days made from 25.00 to 50.00 a year, but needed to know nothing more than the three Rs and not much of them. The first public school in the county was lo cated near the site of the Old Court House. It opened in 1870, with J. H. Featherston as teacher, and our School System has gradually developed through the years, from the one room school until now we have three Senior High Schools, with Home Economics, Agricultural and Manual Treaining Departments, two for white and one for colored, and a number of graded elementry schools throughout the County, with a great ma jority of the students being transported to and from school by busses. In connection with our schools, we have a splendid public library, and two community canneries serving our people."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "1870, with J. H. <mark>Featherston</mark> as teacher, and our"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "1870, with J. H. <mark>Featherston</mark> as teacher, and our"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [702.7, 330.9, 872.16, 399.94], "bbox_id": "84182cbbea", "file": "AppomattoxNewspapers_1947-1949a_0096.pdf", "page": 1, "text": "spent Tuesday night in the home of J. R. Marshall. X. R. Featherston and Mrs. Dan Ford called in this home Saturday P. M. Other callers Sunday were Mr. and Mrs. Joe Terryand little Joe Ben, of Cum berland and Mrs. C. B. Carson and"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "R. Marshall. X. R. <mark>Featherston</mark> and Mrs. Dan Ford"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "R. Marshall. X. R. <mark>Featherston</mark> and Mrs. Dan Ford"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2235.54, 1392.28, 2402.8, 1841.03], "bbox_id": "d569f28799", "file": "AppomattoxNewspapers_1954-1955a_0186.pdf", "page": 1, "text": "some bf his old company yester day. They were taken from Battery and put into active service in the fight near Drewrys Bluff. Two were killed, Nathan Wright and William Hardin, and three were wounded. Charles Phelps, and David Abbitt and another one I do not remember his name. David Abbitt was serious ly wounded through the shoulder. I have not heard from Overtons company for over two weeks at last account they had not left their battery, I think. Brother George mentioned in our letter about Jim mie Featherstons horse being shot from under him while he was fol lowing General Hill. Capt. Adams captured a little Yankee Negro a few days ago. He was waiting on a Yankee orderly sargent of the north and when they left our front, he was left asleep. He is a smart little fellow about 11 years old and from his account has been in the service for three years. Jessie has been sick, but has recovered. I most of our Corps here have been sick have had the Diarrhoea slightly. Jimmie Featherston expects to get a detail to come home and get a horse he may possibly get it I think it doubtful. I think that you all might write twice a Week, while this campaign  last, for a week seems to me as long as a month generally is. Write every opportun ity. I will send this letter the first opportunity. Brother Georg  is off duty as a eourier. I have written al I could think of that would be at all interesting. Write as soon as you receive this short scroll. Your Affectionate Son, David A. Christian."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "the Diarrhoea slightly. Jimmie <mark>Featherston</mark> expects to get a"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "the Diarrhoea slightly. Jimmie <mark>Featherston</mark> expects to get a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.5, 917.95, 2084.32, 1188.2], "bbox_id": "38414f5c58", "file": "AppomattoxNewspapers_1915-1918a_0561.pdf", "page": 1, "text": "some away who were expected to take a part in the exercises. The writer has not been ad vised of the amount raised, hut the contribution should hav been liberal by those who at tended the affair, as a volunta ry donation was all the expense I Lynchburg I it was to them. Our neighbors, Mrs. Creed Hammersley and Miss Lelial Busy,Corner Wheeler, are convalescent. I The farmers of this . section Mrs. Clara Steger of Buck-1 are busy threshing wheat, ingham, is visiting her old I Mr. 0. E. Grow, of Roanoke, heme. 8he has many friends spent a few days of last week around here who still love and  with his wife and children here I admire her. I Mr. and Mrs. E. W. Austin The host of friends of Miss I spent, the Fourth with the let I Alf ra Featherston will regret j ftii parents, Mr, and ,Mre. A I to learn that she continues ill IB. Nowlin. 1 at her home in Roanoke. I Mr. Kirk Megginson made A very severe hail storm!flying trip to Lynchburg Iasi swept over several farms here-1 week"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "let I Alf ra <mark>Featherston</mark> will regret j ftii"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "let I Alf ra <mark>Featherston</mark> will regret j ftii"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [667.02, 616.3, 1085.35, 693.59], "bbox_id": "6b7989e4a2", "file": "AppomattoxNewspapers_1933-1936a_0315.pdf", "page": 1, "text": "Solution  Featherston, Miss Mary nd Miss Emily Featherston and M ts . H. T. Paris spent Sunday in Scottville..    Mrs. IlcUn Welch, who has been sick, has rsumed her duti n at the"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Solution  <mark>Featherston</mark>, Miss Mary nd Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Solution  <mark>Featherston</mark>, Miss Mary nd Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [301.19, 556.09, 505.29, 1792.27], "bbox_id": "92ebb039d2", "file": "AppomattoxNewspapers_1926-1933a_0183.pdf", "page": 1, "text": "Sixty-four delegates, with a fourth of a vote each, were elect ed to attend the state democratic convention in Roanoke on June 21, Governor Byrds program, including the proposed amend ments to the constitution, was endorsed and achievements of Senator S. L. Ferguson and Dele gate Albert Terrell in the Gener al Assembly were commended at a mass meeting of democratic voters last Friday. Don Moses, chairman of the county democratic committee called the meeting to order anc Senator Ferguson was elected chairman of the meeting while C. W. Spnith was chosen as its secretary. A resolution proposed by Mr. Smith and unanimously adopted provided that 64 delegates with a fourth vote vote each be sent to Roanoke that the chairman of the meeting appoint a com mittee of three, one from each magisterial district, to nominate these delegates that the dele gates from the county vote as a unit at the convention easting their ballots as a majority of them might determine and that those present at the convention cast the entire vote of the dele gation. Joel Flood introduced a reso lution expressing appreciation of the able representation given the county in the house of delegates by Colonel Terrell and commend ing him particularly for his ad vocacy of a change in the  nieth- od of gasolene tax distribution which would be more fair to the poorer counties in the state than the method now in use. J. R. Horsley introduced a resolution in which he praised Senator Ferguson for his activi ties representing the county in the state senate and both of these resolutions were unanimously adopted. , Senator Ferguson introduced following resolutions Whereas, the voters of Ap pomattox county are happy to have with us to-day, Governor Byrd, who will explain to the voters of. our county, the consti tutional amendments, to be voted on at the special election, to be held on June 19. Now, Therefore, Be It Re solved That we commend the fair and forceful campaign our governor is making, for which too much praise and commenda tion cannot be given. His high character and ability has reflected itself in his splendid administra tion. In a word, he has proven himself to be a great Virginian, and a matchless leader. Be it further resolved That we are in thorough accord with the far-sighted, broad-minded progessive and economic policies which he has advocated, and which have been written into the law of our state, which now stands in the front rank of the Union. Delegates to the Roanoke con vention were chosen from the various precincts as follows and the report of the nominating committee was adopted without a dissenting vote Courthouse S. L. Ferguson, R.L. Burke, H. W. McKinney J. A. Bingham, Charles F. Han- enkrat, W. F. Woolf oik, H. L. Spencer, B. W. Babcock, L. F. Ferguson, S. L. Ferguson, Jr., C. T. Moses, N. A. Wagers, W L. Brown, E LeRoy Smith, W L. Ould, J. E. Sears, N. B Featherston, Don Moses, H. G Johnson, C. T. Evans, D. A Connor, H. 8. Coleman, W W Woodson. R. F. J amer son."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "E. Sears, N. B <mark>Featherston</mark>, Don Moses, H. G"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "E. Sears, N. B <mark>Featherston</mark>, Don Moses, H. G"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "K. Hannah, N. R. <mark>Featherston</mark> and J. A. Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "K. Hannah, N. R. <mark>Featherston</mark> and J. A. Burke."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.54, 1134.37, 1766.08, 1372.87], "bbox_id": "eb202019d5", "file": "AppomattoxNewspapers_1943-1947a_0292.pdf", "page": 1, "text": "Sgt. and Mrs. J. B. Terry are on a visit to relatives in Mary land. Misses Emily and Patty Feather- ston and N. Ragland Featherston were dinner guests of Mrs. H. M. Marshall Sunday. The home demonstration club met with Mrs. Edwin Fore last .veek. Mrs. B. G. Anderson demon- trated yeast breads. Mrs. Edith Hix and Fan have aoved to Richmond. Fan entered WestVamptcT. College. They are .really missed in the community. Mrs. J.B. Carson and John spent f i week-end with her parents,Mr. ind Mrs. J. R Marshall. Uriel arson has been dischar Ted from the Navy and is now at Nome. His mothers condtion is un changed."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "ston and N. Ragland <mark>Featherston</mark> were dinner guests of"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "ston and N. Ragland <mark>Featherston</mark> were dinner guests of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.85, 330.93, 1840.25, 580.27], "bbox_id": "81b36c223c", "file": "AppomattoxNewspapers_1926-1933a_0389.pdf", "page": 1, "text": "served and enjoyed by all present. Big Ruff Creek was higher than it has been for quite a while. Considerable damage was donefeed washed away hog fences, grindstones and various other things. Claiborne Inge is better af ter having a very bad cold. Mr. Charles Dickerson drop-  . w. . I v u a x ic o L iu I1111 Grey Sears, ped dead Monday, A good ares Crawley, Charles man has gone to his reward. James, Ethel Alvis, Gertrude Stewart, Lottie Lucado, Thel ma Gunter, Frances Coleman, Thelma Dinkins, Gladys Inge, Mary Featherston, Annie Gil bert, Alfred Harwood 2nd yearEvelyn Dicker-"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "Dinkins, Gladys Inge, Mary <mark>Featherston</mark>, Annie Gil bert, Alfred"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "Dinkins, Gladys Inge, Mary <mark>Featherston</mark>, Annie Gil bert, Alfred"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.27, 733.03, 1807.37, 903.58], "bbox_id": "8d70d169ab", "file": "AppomattoxNewspapers_1933-1936a_0313.pdf", "page": 1, "text": ".school patrons. Mr. and Mrs. W P Phelps, Mr. and Mrs, O. W. Martin and son, Doyle are among those who attended the state fair in Richmond last week. N. R. Featherston was a visitor in Oakville Monday. Mrs. T. J, Gardner has returned nome after a visit to relatives in Newport News. Mr. and Mrs. Len Martin ana amily. were B unday guests of Mrs. rtr.ymond Martin. Guests of Mrs. Clarence Moore Saturday night were Misses Pauline tnd Marie Crews, Virginia Moore, Raymond Hamilton and Harry . helps."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "last week. N. R. <mark>Featherston</mark> was a visitor in"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "last week. N. R. <mark>Featherston</mark> was a visitor in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.38, 617.58, 1548.76, 647.38], "bbox_id": "0eb6b46e21", "file": "AppomattoxNewspapers_1915-1918a_0043.pdf", "page": 1, "text": "school ornoBtts. Featherston, Supt. ox 8.  Hamilton, Evergreen"}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "school ornoBtts. <mark>Featherston</mark>, Supt. ox 8.  Hamilton, Evergreen"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "school ornoBtts. <mark>Featherston</mark>, Supt. ox 8.  Hamilton, Evergreen"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.92, 626.18, 1733.68, 673.78], "bbox_id": "d2c7b1b683", "file": "AppomattoxNewspapers_1915-1918a_0023.pdf", "page": 1, "text": "SCHOOL OFFIOHHS. Featherston, Supt., Vera J . C Eppomattox S. J. Lee, Appomattox Hamilton, Kyergreen Joel V atkins F . Uicxerson, Appom attox J . W ti,Appom attox u k .L ew is,verajp la tte n tio n o f th e d e a r people ipuut spring. J. O, Davidson, A ppo-I r ."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFIOHHS. <mark>Featherston</mark>, Supt., Vera J . C"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFIOHHS. <mark>Featherston</mark>, Supt., Vera J . C"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1419.29, 613.63, 1562.88, 678.53], "bbox_id": "e4c7385e16", "file": "AppomattoxNewspapers_1915-1918a_0364.pdf", "page": 1, "text": "SCHOOL OFFICERS N. R. Featherston, Supt.,_Vera A T. iiige, Appomattox J. R. Evergreen P. W. Coleman, Pamplin j T. Ligón, Pamplin C. E. Lewis, Vere J. P- Alvis, Spout Spring j . 0. Davidson, Anwmattox F. . Obrien, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS N. R. <mark>Featherston</mark>, Supt.,_Vera A T. iiige,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS N. R. <mark>Featherston</mark>, Supt.,_Vera A T. iiige,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.98, 696.45, 1627.86, 762.35], "bbox_id": "7731f320bc", "file": "AppomattoxNewspapers_1915-1918a_0490.pdf", "page": 1, "text": "SCHOOL OFFICERS. N. B. Featherston, Supt. Vera A. I luxe, Appomattox J. It. Hamilton, Evergreen P. W. Coleman, Pamplin i x, i.igon, Pamplin C. E. Lewis, Vers J P- Alvis, Spout Spring J. 0, Davidson, Appomattox F. A Obrien, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS. N. B. <mark>Featherston</mark>, Supt. Vera A. I"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS. N. B. <mark>Featherston</mark>, Supt. Vera A. I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1461.59, 675.75, 1587.46, 739.66], "bbox_id": "14106ef40b", "file": "AppomattoxNewspapers_1915-1918a_0412.pdf", "page": 1, "text": "SCHOOL OFFICERS N, B. Featherston, Supt., V era A lore, Appomattox J. R. Hamilton, rpeen F. W. Coleman, Pam plin T Ligon, Pamplin C. E. Lewis, en J. F. Alvis, Spout Spring J .  Davidson, Appomattox F . A. Ohrien, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS N, B. <mark>Featherston</mark>, Supt., V era A"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS N, B. <mark>Featherston</mark>, Supt., V era A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.79, 682.07, 1525.79, 747.82], "bbox_id": "7d679dfc20", "file": "AppomattoxNewspapers_1915-1918a_0392.pdf", "page": 1, "text": "SCHOOL OFFICERS I, Featherston, Supt, Vera A. J imattox J. R. Hamilton, , W. Coleman, Pamplin Ugon, Pamplin a E. Lewis, j, p. Airis, Spout Spring d. ridion, Appomattox i A. Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS I, <mark>Featherston</mark>, Supt, Vera A. J"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS I, <mark>Featherston</mark>, Supt, Vera A. J"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.75, 673.91, 1534.8, 737.61], "bbox_id": "fb4fb3cdde", "file": "AppomattoxNewspapers_1915-1918a_0388.pdf", "page": 1, "text": "SCHOOL OFFICERS g, featherston, Sunt, Vera A .Appomattox J.R . Hamilton, men?. W. Coleman, Pamplin U h l Pamplin C. E. Lewis,  I V . Alvis, Spout Spring J. Wdson, Appomattox F. A. Appomattox."}, "highlight": {"text": {"matched_tokens": ["featherston"], "snippet": "SCHOOL OFFICERS g, <mark>featherston</mark>, Sunt, Vera A .Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["featherston"], "snippet": "SCHOOL OFFICERS g, <mark>featherston</mark>, Sunt, Vera A .Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.5, 615.44, 1527.02, 679.89], "bbox_id": "4135df83de", "file": "AppomattoxNewspapers_1915-1918a_0344.pdf", "page": 1, "text": "SCHOOL OFFICERS  R. Featherston, Supt., Vera A.   Appomattox J. R. Hamilton, anoeea-P. W. Coleman, Farnplm ft Limn, Famplin C. E. Lewis, L. j, p. Alvis, Spout Spring j . Ibiridwn, Appomattox F. A. , Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS  R. <mark>Featherston</mark>, Supt., Vera A.   Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS  R. <mark>Featherston</mark>, Supt., Vera A.   Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1395.84, 839.57, 1525.39, 907.17], "bbox_id": "4e785eec77", "file": "AppomattoxNewspapers_1918-1922a_0018.pdf", "page": 1, "text": "SCHOOL OFFICERS  N, R. Featherston, Supt., Vera A tinge, Appomattox J. R. Hamilton, tagreen P. W. Coleman, Pamplin , i, Ugon, Famplin C. E. Bewis, era J. P. Alvis, Spout Spring d. I Davidson, Appomattox F. A. iprien, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS  N, R. <mark>Featherston</mark>, Supt., Vera A tinge,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston"], "snippet": "SCHOOL OFFICERS  N, R. <mark>Featherston</mark>, Supt., Vera A tinge,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1324.29, 680.95, 1528.04, 709.72], "bbox_id": "50a5ac2f94", "file": "AppomattoxNewspapers_1912-1915a_0387.pdf", "page": 1, "text": "SCHOOL OFFICE US.  featherston, supt., Vera j..cland Petersburg. . Aboomattoxs . J. Lee, A p p o m atto x ! v ----- HfitBSi  ----"}, "highlight": {"text": {"matched_tokens": ["featherston"], "snippet": "SCHOOL OFFICE US.  <mark>featherston</mark>, supt., Vera j..cland Petersburg. . Aboomattoxs . J. Lee, A p p o m atto x ! v ----- HfitBSi  ----"}}, "highlights": [{"field": "text", "matched_tokens": ["featherston"], "snippet": "SCHOOL OFFICE US.  <mark>featherston</mark>, supt., Vera j..cland Petersburg. . Aboomattoxs . J. Lee, A p p o m atto x ! v ----- HfitBSi  ----"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
