{"document": {"bbox": [475.19, 1636.03, 593.34, 1713.43], "bbox_id": "35ff677a26", "file": "AppomattoxNewspapers_1952-1954a_0123.pdf", "page": 1, "text": "W aunders, Elijah lor Saunders, Floyd ie Saunders, Richard foe Frank Saunders, if not, then their widow  er and heirs, if any, and whereabouts are are hereby required"}, "highlight": {"text": {"matched_tokens": ["Saunders", "Saunders", "Frank", "Saunders"], "snippet": "W aunders, Elijah lor <mark>Saunders</mark>, Floyd ie <mark>Saunders</mark>, Richard foe <mark>Frank</mark> <mark>Saunders</mark>, if not, then their widow  er and heirs, if any, and whereabouts are are hereby required"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Saunders", "Frank", "Saunders"], "snippet": "W aunders, Elijah lor <mark>Saunders</mark>, Floyd ie <mark>Saunders</mark>, Richard foe <mark>Frank</mark> <mark>Saunders</mark>, if not, then their widow  er and heirs, if any, and whereabouts are are hereby required"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [918.51, 583.02, 1087.75, 815.27], "bbox_id": "c05398946f", "file": "AppomattoxNewspapers_1952-1954a_0106.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 14th day of October, 1952. Peter Allen Saunders, Complainant vs Dorcus Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robert son, The Unknown Heirs at law of Washington Saunders, George Saun ders, Mary Lou Saunders, Jesse Saunders, Jennie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders, Joe Frank Saunders, Robert Riley, Will iams Robertson, Daisy Liters, Dorcas Jean Lucas, William Lucas and W. M. Abbitt Gdn. ad Litem. Defendants. The object of this suit is to have j partition of a tract of 77 Ms acres of land near Hixburg, which was con"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Joe <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Joe <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [408.51, 1193.57, 588.36, 1773.68], "bbox_id": "85c2a8a09f", "file": "AppomattoxNewspapers_1952-1954a_0111.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 1 1th day of October, 1952. Peter Allen Saunders, Complainant vs Dorcus Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robert son, The Unknown Heirs at law of Washington Saunders, George Saun ders, Mary Lou Saunders, Jesse Saunders, Jennie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders, Jo Frank Saunders, Robert Riley, Will iams Robertson, Daisy Lucas, Dorcas Jean Lucas, William Lucas and W M. Abbitt tidn. ad Litem. Defendants. The object of this suit is to have partition of a tract of 77 Va acres of land near Hixburg, which was con veyed to Peter Allen Saunders and Others,by F.A. Biglow, and also of a tract of 47 acres adjacent thereto, of which Washington Saunders died seized, by one of the modes prescrib ed by law. And it appearing by affidavit fil ed that Dorcas Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robertson, Robert Riley in his own right and as Guardian of William Robertson, Williams Robertson, Dai sy Lucas, Dorcas Jean Lucas, Will iam Lucas, are not residents of Virginia, and the Unknown Heirs at law of Washington Saunders, deceas ed, whose names and whereabouts, if any, are unknown, who are sup posed to be George Saunders, Mary Lou Saunders, Jesse Saunders, Jen nie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders and Joe Frank Saunders, if living, and if not, then their widow and husbands, and heirs, if any, whose names and whereabouts are unknown, they are hereby required to appear within ten days after the due publication of this order and dp what is necessary to protect their interests. C. W. Smith, Clerk. George Abbitt, Jr., p. q. 10-23-4tc"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Jo <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Jo <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [435.43, 1259.28, 2128.39, 1440.51], "bbox_id": "26136928b6", "file": "AppomattoxNewspapers_1952-1954a_0118.pdf", "page": 1, "text": "VERA PTA Dorcus Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robert son, The Unknown Heirs at law of Washington Saunders, George Saun- ders, Mary Lou Saunders, Jesse Saunders, Jennie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders, Joe Frank Saunders, Robert Riley, Will iams Robertson, Daisy Lucas, Dorcas Jean Lucas, William Lucas and W. M. Abbitt Gtin. ad Litem. Defendants. The object of this suit is to have partition of a tract of 77  acres of land near Hixburg, which was con-"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Joe <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Saunders, Richard Saunders, Joe <mark>Frank</mark> <mark>Saunders</mark>, Robert Riley, Will iams"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [918.95, 834.53, 1086.51, 1160.37], "bbox_id": "de317ac4e7", "file": "AppomattoxNewspapers_1952-1954a_0106.pdf", "page": 1, "text": "tract of 47 acres adjacent thereto, of which Washington Saunders died seized, by one of the modes prescrib ed by law. And it appearing by affidavit fil ed that Dorcas Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robertson, Robert Riley in his own right and as Guardian of William Robertson, Williams Robertson, Dai sy Lucas, Dorcas Jean Lucas, Will iam Lucas, are not residents of Virginia, and the Unknown Heirs at law of Washington Saunders, deceas ed, whose names and whereabouts, II gnv arp tmlrnmim __ c uuMivwH, vno are sup posed to be George Saunders, Mary Lou Saunders, Jesse Saunders, Jen nie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders and Joe Frank Saunders, if living, and if not, then their widow and husbands, and heirs, if any whose names and v,hereabouts are unknown, thev are herehy required to appear within ten days after the due publication of this order and d- what is necessary to protect their interests. C. W. Smith, Clerk. George Abbitt, Jr., p. q. 10-23-4tc"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Richard Saunders and Joe <mark>Frank</mark> <mark>Saunders</mark>, if living, and if"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Richard Saunders and Joe <mark>Frank</mark> <mark>Saunders</mark>, if living, and if"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [505.2, 954.94, 672.22, 1741.59], "bbox_id": "9a6a3dbf82", "file": "AppomattoxNewspapers_1952-1954a_0177.pdf", "page": 1, "text": "Peter Allen Saim.de.rs ............ Plaintifl vs. Dorcus Jean Lucas  Others Defendants TO Peter Allen Saunders, Dorcus Jean Lucas, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robertson, The Unknown Heirs at Law of Washing ton Saunders, deceased, who are made parties defendat by the general de scription of Parties Unknown, and George Saunders, Mary Lou Saun ders, Jessie Saunders, Jennie S. Mayo, Willie Saunders, Elijah Saun ders, Mador Saunders Floyd Saun ders, Callie Saunders, Richard Saun ders, and Joe Frank Saunders, il they be living, or if they are dead, then the widow or widower and heirs, devisees and successors in title of the said Mary Lou Robertson, George Saunders, Mary Lou Saunders, Jessie Saunders, Jennie S. Wiiyo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders, and Joe Frank Saunders, Robert Riley in his own right and as guardian for Wil liams Robertson, Daisy Lucas, a minor, and William Lucas, a minor. Dorcus Jean Lucas a minor, and W. M. Abbitt Gdn. ad litem for Parties Unknown, and for Williams Robertson, Daisy Lucas, Dorcus Jean Lucas and William Lucas, Plaintiff and Defendant, in the above styled suit. You are hereby notified that I have fixed on Saturday, January 31st, 1953, at 1000 a. m. as the time and my office at Appomattox Court House Virginia, as the place for tak ing the several accounts ordered by decree of the Cirucit Court of Appo mattox, in the above styled suit at the December Term, 1952 as foi lows 1. Who are the owners of the real property described in the Bill of Complaint filed in this cause. 2. What liens are against the pro perty, their priorities, and by whom held. 3. What is the fee simple and an nual value of the real property. 4. Whether the real property de scribed in the Bill of Complaint filed in this cause is susceptible of parti tion in kind amongst the owners in any of the modes prescribed by law, and if not 5. Whether any of the owners is willing to take the whole property and pay to the others such sums of money as their interests may entitle them to and if not 6. Whether the interest of those who are entitled to the subject or its proceeds will be promoted by a sale of the entire subject and divi sion of the proceeds and if so- 7. Whether the proper parties are before the court in this cause to enable the court to effect such sale. 8. Any other matter, specially stated, which the Commissioner may deem pertinent or which any party may request to be so stated. Given under my hand this 14th day of January, 1953."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Saun ders, and Joe <mark>Frank</mark> <mark>Saunders</mark>, il they be living,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Saun ders, and Joe <mark>Frank</mark> <mark>Saunders</mark>, il they be living,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [432.79, 1613.67, 602.23, 1790.84], "bbox_id": "a39c9abc78", "file": "AppomattoxNewspapers_1952-1954a_0118.pdf", "page": 1, "text": "if any, are unknown, who are sup posed to be George Saunders, Mary Lou Saunders, Jesse Saunders, Jen nie S. Mayo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders and Joe Frank Saunders, if living, and if not, then their widow and husbands, and heirs, if any, whose names and whereabouts are unknown, they are hereby required to appear within ten days after the due publication of this order and dp what is necessary to protect their Interests. C. W. Smith, Clerk. George Abbitt, Jr., p. !  10-23-4tc"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Richard Saunders and Joe <mark>Frank</mark> <mark>Saunders</mark>, if living, and if"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Richard Saunders and Joe <mark>Frank</mark> <mark>Saunders</mark>, if living, and if"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [756.5, 838.38, 916.2, 1131.97], "bbox_id": "688e1f32ed", "file": "AppomattoxNewspapers_1898-1902a_0283.pdf", "page": 1, "text": "Fores Store We have had much sickness and some deaths among us since you last heard from this place. Our siucere sympathy goes out to the bereaved family of Mr. Sylvester Beasley in the loss of their dear little infant, 18 mouths of age, which was buried near this place ou Friday last. May they so live that, when called away by our Heavenly Father, they may be with the dear little one evermore. Messrs. E. P. Fore and A. C. Beasley last week visited Farmville ou business. Rev. Mr. Underwood preached a beautiful sermon at the Gold-Hill schoolhouse on Sunday evening last to quite a large congregation, after uotice had been given that he was not coming. A good many were dis appointed, and did not attend. We hope we mgy all go to hear him ou the first Sunday in J line, at 3 P. u. Mr. Frank Saunders passed thro this place to-day on business. Miss Etta V. Fore expects to visit iu the near future frieuds aud rela tives in Lynchburg, Concord, etc."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "3 P. u. Mr. <mark>Frank</mark> <mark>Saunders</mark> passed thro this place"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "3 P. u. Mr. <mark>Frank</mark> <mark>Saunders</mark> passed thro this place"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1864.8, 993.6, 2035.7, 1763.39], "bbox_id": "4f89d715be", "file": "AppomattoxNewspapers_1952-1954a_0179.pdf", "page": 1, "text": "Dorcus Jean Lucas  Others Defendants TOPeter Allen Saunders, Dorcus Jean Lucan, William Lucas, Minnie Willie Smith, Mattie Mitchell, Floyd Saunders, Mary Lou Robertson, The Unknown Heirs at Law of Washing ton Saunders, deceased, who are made parties defendat by the general de scription of Parties Unknown, and George Saunders, Mary Lou Saun ders, Jessie Saunders, Jennie S Mayo, Willie Saunders, Elijah Saun ders, Mador Saunders Floyd Saun ders, Callie Saunders, Richard Saun ders, and Joe Frank Saunders, if they be living, or if they are dead then the widow or widower and heirs devisees and successors in title of the said Mary Lou Robertson, George Saunders, Mary Lou Saunders, Jessie Saunders, Jennie S. Vyo, Willie Saunders, Elijah Saunders, Mador Saunders, Floyd Saunders, Callie Saunders, Richard Saunders, and Joe Frank Saunders, Robert Riley in his own right and as guardian for Wil liams Robertson, Daisy Lucas, a minor, and William Lucas, a minor. Dorcus Jean Lucas, a minor, and W. M. Abbitt Gdn. ad litem for Parties Unknown, and for Williams Robertson, Daisy Lucas, Dorcus Jean Lucas and William Lucas, Plaintiff and Defendant, in the above styled suit. You are hereby notified that I have fixed on Saturday, January 31st, 1953, at 1000 a. m. as the time and my office at Appomattox Court House Virginia, as the place for tak ing the several accounts ordered by decree of the Cirucit Court of Appo mattox, in the above styled suit at the December Term, 1952 as fol lows 1. Who are the owners of the real property described in the Bill of Complaint filed in this cause. 2. What liens are against the pro perty, their priofities, and by whom held. 3. What is the fee simple and an nual value of the real property. 4. Whether the real property de scribed in the Bill of Complaint filed in this cause is susceptible of parti tion in kind amongst the owners in any of the modes prescribed by law, and if not 6. Whether any of the owners is willing to take the whole property and pay to the others such sums of money as their interests may entitle them to and if not 6. Whether the interest of those who are entitled to the subject or its proceeds will be promoted by a sale of the entire subject and divi sion of the proceeds and if so 7. Whether the proper parties are before the court in this cause to enable the court to effect such sale. 8. Any other matter, specially stated, which the Commissioner may deem pertinent or which any party may request to be so stated. Given under my band this 14th day of January, 1953."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Saun ders, and Joe <mark>Frank</mark> <mark>Saunders</mark>, if they be living,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Saun ders, and Joe <mark>Frank</mark> <mark>Saunders</mark>, if they be living,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1770.95, 255.0, 1945.55, 1328.61], "bbox_id": "c1ee1e30f4", "file": "AppomattoxNewspapers_1892-1898a_0169.pdf", "page": 1, "text": "B y W m . W. L ong . To-jpay brings back that other summers beau ty. When we two roamed amid its bloom togeth er, frhere roses grew in rich and rare perfume, Amid the green and purple heather. Oh, perfect daysa memory now, Oh, glorious sun-kissed summer days, When hand-in hand we wandered down The cool, green, winding woodland ways. - .0 p ? Your pure and teridOltrustlng soul. Lay for a little seasou in my lifo You were all light and love to me, Amid earths dark and bitter strife. Ah! love, if we together might haye went Through all lifes way in loves fond state- Earth would have been a perfect dwelling place. Had destiny but been compassionate. Our love is high as hbaven, deep as the sea, Set to the harmony of loves sweet tune Pure as wiite lilies of the woodland vale, Fragrant as roses of radiant June. Steadfast as stars in skies of summer blue. Tender as twilight when the night is near And all the air with fragrant bloom is blent, When summer lays her jewels on the year, And though deadsummers lie between Your perfect life and life of mine Yet ever shall I backward yearning turn. To worship at your holy shrine. C oncord N ews. A meeting was held at Whartons Hall last Saturday, the 4th iust. of the patrons of this place, and other persons interested in the cause of education, to confer with the county Superintendent, and the trustees istburg District looking to the establishment of a good Graded School at this place. Most all of the supplement was subscribed on that day, and we hope this much needed institution is an assured fact. Appomattox C. Si., Spout Springs, Pamplin City, and Lynchburg were all well represented at the entertain ment at Whartons Hall last Thurs day evening. Mr John W. Dickey, one of our most worthy farmers, had two cows killed by lightning in the storms of last week.  Mr. T. H. Fisher, while returning from Mt. Vernon church last Sun day was thrown from his buggy, sustaining very painful, but not serious injuries about his face and head. Rev. Wm. Fisher left yesterday to attend the Strawberry Association, at Montvale, Bedford Co. Rev. Mr. Woodson, assisted by Rev. Mr. Royall, of Appomattox, has just closed a very interesting series of meetings at Mt. Vernon Baptist Church. Rev. Mr. Hildrup began a series of meetings at Salem church last Sunday night. He will be assisted during this week by Rev. L. B. Betty of Lynchburg. Frank Saunders, a very worthy colored man died of dropsy of the head here Sunday Morning at 11 oclock. The Concord Debating Club will discuss at its next meeting Wednes day evening, Resolved, That the Teacher has more influence in form ing character than the preacher, Miss L. B. Pankey, of Pamplin City, was visiting Mrs. Dr. Robertson, near Spout Springs last,week. Miss Lena Collins and Miss Davis, both of Lynehburg are at Mr. H Clay Shearers near Spout Springs, Precinct elected,last Saturday, Mr R. W. Stratton as delegate to the Roanoke Convention, and Mr. B. II. Babcock as alternate. Both are favor able to the candidacy of Maj. Peter J. Otey. Col, Ro. B. Poore was in our town for a few hours last Saturday. August j, 1894. Q uidnunc ."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "B. Betty of Lynchburg. <mark>Frank</mark> <mark>Saunders</mark>, a very worthy colored"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "B. Betty of Lynchburg. <mark>Frank</mark> <mark>Saunders</mark>, a very worthy colored"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [785.99, 1085.44, 947.6, 1504.99], "bbox_id": "d39ec52532", "file": "AppomattoxNewspapers_1898-1902a_0457.pdf", "page": 1, "text": "Appomattox High School, Roll of honor for 5th month end ing March 4th, 1901.Lucy Flesh- man, Cleveland Inge, Mattie Flesh- man, Ethel Fleshman, Evant Hun ter, Fred Drinkard, Harry Han-1 cock, Eula M Burke, Mary Hancock, Mary L. Browning, Bessie Coleman, Rebecca Purdum, Hattie Drinkard, Nannie Abbitt, Helen Gregory, Henry Gills, Lula G. Irby, Mary Irby, Wallace Gilliam, Harry Gil liam, She don Ferguson, Robert Ferguson, Bettie Burke, aud Melvin Worley. Requirements 95 per cent on general average for the mouth. Prof. Fisher has arranged to have a course of lectures to be delivered before the students of the high- school during the remainder of this session. The series will include lec tures by Hon. H. D. Blood, Dr. Geo. B. Taylor, Dr. Julian H. Abb.tt, aud Messrs. Samuel Bergu son, Frank Saunders and J. P. L. Bleshmau. The first of the series was delivered at the high school building Briday afternoon, 15th inst. at 230 p. m. by Mr. Samuel Bergusou, hia sub ject being state government. Pin other lectures will be regularly an nounced, aud will be open to pa trons and the public. J. G. F ish er , Principal."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Messrs. Samuel Bergu son, <mark>Frank</mark> <mark>Saunders</mark> and J. P. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Messrs. Samuel Bergu son, <mark>Frank</mark> <mark>Saunders</mark> and J. P. L."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [676.32, 244.72, 840.69, 721.99], "bbox_id": "c80a51aff6", "file": "AppomattoxNewspapers_1898-1902a_0538.pdf", "page": 1, "text": "the home of Mise Martha T. Jones one gold opera chain, 75  one pair of spectacles, 3 one silver ladle, 3 one crepe shawl, 100, two silk skirts, 10 one dress, 3 three summer dresses, and other article--, including 13 in money. Captain Camm Patteson was not well enough expects to be term. Mr. Frank T. Saunders was too nwell to attend court. White-Hall will more than sus tain her reputation this year as a sumac market. We understand that Mr. H. M. White, the enterprising manager of the White-Hall Co., has secured contracts for 150 car-loads. This will bring a good deal of cash to ihose of our people who will take the trouble to put in a little spare time to save the sumac crop. This compauy has been for several years the largest dealer iu sumac in the Ftate, and this is perhaps the largest contract for sumac ever made in the State. The comanys advertisement will appear jn his paper next week. The annual tabernacle meeting at White-Hall will begin next Sunday, the 18th, and continue for ten days. Revs. J. W. Stiff and B. O. James will preach. Big preparations are being mace at White Hall to handle the tobacco crop, which is very promising. There is a new postoliice estab lished m Buckingham, known as Brownatlvn. T he T im e s already has two subscribers there. Buckingham corespondent of the Richmond Dispatch The Conuty Board of Health met at Arvouia last week. Dr. J. Burton Nowlin was electd Secretary, vice Dr. W E. Pratt, deceased."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "to be term. Mr. <mark>Frank</mark> T. <mark>Saunders</mark> was too nwell to"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "to be term. Mr. <mark>Frank</mark> T. <mark>Saunders</mark> was too nwell to"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [761.29, 293.47, 916.95, 615.25], "bbox_id": "cd01f634be", "file": "AppomattoxNewspapers_1898-1902a_0628.pdf", "page": 1, "text": "Pam plin City. MrrThonia8 H ix, who lives about two miles north of Prospect, had the misfortuue to lose by fire, before daylight on Saturday morning last, Ins dwelling and all of its contents except a few beds and some wearing apparel. There was an insurance of 1,000 on the property estimated value of property lost, 3,000. Mr. George D . Saunders died at Burkeville last Saturday morning, and was buried in the cemetery of he Methodist church at Prospect on Sunday evening. He was eighty- seven years of age, and left a large number of childrenamong them Mr. Frank T . Saunders, well known iu your vicinity. Mr. Saunders had been twice married. His first wife was a Miss Jones, daughter of Wm. A. Jones. His second wife was Miss Withers, a sister of Colonel Robert E. Withers, of Wytheville. Dr. Walker was called a few days ago to see Mr. Monroe Dicker, on, and pronounced his disease, small pox. A little boy of Mr. Hunter Davis, aged six years, had his leg broken on Monday in a playful scuffle with one of his brothers."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "of childrenamong them Mr. <mark>Frank</mark> T . <mark>Saunders</mark>, well known iu your"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "of childrenamong them Mr. <mark>Frank</mark> T . <mark>Saunders</mark>, well known iu your"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [451.89, 380.25, 750.44, 476.79], "bbox_id": "dc88be199e", "file": "TimesVirginian_1981a_0067.pdf", "page": 1, "text": "MEMBERS OF THE JAZZ EXPRESS are front row, left to right - Dean Hamiiton, Allen Smith and Sylvester Watkins. Back row, Keith Leonard, Timmy Lawson, Bruce Saunders, Mr. Frank Coffey, director, J. C. Rogers, Kevin Jaggers and David Coffey. Members not pictured are Richard Baxter, and James Bohannon, Jr. Jazz concert set for"}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "Leonard, Timmy Lawson, Bruce <mark>Saunders</mark>, Mr. <mark>Frank</mark> Coffey, director, J. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "Leonard, Timmy Lawson, Bruce <mark>Saunders</mark>, Mr. <mark>Frank</mark> Coffey, director, J. C."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [413.99, 1280.08, 576.94, 1395.18], "bbox_id": "69dd872b5a", "file": "AppomattoxNewspapers_1952-1954a_0123.pdf", "page": 1, "text": "Marv Lou Robert- son, l ho l uh town heirs at law of  ashi itou Hinders, George Saun- dors, Alary l uii Saunders, Jesse Säumt iis, Jon nic S. Mayo, Willie Sauna ors, Kli. ah Saunders, Mador Saunders, Fkyd Saunders, Callie Salimi ors, K chard Saunders, Joe Frank Saumio s, Robert Riley, Will- iams ltobo riso 1 , Oaisv Lucas, Dorcas Jean .uvas, William Lucas and W. Al. Al ibitt tii ii. ad Litem."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "Salimi ors, K chard <mark>Saunders</mark>, Joe <mark>Frank</mark> Saumio s, Robert Riley,"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "Salimi ors, K chard <mark>Saunders</mark>, Joe <mark>Frank</mark> Saumio s, Robert Riley,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [158.9, 233.37, 305.67, 623.94], "bbox_id": "484d3706fe", "file": "TimesVirginian_1981a_0138.pdf", "page": 1, "text": "M. E. Gene Saunders Meredith Eugene Gene Saunders, 65, of 401 Grove Si., died at 335 a.m. today at Medical Care Center. His wüte is Virginia Tabor Saunders. Born in Lynchburg, he was a son of the late Pierce Eugene Saunders and Ethel Bussinger Saunders. He was a retired supervisor for Pilot Freight Carriers, a member of Bethlem United Methodist Church, Concord, past member of official board of Bethlehem United Methodist Church and. past president of Lynchburg CB Club. In addition to his wife, he is survived by a daughter, Mrs. Sandra S. Goin of Concord a stepdaughter, Hilda M. Vau ghan of Rifle, Colo. two .brothers, Frank W. Saunders and Roy L. Saunders, both of Lynchburg two sisters, Mrs. Virginia S. Governor and Mrs. Rüth S. White, both of Lynchburg, and seven grand children. Funeral services were con ducted at 3 p.m. Monday at Whitten Park Avenue Chapel. Entombment was in Fort Hill Memorial Park mausoleum. Whitten Park Avenue Fune ral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders", "Saunders"], "snippet": "Rifle, Colo. two .brothers, <mark>Frank</mark> W. <mark>Saunders</mark> and Roy L. <mark>Saunders</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders", "Saunders"], "snippet": "Rifle, Colo. two .brothers, <mark>Frank</mark> W. <mark>Saunders</mark> and Roy L. <mark>Saunders</mark>,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [380.9, 1461.21, 1611.2, 1699.09], "bbox_id": "8db9708d4a", "file": "AppomattoxNewspapers_1955-1957a_0026.pdf", "page": 1, "text": "barver-P High School rice Ferguson, Charles, co David Ferguson ............ Austin, Erman .............................. Beasley, John H.  Geo. H. ... Crump, M-argie, Annie  Children eo L. Carey, Attorney ----- Davis, Eliz. co Virginia Dicks ................ Johnson, Alice Alice Green co Massie Stevens .............. Jones, Ashby B .............................. Lee, John .................................... Megginson, Norman co Mary R. Randolph........... Moore, Henry .............................. Pennix, Eugene .......................... Preston, Laurence T.  Estelle . Preston, Laurence T.  Estelle . Robertson, Lucy co Susie E. Davis ............... Saunders, John L .......................... Woodson, Frank .........................."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "co Susie E. Davis ............... <mark>Saunders</mark>, John L .......................... Woodson, <mark>Frank</mark> .........................."}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "co Susie E. Davis ............... <mark>Saunders</mark>, John L .......................... Woodson, <mark>Frank</mark> .........................."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1906.03, 343.14, 2081.97, 1734.36], "bbox_id": "ff9c0741a5", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "I 679 Robert I Pamplin I 680 Henry I Vera 681 W illie Jordan Kidd,Pam plin 682 Robert Letcher Walker. Pamplin 683 Shirley Walker, Pamplin 684 Samuel Daniel, Pamplin 685 Clifton Woolridge, Pam plin 686 Poindexter Goode, Vera 687 Wm. Spencer Hix, Pam plin 688 Wm. Robt. Allen, Appo mattox 689 Sami Saunders,  ppo- mattox r-f d 2 690 John Baker, Vera ! 691. Joe Lee Jones, Vera 692 Clarence Jones, Vera 693 Wiley Jones, Pamplin 694 Napson Matthews, Pam- lin 695 Berry Walker,Fores Store 696 John Dillard, Pamplin 697 John Brandon, Prospect 698 Rogers Brock, Pamplin 699 Robert Biglhw, Pamplin 700 Louis Vanderbilt David son, Pamplin 1 701 Willie Joseph Walker, Pamplin  702 James Johnson, Pamplin I 703 Washington Jones,Pamp lin 704 Fountain Thornton, Vera 705 Floyd Webb, Vera j 706 A le x a n d e r Patterson, Pamplin  707 Floyd Manuel Walker, ! Pamplin 708 John Ligon, Pamplin 709 Robert Henry Lee, Pamp lin 710 John Henderson Walker, Pamplin j 711 Edgar Brown, Pamplin 712 Raymond Walker, Veia 713 John Edward Gilliam, Pampin 714 James G a r y Gilliam, Pamplin 715 James Lyman Walker, Pamplin 716 Frank Webb, Vera 717 Arthur Saunders, Vera 718 James Jones, Yra 719 Floyd Saunders, Vera 720 G e o r g e Washington Saunders, Fores Stère I 721 John Ferguson, Pamplin 722 Wesley Blglosr, Pamplin 723 George Randolph John, son, Vera 724 James Westmore Lamb I kin, Appomattox r f d 1 I 725 Robert EarnestLee,Ever-  green I 726 John Floyd Austin,Spring  Mills 727 James Board Marshall, I Spring Mills 728 Courtney Russell Wood- son, Spout Spring S 729 Atwill Dewitt Spout Spring 730 Jim B o b Ford, Spring 731 John Lloyd Lewis, Appo mattox 732 Joseph Pastor Lee, Appo mattox 733 Clde Sylvester Frank, Appomattox  734 L o y d Everette Nash, Spout Spring 735 David Glover Marsl all, Spout Spring 736 William Ottoway Pente cost, Spring Mills 737 Curtis Everett Martin, Spout Spring 738 James A b n e r Martin,1 Spout Spring 739 Lacy Blassengame Mar tin, Evergreen 740 Walter Witt Woolridge, Evergreen 741 Samuel Tilden Paulett, Evergreen r f d 1 742 Marshall Wilson Pugb, Appomattox r f d 1 743 Clinton Thornhill Oaw- tboru, Evergreen 744 Charles William Knotts, Appomattox 745 Willie Dewitt Harvey,  Evergreen   746 Robert Jefferson Pauiett,  Evergreen  747 John Thomas Wpolridge,  Appomattox r f d 1 748 Early Willis Thornton, I Spout Spring 749 Charles Elw ard Moses,  Spring Mills 750 Jeter Curry Wooldridge,  Evergreen 751 Andrew Lee Mann, Appo- I mattox 752 Randolph Txavie Lee, Ap- I pomattox  753 Albert Herbert Lee, Ap- I pomattox r f d 1 754 Edd Taylor Elder, Red I House 755 Wilbert Lee Elder, Red I House 756 Joseph Henry Marshall, I Red House 757 Emmet Giles kann, Red I House 758 Johnson Wyatt Mann, I Appomattox r f d 1 I 759 William Thomas Nash, I Appomattox r f d 1 760 James Robert Reed, Ap  pomattox  761 Horace Dillard Baker,"}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Lyman Walker, Pamplin 716 <mark>Frank</mark> Webb, Vera 717 Arthur <mark>Saunders</mark>, Vera 718 James Jones,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Lyman Walker, Pamplin 716 <mark>Frank</mark> Webb, Vera 717 Arthur <mark>Saunders</mark>, Vera 718 James Jones,"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [521.52, 978.61, 662.13, 1493.53], "bbox_id": "0b21b31540", "file": "AppomattoxNewspapers_1971-1973a_0410.pdf", "page": 1, "text": "Everythings ready for th e Tenth Class Reunion of the AHS Graduating Class of 1962. Everything, that is, except ans wers from several class mem bers. If any of the people listed below are reading this article, or anyone knows how to con tact them, please get in touch with Mr. and Mrs. B a r r y L. Beale, 1710 General Lee Ave nue, Culpeper, Va. 22701. We have less than two weeks before the reunion, and were anxious for as many as possible to at tend. Listed are those class mem bers who have remained silent during the past few weeks Ca rolyn Carter Irving, Robert and Kitty OBrien Clifton, P a t s y F arrar Willis, Nelson Fields, Jr., Richard Fuller, Carole Gil bert Conner, Jean Gunter,Sam uel Inge, Joyce Irby, Helen Lipscomb, Byron Lovell,Harry Mann, Calvin Martin, Clarence Mayberry, Robert Morris, Jr., Mary Mitchell Whitehead, Karl Paulette, Jam es Phelps, Clyde Price, Jam es Price, J o hn ny Ranson, David Repass, Sandra Saunders Goin, C. W. Slayton, Frank Weightman, Linda Wor ley, and Mae Franklin Wooten. Also invited, and encouraged, to attend are those members of this class who did not graduate. Were all excited about seeing the people we attended school with, and getting to meet their f a m i l i e s . Acknowledgements h a v e already been received from several class members who are planning to attend and traveling hundreds of miles to do so. Drop a note to your Class President now so he can put your name on the dinner list."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "Ranson, David Repass, Sandra <mark>Saunders</mark> Goin, C. W. Slayton, <mark>Frank</mark> Weightman, Linda Wor ley,"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "Ranson, David Repass, Sandra <mark>Saunders</mark> Goin, C. W. Slayton, <mark>Frank</mark> Weightman, Linda Wor ley,"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1963.2, 1380.38, 2217.58, 1592.99], "bbox_id": "7523fc57df", "file": "AppomattoxNewspapers_1955-1957a_0009.pdf", "page": 1, "text": "Austin, Erman ......................................... 37 Acres . Beasley, John H.  Geo. H .................. 86 Acres .. Crump, Margie, Annie  Children co L. Carey, Attorney .................. 20 Acres ... Davis, Eliz. .  ,. co Virginia Dicks ................ .. .......... 4-34 Acres Johnson, Alice Alice Green co Massie Stevens .......................... 20 Acres . Jones, Ashby .. ........................................... 1 Acres .. Lee, John ................................................. 4 Acres . ... Megginson, Norman co Mary R. Randolph ...................... 41 Acres . Moore, Henry ...........................................  Pennix, Eugene ........................................ 46 Acres Preston, Laurence T.  Estelle ............ 10 Acres .. Preston, Laurence T.  Estelle ............ 10 Acres . Robertson, Lucy co Susie E. Davis .......................... 3 Acres ... Saunders, John .. ....................................... 56 Acres Woodson, Frank .........................................1.64 Acres . TOWN OF PAMPLIN, COLORED"}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "E. Davis .......................... 3 Acres ... <mark>Saunders</mark>, John .. ....................................... 56 Acres Woodson, <mark>Frank</mark> .........................................1.64 Acres . TOWN OF"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "E. Davis .......................... 3 Acres ... <mark>Saunders</mark>, John .. ....................................... 56 Acres Woodson, <mark>Frank</mark> .........................................1.64 Acres . TOWN OF"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1493.06, 1515.54, 1649.53, 1664.78], "bbox_id": "7aec09ebdc", "file": "AppomattoxNewspapers_1905-1912a_0002.pdf", "page": 1, "text": "Nevada Town Obliterated. Files of the Nevada Transcript of 1860 tell of the visit of a theatrical aompany to the mining town of Red Dog. The company, headed by Mc Kean Buchanan, Virginia Buchanan, Frank Mayo, Charles Wheatleigh and Elizabeth Saunders, all of whim occu py prominent places in the history of the American stage, played three nights in Red Dog to an average busi ness of  1,200 a night. The plays pro duced were  Camille, The Robbers and The Octoroon. To-day not a vestige of a house is to be found or the former site of Red Dog, which was about nine miles from Nevada City."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Kean Buchanan, Virginia Buchanan, <mark>Frank</mark> Mayo, Charles Wheatleigh and Elizabeth <mark>Saunders</mark>, all of whim occu"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Kean Buchanan, Virginia Buchanan, <mark>Frank</mark> Mayo, Charles Wheatleigh and Elizabeth <mark>Saunders</mark>, all of whim occu"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "Mrs-Geo. Myers, Miqs Margaret <mark>Saunders</mark>, Mrs. Lena An derson, Mrs. <mark>Frank</mark> B Busch, Mrs. Alfred"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "Mrs-Geo. Myers, Miqs Margaret <mark>Saunders</mark>, Mrs. Lena An derson, Mrs. <mark>Frank</mark> B Busch, Mrs. Alfred"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1073.75, 1396.39, 1320.98, 1626.91], "bbox_id": "8150583973", "file": "AppomattoxNewspapers_1955-1957a_0020.pdf", "page": 1, "text": "Ferguson, Charles, co David Ferguson ................ Austin, Erman ................................... Beasley, John H.  Geo. H .......... Crump, Margie, Annie  Children ....... co L. Carey, Attorney .................. V Davis, Eliz. , 94 Acres  co Virginia Dicks ............................. Johnson, Alice Alice Green Acres .... co Massie Stevens ..........................  A,cres ..... Jones, Ashby .. ............................................ 4 Acres .......... Lee, -John  . ................. ............  ........ ... Megginson, Norman Acres  co Mary R. Randolph ...................... 4 Acres ........... Moore, Henry ............... ............................46 Acres . Pennix, Eugene ................ 10 Acres ....... Preston, Laurence T.  Estelle ............ 10 Acres   Preston, Laurence T.  Estelle ............ Robertson, Lucy - Acres . ....... co Susie E. Davis .......................... 66 Ac 3 Saunders, John.L. . .................... ,54 Acre s........................................ Woodson, Frank ......... .. ................................. _ TOWN OF PAMPLIN, COLO"}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "Davis .......................... 66 Ac 3 <mark>Saunders</mark>, John.L. . .................... ,54 Acre s........................................ Woodson, <mark>Frank</mark> ......... .. ................................. _ TOWN OF PAMPLIN, COLO"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "Davis .......................... 66 Ac 3 <mark>Saunders</mark>, John.L. . .................... ,54 Acre s........................................ Woodson, <mark>Frank</mark> ......... .. ................................. _ TOWN OF PAMPLIN, COLO"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1236.95, 405.07, 1393.65, 890.12], "bbox_id": "fffad3e368", "file": "AppomattoxNewspapers_1918-1922a_0266.pdf", "page": 1, "text": "The Marie Marshall Case. Richmond. In January a decision is expected from the Supreme Court cf Appeals on the Marie Marshall tax case, argu ment in which featured the opening j day of the fall term of this tribunal. By special motion the time of argu- i ment on each side was prolonged to one hour and three-quarters. The opening of the court was car ried out in all the formality observed on such an occasion and there was a I large attendance of Virginia lawyers, I this being due in part to the brilliani array of counsel employed in the Mar shall case. This case, which involves the righl of the State to tax the estate of an inmate of a State hospital, even  though the property in question may be in another State, as is the case in this issue, was argued by Attorney General Saunders, and his assistant, J. D. Hank, Jr., Frank. Amistead, ol Williamsburg, and Congressman S Otis Bland, for the Commonwealth, Judge Fred Kemochan, of New York State, who represents the committee holding the Marshall property in New York, was represented by Charles V. Meredith, of Richmond, associated withh Henry F. Miller, of New York City. Other attorneys present were City Attorney Pollard, George Bryan, Jus tin Moore, Richard E. Byrd, former senator M. J. Fulton, Senator James E. Cannon, Alex. Sands, Thomas B. Gay, Walter Sydnor and General W. W. Sale. They listened with interest to the detailed story of the case, which is by far the most unusual that has ever occupied a place on a Virginia court docket. Marie Marshall has foi years been a voluntary inmate of the Eastern State Hospital at Williams burg, and has used her vast fortune, inherited from her father, a wealthy Petersburg man, - to live in luxury, with many cars and servants in a house that was built especially for hex on the hospital grounds."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Frank"], "snippet": "argued by Attorney General <mark>Saunders</mark>, and his assistant, J. D. Hank, Jr., <mark>Frank</mark>. Amistead, ol Williamsburg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Frank"], "snippet": "argued by Attorney General <mark>Saunders</mark>, and his assistant, J. D. Hank, Jr., <mark>Frank</mark>. Amistead, ol Williamsburg, and"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.95, 288.63, 1762.51, 821.61], "bbox_id": "eab8c8f37e", "file": "AppomattoxNewspapers_1912-1915a_0192.pdf", "page": 1, "text": "Governor Names Road Delegates. Thirty official delegates from Vir ginia to the American Road Congress, scheduled to be held In Detroit, Mich., September 29 to October 4, were named by Governor Mann, and com missions issued from the office of the Secretary of the Commonwealth to each of the delegates. Governor Mann also sent a letter to L. W. Page, presi dent of the American Road Congress, in Washington, notifying him of the appointment of the delegation and in closing a list of the members. The American Road Congress is one of the largest and most powerful or ganizations working in the United States in the interest of good roads, and has accomplished a great work in th awakening of the country to the advantages to be derived from well- built highways. The meeting of the congress in Detroit is expected to be of unusual interest. The list of delegates appointed by Governor Mann follows First DistrictAshton Fletcher, Jen kins Bridge Thomas B. Robinson, Eastville James W. Chewntog, Hillon- beck. Second DistrictG. T. Rawls, Ben netts Creek C. C. Vaughan, Frank J. J. Dalton, Norfolk. Third DistrictW. C. Saunders, Glen Allen Howard Swineford, Richmond G. P. Coleman, Williamsburg. Fourth DistrictW. B. Davie, Law- renceville Lucius Gregory, Chase City James Wagner, New Bohemia. Fifth DistrictDr. R. S. Martin Stuart D. S. Bill, Spencer G. W. East, Chatham. Sixth DistrictD. W. Owen, Don- niston John T. McKinney, Lynch burg B. W. Logan, Salem. Seventh DistrictBrock White, Har risonburg J. W. Bowles, R. F. D. 1 Winchester H. F. Byid, Winchester. Eighth DistrictJ. L. Dawson, Woodbridge W. E. Allen, Warrenton W. R. P. Reid, R. F. D., Alexandria. Ninth District ----- Henry Roberts, Bristol James A. Grose close, Marion C. A. Wagner, Graham. Tenth DistrictJ. F. Harper, Way nesboro S. L. Ferguson, Appomattox W. P. Crumpacker, R. F. D. 1 Ro anoke."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Creek C. C. Vaughan, <mark>Frank</mark> J. J. Dalton, Norfolk. Third DistrictW. C. <mark>Saunders</mark>, Glen Allen Howard Swineford,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Creek C. C. Vaughan, <mark>Frank</mark> J. J. Dalton, Norfolk. Third DistrictW. C. <mark>Saunders</mark>, Glen Allen Howard Swineford,"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2284.51, 1272.63, 2445.93, 1579.88], "bbox_id": "f1edf67cd8", "file": "AppomattoxNewspapers_1915-1918a_0555.pdf", "page": 1, "text": "OOLOBKD Charlie Allen, Willie Allen, James Austin, Peter Agee, A l fred Booker, Jim Bennett, La fayette Baker, Arvery Goles, Anoel Ghambers, Geo.Cox,Geo Christian, Everton Cabell, Wm. Oann, Howard Dibble, Frank Dabney, Henry Eppes, Ben El- dridge, Emmett Ford, Wiley Gregory, Wm. Gray, Sam Glo ver, Mann Hocker, Early Hill, Geo. Jones, Frank Jones, Levi Jones, Isaiah Jones,Ollie John son, Wert Kane, Peter Lewis, Robert Mayo, Phil Mosely, jr , John Niobolas, James Nash, James Nioholas, jr., Moses Pat terson, Frank Perkins, James Pankey, 8am Perkins, James Powell, Reuben Saunders, Hen ry Soott, Johnson Seay, Jo. Tansy, Cornelius Wood, Em mett W atkins, Gus Woodson, Robert Booker, Wilbur Bayne, John Jordan."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "jr., Moses Pat terson, <mark>Frank</mark> Perkins, James Pankey, 8am Perkins, James Powell, Reuben <mark>Saunders</mark>, Hen ry Soott, Johnson"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "jr., Moses Pat terson, <mark>Frank</mark> Perkins, James Pankey, 8am Perkins, James Powell, Reuben <mark>Saunders</mark>, Hen ry Soott, Johnson"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [800.86, 286.69, 959.9, 1481.24], "bbox_id": "e35f79dfb0", "file": "AppomattoxNewspapers_1902-1905a_0294.pdf", "page": 1, "text": "John Mallory, of W. R. Mallory  Son, tobacco dealers, of Richmond, narrowly escaped death in a peculiar way. While alone in his office he raised the heavy lid of a sample box to get something. A rush of blood to the head caused him to fall into the box. The lid came down and he lay half conscious a prisoner for three hours, while his friends searched for him everywhere. The most disastrous forest fires in recent years have been raging in Rage county for several days and have destroyed thousands of dollars worth if timber, bark, etc. The flames have aurned over thousands of acres oi .and on the Blue Ridge and crosSeJ the mountain in the direction of Sper- .-yville, Rappahannock county. The lire, which had been fanned by fu rious gales, has defied hundreds of hre-fighters. In many instances hous es have been saved by men fighting night and day. . Capt. M. J. Dimmock, the Rich inond sculptor, presented to R. E Lee Camp, Confederate Veterans, ? statute of Gen. John R. Cooke. Gen eral Cooke was one of the most dis tinguished officers of the Confederacy The residence of Capt. William Kil- burn, U. S. N., retired, about foui niles west of Alexandria, was destroy d by fire. The residence had re cently been much improved. A de iective flue was the cause of the fire. The trial of the negro Roberl Bowles, for killing Fireman John A Ruff at Clifton Forge, resulted in  verdict of murder in the first degree. Judge Anderson sentenced Bowlef to hang on June 24th. Willie White, the 9-year-old- color sd hoy who recently killed his babj sister, in Madison, by giving hei ground glass, has been sentenced tc the Colored Reform School by the tudge of the Circuit Court of Amhers county. The first practical issue of the Jin Crow street car law fight was tin appearance in the Police Court a contractor. Mr. Myers boarded i contrafctor. Mr. Myers boarded  car onwhich was only one negro pas senger. He took a seat in the reai and refused to move forward whet ordered to do so by the conductor on the ground that there was no ne cessity for it. He was fined 5, bu the fine was remitted, the judge hold ing that ignorance of the law causec the offense. At the same time he laic down the proposition that in futurt all must obey the orders of conduc tors. The jury which has been engaged ir the trial of Walter Burrill, charged with the murder of Harrison John son, at Blainesville, Page county, or February 2, returned a verdict im posing a fine of 17 on Burrill. Tht commonwealth failed to make out a case of first-degree murder, and it was shown by a preponderance b! testimony that Burrill and Johnsor. lad been on intimate terms up to the shooting. The 17 fine was for a mis demeanor. Burrill paid his fine im mediately. The Norfolk and Western Railwaj will spend 2,000,000 for rolling stocl. at once. The moey was secured bj a loan in Philadelphia a week ago. ll was semiofficially and authenticall stated that this money will go toward buying a score of locomotives, 1,00c box and coal cars and a new stock 0! passenger coaches and combinatior express, baggage and mail cars. A real estate boom, which prom ises to rank with that of a decade ago, is on in Roanoke, and for sev eral weeks past the transfers hav been growing each day. A . lot at tht corner of Campbell avenue and Henr street, which has been held at iS,oor since the collapse of the big boom was sold for 39,000 to Watt, Rettew  Clay, who propose to build a five- story department store. John Mar tin, of Roanoke, paid 18,000 for a lo on Campbell avenue, near Jeffersor street. There is not a vacant resi dence in Roanoke. The jury in the case of Mrs. A. T Spencer vs. the Norfolk and Western Railway Company, in which lo,ooc damages were asked for the death o! Mrs. Spencers husband, who was ar engineer and who was killed in a wreck several months ago, awarded the full amount asked. A motion foi a new trial was made. Two Mormon elders are at work- in Winchester. The Pocahontas Company, of which President Robert McM. Gillespie, oi the Chesapeake Western Railway, i? the head official, is rapidly pushing its coal mining operation at the present time on its properties beyond North River Gap under the direct superin tendence of Mr. Tiffany, an exper mining engineer of Philadelphia. Its operations include work on the Big Coal run, Little Coal run and the Dora coal mine. The aged mother of Judge E. W Saunders, who lives in Franklin coun ty, 10 miles west of Rocky Mount, is ill. Governor Montague has arranged with Judge Frank P.Christian to pre side at Pittsyhsania Court in Judge Saunders Place. Mrs. Anna M. Sloat, the last sur viving member of an old family, died Monday at Winchester Memorial Hospital. She was 60 years old. George Henderson, of Marksvilh district, Page county, has just beer admitted to 1,500 bail charged with abducting Miss Florence Jones, a 16 year-old girl of that section. Tin girl disappeared from home about ont week ago and all efforts to locate hei proved futile. She was finally locatec where it is alleged Henderson had concealed her. His arrest immediate ly followed."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "has arranged with Judge <mark>Frank</mark> P.Christian to pre side at Pittsyhsania Court in Judge <mark>Saunders</mark> Place. Mrs. Anna M."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "has arranged with Judge <mark>Frank</mark> P.Christian to pre side at Pittsyhsania Court in Judge <mark>Saunders</mark> Place. Mrs. Anna M."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1837.86, 406.18, 2118.01, 631.92], "bbox_id": "00b7db6bdd", "file": "TimesVirginian_1976_0398.pdf", "page": 1, "text": "Winners in The Virginia Farmer, Yesterday and Today are pictured above with Mrs. Frances Gilliam representing the Appomattox County Farm Bureau Womens Committee. Pictured are Ronald Thornhill, 1st place Tom Cobb, 2nd place and Michelle Ford, 3rd place. Over 40 4th and 5th grade 4-H members entered posters in the contest sponsored jointly by the Farm Bureau Womens Committee and Appomattox County 4-H clubs. In addition to the top three winners who received cash awards of 5, 3, and 2, the following 4-ITers entered posters Blue ribbon winners Sally Coleman, Chuck Thompson.. Tammy Childress, Cheryl Mathews. Red award winners Shelia Woodson, Suzette Ranson, Rose Christian, Susan jygin, Joe Crews, Chris Tolley, Courtney Franklin, Keith McCormick, Latonia Richardson, Ronald Kelso, Stephen Hamlett, and Carrie Pennington. White Award Winners Larrry Mann, Percy Saunders, Cynthia Robinsori, Otis Jones, Ronald Archer, Nancy Mitchell, Rhonda Weakley, Pnyllis Patterson, Malcolm Miller, Paul Humbles, Jan Armentrout, Kevin Armentrout, Ernest Humblesr Deborah Davidson. Sandra Doss, Todd Nash, Connie Webber, Frank Webber, and Mark Letterman."}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Winners Larrry Mann, Percy <mark>Saunders</mark>, Cynthia Robinsori, Otis Jones,"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Winners Larrry Mann, Percy <mark>Saunders</mark>, Cynthia Robinsori, Otis Jones,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [693.36, 425.75, 853.19, 1827.44], "bbox_id": "5b4b77ba6d", "file": "AppomattoxNewspapers_1898-1902a_0576.pdf", "page": 1, "text": "Virginians were granted these pen sions Thurston Dow, Port Haywood,  8  Martin Gleeson, National Military Home, Elizabeth City,  8  John Potts, National Soldiers Home, Elizabeth City,  8  John Q. Miles, National Soldiers Home, Elizabeth City,  io  Martha Wil liams, mother, Daniel,  12  Charles Can dy, National Military Home, Elizabeth City,  8  John Bernhardt, National Mili tary Home, Elizabeth City, 6  war with Spain, John P. Davis, Stoneleigh,  6 . John OBrien, foreman at the Rich mond Locomotive Works, is dead, with a bullet hole through his heart, and where the deadly missile came from is a profound mystery. OBrien was 36 years old, very popular, and had no known enemies. He was standing in the main entrance to the locomotive works, talking to a mechanic who ap plied for work, and the watchman of the gate was, at his side. Suddenly O Brien grabbed the watchman, sank to the ground and expired almost immediately. C. F. Bryant, manager and salesman of the Roanoke office of the Singer Sew ing Machine Company, and well known in Virginia, was arrested on a warrant sworn out by Joseph Jenkins, a repre sentative of the company, charging him with the embezzlement of 185 of the companys funds. Bryant was bailed in the sum of  200 . J. B. Lordley, of Elizabeth City coun ty, died at his home in Newport News in his 66 th year. A widow and eight children survive. He came to Elizabeth City county from Canada some years ago. The Jefferson Avenue Bank, Newport News, is being organized, with a capital of  50,000 and a charter will be applied for shortly. Matthew G. Emery, the last mayor of Washington under the old form 6 f gov ernment, died at the age of 83 years. A wreck occurred at Dublin in which Frank Lavender, a fireman on a Cripple Creek pasenger train, met a horrible death, while running between Radford and Pulaski City. His engine crashed into an engine attached to the rear of a freight train standing on the main track at Dublin. Both engines were badly wrecked, and Fireman Lavender was scalded to death while hanging from the cab window. He begged for help, bu the bystanders were powerless to aid him, owing to the fast-escaping steam. He lived only a half hour. The dead fireman was taken to his home at Pulas ki City. He was a son of Mr. Charles L. Lavender, of Pulaski, and was but recently married. A negro, Howard Jackson, was ar rested after being shot at five times by policemen, it was charged, while he was robbing a jewelry store at Lexington. He had, it is alleged, recently robbed two stores by boring the locks or panels out and had entered this store likewise. In court some of this jewelry had to be identified by Jackson, as two merchants claimed the same goods. He was ar rested at the point of two empty revol vers and had two loaded revolvers in his pockets. Twenty-five representatives of the leading pulp and paper mills of the country met in Bristol to induce the Columbia Paper Company to enter the combine, agreeing to close all the pulp mills simultaneously o r alternately un til the demand for pulp is increased. It is stated the production of all the mills combined is exceeding the demand, hence many of the mills have too much pulp on hand. A remarkable output of ducks has just closed the season at the duck farm o Mr. S. H. Hansbrough, which is located at Riverton. It is the largest and one of the few similar industries in the coun try, and Mr. Hansbrough has sold this season over 40 tons, or over 8 o,oor pounds, of ducks for which he receive 30 cents a pound. Alexander Brown, LL.D., of Nor wood, Nelson county, has been stricken with paralysis and is critically ill. Dr Brown is the author of many valuable historical works, the most important of which is The Genesis of the United States. Judge John Paul continues ill at his residence in Harrisonburg and is un able to see his friends. It is rumored that Judge Paul contemplates resigning as judge of the United States Court for the Western District of Virginia. A boy named Sid King was killed near Newbern by a threshing machini turning over on him. King was abou 15 years old and was working with the machine. Addison Ingram, a well-known citi zen of Fredericksburg, died suddenly from a paralytic stroke, aged 73 years His widow and five children survive. The receipts of the Lynchburg post office for the three quarters ending Sep tember 30 , 1901 , show an increase over the preceding year of  7090 . Charles Miller, a former resident o! Lexington died a few days ago in Hot Springs, Ark., of rheumatism. Gen. Jas. A. Walker continues criti cally ill at his home in Wytheville and a fatal result is feared. Mrs. Lucinda Hall died in Warren county a few days ago in the 91 st year of her age. Fields sawmill, formerly Smoots, in Alexandria, was damaged by fire. Thomas Saunders and Bernard Hens ley, with two other boys, were arrested in Roanoke on the charge of attempt ing to blow open the safe of, the Fish- burne Company a few nights ago. All the young men are well connected and Hensley is employed by the company. The cornerstone of the new Young Mens Christian Association at Roa noke was laid Saturday with Masonic ceremonies. Mr. Tice Hooe died near Manassas from the effects of a fall. He was 55 years old and a son of John Hooe, of Mayfield. The suit of J. D. Robinson, a former councilman, against the city of Danville, for damages due to a defective culvert, was tried for the third time in the Cor poration Court of that city and damages were given the plaintiff in the sum of  900 . A movement is on foot to organize a new Baptist Association, the new dis trict to be composed of churches in the upper part of the Rappahannock and the lower part of the Goshen Associa tion."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "at Dublin in which <mark>Frank</mark> Lavender, a fireman on"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "at Dublin in which <mark>Frank</mark> Lavender, a fireman on"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [649.43, 1084.71, 808.82, 1465.65], "bbox_id": "1d607562a3", "file": "AppomattoxNewspapers_1902-1905a_0221.pdf", "page": 1, "text": "To prevent a lynching in New Kent county, Charles Wilson, the negro charged with criminally assaulting Mrs ra Gardner, was taken to Richmond by Sheriff Apperson. A petition hai been forwarded to Governor Montagu requesting him to order an immediate trial of the accused. Pollard Nicholas, of Louisa, was fin ed 25 in the Police Court in Richmond for striking Vinion Proffit, of Han over, with a stove lid. The trouble oc curred in one of the tobacco ware houses. Mrs. N. A. Newman, of Chesterfield was struck by a trolley cat in Rich mond and probably fatally injured Mrs. Newman was driving down Frank lin street in a runabout, when a north bound car struck the vehicle and car ried it some distance on the fender. A southbound car collided with the run about and Mrs. Newman was knocked out and caught under the fender of th car. G. W. Robinson, Commonwealth. Attorney of Newport News, is being urged by the local bar to succeed th late Judge J. F. Hubbard. Judge Mon tague of the Elizabeth City Countj Court, is also mentioned as a probable candidate. Miss Ellie Saunders sued W. J. H al stead, a merchant of Norfolk, for j broken hand and got a verdict for 2000. The merchant let the shifting back o! a street-car seat fall on the plaintiffs eft hand, inflicting permanent injuries The Central Labor Union has in dorsed the strike of the weavers m th silk mill in N orfolk, and asked tfft em plovers to arbitrate, but the employers declined. Ministers and private citizen? are endeavoring to settle the strike because it seriously affects the families, of the workmen during the sever weather."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Newman was driving down <mark>Frank</mark> lin street in a"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Newman was driving down <mark>Frank</mark> lin street in a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [747.11, 378.66, 910.1, 1688.9], "bbox_id": "f9dc9e2509", "file": "AppomattoxNewspapers_1898-1902a_0528.pdf", "page": 1, "text": "These pensions were granted Virgin ians during the week Ellison Harman- son, Eastville, 6 John McManus, Na tional Military Home, Elizabeth City, 6 John Williams, Waterway, io Gil ead Carter, National Soldiers Home, Elizabeth City, io Woodson Hicker- son, Comorn, io Peter Schwinn, Na tional Soldiers Home, Elizabeth City, 12 Sitty Saunders, Bay View,  13  Frederick Schlee, National Soldiers Home, Elizabeth City, io Joseph Eley, Portsmouth, 6 William Shagerford, National Soldiers Home, Elizabeth City, 6 Christian Binder, National Military Home, Elizabeth City, 8 Allen Redd, Martinsville, 12 George E. Newcomb, Berkley. 8 William H. Pepper, Na tional Soldiers Home, Elizabeth City, 6 Samuel Poole, Broad Creek. 6 Thomas Knock, Temperanceville, 8. The word  Christian will remain in the Virginia Bill of Rights. That was the decision of the committee on the Bill of Rights by a vote of 7 to 4. No sub ject which has been brought to the at tention of the convention, or any other legislative body in this State for the past quarter of a century, has attracted so much attention. From the time Mr. Garland Pollard of Richmond introduc ed his resolution in the convention, pro viding for striking out this word, there has been a perfect storm of protests coming from all parts of the com monwealth. At the meeting of the com mittee of the Methodist and Episcopal Churches Dr. Spooner and Dr. Evans were before the committee to oppose the elimination of the word. Mr. Pollard the author of the resolution, and Rev. Dr. Jones, of the Leigh Street Baptist Church, made forcible speeches in ad vocacy of its omission. Their conten tion was that it at least commended the Christian religion to the people, which the law should not undertake to do. About 3 oclock in the morning fire broke out in a warehouse at Fredericks burg belonging to Capt. S. C. Peyton and the flajnes spread so rapidly that it was soon entirely destroyed. Three new binders, 2 mowers, 25 tons of coal and a lot of hay and oats were also de stroyed, and large hay scales in front of the building badly damaged. The loss is partly covered by insurance. The fire created much excitement, as it was ne.u the Episcopal Female Charity School, the Christian Church, Captain Peytons dwelling and other buildings, but a heavy rain early in the night had so thoroughly wet the roofs that none of them caught. The American Locomotive Associa tion, of which the works in Richmond form a part, has determined to make a strong fight for the trade of Europe and the world. On August 15 this associa tion will start out a general solicitor on a trip around the world for the purpose of interesting capitalists and others. He will carry with him an interpreter whe speaks many languages. This fight i regarded as war upon the Baldwin Works, of Philadelphia, which is not a member of the combination. The strike of the Clifton Laundry girls at Newport News has been practi cally settled. The proprietor promised to look over his books and see if be could raise the wages of the operatives. This is understood to mean that the de mands will be granted. The girls will be unionized, nevertheless. The total value of taxable property in Petersburg for the year 1901 under the new assessment is as follows Personal property,  3 , 933.7551 the tax on this is 69,888. Real estate, 6,724,047, the tax on which is 107,583- A heavy rain and wind storm in Lex ington did considerable damage to crops in that vicinity. A large brick building on Main street was unroofed. The elec tric light plant was injured and every thing is in darkness. Mr. Leroy M. Edwards, the principal of the Bellevue School in Richmond and a well-known educator, is critically ill. Mr. Edwards is a son of the late Dr. John E. Edwards, one of the best-known Methodist divines in Virginia. Mr. Ernest F. Deacon, a graduate of Washington and Lee University, sailed i from San Francisco for Manila, where he will teach in the Government schools for three years. Mr. Deacon is a native of Rockbridge county. The grand jury of the Hustings Court of Petersburg found a present ment against John Hitchcock, a white man, for the murder of Frank McAllis-  ter, an old negro, at the almshouse. William Caruthers, who at one time conducted a school at Fredericksburg, is dead. He was a grandson of Rev. Sam uel B. Wilson, founder of the Freder icksburg Presbyterian Church. Mr. D. Lawrence Groner, of Norfolk, a prominent young lawyer, has an nounced his candidacy for the Lieuten ant-Governorship on the Republican ticket. A walk of vitrified brick is being laid alongside the parade grounds at the Vir ginia Military Institute from the en trance to the cadet barracks. Plans for the new hospital in Win chester have been adopted and the work of construction will begin at an early day. Patrick Reilly, of Woodstock, ied Tuesday, aged 83 years. He was a na tive of Ireland. Four sons and four daughters survive him. J. P. Mausey, for nine years principal in Roanoke, ivas elected principal of Suffolk High School. The Point Flouring Mills, at East Lexington, recently rebuilt and enlarg ed by Moses Bros., will soon be ready for business. At Balcony Falls, at the juncture ot North and James rivers, a number of bears have been seen crossing the mountains. John R. Miley shipped front Rom ney three carloads of export cattle which weighed over 1700 pounds per head. Burglars smashed two plate glasses in Lipmans clothing store in Suffolk and carried off clothing and a small amount of cash."}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Elizabeth City, 12 Sitty <mark>Saunders</mark>, Bay View,  13  Frederick"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Elizabeth City, 12 Sitty <mark>Saunders</mark>, Bay View,  13  Frederick"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.48, 945.74, 2163.3, 1256.74], "bbox_id": "aac6fb5be0", "file": "AppomattoxNewspapers_1943-1947a_0360.pdf", "page": 1, "text": "The following men have been separated from the service. The Re-emfployment Corrimitteeman, R. B. Hudgins, of Local Board No. 1, will be glad to interview any vet eran that wants aid in finding employment. The Local Board also welcomes- veterans, and is .ready to assist them in regard to their rights and benefits.,  - t   t o - T   -v-   - David E. Paulette Jack iT. Price Allen W. Abbitf William A. Fsadr.  Charles M. aeay Ernest A. Hicks Herbert M. Abbit.. William E. Kidd Wesley M. Powell Tftdd William Hunter Homer H. Hamlin Frank W. Hackney Clarence E. Powell Wortley Abbott Eugene A. Cuneo Alfred fA. LeGrand  Andrew Shelton George W. Calloway Erskine W. Gibson Calvin Saunders Emmitt W. Baldwin James R. Hancock."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Hunter Homer H. Hamlin <mark>Frank</mark> W. Hackney Clarence E."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Hunter Homer H. Hamlin <mark>Frank</mark> W. Hackney Clarence E."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [240.25, 695.82, 402.6, 1799.7], "bbox_id": "331fb359ed", "file": "AppomattoxNewspapers_1922-1923a_0106.pdf", "page": 1, "text": "State Affairs A ringing call to the colors was issued last night by Sena tor Harry Flood Byrd, Chair man of the State Democratic Committee, when that organi zation convened at Murphys Hotel to review the present political situation in the State, with special consideration of those districts where there is Kepublican opposition. An air of confidence and determi nation permiated the atmos phere. Speakers who address ed the meeting inoluded Sena tors Claude A. Swanson, and Carter GlasB, while former Governor Henry C. Stuart and Governor E. Lee Trinkle dis cussed the Ninth District in brief talks, each predicting Democratic victory in the Southwest. Members of the lower branch of Congress who responded to invitations to take the floor embraced J. T. Deal, of the Second P. H. Drewry, of the Fourth J. Mur ray Hooker, of the Fifth James P. Woods, of the Sixth, and Judge ThomaB W. Harrison, of the Seventh. Senator Swan son acknowledging his debt of gratitude to the people of Vir ginia for bis recent handsome endorsement, foretold a sweep ing Democratic victory in the next national campaign. Senator Glass paid glowing tribute to the memory and worth of the late Senator Thomas staples Martin, com plimented the committee on its selection of Harry Flood Byrd as its chairman, and spoke in high teims of the energy, loyalty and influence of Swanson at tbe national capito, saying that he deserv ed to be re-elected by the people. Captain C. A. McHugh, of Roanuke, has been appointed by Governor Trinkle to suc ceed himself on the State In dustrial Commission. This ap- pointment is shortly to be fol lowed by a second, when the Executive names a head to the Stale Dairy and Food Depart ment, now held by A. B.Thorn hill, of Appomattox. Harry B. Smitb, of Culpeper, was recent ly chosen by Attorney-General Saunders to succeed himself as state Commissioner of Prohi bition. A hearing on a petition for clemency in the case of the four members of the Allen clan serving terms in the State prieon for shooting up the cir cuit court at Hillsvitle in 1913, has been set by Governor Trinkle for IhiB afternoon at the State Capitol. The men in voived are Sidna Allen and his three nephews, Friel Alien, Sidna Edwards and Wesley Edwards. The Governor will be asked to grant pardons fur all four.Leaders in the moye ruent tor clemency include W. L Joyce, of Siuart W. 8. Forbes, ct Richmond togeihei with the following ilicLm,no clergymen George W. Mc- Dauie1, J. J. Scherer and Frank T- MtFaden. The Governor is i xpected to take his decission undtt -ulvistuit-nt."}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "ly chosen by Attorney-General <mark>Saunders</mark> to succeed himself as"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "ly chosen by Attorney-General <mark>Saunders</mark> to succeed himself as"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1945.66, 971.24, 2117.86, 1557.19], "bbox_id": "9173d41352", "file": "AppomattoxNewspapers_1955-1957a_0384.pdf", "page": 1, "text": "Sixty-one 61 pints of blood were dfnated by residents of Appo mattox County during the Red Cross Btoodmofeile visit here on Thursday, December 27, at Liberty Baptist Church. Albhaug. this amount was abort of the county quota, members of the Bloodknobie Committee were pleased to note a considerable in crease in donors over the last visit in June. Red Cross representatives with toe Bloodimobile also com mented on the very low rate of re jections at this visit. Only three donors were turned down and all for temporary conditions.  Donors at the Blood-mobile are listed below Ralph J. Aringiton, Ernest Bal dwin, Elmer Beamer, C. S. Booth, Emily T. Bruce, Berkley Qaibiniss, Gbas. L. Crews, Floyd Daniel, Ray Davis, T. Hunter Dickerson, Allen Franklin, R. S. Franklin, Jr. Edw. J. Giles, A, K Goggin, John Hall, Hunt Hamilton, Edward Harvey, John W. Hix, W. D. Hix, HI Silas Holmes, W. A. Hunter, T. C. Ja- merson,, J. N. Jennings, T. R. Kest- ner, S. R. Lawson, Jack D. Layne, R. V. Leffers, R. V. Leffers, Jr. Gabell G. Lewis, James A. Lewis, Dorothy Martin, Morton L. Fergu son, Frank M. McCann, Mrs. E. H. McFadden, Mrs. Frances Moore, John B. Oxford, James Patterson, W. C. Reynolds, Joseph Robertson, Robert Saunders, E. M. Sears, Myrtle C. Smith, J. E. Tibbs, Lois Tibbs, J. W. Webb, Lewps C. Wooten, Henry C. Staples, Jr. Mrs. Lola Morris, Mrs. Nellie A. Kraus Edward Kraus, Charles Thomas Joseph Hix, Mrs. Minerva W. Tor rence, Joseph William Coin, Dr Sibanley C. Boyce, Wilton M. Bou ton, Nathaniel L. Ferguson, Mrs. Batty Morris Webb, Mrs. Charles Thomas, Ottaway iMIaattin, Gerald L. HoLdren, Bill Jameraon, Edwin Garter, Mrs. Stanley Boyce. The Bloodmobile Canteen was provided by the Appomattox .Wom ans Club. Mrs. Morton Ferguson was the Appomattox County Red Cross re presentative for the Bloodmobile visit."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Morton L. Fergu son, <mark>Frank</mark> M. McCann, Mrs. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Morton L. Fergu son, <mark>Frank</mark> M. McCann, Mrs. E."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.55, 217.29, 1279.1, 447.12], "bbox_id": "704f2043c1", "file": "AppomattoxNewspapers_1962-1965a_0038.pdf", "page": 1, "text": "rt Mr Willie Cham- ed 25.00 or more The pnses   promise Land were m o d els the Farm Act r Lisdensy Marshall, under the direction of the voca  Zion Church. Mr. tional Agriculture instructor inlet, 36.00 Jordon  Impressive services were helc r Alex Lambert, 27.- at the Promise Land Baptis is Star Church, Dea- Church last Sunday morning nt Patterson, 27.38 The pastor delivered a sold stirr Church Mr. James ing sermon. The senior choir o erguson, 27.00 Mount  the church rendered special mu h Deacon Justin Me- j sic. The offering for the day wa m  56 - Mt. Obed Church  very good. After offerings mest Calloway. 25.00 j lifted for Miss Willie Mae Plesl y Church, Mr. A1 Walk- man and Mr. Marshall, n, 20.76 Gravel Hill The general public is invite eacon O. T. Woolridge.j to attend a choir festival at th id Bethelhem Baptist  promise Land Baptist Churc teacon M. T. Saunders, this first Sunday evening in Ni grand total of 808.52 j yember at 730. Miss Matt rted. The prizes were I pieshman is sponsor of the pr to Deacon J. W. King, I gram. The program is given f ge and Deacon Frank the benefit of the Months Ral A special gift will be  to be held on the second Sunds ach patron who report- j jn December. Several loc"}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Churc teacon M. T. <mark>Saunders</mark>, this first Sunday evening"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Churc teacon M. T. <mark>Saunders</mark>, this first Sunday evening"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.67, 337.87, 1585.83, 984.89], "bbox_id": "5ea1714401", "file": "AppomattoxNewspapers_1908-1909a_0583.pdf", "page": 1, "text": "Richmond, May 17.A lim ited edition of Legends of Vir ginia Courthouses, written by f John H. Gwathmey, a Rich-  mond newspaper man of wide  experience, is to be brought out by the Dietz Press late in May. It willbe illustrated with pen cil drivings of a number of the older Virginia courthouses b Miss Lucy Payne Pinder. The book adds another chap ter that has long been neglect ed in the volumes of Virgini ana.- There are more than six ty titles, mainly anecdotes an legendary lore about prominen lawyers arid jurists of pas generations. The author gath ered his material at first-hanc from the county-seats. In the legendary stories in eluded in the volume there i much droll humor and. the inci dents related in many case etch the characters of the mei about whom they afe written. Among many other noted characters about whom are told are Judge R. H. Card- well, Richard Evelyn Byrd, Hill Carter, Henry T. Wickham, Judge William S. Barton, Gen eral William B. Taliaferro, Maryus Jones, Herbert I. Lew is, Major James N. IStubbs, Ma jor Tom Taliaferro, Parson John E. Massey, C. A. Branch, Wyndham R. Meredith, Judge Frank Armistead, Judge T. R. B. Wright, Judge Thomaf Croxton,. Colonel T. J. Down ing, Thomas Ritchie, Captain William A. Wright, Colonel George Wright, Judge B. W. Lacy, Roger Gregory, George P. Haw, Col. WilllamR. Aylett, Col. W. W. Gordon, Judge Clagg.ett B. Jones, Leonidas Yarrell, J. E. Person, Judge Jesse F. West, Judge Robert R. Prentis. Capt. S. V. Southall. .Capt. William T. Early. H. M. Smith, Jr, Judge John M. White, Shelton Leake, William Cabell, Capt. Micajah Woods. Col. John R. Saunders, Louis O. Wendenbufg, Justice John J. Crutchfield, Judge Sr.muel B. Witt, Giles Jackson, Judge R L. Henley. ------ - ---- o --------------"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Wyndham R. Meredith, Judge <mark>Frank</mark> Armistead, Judge T. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Wyndham R. Meredith, Judge <mark>Frank</mark> Armistead, Judge T. R."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1885.88, 935.23, 2060.11, 1070.93], "bbox_id": "f5d7521870", "file": "AppomattoxNewspapers_1952-1954a_0130.pdf", "page": 1, "text": "Pamplin, Va., Nov. 26.- A surprise psfcriy mrss --0  Perry Edwards Saturday night, No- j vember 22. Those present were Mr. j and Mrs. Frank Dungee, Mr. and I Mrs. Leonard Walker, Mr. end Mrs. Ralph Johnson, James Mickle, Buck Golff, Carol Walker, Haywood Walk er, William Chambers, Jr. Edward Walker Misses Thelma Walker, Harolyn Walker, Eleanor Walker Mrs. Estelle Saunders, Mrs. Nannie Edwards, and grandfather, James Walker."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Mr. j and Mrs. <mark>Frank</mark> Dungee, Mr. and I"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Mr. j and Mrs. <mark>Frank</mark> Dungee, Mr. and I"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1874.96, 194.13, 2033.44, 792.35], "bbox_id": "53bce000a3", "file": "AppomattoxNewspapers_1971-1973a_0431.pdf", "page": 1, "text": "P leshman, Joyce Foster, Sheila Franklin, Diane Flucher. Bren da Garrett, Connie Galiaspie, Lynn Glover, Cindy Guill, Denise Hamlett. Wanda Har den, Kim Harrison, Doris Has kins. ROOM 2 Tives Hamlette, Kent H a n  cock, Gary Harris, William Harvey, Steve Hassell, David Hix, Calvin H unter, Ed. Jamerson, Dennis Jamerson, Alan Jones, Clayton Jones, John Jones, Ronald Jones, Harrison Kelso, Walter Kelso, Matt Lair, Stephan Lamb, James LeWarne, Vickie Lewis, Gay Honeycutt, Jacqualine Hudson, Veronica Humbles, Jewel Irby, Brenda Johnson, Darlene Johnson, Ella Kress, Nancy Kress, Delaphine Lewis, Nancy Lewis, Marcella Dawn Lively, Teresa Lucas, Debbie Marcus, Debbie M a r t i n ,  Stephanie Martin, Nancy May berry. ROOM 3 William Lipford, Allen Lit chford, David Marshall, David Martin, Dennis Martin, Lewis M artin, Russell M ayberry, Frank McCormick, Jam es Megginson, Je rry Moore, Roger Moore, Steve Moore, Sterling Mosley, Paul Mullins, Dean Paulette, Clay Pollard, Michael Preston, M i c h a e l Quinn, Sue McCormick, Brenda McCoy, Gloria McCoy, Debra Miller, Rhonda Mitchell, Debra Moore, Julie Moore, Pam Moore, Sue Moore, Carolyn Morris, Stella Mosley, Donna Mottley, Phyllis Padgett, Shel by Pankey. ROOM 5 Mike Ramsey, Barney Ran- - son, Philip Rice, Donnie Roach, Marvin Saunders, J o h n Scruggs, Danny Smith, Hal Smith, Mary Parris, Diane Parsons, Cathy Paulette, Don na Paulette, Patricia Phelps, Vanessa Phelps, Deborah Puckett. ROOM 7 Lyn Smith, Ryland Smith,"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "artin, Russell M ayberry, <mark>Frank</mark> McCormick, Jam es Megginson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "artin, Russell M ayberry, <mark>Frank</mark> McCormick, Jam es Megginson,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2001.38, 395.16, 2164.68, 798.2], "bbox_id": "a06a990eb5", "file": "AppomattoxNewspapers_1918-1922a_0078.pdf", "page": 1, "text": "N e w S t o r e The last two weeks surely has been a visiting time here Mr Iverson Wright, wife and daughter, of Memphis Tenn. and Mrs. W. C. Saunders are with Mrs. Tommie Garrett. At Mr. W. C. Chappells are Misses Sarah and Bailie Oox, of Curdsville. Mrs C H. Jones has her parents.Mr and Mrs. Gilbreath of Hampden Sidney, and her sister, Miss McFarlan, of Rich mond, with her At Mrs. 8 B Wilkersons were Mr. and Mrs. G. N. Jen nings and son, of Hurtsviite and Mrs. Thomas Walker, son and nephew, of Lynchburg Mesdames Walter and Willie Jones and children, Bessie May, Virginia, Clair and Frank, ot Farmvillo, are with Mrs. H. A Southall Mr P. C. Hales enjoyed the visit of bis cousins aud friends, Mr. and Mrs. O. O Hamlett and sons, Louis and Kenny, of Hampden Sidney Misses Lucy and Bessie Bohannon, of Louis ville, Ky. Mr. and Mrs. R R Eidridge, of Sandford, Fla. Mrs G. R Eidridge, Miss Lena and Master Melvin Eidridge, oi Dillwyn, and Miss Margaret Eidridge, of Richmond. Mrs. Susie Treat has her daughter,, Mrs. W. G. Chapp11 and son, of Dinwiddle county"}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "and Mrs. W. C. <mark>Saunders</mark> are with Mrs. Tommie"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "and Mrs. W. C. <mark>Saunders</mark> are with Mrs. Tommie"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.9, 353.44, 2041.44, 741.43], "bbox_id": "b188d62dda", "file": "AppomattoxNewspapers_1954-1955a_0238.pdf", "page": 1, "text": "Mrs. Lela Moore Williams, 37, wife of Earl P. Williams, died at her home, RL 1, Appomattox, last Saturday afternoon after an illness of five years. iShe was born in Sevier County. Tenn., and had lived at Appomat tox for the past 17 years. She was a member of Richardson Cove Bapt ist Church of Sevier County. She is survived in addition to her husband by her parents, John and Margaret Franklin Moore, Rt. 1 Appcjmetox, eight children, IJella Delores Williams ,James Earl Wil liams, Johnny Ulysses Williams, Carolyn Hilda Williams, Virginia Elizabeth Williams, Jean P. Wil liams, Harry Wayne Williams, Diftid Wade Williams, all of Rt. 1, Appo mattox the following brothers and sisters, Mrs. Jesse Blazer, James R. Moore, Ted. R. Moore, Mrs. Allison Thomas, John J. Moore, all of Appo mattox Mrs. Bill Reid, Miss Mary Moore, Albert S. Moore, Mrs. Willie Zuppello, Frank Moore and Miss Bet ty Ann Moore, all of Lynchburg. Funeral services were conducted from Liberty Baptist Church Mon day afternoon at three P. M. by Rev. L. Preston Brown and Dr. Carl A. Collins, Jr. The pall bearers were Carter Mar tin, Willie Pugh, Floyd Mayberry JPaul Sarver, Dean Pugh, Gleen Saunders, George Wooldridge, and R. B. Boney. Interment was in the Liberty Baptist Cementery."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Moore, Mrs. Willie Zuppello, <mark>Frank</mark> Moore and Miss Bet"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Moore, Mrs. Willie Zuppello, <mark>Frank</mark> Moore and Miss Bet"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [759.05, 381.28, 926.56, 430.63], "bbox_id": "a1de0a4730", "file": "AppomattoxNewspapers_1955-1957a_0157.pdf", "page": 1, "text": "Mr. and Mrs. Frank Ramsey are the proud parents of a baby girl, born in Lynchburg General Hospi tal. Mr. and Mrs. R. G. Saunders visited her Sunday at the hospital."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Mr. and Mrs. <mark>Frank</mark> Ramsey are the proud"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Mr. and Mrs. <mark>Frank</mark> Ramsey are the proud"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [596.12, 341.57, 763.02, 371.47], "bbox_id": "7222be6ab0", "file": "AppomattoxNewspapers_1955-1957a_0457.pdf", "page": 1, "text": "Mr. and Mrs. Frank Ramsey and daughter, Frances Ann visited Mr. and Mrs. R. G. Saunders Sunday."}, "highlight": {"text": {"matched_tokens": ["Frank", "Saunders"], "snippet": "Mr. and Mrs. <mark>Frank</mark> Ramsey and daughter, Frances Ann visited Mr. and Mrs. R. G. <mark>Saunders</mark> Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Saunders"], "snippet": "Mr. and Mrs. <mark>Frank</mark> Ramsey and daughter, Frances Ann visited Mr. and Mrs. R. G. <mark>Saunders</mark> Sunday."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [599.02, 821.44, 926.66, 1009.29], "bbox_id": "fd0d740eb8", "file": "AppomattoxNewspapers_1898-1902a_0225.pdf", "page": 1, "text": "in and a shame that young men are j le n d in g school, of.en seen at church under the in- j We are very glad to hear that tience o ìquoi , nevertheless, it is j  rs Jl,as. Baird is much improved, , .. i , and is now visiting her sister, Mrs. We have recently had good rains, j Saunders, of Wingiua. and the crops ot corn and tobacco Mr. Frank Bixler, of Richmond, .ue veiy good, home tobacco has g at home on a visit to his family, been cut, and some fallowing has j Mr. Ford Abrams, who has been Ren one. i i . j ill all summer, is improving slowly, 1 eai y everybody from this local-1 aS s also his wife, who never enjoys ity attended the big tent-meeting at ,rO0d health Whitehall on Sunday last. S W hit is the matter around Gai- M u-v Peo!le ,fr?m lle cities have  retts? We heard, a few days before coinè io visit their  country cons- ! July 26 last, that there wonld bea 11 m ,n f county. ! aranti marriage at Glen more Episco- Ban ton has bought a j pal Church. Accordingly, a great rami near Norwood, Nelson county,  many went to witness the ceremony, is fam-1 out, alas! a sad disappointment was"}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "had good rains, j <mark>Saunders</mark>, of Wingiua. and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "had good rains, j <mark>Saunders</mark>, of Wingiua. and the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.53, 1497.95, 1613.58, 1738.71], "bbox_id": "7eed6182ff", "file": "AppomattoxNewspapers_1912-1915a_0107.pdf", "page": 1, "text": "Idlewood Park Land Corporation, Richmond. Capital Maximum, 50,- 000 minimum, 10,000. H. K. Frank lin, president Field Wilbon, vice-presi- dent William B. Pizzini, secretary and treasurerall of Richmond. Ob ject Real estate business. Bay View Realty Company Inc., Richmond. Capital Maximum, 150,- 000 minimum, 500. William B. Walsh, president W. E. Kelley, vice- president  William L. Glenn, secretary and treasurerall of New York. Ob ject Real estate business. Carson Telephone Company, Carson, Va. Capital Maximum, 2,500 mini mum, 500. W. T. Saunders, presi dent N. H. King, vice-president J.D. Wilkereon, secretary R. B. Saunders, t treasurerall of carson, Va. Object I Build a telephone line eighty miles long in Prince George County. Mortgage Guarantee Corporation, Richmond. Capital Maximum, 100,- I non- m in im u m 10.000. John Skelton Demise"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "minimum, 10,000. H. K. <mark>Frank</mark> lin, president Field Wilbon,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "minimum, 10,000. H. K. <mark>Frank</mark> lin, president Field Wilbon,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [860.12, 863.21, 1000.45, 1761.45], "bbox_id": "3bad1cf6d1", "file": "AppomattoxNewspapers_1974-1975a_0402.pdf", "page": 1, "text": "Howard F . , c  o A aron Andrews, Union Laval 4.09 438 Raider, G. A., R2, Monata 10.24 19499 Rains, Zack, RPD, Rice 3.31 3474 Raasay, E. T ., R2, Monata 1.50 9440 Ramsay, Lana, R2, Groan Bay 4.99 17301 Raasay, Thurman B., RPD, Powhatan 9.62 2083 Randolph, C ell, 426 Droamond Ave., Naptuna, M.J. 4.16 19136 Randolph, William, RPD, Rad House 1.56 2010 Rank, C arl, R2, Blackatona 10.01 11045 Rather, D aniel, Mr. 4 M rs., RPD, Burkevllle  1.43 16397 Reamer, S. P ., RPD, Kaysvilla 6.41 1593 Reams, C. F ., RPD, V ictoria 3.88 16723 Raavaa, Sam, R l, Petersburg 1.47 m10228 Redd, M argaret, RPD, Rica 4.22  13449 Redd, Ruby, Mra., R3, Parmvilla 13.93 2140 Raad, Charles B. 4 Edith, Rl, Craua 2.03 2303 Read, C harlie, RPD, Madlaonvllla 1.28 2647 Read, Cora, RFD, Kenbrldga 3.98 13183 Raad, M. G ., M rs., RFD, F aravllla 3.03 17149 Ready, T. F ., RPD, Appomattox 1.33 2012 Raesc, C arl, RPD, Lynch Station 4.27 11879 Raas, Taylor J . , Mr. 4 Mra., R2, Kanbrldga 1.29 3476 Reaves, R. T ., RPD, Sutharland 2.43 2030 Raid, Cary L ., R2, Church Road 1.24 8792 Raid, Josephine 4 Ju lia n , Rl, Appomattox 1.84 7303 Ravis, J. W., R2, J e te rsv llle 16.17 12786 Reynolds, Clann P ., M rs., 3511 W. Carey S t., Richmond 3.38 7580 Reynolds, Jack, RPD, Spout Spring 9.66 17090 Reynolds, T. A ., R l, A ltavista 7.56 3819 Rhodas, Harrison, R l, B98, Wilson 6.21 12258 Rhodes, Walter H., Mr. 4 Ms., R3, Parmvilla 8.67 11183 Rhua, G.  ., Mr. 4 Mra., R l, Worsham 26.43 2907 Rice, Dan, R2, 889, Church Road 1.39 4830 Rico, G. V., RFD, Randolph 6.39 10615 Rica, M ilton, R2, Kaysvilla 2.83 11700 Rice, P. C ., Mr. 4 M rs., R l, Rice 2.99 14776 Rice, Parham M., RFD, Randolph 14.29 7843 Richardson, Jamas Howard, R2, Church Road 2.42 16331 Rickman, Roy, RPD, V ictoria 2.12 3350 Rickmond, H. J . , Rl, Maharrln 7.17 418 R lddls, A lbert G ., RFD, Church Road 8.92 1924 Riddle, C. W., R2, HcKannay 16.13 12908 Ridley, Isadora, M rs., RFD, Dinwiddle 2.68 6210 Riggs, Harman, R2, Crawe 6.97 2797 Rlgney, D. H ., RFD, Gladys 2.77 13941 R ialnger, Thomas J . , Mr. 6 Mrs., R l, B177, Petersburg 1.29 9090 Rltaoour, L. C ., 10 P ickett C t., Blackatona 1.62 12753 R ivers, C. A ., Mra., R l, Petersburg 8.34 14200 R ivers, H. R ., R 6 , B16S, Petersburg 13.29 14972 Roach, Plney,. R4, B51, Gratna 2.73 9239 Roark, L. W., Rl, Blackatona 1.12 12643 Roberts, Elizabeth W., Mra., 308 H. Court S t., Lawrancavllla 3.38 13130 Roberts, L illie , M rs., RFD, Randolph 12.68 9767 Roberts, Louisa F ., Rl, 869, Burkavilla 11.34 15563 Roberts, R. W., R2, Gladys 14.01 15665 Roberts, Raymond D., Rl, Parmvlllo 2.08 15928 Robarts, Robert C., RFD, Sutharland 1.38 13335 Robarts, T. 2 ., M rs., R3, Kaysvilla 5.95 18946 Roberts, William  ., R l, 830, Drakas Branch 2.43 134 Robertson, A. G., RPD, Sandy Laval 9.34 1718 Robertson, C. L ., R2, B95, Kenbridge 4.77 2967 Robertson, David H., R l, Blackatona 2.11 3013 Robertaon, D alla, RPD, Appomattox 2.41 14009 Robertson, Elisabeth, Ma., 308 N. Court S t., LawrencevlXle 13002 Robartson, James C ., Mra., R3, 6248, Parmvilla 13062 Robartson, Kara P ., M rs., RPD, Kaysvilla 9666 Robartson, L lssio , RFD, Randolph 13206 Robortson, Mabel, M rs., Rl, V ictoria 13333 Robartson, T. V., M rs., RPD, Blackatona 6.03 18844 Robartson, Wesley, RPD, Rica 3.98 714 Robinson, Annie Mae, R2, 667, Amalia 6.96 16242 Robinson, Elizabeth, M rs., Rl, Lynch Station  11198 Robinson, G. L ., Mr. 6 M rs., B Powhatan 3243 Robinson, Cranderson, R4, 842, Amelia 13046 Robinson, John W., Mra., RPD, Ja ta rsv illa 14660 Robinson, P. A ., RPD, C harlotte C.H. 16239 Robinson, Roosevelt, R2, Brooknaal 17782 Robinson, W. A ., B2, B82, Amalia 18986 Robinson, William D., R2, B22, Ja ta rsv illa 19207 Robinson, William 6 Mary, R2, B345 C harlotte C.H. 16188 locky Branch Bapt. Church, Rl, 161, Drakas Branch 1.74 273 Rogers, A.  ., RPD, HcKannay 9.21 334 Rogers, Allen B ., R l, Blackstooe 2.43 3400 Rogers, H. C ., RPD, Evington 1.30 6790 Rogers, J . D ., RPD, Kaysvilla 3.63 9511 Roney, Leroy, R2, Dinwiddle 7.79 3401 Borers, H. C ., RPD, Evington 1.18 1129 Rosser, Bernard, R2, Gladys 3.94 1393 Raaaer, C. F ., RFD, Concord Depot 3.07 9867 Roaaar, Lula, Rl, B371, A ltavista 3.63 18330 Rosaar, W. M., RFD, Gladys 7.59 18331 Roaaar, W. M., RFD, Long Island 12.40 9076 Rosaon, L. F ., RFD, Powhatan 1.61 3022 Rowe, Dennis, RFD, Rica 6.06 16307 Row, Roy E ., B97, Brooknaal 1.92 2009 Rowland, Carl O ., Rl, Hurt 11.41 6118 Rowland, Harbert A., R5, B443A, Fataraburg 13.76 10307 Rowland, Marvin C ., 1023 3th S t., A ltav ista 1.22 16632 Royal, Sadden, RFD, Mannboro 1.38 18533 Royall, W. T ., R2, Keyavllle 7.49 9634 Rucker, L illia n T ., R l, J a ta rsv illa 3.08 17130 Rucker, T. P ., RFD, J a ta rsv illa 7.45 1276 R usaall, Bobby W., 40 P ickett C t., lecksten 3.94 2303 R usaall, C harlie, RFD, Randolph 7.68 13445 R usaall, Ruby C ., M rs., R2, South H ill 16.11 2972 Ryder, David J . , R2, Blackatona 11.76 5352 Sa 6  r, H. L ., R2, HcKannay 16.47 16964 S t. Janas Parrish H all, 6768, Lawrancevilla 3.32 3766 S t. John, E lisabeth A ., RPD, Amelia 11.30 15410 S t. John, R. L ., RPD, Crawa 17.93 4303 S a llla , Frank, RFD, Dinwiddle 3.10 3381 Sanford, E. L .. RFD. A lbarta 1.63 18334 Sanford, V. M., RFD, M aradlthvllla 10.26 16769 Sanclar 4 C o., R3, 6160, Parmvilla 2.61 2497 S atchell, Claophes, R l, Blackatona 2.24 747 S a tte rfie ld , Archer C ., RFD, M adlaonvllla 1.72 11147 Saunders, F. H., Mr. 6 M rs., R2, 1126, Cladya 10.41 7506 Saunders, J . W., RFD, Blackatona 2.26 13237 Saunders, Mary, M rs., R l, Green Bay 3.06 1560 Scarborough, C. E ., R l, 70, C hastarfiald 7.00 11361 Schaefer, J . G., Mr. 6 M rs., 12 P ick ett C t., Blackatona 6.74 1748 Schaubach, C. M., 82, 1114, Blackatona 2.73 12030 Schwärt, W illi, Mr. 6 M rs., Clark S t., Brooknaal 1.29 409 Scott, A lbert D., RFD, Dewitt 3.89 706 Scott, Annie L ., RPD, Gladys 2.33"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "4303 S a llla , <mark>Frank</mark>, RFD, Dinwiddle 3.10 3381"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "4303 S a llla , <mark>Frank</mark>, RFD, Dinwiddle 3.10 3381"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.22, 1227.84, 2347.27, 1783.84], "bbox_id": "71c30d9acf", "file": "AppomattoxNewspapers_1952-1954a_0263.pdf", "page": 1, "text": "Grady Garrett, of Richmond was named president of the Huguenot Society of the Founders of Mana- kin in the Colony of Virginia at their annual assembly at Natural Bridge last Friday and Saturday. Other officers named were Mrs. Kirkland Saunders, of Richmond Mrs. Saunders Clay, of Kentucky, and Mrs. William Langston, of Penn sylvania, vice presidents Mrs. Rufus Felts, of Tennessee, recording secre tary Lewis Agee, of Missouri, treas- uer Mrs. Beverley Johnston, of Georgia, historian Mrs. Carlton Doss, of Virginia, junior director Mrs. Horace Adams, of Farmville, registrar Mrs. Harvey Cragon, Jr., of Tennessee, librarian Dr. James Chastain, of Mississippi, chaplain P. C. Williams, of Powhatan, flag custodian Walter L. Turner, of Roanoke, parliamentarian and Mrs. Edward Agerton, of Georgia, poet laureate. The advisory board is composed of Mrs. Earl Wood, of Charleston W. Va., retiring president Dr. W Twyman Williams, of Appomattox Va., branch president and Mia Sadie Hudson, of Mississippi. The assembly voted to hold the assembly next year in May in York Pennsylvania. The memorial service was conduct ed at noon Saturday at Filling Spring Church in Rockbridge Coun ty by the Rev. John B. Cunning ham, of Cascade and the Rev. G. P, Whiteleyr pastor of the church. Speaker at the iuncheon meeting Saturday was Col. Frank Pancake, commandant of cadets at Virginia Military Institute, whose subject was Matthew Fontaine Maury and Vir ginia Military Institute. Dr. MLedge Moffett, dean of Rad ford College, delivered the closing address at the assembly dinner Sat urday night on Unto the Next Gen eration."}, "highlight": {"text": {"matched_tokens": ["Saunders", "Saunders"], "snippet": "named were Mrs. Kirkland <mark>Saunders</mark>, of Richmond Mrs. <mark>Saunders</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders", "Saunders"], "snippet": "named were Mrs. Kirkland <mark>Saunders</mark>, of Richmond Mrs. <mark>Saunders</mark>"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1037.76, 1562.9, 1189.84, 1700.26], "bbox_id": "5a86642e01", "file": "AppomattoxNewspapers_1922-1923a_0013.pdf", "page": 1, "text": "Dr. F. T. McFaden A Colonel. Rev. Frank T. McFaden, D. D., prominent in Masonic, as well as church circles in Virginia, was named by Governor E- Lee Trinkle as a mem ber of his staff, with the rank of colonel. Dr. McFaden will fill the duties of chaplain in the official body. The Governor also announced the ap pointment of Peter Saunders, of Rocky Mount, a son of the late Judge E. W. Saunders, as a member of his staff. The appointment of T. C. W. McEwen as examiner of records for Loudoun, Rappahannock and Fauquier,"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "McFaden A Colonel. Rev. <mark>Frank</mark> T. McFaden, D. D.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "McFaden A Colonel. Rev. <mark>Frank</mark> T. McFaden, D. D.,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [633.92, 834.43, 796.41, 1499.32], "bbox_id": "0ae0b42b36", "file": "AppomattoxNewspapers_1922-1923a_0078.pdf", "page": 1, "text": "Davis Street, student, Richmond Col lege. Charles Towler, farmer, Hampden- Sidney College. Eloise Atwood, Hollins Kizzie Burnette, stenographer. Alice Carson, teacher, Farmville Normal. Rheda Drinkard, teacher-housekeeper. Cornelia Gills, music teacher, busi ness. Mary Taylor Gills, student, Richmond College. 11 Virginia Harvey, teacher, Farmville Normal. Bettie Morris, teacher, Farmville Nor mal. Nettie Moses, stenographer, business. Elaine McDearman, teacher, Farm ville Normal. Lucille OBrien, teacher, Farmville Normal. Gladys Woolridge, student, Radford Normal. John Chetham, student, Richmond College. John Caldwell, student, William and Mary. Joe Clark, teacher-student, V. P. I. Frank Carter La Prade, -student, Rich mond College. John Lepps, student Hampden-Sidney College. Reggie Stanley, store clerk. Grace Bagby, teacher, Uni. Va. Callie Babcock, student Randolph-Ma- con College. Nola Berkey, student Radford Nor- mal. _  - Margaret Chilton, student Radford Normal. Rachel Ferguson, student Randolph- Macon College. Stella Payne, student in Richmond College. Minnie Robertson, at home. Verta Smith, clerk in bank. Francis Street, student Richmond Cellege. Josephine Towler, student-teacher. Francis Wagner, at home. Eva Woolridge, at home. Sammie Ferguson, trained nurse. The Class of This Year Raymond Peale, will attend college. William Burke, will attend college. Earl Carson, will attend college. Reed Hatcher, will attend college. Ned Hancock, will attend college. LeRoy Jennings, goes in business. Williard Peale, will attend college. Rupert Rodgers, will attend college. Carrington Saunders, will attend col- Jggg Elmer Smith, goes in business. Evelyn Brown, will attend college. Ruth Clement, will attend college. Addie Childers, will teach. Christine Foster, will attend college. Eva Ferguson, will teach. Marguerite Gilliam, will attend col- lege- ., . , Margurite Hancock, will attend col lege. Earl Patterson, at the Normal. Lydia Rodgers. Annie Scruggs, will attend college. Annie Snell, will attend Normal. Some whose plans are not known are omitted."}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "teacher-student, V. P. I. <mark>Frank</mark> Carter La Prade, -student,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "teacher-student, V. P. I. <mark>Frank</mark> Carter La Prade, -student,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2048.66, 580.72, 2196.72, 859.3], "bbox_id": "5dc8279255", "file": "TimesVirginian_1981a_0264.pdf", "page": 1, "text": "Cafeteria Homeroom - Percy Saunders, Randall Scott, Rod ney Shelton, Richard Stead man, Roger Steinkamp, Robert Taylor, W arren Thoma,.H. R. Tolley, Ricky Turner, Eric Turner, Chris Tyree, R. L. Waldo, Robert Watson, Frank Webber, Herman W heeler, Lynn Robinson, Fontella Robin son, Michelle Romanac, Bar bara Rosser, Elizabeth Saun ders, Traci Schmutz, Patricia Scott, Deirdre Scruggs, Char lene Scruggs, Norma Scruggs, Carol Simmons, Delores Smith, Tracey Trent, Sandra Walton, Lawane Watkins. Homeroom 203 - Michael Williamson, David Williams, Troy Woods, Roger Willis, Brian Wright, Regina Watkins, Alfreds Wheeler, Denise Wil liams, Heather Williams, Vir ginia Wood, Jo Ann Wooding, Monica Woody, Vicky Worley, Maggie Wright."}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Cafeteria Homeroom - Percy <mark>Saunders</mark>, Randall Scott, Rod ney"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Cafeteria Homeroom - Percy <mark>Saunders</mark>, Randall Scott, Rod ney"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1491.11, 970.49, 1659.44, 1543.42], "bbox_id": "fd3df351a2", "file": "AppomattoxNewspapers_1892-1898a_0197.pdf", "page": 1, "text": "Burkeville Notes. Mr. R. M. Bradshaw returned Saturday night from a pleasure trip to Columbia Ohio, he says he had a splendid time and is now ready for hard work again. Rev. Thos. L. Beckham died in Richmond and was buried at this place last week. Mr. George Rebortson killed a fine deer last Saturday. Mr. G. D. Saunders left this morn ing to attend Prince Edward county Court. Mrs. M. E. Saunders of this place has gone on a business trip to her former home near New Store. Mr. Thompson Overton of this place is quite sick, Mr. Frank Moss formerly of Buckingham C. H., now located at Birmingham Ala., passed through this place last week en route to Ala. Mrs. M. G. Jones, of Farmville who has been visiting Mrs. S. B.  Davis returned home last week. Messrs. George Robersson, F. L. and Allie Overton went out on a bird hunt Monday succeeded in bag ging eight birds. November 19 1894.  ____ N tesironT E vergreen. Business is brisk here now, the merchants are having a fine trade the farmers are busy fallowing for another year our little tow is build ing up, several new buildings being erected. Mr. E. E. Chism, the foreman on the church is getting on splendid  and with good luck and fair weather  he hopes to be able to soon finish the outside work. The church when completed, will be a splendid build ing and along felt need,"}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Saturday. Mr. G. D. <mark>Saunders</mark> left this morn ing"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Saturday. Mr. G. D. <mark>Saunders</mark> left this morn ing"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1524.7, 301.14, 2024.27, 1181.39], "bbox_id": "6401a90f6c", "file": "AppomattoxNewspapers_1939-1943a_0242.pdf", "page": 1, "text": "4 night, and underwent an operation for appendicitis. ... , Miss Maxine Glenn, Mrs. Ever- j ette Kangas and Frank Coleman, of  Washington, pipent the week-end with Mr. and Mrs. E. R. Glenn. Miss Mildred Lawson returned home Tuesday from Johnston-Willis hospital, Richmond, i after having pneumonia. Mrs. William H. Copenhaver, -of Marion, and Mr. arid Mrs. J. A. Gills, of Chatham spent the week end with Mr. and Mrs. W. P. Gills. Charles Bernier, of Hampden- Sydney, will address the Appomat tox Lions Club tonight A student .orchestra has been or ganized at the Appomattox school. The Rev. and Mrs. H. F. Jones are attending the General Baptist Association in Dariville. Mr. and Mrs. F. A. Duffcy and family, of Daleville, spent Saturday with Mr. and Mrs. W. P. Ferrell. Mr. and Mrs. W. P. Ferrell nd family will spend Sunday jvlth Mr. and Mrs. C. C. Croucn, in Roan oke. Mr. and Mrs. Ben F. Saunders, of Richmond, and Miss Lucille Cralle, of Charlottesville spent the week-end in the home of Mr. and Mrs. C. C. Cralle. M ss Susie Plunkett, of Chatham, was home for the week-end, with her parents, Mr. and Mrs. J. D. Plunkett. Edwin Frazier, of Richmond, was in Appomattox for the .week-tnd. The Susie Whittinghill Circle of the Y. W. A.S, had a covered dish supper and a study, course, in the home of Mrs. H. F. Jones Tuesday evening. Mr. and Mrs. Frank Shramck and Mr. and Mrs. Morgan Gibson, of Baltimore, were guests of the Rev. rnd Mrs. H. F. Jones for the week end. Mr. and Mrs. Herman Robertson, of near Lovingston, visited relatives in the eounty during the week-end. Mr. and Mrs. J. Rolfe Brame, of Richmond were week-end gues s of Mr. and Mrs. J. C. Caldwell. Miss Violet Ramsey and A. R- Harwood, Jr., visited friends at Charlotte Court House Sunday, Toni Collins, who works at Rad ford, was home for the Week-end. Miss Kate OBrien, of Farmville was here Sunday. Ed Harvey has accepted a posi tion in Farmville, and will go there he first of the coming month. The Thursday bridge club met last week with Mrs. Raymond Law- son. Prizes -Went- to Mrs. W. M. Morris and Sirs. -L. L. Gayle. Week-end guests of Mrs. Joel W. Flood were Miss Ada Davis and Mrs. Robert Whitehead, of Rich mond. Mrs. H. D. Flood, and son, Boll ing, of Washington, D. C., spent I Wednesday night. here en route to Florida. .-Robert Lynch was taken to the _ .. . - e _ Virginia Baptist. Hospital. Tuesday  Mrs. B. F. Robinson, of Syringa,"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "j ette Kangas and <mark>Frank</mark> Coleman, of  Washington, pipent"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "j ette Kangas and <mark>Frank</mark> Coleman, of  Washington, pipent"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1170.29, 225.02, 1360.34, 956.26], "bbox_id": "763a85e7a9", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "378, Robert Coleman Thornton 486, Harvey Lee McFadden 600, John Elisha Burnett 507, Samnel Henry Morgan 420, Alvix Louis Nicodemus Herncall 10, Harrison Morton Burge 487, Hurley Ashby McFadden 18, John Wesley Coleman 613, Everett Wilspn Blackwell 602, William Littleton Cardwell 75, Lacy Douglas Marshall 1280, Hurley Clem Davis j 332, John Case 379, Allen Walker 542, Herbert Moore 194, Frank William Fleshman 98f Joseph Blanchard Tinsley 343, Henry Carl Holesapple 15, Thomas Ennis Childress 530, Herman Harding 1218, Philip Olander Paulette 620, Frank Edward Jennings 550, Oscar Leonard McCormick 574, Ulysse8s Simpson Austin 677, Cosiusco McCoy 1183, James Edward Jordan 350, Alexander Lane 440, Andrew Smith 685, James Willis Watson 341, DeWitt Talmage Goin 391, Thomas B Bryant 637, George Wesley Powell 356, Van Bur en Webb 112, Claude W Smith 11, Jerry Allen Burke 363. Willie Hunter 664, Nathan Fleshman 93, Lewis Saunders McCormick 345, Walter Allen Heflin 103, Edward Traynham Price 388, Edward Irving Bingham 406, Wade Hampton Ferguson 1519, Harry Leonard Cumby 25, Joseph Edwin Dinwiddie 1392, Eddie Carter 383, Thomas Homer Babcock 122, Bernard Dickerson Thomas 292, Emmett Warren Oakes 191, Charlie Washington Tanner 477, William Ffetoher Garrett 130, Henry Harrison Williamson 168, Edward Watson 424, Willie Wesley Mitchell 657, Claude Davidson 524, Harry Leonard Doss 632, James Clarence Horsley 49, Alfonso Godsey 557, Thomas Talmage Phelps 685, Samuel Boyd Johnson 323, Colonel Oscar Patterson 438, Wilmer I Smith 492, Wesley Abbitt Smith"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "542, Herbert Moore 194, <mark>Frank</mark> William Fleshman 98f Joseph"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "542, Herbert Moore 194, <mark>Frank</mark> William Fleshman 98f Joseph"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [460.1, 589.22, 620.14, 1732.51], "bbox_id": "3a986625a3", "file": "AppomattoxNewspapers_1915-1918a_0583.pdf", "page": 1, "text": "262 Benjamin Ather Mann, Evergreen 263 Havilah Babcock, Appo mattox 264 Joseph McElroy Leps,Ap pomattox 265 Ernist Gills Johnson, Ap pomattox 266 Harrington Stanley, Ap pomattox r t d 4 267 Beverley Flouny Cole man, Appomattox 268 Washington Hoe Stanley, Appomattox 269 Thomas Willie L o y d Johns, Appomattox 270 Willie W right, Appomat tox r f d 3 271 Joseph Ottay OBrien, Appomattox 272 Howard Blanton Mar shall, Appomattox 273 Leslie Flintroy Oallaham, Appomattox 274 Earl Holmes Patterson, Appomattox 275 John Wesley Martin, Ap pomattox 276 Aroher Alexander Le- Grand, Evergreen 277 George Robert Collins, Bpont Spring 278 Alexander W ashington Jones, Spout Spring 279 Harvey John Wentworth, Appomattox 280 James McFadden, Spout Spring 281 Bennett Chapman Simms. Appomattox 282 Clement Archer Han cock, Appomattox 283 Braxton LeGrand Han oock, Appomattox 284 William David Robert son, Spout Spring 285 William Edward Dicker- son, Spont Spring 286 Taylor Vermont Godsey, Appomattox 287 John Sam Martin, Appo mattox 288 William Benjamin Cald well, Appomattox 289 Willie Thomas Wells, Ap pomattox 290 Doctor Julian Franklin, Appomattox 291 Guy Eldridge Rice, Ap pomattox 292 Elliott Roland Jones, 8pout Spring 293 William Mayberry, Appo mattox 294 Frank Orman Jones, Spout Spring .295 Richard Appomattox 296 James Daniel Spout Spring 297 Luther Jackson Morris, Appomattox 298 Fred Isbell, Appomattox 299 Andrew Jackson Martin, Appomattox 300 James Dillard Morris, Ap pomattox 301 Thomas Walker Moses, Appomattox 302 Wiley Win ton Osborn, Appomattox 303 Lee Watson, Appomattox 304 William Saunders, Appo mattox 805 John Willie Godsey, Ap pomattox 306 Tas Statham, Appomatox 307 William Hunter, Vera 308 James Henry Smith,Bent Greek 309 Wilbon Fistol Wooldrige, Appomattox 310 Waverly Thomas Foster, Pamplin 311 James Raymond Wili ams, Appomattox 312 Hector Phelps Caw thorn,"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "Mayberry, Appo mattox 294 <mark>Frank</mark> Orman Jones, Spout Spring"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "Mayberry, Appo mattox 294 <mark>Frank</mark> Orman Jones, Spout Spring"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1167.88, 444.98, 1328.79, 1736.31], "bbox_id": "4377458ac6", "file": "AppomattoxNewspapers_1915-1918a_0277.pdf", "page": 1, "text": ", Richmond In response to a telegram received from Representative Carter Glass, sec retary to the National Democratic Commltte, Attorney-General John Gar land Pollard will hand down an opin ion, determining the question ot whether a presidential elector, under the Virginia statutes, is deemed a State officer, and, if bo  whether he is required to file with the Secretary ot the Commonwealth an expense ac count. Mr. Glass sent a copy of atelegram to himself from Robert W. Woolley, chairmaq of the publicity committee of the National Democratic Commit tee, in which he calls attention to the fact that in some States electors are required to file their accounts within fifteen to thirty days after election, and suggesting that Mr. Glass look into the matter at once. The Attorney-General, who was leav ing the city just as the telegram came, wired Mr. Glass that, as a measure of precaution, he. advised that the elec tors do file an account. In any event, Mr. Pollard says, they will have until December 7. Though no statement was issued from the office of the Attor ney-General, it is understood, from un official sources, that Mr. Pollard will hold that electors are required to file expense accounts. Cant Raise the Rates. The petition of the various rail roads operating in Virginia for per mission to put into effect a 5 per cent, increase in the rates in intra state freight was refused by the State Corporation Commission, and the case stricken from the docket. The petition was filed jointly, Jan uary 6, 1915, by the Atlantic Coast Line, Baltimore and Oljio, Chesapeake Steamship, Chesapeake Western, Cum berland Valley, Danville and Western, New York, Philadelphia and Norfolk, Norfolk and Western, Norfolk South ern, Old Dominion Steamship, Rich-  mond, Fredericksburg and Potomac, Seaboard Air Line, Southern, Virgin- tan, Virginia and Southwestern, Wash ington and Old Dominion, Washington Southern and Valley companies. Hear ings were begun by the State Corpora tion Commission on February 9, 1915, and were continued through March 11. Since then the caSl has-been under advisement. The petition was fought strongly by the Chambers of Commerce of the larger cities of the state, the South ern Produce Exchange and other com mercial organizations. Appoints Delegates. Governor Stuart announced the ap pointment of the following delegates from Virginia to the fourth annual conference on Marketing and Farm Credits, to be held In Chicago during the week beginning December 4 George W. Koiner, B. C. Moomaw, Richmond T. O. Sandy, Burkeville Professor W. C. Saunders, Blacksburg George N. Stuart, Meadow View F. G. Buchanan, Ellendale Robert W. Law- son, Burkes Garden A. J. Steele, Tazewell Nathan Fugate, Castlewood B. F. Johnson, Clinchport Frank Sanders, Chilhowie Jeff Gillespie, Tazewell S. H. Fletcher, Lebanon Isaac Cox, Clinchport Ben Brocken- brough, Tappahannock Andrew Broad-  dps, Sparta Russell Bargamin, Cro- xet S. S. Cassell, Rural Retreat L. F. Parr, Pedlar Mills J. T. S. Hoge, Hoges Store Joseph- Stebbins, South Boston George Savage, Surry Pro fessor Theodore P. Campbell, Blacks burg F. S. Farrar, Jetersville W. C. Shackleford, Profit J. H. C. Beverly, The Plains C. E. Jones, Carysbrook, and James Bellwood, South Richmond. For Boiler Congress. Governor Stuart made the follow- J ing appointments of delegates from Virginia to the Uniform Boiler Code Congress, which meets at the Raleigh Hotel, Washington, for, the week be ginning December 4. D. L. Robert son, Roanoke Thomas Nolan, Ports- ,mouth Thomas J. Garvey, Richmond J. H. Hanky, Richmond William H. Healy, Newport News Richard Thomas, Clifton Forge F. Stewart Royer, Fredericksburg, and L. S. Ran dolph, Blacksburg. Hunters Pay 33,429. With license taxes collected in eight counties and seven cities during the month of October not accounted for, hunters licenses, provided for in the new game act, total 33,429.04, ac cording to figures compiled by the Auditor of Public Accounts. Before  the hunting season is over, the De- , partment of Game and Inland Fisher ies, to which this money Is credited, will have realized more than 60,000 from the issuance of licenses, in the opinion of Corimissioner Parsons. Succeeds Judge Cardwell. Judge George M. Harrison, of Au gusta county, was elevated to the presidency of the Virginia Supreme Court of Appeals, succeeding Judge Richard H. Cardwell, resigned. Judge Harrison Is a sox of Henry Harrison, and has a long line of distinguished ancestors. After the War Between the SUtes he entered the University of Virginia, and, after graduation, prac ticed before the Staunton bar. He became a member of the Supreme Court in 1895."}, "highlight": {"text": {"matched_tokens": ["Saunders"], "snippet": "Burkeville Professor W. C. <mark>Saunders</mark>, Blacksburg George N. Stuart,"}}, "highlights": [{"field": "text", "matched_tokens": ["Saunders"], "snippet": "Burkeville Professor W. C. <mark>Saunders</mark>, Blacksburg George N. Stuart,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
