{"document": {"bbox": [1364.12, 576.19, 1520.49, 1265.23], "bbox_id": "e41ae5c26e", "file": "AppomattoxNewspapers_1926-1933a_0376.pdf", "page": 1, "text": "Memorial day was fittingly observed here on Monday, and owing to inclement weather services were held in Court housethe day being deferred in order to observe Jeff Davis Memorial. Dr. Franklin, of N. Y., an old citizen of Appomat tox made the address which was much enjoyed. The service was in charge oi the U. D. C. The graves at the cemetery were decorated and wreathed in flowers. Dinner was served and all enjoyed the service. A male quartetProf. G. O. Gordon. Don Moses, J. C. Caldwell and W. W. Scott furnished splendid music. Mrs. John W. Davis, ot Lynchburg, made an address Mrs. Virginia LeGrand gave the Unfurled Banner and Mrs. Susie Roberts, of Char lotte, C. H., gave several hum orous selections. The veterans of the e.ounty are as follows Chas. M. Cole man, George W. Cheatham. C. W. Caldwell, R. jE. Cald well, D. A. Christian,C. C. Ferguson, D. P. Ferguson, S. T. Marsh,F. B. Moore, S. N. Ransom, J. G. Whitaker, Mil- ton Isbel, and John A. O Brien. Most of these veter ans were absent some attend ing the reunion at Charlotte, N. C., and hence only three were present. Visitors attending from Charlotte Courthouse were Mr. and Mr. B. N. Hutcheson, Mrs. Frank Bedinger, Mrs. Lester, Mrs. S. W. Roberts. An annual roll call of veter ans should be held and a short memorial to each absentee should be read. The roster is getting thin and the Daugh ters are always glad to servo in glorifying and perpetuating deeds of our heroic soldiers."}, "highlight": {"text": {"matched_tokens": ["Hutcheson", "Frank", "W"], "snippet": "and Mr. B. N. <mark>Hutcheson</mark>, Mrs. <mark>Frank</mark> Bedinger, Mrs. Lester, Mrs. S. <mark>W</mark>. Roberts. An annual roll"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson", "Frank", "W"], "snippet": "and Mr. B. N. <mark>Hutcheson</mark>, Mrs. <mark>Frank</mark> Bedinger, Mrs. Lester, Mrs. S. <mark>W</mark>. Roberts. An annual roll"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. McKinney and H. <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. McKinney and H. <mark>W</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1500.07, 931.7, 2404.55, 1261.65], "bbox_id": "fa274dcf24", "file": "AppomattoxNewspapers_1908-1909a_0379.pdf", "page": 1, "text": "Mrs. Martha A. Clark Mrs. M. A. Clark, a lifelong resident of Pamplin, died at her home there Monday after a lingering illhess. She is sur- many pleasant and helpful memories of my fellow-student of former years. G eo . B raxton T aylor . CHORUS GIRLS CAN EAT AGAIN is reported to be I one of two winners in the flag contest of the schools of that city., Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward County, has designate ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of- Frank -W. Gilliam, game warden, on Sun day, April 28_. Pegram will remain in th Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Frank", "W"], "snippet": "the alleged murder of- <mark>Frank</mark> -<mark>W</mark>. Gilliam, game warden, on"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W"], "snippet": "the alleged murder of- <mark>Frank</mark> -<mark>W</mark>. Gilliam, game warden, on"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.64, 1023.31, 1669.79, 1282.95], "bbox_id": "96536c84bd", "file": "AppomattoxNewspapers_1926-1933a_0379.pdf", "page": 1, "text": "Miss Ann Abbitt, the young daughter of Dr. J. B. Abbitt, of Norfolk, Va., is reported to be one of two winners in the flag contest of the schools of that city. Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward COunty, has designat ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of. Frank -W. Gilliam, game warden, on Sun day, April 28. Pegram will remain in the Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Frank", "W"], "snippet": "the alleged murder of. <mark>Frank</mark> -<mark>W</mark>. Gilliam, game warden, on"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W"], "snippet": "the alleged murder of. <mark>Frank</mark> -<mark>W</mark>. Gilliam, game warden, on"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [302.4, 1147.88, 459.95, 1766.6], "bbox_id": "3c87660cfb", "file": "AppomattoxNewspapers_1902-1905a_0334.pdf", "page": 1, "text": "The Electric Railroad for Ap pom attox. On las! Thursday a large Dumber .of represbnative men of Appomattox and Charlotte counties met at the Red House for the purpose of organizing capital to construct au elietric railway from Appcmut- iix station, on the Norfolk and Wes tern Railway to Drakes Branch, on he Southern Railway. It is pro posed to run this road by Red House, which is on the border of the two counties, and by Charlotte Court house to Drakes Branch. Mr. Frank S. Jennings was cho sen to preside over the meeting and Mr. C. M. Hutcheson was elected secretary. A company was organized with the following officers and members President, B. P. Eggleston, of Drakes Branch Vice President S. L. Ferguson, of West Appomattox Treasurer, E. C. Thornton, of Char lotte Courthouse Secretary, C. M. Hutcheson, of Charlotte Courthouse Directors Colonel Joseph Button, of Walkers Ford J. P. L. Fleshman, of West Appomattox J. C. Jones of West Appomattox H. D. Flood of West Appomattox E. C. Marshal of Red House W. F. Cuuniughani, of Red House J. C. Carrington, W. H. Smith, of Chariotte Couithouse George B. Russell, P. W. Payue, of Drakes Branch G W. Berkley, of Rough Creek Charter members H. D. Flood, J. C. Jones, J. R.Hors ley, S L. Feiguson, J. P. L. Flesh- man, J. R. Atwood, R. F. Burke, C. W. Hancock, Dr, J. B. Abbitt, L. E. Smith, J. T. Moses, J.L. Driskill, W H. Lewis. W, T. Collins, L. C. Mar shall, C. P. Marshall, W. F. Cun ningham, F. S. Jennings, lr G. W. Jones, L. P. Bailey, G. W. Berkley, W. H. Webb. W. M. Berkley. John W. Elam. C. M. Hutcheson A.L.Cox B. P. Eggleston W. H. Smith, J. E. Robertson, J. C. Carrington, F. C. Thornton, W. G. Williams, W. E. Scott, S. C. Daniel, George B. Rus"}, "highlight": {"text": {"matched_tokens": ["W", "Hutcheson"], "snippet": "W. M. Berkley. John <mark>W</mark>. Elam. C. M. <mark>Hutcheson</mark> A.L.Cox B. P. Eggleston"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Hutcheson"], "snippet": "W. M. Berkley. John <mark>W</mark>. Elam. C. M. <mark>Hutcheson</mark> A.L.Cox B. P. Eggleston"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1246.99, 570.19, 1387.75, 1065.74], "bbox_id": "a2b61ad865", "file": "AppomattoxNewspapers_1912-1915a_0524.pdf", "page": 1, "text": "bill be passed because of critic! his department Mr. Koiner went over the wort the department with the board,? the members were much gratified the progress he has made and his reports of the work being do State Veterinarian Ferneyhou combating the foot-and-mouth d Mr. Koiner stated that there very little hog cholera in the and that it is appearing in r few sections. Representatives from the Trucking Exhibitstation apperJ fore the board and said that 1 folk station was doing valuable  It was stated that Bert Hal trucker, sold .last year from a I six acres 12,000 worth of truck, ing how much may be done by sive farming. Virginia grows  cent, of the spinach crop of the 1 States, and it is valued at 1,5 Professor Hutcheson, of Bias manager of the four sub-expo- stations, discussed the work for the coming year, and said it would be made as practical helpful as possible. Inspectors for the ten district! f appointed as follows First dia Isaac B. Clarke, of Tasley district, J. C. Oodd, of Portsu Third district, John A. Lester, Chesterfield Fourth district, U Hatchett, of Lunenburg Fifth dli W. C. Witcher of Pittsylvania district, John E. Withers, of bell Seventh district, G. V. P of Greene Eighth district, Walker, of Culpeper Ninth d J. N. Alexander, of Pulaski, and t district, J. H. Leech, of Rockig Governor Stuart sent to the for confirmation the following-, nations- to the State tural Board Frank fLindsaj,j Portsmouth Robert H. Angell, of, anoke Robert H. Gray, of Le and W. W. Cproul, of Staunton. are for reappointment. The te for four years, dating from Mardj"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "valued at 1,5 Professor <mark>Hutcheson</mark>, of Bias manager of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "valued at 1,5 Professor <mark>Hutcheson</mark>, of Bias manager of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
