{"document": {"bbox": [678.48, 203.69, 844.06, 676.87], "bbox_id": "17a8e2c947", "file": "AppomattoxNewspapers_1892-1898a_0453.pdf", "page": 1, "text": "Wheu sheriff Coleman passed out of the building to the broad stone porch, he was accosted by R. H. Browning, and the heated words that ensued soon led to blows, sev eral of which were exchanged. A very few minutes after the difficulty, Field Smith, a well-known resident of Appomattox, denounced the sher iff, and another difficulty was nar rowly averted. Mr. Coleman has been sheriff of Appomattox county for a good many years. He will be opposed in his candidacy for re-election to the office spring after next by Mr. Frank W. McKinney. A gentleman from Appomattox who arrived in the city yesterday said to a reporter of the News that Mr. Coleman had stated to several parties since the political meeting on Thursday, that he was a candidate for the legislature as the floater from Appbmattox and Campbell. Mr. Coleman has been a staunch Democrat for many years, and his action has been a surprise to his many friends. On Friday Mr Coleman told a friend that he was iu the fight and I mean business. The editor of this paper was not present when the altercation between the sheriff and Mr. Browning took place nor when the sheriff announced himself an independent candidate for the House of Delegates, but from the leliable information we liather there seems to be little doubt that the report given of the affair by the News is correct, except that which is corrected by card is this issue."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "after next by Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. A gentleman from Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "after next by Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. A gentleman from Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> and H. <mark>W</mark>. Mc"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> and H. <mark>W</mark>. Mc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [630.26, 508.72, 783.71, 705.05], "bbox_id": "307cbaf4f4", "file": "AppomattoxNewspapers_1918-1922a_0488.pdf", "page": 1, "text": "Saturday the 27th day of Au gust, 19 2 1, at 1 1 oclock A. M. offer for sale, at public auction, on the premises, a tract or parcel of 165.02 acres of land with the build ings thereon, situate, lying and being in Clover Hill District, in the County of Appomattox, State of Virginia, about three miles north from Appomattox Courthouse, known as the Frank W. McKinney pises. Buildings. This property has npon it a substantial residence of seven rooms with two halls and three porches, a good tenant bouse of four rooms, stable for six horses, three tobacco barns, corn house with sheds for granary and tools, cow baru, smoke house and other"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Courthouse, known as the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> pises. Buildings. This property"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Courthouse, known as the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> pises. Buildings. This property"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.65, 593.94, 2139.33, 729.14], "bbox_id": "a3e98b225c", "file": "AppomattoxNewspapers_1922-1923a_0343.pdf", "page": 1, "text": "PUBLIC SALE. By H. C. Babcock, auc tioneer, of Personal Property in Appomattox county, on SATURDAY, November 3, 906. Having sold my farm, I shall proceed to sell at auctiou ou the premises the Frank W. McKinney farm , the third day of November 1906, my personal property consisting of 5 head of horses, 2 milch cows and one calf, several hogs, 1 new 2-horse wagon, wagon and plow harness, farming Implements. Also a large lot of household furniture, A quantity of feed, c. Terms-All sums of ten dollars, and under cash over ten dollars four months credit with approved security will be given. ! lie public Is cor dially invited to attend the sale. Sale com mences promptly at 10 a. m. C. L.D. MILLER."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "ou the premises the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> farm , the third day"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "ou the premises the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> farm , the third day"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1844.38, 613.32, 2002.3, 648.07], "bbox_id": "6108a095ee", "file": "AppomattoxNewspapers_1922-1923a_0622.pdf", "page": 1, "text": "Mr. J. P. L. Fleshman and Sher iff Frank W. McKinney were in Farmville last Monday on business."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Mr. J. P. L. Fleshman and Sher iff <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> were in Farmville last Monday on business."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Mr. J. P. L. Fleshman and Sher iff <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> were in Farmville last Monday on business."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [634.54, 889.09, 791.31, 928.34], "bbox_id": "4302a789aa", "file": "AppomattoxNewspapers_1898-1902a_0219.pdf", "page": 1, "text": "Miss Fannie McKinney went to Appomattox yesterday to visit, her brother, Mr. Frank W. McKinney.  Lynchburg News of Tuesday."}, "highlight": {"text": {"matched_tokens": ["McKinney", "Frank", "W", "McKinney"], "snippet": "Miss Fannie <mark>McKinney</mark> went to Appomattox yesterday to visit, her brother, Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>.  Lynchburg News of Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "Frank", "W", "McKinney"], "snippet": "Miss Fannie <mark>McKinney</mark> went to Appomattox yesterday to visit, her brother, Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>.  Lynchburg News of Tuesday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1130.66, 826.74, 1247.62, 1085.54], "bbox_id": "a661b8c98c", "file": "AppomattoxNewspapers_1902-1905a_0348.pdf", "page": 1, "text": "In the Clerks Office of the Circuit Cr Appomattox county, in vacation, 1104, Roberta Nowlin and Geo,W.  her husband, Ella M. Merryman, K  Ayeres and John S. Ayeres herv Harriet L. Ayeres and Tho8.P,Ar husband, Mary Morgan and N, .. her husband, Haynes B Merryman, Merryman, Lizzie Merryman and Murphy ........................................  against Woodson Whitehead, Camillus Thos. D. Christian, Trustee, Benjamin! ryman. Hooter Merryman, Wylie Mr5 Lula Scott Foy and the unknown Hector A,W hitehead deceased..Defer I n C hancery . The object of this suit is to ascer settle the debts of Hector A Whiteh ceased, to make sale of the real es which said Hector A. Whitehead diedf and possessed, to divide the proceed the payment of his debts, among bisV law and to settle the account of   trator, Frank W. McKinney. And it appearing by affidavit filed If tain of the heirs of Hector A. White, ceased, who are interested in the pro be disposed of m this suit, are unkBor who have been made defendants in  by the general description of pit kn.wn. It is ordered that the said unknown do appear here within fifteen days ai due publication of this order once aw., four successive weeks in the Appo and Buckingham T imes , a newspaper lished in this State, and do whatever necessary to protect their interest to suit. A copyteste GEO. T. PEERS, THOS. D. CHRISTIAN, p. Q."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "the account of   trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "the account of   trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1111.7, 802.39, 1250.87, 1061.38], "bbox_id": "2b1325d217", "file": "AppomattoxNewspapers_1902-1905a_0350.pdf", "page": 1, "text": "In the Clerks Office of the Circuit Court of Appomattox county, in vacation, July 18th. Iw4, Roberta Nowlin and Geo, W. Nowlu her husband, Ella M. Merryman, Kate W  Ayeres and John S. Ayeres her husband!? H arriet L. Ayeres and Thus. P, Ayeres her husband, Mary Morgan and N, P. Morgan her husband, Haynes B. Merryman, JnoTO. Merryman, Lizzie Merryman and W. H, M u r p h y . . . ................................................... Plaintiffs against Woodson Whitehead, Camillus Christian Thos. D. Christian, Trustee, Benjamin Mefa ryman. Heater Merryman,Wylie Merryman,, Lula Scott Foy and the unknown heireof Hector A,W hi tehead deceased. .Defendant T n C hancery . The object of this suit is to ascertain and! settle the debts of Hector A Whitehead,de- j ceased, to make sale of the real estate of  which said Hector A. Whitehead died seized  and possessed, to divide the proceeds, after the payment of his debts, among his heirs at law and to settle the account of hisadminh- trator, Frank W. McKinney.  And it appearing by affidavit filed that cer tain of the heirs of Hector A. Whitehead, de-  ceased,who are interested in the property tin be disposed of in this suit, are unknown and! who have been made defendants in said wfit by the general description of parties un- kne-wn. I t is ordered that the said unknown parttei do appear here within fifteen days after the  due publication of this order once a week for four successive weeks in. the Appomattoii and Buckingham T im us, a newspaper pub lished in this State, -md do whatever may be necessary to protect their interest in said suit. A copyteste GEO. T. PEERS, Clerk. THOS. D. CHRISTIAN, p. q."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "account of hisadminh- trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>.  And it appearing by"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "account of hisadminh- trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>.  And it appearing by"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [620.9, 840.96, 779.95, 1070.48], "bbox_id": "ce12d81498", "file": "AppomattoxNewspapers_1902-1905a_0342.pdf", "page": 1, "text": "In the Clerks Office of the Circuit Court o fX p0LIil!tto  ty. In vacation. July I6t,h l.KM, Roberta Nowlin and Geo, D. Nowln her husband, Ella M. Merryman, Kato W Ayeres and John S. Ayeres her husband H arriet L. Ayeres and Thos. P, Ayeres he husband, Mary Morgan and N, P. Morgan her husband, Haynes B. Merryman, Jno. O, Merryman, Lizzie Merryman and W. R M urphy............................ . ............... Plaintiff, against Woodson Whitehead, Camillas Christian Thos. D. Christian, Trustee, Beniamin Mer- ryman, Hester Merryman,Wylie Merryman Lula Scott Foy and the unknown heirs of Hector A, W hitehcad deceased.. Defendants. I n C hancery . Is to ascertain and settle the debts of Hector A Whitehead, de ceased, to make sale of the real estate of which said Hector A. Whitehead died seized and possessed, to divide the proceeds after the payment of his detits, among his heirs at. law and to settle the account of his adminis trator, Frank W. McKinney. And it appearing by affidavit filed that cer tain of tbe heirs of Hector A. Whitehead de ceased, who are interested in the property to be disposed ol in this suit, are unknown aud who have been made defendants in said suit kn, wu Fonerii Ascription of parties un- It is ordered that the said unknown parties do appear here within fifteen days after the due publication of this order once a week for ronr successive weeks in the Appomattox and Buckingham T imes , a newspaper pul Ifhodm tins State, and do whatever may be"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "of his adminis trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "of his adminis trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1113.1, 812.22, 1249.37, 1071.26], "bbox_id": "f2277ecc39", "file": "AppomattoxNewspapers_1902-1905a_0354.pdf", "page": 1, "text": "in the Clerks Office of the Circuit Court mJkPT i tto.x cZantK -in nation Jl 1U04, Roberta Nowlin and Geo, W No her husband, Ella M. Merrymin Kate l wlri?.? TDi Jhn 8- A Veres her hustj Harriet L. Ayeres and Thos. P, AvSff husband, Mary Morgan and N, P. Mold her husband, Haynes li Merryman, Jnof Merryman, Lizzie Merryman and wL against ..... riamtii Woodson Whitehead, Camillus Chriidi V ls?nTrustee, Benjamin Mil ryman, Hester Merryman,Wylie Mermni Lula Scott Foy and the unknown heirs Hector A. Whitehead deceased..Defends! I n C hancery . this suit is to ascertain a, settle the debts of Hector A Whitehead,dt ceased, to make sale of the real estate L which said Hector A. Whitehead died seizfl and possessed, to divide the proceeds, afil tbe payment of his debts, among his heirsi law and to settle the account of hisadmiul trator, Frank W. McKinney. And it appearing by affidavit flled thatci tain of the heirs of Hector A. Whitehead, d, ceased, who are interested in the property I be disposed of in this suit, are unknown r who have been mado defendants in said s by the general description of parties known. It is ordered that the said unknown partifl do appear here within fifteen days after im due publication of this order opce a week ftl four successive weeks in the AppomattA and Buckingham T imes , a newspaper pul 1 ished in this State, and do whatever may ta necessary to protect their interest in sal suit.  A copyteste GEO. T. PEERS, ClerkJ THOS. D. CHRISTIAN, p. q."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "account of hisadmiul trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "account of hisadmiul trator, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. And it appearing by"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1914.65, 475.32, 2091.44, 929.37], "bbox_id": "1d81dfa11e", "file": "AppomattoxNewspapers_1943-1947a_0237.pdf", "page": 1, "text": "In 1871 came Richard F. Burke from Burkeville, Nottaway County, Virginia and settled in what is n6w the Town of Appomattox. He w.s local agent for the Virginia and Tennessee Railroad. Later the name was changed to Norfolk and Western and he continued with them for some time. Being a man of much energy, he was active in other business and civic undertak-1 ings. He and Frank W. McKinney, operated a fertilizer business un -1 der the firm name of Burke  Mc Kinney, which was a successful en terprise and rendered a service to the community. Later, seeing the necessity of a medium of exchange for Appomattox County, he went to work, organized and founded The Bank of Appomattox. It prov ed to be a success and a further evidence of his foresight and sound judgment. Around the turn of the century he Was elected treasurer of the county, which oifiea he held for a number of yevs in fact, until his death in 19-14. He was st ir.an of scerling qualt.cs, always pror.vpt and  errct in . 1 of his tra sat tions and hel l the respect and confidence of the people.  After the cour house burned in 1892, quite a few citizens were in favor of moving the court house to the Town of Appomattox.There was considerable opposition to th removal. An election was held and the outcome showed a majority in favor of rebuilding the court house in the Town of Appomattox, In stead of on the old site. This ma- jjrity was secured in spite of the fact that any voter who did not vote was recorded as against re moval. Col. Richard F. Burke took a leading part in the election and made speeches a.l over the county,"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "undertak-1 ings. He and <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>, operated a fertilizer business"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "undertak-1 ings. He and <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>, operated a fertilizer business"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1776.23, 1477.96, 1942.73, 1788.91], "bbox_id": "d5bed654dd", "file": "AppomattoxNewspapers_1902-1905a_0161.pdf", "page": 1, "text": "hail. At this place the clouds seem ed to separate, but quickly gathered one mile northwest, and so damaged many of the crops that the plow is already turning under the broken stalks and torn leave. Among the snfferers on this side of the county who lose heavily, and who are, prob ably without insurance, are James 1 Caldwell, M. C. Caldwell, Frank W.  McKinney, II. C. Babcock, L. M. Mitchell, Geo. Miles, Jos. Garrett, Jno. Thornhill, Jno. Martin, Edgar  Martin, and numerous other smallei farmers. The storm passed on into Amherst county, where it wrought great havoc to crops and bridges. Our people gather and talk of the destruction. While all business will feel the effects of it, many console themselves by saying that the prices which tobacco is now bringing would hardly have paid the fertilizer bills, any way.  The oldest inhabitants say that it was tbe most disastrous storm which ever visited the county I in their lime."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Caldwell, M. C. Caldwell, <mark>Frank</mark> <mark>W</mark>.  <mark>McKinney</mark>, II. C. Babcock, L."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Caldwell, M. C. Caldwell, <mark>Frank</mark> <mark>W</mark>.  <mark>McKinney</mark>, II. C. Babcock, L."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [780.69, 344.02, 974.58, 1819.87], "bbox_id": "b0336544f9", "file": "AppomattoxNewspapers_1954-1955a_0099.pdf", "page": 1, "text": "Goin, Mrs. Lessie. Transferred to C. H Gray, Thos. F. Dead. Gobble, H. Clarence. Transferred to C. H. Houseman, Adolphus. Transferred to Cheatwood. Hamilton, William S. Dead. Harris, Z. N. Dead. Hamilton, John D. Dead. Harris, I. N. Dead. Harris, J. D. Dead. Hackett, J. C. Dead. Harris, Mrs. Jo Ella. Dead. Hudgins, R. B. Transferred to Buck ingham. Hamilton, R. S. Transferred to Lynchburg. Hanenkrat, Mrs. Lena. Transferred to C. H. Hanenkrat, Chas. F. Transferred to C. H. Handy, Emmett. Transferred to C. H. Handy, Mrs. Cassie. Transferred to C. H. Hamilton R. A. Jr. Transferred to Lynchburg. Hamilton, E. N. Transferred to C. H. Hamilton, J. Russell. Transferred to C. H. Hamilton, Henry. Transferred to C H. Hamilton, Mrs. Jennie. Transferred to C. H. Hamilton, Mrs. Emmaline. Trans ferred to C. H. Hamilton, W. Joe. Dead. Hollins, Mrs. Hattie. Transferred to C. H. Haley, R. B. Transferred to C. H. Hamilton, Mrs. Gladys I. Transfer red to Lynchburg. Inge, Thomas H. Dead. Inge, Turner P. Dead. Inge, Ashby B. Dead. Inge, Dabney. Dead. Inge, Homsley. Dead. Inge, Joel. Dead. Inge, H. P. Transferred to C. H. Inge, Mrs. Arrissa. Dead. Inge, Howard. Dead. Jenkins, Joel W. Dead. Jenkins, R. S. Dead. Johnson, W. T. Dead Johnson W. R. Dead. Jenkins, Joel W. Jr. Dead Jones, Robert A. Transferred to C. H. Jerrells, Mrs. Bertha F. Transferred to C. H. Jerrells, Harry W. Transferred to C. H. Jerrells, Wesley A. Transferred to C. H. Johnson, Herman J. Transferred to C. H. Johnson, E. O. Transferred to C. H. Jones, J. F. Transferred to Lynch burg. Jones, Fred Transferred to C. H. Jones, S. P. Transferred to C. H. Jamerson, Mrs. Frances S. Transfer red to C. H. King, Idelle F. Transferred to Arl ington. Lucado, Joseph Dead. LeGrande, W. Joe Transferred to C. H. Lucado, Ira L. Transferred to Lynch burg. Lucado, R. M. Transferred to Oak ville. Lucado, Herbert. Dead. Morris, Nat. R. Dead. Morris, Luther J. Transferred to C. H. Morris, Eugene I. Dead. Morris, R. W. Dead. McKinney, Frank W. Dead. Morris, Luther E. Transferred to C. H. McCormick, Willie. Transferred to Oakville. Martin J. Holmesy. Transferred to C. H. Morris, Wiley W. Transferred to C H. McGinnis, Edward. Dead. Mayberry, Joe J. Transferred to C H. Mitchell, Robert M. Dead. Mitchell, C. W. Dead. Morris, Chas. E. Dead. Mitchell, Ewen. Transferred to C H. Martin, Mrs. Mollie J. Transferred to C. H. Marsh, Alfred. Transferred to Oak ville. Morris, Earl. Transferred to Lynch iburg. Martin, Charles. Transferred to Lynchburg. Morris, Julian. Transferred to C. H. Mayberry, J. H. Transferred to C. H. Martin, Joel W. Transferred to C. H. Mays, Mrs. Lillian. Transferred to Rustburg. Martin, Sam R. Dead. Mann. R. M. Dead. Mann, Myrt. Transferred to Walk ers Church. Mitchell, W. W. Transferred to C. H. Mitchell, L. C. Transferred to C. H. Mitchell, Floyd. Transferred to C. H. Morris, Vara E. Transferred to Lynchburg. Marks, R. D. Transferred to C. H. Marks, Mrs. R. D. Transferred to C. H. McFadden, Charlie. Transferred to C. H. McFadden, Alenbrey. Transferred to C. H. McFadden, Jim. Dead. McConchie, G. H. Transferred to Culpepper. Nowlin, J. B. Dead. Nowlin, J. Tucker. Dead. Nunnally, J. A. Dead. Nackols, Mrs. Catherine. Transfer red to C. H."}, "highlight": {"text": {"matched_tokens": ["McKinney", "Frank", "W"], "snippet": "Morris, R. W. Dead. <mark>McKinney</mark>, <mark>Frank</mark> <mark>W</mark>. Dead. Morris, Luther E."}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "Frank", "W"], "snippet": "Morris, R. W. Dead. <mark>McKinney</mark>, <mark>Frank</mark> <mark>W</mark>. Dead. Morris, Luther E."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1785.1, 289.2, 1950.87, 1051.64], "bbox_id": "fd6a9f21da", "file": "AppomattoxNewspapers_1915-1918a_0169.pdf", "page": 1, "text": "Frank W, McKinney, the pop ular Sheriff of Appomattox county, passed away at his old ancestral home, near this town, Sunday evening, in the 61st year of his age. Since January last Mr McKinney had been a great sufferer, and many hospitals and surgeons had been visited in the hope of finding some relief. Early in this month he suffered an op eration in a Lyncaburg hospit al, which operation revealed his troublecancer. After his wound healed he was brought home, where the tenderest care has been administered by his wife aud brother. He contin ued to suffer, and grew weaker each day until the end came, which was a great relief to his suffering frame. Frank was born and reared in the home where he died. He was a faith ful and courageous officer, and possessed the confidence and esteem of the public in the highest degree. He was a member of the Presbyterian church, and was full recon ciled to his God and feUow- man. The deceased is survived by his wife and little daugh ter, Frankie and the follow ing brothers and sisters J. W. and J, L. McKinney, and Mrs. C. A. Poore, of Lynchburg H. Winston McKinney, Appomat tox Mrs. Kate Wright and Mrs. Fannie McKinney, of Roanoke and Mr. William McKinney, of the U, S. army. The funeral took place from his late home and was conduct ed by his pastor, Kev. J. C Le,.s, where a-large crowd of relatives and friends had as sembled, many from Roanoke and Lynchburg, and this coun tyalthough the weather was threatening, a laige crowd of the friends of this popular citi zen came to pay a last respect to a departed friend. Hand some floral designs bedecked his grave. Mrs. Bessie James and Mrs. ft. E. Caldwell, jr., sang very sweetly several selections. The following acted as pall bearers Dr. D. N. Twyman, Messrs W. B. Gala well, Robert Irby, B. G. Anderson, J. O. Woodson and ..A. il. Clement,"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "<mark>Frank</mark> <mark>W</mark>, <mark>McKinney</mark>, the pop ular Sheriff"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "<mark>Frank</mark> <mark>W</mark>, <mark>McKinney</mark>, the pop ular Sheriff"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [599.27, 329.58, 758.46, 748.76], "bbox_id": "ae16d66fba", "file": "AppomattoxNewspapers_1918-1922a_0486.pdf", "page": 1, "text": "As Trustee in a deed of trust from Robert A. Jones and wife, bearing date on the 10th day of July, 1920, of record in the Clerks Office of Appomattox Oounty in Deed Book No 20, page 396, de fault having been made in the pay ment of a portion of the debt there by secured, and being required so to do by the beneficiary therein and in pursuance of an order of the referee iu bankruptcy ot the District Court of the United States for the Western District of Virginia in the matter of Robert A. Jones, Bank rupt, permitting the foreclosure of the said deed of trust I will on Saturday the 27th day of Au gust, 1921, at 11 oclock A. M offer for sale, at public auction, on the premises, a tract or parcel of 165.02 acres of land with the build ings thereon, situate, lying and being in Glover Hill District, in the County of Appomattox, State of Virginia, about three miles north from Appomattox Conrthonse, known as the Frank W. McKinney place. Buildings. This property has upon it a substantial residence of seven rooms with two halls and three porches, a good tenant house of four rooms, stable for six horses, three tobacco barns, corn house with sheds for grsnary and tools, cow barn, smoke house HDd other necessary buildings. Land. Some forty or fifty acres of this tract is woodland. The re mainder is in cultivation and pas tnre. The land is well watered and the soil is adapted to the grow-"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Conrthonse, known as the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> place. Buildings. This property"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Conrthonse, known as the <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> place. Buildings. This property"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.3, 1516.59, 1460.49, 1633.84], "bbox_id": "f066b5db38", "file": "AppomattoxNewspapers_1892-1898a_0280.pdf", "page": 1, "text": "A number of young people of the lage attended service at Old Con- d Church last Sunday affernoon ong them were Miss Sallie Burke Nillie Dickenson, and Miss e Taylor, and Mr. Richard Smith  Boyd Ford, Mr. W. A. Moses, Frank W. McKinney, Mr. hard Coleman, Mr. Hallie Burke, d Mr. Robt Harvey."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Mr. W. A. Moses, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>, Mr. hard Coleman, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "Mr. W. A. Moses, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>, Mr. hard Coleman, Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1742.33, 264.64, 1904.56, 1796.27], "bbox_id": "a034ecb80e", "file": "AppomattoxNewspapers_1892-1898a_0069.pdf", "page": 1, "text": "Hop  and Supper at H otel A ppom attox. On the evening of July 27th there occurred an event which, for the en joyment of the moment and for the pleasant memories engendered,stands conspicuously eminent in the social annals of Appomattox. It was a hop given by the yonng men of our town. Concdrd, Spout Spring, Campbell, Prince Edward and Appo mattox furnished delegations of the most beautiful, and toilets of ex quisite and artistic taste. There was a lovely night with the fu ll moon shedding its mellow light, there were the sweet strains of music with the rythmic shuffling of dancing feet, and there was the merry talk and laughter of the gay participants, all combining to render the occasion pe culiarly enjoyable and a pronounced success. The future can contain nothing pleasanter than a repetition, and Appomattox may well say that for her to undertake is to succeed. The young ladies present and their toilets were as follows. Miss M. Anna Jones, lemon silk, trimmed in Irish point lace, passe menterie, no ornaments. Miss Nannie Wharton, white silk, lace trimmings. Miss Susie Jones, white crape, lace and diamonds. Miss Maggie Bevely, pink silk and natural flowers. Mrs. C. W. Hunter, black silk and white mulL Miss Slate OConner, albatross and point lace. Miss Nina Jones, orange silk,black point lace and diamonds. Miss Susie Evans, pink m ail, point lace and diamonds. Miss Sallie Arrington, cream silk and point lace. Miss Elma Shearer, white silk m all, and pearls. Miss Lula Peers, blue m ull, black lace, natural flowers, and diamonds. Miss Agnes Wooten, pink silk, natural flowers, and lace. Miss Erie Jones, white albatross, lace, and pearls. Miss Lucy Smith, blue mull,natu ral flowers. Miss Lina Davidson, white mnll and natural flowers. Mrs. Martin Harvey, white m ail, lace, and natural flowers. Miss Mattie Tweedy, pink lawn and point lace. Miss- Sallie Bnrke, white mull, natural flowers, and diamonds. Miss Maggie Smith, N ile green, natnriir flowers, no ornaments. Miss Lizzie Davidson, bine silk, natural flowers, no ornaments. Mrs. J. R. Atwood, black satin, point lace, and diamonds. Mrs. Lena Smith, white mnlL Miss Polly Main, black lace, rib bons, and natural flowers. Miss Florrie Arrington, cream silk, natural flowers, and point lace. Miss Viola Shearer, white alba tross, lace, and diamonds. Miss Sallie Ballou, white m ull and lace trimmings. Miss Phinizy Abbitt, white silk and lace t rim m ing. Miss Carrie Lee Davis, yellow crepon and rubies. The following ggbtlemen were present J. H. Bailey, Ewen Davidson, A. Dunn, H. G. Smith, Jno. Robertson, Edmund Miles, Frank McKinney, Clem Coleman, Taylor, W. W. Statham, Irby, J. Robertson, W. E. Doss, Wm. J. Trent, Collier Trent, G. W. Chockley, R. C. Harvey, Chap Jones, Wm. Moses, Boht. Watkins, Jno. M. Miles, Overton Nowlin, S. L. Ferguson, Dr. Julian Abbitt, Senator H. D. Flood. The gratitude of every one is due to qur kind host and hostess, Mr. and Mrs. Smith, who extended to the yonng people the well-known hospi talities of Hotel Appomattox, and who by their untiring efforts con tributed largely to the charming sncce88 of the occasion. Pam plin City B udget. The Baptists commenced a series of meetings at Hixbnrg on Sunday last. They are largely attended. Rev. Dr. Bagby, of Farmville, is as sisting the pastor, Rev. J. H. Conch, in the meetings. Misses Virginia Gilliam, and An nie McCraw, of Buckingham, are visiting at Mr. H. E. Gilliams. Rev. E. M. Craig returned to his charge at this place on the 31st nit., after a vacation of a month. Mr. C. S. McDearmon, night ope rator at yonr place, was in town to day. Mrs. Chancy, of Sntherlin, Va., is visiting at Mr. W. BL Rices. Mr. R. B. Green, of Richmond, is in town. P. H. E. Pkmplin City, Aug. 2."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney", "W", "W"], "snippet": "Jno. Robertson, Edmund Miles, <mark>Frank</mark> <mark>McKinney</mark>, Clem Coleman, Taylor, <mark>W</mark>. <mark>W</mark>. Statham, Irby, J."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney", "W", "W"], "snippet": "Jno. Robertson, Edmund Miles, <mark>Frank</mark> <mark>McKinney</mark>, Clem Coleman, Taylor, <mark>W</mark>. <mark>W</mark>. Statham, Irby, J."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.77, 555.87, 1657.52, 613.17], "bbox_id": "d7a47d8b9d", "file": "AppomattoxNewspapers_1892-1898a_0350.pdf", "page": 1, "text": "Mr. Frank McKinney, Mr. and Mrs. E. W. Taylor are in Lynchburg attending the marriage of Miss Elizabeth Blair McKinney to Mr. Chas. R, Watts."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney", "W", "McKinney"], "snippet": "Mr. <mark>Frank</mark> <mark>McKinney</mark>, Mr. and Mrs. E. <mark>W</mark>. Taylor are in Lynchburg attending the marriage of Miss Elizabeth Blair <mark>McKinney</mark> to Mr. Chas. R, Watts."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney", "W", "McKinney"], "snippet": "Mr. <mark>Frank</mark> <mark>McKinney</mark>, Mr. and Mrs. E. <mark>W</mark>. Taylor are in Lynchburg attending the marriage of Miss Elizabeth Blair <mark>McKinney</mark> to Mr. Chas. R, Watts."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2305.79, 946.84, 2452.33, 1193.22], "bbox_id": "5489fafd48", "file": "TimesVirginian_1978_0424.pdf", "page": 1, "text": "HIGHLAND ASSOCIATES are located on - Wards- Road ,-s Ljmchburg, Va. Phone -287-  2961. Mr. W. T. Newman is owner and Mr. Frank McKinney is manager. They are designers and manufacturers of truck bodies and fuel tanks, such as Hackney Vans, frame altera tions, service equipment, stak es, dump bodies by Mark, truck security safes, fuel tanks, hoists, dumps, power gates, furniture bodies and 5th wheels. They also do quality repairing. It is a well-known fact that there is no institution fa the community that has met with greater favor with the public than this well-known establish ment. By reason of the fact that"}, "highlight": {"text": {"matched_tokens": ["W", "Frank", "McKinney"], "snippet": "Phone -287-  2961. Mr. <mark>W</mark>. T. Newman is owner and Mr. <mark>Frank</mark> <mark>McKinney</mark> is manager. They are"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Frank", "McKinney"], "snippet": "Phone -287-  2961. Mr. <mark>W</mark>. T. Newman is owner and Mr. <mark>Frank</mark> <mark>McKinney</mark> is manager. They are"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1851.8, 869.26, 2016.81, 968.56], "bbox_id": "f34bce438b", "file": "AppomattoxNewspapers_1939-1943a_0448.pdf", "page": 1, "text": "Mrs. T . M. Tjrent was hostess to her bridge club Tuesday afternoon. Vari-colored flowers were used in the living room. PI e ying were Mes- drmes D. E . Cajdwell, Jr., W. L. Farmer, Elizabeth Ford, P.M. Bur ton, W . E . Hancock, R. W . Stanley, and C.H. Robinson and Miss Frank ie McKinney, guests of the club. Prizes went to Mrs. Caldwell, Mrs. Ford and Mrs. Farmer."}, "highlight": {"text": {"matched_tokens": ["W", "Frank", "McKinney"], "snippet": "W . E . Hancock, R. <mark>W</mark> . Stanley, and C.H. Robinson and Miss <mark>Frank</mark> ie <mark>McKinney</mark>, guests of the club."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Frank", "McKinney"], "snippet": "W . E . Hancock, R. <mark>W</mark> . Stanley, and C.H. Robinson and Miss <mark>Frank</mark> ie <mark>McKinney</mark>, guests of the club."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [987.85, 639.75, 1143.52, 873.05], "bbox_id": "c90d62fb15", "file": "AppomattoxNewspapers_1908-1909a_0210.pdf", "page": 1, "text": "Warrants charging Jerr Franklin, 20 Walker Frank in, 27, and Gordon Smith, 2 . with breakinginto W- R. Re olds store and taking mol bto 50 worth of merchai iige, were served last Monda n Lynchburg. The robbery, qrith whic ny are charged, was carrie Ut Dec. 12, when Reynola -tore was broken into, th -afe badly damaged, although tot opened, and a quantity o nerchandise taken- A_ H Jlements car Was taken tht -ame night, Wind later found i, heriver nmir Lynchburg. .The arrests were made bi Jheriff H W. McKinney, D- A oonner, and Detectives C. N Tankerslejr laid W."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "made bi Jheriff H <mark>W</mark>. <mark>McKinney</mark>, D- A oonner, and"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "made bi Jheriff H <mark>W</mark>. <mark>McKinney</mark>, D- A oonner, and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [826.8, 646.02, 1147.13, 907.66], "bbox_id": "ed32593d7d", "file": "AppomattoxNewspapers_1926-1933a_0210.pdf", "page": 1, "text": "W arrants charging Jerr Franklin, 2 0 Walker Frank in, 27, and Gordon Smith, 2. -vith breaking into W- R. Re iolds store and taking mol han 50 worth of merchai Use, were served last Monda n Lynchburg. The robbery, yith whic ey are charged, was carrie ut Dec. 12, when Reynold -tore was broken into, th afe badly damaged, althoug. tot opened, and a quantity o nerchandise taken. A. H Jlements caf was taken th -ame night, tjind later found i he river near Lynchburg. The arrests were made bj sheriff H- W. McKinney, D- A Gonner, and Detectives C. N SStSS oLynchburg.Th Mr or j warrants were sworn out b Mr. Smith for investigation. jMr. Reynolds J"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "made bj sheriff H- <mark>W</mark>. <mark>McKinney</mark>, D- A Gonner, and"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "made bj sheriff H- <mark>W</mark>. <mark>McKinney</mark>, D- A Gonner, and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1457.32, 385.05, 1648.05, 1699.23], "bbox_id": "147155d55a", "file": "AppomattoxNewspapers_1922-1923a_0373.pdf", "page": 1, "text": "Thursday at noon at Libe tv Baptist Church here the marriage of Miss Lillie Neal Hancock to Mr. Abner H. Gregory was so len in Z d in tbe presence of a large audeuce. The church was decorated with cedar, chrysanthemums and carna tions and lighted with hundreds of candles. The bride met the groom under a large bell of flowers where her minister, Rev. George S. Ken- naid performed the ceremony in a very impressive manner. Miss Margaret Smith, teacher of music at the Union Acade uy oi Spout Springs, had jchaige of the music and played softly several se lections while the service was being performed. Mr. E. H. Matthew- 6on, who is at the headof the U. S. Experimental Station here, sang very sweetly Loves Old Sweet Song. Mrs. Frank Sheard, of Lynch burg, was matron of honor, and wore pink dress with roses. Miss Maude Gregory, sister of the gr-.om was maid of honor, and wore white net over pink silk and carried white roses. Capt. Nathan C. Hancock, broth er of the bride was best man. The brides attendants were Miss Margurite Marshall with Harry Hancock Miss Emma Smith with Walter B. Ellett Miss Helen Gregory with H. W. McKinney Miss Bertha Caldwell with A. .V. Jones Miss Mattie Jones with R E. Caldwell Miss Mary-Hancock with Joe LeGrande Mrs. Bessie James with Leonard Gregoiy Miss Sallie Goff with V. L. Raby Miss Maty W. Caluweil with John Goff Mies Annie Elliott witn II. C. Steele Mies Kate Cheatham with C. W. Stewart Miss Ossie Agee with William Jones. The brides maids were dressed in .white and carried pink roses. Little Virginia and Annie cock were flower giris and white aud carried pink and carnations. Royal Hancock, Tunstall gun, James Stanley, Janies Gills, Robert Walton, Willie Walton, Ben jamin.Kennard and Braxton Han cock were ribbon boys. The boys wore white suits and held white and pink ribbon. The bride wore white net trimmed in real lace over whine taffeta, and Uer bridal veil was caught with a beautiful brooch set with  tails, a gift from tbe groom, and a diamond pin, an heirloom of the family. She carried in her hand a white ptajer- book. They boarded the wes bound train tor a tiip west and will be at home to their tneuds here after the ,2tn. The bride is the very attractive young daughter of Mr. C. W. Han cock, a popular contractor of Lynchburg aud this place, and is one of the prominent and Highly connected families of the .Kate. The gioom is a fine young man of sterling qualities, a son ot Mr. N. H. Giegory, of this place arid holds a position with the N.  W. Ry. Co where be is highly esteemed by his comrades and employers. The presents presented to tbe bride were of a very high order, among them a deed to tbe hand somer. t home in the county from the father of tbe bride. This home has just been completed here and e healed throughout with generators, lighted,by acetylene gas -iud con tains every modern convenience. Tbe presents number 125 all told, and the bride is extremely happy and appreciative ovarihe thought fulness of her frieuds. RECEPTION. On Wednesday evening the s a- cious and palatial home was opened to the bridal party and an elegant reception was teudered those pres-jent. ent Rev. Mrs. Kennard presided at the table and Mrs. J. R. Atwood at the punch bowl. Mesduins E. W. Taylor, C. A. Hancock and Miss"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "Helen Gregory with H. <mark>W</mark>. <mark>McKinney</mark> Miss Bertha Caldwell with"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "Helen Gregory with H. <mark>W</mark>. <mark>McKinney</mark> Miss Bertha Caldwell with"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.61, 1369.84, 1642.39, 1525.69], "bbox_id": "21a2a0491f", "file": "AppomattoxNewspapers_1892-1898a_0347.pdf", "page": 1, "text": "The following delegates to the Baptist Young Peoples Union went up to Lynchburg Tuesday to attend the convention of that organization . Misses Rachael Caldwell, Lacy Cald well. Messrs. Richard Smith, Ed. Caldwell and Dr. W. II. Abbitt. The following also attended Mr. and Mrs. J . R. Atwood, Misses Sue Sears, Katie OConner and Messrs. Frank McKinney, Jno. AYbite, Dr. Geo. B. Taylor and Luther Le Grand."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "Katie OConner and Messrs. <mark>Frank</mark> <mark>McKinney</mark>, Jno. AYbite, Dr. Geo."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "Katie OConner and Messrs. <mark>Frank</mark> <mark>McKinney</mark>, Jno. AYbite, Dr. Geo."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.21, 1134.37, 1614.36, 1792.07], "bbox_id": "81e67734d9", "file": "AppomattoxNewspapers_1892-1898a_0121.pdf", "page": 1, "text": "T he D ea th o f M rs. M cK inney. Seldom has a death of a member of our community affected everyone so sadly as that of Mrs. Lelia McKin ney, wife of Mr. Frank W. McKin ney. The announcement of her death and its suddenness sent a shock through the entire community. On Monday last she was taken very ill at about 11 oclock at night, and the conditions being very alarming,riders were sent out in all directions for physicians. Drs. W. H. Abbitt and A. A. Rice were found and promptly responded to the summons. They did all that was possible to alleviate her sufferings and to tide her over the dangerous illness, but when the evening shades of Tuesday began to fall, Mrs McKinney passed away. The hour of her death was 5 oclock Many of her friends were telegraphed for from Lynchburg and Richmond and among those who came by the earliest train were Mr. and Mrs. Wal ter McKinney,Mrs. Poore, of Lynch burg, and Mr. Charles Peers, of Rich mond. The funeral services, which oc curred yesterday at 4 oclock, were conducted by Rev. E. M. Craig, as sisted by Rev. W. S. Royall. The re mains of the deceased were interred in the old family cemetery, just the rear of the house. A very large number of friends and relatives were present to witness the last sad rites. Mrs. McKinney was a native of Appomattox, having passed her life, until a few months ago, at OldAp- pomattox Court-House. She was a daughter of Mr. Geb. Peers, our pre sent county clerk. She was married only last May, and at the time of her death was thirty-three years of age. She was a member of the Presby terian church, and her character as a Christian and as a womanwas sfffih that it would be almost an intrusion to touch upon it. As her pastor, Mr. Craig, said, she never let a day pass without showing by some kindly j act the impress of Christs spirit ppon her."}, "highlight": {"text": {"matched_tokens": ["Frank", "W"], "snippet": "ney, wife of Mr. <mark>Frank</mark> <mark>W</mark>. McKin ney. The announcement"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W"], "snippet": "ney, wife of Mr. <mark>Frank</mark> <mark>W</mark>. McKin ney. The announcement"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.7, 223.64, 1728.03, 1387.8], "bbox_id": "295b95fef2", "file": "AppomattoxNewspapers_1918-1922a_0173.pdf", "page": 1, "text": "Rev. Lepsismuch indisposed. Mias Eva Harvey is visiting ! relatives in Lynchburg. Refreshing showers m a k e bountiful gardens and beauti ! ful flowers. Mr. Qallie Burke, wife and ! daughter, are guests here for some days Messrs U Lucado and Wilev Morris are owners of new Fords Mrs L. J. Morris is on a weeks visit to her old home in Nelsou. Misses Wave Turnas and Earie Patteson are visiting relatives in Charlotte this week Miss Mary Covington, of I Hollywood, is visiting relatives  in Lynchburg this week Miss Susie Hancock, who hue been lescMng at Blue.fleld, W. Va , is spending her vacation at home here. Prof, nd Mr Oi-awlev and young Charles a r e taking, e vacation at the heme of Mrs raw lev, in the Valley. Mr. Burnett, the electrical maintainer, will soon have his family here. He will occupy the cottage of M rs. Patteson Mr and Mrs Simpkins and Mrp. J W. Cawthorn spent the week end with her daughter Mrs John Tweedy, uear here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotte county, spept tne week end with her aunts, Meadames. J. W. Patt son aud L D. Puck ette. Mr. and Mrs Chandler Simp kinp, of Richmond, have been visiting Mrs Simpkins parents, Mr. end Mrs. J. W Cawthorn, bere. Miss Helen Morris, of V tra, spent several days t .Bt week with Miss E a Harvey hre, on ner way home from Rich tnond College. Mrs. F 14. Craig and son, Frank, are vigitiug Mrs Craigs father, at Allendale. Mr Craig stopped for a ua.y on his way to N. Y. Mr H. 8. East, son of Rev. H. Parletc East, has gone to Berryville, V., or the summer, where he is employed iu Dr. A. W. Warners pharmacy. Mr. W. 0 Moss has been vis iting iiis old home in North Carolina. He wus accompa nied here by his father and brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, Va , after spending a few days at tbe baptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo mattox. The quality of our wheal is good aud speculators are said to be buying up the farmers bread before it is threshed. Re careful how you part with your bread. The Editor received an invi tation to be present at the marriage of Frank Green and Sarau Abbitt Burke Sunday morning. These are old and 1 reliable colored citizens of Ap pomattox. A wedding supper was enjoyed Monday evening Tho ladies of New Hope eburch will have a lawn party at parsonage, Vera, Va., Sat urday, June 19th, beginning at 5 oclock. Proceeds ior benefit ! of now church. Old church I will be sold at 4 oclock. Pub  lie cordially invited. R. L. Burke, cashier of Bank j of Appomattox, and chairman ot Group Four of tue Virginia Rankers Association, left to- ! day to atteuu tbe State Con-  vernion of Rankers, which will be in session at tbe Homestead Hotel, Hot S,iriogt, Vu., June 17, lb ana 19."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "uear here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "uear here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1965.59, 228.7, 2127.69, 783.07], "bbox_id": "2328db30b9", "file": "AppomattoxNewspapers_1892-1898a_0135.pdf", "page": 1, "text": "R esolutions o f R espect. The following paper was read and adopted by the business men of Glade Spring Whereas, It has pleased an all wise Providence tp remove our as sociate, C. W. McKinney, from , our midst, therefore. Resolved, That we have sustained the loss of a man whose character endeared him to each of us as a per sonal friend. That, In energy, liberality, frank ness, courtesy aud kindness, he set us an example well worthy of emu lation. That, Knowing him as we did, from earliest manhood, it is a pleas ure to testify to the uniform consis tency of his life. His business meth ods were snch as to make friends of those with whom he had dealings, while they brought success as their result. That, As a citizen and man, his duty was faithfully done. That, In his death We are bereaved, and join our lament with that of his stricken family. That, Our sympathy deep and heartfelt, is tendered to the wife and children who suffer an irreparable loss in the .death of husband and father. That, A copy of these resolutions be furnished to the Glade Spring Citizen for publication. J. D. K en t ,  J. D. W il lia m s , V Com. M. M. M oruis 8 . j Feb. 8 th, 1894. Mr. C. W. McKinney, in reference to whom the above resolutions were adopted, was at one time a resident of Appomattox. He was a brother of Messrs. Walton and F, W. McKin ney.Editor"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "our as sociate, C. <mark>W</mark>. <mark>McKinney</mark>, from , our midst, therefore."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "our as sociate, C. <mark>W</mark>. <mark>McKinney</mark>, from , our midst, therefore."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.51, 542.23, 1624.91, 1040.13], "bbox_id": "9827ee68ea", "file": "AppomattoxNewspapers_1905-1912a_0013.pdf", "page": 1, "text": "O akville. Tire se ias of meetings held at Red Oaks by Rev. Hugh C. Smith la t week closed on Friday morning Much good was done and ten united with the church The Sunday School at Red O.ik has been very interesting this ye.tr, and we hope it will continue so Ti e wnter went to Hermon on Sunday to bear Rev. Mr. Dunkb v preach h- last sermon,the loss . egret Ye th nk Mr. DunUlej a line man and an excellent preach.  Alta. B, 8. Thorpe aud family ic turned to Lynchburg on Friday last, c ompanied by Mrs. T. G. Thorpe. Mr. Robert Gardner has left! for Lynchburg, where he hat accjibf a position as salesman in the lWrd- ware .stoic of John E. Gannaway. Messrs. Curry Abbitt and Kinckl. Martin made  flying trip to Stone wall on Friday last. Miss Jessie Thorpe who hgs been quite sick for come Fine we ere glad to say is convalescent. Miss Mary Goodman of Spout Springs visited her sister at Oak ville last week. Sheriff F. W. McKinney still vi its Oakville quite often. We art always glad to see him. Ootne again Frank. Tne O kviilescho 1 is progressing nicely wi h an enrollment of twenty- nine anil an average daily attendance of twenty odd Mr, Jim Gordon is a frequent viaitor to Otkvilie there seYiis to be some aur ctiou. We enjoy reading T he T imes"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "last week. Sheriff F. <mark>W</mark>. <mark>McKinney</mark> still vi its Oakville"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "last week. Sheriff F. <mark>W</mark>. <mark>McKinney</mark> still vi its Oakville"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.58, 390.05, 1821.51, 1381.17], "bbox_id": "67cbd95959", "file": "AppomattoxNewspapers_1918-1922a_0177.pdf", "page": 1, "text": "Misses Wave Turnes and Earle Patteson are visiting relatives in Charlotte this week MÍ88 Mary Covington, of Hollywood, is visiting relative n L nchburg this week Miss Susie Hancock, who hot been tea chin tr at Him field, Va , is spending her vacation it home here Prof, nnd M8 Irawley a n  young Charles are taking e vacation at the hme of M th rawlex, in the Valiev Mr. Rurnett, the electrical nr aintainer, will soon have his frmily here. He will occupy the cottage of Mr. Patteson Mr and Mrs Simpkins and Mrs. J W. Cawthorn spent the week end with her daughter Mrs. John Tweedy, uear here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotte county, spent tne week end with her aunts, Mesdaines J. W. Patteson and L D. Puck ette. Mr. and Mrs Chandler 8imp kins, of Ricinnorid, have beet, visiting Mrs. .Simpkinsparents Mr. end Mrs J W C.twtbori here. Miss Helen Morris, of V.wa pent several days l..at weoi with Miss K a Harvey here on tier way home I rom Rich inond College. Mrs. F 1. Craig and sor Frank, ure visiting Mrs Craig fa her, ai  Allendale , Mi Craig stopped for a úy on hi wiy to N Y. Mr H. P. E as , son of Rev H. Farlott E tst, has gone to Berry ville, Vw , , lor the Bummer where he is employed in Dr A. W. Warners pharmacy. Mr. W. 0 M ohs has been vis it ing his old home in North Carolina. He was accompu nied here by his father anc brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, Va , after spending a few days at the fiaptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo mattox. The quality of our wheat is good and speculators are said to be buying up the farmers bread before it íb threshed, fie careful how you part with your bread. The Editor reoeived an invi tutiou to be present at tbe marriage of Frank Green and IS trail Ahbitt Burke H.inday morning. These are old and reliable colored citizens of Ap I pomutti x A wedding supper was enjoyed Monday evening The ladies of New Hope church will have a lawn party at parsonage, Vera, Vo,, Sat urday, June ljfii, beginning at 5 oclock. Proceeds tor benefit of new church. Did cburch  will be sold at 4 oclock. Pub I lie coidiaily invited, j K. L. Burke, cashier of Bank of Appouiaitox, and chairman ot Group our ot the Virginia Bankers Association, left to day to aiteud the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Spring.-, Ve,, June 17, lo and 19."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "uear here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "uear here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [623.99, 379.71, 788.48, 1367.69], "bbox_id": "8d957fe034", "file": "AppomattoxNewspapers_1918-1922a_0174.pdf", "page": 1, "text": "Misses W ave Turnas and Earle Patteson are visiting relatives in Charlotte this week . Miss Mary Covington, of Hollywood, is visiting relatives m Lynchburg this week M isfl Susie Hancock, who hap been teaching a t Biuefield, vV. Va , is spending hvr vacation at home here. Prof, ond Mrs Crawley and young Charles are taking a vacation at the home of Mrs raw ley, jn the Valley. Mr. Buroett, the electrical m aintainer, will soon have his fam ily here. He will occupy the cottage of Mrs. Patteson Mr and Mrs Simpkins and Mrs. J W. Caw thorn spent the week end w ith her daughter Mrs. John Tweedy, near here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char Iotte county, spept toe week end w ith her aunts, Meadaraes. J. W. Pattason and L 1, Pnek ette. Mr. and Mrs Chandler Simp- kinp, of Richmond, have been visiting Mrs. Sim pkins parents, Mr. and Mrs. J. W Cawthorn, here. Miss Helen Morris, of Vera, spent severa day6 i..st week with Miss Eva H arvey hre, on her way home from Rich tooni College. Mrs. F .,J. Craig and son, Frank, are visiting Mrs Craigs father, at  Allendale . Mr Craig stopped for a uay on his way to N. Y. Mr. H. 8. East, eon of Rev. H. Parlett East, has gone to Berry ville, Va., tor the summer, where he is employed in Dr. A. W. W arners pharm acy. Mr. W. O Moss has been vis iting his old home in North Carolina. He was accompa nied here by his father and brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Em poria, V a , after spending a few days at the baptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo m attox. The qaaiity of our w heat is good and speculators are said to be buying up the farm ers bread before it is threshed. Be careful how you part with your bread. The Editor received an invi tation to be present at the m arriage of Frank Green and Sarau A bbitt Burke Sanday morning. These are old and reliable colored citizens of Ap pomttox. A wedding supper was enjoyed Monday evening. Tho ladies of New Hope cburch will have a lawn party at parsonage, Vera, Va., Sat urday, June 19th, beginning at 5 oclock. Proceeds ior benefit of new church. Old church will be sold at 4 oclock. Pub lie cordially invited. R. L. Burke, cashier of Bank of Appomattox, and chairm an of Group Four of the Virginia Bankers Association, left to day to attend the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Springe, Va., June 17, 18 ana 19."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "near here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "near here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [672.23, 463.73, 832.22, 912.2], "bbox_id": "40eba10896", "file": "AppomattoxNewspapers_1918-1922a_0505.pdf", "page": 1, "text": "Misses Hancock E n tertain On Monday evening Misses Virginia and Margaret Han cock gave a most elaborate fancy dress party at their home here. Mr. and Mrs. C. A. Hancack, Mr. and Mrs. Harry Hancock, Mrs. W. B. Caldwell, Mrs. C. F James, Mrs George Purdnm and Mrs. Frank McKinney were in the receiving line with the young ladies. The guests enjoyed the various games in troduced. The most enjoyable being the 30 grains of corn valu ed at 1 each which was the currency used to buy the many mementoes of the occaseion, which were purchased by the Misses Hancock while touring Europe this summer, and which were offered at auction by auctioneer Howlett Martin. The Miller Ochestra, of Lynch burg, furnished the music. The guests were ushered into the dinning room elaborately decorated with golden rod, where supper wae served for the great party. The evening came to a close with every heart full of appre ciation to the Misses Hancock for the most enjoyable party of its kind ever given in onr little town."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "George Purdnm and Mrs. <mark>Frank</mark> <mark>McKinney</mark> were in the receiving"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "George Purdnm and Mrs. <mark>Frank</mark> <mark>McKinney</mark> were in the receiving"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "J. A. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, Geo. Ab bitt, Jr.,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "J. A. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, Geo. Ab bitt, Jr.,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1650.86, 635.24, 1967.53, 1035.74], "bbox_id": "cf138648f0", "file": "AppomattoxNewspapers_1915-1918a_0572.pdf", "page": 1, "text": "Miss Jacqueline Irby has returned to Black6tone, after a visit in the home of Mr. Rob ert Irby here. Mrs. E. R. Abbitt, who has been sick in a Norfolk hospital, has been brought to her home here. Mrs. A. R. Harwood has re turned from a ten days visit to her sister, Mrs. Taylor, of Stapleton. Mrs. Russell Peacock gave a delightful party at her home Thursday evening and quite a number of out of-town guests were present. Miss Emma Hancock, just graduated from Lynohburg Business College, has accepted a position as stenographer in the law offioe of A. H. Clement. Mr. Louie Houseman, raised in Appomattox and left here 40 years ago for the West, is here on a visit to his cousin, W, P. Gills. They were reared -to- jgetherand are greatly enjoy-1 agreeable personality and will mg his visit. lingnessto serve. The men of the Frank McKinney, colored, I dormitory of the Y. M. O. A. loaded up on wine and cider I presented him with a very lone day last week and took ahandsome suitcaseBinning-"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "The men of the <mark>Frank</mark> <mark>McKinney</mark>, colored, I dormitory of"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "The men of the <mark>Frank</mark> <mark>McKinney</mark>, colored, I dormitory of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [686.93, 653.44, 848.06, 1152.84], "bbox_id": "81f8099684", "file": "AppomattoxNewspapers_1898-1902a_0295.pdf", "page": 1, "text": "MEMORIAL EXERCISES, FRIDAY JUNE 1 -4 OCLOCK P. fl. The procession will file out from the lot adjoining N. U. Gregorys. Line of march will be as follow! Up Grove avenue to Main, out Main to Court, then along the quiet high way to the cemetery. Leadiug the procession will be the Confederate veterans, followed by the aides of the chief marshal. Chief-marshalMaj. J. W. Flood. MarshalsMessrs. Ned LeGrand, R. F. Burke, Johu T. Lee, John W. White, Jas. P. L. Fleshman, G. L. Ferguson, Daniel Ferguson, N. H. Gregory, Geo. T. Peers, W. H. Ab bitt. AidesMessrs. J. G. Fisher, J. W. Trent, C. A. Trent, F. W. McKin ney, John Overton, R. C. Harvey, H. W. McKinney, Joe OBrien, Wat kins Nowlin, Hunter Abbitt, Robt. Caldwell, Walter Ellett, Frank Ab bitt, Hnbbard Coleman, Joel Cole man, Ran. Fleshman, R. C. Mann, George Purdum, R. L. Burke, J. W. Childsess, Jake Childress, and J. B. Abbitt, Daniel Browning. Next in line will be the Daugh ters of the Confederacy and ladies of the Memorial Association, follow ed by young ladies as flower-bearers then citizens and friends. The solemn exercises at the cem etery will be opened with prayer by Rev. Dr. Taylor, followed by singing Nearer, my God, to Thee, recita tion by Miss Mary L. Paris, intro ductory remarks by Hou. Henry D. Flood, address b y ---------- , singing, recitation by Miss Alice Burke. The flag bearers will be Misses Lucy Smith and Pearl Burke. The exercises will be closed with prayer by Rev. P. M. Bell. All Confederate veterans are cor dially invited to take part in these exeeises."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "R. C. Harvey, H. <mark>W</mark>. <mark>McKinney</mark>, Joe OBrien, Wat kins"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "R. C. Harvey, H. <mark>W</mark>. <mark>McKinney</mark>, Joe OBrien, Wat kins"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1784.64, 1083.0, 1911.24, 1152.96], "bbox_id": "95c9b91d9e", "file": "AppomattoxNewspapers_1915-1918a_0083.pdf", "page": 1, "text": "LUNACY I Dallas Walton, guard to Frank Megglnson and Geo B irant .................... 108 I Dr D N Twyman, lunacy  commissioner, 2 oases 5 GO  H w McKinney, arrest of T L Marshall and Lldy Sue Statham ................... 2 60 I Dr J B Abbitt, lunacy co- mtsaioner two cases ....... 6 00"}, "highlight": {"text": {"matched_tokens": ["w", "McKinney"], "snippet": "oases 5 GO  H <mark>w</mark> <mark>McKinney</mark>, arrest of T L"}}, "highlights": [{"field": "text", "matched_tokens": ["w", "McKinney"], "snippet": "oases 5 GO  H <mark>w</mark> <mark>McKinney</mark>, arrest of T L"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [713.29, 1116.28, 1039.61, 1195.11], "bbox_id": "402028c9cb", "file": "AppomattoxNewspapers_1892-1898a_0156.pdf", "page": 1, "text": "is er 1 igs, hams ejal attention to-ttyp buying and trailing- of all pountry produce such as and ia ia u i everything that is produced on a farm. Our Miss E. L, Morris and J. W. Gills who have charge of the commission and nniTTtniidtil in slness will give their special attention to all consignment of tobacco and guarantee to geKhe .very Highest prices for same. Mr. S. L. Morris being hisrtirfttrgeJUiixe of tobacco.! ..course Ul see that all tobacco consigned to us will not go under its value! .. _ JSlr. Frank McKinney is with us and has charge of the special clothing department-fchS JTad a lifetime experience in this and especially in ustom made work, we having full tfnTrsole control of Wananmker  Browns goods and we sqj- that we can suit anyone who good suit of elefthes at less money than they can ye bought elsewhere. Hoping to i ceive a full portion of the patronage of the publiq generally, and thanking them for. favors, we are"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "under its value! .. _ JSlr. <mark>Frank</mark> <mark>McKinney</mark> is with us and"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "under its value! .. _ JSlr. <mark>Frank</mark> <mark>McKinney</mark> is with us and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [682.53, 1046.54, 1009.77, 1223.23], "bbox_id": "0ab6cf8409", "file": "AppomattoxNewspapers_1892-1898a_0162.pdf", "page": 1, "text": "Having Been In the commission and grocery business forjthe past two years and, we are glad to say, have succeeded far beyond our expectations, and we thank our friends and the public generally, for the liberal support which we can assure them is highly appreciated by us. See ing this to bo almost a necessity and for reaching in its good effeet.not only to usbut our trade, wo have added In an adjoining room dry goods, notions, boots, shoes ,hats and ready made clothing to our stock which gives us an almost complete stoekof everything that is sold, en abling us to sell close to our customers and also to sell them everything they want, so when you come you will tind everything you need at Morris Uros.  Co.- Wo wish to say in regard to our dry goods department that it is entirely complete, our Mr. Geo H Morris, who has ehargeof tins department, having been in this business for 22 years has given his especial attention to it and we can safely say we cannot be undersold. In our dress goods we have silks from 25c. to 1.25 per yard and all the latest shades and styles of other dross fabrics, ladies and gents shoes and slippers of every description and kind and at figures that cannot be duplicated anywhere. Our Mr H. T. Morris has charge of the grocery and hardware department and gives lm espe cial attention to the buying and trading of all country produce such as chickens, eggs, hams and in fact everything that is produced on a farm. Our Mess. E. L.Morris and J. W. Gills who have charge of the commission and warehouse bu siness will give their special attention to all consignments of tobacco and guarantee to get the very highest prices for same. Mr. S. L. Morris being bimsclf a, large buyer of tobacco, of course will see thht all tobacco consigned to us will not go under its value. Mr. Frank McKinney is with us and has charge of the special cfothing department, he has had ii lifetime experience in this and especially in custommule work, we having full and sole control of Wanamaker  Browns goods and we say that we can suit anyone who wishes a good suit of clothesat loss money than can bo bought elsewhere. Hoping to still re ceive a full portion of the patronage of tho public generally, and thanking them for the past favors, we aro _ , Yours truly, MORRIS BROS.  CO."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "under its value. Mr. <mark>Frank</mark> <mark>McKinney</mark> is with us and"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "under its value. Mr. <mark>Frank</mark> <mark>McKinney</mark> is with us and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2428.79, 476.14, 2622.26, 1474.23], "bbox_id": "616a35c329", "file": "AppomattoxNewspapers_1926-1933a_0498.pdf", "page": 1, "text": "Featured by a ringing en dorsement of former governor iarry Flood Byrd for the Dem- ocatic presidential nomination, and the mention of Senator lamuel L. Ferguson as an ideal candidate for the governorship of Virginia, Democrats of Ap pomattox county met here yes terday afternoon in annual mass meeting. Called to order by chairman Don Moses, the Democrats lost io time in getting down to bus- ness. Mr. Moses and C. W. hnith, secretary, were made lermanent officers. C. W. Imith introduced  motion as égards methods of selection of ounty delegates to thé state ionvention and a committee was named to present a list of nominations. -- Senator Ferguson was recog nized and read a resolution en dorsing Byrd for the presiden- - cy. The resolution was unani- , . mously adopted. Resolutions . were then presented commend ing the administration of Gov- arnor Pollard, the record of Senator Ferguson, of delegate A. J .Terrell, of the United States senators and represen- tlves of Virginia, and of the ounty officials of Appomattox. J. A. Burke added an aitiend-  ment to the resolution lauding. Senator Ferguson, to commend lim to the Democrats of Vir ginia as the ideal candidate for the governorship. Applause greeted this amendment and it was adopted by a standing vote, f. Ç. Cawthorn, Jr., added an amendment to t h e resolution ommending the county officers o include the splendid service of Judge Robert Hutchinson. The delegation to the state convention will consist of forty- sight, with one-fourth of a vote sach. They will vote as a unit. R. L. Burke was named chair man of the delegation, with Don Moses as assistant. The state convention meets June 9, in the Mosque, Richmond. The list of delegates follows S. L. Ferguson, J. W. Flood, R. L. Burke, H. W. McKinney, J. H. OBrien, C. W. Smith, J. A. Burke, W. M. Abbitt, S. L. Ferguson, Jr., C. S. McDear mon, J. R. Horsley, Calvin H. Robinson, Joseph Button, L. F. Ferguson, W. L. Brown, W. T. Steele, N. JR- Featherston, E- LeRoy Smith, G. F. Abbitt, Jr., H C. Pulliam, T. J. Ligon, J. A. Bingham, C. T. Moses R. F. J amers on, A. H. Clement, Ry- land M. Mann, F. T. Guill, R. Alfred fiOprien, J. W. Caw- Uhorn, Jr., J. W. Carter, J. D. erguson, D. A. Conner, R H. Thornhill, Dr. D. A. Christian, W. W. Carter, J. H. Elder, R. B. Steele, W. W. Scott, Don Moses, M. H. Marks, Miss M. Anna Jones, Mrs. Ned A. Wag ers, Miss Eula May Burke, Miss Cornelia K. Gills, Mrs. Frank Dreseer, Miss Earle Patteson Mrs. Anna P. Flood, Miss M. Virginia Smith. The resolutions endorsing Byrd, follow We, the Democrats of the county of Appomattox, in mass meeting assembled, embrace this occasion to voice our unit ed endorsement of Hon. Harry Flood Byrd, former Governor of Virginia, as stalndard bearer of the Democratic paty in the"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "R. L. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, J. H. OBrien, C."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "R. L. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, J. H. OBrien, C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.87, 252.62, 1750.79, 775.01], "bbox_id": "25816e827d", "file": "AppomattoxNewspapers_1912-1915a_0229.pdf", "page": 1, "text": "F air News. yHnrrah, for the tournament boyt! There are about 10 knights already who are to ride. The tournament poles have been put up. Come ont -and practice. See Col. Bnrke chief marshall and begin to practice. We are sorry to ar nonnoe that Mr. Frank McKinney, who was ap pointed Chairman of the Horse De partment, refuses to act. However Mr. Alex. Caldwell has decided to act m his stead and is very much interested in the Fair. See him about the horses. See Mr. L O. OBrien about cows and cattle, Mr. Milton Isabel I for chickens, any of the Vice Presidents or Mr. Ander son about the crops and vegetables. Many interesting features are now leing added the schools of the county are preparing exhibits. Mr. 0. W. Hancock offers 5.00 where it will do the most good Lynchburg Warehouse Co. offers 115.00 for tobacco exhibit. Read the Appomattox Hardware Co, advertisement and see the prizes offered in the shooting match. Ferguson  Smith offer one-half ton A. S. Lee 3-8-3 gnano for fcbest whole farm exhibit. Mr. H. O. Babcock offers 2.50 jor the running race. Miss Jennie Godwin offers a prize for the best original poem by school folks. Now farmers bring your stnff out is our first attempt and without your aid it cannot succeed. Dont think that because yonr horse, cow, pig, nhicken, dog, vegetables, com, tobacco is not extra fine that yon"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "ar nonnoe that Mr. <mark>Frank</mark> <mark>McKinney</mark>, who was ap pointed"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "ar nonnoe that Mr. <mark>Frank</mark> <mark>McKinney</mark>, who was ap pointed"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [503.45, 210.26, 773.8, 1359.52], "bbox_id": "78ba41e859", "file": "AppomattoxNewspapers_1918-1922a_0178.pdf", "page": 1, "text": "e 8  V i r g i n i a n eT hepsism uch indisposed Miss Eva H arvey is visiting relatives in Lynchburg. Refreshing showers m a k e bountiful gardens and beauti ful flowers. Mr. Hallie Burke, wife and daughter, are guests here for some days Messrs W . H. Lucado and Wiley Morris are owners of new Fords Mrs L. J. Morris is on a weeks visit to her old home in Nelson. Misses W ave Earle Patteson relatives in Charlotte this week Miss Mary Covington, of Holly wood, is visiting rela tiv e in Lynchburg this week Jlliss Susie Hancock, who hah been ,eohinvr at Biut iield, W Va , is spending hi-r vacation at home here. Prof, end Mg. Crawley an- young Charles ere taking i- vacatioD at the h.me of Mrs -rawl, t in the Valley. Mr. Burnetf, the electrical nr, aintainer, will soon have hie fcmily here. He will occupy the cottage of Mrs. Patteson Mr. and Mrs Simpkins and Mrs. J W. Cawthorn spent the week end with her daughter Mrs. John Tweedy, near here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotto county, spent tne week end with her aunts, Mesdames J. W. Patteson and L 1. Puck ette. Mr. and Mrs Chandler Simp kinp, of Richmond, have been visiting Mrs. Simpkins parents, Mr. aud Mrs J W Cawthorn, here. Miss Helen Morris, of V.ra. pent several days lust week with Miss K -a Harvey h-re, ou her way home irom Rich inond College. Mrs. F fl. Craig and son, Frank, are visiting Mrs Craigs father, at  Allendale . Mr Craig stopped for a uay on his way to N. Y. Mr H. S. E as , son of Rev. H. Parlett East, has gone to Berry ville, Va., lor the summer, where he is employed in Dr. A. W. W arners pharmacy. Mr W. O Moss has been vito iting his old home in North Carolina. He was accompa nied here by his father and brother for a visit. Mies Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, V a , after spending a few days at the Haplist parsonage, have return- ed to their homes. Next week the hum of the binder will be heard in Appo m attox. The quality of our wheat is good and speculators are said to be buying up the farm ers bread before it is threshed, be careful how you part with your bread. The Editor reoeived an invi tation to be present at the m arriage of Frank Qreen and Sxrab Abbitt Burke Uanday morning. These are old and reliable oolored citizens of Ap pomatti x A wedding supper vas enjoyed Monday evening Thu ladies of New Hope church will have a lawn party at parsonage, Vera, Vs,, Sat urday, June 10tb, beginning at 5 oclock. Proceeds tor benefit of new church. Old church will be sold at 4 oclock. Pub lie cordially invited, R. L. Burke, cashier of Bank of Appomattox, and chairman of Group Four ut the Virginia Bankers Association, left to day to attend the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Spring-, Va., June"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "near here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "near here. Mrs. F. <mark>W</mark> <mark>McKinney</mark> and daughter, Miss Frankie,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.8, 513.15, 1949.4, 1185.57], "bbox_id": "5c4a10c21f", "file": "AppomattoxNewspapers_1892-1898a_0081.pdf", "page": 1, "text": "Dear Lord we give him up to Thee Tho sorrowing from the heart. Content If Thou w ilt let us m eet Some day to never part. _____________ . ________ M ary . Notes from O akville. E ditor T iem s Our visit to the Court House on Thursday last was a pleasure long to be remembered, and the inclinatioti to express it through the medium of your paper, is irresist ible. I was a little relnctant to make the trip on court day, but the opportunity was such a good one, withnotanotherinhailingdistance, I found myself unable to trust to luck, and ventured a drive through streets filled with creations lords. The youth and beauty, however, of my friend and companion arrested the gaze of all observers, and I was, for tunately, left to blnsh unseen. The first to greet me on our ar rival at Hotel Appomattox was Rev. Mr. Craig, who iB to succeed our be loved pastor at Union. His beaming face and preposessing manners are living credentials of an  all-sufficient substitute, and I am satisfied that the little flock at Union will be more reconciled to the ex change, when they know him. We wire most cordially received, and nicely entertained by Mr. and Mrs. Smith, whose charming daughters added much to the enjoy ment of onr visit The table was bountifully spread with a variety of the most palatable food. Indeed I never enjoyed abetter meal. I met up with several old friends, and formed some pleasant acquaint ances, among whom were Mrs. Peers, Mr. Charlie Saekett, Dr. Kearney, Mr. and Mrs. Frank McKinney, and Dr. John Hamlet. Our visit to the T imes office was very much enjoyed. The press was quite a curiosity to us both, aud the thought of having seen the source from whence flows so much good sense, wit and humor is gratifying. Many thanks for your kindness in showing us around. Long may the gloom-dispelling T imes continue to brighten the homes of its readers. Sept. 12,1893. L one star ."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "Kearney, Mr. and Mrs. <mark>Frank</mark> <mark>McKinney</mark>, and Dr. John Hamlet."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "Kearney, Mr. and Mrs. <mark>Frank</mark> <mark>McKinney</mark>, and Dr. John Hamlet."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [740.41, 1204.7, 898.91, 1568.61], "bbox_id": "40a69d3dcb", "file": "AppomattoxNewspapers_1898-1902a_0383.pdf", "page": 1, "text": "co urt h o u s e p r e c in c t . ,T. C. Jones, chairman Dr. J. H. Abbitt, H. W. McKinney, B. F. Burke, L. E. Smith, J. J. Durrum, J. T. Cheatham, T. W. Moses, H. S. Coleman, A. H. Abbitt, B. C. Child- jess, W. A. Moses, T. A. Smith. Jno. L. Davis, Jno. W. OvertBn, Dr. D. Mott ltobertson, J. H. Bobertson, B. W. Smith, B. H. Bates, E. P. Carson. CHEATWOOD PRECINCT. A. H. Howerton, chairman B. N. Tanner, J. W. Powell, C. F. Bobert son, W. D. Doss, Frank Babcock, C. A. Cardwell, L. T. Morris, Bobert B. Poore, A. A. Sweeney, W. G. Cole man, W. F. Johnson, J. D. Cheatham, A, C. Cheatham, Samuel Cheatham. CHAP PRECINCT. S. J. Lee, chairman S. G. Harvey, C. H. Godsey, W. H. Childress, M. P, Lee, J. C. Martin, J. T. Caw- thorn, W. II. Lewis, B. W. Flesh- man, E. C. Marshall, C. S. Cawthorn, J. Baxter Marshall, W. P. Godsey, J. C. Wooldridge, J. Tilden Lee. PAMPLIN PRECINCT. J. T. Clark, chairman G. W. Thornton, P. M. Hannah, B. D. Baldwin, Geo. F. Farrar, B. N. Daw son, Dr. C. S. Morton, Dr. Taliaferro, J. A. Oaks, Mathew J. Clark, B. B. Davis, E. F. Glover, E. F. Williams, W. Womack, John Warner."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "J. H. Abbitt, H. <mark>W</mark>. <mark>McKinney</mark>, B. F. Burke, L."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "J. H. Abbitt, H. <mark>W</mark>. <mark>McKinney</mark>, B. F. Burke, L."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [934.3, 643.72, 1094.35, 1174.78], "bbox_id": "ba44532e38", "file": "AppomattoxNewspapers_1918-1922a_0199.pdf", "page": 1, "text": "At a m eeting of Board of Su pervisors of Appomattox coun ty held at the Clerks office on July 14, 1920present W. H Ligon, L E Smith and S. E. Anderson, the following claims were presented, examined and ordered paid POOR HOUSE AN0 PAUPERS G W Watson, board and care ot in mates to July 15,1930 ...... ISO 00 Same, for clothes, etc., for inmates .... 7 37 Alice Ferguson ..... 2 60 Joe Woolridge.... .......................... 3 00 MrsSallie Rogers........................... 3 00 Mrs Nannie Warner ...................... 3 00 C Roach Mann....................... 4 00 Kate Petty for Frank Thornton . ...... 2 50 Ann Johns ............................... ... 2 50 Mrs Anna B Burton . ....................... 2 CO Marshy Hancock ... . ...................... 2 0C Mariah Scruggs................................. 2 00 Lou Conner .................................. - 3 00 Ella Elliott .......... . ............ . ......... 2 00 Humphrey North ........... . .......... . 2 50 Ossie May Fleshman ...................... 3 00 John Dennis, for daughter ............. 5 00 CLERKS OFFICE  C. H. Appoz Light  Power Co . ................ 3 00 Appox Telephone Co .......... . .......... 4 70 D L Martin, labor . ............. . .......... 7 00 J P Bell Co. typewriter ribbon ........ . 1 04 ELECTIONS Scott Rice, judge........................... 2 00 R W Beale, tudge........................... 2 00 E L Paulett, j udge ........................ 200 W H Ligon, sealing ballots .............. 5 9 C W Smith, copying eligible list .... .. 9 43 R F Burke, maing eligible list ........ 14 13 LUNACY I ra Burrell, conveying Celia Forbes 4 00 ROAD W W Martin, patrolman, for April and June ........ .......................... 86 80 Thomas Guill, team hire, etc .......... 177 80 Stephen Preston, labor................... . 27 60 Thomas Guill, team hire and labor for April ................ . ...... . . ...... 91-00 Arthur Preston, labor .................... 27 90 Rod North, labor ..................... . 18 00 I Taylor Wright, labor ...................... 16 50  Luther Patterson, labor ................. 6 00 G W Watson, blacksmlthing ............. 4 55 Appox HdwCo, supplies ....... . ......... 5 22 MISCELLANEOUS F A OBrien, land assessor .............. 870 00 H W McKinney, sum civil Jury, etc.... 3 60"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "assessor .............. 870 00 H <mark>W</mark> <mark>McKinney</mark>, sum civil Jury, etc...."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "assessor .............. 870 00 H <mark>W</mark> <mark>McKinney</mark>, sum civil Jury, etc...."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [614.18, 986.71, 776.41, 1323.85], "bbox_id": "adaa3e2ed8", "file": "AppomattoxNewspapers_1918-1922a_0014.pdf", "page": 1, "text": "appointed the following gentlemen 3 Campaign Committes to further .he candidacy of Hon. S. L. Fergn son for biate Sen ile H. W. McKinney, Hon. R. L. Burke, L. K Smith,.Hon. J. W. Gawth n, Jr., L F Ferguson, H. C Babcock, Don Moses, A. T. Inge, J, C Whitaker, Prof. Lindsav Crawley, HarriBO  Barge, J. J. Durratn, Walter E Durham, Dr. D. N. Twyman, E. LtRoy Smith, W Ben. Caldweil, T W. Moses, R W Butkey, Ch s. F. James, jerry A. 8u ke, J N. Wooldridge, E. R Ab- bitt, A. H. Howerton, W. B Hr viy, S. G. Harvey, Joel T Cawthon, E. E Chiain, W T Johnson, 0. 8. VlcDearh101 j-R Hamilton, W. 0. Garrett, P. M HaniiaK, L. N. Lig eti, K. W. Beale, E C. Marshall, H. Vi. Mai shall, E P. Sears, 8. D Cheatham, D. A. Conner, L M. Drink rd, K. VV Abbitt, G A Scuffl-r, VV. P. Gills, Frank I - awthou, N K Fevtherston, J K. Megginson, C. Lewis Coleman, E, A VC oii, B. 1 Wheeler, E H miib, J R. Uorsiey. G. 0. Thorn. i ii , T. P. Carson C. J. Harding T. A. Drintsard W. T. Steele, C. A Hat ooek. W. H. L ig o n , Chm. Mass Meeting."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "biate Sen ile H. <mark>W</mark>. <mark>McKinney</mark>, Hon. R. L. Burke,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "biate Sen ile H. <mark>W</mark>. <mark>McKinney</mark>, Hon. R. L. Burke,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.67, 281.06, 1468.62, 470.36], "bbox_id": "d7aa3b9969", "file": "AppomattoxNewspapers_1939-1943a_0268.pdf", "page": 1, "text": "Albert Newcomb, Frank Marshall, Collier Pugh, Harvey Pugh, J. B. Ford and Oras Clark. Honorary pallbearers were L. S. Shorter, Joe LeGrand, Clarence Puigh, W . T . Jordan, C. T. Caw- thorne, James Caldwell, J. A. Mar, tin, T . H. Ford, W. T . Nash, H. B. Trent, Hunter Harvey, Elliot Cheatham, J .H . Chilton, W . C. Chilton, Z.M . Jones, W .L. Ford, W . B. Hunter and A.R.Harwood! R. L. Burke, H. M. Burge, Dr.D A. Christian, H. W. McKinney, D. A. Conner, C . .. Moses, J . H OBrien, L. E . Smith, W. M. Ab- bitt, O .F . Cheatham, J . P. Mar shall, A . C. Nash, E . R . Ferguson, L. B. Hudson and M .T . Trent."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "Dr.D A. Christian, H. <mark>W</mark>. <mark>McKinney</mark>, D. A. Conner, C"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "Dr.D A. Christian, H. <mark>W</mark>. <mark>McKinney</mark>, D. A. Conner, C"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [206.15, 1068.29, 534.2, 1318.73], "bbox_id": "d188f5de53", "file": "AppomattoxNewspapers_1892-1898a_0427.pdf", "page": 1, "text": "A. Caldwell. Committee on Publication-L B Smith, S. L. Ferguson and A . H . Clement. Committee on OrderS. P . Cole man, Herbert Coleman, A . H . Ab bitt, F . W. McKinney and H . C Babcock. Committee on DinnerD. Mott DistrictWilliam I Robertson, T . A . Smith, Joel T Williams, Thos. Tindall and Frank jCawthorn, J . F . Purdum and W. H Ligon Committee on MusicC. A . Ab D. Omohuudro, and j bitt, Clinton Cawthorn, C. W. Han cock, J . R. Caldwell and Peter Stratton. The chairman of the committees constitute the Financial Committee, A resolution was adopted asking with maliciously 1 the farmers to bring baskets to help L . Tinley another feed the immense crowd which is ex-"}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "H . Ab bitt, F . <mark>W</mark>. <mark>McKinney</mark> and H . C Babcock."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "H . Ab bitt, F . <mark>W</mark>. <mark>McKinney</mark> and H . C Babcock."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.84, 678.01, 2017.14, 864.16], "bbox_id": "31340db7fa", "file": "AppomattoxNewspapers_1939-1943a_0448.pdf", "page": 1, "text": "Mrs. Ola Patteson and M rs.T.U . Conner have .returned home after spending several days with their sis ter, Mrs. W . S . Bryant, of Cullen. Miss Elaine McDearman enter tained the contract bridge club at a buffet dinne r and bridge Friday evening at her home in Pamplin. Vari-colored flowe rs were used in the living room and in the dining room a centerpiece was composed of snapdragons and apple blossoms. Those present were Mr.and Mrs. Joel W.Flood, Mr.and Mrsi ,G.F. Abbitt, Jr., Dir.and Mrs. L. L. Gayle, Mr.and Mrs. C. H. Robin son, Miss Kate OBrien, Miss Frank ia McKinney, Dr. C.H Swing ana H . Y . Spencer. Prizes were awarded Mrs.Flood and Mr. Robinson."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "Miss Kate OBrien, Miss <mark>Frank</mark> ia <mark>McKinney</mark>, Dr. C.H Swing ana"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "Miss Kate OBrien, Miss <mark>Frank</mark> ia <mark>McKinney</mark>, Dr. C.H Swing ana"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1126.81, 216.67, 1285.55, 819.21], "bbox_id": "2eece525c0", "file": "AppomattoxNewspapers_1915-1918a_0376.pdf", "page": 1, "text": "Grade ICorrinne Hancock, K ate Morris, Vernie Oden, Lula Sm ith, Delphie Godsey, Frank ie McKinney, Va y A bbitt, Gro ver Smith, H enry Twym an, Richard McDearmon. G rade IIA l i c e Harwood, Elizabeth Sm ith, Fred Twy m an, Lilian Caldwell, Florence G regory, Jennings Morris, Al len Gills, Catherine Caldwell, Lawson F ore, Ellie Puckett, A rcher Caldwell. Alice Patter son, Marion McDearmon, E idie Babcock, Carrie Gills, Ruby Caldwell, K ennard Gills. Grade IIIM argaret Smith, Thelm a Ferguson, E d w a r d Blackwell, H ugh M artin, V ara Sm ith, Graoie Morris, Mazie Doss, Pauline Rucker, Rebecca M artin. Grade IVH o w a r d Inge, Beulah M artin, Mamie Layne, Calvin Godsey, Russell Jam er- son, Billie Trent, H ester David son, Richard P lunkett, A rthur Robinson, Flood D rinkard, Nel lie C allaham , Claire W ilker- son, W illie Booth. G rade V George Inge, Lyle McDearmon, L e w i s McDear mon. Jo h n Stanley, M argaret Caldwell, Eleanor Ferguson, Bessie Harwood, L o u iseR an some, V irginia Smith. G rade VIE v e 1 y n Brown, Avis Brown, W illiam Burke, O ra G ilbert, R uth Giessen, Ned Hancock, V ara Morris, Eliza both Trent, Burke Steele, Earle Patteson. G rade VIIMaye Schefflsr, Nola Burkey, Ressa E v a n s , Stelle Payne, Elm er Sm ith. I H igh S c h o o 1Eloise At wood, John P u r d u e , Lucile OBrien, Cornelia Gills, Mary Gills, Rheda D rinkard, M ar g aret Gibson, L aura Gibson, H attie W oodson, Minnie Rob ertson, Frances 8m itbj John"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "Sm ith, Delphie Godsey, <mark>Frank</mark> ie <mark>McKinney</mark>, Va y A bbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "Sm ith, Delphie Godsey, <mark>Frank</mark> ie <mark>McKinney</mark>, Va y A bbitt,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1568.92, 1189.68, 1743.02, 1286.63], "bbox_id": "86b70ad170", "file": "AppomattoxNewspapers_1898-1902a_0047.pdf", "page": 1, "text": "r i ci Tfe- A. W. and Luthi- i c mLdanSiai.v re visiting their br.dli rs douhtffibt518 ek Messrs. Frank and .diricesK11 McKinney. Willie Turner has brought a a e suit against Mr. A. E. Mil- ijfir  C i for 3,000 at the October ?0?- if the eircuit court."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "rs douhtffibt518 ek Messrs. <mark>Frank</mark> and .diricesK11 <mark>McKinney</mark>. Willie Turner has brought"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "rs douhtffibt518 ek Messrs. <mark>Frank</mark> and .diricesK11 <mark>McKinney</mark>. Willie Turner has brought"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.17, 1603.61, 1603.89, 1782.35], "bbox_id": "3a1c5ddd45", "file": "AppomattoxNewspapers_1902-1905a_0153.pdf", "page": 1, "text": "Mr. and Mrs. E. W. Taylor passed through the village Monday on then- way to Lynchburg to attend the marriage of Mrs. Taylors niece. Miss Helen M c K i n n e y , to Mr. T. C. Adams, of Bristol, Tetn The event takes place this evening. Miss McKinney has visited our vil lage for several summers and is a popular and attractive girl, aud is related to our townsmen, Frank and Winston McKinney, and is a rand daughter of Clerk Geo. T. Peers We extend the young couple onr hearty congratulations and wish"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "related to our townsmen, <mark>Frank</mark> and Winston <mark>McKinney</mark>, and is a rand"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "related to our townsmen, <mark>Frank</mark> and Winston <mark>McKinney</mark>, and is a rand"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [256.3, 802.73, 418.2, 920.83], "bbox_id": "5d44a2ac88", "file": "AppomattoxNewspapers_1908-1909a_0582.pdf", "page": 1, "text": "Miss Jannie McKinney, who has been visiting in Alexandria has returned to her home here.  m m JamesW. Carter, of Peters burg, spent Sunday in thè home of W. L. Brown.    - Frank Gilliam, of Roanoke, spent the week-end with his mother, Mrs. Lily Gilliam."}, "highlight": {"text": {"matched_tokens": ["W", "Frank"], "snippet": "in thè home of <mark>W</mark>. L. Brown.    - <mark>Frank</mark> Gilliam, of Roanoke, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Frank"], "snippet": "in thè home of <mark>W</mark>. L. Brown.    - <mark>Frank</mark> Gilliam, of Roanoke, spent"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [440.6, 1163.24, 602.32, 1209.73], "bbox_id": "af77440365", "file": "AppomattoxNewspapers_1898-1902a_0048.pdf", "page": 1, "text": "I Messrs. A. W. and LuthMa i.o Kinney áre visiting their br.h re er this week, Messrs. Frank and Kinston McKinney."}, "highlight": {"text": {"matched_tokens": ["W", "Frank", "McKinney"], "snippet": "I Messrs. A. <mark>W</mark>. and LuthMa i.o Kinney áre visiting their br.h re er this week, Messrs. <mark>Frank</mark> and Kinston <mark>McKinney</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Frank", "McKinney"], "snippet": "I Messrs. A. <mark>W</mark>. and LuthMa i.o Kinney áre visiting their br.h re er this week, Messrs. <mark>Frank</mark> and Kinston <mark>McKinney</mark>."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [650.91, 1049.45, 810.59, 1491.48], "bbox_id": "e9caa90ac2", "file": "AppomattoxNewspapers_1926-1933a_0212.pdf", "page": 1, "text": "Harvey, E. Larkin, Harvey, Z. V. , Jennings, Jesse T., Craw ley, L., Woolridge, G. W-, Pearce C. C-, Dameron, G. D. Lewis, Olive W., Dickerson, Mrs. W. E-, Smith, Miss Emma, Goin, Nathan, McDearmon, C. S., McKinney, Miss Janie, Scott, W. W-, Featherston, N. R. , Steele, R. F. B., Redding, Mrs. R. E., Redding, Rev. R. E, Bledsoe, M rs. Lottie, Patter son, Eula May colored, Har wood, A. R., Caldwell, Henry, Babcock, H. C., Pulliam, H- C., Walton, Mrs. T. A., Burke, Eu la May, Moses, Don, Smith, L- E. Jr., Odor, W- Pierce, Clem ent, A. H., Sears, S. W., Scott, Mrs. J- W., Scott, Mr. J. W., Walton, T. A., Murphy, F. L., Gills, Miss Louise, Thompson, Rev. W. M-, Ferguson, Joe D-, Smith, C. W., Ferguson, Msr. S. L., McGill, W- C-, James, Chas. F., Glenn, R. A., Hawley, F. H-, Ferguson, Sen- S. L., Bab cock, Bradley W., Smith, Mr. W. T., Hancock, Ned, Burke, Mrs. R. L, Johns Miss A Deane Gregory, Mrs. A. H., Brown, M. Avis, Plunkett, Dave, Durham, ham, Walter E., Walker, Jas- E- colored, Sears, Leonard L., Burke, J. A., Ferguson, Mrs. Tom. Stonewall District Smith, Frank J., Henderson, Rev- W- T. , OBrien, Miss Phoebe, Thornhill,. W. W., Marks, Mrs. Ida F., Davidson, J. 0-, David son, J. C."}, "highlight": {"text": {"matched_tokens": ["McKinney", "W", "W"], "snippet": "Nathan, McDearmon, C. S., <mark>McKinney</mark>, Miss Janie, Scott, <mark>W</mark>. <mark>W</mark>-, Featherston, N. R."}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "W", "W"], "snippet": "Nathan, McDearmon, C. S., <mark>McKinney</mark>, Miss Janie, Scott, <mark>W</mark>. <mark>W</mark>-, Featherston, N. R."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.95, 288.63, 1762.51, 821.61], "bbox_id": "eab8c8f37e", "file": "AppomattoxNewspapers_1912-1915a_0192.pdf", "page": 1, "text": "Governor Names Road Delegates. Thirty official delegates from Vir ginia to the American Road Congress, scheduled to be held In Detroit, Mich., September 29 to October 4, were named by Governor Mann, and com missions issued from the office of the Secretary of the Commonwealth to each of the delegates. Governor Mann also sent a letter to L. W. Page, presi dent of the American Road Congress, in Washington, notifying him of the appointment of the delegation and in closing a list of the members. The American Road Congress is one of the largest and most powerful or ganizations working in the United States in the interest of good roads, and has accomplished a great work in th awakening of the country to the advantages to be derived from well- built highways. The meeting of the congress in Detroit is expected to be of unusual interest. The list of delegates appointed by Governor Mann follows First DistrictAshton Fletcher, Jen kins Bridge Thomas B. Robinson, Eastville James W. Chewntog, Hillon- beck. Second DistrictG. T. Rawls, Ben netts Creek C. C. Vaughan, Frank J. J. Dalton, Norfolk. Third DistrictW. C. Saunders, Glen Allen Howard Swineford, Richmond G. P. Coleman, Williamsburg. Fourth DistrictW. B. Davie, Law- renceville Lucius Gregory, Chase City James Wagner, New Bohemia. Fifth DistrictDr. R. S. Martin Stuart D. S. Bill, Spencer G. W. East, Chatham. Sixth DistrictD. W. Owen, Don- niston John T. McKinney, Lynch burg B. W. Logan, Salem. Seventh DistrictBrock White, Har risonburg J. W. Bowles, R. F. D. 1 Winchester H. F. Byid, Winchester. Eighth DistrictJ. L. Dawson, Woodbridge W. E. Allen, Warrenton W. R. P. Reid, R. F. D., Alexandria. Ninth District ----- Henry Roberts, Bristol James A. Grose close, Marion C. A. Wagner, Graham. Tenth DistrictJ. F. Harper, Way nesboro S. L. Ferguson, Appomattox W. P. Crumpacker, R. F. D. 1 Ro anoke."}, "highlight": {"text": {"matched_tokens": ["McKinney", "W"], "snippet": "Don- niston John T. <mark>McKinney</mark>, Lynch burg B. <mark>W</mark>. Logan, Salem. Seventh DistrictBrock"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "W"], "snippet": "Don- niston John T. <mark>McKinney</mark>, Lynch burg B. <mark>W</mark>. Logan, Salem. Seventh DistrictBrock"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [729.6, 1262.77, 887.58, 1561.77], "bbox_id": "ee0335ada8", "file": "AppomattoxNewspapers_1922-1923a_0083.pdf", "page": 1, "text": "solus lauies and elequani gownB Tnose present were Misses Florence and Nannie OaldWdlJ, Mrs J, E. Dinwiddie, Mrs. Pelham Uooke, Nortolk Mrs. E. HammerBley,Richmond .Hiss Lucile Caldwell, Mrs.Dan Browning, Richmond Miss Ulara Caldwell, Mrs. John Ran dolph Atwood and Mrs. Jeter Palmer, Misses Emma and Lucy Brnitb, Mrs. James B Abbitt, Nortolk Mrs. Wm.-Tay lor Bteele, Mrs. Frank McKin ney, Mies Jannie McKinney, Mrs. Benjamin Caldwell, Mrs Jerry Allen Burke, Mrs. Hal lowed Burke, Roanoke Mrs. John Edward Sears, Mrs. Wm. Hale Byrne, Mrs. Alfred H ar wood, Mrs. Emmett Abbitt, Mrs. Butler Pretlow, Mrs. 8. W Sears, Mrs Walter Scott, Mrs. Ed Price, Miss Jessolyn Han cock, xirb. 8 L. Ferguson."}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "Wm.-Tay lor Bteele, Mrs. <mark>Frank</mark> McKin ney, Mies Jannie <mark>McKinney</mark>, Mrs. Benjamin Caldwell, Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "Wm.-Tay lor Bteele, Mrs. <mark>Frank</mark> McKin ney, Mies Jannie <mark>McKinney</mark>, Mrs. Benjamin Caldwell, Mrs"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.55, 1322.66, 1799.17, 1426.59], "bbox_id": "0e1d6f3817", "file": "AppomattoxNewspapers_1926-1933a_0090.pdf", "page": 1, "text": "Sheriff McKinney, Duvall Con- dumrto  he afho rHalfe Bui- . ner and Constable Pulliam. The son, Louie wdwrmHaUie Bu Hgnt kook party at et up a careful watch nette, Lonelle Hamilton, Lucy f Mrs. Frank McKin-1 d after a lpng anj patient ver- LeGrand, Mary. Jamerson, Sadie  was a delightful af-j e rewarHeH by the ap- and Virginia Reynolds, Florence lad plate and choco- rfV .  tue operators on the I Gregory, Messrs. Frank Robert- ed the guests. f c  w h o J u p T e crude son, Homer bcoek Cornehn x, Campbell, Am- plant which consisted of gas bM- Cawthorn, Jones CaldweJl Ed- urtotte, Bedford and 11 and worm. After the ,flre w a r d R  e y  H e n r  Caldweii."}, "highlight": {"text": {"matched_tokens": ["Frank", "w"], "snippet": "the I Gregory, Messrs. <mark>Frank</mark> Robert- ed the guests. f c  <mark>w</mark> h o J u"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "w"], "snippet": "the I Gregory, Messrs. <mark>Frank</mark> Robert- ed the guests. f c  <mark>w</mark> h o J u"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.27, 196.47, 1765.17, 1341.15], "bbox_id": "c123df9a92", "file": "AppomattoxNewspapers_1915-1918a_0453.pdf", "page": 1, "text": "Oetober 10, H and 12th.Fair days. Running Raoes Every Day at Appomattox FairOot 10, jl I and 12th. Enter your horses, mules or ponies at once. J . O . O B r i e n , C h a i r m a n . Mr. Chas. F. Trent and Miss Rosa Milo Eller were married Sept. 22 at the M. E. parsonage in presence of a few friends Mrs. Trent is from N. C. Mrs. Douglas Puckett has been removed to her home here Her m any friends will regret to le arn 1 th at she continues in very feeble health. Rev. L. R. Thornhill, a for mer paator of Liberty Baptist church, preached a powerful sermon at Liberty on last Sun day. Be and his wife were guests of Mr. Joel Cawthorn.  The R a i n b o w in The Clouds will be the subject of the sermon 8unday a. m. at Memorial church. 8unday eve-. ning subject,  uost and in Found. Sunday school and Epwortb League at the usua hours. Everybody invited.  Everybody Go To Sunday School Day w ill be observed next Sunday by the Baptist de n o m i n ation throughout the South. Liberty church will ob serve the day with appropriate  exercises. Home Department  and Cradle Roll are all expeot-  ed. A t night there wilt be the Installation Exercises of Offi-  cers of Young Peoples 8ociety  Baptismal services at eight  oclock. Everybody inoludes  you.    The W. O. T. U. held their regular meeting today at the  home of the secretary, Mrs. J. IH. Stanley. They report that 38 comfort bags have been de-  livered to our soldier boys and  they need 42 more for the next  installm ent of soldiers, who leave on Oct. 5th. Interested  parties are invited to be pres-  ent at the train on October 5th, and mothers, preachers and sweethearts are requested to have letters of good cheer and comfort to put in these bags Send your offerings to Miss Kate OConnor for the bags. Mrs. R. F. Burke has been ap pointed chairman for Appo m attox county for the purpose of soliciting money with which the 8tate and U. 8. govern ments will purchase books and magazines for our soldiers in the encampments and in France, j We have been told th at the n . South is far behind in this I1There will be preaching at I movement, so we are waging a the Presbyterian church n ex tlquiok nmnaign. Let us do our  holiday morning at 11 oclock. part  e nave until Oct. 1st Ho Mtviceu at night. J _ Q6xt Monday when the cam-1  lire. F. L. Martin spent last  paign closes. Your contribu- peek with, her brother, Mr, I cion with .your nam e will be ac- j gpencer Garrett, of Vicars eepted a t the Bank of Appo- pitch, Va. m attox.   Rev. McElroy is in Bedford  Mr. Marshall H. Simms died  putty holding evangelistic  at bis home near here Friday I meetings. He will return on morning in the 73rd year of his pturday. Prayer meeting will  age. The deceased had been  N held on Thursday night.  in bad health for a long time  pou are expected.   He was a quiet Christian gen- I If you would not miss get- Jtleman, and had been an officer Hog a single copy of this paper  in the Methodist church for a Idoring the very interesting  long time. His remains were papaign now on, it would be  interred at bis home Saturday pell to pay up your subscrip-1 in the presence of a large crowd on.  of relatives and friends. He is j I MrU.R. Atwood sold to a 8rWved by his wife and three Baltimore concern last week 8 Bilir  Mrs. G. fcge pan of her stock of shoes. B-  J p goods and notions. The O. Mann, r i l ,of this county. IbuBiness will be continued at deceased was a Oonfeder- he old stand and her object in W  veteran and had lived in PBing was to reduce the stock I county all his life. I Dr.B. A. Jones, of Amherst, The host of friends of Dr. J P purchased the old Frank B. Abbitt will regret to learn McKinney farm of Mr. Ro. G. j that he has decided to locate in I Robertson and will move on I the great city of Norfoljp. Dr. I pth his family about Decem I Abbitt enjoys a lucrative prac-1 P it- We welcome Mr. Jones I tice here he is president of the w our county and know he I County Board of Health and will succeed. I has a v ary warm place in the I The public is cordially invit- hearts and homes of our people, p to attend the lawn party His family will not go now.but at Oakville high will follow later, tool during the afternoon  to be congratulated on the  Ittd evening of Saturday, Sept, acquisition of this splendid IJ.  o o m m e n c e s at 8 family as oitizens. The,Jf0 lelock. Admission, adults 151 has our best wishes tor the l cti, children 10 cents 1 largo measure of success which"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinney"], "snippet": "P purchased the old <mark>Frank</mark> B. Abbitt will regret to learn <mark>McKinney</mark> farm of Mr. Ro."}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinney"], "snippet": "P purchased the old <mark>Frank</mark> B. Abbitt will regret to learn <mark>McKinney</mark> farm of Mr. Ro."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [850.13, 251.51, 999.02, 874.19], "bbox_id": "593d8d6ae6", "file": "AppomattoxNewspapers_1971-1973a_0463.pdf", "page": 1, "text": "Miss Frankie McKinney spent  the week end in Lynchburg with  Mrs. W. L. Farmer.    Mrs. Nettie D. Martin, who has been a patient at the Virgin ia Baptist Hospital, returned home Friday.    Mr. and Mrs. Frank Hill and family, of Roanoke, and Mr. Harry Plunkett, of Vinton, spent Sunday with Mr. and Mrs. Cliff Plunkett.    Mr. and Mrs. Woody Lee and Mrs. Glenn Elliott, of Rustburg, spent Sunday with Mrs. W. H., Almond.    Mrs. D. E. Caldwell, Jr. Mrs. Dora Randolph and Mrs. Mary Beddow, returned home Sunday after a two weeks visit at Co coa Beach, Florida.    Misses Betsy and Patsy Jones spent the week end with their parents, Mr. and Mrs. R. David Jones.    Mrs. Bradley Babcock and son, Whitney, of Harrisonburg, were p e s ts of the A. A. Bab cocks for the week end.    Mrs. Katie Allen has return ed home from the Virginia Bap tist Hospital.    Rev. and Mrs. Virgil Hudson and Lynette were supper p e sts of Mr. andMrs.EmmittW.Pau- lette and E. W.on Saturday eve ning.    Mrs. W. H. Almond has re turned home after spending five weeks at Virgiia Beach with her daughter, Mrs. Catherine Cyrus, who recently underwent surgery. Mrs. Cyrus accom panied Mrs. Almond home fora visit.    Mrs. 0. C. Hall has returned home after undergoing surgery in The Martha Jefferson Hospi tal in Charlottesville."}, "highlight": {"text": {"matched_tokens": ["McKinney", "W"], "snippet": "Miss Frankie <mark>McKinney</mark> spent  the week end in Lynchburg with  Mrs. <mark>W</mark>. L. Farmer.    Mrs. Nettie"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "W"], "snippet": "Miss Frankie <mark>McKinney</mark> spent  the week end in Lynchburg with  Mrs. <mark>W</mark>. L. Farmer.    Mrs. Nettie"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [555.61, 1044.87, 725.13, 1560.39], "bbox_id": "9ec28849c1", "file": "AppomattoxNewspapers_1892-1898a_0514.pdf", "page": 1, "text": "The Storm. A terrible storm passed over West Appomattox and vicinity last Thurs day evening doing considerable dam age to property aud growing crops. Ihe hail stones were the largest ever seen hereas large as guinea eggs. Every exposed window in the vil was broken and many rooms were flooded. The rainfall was very heavy and the streams of the county held people returning fr,m court water bound. Lightning struck the livery stable of Mr.  inston McKinney and killed two fine horses, one belonging to Mr. Frank Jeuniugs, of Lyuchburg, and the other to Mr. McKinuev, and damaging the stable considerably. Tbe rain was general but the hail seems to have been confined to a narrow territory of about five miles, sqareWst Appomattox being the cen ter. During the storm Hon. W. H. Ligon was sitting in the furniture establishment of Mr. T. A. Smith near a window reading, when a pane of glass was broken by the hail and flying piece of the glass struck him sqarely m the right eye, fearfully larcerating the pupil. Urs. Robert son and Abbitt examined the wound and both think he will loose the sight of his eye entirely. A letter received from Mr. Ligon yesterday stated that he was suffering very much and that both eyes appeared to be effected by the accident. Mr. Ligons friends are very solicitous abovt him and trust his sight will not he permanently effected."}, "highlight": {"text": {"matched_tokens": ["McKinney", "Frank"], "snippet": "stable of Mr.  inston <mark>McKinney</mark> and killed two fine horses, one belonging to Mr. <mark>Frank</mark> Jeuniugs, of Lyuchburg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney", "Frank"], "snippet": "stable of Mr.  inston <mark>McKinney</mark> and killed two fine horses, one belonging to Mr. <mark>Frank</mark> Jeuniugs, of Lyuchburg, and"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [271.2, 1040.4, 748.95, 1242.7], "bbox_id": "471dc07f19", "file": "AppomattoxNewspapers_1908-1909a_0471.pdf", "page": 1, "text": "Addie Lena Ferguson, Vernon Ragland, taidlle Cralle, Lucille ......... 1 __ _ _ __ Blackwell, !Rroiine XeGrand, prolleing are toucoea w a mauani w-  J -r. 1 William Jobe, Lawson lee, Alice proved by communist dogma. But chance, whpthgr for merchandise I  Joe Gailier Myrtle Din- there are great tomes on sociology, or cash? It s easy to exchangeI 8 Chilton Evelyn Dick- ytttar TTrw1r rel,rfn merchandise for cash. Urson, Horsley Harris, Frank I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth Sheriff McKinnéy and his de-1 Trent, Nellie -Simms, Christine puties have succeeded in round-1 Paulette, Eloise OBrien, Claud- Ing up a part of the gang which! jne OBrien, Hilda Moore, Carrie has been breaking open houses I Jamerson, Louise Godsey, Clark- and stores here for some time. e vanSj. Mandáne Anderson. Last Ftlday the Sheriff arid Alex. I Sixth gradeLeilas Davis,. Eliz- Bingham-tookcharge of Gordon I abeth Cralle, .Mary Clark, Ruby Smith at Blue1 Ridge and contin I Cole, Margaret Carter. Mabel"}, "highlight": {"text": {"matched_tokens": ["Frank", "McKinnéy"], "snippet": "cash. Urson, Horsley Harris, <mark>Frank</mark> I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth Sheriff <mark>McKinnéy</mark> and his de-1 Trent,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "McKinnéy"], "snippet": "cash. Urson, Horsley Harris, <mark>Frank</mark> I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth Sheriff <mark>McKinnéy</mark> and his de-1 Trent,"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [99.36, 381.67, 425.92, 1689.79], "bbox_id": "9c5dbeb7a3", "file": "AppomattoxNewspapers_1905-1912a_0579.pdf", "page": 1, "text": "The new pastor of the Presby terian church is not only a great eacher but a good mixer. He ha set out with the avowed p rpose of 8s-ing all the members of his floe m their horn s and they are welcom ins his visits. Tntt picnic for the Fourth above referred to is taking on vigorous life in the preliminary stage and pro mises to be he biggest thing of the kind ever held here. Two thousand invitations will be sent out aud be tween town and country at least 1000 should eat together on that day. Speeches will be mad by Commissioner Koiner, Mr. La- Baume and Mr. Collier, of Wah- ington. I am urging that some one with a good, clear, strong voice read the Declaration of Independence. The paper will no doubt sour d new te some ears. Judge Watson while in town was the guest uf Dr. W inston. Miss Mary Wade, of Richmond, is visiting MrB. Wade in her home at the corner of Beet h and St. Geoige  bevy of happy children et her ikoapitable heme on last Saturday I Streets, pternoon in honor of the fifth birth-1 Miss Loulie McKinney, of De day of a niece, Miss Harriet Booker. I oatur, Ga., is visiting in the home  Mis. W. C. Newman was hostess of J  g  Watkins. and elegant! Mrs.  alter Scott and MrB. W on Friday in the new of home on the corner of S t George P- Venale attended the meeting and Beech streets in honor of a sis-1 the hankers at Old Point ter, Mrs. Graham, of New York. A carrier pigeon, labeled 2270, Mrs. Elliot Booker eutertained at dropped in at the freight depot Boy- cards in honor of Mrs. Elliot kin, of Brnnswiok, Ga.  Mine host, Chick, who has had  charge of Hotel Prince Edward, will on the 1st of July take in hand the i Wes over, whore he once did busi ness and most succe sfully.  Tha Farmville Silver Band is be- i ing trained by an expert and if s practic s makes perfect we are pro mised tome flue music in our parks during the summer avenings. The Sous of Veterans are now well organized and the organ zation be gins life under favorable auspices. Mr. and Mrs. Frank Epes, who v have been boarding, are now bouse keeping on Randolph Street, I The cashiers of our banks hare met with brother bankers again and ! no doubt have caught fresh inspira tion for the deleoate work in which they are engaged. Wears disposed to think those men fortnnate who i handle money, and they are if it  happens to belong to them, bnt i managing the money of a com niunity has always impressed me  with being one of the heaviest bnsi  ness burdens borne by any one.  But we have honest and capable men who give their time and talents  to that work to the oomrort and t convenience of the business world The Government alone has authoiiy  to make what is oaled money, bnt  when it is remembered that ninety-  four per cent of the business of th country is doue with notes, checks and drafts it will be Been that our banks are most prolific money pnakers after all. There never was enough money in any land for the business demands of the people, and  a panic is nothing more nor lees than popular fear of notes, check land drafts. Let them eircnlat freely and alls well, let them enter cloudland and the business world , ahroded in gloom. The pe pie  the town and the surrounding conn  try are prond of the Farmville banks. Union services among tin churches are being held each Sun day evening at the different ci.n-ches I und are being well attended. It pleasant to see the brethren dwel mg together in unity. One as we are one was the prayer of the Christ  And it has yet to be answered. K The town officials, who are berve for tivo years beginning Sep nber, received all the votes cast the electit n held on the second esday though a small vote wa  The primary l as gotten to lx e important election for on th y representatives are really jbosen. Judge Walter A. Watsons maidon Speech in the Congressional race was made in Farmville on the eveni g of the 16th, the very day when iMoosevelt, as I hope, was meeti j"}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "the guest uf Dr. <mark>W</mark> inston. Miss Mary Wade,"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "the guest uf Dr. <mark>W</mark> inston. Miss Mary Wade,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [547.72, 596.85, 2146.07, 963.61], "bbox_id": "fb8989a9b8", "file": "AppomattoxNewspapers_1952-1954a_0238.pdf", "page": 1, "text": "ST. ANNS EPISCOPAL CHURCH Sunday, April 12 945 A. M., Church School. 1100 A. M. Morning Prayer Rev. Robert E. Withers. WILSON - WOOTTON Bakersville, N. C.- A ceremony of beauty and simplicity uniting in mar riage Miss Viola Christine Wootton, of Lenoir, N. C., daughter of Mr. and Mrs. A. W. Wootton of Appo mattox, Va., and Kenneth Guy Wil son, also of Lenoir, son of Mr. and Mrs. Frank Wilson, of Bakersville, N. C., was performed on Thursday morning March 19, at 1100 oclock at the McKinney Cove Baptist Church in Bakersville with the Rev. Ernest S. Canipp officiating, using the double ring ceremony. The bride and groom entered the room together, unattended. The bride wore a powder blue suit with white and navy accessories, and carried a white Bible topped with a purple throated white orchid. The bride is a graduate of E. C.., Glass High School in Lynchburg, Va., receiving her commercial train ing also in Lynchburg, She is now employed in the office of the Bern hardt Furniture Co. in Lenoir, N. C. The bridegroom is a graduate of Bakersville, N. C. school, after which he served 3 years in the U. S. Army,"}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "Mr. and Mrs. A. <mark>W</mark>. Wootton of Appo mattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "Mr. and Mrs. A. <mark>W</mark>. Wootton of Appo mattox,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [134.15, 272.62, 314.38, 1752.57], "bbox_id": "af01d5331e", "file": "AppomattoxNewspapers_1905-1912a_0528.pdf", "page": 1, "text": "P A K M V IL L K . Farmviile is still bjMy clearing away the wreckagejgft in the wake of the stormyThe blockaded streets hasrfieen opened np and the injured residences will pressed. The Iocs in every in stance total, as no one thought of tornado insurance. The one e x e r tion being in the case of Mcttrs. Richardson and Cralle who carried plate glass insurance. One of their front windows was destoyed bv a falling tree and for this they will be fully paid. The fire alarm w.is again soui.ded on a recent evening and the blaze soon located in th  residence o B. J. Harvey, of South Main street. The flatnes were soon under control, but not before the house and furni ture were seriously damaged. Lou, however, fully covered by insurance as is generally true when fires occur in towns or cities. Let the owners of country property think of these things. Sales of tobacco have been heavy of late in this market, but the farm ers are still kicking against prices And no wonder that they should Hard work to grow the weed and harder still to sell it below the profit mak. The recent heavy rains wrought great damage to the low lands of the ebunty. It is fe tred that some of the acres are beyond the working in the future. This means serious loss. A larger crop of lettuce was plant ed in the fall than had been done for previous seasons, but the exces sive cold of winter killed ont many of the plants. Those living, how ever, are growing off nicely. News of the death of Mr. J. R. Atwood caused genuine sorrow among his many Farmviile friends, who knew him only to honor him. The writer had often enjoyed the generous and gracious hospitality of his palatial home and will cherish his memory. For the stricken household he extends heartfelt sym- part by. At the last meeting of the Board of Supervisors for Prince Edward one concrete bridge was ordered and others may follow. It is abont time that public officials were learn ing that whats worth doing at all is worth doing well. Bridges should bd built not for a day but for all time so far as man can build for all time. The grass is spreading over our fields and lawns and now and then some premature bud is peeping from winter quarters. .Mrs. R. Baxter Tuggle recently celebrated the 21st anniversary of her wedding day by having a largi number of her lady friends to meet - her at a reception in the home of her mother, Mrs. Berkeley. The old home was artistically and hand  somely decorated for the occasion,  the yellow of early spring being the  reigning color, dainty refreshments  were served and the evening bright and memorable in the social history  of Farmviile. The reception only lasted from five to 733 p. m., bu during the time scores of friends were received and served. Mr. Frank Epps recently bought a horse on the Richmond market  with a trotting record of 216, and had the misfortune to lose the ani- . maj soon after reaching hi i stable. Death was caused by something like  pneumonia contacted on the train from Richmond. It is said that Mine host, Chick, P will no longer run the Randolph p hotel after the expiration of his lease 3 in August, and a hotel man from p Lancaster, Ohio, has been here  looking over the situation. It must be a fine, opening for some first- i class hotel man. i Our milliners have had their jggpingsand now the girls know jnst how the Easter bonnets look while the boys are waiting anxious judgment upon them af ten they adorn beautys brow. pr. and Mrs. Rouss, of Coving ton, Ky., have been guests of Mrs. Annie McKinney. Mrs. Lucy Dunuington Shields, df Lexington, Va., is visiting in the old home. Mrs, Florida Fitzgerald improves steadily... Mrs. Mai ia Thornton has return- pifto Chari ston, W. Va., whereshi trill finish her visit to friends, hav- idjj been called home on account of the illness of Mrs. Fitzgerald. The news that Senator Swanson bad gotten the unanimous consent of the Senate for a 6,000 appro priation for a Government building for Farmviile gave genuine satin- faction to all our people. We will no doubt squabble over a site, cat"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "received and served. Mr. <mark>Frank</mark> Epps recently bought a"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "received and served. Mr. <mark>Frank</mark> Epps recently bought a"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [339.88, 259.65, 501.13, 1691.88], "bbox_id": "589dca65d3", "file": "AppomattoxNewspapers_1902-1905a_0390.pdf", "page": 1, "text": "My friend, Mr. D. W. Gill, of this place, gave me hi copy of your paper of the 21st of September and also of the 5th of this month which contained the roil anti supplement of Co. K, 4th Va. Cavalry, and if we are not depredating too much on time and space in yonr valuable paper would be glad if yon would add s few more names to that already long list, which I can call to memory. Baldwin A., Baldwin, Bob, Kikin Cleaveland, Thornton Frank, Cox George, Hazlegrove Tomas, Hazle- grove Cbas., Hazlegrove Henry, Powell Jake, Steger M.D. and Lack- land George. Both papers gave the same Stegerone James and the other 8ydnorwhich was the same man as his name was J. S. Steger. I have forgotten M. D.s initials in fall, in fact I cannot give none of the names in fail, bat I can give vou Lieut. Gills, his v.as Robt. H., ind was our 1st Lieutenant elect at the New Store, and was killed in tbe V lley of Virginia while gallantry leading a charge. Lieut. Wm. A. Vf 088 was then made 1st Lieutenant ind commanded Co. K the balance f the war faithfully and fearlessly. Lieutenant Nat Morris was elected 2d Lisritenant, but was put in com mand of the stnd horse battalion un .il that command was annihilated tnd then he was promoted to com mander in chief of Co. Q. Lieut. G. C. Croxton was onr best lieuten ant and he was appointed by Col. fftokham and killed at Five Forks, Dinwiddie county, Va. H. S. Crute -vos onr 1st o rderly sergeant, B. H. Carter was onr quartermaster ser geant. Capt. McKinney wae wound ed at Stcvensburg in his knee and disabled for the balance of the war. t would give yon the dates if I could, lint I have forgotten them. In nam ing George Lackland brings to my mind a little incident that occared -it Spotsylvania C. H. during our big fight there. We had been fighting three or four days with infantry un til Gen. Stnart relieved ns with Gen. facksons men and we went into camp on Saturday night. Bnt about wo hoars before day on Sunday morning were ordered to prepare two or three days rations, and by light we started and was marched ip to the Court House and the Hrick Church tbe Fourth Regiment vas dismounted and ordered iu sup port of the Sixth Virginia Cavalry which was fast being driven in our direction, and we had hardly started when some of the boys said Charge, and just here Maj. Wool- ridge, who was in command of tbe Fourth Virginia Regiment, lost hie leg. We ran these skirmishers back icross a branch and up a hill some five h indred yards, and just on top - f this hill a new rail fence ten rails and stake and rider. Right here we ooys haled and commenced looking for something to get behind for ight in front of us and in plain view was a double line of yanxee in- antry. Well, sir, they soon open ed on us and I tell you the splinters tlew. But we were not there long before a ball struck Sergeant John S. Nickolas on the counter cf his boot when he cried out, Lord haveTner ey on me! D------that trick toh Barbee take nié out, and we jump d up and started. I had thought up to this time that I was pretty id on a race, but John gained on me at at every jump. And in run ning down that hill there was a washout in which we found George Lackland and he asked us to please take him out and we assisted him to get out and we started again and he after us. The Third Regiment had been dismounted and marched to this branch in support of the Fourth and when I got there they told me t bat the boys had passed sometime, and I waited uutil our regiment was ordered in and then we started from there in pursuit of Sheridan, who was marchiDg on to Ri- hniond. do not suppose that m old friends could put up such a run now. Mr. Editor, when you think all the names from different sources have been obtained, please print the whole list giving every man his proper distinction, and then the ros ter will be in the proper shape for Mr. Ellis to put in the clerks office, and in the pioper shape for each member of old Co, K to keep also, and pleise send me a copy, which kindness I will greatly appreciate. My best love to all the boys. I would be delighted to see them. Respectfully, A. A. B a r b e e ."}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "My friend, Mr. D. <mark>W</mark>. Gill, of this place,"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "My friend, Mr. D. <mark>W</mark>. Gill, of this place,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.39, 210.96, 1712.01, 1713.08], "bbox_id": "2aed2bb2ac", "file": "AppomattoxNewspapers_1915-1918a_0310.pdf", "page": 1, "text": "Mr. H. M. Crowder was in town last week. Mrs. Lavona Crowder made short visit to Mrs. S. L. Fer guson last week. Miss Alice Proffitt left last week for Cleveland, Ohio, where she will live for a while A d a m e Bros.-Paynes Co., Lynchburg, have change of ad ou this page. Sheriff McKinney wants a jailer, but there is no one in jail. Mrs. R. N. Dawson, of Rich mond, is visiting her parents, Mr. and Mrs. R. H. Browning, near here. Mr. George Paris gave a few of his friends a party Saturday night, the 20 th, which was his birthday. Mr. and Mrs. 0. G. Chandler have returned home, after a very pleasant visit spent with home people near Burkeville. Miss Kyle Davis, of Culpep- , Va., has been on a visit to cousin, Miss Eula May Burke, for several days. WantedColored family oa large farm. Good wages and land for orking people. Address, with prticnlars, Box 28, Route 1 , Ever green, Va. 110 3w Mr. Moses Hunter has nine children down with measles. he children are doing well, and Mose is a very busy man. Mr. C S. Frank was a visitor in Appomattox today. He has recently bought a farm in the Southside of the county. A large attendance of far mers is earnestly desired here at the C. H. Saturday, to or ganize a Farm Loan Bank. Are you coming? W hats the N. Sc W. going to do for the people of Appomat tox, since the people yielded to iheir contention for the dos lag of the main street crossing? Mr. Jessie Harvey sold on tbe Appomattox tobocco mar ket to-day 1000 lbs, for which he received 224.86. What market can beat it? If you want the farms of Ap pomattox to keep up with the progress of the State, come out Saturday and help organise the  federal Farm Laud Bank. Are you ooming? Supervisor L. E. Smih at tended the recent good roads meeting in Norfolk. Len is a ive supervisor, and wants Ap ppmattox to stand for progress, good roads. FARMERS! .Tobacco is selling high. You ought to start your plant beds for this years crop right, by 6  ng Old Dominion Guano on it. have jnat received a carload of eah m tde goods. 17 2 w E. L e R oy S mith . Rev. McElroy has been con fined to his home since Monday with a deep cold. He is much better and expects to be ready for the prayer meeting Thurs day night. Miss Pocahontas Wray, of Martinsville, Va., is on a visit to the Dormitory here. Miss Wray was teacher here for our years, and her friends are glad to have her with them Evergreen Baptist church Quarterly church meeting Sat urday, 27tb, at 230 p. m Preaching Sunday morning 11 oclock, and 8 unday afternoon oclock. My boy left home about tbe last of. February a year ago His name is Levi. Any infor mation about his present resi ilence will be highly appreciat ed. Has large eyes, 15 years of age, black. J a s . W . F lood , Appomattox, Va, There will be a meeting of tbe Appomattox Barred Rock Associa non on Feb. 2nd at 230 p. m. All members are urged to toe present, ae Mr. N. E. B. Talcott, State Ponltry Agent, will be he, e and will give ,ou some interesting information, 1 24 2w E. LeRoy Smith, Sec Preaching at Memorial Meth odist church Sunday at 11 a.m by the Presiding Elder of the Lynchburg district. Rev. W .T Green, who will preach again Monday morning at 11 a. m and hold the first quarterly conference of the year. Ser vices Sunday evening at 730 by the pastor. Subject, T te Power of the Gross. Sundagr school at 10 a. m. and proytv meeting Wednesday evening at 730. Everybody invited to attend these servioee."}, "highlight": {"text": {"matched_tokens": ["McKinney"], "snippet": "ou this page. Sheriff <mark>McKinney</mark> wants a jailer, but"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney"], "snippet": "ou this page. Sheriff <mark>McKinney</mark> wants a jailer, but"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [713.98, 649.16, 872.39, 1028.03], "bbox_id": "434b14c48e", "file": "AppomattoxNewspapers_1933-1936a_0004.pdf", "page": 1, "text": "Mr. and Mrs. T. J. Harvey, oi Riehmoiid, spent Thursday in the home of Mrs. Helen Welch. Miss F ankie McKinney, who has be en visiting in Alex- andria and Lynchburg, has re- turned hon- Mrs. S.  1. Munsey and little daughter, JJetty Vaughan, are visiting redatives at Cumber- land. Frank F irguson, of Damas- cus, spent the week-end with his parents , M.r and Mrs. J. M. Ferguso n. Mr. and Mrs. Jessie Bogar, of Lynchburg, visited in the home of M -. and Mrs. Everette Blackwell, Sunday. Mr. and Mrs. C. C. Pearce, of Farmvii e, spent Sunday in the home of Mr. and Mrs. Loyd Levi Mrs. H. G . Johnson and family and Mrs. G. L. Doss and family spe it Tuesday in t h e home of B. L. Jordan, at Cul- len. Mrs. A. B. Abbitt, Mrs. W. J. Murden and Miss Hazel Ep- pard, who have been spending several weeks at Vera, have returned to their home in New- port News."}, "highlight": {"text": {"matched_tokens": ["McKinney"], "snippet": "Welch. Miss F ankie <mark>McKinney</mark>, who has be en"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney"], "snippet": "Welch. Miss F ankie <mark>McKinney</mark>, who has be en"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [175.69, 329.5, 345.49, 706.99], "bbox_id": "fdd56c7282", "file": "AppomattoxNewspapers_1908-1909a_0534.pdf", "page": 1, "text": "Miss Christine Robertson spent last week in Lynchburg. Garland Morris has been sick for several days.0 Mrs. Paul Ferguson visited her mother Sunday.  Mrs v. AT McKinney is visiting Mrs. Douglas Pennick in Lynchburg- Courtney Franklin and Frank Irving, of Pamplin, were visitors in town Wednesday. Mrs. J. F. Harvey h a s re turned from a visit to relatives , in Charlotte Court House Misses Bessie. V and Alice Larwood spent the week-end at home. Miss Emily Harvey made a brief visit to Stapleton this week Miss Mary Taylor Gills, of Bedford, spent th e week-end with her parents. Mr. and Mrs. J. W. Clark, of Rustburg, were visitors in town Sunday. Miss Florence Caldwell spent the week-end with her sister, Miss Anne. Oaldwell."}, "highlight": {"text": {"matched_tokens": ["McKinney"], "snippet": "Sunday.  Mrs v. AT <mark>McKinney</mark> is visiting Mrs. Douglas"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney"], "snippet": "Sunday.  Mrs v. AT <mark>McKinney</mark> is visiting Mrs. Douglas"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [185.3, 307.14, 356.82, 1814.97], "bbox_id": "02a55778e5", "file": "AppomattoxNewspapers_1922-1923a_0520.pdf", "page": 1, "text": "F A R M V I L L E . Some of the houses in this towi have been so crowded with visitor dining the summer that the house keepers are enjoying the though that the emptying process will sooi begin. Evidently Farmville it growing in favor as a summer re sort and with its location, lithii water and other advantages it de- strves to attract widespread atten tion. The more I know of othe sections of the State the more am  satisfied that the Southside is th home of physical comfort. O il tables are much better supplied our nights are never uncomiortab ly warm, we havent the mosquito, the water is soft and good even where and as far as our people, well we will let others sing theii praises. The melon fadure has produced contusion in the ranks of tin brothers in black. The happiest human being I ever saw was old Goliah, many years dead, with a water melon all his own. How we do miss the peaches. Can we not introduce the use of the canvass for the peach orchard as well as the tobacco beds? We used to find them in the fence cor ners and along the roadside, and and they were good. Whats wrong with nature? Or is the fault with man? That drinking fountain f r Main Street is yet non est, but the dis pensary is  doing bittiness at the old stand. Editor Hart carries his head somewhat higher since Supervisors honors rest on him. He hasnt an nounced, however, that he would stand lor the legislature next time The Presbyterians have been greatly pleased with the preaching of Rev. Mr. Hatcher, pastor of the Methodist church, during the month of August and while their pastor was on his vacation. I suppose before the gates close a large majority of the people of Farmville will have been to the Ex position. Mrs. Miller, of Pennsylvania, is a guest at Mrs. Berkleys. Mrs. Dr. Crute has been visiting friends in Charlotte. Miss Frank Jones, who has been with friends is Smithfield is at home ai Hampden Sidney again. At the recent meeting of the Jewelers of the State Mayor Blanton was made 1st Vice-president of the body. He is an accomplished occu- list as well as expert jeweler. The Hampden Sidney boys and the Normalites will soon be report ing for duty. This means another year gone, and to some of us that means much. Miss Stone, who has been writ ing to the Roanoke Times from here, has been saying some hand some things of Farmville. Captain Hunt has been so impor tuned not to resign from the com inand of the guards that the hope is entertained that he will not do BO. The new conservatory of music is opened for scholars. Prof. G. W. Walker, of Blacks burg, will make the opening- ad dress at Hampden Sidney this year. No pastor has yet been selected for College church. Farmville will be crowded with amusements for the coming season. But the new railroads are slow- a-coming. It must be interesting to some people just to project new enterprises and leave them in the air after the  hot air has been ex pended. The old-time farmers picnic was a great success. Tobacco still demands first claims on our cash and is sure to get it. A winsome weed is she. The Methodists are hoping to dedicate their new church building in the near future and when that is done they will have oue of the most attractive ho ises of worship in the Common weal lb and with the Nor mal contingent the congregation will be one of the most interesting. Rev. Mr. Hatcher preached a noble sermon on last Sunday, his text being,  Keep thy heart for out of it are the issues of life. Judge Laudon C. Flourney, of Kentucky, has been a visitor in the borne of Mrs. J. R. Fitzgerald, his P sister. His father, the late W. C. Flourney, was a lawyer of com manding ability. Misses Pattie and Maggie Wnj kins, daughters of the late Judi F. W. Watkins, are visiting friend in Farmville and furroundinji to an try. Air. C. D. McKinney, a son jfce late S. B. McKinney and botfl rninent attorney at the Aidant"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "friends in Charlotte. Miss <mark>Frank</mark> Jones, who has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "friends in Charlotte. Miss <mark>Frank</mark> Jones, who has been"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.7, 327.54, 1521.01, 705.78], "bbox_id": "63686db23b", "file": "AppomattoxNewspapers_1908-1909a_0238.pdf", "page": 1, "text": "Èdrs. T. A- Walton is attend-  the State W. C. T. U Con ation at Danville this week. jdr. an d Mrs. Leslie Ligón d sons, pf Pamplin, were re- at visitors in Appomattox. Miss Frankie McKinney -s fending some time with rela tes in Lynchburg. h e family of Mr. Iverson Bth hai moved into the resi- hce of Mr.George Walton. Hr. Ragland Featherston ant the week-end with his kily here. H r. and Mrs. J. H. Lewis, of fckingham, w e r e visitors ke Tuesday. Edrs. Walter Woolridge, o f pichburg, has been on a visit Relatives here, EMr. Eddie Moore, .of W- Va., mere on a visit to his mother, is. M. L. Moore- firs. Lilly Gregory, Milles mrence and Emma Gregory n Naomi Hancock were re- E t visitors in Staunton. Blisses Anna and Nina Jones p Mr. Frank Stratton visited Ends and relatives in Roan-"}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "is attend-  the State <mark>W</mark>. C. T. U Con"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "is attend-  the State <mark>W</mark>. C. T. U Con"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.7, 354.65, 1671.56, 930.59], "bbox_id": "d3399f034e", "file": "AppomattoxNewspapers_1939-1943a_0290.pdf", "page": 1, "text": "Don Moses, Mr. and Mrs. J. C. Caldwell, Miss Jessalyn Hancock, F. S. Drinkard, and Mr. and Mrs. Joe Ovwtttan left today to spend two day ftahing on the Rappahannock River.  Mrs. Florence Bingham is spend ing this week in Richmond. . Mr. and Mrs. Dulany Foster, of BfiSfcnore M? and Mrs. J. Vance Fitkins, and two children, of Green ville, N. C. and Mr. and Mrs. Bur- x o  Temple, of Kenston, N. , wM Mend this week-end here with the  and Mrs. H. Frederick Jones. Mn. Temple trill remain for a long er Visit. Evelyn Shaver, of Lakeland, Florida, will arrive Saturday to visit Miss Beulah Ferrell. tHnner guests Sunday of Mra. I Gilliam were Mr. and Mrs. Frank Gilliam and Mr. and Mra. Willie Gilliam, of vote Edgar Harvey, oof Fort Mean. Miss Mandane Anderson, ofF ort Banning, Ga., wMspei thnsw c- end with her father, B. G. Ander son. We are glad, to report that Mrs. Julian Wingfield is lmPy?v g.  a recent illness. Mrs. Wingfield has U K patent in a Lynchburg hos pital. K i r . and Mrs. R. M. Langran, of Arlington, Texas, visrted his brother, G, F. Langran last Thursday. Miss Hilda Moore is spending her Icetion at her home here. Bprivate Lawrence W. Moore, of Fort Monroe, and WiUmm and Cal houn Moore, of Richmond, spent the week-end here. K l i s s Janie McKinney will Return to her  after an extended visit With relatives at Alexandria. The following motored to South l stin May. 18 to visit Mrs. Molhe Dickerson Mr. and Mrs. Otis Smnn of Lynchburg Mr. and A s . W. H. Guill, and family, Mr. and Mis. Roland Ferguson. Mrs. H attie E. Ferguson, Willie McCor tick. Dinner was serve1 atyle on the lawn. The occasion was the birthday of Otis Smith"}, "highlight": {"text": {"matched_tokens": ["Frank"], "snippet": "were Mr. and Mrs. <mark>Frank</mark> Gilliam and Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank"], "snippet": "were Mr. and Mrs. <mark>Frank</mark> Gilliam and Mr. and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [331.44, 270.14, 490.2, 580.29], "bbox_id": "5f02240a53", "file": "AppomattoxNewspapers_1902-1905a_0120.pdf", "page": 1, "text": "Domestic. Judgi Waddill, in the United States CouTt in Richmond, Va., decided that by applying for a receiver the Trigg Shipbuilding Company did not commit an act of bankruptcy.  James McKinney, the last of the out laws who broke out of prison at Glas gow, Mont., was shot to death by a fanner, in whose icehouse he had taken refuge. Frank C. Jappe, cashier and book keeper for the Frank Leslie Publish ing Company in New York, was ar rested, charged with robbing the com pany of about 10,000. George Bartuski, who claimed to be a violin virtuoso, was arrested in Eliz abeth, N. J., on the charge of being a counterfeiter. Vice President Loomis, of the Dela ware and Lackawanna, declared there would be enough hard coal to supply all demands this year. Lightning strnck a hut stored with 3000 pounds of dynamite rear Seneca- ville, O. Six men were killed in the explosion and a score injured. Maurice OHearn, a night watchman, was shot and killed by a suspicious- looking tnan whom he had challenged. The court in Pittsburg allowed Dr. W. C. Browning 54,163.18 against the estate of the late C. L. Magee. The State Bank of Oakley, Kan. was robbed and 3000."}, "highlight": {"text": {"matched_tokens": ["McKinney"], "snippet": "act of bankruptcy.  James <mark>McKinney</mark>, the last of the"}}, "highlights": [{"field": "text", "matched_tokens": ["McKinney"], "snippet": "act of bankruptcy.  James <mark>McKinney</mark>, the last of the"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1367.29, 323.75, 1522.91, 844.73], "bbox_id": "48a63a5b45", "file": "AppomattoxNewspapers_1908-1909a_0237.pdf", "page": 1, "text": "4rs. T. A. Walton is attend- the SUte W. C. T. U. Con- tion at Danville this week. r. a n d Mrs. Leslie Ligon sons, of Pamplin, were re- t visitors in Appomattox. liss Frankie McKinney is  nding some time with rela ys in Lynchburg. , he family of Mr. Iverson rith has moved into the resi de of Mr, George Walton. r. Ragland Featherston nt the week-end with his ily here. Ir. and Mrs. J. H. Lewis, of ckingham, w e r e visitors e Tuesday. 1 I rs. Walter Woolridge, of . chburg, has been on a visit relatives here. r. Eddie Moore, of W. Va., ere on a visit to his mother, i. M. L. Moore. irs. Lilly Gregory, MiÄes rence and Emma Gregory Naomi Hancock were re- t visitors in Staunton. isseS Anna ,and Nina Jones Mr. Frank Stratton visited nds and relatives in Roan- last week. he W. q. T. U. will hold its ular mothly meeting Friday ernoon, 3 oclock, at the e of Mrs. W. P. Gills. rs. Douglas PeniCk,, of chburg, is the guest of her ers, Mrs. Mary, and Miss Lie McKinney. liss Florence Gregory left esday for her senior year  Farmville State Teachers"}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "is attend- the SUte <mark>W</mark>. C. T. U. Con-"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "is attend- the SUte <mark>W</mark>. C. T. U. Con-"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
