{"document": {"bbox": [1739.48, 268.35, 1849.99, 278.75], "bbox_id": "ce80d57e4e", "file": "AppomattoxNewspapers_1892-1898a_0051.pdf", "page": 1, "text": "GEORGE T. PEERS,"}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "<mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "<mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>,"}], "text_match": 1736172819517538425, "text_match_info": {"best_field_score": "3315704398080", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517538425", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [461.05, 539.81, 600.6, 893.69], "bbox_id": "fb5516c5a2", "file": "AppomattoxNewspapers_1974-1975a_0246.pdf", "page": 1, "text": "years, delights in telling her i story of the surrender which , took place here April 9, 1865, j just 77 years ago Thursday. Aunt Millie, quaint, timid, and full of interest in her white and negro friends, was active for her age until last spring when she was struck by a bolt of lightning while in bed. She now walks with the aid of a eane, keeps house for her only son. Uncle Bob Craig, who has served as janitor at Appomattox High School for several generations. Aunt Millie was 13 at the time of the surrender and was the nurse maid of Charlie Sackett Peers, six month old son of Mr. and Mrs. George T. Peers. Mr. Peers was at the time clerk of the Court of Appomattox and was living near the scene of the surrender. I was walking de floor, patting my baby to sleep, when those yankee soldiers came bustin in Marse Georges house. The soldiers hollered for everybody to leave de house cause the worst battle ever fought was starting right den. Marse George fetched Miss"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers", "Peers"], "snippet": "of Mr. and Mrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>. Mr. <mark>Peers</mark> was at"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers", "Peers"], "snippet": "of Mr. and Mrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>. Mr. <mark>Peers</mark> was at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [649.7, 1457.93, 808.53, 1626.08], "bbox_id": "14cfebef48", "file": "AppomattoxNewspapers_1898-1902a_0030.pdf", "page": 1, "text": "Work is being pushed on the naw hotel of Mr. T. A. Smith. The new residence of Mr. T. A. Walton is be ing pushed to completion and will be under roof in a few days. Mr. Ernest Gills fine residence has been let to contract. Messrs. George T. Peers and E. W. Taylor will build a handsome residence on a part of the Smith lot, adjoining -Messrs. Hill, Burke and Miss Lelia Inge. The beautiful new Baptist church is completed. Who says West Appo mattox is not forging ahead."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "let to contract. Messrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> and E. W. Taylor"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "let to contract. Messrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> and E. W. Taylor"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.89, 1039.81, 1656.63, 1733.23], "bbox_id": "3f7d380ad5", "file": "AppomattoxNewspapers_1902-1905a_0053.pdf", "page": 1, "text": "ward LeGrand,  Sr., died very suddenly of heart disease, at his home three miles oast of here. Mr, LeGrand, a few dys before, attempted to hew some rai road ties near his residence, and had the mis fortune to cut his knee very badly with the axe this, however, was net the cause if his death. It has been known for years that his heart wasseriously affected, and while his death was a great shook to . his relatives and friends, they have rather xpected that the end would come sud- lenly. His father and one of iiis brothers jassed away in the same mannerwith, mt a moments warningfrom heart disease. The deceased was 62 years of vge, and had spent his whole life in this his native county. He comes from one of the old Virginia families, and is tho last son of fifteen children horn unto Caroline Hunter and Archer Alex. Lc- ttvand. He connected himself with Lib erty Baptist church when quite a young man _ 45 years ago, and his walk in life has been upright and correct, full of Christian love for his neighbor and fel- lcwman. It is said there are only two other members of Liberty who have wor shipped with the church longer than the deceased,  ind they a-r Messrs. M. H. Golem an and T. H. A. Clieathain. Hu served the Confederacy with distinction to himself and fidelity to the cause. He was several times wounded, and was promoted to theoffice Lieutenant for bravery am.proticcn cy. He has held positions of honor and trust j since the war. the latest position that of Sup- I intcmlcut oi the County Aims House and farm, in all of these positions lii .1 character, shown out as a great power and influence for good. Thirty-six years ago he married Mi6S Sarah Ann Smithsister of T. A. Smith, of this place. As a result of this marriage six child rensurvive him, together with his widow as d II ows ! Mrs. IV. M. Hancock,of this piu.cvj  E. LeGrand, Jr., Evergreen Mrs. W. A. Keilv, Crewe L. B. LeGrand, Lynchburg, Ya. Mis. W. D. Mason, Pam pi in City, and Josiah LeGrand, who remainsst horn. lie. s also survived by live sister Mrs. C. V Hancock, Mrs. C. A. Abbitt, of this place Mrs. S. H. Kelly, of Crewe Mrs. W. H.Iiay- ick, of Washington, D. t, and Mrs. Kh-.h- d Bright, of Kansas City, Mo. His funeral was preached by his pastor, Dr. G. B. Taylor, to a large assemblage of sorrowing friends and relatives in a tender and consoling style, and the interment was had Tuesday evening at Liberty Cemetery in the presence of a large crowd of his old friends. The pall-bearers were J. R. Atwood, K. F. Burke, R. 8. Jenkins, H. W. McKinney, J. F. Dickerson, and Jennings Ferguson. George T. Peers, Jno. G. Fisher and Misses Vera Burke and Virgilia Atwood sang a very appropriate song. The sod never rested over a nobler charuc ter than Ned LeGrand. He w as our friend he was a friend to everybody. There is none to take his place."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Dickerson, and Jennings Ferguson. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Jno. G. Fisher and"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Dickerson, and Jennings Ferguson. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Jno. G. Fisher and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [782.66, 1337.08, 941.99, 1524.12], "bbox_id": "62808b6fb7", "file": "AppomattoxNewspapers_1898-1902a_0642.pdf", "page": 1, "text": "TN THE CLERKS OFFICE OF APPOMAT- 1 TOX CIRCUIT COURT, February 7, 1902 ft. W. Fleshman ................................ Plaintiff, against It. L. Marshall.............................Defendant A ction of T respass on the C ase in A s  sum psit and on A ttachment  D amages , 400.00. The object of this suit Is to recover of the defendant, li. L, Marshall, the sum of 360.00, due to the p aintiff, It. W, Fleshman, for the board of the defendants wife and two child ren from the 1st of January, 1900, to the 1st of January, 1902, s.nd to attach the effects of the said defendant in the hands of J. T, Moses, trustee. And affidavit having been made that the said claim is just aud uupaid. and that the plaintiff is entitled to, and ought to recover, the same, and that said li, L. Marshall is h non-resident of this State, It is ordered that he do api-ear here within fifteen days after due publication of this order once a week for four consecutive weeks in the Appomattox and Buckingham Times, a newspaper pub lished in this State, and do whatever may be necessary to protect his interests iu the pre mises.A copy. Teste GEORGE T. PEERS, Clerk. J. P. L, F leshman , p. q. 2-12-4t"}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "pre mises.A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. J. P. L,"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "pre mises.A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. J. P. L,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [551.52, 346.56, 869.87, 420.41], "bbox_id": "b8fefccc94", "file": "AppomattoxNewspapers_1898-1902a_0527.pdf", "page": 1, "text": "The uew mill is now ready for the Julian Ahbitt. machinery, which will be put into The District Conference will he its place tins weak. j held at Salem church, commencing Clerk George T. Peers will leave I nex Wednesday, to-morrow for Blue-Ridge Springs,  Mr. and Mrs for a little needed vacation."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Salem church, commencing Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will leave I nex"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Salem church, commencing Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will leave I nex"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [249.07, 447.91, 413.06, 1223.26], "bbox_id": "1024d6fe6d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "TH E COUNTY CLERKSHIP. A right pretty political fight is to take place in this county for the clerkship, which is the best-paid office within the gift of our jieople The present clerk holds od for two more years, and then the will be made for an eight-year term Dr. D. Mott Robertson, late county- treasurer, who resigned that office last summer, has announced to sono of his friends that he will stand fo the Democratic nomination for tb clerkship, and that he will, if elect ed, run the office for the fees alone This would be a saving to the tax payers of nearly 600 per annum, or nearly 5,000 for thè term. The election is some distance be fore us, and it is not our purpose to stir up the candidates or the people upon the subject thus early  but we shall fill the field of a newspaper and keep our readers informsd of events as they occur. Among tbi possible candidates we feel warrant ed in mentioning our present sheriff. Mr. S. P. Coleman, who would be u formidable opponent for any aspir ant H. Winston McKinney, the ef ficient deputy clerk, who is perhapi more familiar with the duties of the office, and better qualified for theii discharge, than any other available man. Should he enter the race, he would undoubtedly have the warm support of Mr. George T. Peers, the present clerk  and Mr. Peers would, no doubt, remain in the office for a time to aid him in his work. Mr. J Rolfe Horsley, whom Mr. Peers de feated for the office in 1899, is also likely to be a candidate. Mr. Hors ley last Week resigned the position of private secretary to Congressman Flood, which oarried a salary of 1, 200 per annum paid by Congress and assumed the management of the Southside Virginian. The resigna tion of Mr. Horsley probably caused Dr. Robertsons early announcement of his candidacy. We are satisfied that there will be other candidates. The people are being quietly sounded as to thiB and that man, bat the great majority of them will hardly bind themselves to any one at this stage of the game- none, perhaps, except a few whc be lieve that they ought to be allowed  to shape all the public policies of the connty, and to name all of the officeholders years in advance of the election. We respectfully dissent, and Bhall await developments before we bind ourselves to the tail of any"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "warm support of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, the present clerk  and"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "warm support of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, the present clerk  and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [162.96, 447.06, 323.72, 815.84], "bbox_id": "4e74e70347", "file": "AppomattoxNewspapers_1902-1905a_0462.pdf", "page": 1, "text": "TH E COMING PRIM ARY Soon the candidates will begin to call upon the dear people. In Ap pomattox, Mr. George T. Peers, who has been clerk of the county fo nearly forty years, with an interi um of one term, will not stand for re-election. There will be several candidates for the place. The member of the House of Delegates from this connty will not be elected without a contest. The Connty Democratic Committee ia to he elect ed also at the primary to be held some time in August. As soon as the State Committee decides the date for holding the primary, the candidates will begin to come out, and with the above lo cal fights on band and the warm contest to be waged for U. S, vena- tor and Gorernor and other State officers, the contest will prove to be the warmest election held in old Appomattox for many years. Ev ery Democrat will have a chance to vote for the man of bis choice, and it behooves each voter to oast hie hallo in the interest of his state and county. Dont pledga your support .00 early in the fight"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "In Ap pomattox, Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, who has been clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "In Ap pomattox, Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, who has been clerk"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1743.58, 801.14, 1906.68, 980.84], "bbox_id": "9583053cef", "file": "AppomattoxNewspapers_1892-1898a_0053.pdf", "page": 1, "text": "Telegram of Congratulation, Below we give one among the many congratulatory letters and tele grams received by Mr. George T. Peers, who was elected Clerk of the County Court at the late election pplll St -G eo . T. P eers , Appomattox, Va. Durham oounty congratulates yon and through you the people of Ap pomattox, upon the triumph of vir tue, justice, honesty and truth. C aleb B, G reen , Clerk of Durham Superior Court."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "grams received by Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, who was elected Clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "grams received by Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, who was elected Clerk"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [460.11, 996.02, 619.81, 1175.01], "bbox_id": "f8f0c8ead4", "file": "AppomattoxNewspapers_1898-1902a_0139.pdf", "page": 1, "text": "See sale of Buckingham land by S. P. Van- derPUfij trustee. Buckingham County Court next Monday. The weather is interfering with the burning of plant-beds. The cattle quarantine goes into effect on the 15th instant. Col, Wingfield Peters has beeti in the county this week on busiuess. Clerk George T. Peers is confined to his room at Hotel Appomattox. Mr. John Rosser, of old Cgyn- house, lost a very fi n e-W-aatw ee k."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "week on busiuess. Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is confined to his"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "week on busiuess. Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is confined to his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1107.59, 1847.46, 1264.99, 1997.26], "bbox_id": "76c47bab37", "file": "AppomattoxNewspapers_1898-1902a_0212.pdf", "page": 1, "text": "R. F . Burke, administrator with the will an nexed of Geo. L her Graff, decd. Plaintiff, against  in c h a n c e r y . Fannie Montelle Hopkins. Eleanor Graff, and the unknown heirs of Mary H. Graff, under the style ot unknown parties. Defendants. Theobject of this suit is to have a const rue tion at the will of George Usher Graff, decd, by the court, and to recure distribution of tne estate to the parties entitled to it. And it appearing by affidavit filed, that the defendants, Fannie Montelle Hopkins and Eleanor Graff, are not residents of this State, and that the heirs of Mary H. G raff, donefls, are unknown It is orqpreij hat tbpy do qp 3fJay hpfp wittyn fifteen qays alter dite pub- icátiop of tu a order oDce a week for four ihtìeèssiVé week Id the Appomattox and Buckingham T im es , a newspaper published in the State of Virginia, and do whatever may be necessary to protect their Interest in this fa it.A copy. Teste GEORGE T. PEERS, Clerk. H. D. F lo o d , p. q. -e-4t."}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "fa it.A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. H. D. F"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "fa it.A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. H. D. F"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1098.96, 1542.42, 1412.77, 1615.93], "bbox_id": "c67b277ad5", "file": "AppomattoxNewspapers_1898-1902a_0634.pdf", "page": 1, "text": "plaintiff is entitled to, and ought to recover, I the same, and that said K, L. Marshall is a  Address non-resident of thi 3 State, it Is ordered that  he do up ear here within fifteen days after due publication of this order once a week for  ITT . . . . ..  - four consecutive weeks in the Appoimrtox ! T lie lig llv v iiy O I  ra lc  1111 and Buckingham Times, a newspaper pub-  T r i v e l lished in this State, and do whatever may be 1  v 4  necessary to protect his interests in thepre- The Southern Hallway bogs to cull Atteo- mises.A copy. ......................... Tpstp GEORGE T. PEERS, Clerk. J t Pt L, F leshm  n , p. q. _________ - 1  4 t"}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS", "t"], "snippet": "Atteo- mises.A copy. ......................... Tpstp <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. J <mark>t</mark> Pt"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS", "t"], "snippet": "Atteo- mises.A copy. ......................... Tpstp <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. J <mark>t</mark> Pt"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1082.15, 848.51, 1243.18, 1052.86], "bbox_id": "95cad9d730", "file": "AppomattoxNewspapers_1898-1902a_0114.pdf", "page": 1, "text": "OMMISSIONEKS SALE of a fine James u River Farm in Appomattox county. Pursuant to a decree of the Circuit Court of Appomattox county, in the chancery suit of Hutton, etc., vs. Jonesadmretc , I will offer for sale at publie auction, at Appomattox court houso on Thursday, January 5th, 1899, that being county court day, at 1180oclock a. m., that tract of land known as Laurel Will, situated on James Rive , near Walkers Ford, and containing 501 X acres. Subject to the mineral rightsof John Nuttall and others. TERMS One-third cash, balance on a- crédit of one and two years. The purchaser to give bonds in equal instalments for the deferred payments, bearing interest from day or sale Hale subj ect to ratification by the court. JOSEPH BUTTON, Commissioner. In the Clerks Office of the Circuit Court of Appomattox ceunty  Button etc., vs. Jones admr., etc. 1, George T. Peers, Clerk of the said Court, do certify that the bond required of the Com missioner by the decree rendered in said cause has been duly given. Given under my hand as Clerk of the said Court this 8th day of December. 18V8. GEORGE T. PEERS."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Jones admr., etc. 1, <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Clerk of the said"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Jones admr., etc. 1, <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Clerk of the said"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.26, 910.38, 1647.48, 1050.67], "bbox_id": "7250ff527f", "file": "AppomattoxNewspapers_1898-1902a_0708.pdf", "page": 1, "text": "Nathan J. Walkerlkp  t0 be begun at once, r, Professor G. W.  nd, have been vfeH Pc re ise e unconawyM a  -  xt.j se of the trouble was traced by the ation of the pupils of the eyes. They ie fully recovered. cii srs. George T. Peers, The Lexington postoffice was finally l Job G- X r S S 4 M inpftj, and ethers froeet. adjacent to the county court V tlrad etfT b e L ynofò ise. irtrhie pdevens-H- -nnw. teiwi-  their mail from the new office ich gives great satisfaction and ha. - -  ln y conveniences. . . B. C. Babcock aud rhe Lynchburg Tobacco Association"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "fully recovered. cii srs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, The Lexington postoffice was"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "fully recovered. cii srs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, The Lexington postoffice was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [579.06, 543.03, 895.22, 619.74], "bbox_id": "5a384fc7cc", "file": "AppomattoxNewspapers_1898-1902a_0539.pdf", "page": 1, "text": "Mr. Walker Wooldridge and wife ,liSCnr8e ftt niht Ml Baock, of Lowry, are the guests of Mr. and  n V  r 7 7 7  u l VHln   t Mrs. r . R. R. Wooldridde Methodist church, Richmond, re- n  tamed to his home on Monday even- OJerk George T. Peers came down j ig. The meeting at Memorial will to court last week, but yesterday re- continue through this week Rev turned to the Blue-Ridge Springs. N. II. Robertson, Prospect circuit."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "on Monday even- OJerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> came down j ig."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "on Monday even- OJerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> came down j ig."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [589.45, 352.38, 748.4, 374.88], "bbox_id": "aca22e0dee", "file": "AppomattoxNewspapers_1898-1902a_0319.pdf", "page": 1, "text": "Mr. George T. Peers will lead the prayer-meeting to-night at Liberi v."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will lead the prayer-meeting to-night at Liberi v."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will lead the prayer-meeting to-night at Liberi v."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.89, 360.2, 1848.84, 369.7], "bbox_id": "525dc9f73a", "file": "AppomattoxNewspapers_1898-1902a_0318.pdf", "page": 1, "text": "Mr. George T. Peers wil"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> wil"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> wil"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.81, 464.67, 1521.09, 483.32], "bbox_id": "b9a8de0042", "file": "AppomattoxNewspapers_1922-1923a_0538.pdf", "page": 1, "text": "Mr. George T. Peers left yester day for the Richmond Fair."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> left yester day for the Richmond Fair."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> left yester day for the Richmond Fair."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1476.71, 311.66, 1638.47, 334.16], "bbox_id": "c42b7eeb17", "file": "AppomattoxNewspapers_1922-1923a_0343.pdf", "page": 1, "text": "Mr. George T. Peers is visiting in South Carolina."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is visiting in South Carolina."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is visiting in South Carolina."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [631.7, 289.02, 786.13, 311.02], "bbox_id": "c3f2254649", "file": "AppomattoxNewspapers_1898-1902a_0169.pdf", "page": 1, "text": "Mr. George T. Peers has the Paul Tanner lot. bough i"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has the Paul Tanner lot. bough i"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has the Paul Tanner lot. bough i"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.86, 456.52, 1671.79, 478.77], "bbox_id": "ed1c2b2a87", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "Mr. George T. Peers has gone to the Blue Ridge Springs this week."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has gone to the Blue Ridge Springs this week."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has gone to the Blue Ridge Springs this week."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1381.45, 1352.29, 1691.29, 1607.42], "bbox_id": "1170f2f6a1", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "most  Hearne, Texas Judge Royster was I Mrs. J. L. Foster and Mrs. Mary I Morris, of this county. Mr. James Martiu bad his flue  horse killed by a freight train near Evergreen Tuesday evening. Ike .annul was estimated to be woi  50 by section master Walton, who had to hire extra help to get it I out of the cut. Mr. George T. Peers will attend  the marriage of his son Mr. C. b. Peers in Richmond on the d inst, to Miss Alice Budd city. a"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "of the cut. Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will attend  the marriage"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "of the cut. Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> will attend  the marriage"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1546.11, 585.98, 1714.88, 1002.57], "bbox_id": "4b53475441", "file": "AppomattoxNewspapers_1952-1954a_0315.pdf", "page": 1, "text": "More people visited the historic McLean House at the National Park here Sunday than on any one day since the house where Lee and Grant made peace was dedicated three years ago. The mechanical counter at the McLean House last Sunday registered 545 visitors. And 370 visitors were counted at the Park Service Museum. Feature attraction for those visit ing the Museum during the past week has been a splendid scale model of the entire Old Court House village as it appeared in 1865. This master piece in mineature has just been re stored and mounted on a special table in the middle room of the Museum. It was acquired by the National Park Service in 1947 and been thourghly checked for accuracy and has been refurbished in every detail. It was the original work of Joseph Burns, who died in Washington January 10, 1895. He was either at the Surrender in 1865 or visited Appomattox very shortly thereafter. He made succeeding visits for sketches on the village and carried on an extended correspondence with the late George T. Peers, clerk of the court here in 1865. It is believed that Burns replica is the most auth entic record of the detailed appear ance of Old Appomattox Court House in existance. Made up of 52 buildings, the scale mode was constructed of pins, matches, oiled paper, cigar box boards and various typos of cloth. It was refurbished by . A. Van Lan- deghem, of Wards Road, Lynchburg."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "correspondence with the late <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, clerk of the court"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "correspondence with the late <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, clerk of the court"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.49, 1025.96, 1807.64, 1141.05], "bbox_id": "2ad9232d3b", "file": "AppomattoxNewspapers_1898-1902a_0138.pdf", "page": 1, "text": "Monday. p f e qbe weather ii interfering with P be burning of plaut-beds. iTbe cattle quarantine goes into  f e c t on the 15th instant. Col. Wingfield Inters has been in he county this week on business.  Clerk George T. Peers is confined jo his room at Hotel Appomattox."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "week on business.  Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is confined jo his"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "week on business.  Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is confined jo his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "served until I860, when <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> became clerk. At this"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "served until I860, when <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> became clerk. At this"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1437.11, 510.2, 1594.08, 531.74], "bbox_id": "c82440d77f", "file": "AppomattoxNewspapers_1922-1923a_0576.pdf", "page": 1, "text": "Mfr George T. Peers has been confined to his bed the past week."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Mfr <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has been confined to his bed the past week."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Mfr <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has been confined to his bed the past week."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [859.68, 1806.52, 1020.64, 1986.99], "bbox_id": "27cf7a0652", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "majority of the voters of the county approv ed such action, did deelare the boundary lines of each lot or traot ef land in Appemattox county to be a lawful fence aa to all animals mentioned in Section 2041 of the Code, after six months from the date of the publication of this order and the said meeting on the 11th day of August being informal, the Board doth, at its meeting held on this, the 8th day of September, 1899, all the members of the BoajoJ bejng present, ratify and confirm its action o f iff August, 1S99, and doth now declare the boundaifFhl ISspjpjot and tract of land in county of Appomattox a lawful fence for said parcels or tract of laud as to all animals mentioned in Section 8042 of the Code, after six months from the date of the publication of this order, and doth dlreet that this order be published twice in the Ap pomattox and Buckingham T im m A copy. Teste GEORGE T. PEERS. 9- 14-tit 1 p f Board of Supervisor."}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "m A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>. 9- 14-tit 1 p"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "m A copy. Teste <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>. 9- 14-tit 1 p"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1480.31, 237.27, 1640.9, 367.52], "bbox_id": "d6cb7e13ed", "file": "AppomattoxNewspapers_1902-1905a_0087.pdf", "page": 1, "text": "ilerk George T. Peers his cou- uactel with Mr. W. M. Hancock for ùfe érection of a handsome residence n bis lot adjoining Home Place here. It is understood that biB d a u g h te r, Mrs. E. W Taylor, will occupy the house when completed, Mr. aud Mrs. Taylor will spent the su m m er at ,the seashore, and will take u p their residence here permanently in the fall"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "ilerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> his cou- uactel with"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "ilerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> his cou- uactel with"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [918.65, 1191.41, 1075.69, 1212.36], "bbox_id": "a5c36be0ac", "file": "AppomattoxNewspapers_1902-1905a_0157.pdf", "page": 1, "text": "i Q this suit.A copy. Teste  GEORGE T. PEERS, Clerk. 8-5-4t"}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "i Q this suit.A copy. Teste  <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. 8-5-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "i Q this suit.A copy. Teste  <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. 8-5-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [457.17, 1028.66, 614.58, 1074.16], "bbox_id": "104a927b3b", "file": "AppomattoxNewspapers_1898-1902a_0135.pdf", "page": 1, "text": "George T. Peers our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1572.97, 984.76, 1726.67, 1027.41], "bbox_id": "e2ed935a21", "file": "AppomattoxNewspapers_1898-1902a_0134.pdf", "page": 1, "text": "George T. Peers our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> our present effi cient clerk has a card in this issue announcing himself a candidate for re-election before the primary."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1359.33, 490.47, 1490.36, 553.97], "bbox_id": "968ad43859", "file": "AppomattoxNewspapers_1922-1923a_0296.pdf", "page": 1, "text": "George T. Peers is summering Ss daughter, Mrs. E W. Tay- the beach. fe is much sickness in the f ourtow ismun Mr. W M."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is summering Ss daughter, Mrs. E W. Tay- the beach. fe is much sickness in the f ourtow ismun Mr. W M."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is summering Ss daughter, Mrs. E W. Tay- the beach. fe is much sickness in the f ourtow ismun Mr. W M."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1358.36, 457.6, 1484.99, 480.6], "bbox_id": "ded7f1dc32", "file": "AppomattoxNewspapers_1922-1923a_0304.pdf", "page": 1, "text": "George T. Peers is spending ion at Blue Ridge Springs."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is spending ion at Blue Ridge Springs."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "<mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is spending ion at Blue Ridge Springs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.07, 588.56, 2499.2, 1436.07], "bbox_id": "b2e07345fe", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "fty Calvin Robinson Clerk of the Circuit Court of Appomattox County, has submit ted his resignation, effective as of July 15. Smiths resignation was motivated by reasons of health and came with four years remaining in his current term of office. The resignation was submitted to Circuit Court Judge George F. Abbitt. Mr. Smith was bom In Fred erick County, Maryland, son of the late Mr. and Mrs. M. C. Smith. The family moved to Ap pomattox in 1907. He began his distinguished service in the Clerks office Feb. 8, 1908, as a Deputy Clerk under toe late John Rolfe Horsley. He became Clerk in 1919 and was elected to that Office in the fall of that year, and was re-elected, without op position in the county elections Of 1927, 1935, 1943, 1951 and 1959. This is thought to be a record for the State and indicative of the high respect and esteem In which he is held and reflects tribute to the efficiency and high quality of public service render ed. Since its establishment in 18- 45, Appomattox County has had six County Clerks John T. Bo- cock, Henry F. Bocock, Geo. T. Peers, George W. Abbitt, John Rolfe Horsley and Mr. Smith. In addition to his career aa Clerk, Mr. Smith has been most active in community, county and Church affairs. He was one at the drigttler of toe Appomat tox Light it Power Company In 1922. He wrote tf -Charter for the Town of .Appomattox when it was incorporated in 1925. He has served as Vice-President and Chairman of the Board of The Bank of Appomattox. He has served as Chairman of the Official Board of Memorial Methodist Church for 14 years served as Church Treasuer for 30 years. Superintendent of the Church School for 42 years and as a merriber of Monroe Lodge 301 AF  AM, Woodmen of the World and Appomattox L i o n s Club. In October of 1915, he was married to Miss Lucye Cabell Foster, who is an outstanding leader in local civic and church affairs. On toe occasion of the Cenn tennial of the forming of Appo mattox County in 1945, Mr. Smith wrote a splendid history of toe! county, which was widely dis tributed in booklet form. Despite the press of his many duties, he has found time for his favorite hobby, that of gardening, and his flower garden has been a show- place of the community. In World War II he served on the Appomattox Selective Service Board and through the years, Whenever the Community and! county needed the services of this modest and capable leader. The American Cancer Socle tys Appomattox unit will meet he has assumed assignments of Thursday at 730 p.m. at the responsibility. Farmers National Bank. All Mrs. Aldah B. Gordon, Deputy devoted almost an entire issue j board members and volunteers and Mrs. Joel W. Flood, assis- to Appomattox using the subject are urged to attend. I Continued on Page 3 title, Eighty-eight Years Later -- -----------------------------------  ------------------------"}, "highlight": {"text": {"matched_tokens": ["T", "Peers", "George"], "snippet": "Henry F. Bocock, Geo. <mark>T</mark>. <mark>Peers</mark>, <mark>George</mark> W. Abbitt, John Rolfe"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers", "George"], "snippet": "Henry F. Bocock, Geo. <mark>T</mark>. <mark>Peers</mark>, <mark>George</mark> W. Abbitt, John Rolfe"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.78, 564.39, 1628.28, 768.67], "bbox_id": "5c2be87bbc", "file": "AppomattoxNewspapers_1892-1898a_0105.pdf", "page": 1, "text": "Death of Mrs. D. 8 . White. Mrs. D. S. White died Tuesday at her residence, No. 701 Withers street, Lynchburg Va. She was the wife of Mr. J. W. White, and was 61 yearB of age. She was a member of a well- known Appomattox family, and was a most estimable lady. She is sur vived by her husband and several children. The deceased was a sister of Mr. George T. Peers, clerk of the court of Appomattox county, who left for Lynchburg immediately upon receipt of the sad news, to be present at the interment. Mr.Peers has the sympathy of the entire community in his bereavement."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "a sister of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, clerk of the court"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "a sister of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, clerk of the court"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.14, 840.78, 1800.83, 1693.59], "bbox_id": "7706bad3b7", "file": "AppomattoxNewspapers_1892-1898a_0345.pdf", "page": 1, "text": "D eath of an E stim able L ady. Just as our paper went to press last Thursday we received the sad news of the death of one of our best and most honored ladies, Mrs. Geo. T. Peers, whose husband is clerk of our County and Circuit courts. She died last Thursday morning in Lynch burg, at the residence of her brother, Mr. Obas. H. Sackett. Mrs. Peers had been in ill health for some time. This summer she spent a portion of the heated srason at Bine Ridge Springs, hoping tq  receive some benefit. She went to Lynch- bnrg some six or seven weeks ago, where she was placed under the case of a physician, but her con dition grew worse, until for more than a week before her death, her relatives and friends had given up all hopes of her recovery. She was fifty-nine yews of age and had lived in this copnty since a few years after her marriage, where her friends may be numbered by the hundreds. Her remains were interredin Lynch burg according to a desire which she had expressed long before her death, As an evidence of the love and esteem in which she was held by the people here, hosts of her friends attended the funeral services in Lynchburg Fridaywe know of no death which could have caused so much sorrow and gloom in our county. Mrs. Peers was so well and favorably known and her friends were so fond and close to her, iu love and affection, that her death has been felt in almost every home in our county. The Lynchburg News has the following to say of her death Mrs. George T- Peers, wife of Mr, George T. Peers, clerk of Circuit and County courts of Appomattox died yesterday morning at 630 oclock at the residence of her brother, Mr. Charles H. Sackett, in this city. She had come to Lynch burg about a month ago, from Blue Ridge Spriugs, where stye had spent a week or two for the benefit of her health. Shortly after her arrival in Lynchburg she became very enti cally ill, and tor several days prior to her death 110 hope of her recovery had been entertained. At the time of her death she was in the fifty-unth year qf her age, and most of her long and useful life was spent iu the county of Appo mattox, where she was universally known and loved. Few persons were better known in Appomato than Mrs. Peers, and none was more highly esteemed or respected. She had been for forty-three years a con sistent member of the Presbyterian church, and her humble Christian life had won for her a place in the hearts of a host of friends, who will not soon recover from the loss occa sioned by her death- Mrs Peers was a daughter of the late Mr. B,"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers", "George"], "snippet": "of her death Mrs. <mark>George</mark> <mark>T</mark>- <mark>Peers</mark>, wife of Mr, <mark>George</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers", "George"], "snippet": "of her death Mrs. <mark>George</mark> <mark>T</mark>- <mark>Peers</mark>, wife of Mr, <mark>George</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [522.24, 1068.62, 695.02, 1781.81], "bbox_id": "6a3ba06893", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "County C ourt Proceedings. At a court held for Appomattox county, June 1 0 th, Judge D. A. Christian presiding the following business was disposed o f The following deeds admitted to record since last term  Norman Megginson to H. D. Flood, T r 67. M. J. Franklin, c., to A. W. Baldwin  227 acres. W. C. Franklin, Comr to J. R. Atwood, 1 acre. C. S. Coleman to A. B. Thornhill, Tr., interest in real estate of Joseph B. Coleman, deceased. Mary W. Taylor to Elisha Lucado 501 acres. J. W. C. Martin to Saml R. Mar tin  one-half interest in 1641 acres. A. H. Burroughs to J. B. Marshall 220 acres. Nathan Hunter persoual prop erty  homestead deed. Charles H. Burgess to George A. Arms ,14 tracts and lots. Juo. H. Flood to D. A. Christian, 1 acie. Wm. A. Pattesou to Alex. Morris  2 acres. M. A. Wood, c., to Farmville Building  Trust Co.,Tr., 250 acres. Annie L. Hurt to Sarah A. and ilannah F. Jones 170 acres. Sarah A. and Hannah F. Jones to Farmville Building and Trust Co., Tr., 170 acres. H. D. Flood to Calie A. Sears 199 acres. Calie A. Sears to E. P. Sears 199 acres. Cammilla B. Wheeler to John Wahl 75 acres. George T. Peers, Tr., and Wm. H. Gills and wife to Annie L. Hurt 170 acres. C. W. Inge to J. P. L. Fleshnian, Tr., 60 acres. , Inventory and appraisement of personal property of G. U. Graff, deceased recorded. W. N. Patteson appointed surveyor of road from Stonewall Creek to Campbell conuty line, in place of W. H. Driukard, resigned. The grand jury reported the fol lowing indictments for felony Moses Watkius and Cleveland Watkins  true bill. Ned Baber true hill."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "John Wahl 75 acres. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Tr., and Wm. H."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "John Wahl 75 acres. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Tr., and Wm. H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2186.6, 289.49, 2326.61, 587.98], "bbox_id": "0269be8b0d", "file": "AppomattoxNewspapers_1962-1965a_0165.pdf", "page": 1, "text": "Colorful old wooden fences will return to the Old Appomattox Court House Area this coming Summer, Park Superintendent Tom Norris announced today. J. E. Jamerson  Sons, of Ap pomattox has been awarded a contract for this work amounting to 29,997.28. The project is sched uled to begin late in May and will be completed about the end of August. The Superintendent said that, before the enactment of fence laws in Virginia, our fathers used wooden fences In many forms to protect their homes and crops from wondering livestock, armies f o u n d these fences a ready source of dry wood for their campfires. George T. Peers AN Appomattox County resident of Civil War days, later com plained, There was not a single fence rail left except a few boards around the Court Green, so I was not put to any trouble of opening any gate. Every piece of loose wood that could be found had been used to make fires over in the Camps."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "wood for their campfires. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> AN Appomattox County resident"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "wood for their campfires. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> AN Appomattox County resident"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1296.5, 449.57, 1426.65, 471.57], "bbox_id": "ac8a2e4015", "file": "AppomattoxNewspapers_1902-1905a_0495.pdf", "page": 1, "text": "clerk George T. Peers returned m a trip to Richmond Monday."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> returned m a trip to Richmond Monday."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> returned m a trip to Richmond Monday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.65, 670.24, 1514.07, 731.63], "bbox_id": "ea1a8610ea", "file": "AppomattoxNewspapers_1892-1898a_0436.pdf", "page": 1, "text": "Clerk George T. Peers is taking a needed rest at Blue Ridge Springs. Hip many friends here hope his system may be built up by his vaca tion."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is taking a needed rest at Blue Ridge Springs. Hip many friends here hope his system may be built up by his vaca tion."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is taking a needed rest at Blue Ridge Springs. Hip many friends here hope his system may be built up by his vaca tion."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1521.09, 293.84, 1684.14, 313.68], "bbox_id": "ed4f49577d", "file": "AppomattoxNewspapers_1902-1905a_0150.pdf", "page": 1, "text": "Clerk George T. Peers is at Blue-  Ridge Springs."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is at Blue-  Ridge Springs."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> is at Blue-  Ridge Springs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [623.71, 487.56, 778.09, 520.26], "bbox_id": "533c939303", "file": "AppomattoxNewspapers_1898-1902a_0685.pdf", "page": 1, "text": "Clerk George T. Peers has return ed from a weeks visit to the Old North State."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has return ed from a weeks visit to the Old North State."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> has return ed from a weeks visit to the Old North State."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [615.09, 1118.91, 772.43, 1165.16], "bbox_id": "eb44f56e1b", "file": "AppomattoxNewspapers_1898-1902a_0335.pdf", "page": 1, "text": "Clerk George T. Peers came home yesterday to attend court. He will return to Blue-Ridge Springs to fin ish his months stay."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> came home yesterday to attend court. He will return to Blue-Ridge Springs to fin ish his months stay."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "Clerk <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> came home yesterday to attend court. He will return to Blue-Ridge Springs to fin ish his months stay."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1983.1, 870.77, 2119.4, 894.92], "bbox_id": "cd1b5d7b4a", "file": "AppomattoxNewspapers_1933-1936a_0428.pdf", "page": 1, "text": "BY GEORGE T. PEERS The following"}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "BY <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark> The following"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "BY <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark> The following"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [590.9, 931.22, 749.09, 1531.36], "bbox_id": "0a5dca2dba", "file": "AppomattoxNewspapers_1898-1902a_0482.pdf", "page": 1, "text": "Are there no marriages to report for dear old Buckingham ? A cor respondent at every post office is needed. Who will take mt.-rest enough in home affairs to inform us of the happeniugs of his ueighbor- hood ? Mr. S. F. Womack, lately of Paui- piins, has returned to Lynchburg to live, having accepted a position here. Mr. Womack was in business here some years ago, and has many friends aud acquaintances in this city and section.Sundays News. There was an interesting reunion of the Peers clan  for the first time iu ten years they were together. The pleasant occasion was at the residence of Mr. E. W. Taylor. Mr. Charles S. Peers, of Richmond, the only son of Mr. George T. Peers, and his wife, and his two lovitig daughters, Mrs. J. W. McKinuey, of Lynchburg, aud Mrs. E. W. Taylor, of this place, aud four grand chil dren constituted the gathering and included the entire family connect ion except four of Mrs. McKinneys children. The head of tile clan, Mr. George T. Peers, wore a proud aud happy couutenance, and seemed as very a patriarch as Abraham of old Dr. George B. Taylor and his sister Miss Susie were present and added to the pleasure of the occa sion. At a meeting of the Democratic Executive Committee held Saturday evening lust it was decided to elect the eleven delegates from this coun- tv to the gubernatorial convention, which meets iti Norfolk on the 14th of next August, on the 9th day of May, that being county court day. All Democrats are expected to be 011 hand and take part in the select ion of these delegates. 1 be commit tee meeting was well attended and its deliberations were unanimous in selecting next court day."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "only son of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, and his wife, and"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "only son of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, and his wife, and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [354.69, 624.27, 555.69, 1096.31], "bbox_id": "92276059f4", "file": "AppomattoxNewspapers_1971-1973a_0271.pdf", "page": 1, "text": "Appomattox, April 8 Martha Mildred Stevens Craig, better known as  Aunt Millie and very spry for her 89 years, delights in telling her story of the surrender which took place here April 9, 1865, just 77 years ago Thursday. Aunt Millie, quaint, timid, and full of in terest in her white and negro friends, was active for her age until last spring when she was struck by a bolt of lightening while in bed. She now walks with the aid of a cane, keeps house for her only son, Uncle Bob Craig, who has served as janitor at Appomattox High School for several gen erations. Aunt Millie was 13 at the time of the surrender and was the nurse maid of Charlie Sackett Peers, six month old son of Mr. and Mrs. George T. Peers. Mr. Peers was at that time clerk of the Court of Appomattox andtwas living near the scene of the sur render.  I was walking de floor, patting my baby to sleep, when those yankee soldiers came bustin in Marse Georges house. The soldiers hollered for everybody to leave de house cause the worst battle ever fought was start ing right den. Marse George fetched Miss Jennie by de hand and rushed her off to the hay loft in the stable.  My Missus was powerful excitable and nervous and Marse George knew he had to get her away from all de soldiers. Marse George must have thought I was going to follow wid de little faby.itf in stead I darted in another rootoiaml urept behind Miss Jennies Linen chest. I kept patting my little white baby all the time.  The first chance I had, I peeped out de window and saw ever so many soldiers pushing a large cannon right in front of the steps to the house. The generals weregivin orders and de soldiers were linin up and I never saw as many guns before in all my life. 1 commenced to think hard."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers", "Peers"], "snippet": "of Mr. and Mrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>. Mr. <mark>Peers</mark> was at"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers", "Peers"], "snippet": "of Mr. and Mrs. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>. Mr. <mark>Peers</mark> was at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1481.69, 1752.89, 1580.56, 1798.18], "bbox_id": "dcbeb11932", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "and Elma Sherrer, , and Miss Carrie Lee chburg, are visiting George T. Peers at Ap-"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "and Elma Sherrer, , and Miss Carrie Lee chburg, are visiting <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> at Ap-"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "and Elma Sherrer, , and Miss Carrie Lee chburg, are visiting <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> at Ap-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2355.27, 535.16, 2527.65, 1507.59], "bbox_id": "b12b9cf1df", "file": "AppomattoxNewspapers_1949-1952a_0511.pdf", "page": 1, "text": "An old note book preserved by the late Mrs. J. R. Atwood, and re cently found by her daughter, Miss Lynolee Atwood, of Richmond, re veals valuable historical information on the establishment of the Memor ial Cemetery at Old Appomattox, and shows that it was the work of an organization here which was the local forerunner of the chapter of the United Daughters of the Con federacy. Mrs. Calvin Robinson, president of the U. D. C., today released con tents of this aged notebook, supplied her through the cooperation of H. A. Gurney, Custodian here for the National Park Service. It appears that on Friday, May 18, 1866, the ladies of Old Appo mattox Court House and vicinity met in the court room to form a Ladies Association similar to the Ladies Memorial Association in oth er parts of the South. The object was to provide suitable interment for the Confederate Soldiers and to preserve the final resting place as a memorial. Temporary officers were Presi dent, Mrs. E, W. Leyburn Secre tary, Mrs. L. K. Read Treasurer, Mrs. J. C. Peers. On May 25, 1866, a second meeting was held and the first officers were chosen, to serve for one year President, Mrs. E. W. Leyburn Vice-President, Mrs. Eliz. Johns Corresponding Secretary, Mrs. Ella W. Flood Recording Sec retary, Mrs. Lizzie K. Read Treas urer, Mrs. Jonnie C. Peers. At this meeting Mr. Joel W. Flood offered to give land for the purpose of a cemetery. Among the first members were Mesdames E. W. Leyburn, Elizabeth Johns, Jennie C. Peers, Lizzie K. Read, Bettie Tweedy, Sally F. Ab- bitt, Mary Christian, Mollie Mc- Dearmon, Msdlie M. Graff, and the Misses Eliza Lirburn, Belle Met. Leyburn, Bettie D. Johns Mary W. Johns, Carrie A. Hix, Martha A. Hix, Mollie E. Sears, Sue Sears. Mr. John Sears offered to donate land, upon a beautiful knoll one-half mile west of the Old Court House for the Cemetery, and Mr. George T. Peers prepared the deed. Major Flood donated timber for a fence. Capt. Wm. H. Trent and Maj. Flood arranged to haul the timber. Mr. Francis Meeks cleared the ground for the Memorial Cemetery. An early feature of the Ladies Organization was a series of memor ial addresses. Col, Farrar made the entertained by Maj. Wilmer Mc Lean. A Tableau was presented as a means of raising funds. A similar ladies group in Charlotte offered to help. The digging of the graves for the Veterans was done by Messers. Geo. T. Peers, C. H. Sackett, P. N. Meade, J. W. Webb, R. R. Kyle, Geo. A. Abbitt, E. G. Hix, and Maj. McLean. The abov, with the aid of John W. McKinney, John Sears, William Paris, R. M. Sweeney, Thomas S. LeGrande and Thomas A. Smith, re-interred the bodies of the Veter ans November 30, 1866. Mr. R. B. Poore made the memor ial address in 1868. Capt. Miles C. Mason, Fayette Artillery, Va., was buried in grave No. 1. Sgt. O. F. DeMemse, Donald- sonville Artillery, La., grave No. 2. The names of those interred in the first and was gbest of Wilmer Me in the next ten unknown. Later the Ladies Associateion be came the U. D. C. Mrs. J. R. At wood was an early president. The U. D.C. was entrusted with the care of the Memorial Cemetery,which has now become a feature of the re stored historical area at Appomat tox."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "the Cemetery, and Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> prepared the deed. Major"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "the Cemetery, and Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> prepared the deed. Major"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1417.64, 744.07, 1541.79, 789.82], "bbox_id": "604dc9412c", "file": "AppomattoxNewspapers_1892-1898a_0067.pdf", "page": 1, "text": "aggie McKinney, grand- of Mr. George T. Peers, Jerk, returned to her home bnrg yesterday."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "aggie McKinney, grand- of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Jerk, returned to her home bnrg yesterday."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "aggie McKinney, grand- of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, Jerk, returned to her home bnrg yesterday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [862.3, 1163.74, 1024.99, 1334.03], "bbox_id": "3f207d7ef1", "file": "AppomattoxNewspapers_1898-1902a_0205.pdf", "page": 1, "text": "____ IN THE CLERKS Office of Appom attox Circuit Court, in vacation, June 28th, 1899 . . . . ... II. F. Burke, adm inistrator with the will an nexed of Geo. usher Graff, dec d, Plaintiff, against  in c h a n c er y . Fannie Mon telle Hopkins, Eleanor Graff, aud the unknown heirs of Mary H. Graff, under the style of unknown parties, Defendants. The object of this suit is to have a construc tion of the will of George Usher Graff, dec d, by tlie court, and to secure distribution of the estate to the parties entitled to it. And it appearing by affidavit filed, th at the defendants, Fannie Montelle Hopkins and Eleanor Graff, are not residents of this btate, and th at the heirs of Mary H. Graff, deceased, are unknown it is ordered th at they do ap pear here w ithin fifteen days after due pub lication of this order once a week for four successive weeks in the Appomattox anu Buckingham T im es , a r.ewspaper published in the State of Virgihia, and do whatever may be necessary to protect their interest in this suit.A copy. __ _ . Teste  GEORGE T. PEERS, Clerk. H. D. F lood , p. q. 7-6-4t."}, "highlight": {"text": {"matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "this suit.A copy. __ _ . Teste  <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. H. D. F"}}, "highlights": [{"field": "text", "matched_tokens": ["GEORGE", "T", "PEERS"], "snippet": "this suit.A copy. __ _ . Teste  <mark>GEORGE</mark> <mark>T</mark>. <mark>PEERS</mark>, Clerk. H. D. F"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2296.53, 597.41, 2506.18, 1103.25], "bbox_id": "c191cfeeec", "file": "AppomattoxNewspapers_1952-1954a_0468.pdf", "page": 1, "text": "visited Work has started on the restora- n House tion of the Peers House at Old Ap- ealed at pomattox Court House, and several lal Park other National Park Service projects increase are well advanced either in actual over the process or in the advanced planning stage. bits and The Peers House was constructed ation of in 1856 and was the home of George an en- T. Peers, clerk of the county court national during the Civil War. The dwelling ox have has definite association with the his- iponsible tone peace made here in 1865. The d more exterior ef the dwelling will be re stored to its actual appearance as of ight be April 9, 1865. The interior of the saw im- dwelling will be converted into an the Ap- employees residence. Local work- omodate men, under Enos  Mclnturffff, are  courts being used on the project. It is esti- here has mated that the restoration will re-  in fa- quire five months for completion. Feeding H. A. Gurney, park superinten- jme im- dent, today estimated that work on restoration of the Tavern at the Old cal citi- Court House is 25 completed. Lo- ning to cal workmen are employed on this inducing project. Work has now reached the ho come stage of being ready for installation in over- a heating system. When finished, gateway pert of the Tavern will be used to nd near house the Park Museum, now in the office df the superintendent. Work is also in process on restor ation of the slave quarters at the rear of the Tavern. Modern rest rooms will be located in these quar ters. Plaqp for the proposed by-pass road which will relocate the high way around the Old Court House village, are in an advanced stage, and work on this may start soon. Mr. Gurney also announced that 6,000 has been made available to build a utility building jut east of the Peers House. This will be of masonry block, and will he used for storage and housing t uipment. and as a work shop. Plans fdr the building have been prepared."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "was the home of <mark>George</mark> an en- <mark>T</mark>. <mark>Peers</mark>, clerk of the county"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "was the home of <mark>George</mark> an en- <mark>T</mark>. <mark>Peers</mark>, clerk of the county"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.91, 471.99, 1943.76, 627.43], "bbox_id": "eb4b8a97ac", "file": "AppomattoxNewspapers_1939-1943a_0263.pdf", "page": 1, "text": "by Dr. J. W D Browning has secured a pos ition in Richmond. Annie Edgar Meadows and Miss Wood married at Pamplin City. C. W. Hancock building a brick ef0Ttin bank building in Bedford. Mr. Smith Rev. J. C. Davidson solving the Hebron field of churches. Charlie Peers, son of  county ! Right J. cerk, George Peers, employed at and director t Myers Department Store mattox. fThis    destroyed Davidson a of the bank"}, "highlight": {"text": {"matched_tokens": ["George", "Peers", "t"], "snippet": "county ! Right J. cerk, <mark>George</mark> <mark>Peers</mark>, employed at and director <mark>t</mark> Myers Department Store mattox."}}, "highlights": [{"field": "text", "matched_tokens": ["George", "Peers", "t"], "snippet": "county ! Right J. cerk, <mark>George</mark> <mark>Peers</mark>, employed at and director <mark>t</mark> Myers Department Store mattox."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [918.7, 981.62, 1088.94, 1910.09], "bbox_id": "d404a84f08", "file": "AppomattoxNewspapers_1898-1902a_0153.pdf", "page": 1, "text": "The News of Stonew all. Just about thawed out, and. have gaiued the courage to venture .mi- of-doors again, and to look around ! j to eee whether that much-talk d-i about ground-bug has had the nerve  to put his Dead out of the ground 1 again. Fioni current reports. Air. , Howard Harding has oeen watching a certain groumi-hogs hole, with a  gun iu his hand, ever since the wea- ther has warmed up, vowing to ml! ! the little beast this time, if he even i shows the white of his eye. We j wish hint much success only wi.-ls I he had reached this determination 1 sooner. The farmers here begin to get to  work agaiu, burning plant-beds, and  carrying off the weed. Air. Alonzo i Moore, Howard llarding, Homer j Babcock, Ghauncey Babcock, Wi- ktr Alarrin, aud Joseph Ferguson  carried off loads this week. Prices j were low, but us good as could Oe i ixpected, considering the condition of the market. The roads are iu a beautiful con- ditioucot quite of the consistency to make mud pies, and in that siaie where they say that the smooth and beautiful roads lead to He flowery beds of case. We cau say from the depths of our hearts, as Brutus said to Catuline How long, oh. Appo mattox, must we suffer this most deplorable condition of roads ? The creek s a.id James river ate both on a spreefull and running overpreventing crossing. Mr. Kirby Smith, wife, and chil dren have beeu sick but were glad to hear that they are all rapidly im proving. Mrs. John Grow has been quite sick this week, but at this writing we Lear that she is somewhat better. We have ha! no preaching here for some time, on account of the stormy weather. We are afraid that we will all becoipe heathens, from causes due to nature. Miss Mattie Moss has opened her school at Piny Ridge again. Mr. Robert Moore had a horse badly hurt last week. The animal became frightened and ran away, cutting his side quite badly, but not fatally. Dr. Rucker was called in to render the necessary surgical at tention. We are glad to heai weve a-veteriuary surgeon among ua. Since the weather has opened up, we are looking for the onslaught oi the candidates for office. From the number in the field, we expect to be overrun- by them. Come one at a time, and give us a chance to get oyer one attack before we have an other. Mr. Thomas aylor says he has six dogs which are very fond of calves, and we should not wonder if they give him a widu berth. Well, come along and do your hand-shak- iug, candidates we bid you all God speed. Air, Ben Chinault had a tooth ex tracted one day this week-a saving in the food line. We are iu receipt of Mr. George T. Peerss circular letter. We forgot to say, wlfen speaking of the cold weather, that every one in this neighborhood was caught without fire-wooda cold snap, but uot a soft oue, when we consider the advantages of getting wood in eighteen inches of snow. A great deal of Amherst bacon was roped in during the several days of deep suow, aud, as the author of Jessie says, we dined."}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "iu receipt of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>s circular letter. We forgot"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "iu receipt of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>s circular letter. We forgot"}], "text_match": 1736172785157275769, "text_match_info": {"best_field_score": "3315687620608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172785157275769", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [1385.29, 899.73, 1803.28, 1040.07], "bbox_id": "83501ff68d", "file": "AppomattoxNewspapers_1898-1902a_0707.pdf", "page": 1, "text": "bte in  r next i88Uel  The University Colley  -Mqdt- Nathan J . Walkerlcine, of Richmond, ViYhidr8_ pbei f d  i w Jofthe educational institutions, which, I v ii q 75c and iOO Sos at f , P rofertor G - W. Iw h ile m a in ta in W g th e b ig h e 8  8 tan d- A U 50 V F ,   band, have been v,8,ard 0f equipment apd scholastic re-1 B A friend, Mr. R. K. Ptlquirements, at tbe sme time shows 0iace la rapid growth in the .number.9Kit students. The proctor state offici- 86r8. George T. PeersAjiy that he believes this is .due to b John G. Fisher, Hlthe ex ensive use pf newspaper ad- innev and ethers froJvertising in making known, the ex- i.  r    j c e l le n c e d f tb b cQiMrse 1 ilM  ?f tP i attended the the tnebds of ! last week. - r  i -    -L"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "proctor state offici- 86r8. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>Ajiy that he believes this"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "proctor state offici- 86r8. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>Ajiy that he believes this"}], "text_match": 1736172785157275769, "text_match_info": {"best_field_score": "3315687620608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172785157275769", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [844.75, 860.47, 1001.8, 1048.47], "bbox_id": "84dd031390", "file": "AppomattoxNewspapers_1892-1898a_0262.pdf", "page": 1, "text": "V IRG IN IA to w it In the Clerks OiHce of the Circuit C ourt of A ppom attox County in vacation, October 22nd, 1895, Fannie B. Bigbie, M artha W alker John A. Bigbie, W. N. Bigbie, It, S. Bigbie. W. B. Bigbie, John D. Bigbie and .Sarah Bigbie A gainst Geo. C. Bigbie and the heirs of M artha Bigbie who interm arried w ith one Edwin Bright th e last named defendants befog unknown, and made parties to this suit as unknown parties. The object of this suit is to partitioni-he real estate of which W illiam Bigbie, George Bigbie. A rchy Bigbie, Nancy Bigbie and Sallie Bigbie, died, seized and possessed, situated in th e County of Appom attox, among the par ties entitled thereto. And it appearing by affidavit filed th a t the heirs of M artha Bigbie, who interm arried w ith Edwin Bright are unknown, it is order ed th a t they do appear here w ithin fifteen days a fte r due publication of this order and do w hatever m ay be necessary to protect th eir interest in th e prem ises and th at a copy of this order be p u b lish ed once a week for fo u r successive weeks in the A ppomattox and  B uckingham T im es , a new spaper pub- lishec in this State. A CopyTeste, 43-4t GEO. T. PEERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["T", "PEERS"], "snippet": "A CopyTeste, 43-4t GEO. <mark>T</mark>. <mark>PEERS</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "PEERS"], "snippet": "A CopyTeste, 43-4t GEO. <mark>T</mark>. <mark>PEERS</mark>, Clerk."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["T", "Peers", "T"], "snippet": "Horsley and Geo rge <mark>T</mark>. <mark>Peers</mark> as clerk. Henry <mark>T</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers", "T"], "snippet": "Horsley and Geo rge <mark>T</mark>. <mark>Peers</mark> as clerk. Henry <mark>T</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["T", "Peers", "T"], "snippet": "officers were named. Geo. <mark>T</mark>. <mark>Peers</mark> became Clerk Wm. <mark>T</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers", "T"], "snippet": "officers were named. Geo. <mark>T</mark>. <mark>Peers</mark> became Clerk Wm. <mark>T</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.14, 1194.65, 1619.71, 1776.66], "bbox_id": "821afcd007", "file": "AppomattoxNewspapers_1892-1898a_0364.pdf", "page": 1, "text": "Our correspondent from Spanish Oaks writes Mr. James Shearer, one of our. most respected citizens lias been critically ill for move than a week and is hardly expected to recover, lie was found in an un conscious conditiou and has never fully regained consciousness since akeu. His trouble is thought to be heart disease. Later.Since the above was writ ten we learn that Mr. Shearer died yesterday. ..We are also very sorry to report the death of Kendrick Stratton, one of the oldest aud most highly re spected colored men of this com munity. Everybody knew Kendrick and he knew everybody in several counties around. lie was respected and trusted by all, and many will be truly sorry to hear of his death. He died from the effects of a neglected cold. Dr. Bice was called to see him when it was too late to do him any service. Dr. George B. Taylor is stirring up the Baptists before he takes his leave of absence. lie organized Monday night at Kirklea a C. C. C. class with the following enrolled as members Wyatt Abbitt, Mrs. Wyatt Abbitt, Miss Annie Abbitt, B. L. Burke, Miss Lacy Caldwell. Miss Dawson, Miss Mattie Jones, Prof. J. B. Loving, Geo. T. Peers. Miss Macca Sims, Geo. B. Taylor. Others will probably join the class. On the same day a Junior Bible Readers Class was started, with the following members Mattie, Lucy and Ethel Fleshman, Mary and Lula Irby Vara, Alice, Bet.tie and Eula May Burke, Helen Gregory, Mary Lizzie Paris, Becky Pnrdum, Walter Elliott, Elliott Tanner, Harry Han cock, Nathan Hancock, John Ab bitt and Evant Hunter. _______"}, "highlight": {"text": {"matched_tokens": ["T", "Peers"], "snippet": "J. B. Loving, Geo. <mark>T</mark>. <mark>Peers</mark>. Miss Macca Sims, Geo."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers"], "snippet": "J. B. Loving, Geo. <mark>T</mark>. <mark>Peers</mark>. Miss Macca Sims, Geo."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [366.23, 279.74, 526.88, 578.34], "bbox_id": "ea2900aae5", "file": "AppomattoxNewspapers_1892-1898a_0358.pdf", "page": 1, "text": "Our Baptist Brethren. Judge Christian, Dr. A. A. Rice, Messrs. G. T. Peers, W. H. Ligon T. A. Caldwell, F. G. Thorp, Luke Bagby and Dr. Taylor were amotq those who attended the recent, ath ering of the Baptists in Richmond The meeting was largely attended and marked by great spiritual power aDd enthusiasm. Very many of the speeches were of a high order. Th work done during the past year was good. The reception given at Rich mond College to the delegates Mon day afternoon was much enjoyed Appomattox has three students at Richmond College this vear, Messrs. Ligon, Bloxton and Abbitt. The Baptists of this county are thor oughly alive in their work, under the able leadership of their esteemed pastor, Dr. George Braxton Taylor. Bee the interesting programme in mother column which has been p r anged for next week."}, "highlight": {"text": {"matched_tokens": ["T", "Peers", "T"], "snippet": "A. Rice, Messrs. G. <mark>T</mark>. <mark>Peers</mark>, W. H. Ligon <mark>T</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers", "T"], "snippet": "A. Rice, Messrs. G. <mark>T</mark>. <mark>Peers</mark>, W. H. Ligon <mark>T</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [686.93, 653.44, 848.06, 1152.84], "bbox_id": "81f8099684", "file": "AppomattoxNewspapers_1898-1902a_0295.pdf", "page": 1, "text": "MEMORIAL EXERCISES, FRIDAY JUNE 1 -4 OCLOCK P. fl. The procession will file out from the lot adjoining N. U. Gregorys. Line of march will be as follow! Up Grove avenue to Main, out Main to Court, then along the quiet high way to the cemetery. Leadiug the procession will be the Confederate veterans, followed by the aides of the chief marshal. Chief-marshalMaj. J. W. Flood. MarshalsMessrs. Ned LeGrand, R. F. Burke, Johu T. Lee, John W. White, Jas. P. L. Fleshman, G. L. Ferguson, Daniel Ferguson, N. H. Gregory, Geo. T. Peers, W. H. Ab bitt. AidesMessrs. J. G. Fisher, J. W. Trent, C. A. Trent, F. W. McKin ney, John Overton, R. C. Harvey, H. W. McKinney, Joe OBrien, Wat kins Nowlin, Hunter Abbitt, Robt. Caldwell, Walter Ellett, Frank Ab bitt, Hnbbard Coleman, Joel Cole man, Ran. Fleshman, R. C. Mann, George Purdum, R. L. Burke, J. W. Childsess, Jake Childress, and J. B. Abbitt, Daniel Browning. Next in line will be the Daugh ters of the Confederacy and ladies of the Memorial Association, follow ed by young ladies as flower-bearers then citizens and friends. The solemn exercises at the cem etery will be opened with prayer by Rev. Dr. Taylor, followed by singing Nearer, my God, to Thee, recita tion by Miss Mary L. Paris, intro ductory remarks by Hou. Henry D. Flood, address b y ---------- , singing, recitation by Miss Alice Burke. The flag bearers will be Misses Lucy Smith and Pearl Burke. The exercises will be closed with prayer by Rev. P. M. Bell. All Confederate veterans are cor dially invited to take part in these exeeises."}, "highlight": {"text": {"matched_tokens": ["T", "Peers"], "snippet": "N. H. Gregory, Geo. <mark>T</mark>. <mark>Peers</mark>, W. H. Ab bitt."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers"], "snippet": "N. H. Gregory, Geo. <mark>T</mark>. <mark>Peers</mark>, W. H. Ab bitt."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [763.94, 855.38, 925.84, 1334.58], "bbox_id": "2225f72235", "file": "AppomattoxNewspapers_1898-1902a_0543.pdf", "page": 1, "text": "Appomattox and Buckingham United In Marriage. A very pretty wedding took place at Concord Baptist Church, Bock ingham county. on Monday, August 12, when Miss Cornelia Davis am Mr. R. W. Smith were married. To the strains of the wedding march, beautifully rendered by Mrs. George Pollard, the bridal party en tered. Preceding the ushers came Rev. G. W. Foster and Rev. George Braxton Taylor, who together per formed the ceremony. Following the ministers cuhe the ushers Mr. W. G. Davis, Mr. Geo. T. Peers, Mr, W. J. Gills, Mr. Frank B. Gills. The bride, gowned in a beautiful travel ling suit, and carrying a bouquet of white roses, entered leaning on the arm of her brother, Mr. Robert Da- viA At the altar they were joined by the bridegroom, accompanied by his sister, Miss Emma Smith. The bridesmaids, and groomsmen were Miss Minhie LeGrand, Mr. Henry Giles, Miss A. H. Gills, Mr. Sdmund Gills, Miss Estelle Davis, Mr. Howard Cobbs, Miss Lucy Gil espie, Mr. Leon Giles, Miss Lizzie lix, Mr. Frank Gills, Miss Lucy Hix, Mr. John Overton. The bride is a very popular young lady of Buckingham, and is highly esteemed by a large circle of friends. The groom is a prosperous farmer of this county, and widely known for his uprightness and strict integrity. They are now at home near Spout Spring."}, "highlight": {"text": {"matched_tokens": ["T", "Peers"], "snippet": "G. Davis, Mr. Geo. <mark>T</mark>. <mark>Peers</mark>, Mr, W. J. Gills,"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers"], "snippet": "G. Davis, Mr. Geo. <mark>T</mark>. <mark>Peers</mark>, Mr, W. J. Gills,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2050.11, 1449.18, 2551.25, 1694.88], "bbox_id": "f5a42ce852", "file": "AppomattoxNewspapers_1908-1909a_0307.pdf", "page": 1, "text": "a 4 R fl w rr.T .f AM JB H N 1N U 8 1 M  . lV l an , widow of the Commoner, died of arthritis to Los Angelas at the age of sixty-eight years, j other deaths of the week Included  those of Stephen T. Mather, forma director of the national parks sys tem James Dahl man, mayor, a t Omaha George Le Moire, well know comedian D. A. Boody, one of the veteran brokers of Wall Street, an Viscount Esher, one pf the moat to- fluential of British peers. . tttO. W tttero Newspaper Union. k et U s W rite Your Insurance j poliev -.Ä I A. H. CLEM ENT,Agt."}, "highlight": {"text": {"matched_tokens": ["t", "George"], "snippet": "Dahl man, mayor, a <mark>t</mark> Omaha <mark>George</mark> Le Moire, well know"}}, "highlights": [{"field": "text", "matched_tokens": ["t", "George"], "snippet": "Dahl man, mayor, a <mark>t</mark> Omaha <mark>George</mark> Le Moire, well know"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.5, 1468.51, 2548.55, 1594.65], "bbox_id": "6fa2b2fd85", "file": "AppomattoxNewspapers_1926-1933a_0307.pdf", "page": 1, "text": "RS. WILLIAM JENNINGS BRY AN, widow of the Commoner, died of arthritis in Los Angeles at the age of sixty-eight years. Other deaths of the week included those of Stephen T. Mather, former director of the national parks sys tem James Dahlman, mayor ef  Omaha George Le Malre, weU known  comedian D. A. Boody. one of the veteran brokers of Wall Street, and Viscount Esher, one pf the most In fluential of British peers. IK. 190. W estern N ew spaper U nion."}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "included those of Stephen <mark>T</mark>. Mather, former director of"}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "included those of Stephen <mark>T</mark>. Mather, former director of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
