{"document": {"bbox": [1446.94, 995.99, 1931.47, 1085.39], "bbox_id": "bb792ca681", "file": "AppomattoxNewspapers_1922-1923a_0554.pdf", "page": 1, "text": "y e .,,.,.  I t       f 1   emlment w . , by the County Superintendent. Mr. N York daily aper aB the finest Miss Rebecca Wear returned! K Hannah, who acted as chair- prescription ever written to relieve home Monday from a two week s mafl j Backache, Kidney Trouble, Weak expo,i tion Md Kick.  Mr. ThomM, I8pec., and Ex-  r m i x t  S .aminer of the 3rd circuit, explain-1 promptly on the iliminative tissues Rev. H W. Dunkley, former pas-Jed in his clear and forceful way the 0f the Kidneys, enabling them to tor of this charge, will preaoh at advantages of having a Teachers filter aud strain the uric acid and"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Rebecca Wear returned! K <mark>Hannah</mark>, who acted as chair-"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Rebecca Wear returned! K <mark>Hannah</mark>, who acted as chair-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [190.31, 1042.8, 349.68, 1387.1], "bbox_id": "2e4f4a8fe5", "file": "AppomattoxNewspapers_1902-1905a_0570.pdf", "page": 1, "text": "Wright . ....... 1 58 43 7 1 1 104 Treut ............... KJ 30 2 28 ! 120 Huunah ......... 17 42 44 17 ! 1 120 Johnson ......... 40 47 1 17 ! 110 Paulette ........  17 44 0 70 LeGrand ....... 50 7iJ 27 150 1 .igon............... 02 8ÍI Hi 1 I 221 Jones .............. 127 1 12 i 140 Coleman......... 30 14 20 I 78 Lee, .................. 125 0 24 155 M o ses ............ 30 11 21 , 09 Howerton , 1 10 25 114 P uryeor ........ 37 44 101 182 Thorpe ........... lu 48 5 IIS Stratton ....... 30 02 80 180 Cunum 7 28! 21! 5C Thorufetll  41.Mi 971 207 K y le . ............... 8 21 H 35 Robert son __ 89 1 1 80 It will be observed by the returns that a change of six votes in Clover Hill district in favor of Captuio Johnson would have elected tha gentleman on the committee instead of Mr. Presley Hannah. Captain Johnson, at the very first news of the returns, expressed himself us beirg dissatisfied, and he may look into the Rocks precinct, where he is only given one vote by his old Confederate friends. Other rumdrs of irregularities have been made, but none of tlv defeated candidates bo far as knowi have any idea of contesting the re sult with the lucky nominees. The total vote is probably 100 short of the full Democratic vote."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "instead of Mr. Presley <mark>Hannah</mark>. Captain Johnson, at the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "instead of Mr. Presley <mark>Hannah</mark>. Captain Johnson, at the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1940.9, 333.29, 2096.4, 690.54], "bbox_id": "e42acb18f7", "file": "AppomattoxNewspapers_1915-1918a_0220.pdf", "page": 1, "text": "would like me to write. Mr. Joseph Hamlet spent several days among his friends and home folks last week. Mrs. Alice Bond is visiting at W indsor. Little Mary Newton s a i d ,  Oh, mother, it is raining all over Mrs. Paulettes beautiful roses, and w hat will we do? for nobody has any like hers. We are glad to bote that Miss Estelle Thornton has accepted a position in Maditonville High school. Mr. Will Chapibers is suffer ing with a bruised hand he let a log of wood fall on it. Miss Hannah Jennings has returned from Norfolk. The days of vacation are draw ing to a closeschool girls and boys will soon leave ns again. We see from your last paper that there are many autos in Appomattox. If the owners are as generous as Red House people who own cars, many a poor fellow will ffbt a lift from the dusty roadside."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "fall on it. Miss <mark>Hannah</mark> Jennings has returned from"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "fall on it. Miss <mark>Hannah</mark> Jennings has returned from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.75, 1072.38, 1810.55, 1323.48], "bbox_id": "706ea8e3c2", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "Wm. M. Cabell vs. Susan Johnsons Admi. j o fl slzes a r r  ..Home at Swmp-Root confirmation o i report of sale, and order to collect. W m. H. A bbltt vs. D. E. Wool ridges Admi final decree. C. 1. Rucker vs. Annie U. North, and Annie ii. North vs. R. A. North, c. coufiruiutiou of uummissiouers report, and order to puy cuminuiafiou fur dower. James M. Uolu vs. Sumuel H. Join rule uwarded. - im sintis ul Appomattox circuit, MuthodUt Lpiocupui Church South confirmation of sale, and final deoiee. A. Ii. Clement vs. kettle Carson and others deed sot aside, uud order to rent land. i. Coleman vs. it. G. Gillispie iu junc tion uissolved. J. i. h. Flesh man vs. J. P. H arvey report of sale codfirmed, and order to pay coats, u. J. IC. Hannah, Ac., vs. C. H. Chilton leave to file answer given to defendant. it. P. Puuiett vs. Willis A. Paulett and oth ers  older for partition. , K. J. Binford vs. L. H. and L. C. Gilliam older confirming commissioners report, aud to distribute funds. ,- usjc C. Nowlin vs. W. B. Nowlin, Jr., Ac. sale confirmed, and order for distribution. II. 1. Flood vs. A. H. Clement order for taking accounts."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "coats, u. J. IC. <mark>Hannah</mark>, Ac., vs. C. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "coats, u. J. IC. <mark>Hannah</mark>, Ac., vs. C. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.61, 1220.7, 1717.42, 1304.6], "bbox_id": "450dcfef85", "file": "AppomattoxNewspapers_1892-1898a_0449.pdf", "page": 1, "text": "Wills, Camp  Co., Lynchburg,  Baker, will offer greater inducements to the j .MartinsMiss Ruth Hannah, public for buying clothing, hai-Sj i Bethanycolored.Mi s Oteha etc., than they have ever done be- Tsbcll. fore. Goto their new house, next  door to old stand, and will see a I model clothing establishment."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "the j .MartinsMiss Ruth <mark>Hannah</mark>, public for buying clothing,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "the j .MartinsMiss Ruth <mark>Hannah</mark>, public for buying clothing,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [413.32, 1292.05, 732.07, 1816.32], "bbox_id": "cab79c45b1", "file": "AppomattoxNewspapers_1918-1922a_0026.pdf", "page": 1, "text": "Who was it offered a r ward for Charlotte Line correspond ent? Send it on post office, Re d Ho use. I believe, after all, Uncle Josh should have it. His friends seem very anxious tc bear from him. He has never had the flu. Auut Patsy says he has spent ill his timeafter getting hi6 tobacco off  watching the dtars In her own words she teds met  Josh is de star-gnzinest nig ger I ever seed he stays out haf ie uite gazin he is been work in on what he calls er clock ihurn he got de wuksouteu er 1 clock an is been puttin hit in rle bottom ob de churn ar- wiudin hit up, den he had de iasher tied on to hit he said oi .e Riu only study out er plan tor mek de clock churn de milk oit6elf all hed haf ter do, stid tr churniti so loug, is ter wind j de dock Ho done wasted so much milk 1 never does git my butter. U nde Josh sa yc  Pats ont got uo aen-e I dont notico ior She is gwine ter be proud or dat clock ch irn. I is beet ookin at de stars ter fine o  vbat kinder weather do grout hawg is gwine ter bring here, jour village last week. De eeben starsEllengarde, Miss Hannah Je in io g s visit- Venus, Jubetor an de mawniu ed Miss Mattie Chambers, West tarail in de same road long Red House, tbis veek Q0 oe ufitky wav. Date er J Mr. Tom Oi -mbere wen .n we gwtn ter gi plenty  Lynchburg this week we nilk an hutwr. De v, ust of it  cot ask whtner he went to ill to dat de groua hawg seed  buy bis weddiug ciothesor"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "De eeben starsEllengarde, Miss <mark>Hannah</mark> Je in io g"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "De eeben starsEllengarde, Miss <mark>Hannah</mark> Je in io g"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [350.13, 205.01, 518.98, 1319.71], "bbox_id": "6bfeda0b33", "file": "AppomattoxNewspapers_1892-1898a_0423.pdf", "page": 1, "text": "which were never answered and! travelling five and seven miles urg ing the Appomattox ladies to join and help them. They were in formed with an indifferent smile, that they had other important du ties and home affairs claiming their time, and their quarters could be better spent elsewhere than on the dead. In one seuse this is true. We have home duties and try not to neglect them, aud the monev ould be possibly more wisely spent While we do this to honor our dead, we try also to impress npo. the minds of the children of the county, hat the Confederate cause was just .ml right and thatthir fathers were not rebellious traitors and to give them a desire to acquire knowledge of the events of their country, and to teach, them to be patriotic aud proud of their South-land and an cestors. The little knowledge, be ginning here may grow in the minds and hearts of each, and be of great benefit to all. The president of the U. D. C. thought last year of giviug up the charter of the Appo mattox Chapter U. D. C. on account of the ladies lack of interest in this county. She wrote the National l D. C. president, and the Virginia president U. D. C. to that effect, stating she would join a chapter in Lynchburg. Letters from the Va. division, S. C. division and Md. di vision came pouring in not to let Appomattox surrender the second time also sending a list of names of prominent ladies who would join among them, Miss Ruth Early, Mrs. James Garnett, Miss M. Amelia Smith, the piesideut of Va. division U. D. C. and the daughter of ex-Gov Wm. Smith of Va., known as Ex tra Billy. The letter expressed surprise at the Appomattox ladies not caring to join one of the largest organizations m the whole south and living in one of the most his torical counties in the world. It is quite a reflection upon the county. We revised the roll and now have ouly eighteen members lu t they say they intend to keep up the or ganization and to be proud they are U. O C. of Appomattox and we shall be more than pleased if Coal ing will forward us the names ot the ladies desiring to join the IT, D. C. or the Memorial Association or any one reading this would like to become a member of either society please forward their name to Mrs. T. A. Smith, president of the Mem orial Association or Mrs. C. W. Hunter, president of U. D. C. West Appomattox. One prominent aim of the U. D. C. is to gather histori cal facts to help the historians of the U. D. 0. historical committee in collecting war experiences, inci dents and reminiscences of the old soldiers, their wives, daughters or any one who can remember during the Civil war. The U. D. C. es pecially requests, Mrs. T. W. Johns to write up hers and Capt. Johns also Mrs. George Miles, Mrs. A. H. Bocock, Major Flood, Mr. Chap Chilton, Drs. Wm. White and Wm. H. Ahbitt, Mrs. Mary Ann Robert son, Mr. Kirk Hannah and any one who will help us, also send us news paper clippings or Magazines or Journals or anything bearing on the war between the states. This is to help in having a correct history of the south. Please dont think yours will not be of service or interest for it may show up the spirit of the times more than you think. A D a u g h t e r ."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Robert son, Mr. Kirk <mark>Hannah</mark> and any one who"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Robert son, Mr. Kirk <mark>Hannah</mark> and any one who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.41, 494.88, 1594.56, 1174.45], "bbox_id": "619b186ac5", "file": "AppomattoxNewspapers_1974-1975a_0365.pdf", "page": 1, "text": "Whether you are a born and bred native of Appomattox or a relative newcomer, each of us is justly proud of our beautiful National Historical Park and the old houses and buildings that are a part of it. However, many people are unaware . of other places of interest in the county that are not so well known or so historically significant, but nevertheless have equal beauty and meaning in the develop ment of our county. One such place is the home of Mr. George H. Shreve and the late Ellie Shreve, of Route 1, Appomattox, located approxi mately 6 miles from Evergreen, The home of Mr. Shreve was built in 1820 and was known as the Captain William Han nahs Plantation. Although it originally contained over 1,000 acres, the land has been sold off until only 303 acres remain. The frame constructed house, painted white with black shutters, is located on a knoll under m ajestic oak trees. English ivy grows in profusion around the base of the trees and native holly trees add their beauty to the lawn and nearby fields. The high ceilings and spacious rooms are a perfect setting for the beautiful antiques which furnish the house. Among the unusual pieces is a table which belonged t 6 the 4 fstftiliy of Patrick Henry. This piece, according to Mr. Shreve, will be left to the Patrick Henry Foundation. The wide polished boards of the entrance hall are the very same ones put there in 1820. In the basement, or cellar as it was known in those days, is a small room within a room, known as the wine cellar. Inside are the racks where the homemade wine was stored arql aged. William Hannah, the original owner, was Captain of the Minute Men during the Civil War. He was also a country .doctor who was instrumental in the formation of Appomattox County in early 1845. Captain Hannah had five sons, John Kirk, William, Jr.,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "stored arql aged. William <mark>Hannah</mark>, the original owner, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "stored arql aged. William <mark>Hannah</mark>, the original owner, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [209.03, 1468.14, 364.14, 1602.39], "bbox_id": "c72d91ddf1", "file": "AppomattoxNewspapers_1926-1933a_0254.pdf", "page": 1, "text": "when one has the power to restrain it Is to become party to it. V. Samuel Established in the Pro phetic Office 319-21. And Samuel grew, and the Lord was with him, and did let none of his words fall to the ground. And all Israel from Dan even to Beersheba knew that Samuel was established to be a prophet to the Lord. Little did Hannah know that the boy who had been given tn answer to her prayer would one day become the spiritual head of the nation. Truly, he that honors God shall be honored by God."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "the Lord. Little did <mark>Hannah</mark> know that the boy"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "the Lord. Little did <mark>Hannah</mark> know that the boy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1317.11, 1561.85, 1479.6, 1754.95], "bbox_id": "549fa79130", "file": "AppomattoxNewspapers_1905-1912a_0188.pdf", "page": 1, "text": "When Mrs. Margaret E. Sangster lived in Norfolk, Va., in the early 60s she made her first acquaintance with a brick oven. In her book she tells an amusing story of the presiding genius ct her kitchen. Aunt Hannah, black as ebony and straight as a post. Aunt Hannahs magnificent carriage ct head and shoulders was the result of toting burdens on her head in childhood and girlhood. Her boost vas that In her teens she could dance with a pall of water on her head with out spilling a drop. Her corn bread, her white loaves, her roast and broiled meat could not he surpassed. She would bake her breakfast breads In a spider set on the coals and nothing m at I have aten since i their delicious flavor."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "ct her kitchen. Aunt <mark>Hannah</mark>, black as ebony and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "ct her kitchen. Aunt <mark>Hannah</mark>, black as ebony and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [635.77, 1226.15, 835.31, 1699.08], "bbox_id": "5da8cd1232", "file": "AppomattoxNewspapers_1898-1902a_0172.pdf", "page": 1, "text": "Weii Water. The contest for the postoffice at this place, which has been raging for six months or more, has at last ended. Mr. R. M. Agee, a Demo crat, has been appointed postmaster, with Mrs. Alice 6. Maxey assistant. Ihe office will remain at the same old site. The Well-Water graded school,  terms, taught by Mr. Harry T. Turner aud Miss Hannah L. Winfrey, closed the session ot 1898-99 on Friday last, March 31. This has been the most successful session in the history of the school, as Mr. Turner and Hiss Winfrey seem to have given general satisfaction to trustees, patrons, and pupils. We are having some good weather at last, and farmers are bifsy burn ing plant land, seeding oats, and plowing. Mr. Henry J. Tucker, of Mount Hope, West- Virginia, last week paid a short visit to his sisters, Mrs. A File and Mrs. A. M, Patteson. Mr. Ashton File, Jr., his nephew, accom panied Mr. Tucker ou his return to West Virginia, Uapr. Pushfence is informed that Miss Susan has not accompanied Zero or any one else to the north pole. It is possible that she might be it duced to remove to the heights of Tower Hill, but certainly not to the north pole, Policies in this part of the county are very quiet. 1 have heard of no candidates yet for district offices. Mr. R. M. Agee again has the tax tickeis for Slate-River district, and will he glad to exchange tnem for cash. It is said that the bottom of the road from, this place to White Hall,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "T. Turner aud Miss <mark>Hannah</mark> L. Winfrey, closed the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "T. Turner aud Miss <mark>Hannah</mark> L. Winfrey, closed the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.73, 380.24, 1882.75, 507.64], "bbox_id": "6bb712631f", "file": "AppomattoxNewspapers_1955-1957a_0282.pdf", "page": 1, "text": "Week-end guests of the J. Berk ley Drinkards were Mrs. Drinkards sisters and nephew, Mrs. Jean De Wall and Mrs. Hannah Bailey and BiR. Bailey, of Pittsburgh, Pa. Others with the Drinkards Sunday were Mr. and Mrs. Carlton Wayiie and daughter,- of Pamplin Mr. and Mrs. Jack Denbin and two children and Mr. and Mrs. Charles Martin and two sons, of Lynchburg, and Mr. and Mrs. E. M. Drinkard and two sons, of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "De Wall and Mrs. <mark>Hannah</mark> Bailey and BiR. Bailey,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "De Wall and Mrs. <mark>Hannah</mark> Bailey and BiR. Bailey,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [880.06, 270.06, 1023.26, 535.2], "bbox_id": "4b0d4a5078", "file": "AppomattoxNewspapers_1971-1973a_0524.pdf", "page": 1, "text": "Wednesday at 730 in the Agriculture Class room of the Intermediate School. Mr. Don ald Anderson, in charge of the Assembly work in Virginia was a surprise visitor. He gave some very helpful hints to the group. Hannah Rice gave a detailed report at the monthly meeting of the NAACP last Monday evening of her attendance to the Virginia State Conference of branches of the NAACP in its 37th annual convention in Roanoke, Va. October 20 thru 22 at Hotel Roanoke, Roanoke, Va. Rev. R. Q. Lawing will be the guest speaker Tor the annual Mens Day program at the Mt. Olivet Baptist Church in Amherst, Va. Sunday at 3 p.m."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "hints to the group. <mark>Hannah</mark> Rice gave a detailed"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "hints to the group. <mark>Hannah</mark> Rice gave a detailed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [200.62, 768.2, 519.49, 1030.54], "bbox_id": "9d2a263b31", "file": "AppomattoxNewspapers_1926-1933a_0254.pdf", "page": 1, "text": "We had such! a good rain Friday and it was so badly needed, yafthough it Jwas ac companied by an awful hail storm. The hail ruined many fine crops in this section. I Mr. and Mrs. Willie Snead left last Thursday .for their home in Charleston, W. Va., af ter a two weeks visit with Mr. and Mrs. T. J. Gordon. ! Mrs. Roberta Harvey Luk- The priest observing the motion of hardt, of Richmond, returned her Ups and not hearing the sound of to h e r home Friday from her voice concluded that she was In- Lvnchburir where she had toxicated and demanded that she put Lyncnourg, wnere sne nau away wine. She defended herself been pn a visit for a week, she against this Inference. also visited her sister, Mrs. T. 4. Blessed by Eli vv. 17, 18 . J . Gardner near Oakville. Mrs. Following her explanation he pro- g_ j, Roope, Mrs. Tom Turner nounced a blesstng upon her. Joining and Mrg Lukhardt motored in the prayer that God would grant f o r Qne d a y a n d fo u n d T il Hannah oiva. Samu.i to the Mrs. Gardner much improved Lord vv. 24-28. m health. Mr. and Mrs. L. C. For a time she cared for Samuel In Phelps and daughter spent the the home. Always the best nurse for week-end with his siter, Mrs."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "n d T il <mark>Hannah</mark> oiva. Samu.i to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "n d T il <mark>Hannah</mark> oiva. Samu.i to the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1661.71, 1090.71, 1874.09, 1435.81], "bbox_id": "7bb5b24c7c", "file": "AppomattoxNewspapers_1908-1909a_0094.pdf", "page": 1, "text": "was carried on to Hat Creek, April 1 but bn the account of the rainy weather,, thl crowd was small, about 15 was taken in. Our. teachers Misses Cornelia Bailey and Annie Sprinkle de serve much credit. Mr. Jim Thornton, formerly of this place has moved his family to Bluefield, W. Va., MissEstelle Thornton, a former teacher of Red House for many years and a Sunday School teacher at Provi dence is sadly missed, Wc hate to loose these good people from our midst. They will be greatly missed in the church and Sunday School, also Mrs. Ellie Marshall. This writer is very sorry to iear of the illness of MissGladys Smith and hope for her a speedy recovery. , _ Miss Hannah Jennings visited jOometO Mrs. Pearl Sanford at Red House last Friday. Mrs. S V. Reynolds has just returned from an extended visit t home people in Lynchburg. If th is escapes the waste basket"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "a speedy recovery. , _ Miss <mark>Hannah</mark> Jennings visited jOometO Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "a speedy recovery. , _ Miss <mark>Hannah</mark> Jennings visited jOometO Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [363.84, 1083.94, 680.35, 1221.79], "bbox_id": "d89456146c", "file": "AppomattoxNewspapers_1902-1905a_0316.pdf", "page": 1, "text": "was brought by John R. Platt against throw Kennedy over the run into the Hannah Elias, a mulattress, torecover ! riVer below. Kennedy thereupon shot certain real estate and money in  Visch, who lived only two minutes. banks, held in her name, and which  ------------------- -  Mr. Platt claims was obtained on Head-On Collision, threats to expose his relations with Kansas- City, Mo. Special. Nine her.  The suspension of S. Munn, Son  I Persons are reported to have been Co. was announced on the New York killed and many injured in a collis- Cotton Exchange. The firm is one  on Qf passenger trains on the Mis souri Pacific Railroad, near Martin City, fifteen miles south of Kansas City. The .trains, which met head- on, were the westbound Colorado limited No. 1 and the eastbound Hoi sington Kan. accommodation No. 36. A message received by Mis"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "the run into the <mark>Hannah</mark> Elias, a mulattress, torecover"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "the run into the <mark>Hannah</mark> Elias, a mulattress, torecover"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [160.54, 660.21, 332.36, 1783.52], "bbox_id": "bbcd8da664", "file": "AppomattoxNewspapers_1902-1905a_0355.pdf", "page": 1, "text": "was a stranger In the town, and he was just called upon to visit Mrs. Brown, who had lost her husband, and to console her, he went around to see Deacon Wilt, so that he could post himself about the situation. I understand you to say, said Mr. Mills, that Mr. Brown has been mar red three times? or was It four? I say, replied the deacon, that she was Mr. Browns third wife, while he was her fifth husband. But she was the fourth wife of her second bus. band, and the second wife of her first, so that she -----  Let me see, said the parson, the second wife of her first and thewell, then, three and five are eight, and four are twelve, and two are fourteenIf I get the bang of the thing, MrC.Brown has been married fourteen times, and Mr. Brown was her ----  No, you dont understand. Brown yeas only her fifth husband. Oh, her fifth. But you said she was the fourth wife ot her second husband and she had three more, so thatfour and three are sevenshe must have bad seven husbands, and where are the other two? . Why, dont you see? Her second husband was married three times be fore he met her. She had been married -once  How could she be married only -once when he was her second bus hand? Only once before she met him, and when she married him she was his fourth wife, so that whil.- he had had four wives, she had had only ----  Is this Brown y6u are speakin, of? No, no! Brown was her fifth. He had been married twice before. Her second Brown had? I mean Brown, of course. Let me explain. Mrs. Brown, sny, married John, Thomas, Jacob, William and Henry. Thomas married Lulu, Mary Hannah and Susan -----  Before he married. Mrs. Brown or after? Before. Well, then, Brown married Emma and Matilda, and John married Agnes. Agnes died, and John married Mrs Brown. Then John died and Lulu, Mary, Hannah and Susan died and then Thomas married Mrs.Brown Then Thomas died, Jacobs wife died and Williams wife died, and William annexed Mrs. Brown. When William died, Emma and Matilda died, and then Brown married Mrs. Brown. Everybody cr.me to Mrs. Brown, you aee! I see, said Mr. Mills. I think I grasp the facts. Ill go right around to see her. Mrs. Brown was at home. And after alluding to the weather and one or two other topics, Mr. Mills said I am deeply grieved. Mrs. Brown, to hear of your bereavement. It must be very, very terrible, even for a per son who Is so used to It. So used to it. What do you mean, sir? Why, I merely meant to suggest that experience cannot reconcile us to these afflictions. But there is this consolation, dear madamtime dulls the edge of our bitterest grief. You wept for John as If you could not be comforted but you see you ----  John! I do not understand you, Sir. You wept for John, but Thomas came. When Thomas was taken you thought yourself utterly inconsolable but there was Jacobhe brought new joy. When Jacob was wafted to a better land your heart was nearly broken, but William healed Its wounds and when William drifted off into the unknown, Henry assuaged your grief. Perhaps there are other Henrys, Williams and Thomases to whom this blessed duty will fall again. Per haps -----  You are talking very strangely, sir, said Mrs. Brown. Oh, no I merely say that now that John, and Thomas, and Jacob, and William and Henry have been called away to join Susan, and Hannah, and Agnes, and Matilda, and Emma, and Lulu, and Mary, and the rest, there is some hope thatthat ---- Why, Mrs. Brown, what on earth Is the matter? Mrs. Brown flew out of the room Without replying, and Mr. Mills, filled iwith amazement, went around to ask Deacon Wilt to explain the mystery.  I was merely telling her, he said, that Brown had followed John, Thom as and Matilda, and the others into a better world, when she -----  , Good gracious! shrieked the dea con you didnt allude to her dead husbands and their wives by those , names, did yon? Of course, you said that  Oh, thurder, man! Why those were only imaginary a t h a t I used by"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Thomas married Lulu, Mary <mark>Hannah</mark> and Susan -----  Before he"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Thomas married Lulu, Mary <mark>Hannah</mark> and Susan -----  Before he"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [491.03, 625.69, 2438.96, 698.84], "bbox_id": "5d7d2f05f8", "file": "AppomattoxNewspapers_1952-1954a_0472.pdf", "page": 1, "text": "WANTED TO RENT Special Notices Richard D. Robinson WANTED AT ONCE An apart ment or house to rent by February 1, 1954. Please contact at once. Mrs. J. Hannah Wilson, ltc Phone 3114."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "at once. Mrs. J. <mark>Hannah</mark> Wilson, ltc Phone 3114."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "at once. Mrs. J. <mark>Hannah</mark> Wilson, ltc Phone 3114."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.51, 700.81, 1488.59, 1657.62], "bbox_id": "158669264e", "file": "AppomattoxNewspapers_1918-1922a_0077.pdf", "page": 1, "text": "waB born and reared in borne where he died, the stead of his father on Cub near Pamplin, and was othe successful farmers be county The hospitable ot bis substantial bom ever open to his many de He w a s happily ied many years ago to Mary Grey Marshall, of lottecounty. Ha in no lien of their own, they lather and mother to the dees an d motherless, taken a number of boys la from the Orphanage me Society and reared giving them a fathers motbers love and care and id them in life a young George i-breve, whom idopted and reared, being them at the time of his , who has proven a duti Kffl. It. Hannah was a devout tian, and a faithful Elder member of Concord Pres- ian church, which is not im his home. His church was a sweet harmony of duty, and by hi si gifts and upright life the guiding influence tiichurch, and, like every t leader, he was first to le nay he asked others  1 .  took an active interest Utlic affairs, especially in ten effecting the welfare ft county, but could not be need to accept political pre sit, although he was fre- lly sought for various tj offices. He was at the of bis death and bad been many years a member of Electoral Board and 3 the D emocratic Kx- ve Committee, and gave counsel and active support ji party. He was chairman Cuunty Tax Board, ou o be had served since the 1 of the Segregation Act He rendered valuable son this board. Hannah was educated ot rgiuia Military Institute, one was a student during wil War, and was a fel- rtudent with Senator Thos hrtin, of whom he. was i a great admirer. He pated with the cadet of the V. M. I. in the  outtle of New Market Wj 1864, when that brave , boys fought like season tans and distinguished i v?8 tor valor and wrote .Deir Wood an enduring  American history, life of our deceased M we knew him, seems Ä te y summed up in lows Law of Life  I. so live I, heartily. . Jrtnoetoitatmiy, , C f t rhonestl lived and died.  8 .were laid to rest hi y b.Uryng ground . residence Friday I,  j aong a host of nd loved ones, the Oeing conducted by d k V?v L Ponton, avy Dr- J - w - Lacy 6 was covered Ä 108  hich m beautiful"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "a duti Kffl. It. <mark>Hannah</mark> was a devout tian,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "a duti Kffl. It. <mark>Hannah</mark> was a devout tian,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1298.15, 1352.42, 1433.37, 1446.13], "bbox_id": "e115b9b993", "file": "AppomattoxNewspapers_1892-1898a_0020.pdf", "page": 1, "text": "w j OTICE. _ To the land owners of 8 , clnet, Appomattox county J ta . i That-inpursuaooeofan order of Court, we, as processloners appolotwj said Court to procession the Ian side preoinot o f said reunti. will 1 work on the 17th day of October, J continue the same, with 8uch aU! w provided  l a w r a  U  m P  JK. HANNAH, PH W. H. LEWIS,  octalts  ------"}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "U  m P  JK. <mark>HANNAH</mark>, PH W. H. LEWIS,"}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "U  m P  JK. <mark>HANNAH</mark>, PH W. H. LEWIS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.05, 412.11, 2396.45, 583.16], "bbox_id": "08d2bb9ee5", "file": "AppomattoxNewspapers_1922-1923a_0544.pdf", "page": 1, "text": "W hite Teachers Institute and Citizens League. A Teachers Institute and Oiti zens League educational will be held in the Presbyterian chnrch at. Appomattox on Friday and Satur day, the 8 th and 9th of November 1907. All white teachers are re quired to be piesent cn both days The doors will be open to the pnb lio. On Saturday we especially in vite the citizens to be present. The Institute will be opened promptly at 10 a- m. each day. J. K. HANNAH, Supt. Appomattox County. oc23-2t"}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "each day. J. K. <mark>HANNAH</mark>, Supt. Appomattox County. oc23-2t"}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "each day. J. K. <mark>HANNAH</mark>, Supt. Appomattox County. oc23-2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1738.56, 535.82, 1897.43, 706.86], "bbox_id": "3a7d80ac66", "file": "AppomattoxNewspapers_1922-1923a_0550.pdf", "page": 1, "text": "W hite Teachers In stitu te and C itizens League. A Teachers Institute and Citi zens League educational will be held in the Presbyterian church at Appomattox on Friday and Satur day, the 8th and 9th of November, 1907. All white teachers are re quired tobepiesent cn both days. Tbe doors will be open to the pub lic. On Saturday we especially in vite the citizens to be present. The Institute will be opened promptly at 10 a- m. each day. J. K. HANNAH, Supt. Appomattox County. oc23-2t"}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "each day. J. K. <mark>HANNAH</mark>, Supt. Appomattox County. oc23-2t"}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "each day. J. K. <mark>HANNAH</mark>, Supt. Appomattox County. oc23-2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.34, 490.67, 1937.04, 1566.55], "bbox_id": "e64487f75c", "file": "AppomattoxNewspapers_1915-1918a_0224.pdf", "page": 1, "text": "W are proud of Appomat tox High School. It is true we are out on the suburbs of the county, yet we are near enough to feel that her people are our people. His friendB and relations were glad to welcome Mr. Alex Musgrove, who paid his broth er, Mr. R. E Musgrove, a visit this month. Mr, Harry Jennings was in the village Saturday. Miss Estelle Thornton is vis iting friends in Lynchburg. Mr.W. L. Thornton, with his wife and two little boys, Billy nd Thomas, are visiting their home people. Miss Ida Jennings,Miss Han nah and Miss Mattie Chambers were the guests of Misses Sa rih and Ellie Hamlet last week. Mr. and Mrs. Robert Frank lin and little Christine spent several days with Mr. and Mrs. C. M. Jennings last week. Mr. JVT. Jennings, of Lynch burg, was in the village Sun day. Did any of our readers ever attend a tacky party? If  you haveht, you have missed something. One of our neigh- sors gave the young people the privilege of turning the house topsy turvy and the gecora tions, etc., were e The costumes of the guests were droll, beyond all power of description. Miss Hattie Cham hers, of Red House, plaited her hair and wore an Indian head dress over two long plaits, which hung nearly to the hot tom of her skirt Her waist was decorated with ribbons and laces of various colors, one red sleeve, the other blue an overskirt of flowered paper fell gracefully over a beautiful red calico skirt one white shoe, the other red. Someone r 4 marked that Miss Mattie look ed beautiful. Miss Hannah Jennings wore lace curtains draped over white silk with ribbons and laces of various colorsso be ooming. Miss Mattie Haleys quaint old bonnet, big fan and curious little jacket made her appear too cute for anything. Miss ftarah Hamlet wore lace curtains draped over old rose calico with long train, which she said was awfully in the way until she got used to it. Miss Lena Ford wore white lace waist with green calico skirt and red calico streamers with hose and shoes of every oior of the rainbow. Miss Ellic Hamlet wore a robe of pink domestic calico waist with ribbons, shoddy jewelry and laces. Mr. Will Chambers bad rib bons, laces and flowers to match his crownless hat. Mr. Hamlet Jennings wore knee pants with ruffl s and patches. Mr. Tom Chambers wore a grey suit with red ruffles, patches and odd hose. The tackiest couple won each other, and there was a grand wedding. Mr. Hamlet Jennings and Miss Lena Ford"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "look ed beautiful. Miss <mark>Hannah</mark> Jennings wore lace curtains"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "look ed beautiful. Miss <mark>Hannah</mark> Jennings wore lace curtains"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1736.9, 1512.04, 1838.0, 1882.07], "bbox_id": "bc96142f8f", "file": "AppomattoxNewspapers_1898-1902a_0152.pdf", "page": 1, "text": "W akted .We wat Uses wax at highest , will pay Cash tor i l lbs. of Dry and Bait  - B. W.  i n PmeipUn Ci Your corresponded y getting fire-woe i Suck warm, thi w weep his usual pi umns.  Oity  life vantages, bnt they ar ter balanced by the fa to get up and bnstle warm, while our coun .back complacently, fire, and send newsy paper. Misses Sal lie Rice a key returned to thei week, after an enforc account of bad weath Miises Hannah and ire on a visit to their Mrs. Mary Mason home this evening ir retreat in Lynch b r. W. H. logon ia fldMUnnah  Tiy purchase .cholae Calv ocated in uu  .ably remain  incipal occap . ap, and that i"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "of bad weath Miises <mark>Hannah</mark> and ire on a"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "of bad weath Miises <mark>Hannah</mark> and ire on a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2062.77, 461.59, 2233.17, 572.89], "bbox_id": "e9e5f0684f", "file": "AppomattoxNewspapers_1952-1954a_0465.pdf", "page": 1, "text": "Visitors in the home of Mr. and Mrs. B. C. Maxwell over the holi days were Mr. and Mrs. Raymond Maxwell and two daughters, Mr. and Mrs. John Goin and family, Mr. and Mrs. Lee Glenn and family, all of Appomattox Mr. Buster Flood of Andersonville Enock Steadman, Gerald Steadman, Horace Stead man, Jay Steadman and Bill Hannah, of Pamplin."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Jay Steadman and Bill <mark>Hannah</mark>, of Pamplin."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Jay Steadman and Bill <mark>Hannah</mark>, of Pamplin."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2273.99, 402.24, 2431.29, 495.79], "bbox_id": "c34acf9c99", "file": "AppomattoxNewspapers_1902-1905a_0537.pdf", "page": 1, "text": "visited the Hill City last week. Mr. Walter Hannah, of West Va., i3 visiting his brother, Mr. P. M. Hannah, this Week. Mrs. Parlor who has been visiting Grassy Dale, returned to her home in South Carolina last week. Jnne 27th."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "last week. Mr. Walter <mark>Hannah</mark>, of West Va., i3"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "last week. Mr. Walter <mark>Hannah</mark>, of West Va., i3"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1275.85, 878.39, 1868.06, 1062.21], "bbox_id": "80cb3b3528", "file": "AppomattoxNewspapers_1905-1912a_0573.pdf", "page": 1, "text": "very cheap farm I No. 17, 786 Acres. 30,000 This plantation lies 5 miles  tt  , nr  A i . from depot in the best farming Miss Hannah Warren and  I Bection the Stete. Th 1and sister, Mrs. Prof. Bonam, who The lane. is smooth and is easy to work The Appomattox Gn Clnb .illd her lather for to long 1- to very productive. About have. shoot he,, uert I t o j l    , ere ill uith th.ir1 -------- -  -  the Peace-F.H. Gilliam, Hix-1 evening. Sonie experts will be  attendance and will display some fancy shooting. Mr. Robert Babcock, who lives near here, is about to exterminate the ground hog. He has killed one dozen and some of them weighed MI aupposedly for the proposed donble-1 and contains 7"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "the best farming Miss <mark>Hannah</mark> Warren and  I Bection"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "the best farming Miss <mark>Hannah</mark> Warren and  I Bection"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1345.95, 1380.9, 1506.76, 1498.4], "bbox_id": "fcbe7cd163", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "various persons who were anxious to I hear Appomattox news Mesrss. A.  B. Abbitt, L. H. Lewis and Miss Hannah Warren, and Prof. Elvin ! Ligon. Rey. J. 0, Davidson was ! present at tne Association represent-- ing Hebron church aud Rev. W E. War ren from Rocks, and Revs. P. T. Warren and J. H. touch from Pain- plins."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "H. Lewis and Miss <mark>Hannah</mark> Warren, and Prof. Elvin"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "H. Lewis and Miss <mark>Hannah</mark> Warren, and Prof. Elvin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [379.44, 528.28, 543.43, 636.02], "bbox_id": "c9da848a1f", "file": "AppomattoxNewspapers_1908-1909a_0112.pdf", "page": 1, "text": "v Judge Hutcheson opened his court promptly yesterday with a light docket and adjourned Court to June 14. Hannah vs Board Supervisors of Appomattox will come up for trial on the 15th June. Mrs. L?cy J. Connor and Mrs Emma Bagby were added to the"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Court to June 14. <mark>Hannah</mark> vs Board Supervisors of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Court to June 14. <mark>Hannah</mark> vs Board Supervisors of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1326.71, 1436.98, 1424.52, 1464.44], "bbox_id": "f9702e59fe", "file": "AppomattoxNewspapers_1892-1898a_0022.pdf", "page": 1, "text": "U UF IHW  u Sanaa J. B. ABB1TT. _ __ _ J. K. HANNAH, V Proce W. H. LEWIS, V"}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "U UF IHW  u Sanaa J. B. ABB1TT. _ __ _ J. K. <mark>HANNAH</mark>, V Proce W. H. LEWIS, V"}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "U UF IHW  u Sanaa J. B. ABB1TT. _ __ _ J. K. <mark>HANNAH</mark>, V Proce W. H. LEWIS, V"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1825.92, 708.89, 1998.15, 1104.37], "bbox_id": "1e6aaf89a6", "file": "TimesVirginian_1983a_0221.pdf", "page": 1, "text": "ttulations to Patty Roach who won the birthday cake on Thursday oyerW.T.T.X. Gospel Radio, Appomattox. Mrs. Stanley Roach had a surprise birthday dinner for her husband on Thursday. Mrs. Margie Beale lost a sister this week, Mrs. Jessie Moore of Portsmouth, a native of Prospect. Sympathy goes out to the family. Cassie Baldwin had a cousin from Farmville, Mrs. Mary Carter and her daughter, Evelyn of Bristol, Tenn. to call for a short while Sunday afternoon. It was good to see them again. Linda Taylor is having her parents. George and JoAnn Francisco of Scott County, Va. to visit her for awhile. His aunt Hannah Hackney of Kings Port, Tenn. is here now for a visit.  Welcome to Mrs. Alice Adams on returning home after a stay in the hospital. Billy Ligon had a successful .pperALw.i 4. Virginia Baptist. , Hopsital this week. May he have a quick recovery. The Rev. Wes Williams and Rev. Danny Owen returned safely from the Southern Baptist Convention in Pennsylvania. Mrs. Allie Wayne returned home Friday morning after spending a few days with her sisters. Lina and Emma."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "for awhile. His aunt <mark>Hannah</mark> Hackney of Kings Port,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "for awhile. His aunt <mark>Hannah</mark> Hackney of Kings Port,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1278.95, 754.76, 1427.85, 935.26], "bbox_id": "92edc594e5", "file": "AppomattoxNewspapers_1905-1912a_0530.pdf", "page": 1, "text": "TreasurerR. F. Burke, A ppom attox, henff F, W. M cKinney, A ppom attox. Deputy Sheriff -H. W. M cKinney, A ppo- attox. ClerkJ. K. Horsely, A ppom attox. Attorney for Commonwealth8. L. Fer- uson, Appomattox. Commissioner of RevenueE. R. A bbitt, poo mat tox. bounty tiurveyorW, A. Moses, A ppom at- x, SCHOOL OFFICE K 8. j. K. Hannah, su p t., A pp o m atto x  J . C oues, Appomattox 3. J . Bee, A ppom attox jtt. Hamilton, Evergreen., oei w atK ins eraJ.F. Dickerson, A ppom attox H. it ittm an. Evergreen L. E. xewis, Vera J . P lvis, Spout bpring, J . O D avidson. A ppo- attox SOUTHSIDB DISTRICT, SupervisorJ. R. Atwood, A ppom attox. ConstableR. 0, Mann, A ppom attox. Road Commissionerb, J . Lee, A ppom at- ox. Justices of the PeaceJ , T. Lee. A ppom at- x and W. L. Brown, E veigreen T, W. uses A ppom attox overseer Poor3. G. H arvey, A ppom attox,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "K 8. j. K. <mark>Hannah</mark>, su p t., A"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "K 8. j. K. <mark>Hannah</mark>, su p t., A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [355.7, 347.81, 522.88, 967.85], "bbox_id": "bdd457a4b9", "file": "AppomattoxNewspapers_1892-1898a_0266.pdf", "page": 1, "text": "traits or qualities of character. Like all men that have lived, he had hig faults, over those- I propose to draw the mantle of charity and only speak of his high and noble quali- ties, which shoud be magnified for the benefit of the young just coming upon the stage of action. He was in bis 80 year, 65 of which was spent m connection with the Christian church, truely it may be said of him he gave the riper years of his life to his Masters cause, thus set ting a noble example to the young to seek first the kingdom of God aud emulate his noble example. As a public servant he had filled many position for his county and people  being associated, with Janies Piit- tersoft, Wm. M. Hannah, Kit Moore, Billy Watkins, and others, and the last of the older ones.to leave the stage of action. Since the war he has filled the position of school Trustee, Road Oonimissionsr, Super visor, c., which posts of trust he filled with honor and credit to him self, and was frequently urged by his friends to Buffer his name to be used as representative in the Legis ture, this ho positively refused. As an officer he was zelous of the peo pies interest, but liberality all enfes of real, flhvity. it can be said of- him that he was scrupulously hon est had great admiration and rev erence for the truth, and a perfect contempt for a falsehood, or its author. I remember an incident that came under my observation about ten years ago that will illus trate this point. I was walking with him to the post office, he re ceived a letter that needed prompt attention, he borrowed a 1 stamp from the postmaster and promised to pay for it the first time he came over. The next morning I walked with him to the same office, when within a few yards of the office he suddenly stopped and said, I will have to return home, I have forgot"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Piit- tersoft, Wm. M. <mark>Hannah</mark>, Kit Moore, Billy Watkins,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Piit- tersoft, Wm. M. <mark>Hannah</mark>, Kit Moore, Billy Watkins,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [785.04, 1573.52, 942.02, 1656.89], "bbox_id": "7079802df0", "file": "AppomattoxNewspapers_1898-1902a_0212.pdf", "page": 1, "text": "Tower Hill. Professor L. R. Warren filled his fathers appointment at Liberty Ghapel on the last third Saturday and Sunday. Miss Hannah, his sis ter, accompanied him. Rev. J . J . Spencer will preaph at  ill"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Saturday and Sunday. Miss <mark>Hannah</mark>, his sis ter, accompanied"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Saturday and Sunday. Miss <mark>Hannah</mark>, his sis ter, accompanied"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1819.88, 1626.85, 2140.08, 1711.5], "bbox_id": "c8f78b1e9e", "file": "AppomattoxNewspapers_1915-1918a_0127.pdf", "page": 1, "text": "Tower H ill. Your correspondent has been on the sick for sometime is Miss Lucile Jennings has ac- why she has not written before, cepeted a position as teacher There has been a lot of sick- in a school in Charlotte N. C. ness in our neighborhood late- Misses Hannah Jennings and ly , lagrippe and measles have"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "our neighborhood late- Misses <mark>Hannah</mark> Jennings and ly , lagrippe"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "our neighborhood late- Misses <mark>Hannah</mark> Jennings and ly , lagrippe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1284.49, 1230.53, 1431.77, 1311.59], "bbox_id": "a434badcbc", "file": "AppomattoxNewspapers_1892-1898a_0016.pdf", "page": 1, "text": "TO the load owners of Southsid olnct, Appomattox county, Va. Take t  That in pursuance o t an order of the O il . Court, we, as processibnere appointed ora raid Court to procession the lauds in Bra side pri.oinot of raid county, will begin! work on the .7th day of -Ootouer, contin e the same, with such ad jo u rn  as provided by law until completed. J B. ABBiflT. 1 J. E. HANNAH, r ---- W. H. LEWIS, I ootSl tS"}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "ABBiflT. 1 J. E. <mark>HANNAH</mark>, r ---- W. H. LEWIS,"}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "ABBiflT. 1 J. E. <mark>HANNAH</mark>, r ---- W. H. LEWIS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [711.85, 738.63, 876.25, 894.55], "bbox_id": "e5ff92205b", "file": "AppomattoxNewspapers_1908-1909a_0479.pdf", "page": 1, "text": "To Sell Home of Author of Home, Sweet Home New York Home, Sweet Home? la for sale. The inspiration for John Howard Paynes famous sentimental the old gray farmhouse, aged by the snows of mimy winters, In which i the author spent hla boyhood at East Hampton, Lu  Island,. Is to go to the highest bidder..  . The home Was owned by Gustave H. Busk president of the Alco Gravure company, until his death recently. New his widow, Mrs. Hannah Louise Buck, hss announced her Intention of disposing of the proptrty."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "New his widow, Mrs. <mark>Hannah</mark> Louise Buck, hss announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "New his widow, Mrs. <mark>Hannah</mark> Louise Buck, hss announced"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [713.74, 766.05, 877.6, 921.2], "bbox_id": "4c2992ccc4", "file": "AppomattoxNewspapers_1926-1933a_0479.pdf", "page": 1, "text": "To Sell Home of Author of Home, Sweet Home Kew York.Home, Sweet Home la for sale. The inspiration for John Howard Paynes famous sentimental song, the old gray farmhouse, aged by the anows of many winters, ln which the author spent his boyhood at East H am pton, LongIsland,.is to go to the highest bidder. The home was owned by Gustave H. Buek president of the Alco Gravure company, until his death recently. jsow his widow, Mrs. Hannah Louise Buek, has announced her intention of disposing of the property."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "jsow his widow, Mrs. <mark>Hannah</mark> Louise Buek, has announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "jsow his widow, Mrs. <mark>Hannah</mark> Louise Buek, has announced"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1336.8, 613.46, 1684.0, 672.82], "bbox_id": "155708ded5", "file": "AppomattoxNewspapers_1908-1909a_0063.pdf", "page": 1, "text": "TO CLEAN YOUR Is naked of i Hannah In In connec ta gift from him to God. Kaaarite all"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "TO CLEAN YOUR Is naked of i <mark>Hannah</mark> In In connec ta gift from him to God. Kaaarite all"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "TO CLEAN YOUR Is naked of i <mark>Hannah</mark> In In connec ta gift from him to God. Kaaarite all"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [253.19, 797.24, 728.01, 1052.15], "bbox_id": "b2c380b3c1", "file": "AppomattoxNewspapers_1915-1918a_0552.pdf", "page": 1, "text": "Tie amusing as well as dis gusting, says The Man About ___ ____ _ ____ ___  _  _ Town to hear the slackers 18et on day 8be went to get the I naval unite hate made their part of the and quitters talk about us 888 and a verF large snake i f  v winning the war. wa8 W  on a n08t box witb jits head in the nest, had the Also, he observes, if somebnob trying to swallow it, he aw u ,   killorl M m M n r ah nil w o n t I route for rranc are more and more of o u r y o u n g m e n s ta n d in a s w as a iu e a . flora, fldarenail w e n t l compelllnf the admiration and co-op- great fair of the devil ae they I to put her eggs away in the cel-1 eration of the English people. The do of the training camp, there lar and found, and killed, an-1 National Sporttog dub of London has has been great improvement In other snake. Now did any of I entg for enIlgted men of united their moral condition within you er know a greater snake  States army and navy, the last year or two.  story? Did I tell you that Hannah 1 Boots has two of the prettiest kittenfi you ever saw? And I they will spit at yon if you God bas taken to Himself our I  catch them, dear friend and neighbor, Willi have still another new Chambers, and it is with sor I pet. I believe I told you before row we mourn the lose of such Dan, the colt, a useful life but God needed  Sunday school at Providenoe I"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "I tell you that <mark>Hannah</mark> 1 Boots has two"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "I tell you that <mark>Hannah</mark> 1 Boots has two"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.61, 251.25, 504.9, 1752.09], "bbox_id": "625fb7691d", "file": "AppomattoxNewspapers_1902-1905a_0346.pdf", "page": 1, "text": "TI1UR8DAY. R. D. Forbes testified  1 live half le from J. S. Forbesnot in sight. n morning of the 4th of March my ncle came over after me. I then ent Floyd Jones after Cliff I then ent to the fire with uncle and began i save the things looked in trunk old him to get out papers and brimr ver to my house he said he had mie money in tray of trunk he also ad some in bottom of trunk in hi coat pocket, which was rumpled up. He said, I am robbed money was one out of hs pocket no money as found in trunk colored boy. anie, and Aunt Nancy were there made a thorough search for the tracks and other evidence found tracks leading into plowed land tracks showed one person tracks bowed he stooped to fire smoke house measured the trackheres he stickI measureu several tracks ind they were the same. Woolridge id, Suppose we compromise this thing and throw out those smoke ruse tracks and have the other wo there were track- of two other pereons. Here a pair of heavy coaree bro- gan shoes were exhibited and the measure was applied and tested and fitted. The shoes were identified as those of Woolridges. On cross-examination witness ad mitted that Woolridge struck a trail which cirried him up to Dora Gulps after he came back from Appomat tox. We all went up there and measured an iron-sunk heel, about an 11 or 12 shoe l was satisfied there was nothing iu it. It is said you were charged with the burning? 1 have never been accused of this burning, except Cliff accused me of this buruiug, and I would like to in troduce witnesses to show that Cliff charged me with this burning. 1 would like to insist that the witness es b put on the stand to prove this fret. Some years ago there was bit terness between Woolridge and I. Superintendent J. K. Hannah, of Appomattox, said -he dined with E. C. Woolridge and his uaughter at ppomattox. He said Woolridge told him that all the buildings of J. S. Forbes were burned this was the first I had heard of the fire. J. F. Dickerson, an Appomattox School Trustee, testified that Wool ridge told him he wrote the will of the late Mr. Forbes, and when told that he Dickerson bad heard that Charlie Forbes was implicated, Woolridge replied that it v,as not so that Janie had written Charlie and he would be here in a few days. E. C. Spencer testifies  I heard that Charlie Forbes had been mur dered on the 21st March nothing had been done to,find him a party of Forbes, Morgan and myself went up to look for him Mr. B. T. Morgan said Charlie had come back I tried to find him and could not, went to Woolridges farm asked him out. Well, Cliff, wheres Charlie ? Who, Charlie Forbes? I dont know! He didnt have anything to do with the fire I wish I could find him. Ive got a letter I want to show you. He was go nervous he couldnt rend .t. He showed guilt as plain as an man he 3pencer ever saw. Well, Cliff, we have always been friends, and I have an Minpleasant duty to perform. Ill have to take you. All right. Ive been expecting it. Ill go with you. He asked lor time to pnt on his clothes we went iu with him he aBked I suppose you all have a warrant for me ? Cliff, you know me well enough tha I wouldnt come after you with out a warrant. Mrs. Woolridge said, JVhile the buildings were burning my littl boy was erving for Cliff to scratch his back that Charlie Forbes was there that morning he paid his father 9 for guano in the morning and came back that night and got it. We started out Wooldrige told only one of the children good bye told his wife to tell Hal Flood and Sam Ferguson to come on down. Where are you going to carry me ? We talked about Farmville an decided to go there Woolridge said he first heard of the fire the nex morning, and asked why didnt the foolish girl ring the bell. Why didnt you go over there and send your sou to Appomattox ?, 11 said he had a young horse to work denied that he had been writing to Charlie under an assumed name said his postofiice was Wert, a few days ago he had it changed to Forbes said that he had not received nidi from any other office. I have said that I would help lynch the parties who did the burn ing, out had no idea I would ever be caught. I am fifty-seven years old and this disgrace is tough. At Forbes postoffice we fe d. Did yopt say Charlie was withiu four and a-half miles of this place Woolridge answered, Echo an swers where?  Tell me and I will catch him ! This is not the time, he said I will tell Ira Orange where he can catch him At Wilburns bridge he called for paper and peucil and wrote Phone Winston McKiuney to see Joe Harvey at Rose Bower and find out positively about Charlie Forbes, and go on by Goins and Jones old place. Woolridge said in a deep study  Well, there were three of us you have me get the others."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "I. Superintendent J. K. <mark>Hannah</mark>, of Appomattox, said -he"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "I. Superintendent J. K. <mark>Hannah</mark>, of Appomattox, said -he"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1073.75, 416.36, 1233.43, 904.16], "bbox_id": "0cd2b9e320", "file": "AppomattoxNewspapers_1898-1902a_0277.pdf", "page": 1, "text": "Three Person Lose Their Live In Xe F orkThey War Children. New York, Special.Three persons were killed and three injured In a fire in the six j story tenement, 74 Forsyth street. The dead j 8re Hannah Liebowltz. 13 years old Amelia Liebowltz, 11 years old Joseph Liebowltz, 6 years old. The injured Simon Liebowltz, 33 years old, father of the dead children Dora Liebowltz, 8 years old Michael Bausebbaum, 68 years old.  The injured persons were burned about I the face and hands whilo making their  escape. None of them are seriously injured. The house in which the lire occurred is a typical Eagt side tenement, four families living on a floor. The smoke had already awakened the tenants by the time the policemen who had discovered the Are entered the hallway, and the Are escape on the front of the build lug was soon crowded with partly dressed men, women and children. The policemen tried to get upstairs through the hallway, but the smoke was so dense that they were driven back. Standing on the top of the iron roll In front of tbe house a policeman aided the people In getting down by that way. On the fourth floor lived the family of Joseph Port. Two of the children, rarah, 16 years old, and Bertha, 13, made their way down tbe rear flre-escapeto the first balcony aud then dropped 13 teet into the yard, where they were imprisoned .until the fence was broken down by the firemen and they were liberated. Liebowltz, who is a mattressmaker, lived on the top floor with his wife, Fannie, eight children, and bis wifes mother, Rebecca Solomon. Their apartments wore already Ailed with smoke. Liebowlta seised hla daughter Dora and tried to get down the Stairway, but the flames drove him baok, burning him and the child. He managed to make bis way out through a window over a plank to the roof of the adjoining building. Vra. Liebowltz followed with Lizale, eight months old. Oloee behind her was her daughter Celia, 17 years old, and her son Nathan, IS, who was carrying his nine-year- old slatar Fannie. The children who lost their lives were overcome by the smoke be fore they could reach the window. When the firemen succeeded ia getting into the top floor they found the bodies of the children. Ail had been suffoonted. but their bodies wero blackened by the flames. The damage to the building wsb about 610,0 0."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "The dead j 8re <mark>Hannah</mark> Liebowltz. 13 years old"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "The dead j 8re <mark>Hannah</mark> Liebowltz. 13 years old"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [927.82, 1405.27, 1084.37, 1460.53], "bbox_id": "06ddd65ebc", "file": "AppomattoxNewspapers_1898-1902a_0085.pdf", "page": 1, "text": "This will be a splendid chence for parties looking tnnities. P. M. HANNAH, 10-20-4.. Trustee."}, "highlight": {"text": {"matched_tokens": ["HANNAH"], "snippet": "This will be a splendid chence for parties looking tnnities. P. M. <mark>HANNAH</mark>, 10-20-4.. Trustee."}}, "highlights": [{"field": "text", "matched_tokens": ["HANNAH"], "snippet": "This will be a splendid chence for parties looking tnnities. P. M. <mark>HANNAH</mark>, 10-20-4.. Trustee."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [591.36, 1328.56, 761.28, 1455.66], "bbox_id": "b34b534529", "file": "AppomattoxNewspapers_1952-1954a_0130.pdf", "page": 1, "text": "There was a stork shower given in honor of Mrs. Dorothy Baldwin Ka walsky Saturday, Nov. 22, at her mothers, Mrs. Eunice Baldwin. She received lots of nice gifts. Those pre sent were Mrs. Bertha Garrison, Miss Mary Garrison, Mrs. Orald Ryan and daughter, Betty Frances Mrs. Rob ert Lewis, Mrs. Juddy Glover and daughter, Bessie Ann Mrs. Austin Goode, Mrs. Hannah Wood, Mrs. Mar garet Tolley, Mrs. Harry Baldwin, ! Mrs. Grade St. John, Mrs. Lena Ram-"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Mrs. Austin Goode, Mrs. <mark>Hannah</mark> Wood, Mrs. Mar garet"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Mrs. Austin Goode, Mrs. <mark>Hannah</mark> Wood, Mrs. Mar garet"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2081.98, 524.25, 2249.27, 856.85], "bbox_id": "5c218d2c47", "file": "AppomattoxNewspapers_1905-1912a_0532.pdf", "page": 1, "text": "there hut he wae dead when I they arrived. Jam es was a very bright and promising young man. W e oommenc them to the all-wise Father He only can heal their wounds Our hearts go out in sym pathy for the family. 1 Miss Lizzie W ingfield, of Lynchburg, is visiting her par ents thiB week. Rev. J. R. Sturgis and Mr. A N. Goodman were tjie guests of Mr. J . J. F arrar Saturday  night. Mr. -S. W . Harvey lost one of his horses last week. Sunday Sohool will be or ganized a t Trinity Church next 8 unday. We hope for a good school this year. Mr. P. M. Hannah attended the Presbytery at Rustburg I last week J The farm ers have done very little plowing and gardening,  though we hope the bad weat her is about oYer now."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "year. Mr. P. M. <mark>Hannah</mark> attended the Presbytery at"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "year. Mr. P. M. <mark>Hannah</mark> attended the Presbytery at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [297.38, 341.29, 456.88, 425.94], "bbox_id": "719cc5e5c6", "file": "AppomattoxNewspapers_1898-1902a_0656.pdf", "page": 1, "text": "There are no changes in the elect oral boards of Appomattox and Buckingham countiesPresley Hannah, J. R. Horsley and S. L. Ferguson for Appomattox and M. L. A. Moseley, Lewis Williams and F. A. Agee for Buckingham."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Appomattox and Buckingham countiesPresley <mark>Hannah</mark>, J. R. Horsley and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Appomattox and Buckingham countiesPresley <mark>Hannah</mark>, J. R. Horsley and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [580.3, 1355.26, 737.18, 1459.85], "bbox_id": "0eb3aa199d", "file": "AppomattoxNewspapers_1915-1918a_0544.pdf", "page": 1, "text": "the water, for it will be sent back. Over here, where Old Glory stretches its protective wings over this beautiful land of ours, we can send anything as an old man said from a twist of homespun tobacco up to a pocket knife. Miss Hannah Jennings is vis"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "a pocket knife. Miss <mark>Hannah</mark> Jennings is vis"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "a pocket knife. Miss <mark>Hannah</mark> Jennings is vis"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1776.66, 855.56, 1938.64, 937.76], "bbox_id": "65ac62ddb4", "file": "AppomattoxNewspapers_1912-1915a_0254.pdf", "page": 1, "text": "The visit to Bristol of Miss Hannah Price, author of the novel entitled The Closed Door, a suffragette pub lication, has caused increased activity toward strengthening the suffragette organization of Bristol. Miss Price Is a daughter of Rev. R. N. Price, historian of the Holston Conference, Methodist Episcopal Church South."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "to Bristol of Miss <mark>Hannah</mark> Price, author of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "to Bristol of Miss <mark>Hannah</mark> Price, author of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1314.95, 573.38, 1590.58, 1622.88], "bbox_id": "d3b99e67c0", "file": "AppomattoxNewspapers_1902-1905a_0363.pdf", "page": 1, "text": "the trick they could do it, also.  Such younjg men need to be informed. The man who succeeds to-day ia business, scholar ship j or politics succeeds because he knows how, and he knows how because he has learned how. He who doe 3 not know how is foreordained to failure. There is no more important question the young man can ask himself than how ho can prepare for life as not to be a castaway not lost in the next world, but shipwrecked in ths. For the ratio between what a nan is and what he can do i 3 a constant ratio. Every man will have all the power he earns, and the power that he has will tell, not because people like it or like him, but because it is power, and as such can keep itself erect without being propped up by a labor union cr heid in its place because it is somebodys son. It follows, then, that the most import ant thing a boy can do is to get ready. It is inspiration to kno.v that every ounce of encr-y put into work in the cariy years is so much distinct guarantee of usefulness in the adult years. And next to getting ready, the father should tell his boy that he must get ready for rough weather. The bey must learn to handle the boat of his own experience if he is not to be driven upon the shallows or into the breakers. As he meets and masters the difficulties that beset him getting out of the harbor of the high school or the college, he is equipping himself for the enemies that will assail him on the high sCas. John, then, here points out the possible ways of getting ready. He asserts that permanent success does not depend upon mood, will of the flesh, or will of man, Let me translate Family, force, fur-  but solely upon God. this into the four Fs nishings, faith. John says first a mans success does not I depend upon his family. Dr. Lyman Ab-  bott has developed this thought rational- l ly That no people are great or good sim- i ply because of their ancestry. The great- I ness of America does not depend primari-  ly upon its Pilgrim history. NTo one would j for a .moment dispute this with him. But j I desire to emphasize this from the domes tic viewpoint. A m  s spiritual success, says John, does not upend upon his fam ily. Then it makes no difference what the family, the Bible lays no stress upon here-  dity. He who says this does not know the  Bible. The Bible lays great stress upon I heredity.. When it writes the life of a I great man it begins with his parents. The foundations of cue generation are in all respects laid in the antecedent generation. In an important sense the boy begins to live when his father begins to live. The child is the parent continued down into a new generation. This is science, and it is I good science. But this is Scripture, and it  is good Scripture. Scripture emphasized heredity long before science was born. Hannah, the mother of Moses Elizabeth, I Mary, Lois and Eunice are all maguificent 1 monuments. The Christian women who would duplicate these glorious sons must first duplicate their matchless mothers. As believers in the Bible we have an in terest in heredity. It is the Gospel expec tation that the children grow up bearing the physical features of tneir parents, so in time they will come to embrace and ex- 1 emplify tbe parents faith. Thats what Timothy did, in whom the great apostle rejoiced so much. Heredity is mighty, but let us not think it is almighty. Heredity gives us tendency, but it gives us noth ing else. The children of good parents take in goodness more easily than the chil dren of bad parents. The children of edu cated parents acquire ideas more easily than those of ignorant parents. The fath er, who for five and twenty years has been saying Two times two are four, I guess Ill make it five, gives to his baby child the tendency to make the same multipli cation, but the child must make the choice before it becomes to him a sin. How I wish that that great sermon of Henry Ward Beeecher on Heredity Influence could be printed as a supplement to our courses  in ethics. That sermon makes men tremble at what they may bequeath to their children. But after all, the grace of God is stronger than the sin -of man. What a man is he chooses to be. Weak ness, tendency are handed down, hut the choice is made by the individual himself. Your spiritual success, young man, does not depend upon your ancestry, your her edity, your fathers habits, or your family. John says no man is safe simply because .of his family. But it does not depend upon your per sonal force, which is a free translation for the New Testament word flesh. It stands for the animal man, not necessarily the bad animal man. It means a strong, vigorous force in the man himself. Now, John says this strong, vigorous force will never give a man his spiritual supremacy. Let me illustrate, rather than debate, the proposition. Noah must have had a strong and vigorous will, but it did not insure him against drunkenness. Samson had a ---------- - . mighty will, but it was no match for the 60 kind as to pray him I dark eyes of Delilah. David, what a clor- 001 and then tako it I ions career in overcoming obstacles! What i way vigor! What power! But in the presence  of his guilty love he was weak and wretched. The Rev. Arthur Diinmerdale, I in that greatest American novel, The I Scarlet Letter, had a mightv will, but he j was lost in the presence of Hester Prynne.  That great Irishman, greater than any I other, who ruled with a rod of iron who 1 took the miserabiy misunderstood prob- I lem of home rule and lifted it into a cen- I tral place in the worlds thought who  thrashed the London Times who wrought I miracles in the House of Commons, and j who lifted William E. Gladstone into the n ------ - office of Prime Minister for the fourth Ml . , 7 , Cause YOU keen I time that man, at the zenith of his pow- toa  T 1 1 want to make .n er Y discovered to have invaded another   _i_ j n man s home and was living in a hidden and illicit way. The people of Great Britain tore him from his throne, trampled ids name in the dust, and witin three mouths he was laid away in his grave with e brok en heart. As the traveler to-day waiks by"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "before science was born. <mark>Hannah</mark>, the mother of Moses"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "before science was born. <mark>Hannah</mark>, the mother of Moses"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1371.32, 225.04, 1673.69, 248.24], "bbox_id": "2b79d5aec7", "file": "AppomattoxNewspapers_1898-1902a_0711.pdf", "page": 1, "text": "THE TIMES. Mrs. John Hannah, has a very Biok child."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "THE TIMES. Mrs. John <mark>Hannah</mark>, has a very Biok child."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "THE TIMES. Mrs. John <mark>Hannah</mark>, has a very Biok child."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2182.1, 194.0, 2314.5, 690.23], "bbox_id": "e4674f49a0", "file": "TimesVirginian_1980a_0390.pdf", "page": 1, "text": "The Ten Commandment tea presented at the Galilee Baptist Church last Sunday evening at 6 p.m. with the Rev. Albert Davis assistant pastor serving as master of ceremony.. The devotions were conducted by Rev. Davis with the Galilee Senior Choir furnishing the music. The following program was presented opening selection, choir scripture, Miss Pam Scruggs prayer. Deacon Elwood Christian, musical selection, choir words of welcome, superin tendent John A. Watson response, Dèacon James Pannell. The Ten Command ments were discussed by the following No. 1 chairman of First Baptist Church, Farm- vUle Va., No. 2, chairman of Mt. Moriah Baptist Church, Farmville Va., No. 3 Deacon Walter Lee Mosley, No. 4, Mrs. Heneritta Johnson, No. 5 Deacon Leon A. Lawing No. 6, Mrs. Paul Wright, No. 7, Mrs. AnabeU McCoy No. 8 Deacon Lloyd Abbott.No. 9, Mr. James N. Stevens No. 10, Mrs. Hannah Rice. The offering was lifted by Deacons Megginson and Christians. Remarks and thanks were given- by the sponsor and the pastor Rev. Lawing. Refreshments were served in the fellowship hall to all. Everyone enjoyed the entire program. An unusually large crowd attended the regular service at the Galilee Baptist Church last Sunday morn ing. The assistant pastor"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Stevens No. 10, Mrs. <mark>Hannah</mark> Rice. The offering was"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Stevens No. 10, Mrs. <mark>Hannah</mark> Rice. The offering was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [135.38, 1130.71, 458.53, 1443.06], "bbox_id": "b573b13f84", "file": "AppomattoxNewspapers_1892-1898a_0088.pdf", "page": 1, "text": "THE TARIFF BILL. The Democratic Ways and Means Committee have completed a tariff bill which keeps every pledge made in the Chicago platform. We hope to be able to furnish a full text of it in onr next issue. It is not to be expected that this bill, as it now stands, will beaccept- A t! able to all the Democratic Represen tatives. There are so many diverse interests to be reconciled that it is hardly possible a bill can be framed to suit all parties. The districts where iron ore is mined or worked will want protec Have bad men been elected by the  tion for iron, coal will claim the Legislature to compose the 100 same, and so on, bnt it is to be hoped Electoral Boards of the State ? that a sense of duty and a pure pa- Wonld Representatives nominate triotic sentiment will prevail, and as to so highind responsible positions near as the necessities of the govern- men whose characters are open to ment will permit, every industry will suspicion ? be put on the same footing. It will When John H. Robertson, Presley J be a bright day for our farmers and M. Hannah and J. Rolfe Horsleyj laborer when the government ceases were selected to constitute the elec- to tax them for the benefit of the"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "our farmers and M. <mark>Hannah</mark> and J. Rolfe Horsleyj"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "our farmers and M. <mark>Hannah</mark> and J. Rolfe Horsleyj"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1358.67, 1441.8, 1498.09, 1511.85], "bbox_id": "7b5d64acd6", "file": "AppomattoxNewspapers_1926-1933a_0092.pdf", "page": 1, "text": "The Supreme Court reversed e order of Circuit Court in the lSe of J. A. Hannah vs Board perviaors of Appomattox and wanded cose to the court here  trial."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "The Supreme Court reversed e order of Circuit Court in the lSe of J. A. <mark>Hannah</mark> vs Board perviaors of Appomattox and wanded cose to the court here  trial."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "The Supreme Court reversed e order of Circuit Court in the lSe of J. A. <mark>Hannah</mark> vs Board perviaors of Appomattox and wanded cose to the court here  trial."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.39, 832.36, 1744.97, 1078.26], "bbox_id": "94d50b5490", "file": "AppomattoxNewspapers_1902-1905a_0289.pdf", "page": 1, "text": "The school electoral board, composed of Supintendt Hannah Di. J. B. Abbitt and Commonwealth Attorney Ferguson, met at Appo mattox C. H. last Saturday, und elected the following trustees for the several districts of the county for three years, two years aud one year, respectively, in the order in which their names appear. Those for the longest terms have been desig nated as clerks, and tbe next longest chairman of the district boards Southside District.T. A, Smith, clerk L. A. Williams, chairman S. J. Lee. Ciover Hill District.  Joel WatkinB, clerk Jno. F. Dickerson- chairman H. B. Pit. man. Stonewall DistrictJ. D. Ham- ersley, clerk J. W. Wheeler, chair-"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "board, composed of Supintendt <mark>Hannah</mark> Di. J. B. Abbitt"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "board, composed of Supintendt <mark>Hannah</mark> Di. J. B. Abbitt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1857.37, 294.48, 2015.17, 854.07], "bbox_id": "3fc755b276", "file": "AppomattoxNewspapers_1915-1918a_0376.pdf", "page": 1, "text": "The school commencement w as well attended despite the inclem ent w eather, and pro nounced creditable to our ex cellent corps of teachers anc the pretty auditorium . On Tuesday evening  Tony, the Convict was played by th faculty and, others and a neat sum was realized for. payment on the chairs. Friday m orning a musicale was given by Miss Virginia Pugh, whose attractive style, personality and painstaking training made, the occasionone of unusual pleasure to visitors as well as to parons. The high School play,  In the 8pider - W eb, provoked much m errim ent Friday evening and some of the children displayed talent. Superintendent H art, of Roa noke, addressed the graduates Saturday eveniug,aod Mr L.E. Rogers., our county superin tendent-elect, delivered the di- lomas. Mr Lam bdin preached a most appropriate and impressive ser mon to the school body Sunday morning, taking for his text, Remember now thy Creator in the Days of .thy Y outh. The visitors who were here for the school finals were Mass Irene Pagb and Mr. Tolley of High Hilt Mr. J. F. Pugh and children of Lynchburg Misses Mannie Carwile and Rozelia W atkins of Farm ville, Lizzie Roberts of Farm ville, Wells of Farm ville, C arrie and Louise Anderson and brother of Prince Edw ard county and Hannah Jennings of Red House Mr. Leslie Carwile, of R an dolph- Macon, and W i l l i a m M arshall, of Blacksburg, have returned to their homes to be gin work on the farm T hts - boys received credit for work they would have completed by end of term . These schools were practically broken up by the large num ber of boys en listing in onr countrys oause."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Edw ard county and <mark>Hannah</mark> Jennings of Red House"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Edw ard county and <mark>Hannah</mark> Jennings of Red House"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.67, 244.57, 1609.63, 1240.87], "bbox_id": "44fa6ca6de", "file": "AppomattoxNewspapers_1905-1912a_0024.pdf", "page": 1, "text": "the preceding. Tney were Just emerg ing from the ancient darkness into the later day. God had assigned them leaders whose work it was to lead them into the truth, but they werh slow to follow. Being nomads they appointed wor ship wherever they were. There was no temple, tabernacle or ark. A rude altar erected out of the stones of the ground was their temple. In Jacobs family were found terapliim or house hold gods. Sacrifice still retained the social as pect so that it meant little more than a family gathering at which the local deity was present. However, by this time Jehovah was recognized as the God of the Hebrews. Other acts of worship, such as prayer, vows and dreams were observed. There were very few if any hymns at this time. The law had not been fully compiled, and a limited literature. III. This division introduces us to the Canaanitish state. Great changes took place during .his epoch, because the people of Israel discontinued their nomadic life and settled down in the promised land among tribes of foreign faith. We naturally find that the cho sen people suffered no little contamin ation, of which subsequent history is evidence. Sacred places increased in numbers and the worship of Baal flourished. It seems to be a time of degeneration, for the worship of Jehovah was cor rupted. The ark containing the two tables of stone was transported from one place to another. Images were erected to represent the deity, and the Urim and Thmnmim were employed to ascertain the will of God. Sacrifice was regarded as communion with the deity. The burnt offering seems to havebeen used more than any other. Prayer, vows, visions were still observed, while sorcery was los ing its bold. Having discontinued their wandering life they observed the Sabbath, the feasts of the moon and of harvest. It appears, however, that they were not free from corruption. Music and dancing liad its place, and it is said of David as a later time that he danced. There were hymns, such as the exodus song, the song of De borah and the song of Hannah. Lnjvs were assuming form as the outgrowth of custom. They were not written by Moses, but compiled or formulated by him. IV. The prophetic stage. This pe riod is so called because of the number of prophets who exercised a most wholesome influence on the life of the people. This was done by teaching a more enlightened conception of God. Samuel, David, Elijah, Elisha. Isaiah and Jonah were among those who raised the standard of living. The high placed were still used for the worship of Baal, and at one time the worship of Baal and Jehovah were consolidated. At the time of David the ark of the covenant was taken to Je rusalem, and the temple, was com pleted in the days of Solomon, which produced a more orderly system of worship. Idolatrous practices were not, however, entirely superseded, for we read of golden calves at Bethel and Gilgal. The completion of the temple made the most perfect organization and de velopment of the priesthood impera tive. To this time no distinction was known between church and state, but the division of the monarchy in 075 produced a complete separation. Tlie acts of worship continued about the same as In the preceding period, except that certain restrictions were imposed. Sacrifice was offered to es tablish communion with God. There was some human sacrifice. Praying to God was becoming a pleasure, and vows were made by Nazarites. Ora- les and dreams were regarded tys chan- nels through which Jehovah commu nicated His revelations. Sorcery was practiced against the protests of the prophets. A hymn book was in pro cess of compilation and the priests were compiling law. The attitude of the prophets toward existing conditions will help us to ap preciate our theme and make its ap plication. The prophets considered the high places as detrimental to the religious life of the nation. They maintained that the temple was all they required for the worship of the true God. The prophets insisted upon purity of life among the people of God, espe cially the priests. It appears from the records that the sacred office was not entirely free from corruption. They further insisted upon the true worship of the heart. While admit ting the place of forms, they contend ed that the forms must be spiritual ized."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "and the song of <mark>Hannah</mark>. Lnjvs were assuming form"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "and the song of <mark>Hannah</mark>. Lnjvs were assuming form"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2040.95, 615.55, 2280.94, 921.94], "bbox_id": "1fa38b0144", "file": "AppomattoxNewspapers_1902-1905a_0588.pdf", "page": 1, "text": "the pillows and them knows why gilded Newport is turning the cold shoulder on beauty roses, orchids and gardenias grown in hothouses to go wild over the artificial varieties made in the slums. AU paper flowers thus far used at Newjort have been furnished by the most prominent firm of stationers in New York, with branches in other large cities. Accord, ing to their special agent at Newport, commission is being paid by the firm to one of the three most celebrated co tillion leaders in New York society, but this is supposed to be a dead se cret. It seems cruel that fickle fancy should despoil the poor, honest florist, who is so grateful tor your patronage that be employs the same roses over and over again, but the use of paper flowers will relieve social entertainers of a program that has caused many of them to lose hours of sleep. Paper co tillion favors are already In vogue, and now a man who has the entree to every smart house In the country, but who needs the extra money, is at Newport booming paper flowers. Already the committee In charge of the annual Coachmens ball at Newport has pre pared to imitate fashionable society, and Oddfellows Hall will probably be turned Into a bower of paper roses when Hannah and Dennis have their great spree.Town Topics."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "of paper roses when <mark>Hannah</mark> and Dennis have their"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "of paper roses when <mark>Hannah</mark> and Dennis have their"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [154.55, 1443.12, 602.2, 1489.53], "bbox_id": "0a4c2ca794", "file": "AppomattoxNewspapers_1902-1905a_0312.pdf", "page": 1, "text": "The physicians have little hope that manding the government troops 17 - - - --- - , 4 D_I 1 _ a _ __ _ J Lrillosl Eugene and Bridget will recover. Several weeks ago Mrs. Hannah O Keefe, who lived next door to the rent in close and bombarded all day. Haggertys, was murdered, her body It 11 o clock in the morning the being horribly mutilated. John Steltz"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Several weeks ago Mrs. <mark>Hannah</mark> O Keefe, who lived"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Several weeks ago Mrs. <mark>Hannah</mark> O Keefe, who lived"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [186.0, 1298.41, 851.4, 1333.28], "bbox_id": "74f4e19d93", "file": "AppomattoxNewspapers_1922-1923a_0267.pdf", "page": 1, "text": "the passing hoL tell ns we shod  0   WJ  W 4 M  he came to speak f e S S  what model husbands, fathers, broth- ?  d J  Kirk Hannah a men of the South. to render the nuveiling ers, sisters, cousins and aunts w e 40 haVe the monument The balance of his speech was a Mr. S. L F erguson was ch"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "broth- ?  d J  Kirk <mark>Hannah</mark> a men of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "broth- ?  d J  Kirk <mark>Hannah</mark> a men of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1059.81, 520.08, 1381.02, 680.83], "bbox_id": "3ab8a46689", "file": "AppomattoxNewspapers_1915-1918a_0535.pdf", "page": 1, "text": "The motorcycle contest is over. The last vote has been cast and counted and the winners fonnd. R. L Fitzbugh, Evergreen. Va, wins The American Home Weekly Motorcycle contest which closed taaroh 2, 1918. H polled a grand total of 1.353,000 votesa magnifi cent showing. 8uch a remarkable feeling as well as usual but we  record indicates the hopelessness of hope this was only temporary. Miss Mary Thornton played in 4he absence of Miss Mattie. This ohurch is blessed with mu jsioal talent. Miss Hannah Jen-"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "mu jsioal talent. Miss <mark>Hannah</mark> Jen-"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "mu jsioal talent. Miss <mark>Hannah</mark> Jen-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [912.5, 429.33, 1283.4, 499.15], "bbox_id": "f893593d99", "file": "TimesVirginian_1983a_0457.pdf", "page": 1, "text": "THE MEMORIAL, UNITED METHODIST CHURCH will play Sunday, Dec. 18 at 7 p.m. In the charch sanctuary. Ptet row, Anna Cuccio, Hannah Jones, Betsy Wilbun, Meg Seller, Kelley M jjSrtL. y Coffman, Teresa Seay. Rachel Lawson. Kevin Holt. Back row, BiU Thomas, John Fedison. Shelia W eb h JM m H aM  Brett HerncaU, David Midgett, Bea Harvey, Mary A n  MNlTmn Bowman. Mrs. Lacy Harvey is directing the play. The public is Invited to aftraa.,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Ptet row, Anna Cuccio, <mark>Hannah</mark> Jones, Betsy Wilbun, Meg"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Ptet row, Anna Cuccio, <mark>Hannah</mark> Jones, Betsy Wilbun, Meg"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [598.53, 720.79, 760.88, 1087.25], "bbox_id": "4d6c78811c", "file": "AppomattoxNewspapers_1892-1898a_0529.pdf", "page": 1, "text": "The Mathematics Medal, offered by Dr. Julian Abbitt for proficiency in Mathematics, was delivered bv Rev. Patrick Warren to Miss Lilly Hancock. After the medals were awarded all of the contestants were addressed by Hon. H. D. Flood. Then the entire school was ad dressed by Dr. Taylor. I 11 addition to the-, above men tioned speakers. Superintendent J. K. Hannah, and Trustee J. F. Dickerson were on the stand, who made brief speeches endorsing and praisipg the progress made in the school. They expressed themselves g8 being highly satisfied .with the work aud to all appearances they were as full of the commeucement as one o fjh e ndalista.  Mrs. J. R. Atwood presided at the organ, and direcred the music dur ing the exercises. The Concord String Baud, composed of Mess4. S. Hoffman Fisher, William Steele and Haunah Evans, entertained the audience with sweet music from popular selections. PICIMARY DEPARTMENT,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "speakers. Superintendent J. K. <mark>Hannah</mark>, and Trustee J. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "speakers. Superintendent J. K. <mark>Hannah</mark>, and Trustee J. F."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [898.78, 252.59, 1044.49, 735.62], "bbox_id": "c79f544b23", "file": "TimesVirginian_1978_0363.pdf", "page": 1, "text": "The marriage of Miss Shelia Marie Macdonald of Cumber land to William Presley Hannah of Farm ville took place at the home of the groom at 2 p.m. on August 6th. The bride is the daughter of Mr. Herbert Allen Macdonald of Washington, D. C. and Mrs. Paul D. Hanuska of Cumber land. The groom is the son of Mrs. John Otis Hannah of Farmville and the late Mi Hannah. Rev. Donald Canady offi ciated at the double ring ceremony. Given in marriage by her father, the bride wore a floor length gown accented with lace and flowers, sweetheart neck line and long sleeves. Her veil was chapel length. She carried a bouquet of yellow and white daisies with butter cups and delfinium flowers. Cyndee Rene Jamerson of Gladstone was maid of honor. Karen -T. Huddleston of Farmville was bridesmaid and Christina Rene Hanuska was flower girl. Paul Duval, Jr. and Christopher Shawn Hanuska were ring bearers. John Fried of Farmville was best man and Gilbert Dennis Macdonald of Cumbërland was usher. Following the ceremony, a reception was held at the home of the groom. . After a wedding trip to Tennessee and North Carolina, the couple will reside in Farmville."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "land to William Presley <mark>Hannah</mark> of Farm ville took"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "land to William Presley <mark>Hannah</mark> of Farm ville took"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.1, 1192.74, 2117.92, 1669.86], "bbox_id": "16f24e6994", "file": "AppomattoxNewspapers_1915-1918a_0029.pdf", "page": 1, "text": "The many friends of Dr. Wil- lims sympathize with him at the departure of his daughter, Mrs. Cobb, for her home in tbe South. She has been visiting here for some time, and has en deared herself to all who have met her. Misses Mattie Chambers and Hannah Jennings are visiting Mrs. W. L. Thornton, of Blue- field, W. Va. Miss Ellen Mae Hamlet wil return to school in Lynchburg, ext week. Miss. Sarah Hamlet has ac cepted a position in Bethlehem  school. Miss Estelle Thornton will re turn to Boyton, where she has taught successfully for two years. MissDunevant has accepted Red House school and we hope she will have a pleasant and profitable sojourn with us. We are glad to note that our dear and much loved physician  Dr. C. W. Jones has so far re covered that he is practicing and we extend him a hearty welcome. Joseph Hamlet has accepted a position in Lynchburg. Miss Nettie Marshall will re turn to Farmville school. Mr. Tom Foster and Mss MollieCox were quietly mar ried on the fifth. Long live T he T im es ."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Misses Mattie Chambers and <mark>Hannah</mark> Jennings are visiting Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Misses Mattie Chambers and <mark>Hannah</mark> Jennings are visiting Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1517.32, 1539.11, 1677.02, 1843.36], "bbox_id": "78483dd712", "file": "AppomattoxNewspapers_1892-1898a_0374.pdf", "page": 1, "text": "The many friends in this county of Mrs. Mary E. Hannah were greived to learn of her death, which occurred at the residence of her son- in-law, Mr. J. L. Lewis, in Lynch burg last Sunday. The deceased was 73 years old and was a consist ent Christian and member of the Prestiyterian church at the time of her death. Her remains were in terred at her late residence near Pamplin City Tuesday. Mrs. Han nah was the widow of the late Wm. Hannah, who was a gallant Confed erate soldier and who represented this district in the State Senate for a number of years. They are sur vived by four sons and one daughter viz  Messrs. J. K., P. M. and Wal ter, of this county, and Wm. Han nah, of Norfolk, and Mrs. J. L- Lewis, of Lynchburg. These have a legacy left them worthy of emula tion iu the exemplary character of  the deceased."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "of Mrs. Mary E. <mark>Hannah</mark> were greived to learn"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "of Mrs. Mary E. <mark>Hannah</mark> were greived to learn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.97, 872.27, 1670.5, 968.17], "bbox_id": "ba9501cece", "file": "AppomattoxNewspapers_1892-1898a_0415.pdf", "page": 1, "text": "The long fight for school super intendent iu this county has been settled. Mr. J. K. Hannah was appointed Saturday to serve four years. Jt is needless to say that Air. Hannah will make an efficient officerhis qualifications for the position are well known."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "settled. Mr. J. K. <mark>Hannah</mark> was appointed Saturday to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "settled. Mr. J. K. <mark>Hannah</mark> was appointed Saturday to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [636.01, 330.77, 928.21, 479.72], "bbox_id": "c863de423c", "file": "AppomattoxNewspapers_1971-1973a_0345.pdf", "page": 1, "text": "The local chairman of the A m e r i c a n C a n c e r Society among local churches takes this opportunity to thank the follow ing leaders and churches for the following contributions Jordan Baptist, Mrs. John Lambert and Mrs. Megginson, 34 Peaceful Grove, Mrs. Hannah Rice, 32.- 76 Mt. Airy, Mrs. Elinzia Hum bles, 31.42 Galilee, Mrs. Bes sie Watson, 27.20 Mt. Shiloh, Miss Georgia Fleshman, 21.- Teresa Elliott Primary, Mr. 50 Promise Land.70Mor- - anj Mrs. Tommy Matthews"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "34 Peaceful Grove, Mrs. <mark>Hannah</mark> Rice, 32.- 76 Mt."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "34 Peaceful Grove, Mrs. <mark>Hannah</mark> Rice, 32.- 76 Mt."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [862.08, 1791.71, 1018.69, 1878.66], "bbox_id": "f6d0557d0f", "file": "AppomattoxNewspapers_1898-1902a_0496.pdf", "page": 1, "text": "The insurance companies have de cided to pay the insurance on the Jef ferson Hotel, Richmond, rather than re build the burned building. Miss Hannah B. Rawlings, matron of the Episcopal Charity School, died in Fredericksburg suddenly, aged 63 years The Albemarle Horse Show Associa tion will hold its first exhibition at Charlottesville in A um ist"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "the burned building. Miss <mark>Hannah</mark> B. Rawlings, matron of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "the burned building. Miss <mark>Hannah</mark> B. Rawlings, matron of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.2, 732.54, 1868.27, 979.88], "bbox_id": "30589f0f02", "file": "TimesVirginian_1980a_0420.pdf", "page": 1, "text": "The Inn at Bethlehem will be presented by the United Memorial Methodist Church, Sunday, December 21.  Mrs. Lucy Harvey is director of the play. The cast.is as follows Reuben, Keith Leonard, Elizabeth, Jane Guill Rebekah, Dawn Hitzenberger Sara, LauCa Walton Hannah, Donna Layne and Mary, Nancy Morris. The playcenters around the birth of Christ and the love that is shared. Special music will be provided by .the Sanctuary Choir, the Cherup Choir, Ben Harvey, Keith Leonard, Blair Smith, Mary Lane and Charlene Lawson. A covered dish dinne wilL clfcru!. students and their be served at 530 p.m. no parents cordially invite the the play will begin at 700 public to a program of"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Hitzenberger Sara, LauCa Walton <mark>Hannah</mark>, Donna Layne and Mary,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Hitzenberger Sara, LauCa Walton <mark>Hannah</mark>, Donna Layne and Mary,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2045.32, 354.59, 2215.69, 850.12], "bbox_id": "ae9f9828e3", "file": "AppomattoxNewspapers_1954-1955a_0013.pdf", "page": 1, "text": "The Honorable John A. Hannah, assistant secretary of defense for manpower and personnel, Washing ton, D. C., and Roscoe Drummond, Washington bureau chief of the New York Herald Tribune, have been named the two evening speakers for the Institute of Rural Affairs at VPI, July 27-30. Hannahs speech is scheduled for opening sessions Tuesday night July 27, Drummonds for Wednesday night, July 28. Wednesday morning, three sec tions are scheduled. Speakers for one section will include Frank L. Teu ton, Agricultural Research Serv ices, U. S. Department of Agricul ture, Washington, D. C., on New Uses for Farm Products, and Miss Gayle Ueland, marketing economist USDA Extension Service, Washing ton. In another section, the centennial celebration of professional entomo logy will be given top billing, with M. P. Jones, entomologist, USDA Extension Service, and Dr. J. O. Rowell, VPI entomologist, as speak ers. L. B. Dietrick, dean of agricul ture at VPI, also will appear, dis cussing VPIs activities in resource conservation. The third section will be especi ally designed for older rural youth, with Mrs. Polly Hanst, homemaker and writer, Oakland, Md., discuss ing Youths Responsibilities in the World Today. Also featured will be a panel discussion on Understand ing Our World Neighbors, with International Farm Youth Ex change delegates participating. Tak ing part will be Nancy Wickline Botetourt, who visited Switzerland in 1953 Frank Keesling, Loudoun who visited Scotland in 1953 Eva Jo Liskey, Rockingham, who visited Chile in 1952 Jean-Claude Malvesin, Algeria, now visiting Virginia and"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "The Honorable John A. <mark>Hannah</mark>, assistant secretary of defense"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "The Honorable John A. <mark>Hannah</mark>, assistant secretary of defense"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [522.56, 741.24, 686.05, 1043.56], "bbox_id": "c2c0ce8fba", "file": "AppomattoxNewspapers_1892-1898a_0370.pdf", "page": 1, "text": "the holidays was the musical contest between the choirs of Rocks and Hollywood Churches, which took place m the Presbyterian church at Evergreen, Monday Dec. 28th. Long before the appointed hour of meeting the crowd began to gather, and continued arriving for some time coming from as far as Staun ton River and back to the James. Prof. Johnson led off with his choir the Rocks followed by Yank Cawthon leader of Hollywood choir After six pieces were sung bv each choir recess was given, and the judges, Messrs. Harwood, Hanner, aud Drinkard made their decision, which was announced by Mr. Kirk Hannah in favor of Hollywood choir. Every one present seemed to enjoy the music very much, and the writer thinks it was well worth listening to on both sides, and much enjoyed by all who heard it. A S pectatok ."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "announced by Mr. Kirk <mark>Hannah</mark> in favor of Hollywood"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "announced by Mr. Kirk <mark>Hannah</mark> in favor of Hollywood"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.8, 565.04, 1583.11, 711.33], "bbox_id": "fd14bdb17a", "file": "AppomattoxNewspapers_1912-1915a_0204.pdf", "page": 1, "text": "The following teachers have been appointed to the schools in Lancaster county White Stone, Prof. David N. Davidson, principal Miss Bernice Scarpenstein, Miss O. B. Vaughn, Miss Marian Cundiff, Miss Josie Croasdate and Miss Fay Brent Irvington, Prof. George A. Vaiden, principal Mrs. Julia M. Lee, Mrs. F. H. Wilshin and Miss Hannah Dick Kilmarnock. Miss Margaret I. Henderson, principal Miss Myrtle Squires, Miss Estelle Cutler and Miss Susie Coppedge Poplar Neck, Miss Caroline V. Gunby Weems, Mies Ethel Lowrey and Miss Ruth Messick Morans, Mis Marjorie Allen."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "H. Wilshin and Miss <mark>Hannah</mark> Dick Kilmarnock. Miss Margaret"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "H. Wilshin and Miss <mark>Hannah</mark> Dick Kilmarnock. Miss Margaret"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [414.5, 271.72, 568.38, 957.58], "bbox_id": "a8b91dd077", "file": "TimesVirginian_1978_0206.pdf", "page": 1, "text": "The following report was turned in to the local Cancer unit by Rev. R. Q. Lawing Jordon Baptist Church, 107 Mt. Zion, 75 Mt. Airy, 74.32 Zion Baptist, 52 Promise Land, 45 Mt. Shiloh 33.20 Galilee, 30.45 Canaan, 25 Springfield, 22 Peaceful Grove, 21.63 Mt. Pleasant, 21.10 Chestnut Grove, 20.65 First Baptist, 15 Gravel HOI, 11 Morning Star, 10. As chairman for the local churches I would like to thank all pastors and individual members for their cooperation. Special thanks to the following church who worked in their communi ties Mrs. Mary Lambert and husband, brother, Jasper Lam bert of the Jordan Church, Mrs. Nannie Johnson of Zion Baptist, Mrs. Hannah Rice of Peaceful Grove. Again we say thanks to all. We are happy to report the following contributions from local churches to the local Red Cross Drive Jordan Baptist, 132 Promise Land,40.28Mt. Obed, 29.60 Mt. Zion, 25 Canaan, 25 Mt. Shiloh, 25 Galilee, 15 Mt. Airy, 20 and Mt. Pleasant, 11.07. Special thanks to the following churches and community work ers Mrs. Dorothy Fleshman, Miss Doris Austin, Miss Eloise Jones, Mrs. Mary Lambert and Mr. George Stevens. A grand total of 322.95 was reported. Many thanks to all the Ideal churches, pastors and workers for their cooperation. The general public is cordially invited to attend the annual Ladies Day Program at the Galilee Baptist Church this first Sunday at 3 p.m. Local Ladies Clubs have been invited to attend. Members of the local club will conduct the devotion- als and extend the welcome. Special music will be rendered by the Harmonettes of the Jordan Baptist Church. Mrs. T.illip Stevens will serve as mistress of ceremony. Dr. Mildred M. Dyson of Lynch burg will be the guest speaker. The special musical program presented by the Holiness  Gospel Singers of Pamplin, Va."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "of Zion Baptist, Mrs. <mark>Hannah</mark> Rice of Peaceful Grove."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "of Zion Baptist, Mrs. <mark>Hannah</mark> Rice of Peaceful Grove."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [230.9, 371.75, 386.77, 611.25], "bbox_id": "1bbf12beda", "file": "AppomattoxNewspapers_1926-1933a_0044.pdf", "page": 1, "text": "The following Jurors have been summoned to attend court Oct. 1st. L. H. Fears, Ed A Moore, Frank J. Smith, W. E. Smith, L. N. Ligon, Ben A Thornhill, F. J. Cawthon, M. L. Garrett, L. M. Drinkark, T. P. Harvey, E. H. Marshall, J. Otis Hannah, R. C. Baldwin, S. L. Scruggs, Ernest Ferguson, Irby Wheeler, W. W. Martin, J. E. Sears, W. W. Scruggs, G 0- Thornhill Tyler Coleman, Courtney C Harvey, T. W. Moses, D. P. Moon, J. H Davis, J. S. Dorsey. H. M. Marshall E P. Sears, J no. A. Carter, J P. Alvis, J. R. Burnett, F. T. Guill, Jno. W. Neighbors."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "H. Marshall, J. Otis <mark>Hannah</mark>, R. C. Baldwin, S."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "H. Marshall, J. Otis <mark>Hannah</mark>, R. C. Baldwin, S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [227.75, 354.97, 384.06, 594.47], "bbox_id": "93151707ec", "file": "AppomattoxNewspapers_1908-1909a_0044.pdf", "page": 1, "text": "The following Jurors have been summoned to attend court Oct. 1st. L. H. Fears, Ed A Moore, Frank J. Smith, VV. E. Smith, L. N. Ligon, Ben A Thornhill, F. J. Cawthon, M. L. Garrett, L. M. Hrinkark, T. P. Harvey. E. H. Marshall, J. Otis Hannah, R. C. Baldwin, S. L. Scruggs, Ernest Ferguson, Irby Wheeler, W. W. Martin, J. E. Sears, W. W. Scruggs, G O- Thornhill Tyler Coleman,. Courtney C Harvey, T. W. Moses, D. P. Moon, J. H Davis, J. S. Dorsey, H. M. Marshall E P. Sears, Jno. A. Carter, J P. Alvis, J. R. Burnett, F. T. Guill, Jno. W. Neigh b6rs."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "H. Marshall, J. Otis <mark>Hannah</mark>, R. C. Baldwin, S."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "H. Marshall, J. Otis <mark>Hannah</mark>, R. C. Baldwin, S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1723.69, 658.35, 1893.44, 779.69], "bbox_id": "bc48966114", "file": "AppomattoxNewspapers_1952-1954a_0439.pdf", "page": 1, "text": "The following honor roll has been announced for the Pamplin High School Anne Ligon, Rosa Shelton, Kinckle Martin, Ralph Inge, Kenneth Bald win, Douglas Jamerson, Dan Seapi- ster, Evelyn Ferguson, Janice Ruth McClenny, Patsy Williams. Also Shirley Jamerson, Marie Tolley, Bobby McClenny, Frances Cumby, Alice Lee Hannah, Tommy Ligon."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Frances Cumby, Alice Lee <mark>Hannah</mark>, Tommy Ligon."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Frances Cumby, Alice Lee <mark>Hannah</mark>, Tommy Ligon."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.5, 1400.35, 1726.84, 1469.39], "bbox_id": "0784300b90", "file": "AppomattoxNewspapers_1952-1954a_0397.pdf", "page": 1, "text": "The following honor roll has been announced for the Pamplin High School Alice Hannah, Marie Tolley, Tom my Ligon, .Bobby McClenny, Ralph Inge, Shirley Jamerson, Janice Me Clenny, Joann Price."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "The following honor roll has been announced for the Pamplin High School Alice <mark>Hannah</mark>, Marie Tolley, Tom my Ligon, .Bobby McClenny, Ralph Inge, Shirley Jamerson, Janice Me Clenny, Joann Price."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "The following honor roll has been announced for the Pamplin High School Alice <mark>Hannah</mark>, Marie Tolley, Tom my Ligon, .Bobby McClenny, Ralph Inge, Shirley Jamerson, Janice Me Clenny, Joann Price."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [368.14, 1555.58, 532.99, 1783.77], "bbox_id": "022e7f0f37", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "The Farmers In stitu te. .  At at meeting held here court day of the committee on Farmers In-, stitnte for this county, the subjects for discussion, plan, aud date for holding same were discussed by the members of the committee, and a complete organization was perfected as follows C ommittee . A. H. Clement, chairmen. S. L. Ferguson, secretary. Hon. H. D. Flood, Judge D. A. Christian, W. H. Ligon, Maj. J. W. Flood, J. K. Hannah, J. R. Horselev, Dr. D. Mott Robertson, Dr. T. W. Evans, L. E. Smith and J. F. Pur- dum. The following committee ou pro-"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "W. Flood, J. K. <mark>Hannah</mark>, J. R. Horselev, Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "W. Flood, J. K. <mark>Hannah</mark>, J. R. Horselev, Dr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.53, 1145.1, 1648.02, 1351.15], "bbox_id": "e927ccc224", "file": "AppomattoxNewspapers_1922-1923a_0309.pdf", "page": 1, "text": "The Cure For Scandal. It is told of Hannah More that she had a good way of managing tale bearers. It is said that whenever she was told anything derogatory of another her invariable reply was  Come, we will go and ask if this be true. The effect was sometimes lu dicrously painful.  The talebearer was taken back, stammered out a qualification, or else begged that no notice might be taken of the state ment. But the good lady was inex orable. Off she took the scandal monger to the scandalized to make inquiry and compare accounts. It is not likely that anybody ever a second time ventured to repeat a gos sipy story to Hannah More, says Modern Women. One would think her method for treatment would be a sure cure for scandal."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "It is told of <mark>Hannah</mark> More that she had"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "It is told of <mark>Hannah</mark> More that she had"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1584.9, 325.65, 1745.43, 522.32], "bbox_id": "f22f4a2b02", "file": "AppomattoxNewspapers_1892-1898a_0020.pdf", "page": 1, "text": "The Countys Freshest Hews Com pactly Given. A ppomattox i, H . T a , N ov . 16.The reaulsof the . l otion sre not m ots re- markable m an the manner to whlon the canvass was conducted. The people were neverm ore in earnest and determined o n  Democratic success, and yet nd woraof abuse passed between the op posing forces. This makes it easy to heal the division in our ranks, and so mote it be. Mr. 3. K. Hannah hat-resigned his pos ition as land processloner for the South Side district-and Mr. j . L. Cralie was appointed in hit stead. There is a lively contest here for Ne braska postofflue. Messrs. John S. Plunk ett, John T. Lee, J. R. Atwood, B. W. Morris, T. A. Smith and Miss Cbassle Ab- bitt are applicants. It is understood that the party who gets the best endorsement will win the prize, and we are informed that Mr. John S. Plunkett Is in the lead a t present."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "be. Mr. 3. K. <mark>Hannah</mark> hat-resigned his pos ition"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "be. Mr. 3. K. <mark>Hannah</mark> hat-resigned his pos ition"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [679.7, 184.56, 838.43, 1198.49], "bbox_id": "cf6d0a7e71", "file": "AppomattoxNewspapers_1915-1918a_0429.pdf", "page": 1, "text": "The Charlotte Line Our boys passed the physical examination this is truly grat ifying,-yet this means no ex emption from military service. We trust, though, that ere the training begins peace will be in sight. There is nothing im possible, with God let us pray more earnestly than ever be fore for peace. Mrs. R. W. Paulette was at church Sunday and I saw some beautiful flowers on the ree- trum. Mrs. W. 8. Pugh, of Madi- sonville, with her children passed through the village a fow days ago on her way to visit friends in Campbell. We know something about the pleasure one gets out of a visit from Mrs. Pugh-just like a bit of sunshine in the home. Our village is booming yet two autos here and another coming. I met aunt Patsy this a. m. and I thought she looked wor ried. I asked her what troubled her she said Josh had one of dem ar spells of azmess asthma, las nite an he aint fit for nothing die day I done seed him wid dem spells til I knows he puts on haf on em, jes to make me dig all de ta- ters I jes gwine dig de ice ta- ters I ain gwin tech de Irish taters, dey may rot fur all I keer. I told her I didnt know there were any 4ice taters. She said, Yes, tis, too dese ice tates is hard and white, dey dont ever git mealy, and dey keeps. She went on, wiping her eyes, and I thought she was really grieved about Josh. I stopped a minute as I pass ed and uncle Josh looked so pitiful, as he sat with his. head bowed down I asked him bow he felt. I jes has to sleep out here er settin up in die cheer, when de azmoz gits me, but I is thankful dat I kin do dat, case I done live a long time an de thing hasnt kilt me yet dey say dis doctor at de Red House kin cure any thing, and Patsy she gone ar- ter him now. A prize is offered to public school teachers of Virginia for the best essays on the subject, W hy the United States is at War? Our teachers will sure ly have to put on their think ing caps. And wont they have to be careful not to put them on wrong side out, and bind pan before? If you want the best kind of bachelor cooked dinner, oall at ooou on Messrs. Jesse, Tom and Miller Harvey. The rea son they do not marry is be cause they fear they will have to do all of the cooking. Little folks, I am sorry not to tell you about One Foot, Teddy, Hannah Boots, Buster and the kittens this week, but next time I may tell you how One Foot lost her other-foot, and where the kittens sleep"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "about One Foot, Teddy, <mark>Hannah</mark> Boots, Buster and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "about One Foot, Teddy, <mark>Hannah</mark> Boots, Buster and the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1007.26, 1516.33, 1161.58, 1594.43], "bbox_id": "e3b1261225", "file": "AppomattoxNewspapers_1915-1918a_0047.pdf", "page": 1, "text": "THE C P - X IN T H E CLEKKS OFFICE OF . . .   cuit Court ol tbe County oi Apu.imatt on tbe 18th day of September, 1915 . A. H. Clement. D. J. Baldwin and James H WheelBaaalnaT ............................ -P la lu ti - Beattrice Marie Childress, W. Child and John Hannah ........ . ..... .. .Defendant. JVi objects of this nit 1  to have partition of the tract of 119 acre of land situated in Appomattox County. Va., of which George Hannah died seised and possessed"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "W. Child and John <mark>Hannah</mark> ........ . ..... .. .Defendant. JVi objects of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "W. Child and John <mark>Hannah</mark> ........ . ..... .. .Defendant. JVi objects of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1422.95, 298.36, 1583.68, 453.56], "bbox_id": "5862dea4a9", "file": "AppomattoxNewspapers_1912-1915a_0141.pdf", "page": 1, "text": "The board passed suitable resoln- tioDB expressing to Mr. Hannah their regrets to lose him as a school officer and also expressed their ap preciation of his efficient and able service to the schools of the county In recognization of their high es teem for him both as a superinten dent and as a high-toned gentleman the board presented him with a Sne cane. Besides rontine work the board selected teachers for tbe Appomattox Agricultural school for"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "tioDB expressing to Mr. <mark>Hannah</mark> their regrets to lose"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "tioDB expressing to Mr. <mark>Hannah</mark> their regrets to lose"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1752.5, 450.67, 1971.93, 1541.9], "bbox_id": "8d2bb0b6ce", "file": "AppomattoxNewspapers_1915-1918a_0199.pdf", "page": 1, "text": "The  Old C olonial Notwithstanding the drench-1 ing showers and muddy roads,I the Missionary Society met at I Providence church on the eve-1 ning of the 15th. Mrs. J. S. I Chambers, the president of the I society, assisted by the mem-1 bers and other efficient and willing helpers, rendered the evening pleasant and profita- Ible. The writer does not know j how much money was taken  in, but from the pile of sacks  filled with nickels, dimes and quarters, there must have been  a goodly contribution. The ta-  hies were made doubly attract ive by the- display of beautiful  flowers, contributed by Mrs. R. J  W. Paulette. Her contribution  of som ething substantial   was not lackipg, either.   Mrs. W. A. Marshall, who  has been almost ill for several  weeks, attended the meeting ofI the Missionary Society. She has for many years been an earnest laborer in missionary work.  J  Mrs-Sidney Thornton and lit-  tie Laura were in town today.  Miss Estelle Thornton is  spending her vacation at Sun il nyside, the home of her father. 11 She carries the sunshine into Surinyside This is what a 11 little bird said. 11 Dr. H. C. Chalmers is ill, but 11 his physician, Dr, Moore, of  Phoenix, thinks his condition better today.   tyHBB Mary Thornton will. f i  ll spend the week with her aunt,next AAV Mrs. W. A. Marshall. J II Misa Lena Ford, from AxtOD,   Va., will visit Mrs. Sarah Ham-j   let this week.    Mass Ellie Hamlet is visiting l  Miss Hannah Jennings.  l  The automobiles ran thick  11 and fast daring the Sunday  Ischool convention held .at Mt. l z i o n colored church last  week. It is said that during lith e three days of convention lth e owners of the autos took  in 400, probably more. One colored woman was struck and lr u n over by a car. It seems lth a t the convention was turned 11 into an auto exhibition. I  Mr. Wilborn is topping his  tobacco and says he has some   fine primings, which he will not save and will not allow any-  one else to save. He claims  that it will injure the sale of   tobacco.   Mr. Lambden, the pastor of  Trinity, is holding protracted services at that church. The  lovely moonlight nights makes i  it very pleasant for these meet-  Jings. Mr. Lambden is an ear-   nest, zealous man and is throw ing his whole heart into his work. Can it be true that our dear boys, in Dixie land, will not have to fight Mexico? Mr. Editor, what has become of our old friend and physi- ician, Dr. Chap Jones? We want to hear from him we of-1 ten think of him. Cant you tell him about it? j We hear the whistle of the threshing machine engines,and the wheat crops are fine. W e have been told that Mr.1 Clinton Cawthorn ships eggs every week, not only by dozens but by bushels. He is making"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "is visiting l  Miss <mark>Hannah</mark> Jennings.  l  The automobiles"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "is visiting l  Miss <mark>Hannah</mark> Jennings.  l  The automobiles"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2157.58, 678.91, 2472.14, 1207.75], "bbox_id": "b4c8b7c188", "file": "AppomattoxNewspapers_1915-1918a_0354.pdf", "page": 1, "text": "ter flowers. Miss Lynaett.e Hamlet, who is a student at Randolph-Via- con, Lynchburg, sper î E 19tor holiday with Mis Hannah Jen niags, where she met with many friends and acquaint ances Miss Hamlet won the. scholarship at Norfolk High school to R-M. Mr. Richardson, of Charlotte O. B ., has been doing some splendid work in this vicinity, tuning and repairing pianos, organs, etc. n e tuned the or gan at Providenoe church, whioh w as badly out  of order He oomes with splendid ere dentials, being a graduate in Inis profession. He is also a flue musician. A very reoent occurrence is presented to us by a worthy, colot ed . man, who fcres near the village He said two men1  walking stopped and asked him to lend them bis horse and buggy, which be did and as they did not return at the ap pointed time, be went to And them. He said his horse had one peculiar foot and he could follow his traok, whioh he did, and he found him tied to a tree and the two men dead near by, having been shot. The colored I Spécial M illw ork, man thinks they were officers, I Com plete H ouse B ills O v sbot by moonshiners. He said the men were found near the I mouth of Oub Greek. Mr. Will Chambers is still I improving. What is the matter with some I of our valued correspondents, who forget to write letters fori  our paper?"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "19tor holiday with Mis <mark>Hannah</mark> Jen niags, where she"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "19tor holiday with Mis <mark>Hannah</mark> Jen niags, where she"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [592.76, 962.11, 754.99, 1211.32], "bbox_id": "bbf6174eec", "file": "AppomattoxNewspapers_1926-1933a_0142.pdf", "page": 1, "text": "Teacher Find H er Cl of 66 All Still Alive Pepin, Wis,Ao unusual attendance la this day of hitting population was recorded recently. when Mrs. Hannah Wartlnbe, Lg Grosse, revisited her old district school atHick Valley, near here. When she called the roll of the pupils she hd In 1B60, she found every one present ait the school community celebration Incidental to the presenta tion of the State sward In a Better Rural Schools contest Five men and two women made np the entire student body in the little rural schoolhouse of 1860 that stood on the glte where a. modern brick building housing about 40 pupils now stands. 1rs. .Wartlnbe, the teacher 6T years agp, Is now elghty-fout and requires the support of a crutch, but she got around to meet, many of the old friends that she made in post Civil War days. She Is still s staunch friend of education and two of her daughters are teaching."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "recorded recently. when Mrs. <mark>Hannah</mark> Wartlnbe, Lg Grosse, revisited"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "recorded recently. when Mrs. <mark>Hannah</mark> Wartlnbe, Lg Grosse, revisited"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1607.75, 281.25, 2419.57, 641.14], "bbox_id": "53870d23fb", "file": "AppomattoxNewspapers_1949-1952a_0596.pdf", "page": 1, "text": "TBË iIMËâ-VtfeÔttAB, ÀËPeMÂÏÏôi, ViRötmA Clover Hill Road iprovement to the Evergreen par sonage. Some of the ladies went along to help serve the lunch, ng is Faye Ranson is out again aftei  fine having measles. Mrs. L. C. Elder accompanied her daughter, Margaret to Williamsburg tthe ast Sunday for a few days, i servf- Lieut. Earl Elder and wife an 3 Circle family from Oklahoma arrived Tues- iril 25. day to spend a few days here with his parents, Mr. and Mrs. L.  d and Elder while on furlough. ving- Mrs. John Ranson and Mrs. M. H.  Wict jyjartg attended the district Home Makers meeting at Naruna Friday, d last The monthly W. M. IT., meeting Harry was held in the home of Mrs. Ed- ed his ward Ranson Saturday night. The . attendance, was good, i Alice Lee Hannah spent the week- tended end wjth Sandra Roach, in on Harold Marsh, of Gladys called in rment he home of his parents. Mr. and erings j rSi q . t . Marsh late Friday after- e was noon. Mr. and Mrs. G. T. Marsh return- i went ed with him to Gladys for the night e ini- and Saturday. ____ Mrs. J. P. Ransone. Jr. and chl- dren, Jack and Tommy, of Norfolk snent the eck-end here with t a formers mother,"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "good, i Alice Lee <mark>Hannah</mark> spent the week- tended"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "good, i Alice Lee <mark>Hannah</mark> spent the week- tended"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1840.08, 412.11, 2070.79, 674.66], "bbox_id": "2c9dd25d16", "file": "AppomattoxNewspapers_1918-1922a_0088.pdf", "page": 1, "text": "Talk Facing a W orthy Task in a W orthy W ay.-Es telle Tho -oton, i O am paiju Catechism Mat tie Chambers, Hannah Jen nings. T alk The Autobiography of  Robert 8oott a Missionary Odllar Mrs. Sue Rowles.  . a Talk 75 MiUkm Dollar Cam palgn, How our tnoney w ill be spentMr Kescer. Prayer For h e leader of the Camoaign, eepecially our Correspuadin Secretary, Mrs Thoihasvlirs. A. Marshall Song Mrs. Eesler, Mattie Chambers Refreshm ent tfere served by canteen unit, lira. W . A. Mar shall, Mrs Ala Chambers, and Mrs. R. A. PaUffct."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Catechism Mat tie Chambers, <mark>Hannah</mark> Jen nings. T alk"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Catechism Mat tie Chambers, <mark>Hannah</mark> Jen nings. T alk"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.1, 919.97, 494.89, 1675.16], "bbox_id": "d88e071951", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "T-46 Chaplin Whitfield Adams  47 Rodgers Evans Ferguson T-48 Henry Agustar Turner T-49 Glenn Samuel Martin T-50 Henry Marvin Fore T-51 iGeorge Lewis Ferguson T-52 Adelbert Archer Babcock T-53 Herbert Calvin Stephens T-54 Eugene Hudson Stevens 1 Vl-55 Ernest Murphy Womack  T-56 Emmett Mott Perdieu  T-57 Frank Malcolm Thomas T-58 Clarence Stephens T-59 Ernest Duval Esabell   6 0 George Madison Dixon T-61 Willie De.witt Harvey. T-62 Howard Brigthwell Cralle 1T-63 Henry Wilson Marshall T-64 Charlie Harvey Paulette T-65 Wesley Baker Farrar TI-66 Jossie Peyton Harvey  67 Thomrs Jefferson Hodge T-68 Avery Monroe Hodge 11 6 9 Randolph Chapel Mann T-70 Ernest Foster Farrar T-71 Robert Penny Harvey T-72 Ulysess Williams T-73 Ellsworth Palmer Carter T-74 James Braxton Chernault T-75 Joe William Bryant T-76 iTaylor Horsley Coleman T-77 James Burley McFadden T-78 Judson Cornelius McDaniel T-79 Russell Lafayette Roop T-80 Fleming Rucker McCoy ,r-81 Archie A1 xander Legrand T-82 Dallas Hobert McCoy T-83 Samuel Alvin Bell T-84 Zane Wilson Walton T-85 Arthur Thomas Powell V-86 Maury Gibbs Martin T-87 Charles Roland Smith i-88 James Elbert Rogers T-89 Emery Van Austin T-90 Burnette Turner  -91 Havilah McCoy T-92 Elmo Pitzer Banton T-93 Elon Owen Johnson T-94 William Leroy Owen . T-9 5 Sydney Adams Conner T-96 John Clarence Spiggle .-97 Atwill Dewitt Marshall T-98 Lenard Pollard T-99 Willirm Lewis Martin T-100 Clyde Davidson Carson T-101 Everette Roy Ferguson P.-102 J. Otis Hannah T-103 Wilbur Miller T-104 Herbert Lee Turner T-105 Hubert Walker Gallier T-106 Douglass Hunter 107 Paul Jones T-108 Hazel Lee Campbell T-109 Robert Augusta Bell T-110 William Clay Bell T -lll Langhorn Franklin T -ll2 Herbert Horton Moore -113 Jessie Clerlrnd Bogar 114 Bernice Aubry Johnson T -ll5 Charles Thomas Moses T -ll6 Hudson Daniel Dickerson T-117 Robert Ligon 1-118 Samuel Lewis Ferguson T-119 Elbert Benjamin Davis T-120 William Chandlay T-121 Floyd Winston Martin -122 Samuel Hubert Martin T-123 Shatter Cannon Drinkard -124 Richard Howard Grishaw i-125 Thedore Randolph Gilbert T-126 Charlie Lutheg Kidd T-127 Vester Marvin Clifton T-128 Joseph McNeal Cobb"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Ferguson P.-102 J. Otis <mark>Hannah</mark> T-103 Wilbur Miller T-104"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Ferguson P.-102 J. Otis <mark>Hannah</mark> T-103 Wilbur Miller T-104"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [641.74, 588.75, 781.03, 735.55], "bbox_id": "fd5faec1a5", "file": "AppomattoxNewspapers_1971-1973a_0305.pdf", "page": 1, "text": "T rum pteers and the G o s p e l Four of Lynchburg on the second Sunday in this month at 730 p. m. at the Appomattox Intermed iate School. The program is be ing sponsored for the benefit of the P e a c e f u l Grove Sunday School Bible Vacation School. M rs. Hannah Rice is the spon sor of the program . The annual M ens program will be held at the Galilee Bap tist Church on the fourth Sunday evening in May at 3 p.m. T h e"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Vacation School. M rs. <mark>Hannah</mark> Rice is the spon"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Vacation School. M rs. <mark>Hannah</mark> Rice is the spon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.81, 1404.94, 1876.61, 1749.98], "bbox_id": "bf4a7f7af5", "file": "AppomattoxNewspapers_1892-1898a_0459.pdf", "page": 1, "text": "T he T im es The Well Water graded public school opened on Mon day Oct. 18th with an enrollment of 31 scholars. The prospectîfor a suc cessful session is very bright. Miss Mary Patteson is principal and Miss Hannah Winfrey, aMistant. Both are most excellent teachers, this school will soon have an enrollment of about fifty, Mrs. John N. Oslin took the C. O.train at White Hall yesterday for a trip to Spokane Falls, WMhington, on a visit to her brother Mr. Fletcher Lively. She will also visit another brother who lives at Frankfort, Ken tucky. Mrs. Osltos health hM not been good for some time, and she is in hopes the trip will benefit her. Since the change of the scfeedule on the C. A O. R. R. onr mail are often three and fonr days later than formerly in arriving from Richmond and the north. I hear that thé rail-, road company will to the near fu ture ran two trains per day to White Hall, this will allow ns to get mail from Richmond every day. Mr. Lesnenr and Mr. Blanton, Republican and Democrat, candi dates for the Honse of Delegates were botfe in this neighborhood this week making calls. O ct 33,1897. A rtificer ."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "is principal and Miss <mark>Hannah</mark> Winfrey, aMistant. Both are"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "is principal and Miss <mark>Hannah</mark> Winfrey, aMistant. Both are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1404.49, 442.51, 1563.29, 1272.37], "bbox_id": "77b06b1b67", "file": "AppomattoxNewspapers_1892-1898a_0036.pdf", "page": 1, "text": "t h e 26th of January Wm. M. ah departed this life in the ty-second year of his age, leav i blank that will be hard to fill  history of Appomattox county. Ih of late has taken many of our Ira, National, State and local. I by year its monitory messages leased to our frail individual bu- ty come oftener and come ter. Bat it has nowhere claim- j, more shining mark in all that i to make up the true friend, the ty counselor and the high-toned atian gentleman, than when it M Wm. M. Hannah from life to pity. iefore and during the war Mr. Liah was a conspicuous figure in Tcounty. During a portion of time he was engaged in the mor ale business at Pamplin City, pe he did a large and prosperous Dess. His fair dealing and chan- i deeds winning for him the re of the entire community as as the greetings of many who ed thereby. But his private Is did not keep him from taking p interest in public matters anci ar as in peace he was at the ser pf his people. er the war his friends induced to become a candidate for the Senate, from the district then Deed of the counties of Appo- bx, Charlotte and Campbell orthe I Lynchburg. He was elected one of the leading citizens of burg and one of . the oldest J n the State. Mr. Hannah F a faithful and efficient repre- ative, giving great satisfaction to Enstitutency. Hate years he wasealled on by Ellow citizens to fill the onerous thankless position of Justice of leace, which he did with anabil- d judicial temperament that i have done credit to the jus- Jourt of ante-bellum days. , a mmber of years he had been der in Concord Presbyterian h, near which he lived, and his in this field and his gentle ian character leaves a gnaran his friends that he has been ioned t a higher work in a , not made with hand, where he 1 find his own name in the Book e , written by a hand diijine. M. Hannahs character for Ity and integrity could never lestioned. His life, public and ie, was one that was particular i from everything that was im tor even suspicious. His ex- was one that is in every par i worthy of emulation. The thing consoling in the death of . od man is the fact that he left L him such a beautiful record jie that should be an, example ruide foi our youth. Let us that many of them will profit"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "it M Wm. M. <mark>Hannah</mark> from life to pity."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "it M Wm. M. <mark>Hannah</mark> from life to pity."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.55, 294.73, 1856.17, 797.38], "bbox_id": "0044968237", "file": "AppomattoxNewspapers_1902-1905a_0471.pdf", "page": 1, "text": "Sydney Mountjoy, a well-known young man of Stafford county, aged 22 years, was killed while felling timber. He was cutting down a large tree. The tree in falling caught him beneath and crushed out his life. He is survived by his wife, mother, six brothers and three sisters. Mrs. Dickinson, wife of Hon. M. H. Dickinson, member of the Legislature from Spottsylvania county, died sudden ly of heart disease at her home near Mc Henry. She was a daughter of Michael Robinson, and is survived by her hus band and several children. Rev. J. W. West has organized an anti-saloon league at Falmouth with C. J. Chartters as president and over 100 members. A pig belonging to Hannah Walker, in Stafford county, which was bitten by a supposed mad dog, has developed hy drophobia and died. The same dog bit a number of other dogs, and much ap prehension is felt. The Norfolk Railway and Light Com pany awarded a contract of 100,000 for placing all of its electric lighting wires south of Queen street under ground. Miss Kelley, the daughter of Dr. G. C. Kelley, pastor of Court Street Metho dist Church, Lynchburg, was attacked on Washington street, one of the fash ionable thoroughfares of the city, by a negro, who snatched and made off with her purse. When the lady gave an out cry the negro threatened her with bodily harm. Two other such thefts were re ported to the police, and it is thought the same negro was the assailant in each case. Sweeping changes in railroad rates are contemplated by the State Corpora tion Commission, which has already done much for the people of Virginia since its appointment by Governor Montague. The commission has requested repre sentatives of the following railroads to appear before it March 18 Atlantic Coast Line, Chesapeake and Ohio, Nor folk and Western, Richmond, Freder icksburg and Potomac, Seaboard Air Line, Southern and Washington and Southern Railway. In the notice citing these railroads to appear it is stated that it is the purpose of the commission to put into effect rules prescribing minimum charges in lieu of all rules now in effect on these railroads."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "A pig belonging to <mark>Hannah</mark> Walker, in Stafford county,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "A pig belonging to <mark>Hannah</mark> Walker, in Stafford county,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.89, 622.53, 1648.89, 656.28], "bbox_id": "0b7256d53d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "Supt. Hannah is making his rounds, and reports the schools, of the connty, in good working shape."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> is making his rounds, and reports the schools, of the connty, in good working shape."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> is making his rounds, and reports the schools, of the connty, in good working shape."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.11, 247.65, 1609.31, 305.4], "bbox_id": "5832b9ff7d", "file": "AppomattoxNewspapers_1902-1905a_0546.pdf", "page": 1, "text": "Supt. Hannah held his examina tion for teachers Thursday and Wednesday. The colored teachers will have an examination Thure day and Friday."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> held his examina tion for teachers Thursday and Wednesday. The colored teachers will have an examination Thure day and Friday."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> held his examina tion for teachers Thursday and Wednesday. The colored teachers will have an examination Thure day and Friday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.47, 531.62, 1786.45, 754.21], "bbox_id": "de46b1dfe8", "file": "AppomattoxNewspapers_1902-1905a_0542.pdf", "page": 1, "text": "Supt. Hannah calls attention to the meeting of the Appomattox Ed ucational League, Tuesday 18th. I desire to emphasize this announce The League will meet Tues- 2   lStb  815 P- n at Liberty kh.u!. ii. All the teachers of L invited to be present of the vdl deliver an address on The Ed ucator anti his Environments. The League has as its object the edu cational interest, of our country aDd we hope there will be a large at tendance. We want all who can do so, join the League. If you cannot  come or. 18tb drop - postal to the I  -id  is. Hi tr put your  nam, j !i"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> calls attention to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Supt. <mark>Hannah</mark> calls attention to the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [624.04, 465.45, 781.7, 498.99], "bbox_id": "c99c74c97c", "file": "AppomattoxNewspapers_1898-1902a_0470.pdf", "page": 1, "text": "Supeuntendent Hannah has an important notice in this issue to school teachers."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Supeuntendent <mark>Hannah</mark> has an important notice in this issue to school teachers."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Supeuntendent <mark>Hannah</mark> has an important notice in this issue to school teachers."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [597.89, 539.26, 753.24, 585.76], "bbox_id": "dbfa4956c8", "file": "AppomattoxNewspapers_1898-1902a_0622.pdf", "page": 1, "text": "Superintendents J. K. Hannah and 1. J. Evans, of the schools of Appomattox and Campbell, spent tlie day in Lynchburg on Tuesday."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Superintendents J. K. <mark>Hannah</mark> and 1. J. Evans, of the schools of Appomattox and Campbell, spent tlie day in Lynchburg on Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Superintendents J. K. <mark>Hannah</mark> and 1. J. Evans, of the schools of Appomattox and Campbell, spent tlie day in Lynchburg on Tuesday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1286.62, 449.29, 1573.27, 477.8], "bbox_id": "751060a3fd", "file": "AppomattoxNewspapers_1912-1915a_0086.pdf", "page": 1, "text": "Superintendent of Schools for  Ä g  n Ä ? e d F re e  thi8 County, J. K. Hannah, whose aaitidllB.   . Ha inrv FlTfifc I .  an  . 1 . _ l A. i e l"}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "thi8 County, J. K. <mark>Hannah</mark>, whose aaitidllB.   . Ha inrv"}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "thi8 County, J. K. <mark>Hannah</mark>, whose aaitidllB.   . Ha inrv"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [613.77, 669.61, 771.01, 714.2], "bbox_id": "9e07146fd5", "file": "AppomattoxNewspapers_1898-1902a_0490.pdf", "page": 1, "text": "Superintendent J. K. Hannah was appointed Superintendent of schools of Appomattox county with out opposition."}, "highlight": {"text": {"matched_tokens": ["Hannah"], "snippet": "Superintendent J. K. <mark>Hannah</mark> was appointed Superintendent of schools of Appomattox county with out opposition."}}, "highlights": [{"field": "text", "matched_tokens": ["Hannah"], "snippet": "Superintendent J. K. <mark>Hannah</mark> was appointed Superintendent of schools of Appomattox county with out opposition."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
