{"document": {"bbox": [1585.89, 1304.09, 1747.29, 1700.35], "bbox_id": "e3adfc2aa5", "file": "AppomattoxNewspapers_1902-1905a_0185.pdf", "page": 1, "text": "Zambesi Pow er Schem e. Americans cannot but regard with interest the Victoria falls of Zambesi river, South Africa, which are over 400 feet high and produce in the wet season energy estimated by engineers at 35,000,000 horse power, as against 7,000,000 pro duced by Niagara. A railroad now under donstrnction, will reach the falls by March next, after which date a bridge over the river and an electric plant comparable with that at Niagara falls will be constructed.  It is believed, says the Electrical Review,  that it will be practicable to carry the electric energy gene rated at the falls economically, even as far as the Rand, and it is hoped to work by means of it a large pro portion of the South African Rail way mileage, as well as to supply the power needed t the gold mines. American estimates are that, with conditions similar to those in Rho- desia, it will be possible to convey the current 330 miles and deliver it at a cost of twenty-two dollars a kilowatt a year, the load being on for the whole 24 hours of the day. Within a radius of 300 miles of the falls are included the Wankie coal fields, Bulawayo, the Gweio, Sebak- we, Selnkwe, Lomagunda and Hart ley gold fields, the Northern copper fields and about 900 miles of railway line while a transmission of 600 miles would. taKe in the whole of the South African gold fields. Baltimore Sun."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "we, Selnkwe, Lomagunda and <mark>Hart</mark> ley gold fields, the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "we, Selnkwe, Lomagunda and <mark>Hart</mark> ley gold fields, the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [693.06, 531.39, 856.06, 1715.28], "bbox_id": "26e710c163", "file": "AppomattoxNewspapers_1915-1918a_0458.pdf", "page": 1, "text": "You will see from Mr. A. H. Howertons own words that be con fesses violating the law in not de stroying the nnnsed ballots before openng the ballot btfx, and in vio lating tbe law he also violated tbe above solemn oath. Mr. A H Howerton says -When he polls closed, I and the other jadges present were of tbe opnon that the nnnsed ballots should be burnt. Conducting tbe election accord ing to their opinion and not acoord- ng o hw. Opinions are all right, when right all wrong, when errng. Note that Mr. A. H. Howerton ays that each and every onof -.hem being destroyed. Read this certificate signed by the party who had tickets, others wno witnessed the horning and an other who was cle k of election and Mr G. W. Cheatham who witnessed the count This certifies that the ballots at Cbeatwood precinct were not counted after the election No vember, 1915. Therefore we can not swear that all nnnsed ballots were horned some distance from the voting place. S. P. C olima x, Clerk. G. W. C heatham . J. O. R obkktsox , Clerk. We can not swear all unused ballots were burned as we did not see any burnt. W. D. Doss, R. A. C heatham , Jadges. Note that Mr. A. H. Howerton can testfy to a fact, that the party who had the tickets and others will ot swear to. Bat I shonld remember taat Mr V. H. Howerton can commit no vrong and most be possessed of uperbnman power to know that ac and every nenaed ballot was burnt. Note above Mr. A. H. Howerton  ats tint the unuetd ballots had ibsolntely no effect whatever upon tbe resolr of tbe election at tha pr. cinct but he does not say as to dn il resalt of election in the conn y perhaps this is tne nigger in the wood-pile. Mr. A H Howerton says the un tied ballots were burnt by Mr. 8. P. Coleman on the ontside of the house  Any one would infer from this that tbe nnused ballots were nrnt near the preciuct as a matter f fact the ballots were carried throngh one farm and burnt on the next and why this boose becoming so suddenly dilapidated? Echo an swers Why? Oh, Troth, Truth, bow much thy very existence depends on bolts sod bars, on windows and doors, on hoars and minutes,on the best qual ity of window shades or on an old iilapidated boose. Mr. A. H. Howerton goes to the trouble to prove what he was not charged with, I suppose for the pur pose of drawing the attention of the eader from the facta in tbe esse. It is said that a worm partakes of the color of the food on which it feedt the same law of nature mast pply to Mr. A. H Howerton, who has fed ao long at the adder uf boiiism that he is doomed to think and set in accordance with tbe only light which has been given himan artificial lightwhich has so col ored his view that he no longer can distinguish right from wrong or good from evil. His or ginality and is taste has been destroyed. He rejoices in boteism, in which he has been told that might makes right. Now as for his saying I was en gaged in tbe drcnlation of a false hood and under other conditions vss simply lying, I have simply his to sa that where Mr. A H Howerton is known especially i. he tobacco belt nothing that be can say will hart me, and where I m known nothing that he may say rill harm ms. Bostum has altered tbe common highwaymans demand of your money or yonr life into that of your money and yonr life. A great party does not mock Heaven and its Powers by pretending oelief in a revelation which asserts tbe love of money to be the root of all ev.1, and d daring at the same time oat it is actuated, and intends to be, actuated in all chief party nL nd measures by no other lore."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "be can say will <mark>hart</mark> me, and where I"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "be can say will <mark>hart</mark> me, and where I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2110.13, 151.23, 2453.71, 450.0], "bbox_id": "75d1039f68", "file": "AppomattoxNewspapers_1905-1912a_0082.pdf", "page": 1, "text": "YOU DONT OFTEN WAVE S U C H A C H A N C E This special SeasonV Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS  We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out. Maloney, Webb  Whitaker, 1023 MAIN STREET, - LYNCHBURG, VA."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2104.54, 473.84, 2440.02, 736.47], "bbox_id": "b3c355510a", "file": "AppomattoxNewspapers_1905-1912a_0086.pdf", "page": 1, "text": "YOU DONT OFTEN HAVE S U C H A C H A N C E This special Seasons Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS W e take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2142.0, 195.05, 2479.3, 452.37], "bbox_id": "44bf8e98ab", "file": "AppomattoxNewspapers_1905-1912a_0090.pdf", "page": 1, "text": "YOU DONT OFTEN HAVE S U C H A C H A N C E This special Seasons Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS  We take off 1-3 of price on all Winter Weights, this includes the Hart, ShafFner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, ShafFner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, ShafFner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.95, 186.97, 2438.87, 446.36], "bbox_id": "5c56f61867", "file": "AppomattoxNewspapers_1905-1912a_0122.pdf", "page": 1, "text": "YOU .DONT OFTEN HAVE S U C H A. C H A N C E This special Seasons Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. d FOR THE NEXT FIFTEEN DAYS We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2101.19, 168.12, 2440.54, 451.38], "bbox_id": "2dcdeeebde", "file": "AppomattoxNewspapers_1905-1912a_0097.pdf", "page": 1, "text": "YOU D O N T O F T E N H A V E S u c h A c h a n c e This special Season s Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS  We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out. Maloney, Webb  Whitaker,"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2123.31, 189.84, 2461.86, 443.46], "bbox_id": "0b4fc6ad00", "file": "AppomattoxNewspapers_1905-1912a_0138.pdf", "page": 1, "text": "YOU D O N T O F T E N H A V E S U C H A C H A N C E I This special Seasons Clearance Sale ia such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth.  FOR THE NEXT FIFTEEN DAYS  We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffrier  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffrier  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffrier  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.27, 379.85, 2308.43, 494.8], "bbox_id": "03ea8d4c41", "file": "TimesVirginian_1983a_0445.pdf", "page": 1, "text": "You Cant Take It With You, a revival of the George S. Kaufman and Moss Hart classic, will be presented at Appomattox County High School Dec. 910. Appomattox audiences will step back in time to 1936 to the wacky home of the Sycamores. This eccentric family believes in relaxing and enjoying life, whether snake hunting, making fireworks, ballet dancing, or writing"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "S. Kaufman and Moss <mark>Hart</mark> classic, will be presented"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "S. Kaufman and Moss <mark>Hart</mark> classic, will be presented"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.0, 1672.98, 451.17, 1780.38], "bbox_id": "69e8391ac3", "file": "AppomattoxNewspapers_1912-1915a_0033.pdf", "page": 1, "text": "York, Pa.  Mary, the 1-year-old daughter of Mr. and Mrs. Levi War ner, was killed and her parents and 4-yesiold sister injured in a runaway on a road leading to Jefferson. While going down a steep hill the horse, driven by Mr. Warner, became frac tious. In crossing a breaker Mrs. War ner and her baby were thrown out, the child sustaining a fractured skull. Mrs. Warner was hart Internally and may die."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "skull. Mrs. Warner was <mark>hart</mark> Internally and may die."}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "skull. Mrs. Warner was <mark>hart</mark> Internally and may die."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1796.15, 526.67, 1996.53, 1204.51], "bbox_id": "447b5eb419", "file": "AppomattoxNewspapers_1902-1905a_0092.pdf", "page": 1, "text": "Yon can imagine whether we felt acquainted or not after that. His father and I had been boys together. Well, sir. meeting young Jones was the most pleasant part of my trip You cant tell what good fortune may befall you when you start on a jour- ney. Elections in Brazil. A writer in Argonaut declares that in Brazil the elections arc a farce, tne ballots are hardly ever counted, for the government nominates its ticket, ana then, after an election, announces all its candidates elected. A year or so ago. he says, an American, who had settled in Bahia, the second largest city in Brazil, was made an election clerK, ard was told to bring the returns from an interior towm into Bahia. After the electron had closed, the clerk took the returns nd hastened away, guarding them with the greatest car. He rode his horse hart, for he felt that the sus pense would be great at Bahia until the returns he was carrying were received. What was his chagrttl, therefore, to hand his package over to the chiet election clerk, only to, see it thrown into the waste-basket. .  Here, what are you doing? he shouted. . Throwing them away, was the an swer, we dont need-them now.  Dont need them? stammered the American, who had been brought up to regard a violation of the election laws as treasonable. .  The government has eiccted its men already, was the answer we don t need any more voles.  Here the inspector opened the pack age and showed the astonished Ameri can a quantity of blanks, each of which was signed, with a space to be fills! in with any number necessary to elect the government candidates.  ----------- - --------- -  man Amusements Halls tor our Soldiers. wj1QS A year ago Congress appropriated five hundred thousand 4ollars for the construction and equipment of amuse- ment halls at first-class army posts, and the p a building for this purpose to cost one H hundred and twenty-five thousand dol- A lars is to be constructed at Fort Myer. lars. The building is to be sixty-eiglit by one exact hundred tin a seventy-two feet, ts to be O I-shapcd. and will contain a large And swimming pool, a complete gymnasium, comf a running track, a bowling alley, a from shooting gallery, billiard room, library, lecture room, cafe, and a good-sized stage for theatricals and other literary exercises. The bnilding will be use! for the regular religious exercises on Sundays and will be managed, so as.to contribute as much as pv-..-.--- j - entertainment and improvement ot tne men stationed at the post, the cate will dispense what are known as sou drinks, and the usual foods kept at such a place. The aim is to provide a means of intellectual and moral improvement which will, as far as possible, take the place of the old time canteen and keep the men from desiring to resort to the groggeries that beset the roadways to every army post. The remainder of the appropriation will be divided rtt maxi mum amounts of forty thousand dol lars among other army jiosts designated by the Secretary of War."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "He rode his horse <mark>hart</mark>, for he felt that"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "He rode his horse <mark>hart</mark>, for he felt that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.66, 752.62, 1763.73, 1675.07], "bbox_id": "5cfa05a0a4", "file": "AppomattoxNewspapers_1898-1902a_0066.pdf", "page": 1, "text": "Yes, tor some people ln this world there seems no let-up. They are pursued from youth to manhood, and from manhoodto old age. Very distinguished are Lord Staf fords hoUnus, the Earl ot Yarboroughs honnds, and Qaeen Victoria pays eight thousand live hundred dollars per year to her Master Ot Backhonnds. But all of them put together do not equal in number or speed, or power to hunt down, the great kennel ot hounds ot which Sin and Trouble are owner and master. Bnt what Is a relief forall this pursuit ot trouble, and annoyance, and pain, and be reavement? My text gives It to you In a word of three letters, bat each letter is a harlot if you would triumph, or a tbron If yon want to be orownod, or a lake It yon would slake yonr thirstyes, a chain ot three lakesO-O-D, tbe One for whom David longed, and the One whom David found. You might ns well meet a stag whleb, after Its sixth mile of running at the top most speed through thicket and. gorge, and with the brehth Of the dogs on Its heels,has come in fnll sight ot Serooh Lake, and try to ctjbl Its projeetlng and blistered tongue with a drop of dew from a blado ot gloss,ns to at tempt to satisfy an Immortal soul,when fly ing from trouble and sin, with anything less deep, and high, and broad, and immense, and Infinite, and eternal tiian God. Hto comfort, wby it embosoms all distress. Hls arm, it wrenches off aU bondage. Hls hand, It wipes away all tears. His Obrlstly atone ment, It makes us all right with the past, and all right with the future all right with God, all right with man, and all right for ever. Lamartine tells us tbat King Nimrod said to hls three sons, Hero aro three yokes, and one is ot clay, another of amber, and another ot gold. Choose now which yon will have. The eldest son, having first ohoice, chose the vase of gold, on whloh was written the word Empire, and when opened it was found to contain human blood. The second son, making tho next, choice, ohose the vase ot aml0r.Jns with the 1 nuTwM f openod I  jUma the ashes of these who were Called great. The third son took tho of clay, and, oponing It, found it _ ptv bat on the bottom of it was in- scrlral the name ot God. King Nimrod asked bis oourtlers whloh vase they thought weghed the most. The avaricious men ot hiseourt said the vase of gold. The poets said the one of amber. But tho wisest men said the empty vase, because ono letter ot the name of God outwoighed a universe. For Him I thirst for Hte gram I beg on Hls promise I build my all. Without Him I cannot be happy. I have tried the world, and it does well enough as far it goes, but It Is too uncertain a world, too evanescent a world. I am not a prejudiced witness. I have nothing against this world. I have been one of the most fortunate, or to use a more Christian word, one of the most blessed of menblessed in my parents, blessed ln the place of my nativity, blessed In my health, blessed ln my field of work, blessed in my natural temperament, blessed In my family, blessed in my opportunities, blessed in a comfortable livelihood, blessed In the ho,e that my soul will go to Heaven through the pardoning mercy ot God, and niy body, unless it be lost at sea or cre mated in some conflagration, will He down ln the gardens of Groenwood among my kindred and friends, some already gone and others to come after me. Life to many has been n disappointment, bnt to me It bas been a pleasant surprise, and yet I de clare that It I did not feel tbat God was now my Friend and ever-present help, I should be wretched and t error at icken. But I want more of Him. I have thought over this text aud preached this sermon to myself until with all the arouse.l energies of my body, mind and soul, I can ory out, As tbe liart panteth after the water brooks, so panteth my soul after Theo, O God. Ob, when some of yon get there it will be like what a hunter tells of when push ing his eanoe far up North ln the winter and amid the Ice-floes, and a hundred miles, as he thought, from any other human be ings! He was startled ono day as he heard astepplng on the ice, and he cocked his rifle ready to meet unythlng that came near. He found a man, barefooted and In sane from long exposure, approaching him. Taking him into bis canoe and kindling fires to warm him, he restored him and found out where be had lived, and took him to hls home, and found all the village ln great excitement. A hundred men were searching for the lost man, and bis family and friends rushed out to meet him and, as had been agreed at hls first appearance, bells were rung, and guns were fired, and banquets spread, and the rescuer loaded with presents. Well, when some ot yon step oat of this wilderness, where yon have been chilled and torn ag sometimes lost amid the Iceberg warm greetings of all tbe villages  th e glorified, and your friends rush o u t to give you weleomlng kiss, the news that th e r e to another soul forever saved will c all th e caterers ot Heaven to spread tho banquet and the bell-men to lay hold of the ro p e in the tower, and while tbe ehallees eliek at the feast, and the bells clang from the tur rets, it will be a scene so uplifting I p ra y God I may be there to take part in th e celestial merriment. Until tbe d a y break and the shadows flee away, be th o u like a roe or a young hart upon the mouse tains of Bether."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "roe or a young <mark>hart</mark> upon the mouse tains"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "roe or a young <mark>hart</mark> upon the mouse tains"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2313.61, 1444.95, 2478.49, 1600.63], "bbox_id": "7ec1d0bb41", "file": "AppomattoxNewspapers_1902-1905a_0214.pdf", "page": 1, "text": "Y oi cannot affimi 0 41 LO. fry without a HILL one or more, or need, mam lumber, tlinuet. mill want to repair or build, or Hows, or Crates, writ  . ELIAS ft E R  ., B uffalo, N . T ., and tea t the beet for tbs hart money, direct trowa tha etmni. Catalogue J i S h L Kilo agents wanted. ______ P ATE NT 8, r U A I f X - t A K M AXII P E X s t lW K A re V 011 lu te re e te tlf Millions of dollars have been made oat of M s a b end Trade-Mar. Million of dollars are approneB- sled to pay peuelon. w years practice. For Infor nia tlon and literature, FBEB, v in e  TIIK W. II. W I I.L.H COM PAN Y WUle Building, 3b Ind. Ave., Washiutftus, Û .JL  -..FLAME-KILLER"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "the beet for tbs <mark>hart</mark> money, direct trowa tha"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "the beet for tbs <mark>hart</mark> money, direct trowa tha"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.5, 181.71, 2437.65, 435.57], "bbox_id": "3e34c0ec15", "file": "AppomattoxNewspapers_1905-1912a_0128.pdf", "page": 1, "text": "Y O U D O N T O F T E N H A V E S U C H A C H A N C E This special Seasons Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out,"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.7, 193.99, 2437.69, 487.64], "bbox_id": "ff675437b9", "file": "AppomattoxNewspapers_1905-1912a_0111.pdf", "page": 1, "text": "Y O U D O N T O F T E N H A V E S U C H A C H A N C E This special Seasons Clearance Sale is such an opportunity as you seldom have for supplying yourself with good clothes at less than they are worth. FOR THE NEXT FIFTEEN DAYS  We take off 1-3 of price on all Winter Weights, this includes the Hart, Shaffner  Marks Clothes this is a chance to get into a suit of the Best Clothes made, at the price of cheaper made garments. Come quick before the sizes are out. Maloney, Webb  Whitaker, 1023 MAIN ST R E ET , - LYNCHBURG, VA."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Weights, this includes the <mark>Hart</mark>, Shaffner  Marks Clothes this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [187.7, 448.62, 509.15, 667.42], "bbox_id": "335cf5f8f4", "file": "AppomattoxNewspapers_1922-1923a_0366.pdf", "page": 1, "text": "!y a live man a 1 No ling interest. h e d o e s in E d u c a tio n a l w o rk . audience was eyer more charmed has its charm too, especially with than was the oue that witnessed tin rendition of this play. The pro ceeds were such as to free the Y. M. C. A. of debt. Our Baptist friends are pleas id to have the Rev. Mr. Hart as then .pastor. He comes to a most invit ing field too. The young ladies of the Normal who attend our different church constitute themselves large audi nues, and surely no minister could ask for more acceptable auditors. A majority of the students go to thi Methodist church, but they are"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "have the Rev. Mr. <mark>Hart</mark> as then .pastor. He"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "have the Rev. Mr. <mark>Hart</mark> as then .pastor. He"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1223.77, 322.35, 2274.21, 409.86], "bbox_id": "5bd4278441", "file": "AppomattoxNewspapers_1960-1962b_0497.pdf", "page": 1, "text": "y  0  J D C r  e    y l   Funeral services were conducted at 2 p. m. Saturday at Centenary Methodist Church .by the Rev. C. P. Price and the Rev. J. H. Hart. Burial was in the church ceme tery. Pallbearers were Ned Nosh, Bobby Nash, Lawrence Nash Jr Leslie Roach Jr. Gene Gryder,"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "the Rev. J. H. <mark>Hart</mark>. Burial was in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "the Rev. J. H. <mark>Hart</mark>. Burial was in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [368.93, 819.85, 530.03, 1048.17], "bbox_id": "d327dc658f", "file": "AppomattoxNewspapers_1915-1918a_0139.pdf", "page": 1, "text": "work since. . Messrs. Steavnsa and Hart, rival candidates for the Superintendents place n eit time were here, and each with boosters. N ot that the boost in g tresspassed upon the regular proceedings but that in private respeotiVe claim s were discussed. 11 have but one criticism to pass up-n the teacher, and that is the want of carrying qualities about their voices when addressing audiences from the platform. Elocution honld he taught and practiced in our schools. Its stupid to sit and notice months open and arms swing and nothing more. Perhaps it would be well to attend Billy Sun dty meeting and learn from him how he controls audiences of 20 , 000 ."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "since. . Messrs. Steavnsa and <mark>Hart</mark>, rival candidates for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "since. . Messrs. Steavnsa and <mark>Hart</mark>, rival candidates for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.34, 1657.93, 1644.44, 1786.03], "bbox_id": "138fd6ab8d", "file": "AppomattoxNewspapers_1912-1915a_0362.pdf", "page": 1, "text": "Woman Companion Swims To Safety When Craft Upsete. Wilmington, Del.Miss Alice Hart man, 22 years old, of 620 Van Buren street, a member of a picnic party from the Second Baptist Church, was drowned in the Christiana River, at Smalleys dam, beyond Christiana, Del. A canoe in which she and Miss Anna M. Cloward, of 906 Jefferson street, were riding upset. Both young women could swim. Miss Cloward saving herself by swimming ashore."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Upsete. Wilmington, Del.Miss Alice <mark>Hart</mark> man, 22 years old,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Upsete. Wilmington, Del.Miss Alice <mark>Hart</mark> man, 22 years old,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [863.73, 1020.11, 1352.23, 1293.86], "bbox_id": "04f190277f", "file": "AppomattoxNewspapers_1908-1909a_0231.pdf", "page": 1, "text": "WMrh a son, Carl, of Roanoke, and a week hold beinn  next daughter, Mrs. W- C. Garrett, ReriDes fnr k  with her father I . 1 . Ior cakes, breads, Wagers, who was also appoint-1at the tim e-of his death- Mrs  fact for everything ed delegate was unable to at-lfnge died five years ago. A lm W w  P? tojffozen desserts, tend. large crowd attended the fun- m the contests. Problems of t h e public Ieral in spite of the rain. I fiia n g j ly laquered recipe school system in Virginia, child I  ------- o  I, e reL een, or black, will welfare, co-operation of home, TT   , the best recipe chool and church to enrich life U.D. C. Hostesses  sublted each week. and the possibility of more e f-  ------ F wiU be juiged priin- fective moral and religious ed- A n n o u n c e d F o r 1 9 ?J?u ily , the practical basis of ucation in public were discus-1  Itne reliability, t h e simplicity sed at the meeting. I ------- j0j .h e mgredients, and the sim- Harris Hart, superintendent! The nrovram nt v,nofMO - I y  .th e process of pre- of public instruction in Virginia I meetings of the TlniFen68 I   ng  ,e disb However, ! w g g e .peaker a tT h e r n - fe  T th l H  M mg session. Mr. Bart voiced in g the coming vear I T  . disapproval of subsidization of ced are as foflows npun-l The winning recipe for each  public schools for private ends! 1930, Nov Mrs W W Hcntf Time r be published in the! and the tendency to standard- Mrs. A R The contestl lze courses too highly. Dr. I Dec- Mrs. W T  3 t00i0 iii93?,  1S ?pe?  a 1 wbo Wlsb t com-?  w I AeCt.MJ s Wj gf StTe e Mrs. J. I pete, but no contestant m a y Mrs N a w S-!sub?it more than one recipV ers- .y a i Feh m VA . eac w eek Entrants for the"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "and the sim- Harris <mark>Hart</mark>, superintendent! The nrovram nt"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "and the sim- Harris <mark>Hart</mark>, superintendent! The nrovram nt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.95, 961.03, 2264.39, 1132.36], "bbox_id": "9af20b246c", "file": "AppomattoxNewspapers_1922-1923a_0556.pdf", "page": 1, "text": "Withstood Other Treatment Butj Quickly Cured B y Chamberlains Cough Remedy.  Last winter I caught a very se vere cold which lingered for weeks say8 J. Uju hart, of Zephyr. Onta rio.  My cough was very dry and hatsh. The local dealer recommend ed Chamberlains Congh Remedy and guaranteed it, so I gave it a I trial. One small bottle of it cured me. I believe Chamberlain Cough Remedy to be the est I have over used. For sale by J. a. Atwood Appo  mattox, R. J. Carter Prospect, E.  F Glover Evergreen."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "weeks say8 J. Uju <mark>hart</mark>, of Zephyr. Onta rio."}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "weeks say8 J. Uju <mark>hart</mark>, of Zephyr. Onta rio."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [825.6, 1586.64, 986.75, 1783.14], "bbox_id": "b12e38eaba", "file": "AppomattoxNewspapers_1912-1915a_0390.pdf", "page": 1, "text": "Wise Use of Powers. To turn away from useless and ban ren speculations to withdraw persist ently our thoughts from the unknow able, the Inevitable and the irrepar able to concentrate them on the im mediate present and on the nearest duty to waste no moral energy on excessive Introspection or self-abase ment or self-reproach, but to make the cultivation and the wise use of all our powers the supreme ideal and end of our lives to oppose labor and study to affliction and regret to keep at a distance gloomy thoughts and exaggerated anxieties to see the in dividual in connection and , co-opera tion with the whole, and to look upon effort and action as the main elements both of duty and happiness! William Edward Hart pole Locks."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "and happiness! William Edward <mark>Hart</mark> pole Locks."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "and happiness! William Edward <mark>Hart</mark> pole Locks."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.55, 308.35, 1889.02, 412.65], "bbox_id": "e0b8a1f140", "file": "AppomattoxNewspapers_1952-1954a_0423.pdf", "page": 1, "text": "win, Mrs. Jim Richardson, Mrs. Mark Hipps, Mrs. Clayton Beale, Mrs. Rob ert Tolley, Mrs. Sherman Bushey, and Mrs. George Sizemore. Mrs. Mark Hipps assisted the hostess in serving refreshments. Mr. Hart Baldwin, of Lynchburg was lucky. He won two turkeys at a turkey shooting match at Prospect Saturday evening."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "in serving refreshments. Mr. <mark>Hart</mark> Baldwin, of Lynchburg was"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "in serving refreshments. Mr. <mark>Hart</mark> Baldwin, of Lynchburg was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2350.07, 588.92, 2506.97, 1248.38], "bbox_id": "99ba604981", "file": "AppomattoxNewspapers_1962-1965a_0499.pdf", "page": 1, "text": "William C. Vaughan, president of Appomattox Heritage, an nounced followimg M o ndays meeting of officers and members of the Board of Directors here that no decision had been reachr ed . about producing a . Sound and Light production at Appo mattox National Historical Park. He said that a decision was expected by the Board within the next few weeks. He said the Board was deeply appreciative of the time and efforts expended by National Park Service offic ials who have, met with Appo mattox Heritage. The National Park Service, .ho said, has agreed that Appomat tox . has a story to tell. The Park Service, represented by the national director George B. Hgrt- zog, Jr. Elbert Cox, Regional Director, Richmond C. M. Mar shall, assistant Regional Direc tor, . William Everhart, - Chief of Interpretation, Washington, D.C., and Grover E. Steele, superin tendent of Appomattox National Historical Park, met with Heri tage officers and board here on Sept. 25, and made the follow ing proposition That Heritage should raise Me estimated funds 250,000 and alpo be responsible for publicity and promotion of the Sound-Ugbt show. The National Park Serv ice would btte writers, director, actors, musicians, etc. and weU HjVdwc the h w , and UK1 responsible M r Of a producing staff, ushers,  technicians, etc. Appomattox Heritage. I n c . would continue through the years with publicity and promotion. President Vaughans report of the previous meeting Mr. Hart- zog said that the Park Service might furnish part of the fund for the production if the Appo mattox Heritage promotion fail ed to produce all of the necess ary 250,000  or if the produc tion ran way over the proposed figure. Mr. Vaughan said that Mr. Hartzogs visit here was in the nature of an informal discuss ion, and that the Heritage offic ers and board would continue in their thought on the proposition until the next meeting of the Board set for Thursday, Oct. 15 at Appomattox."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "the previous meeting Mr. <mark>Hart</mark>- zog said that the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "the previous meeting Mr. <mark>Hart</mark>- zog said that the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [658.32, 607.61, 821.87, 930.23], "bbox_id": "919d9b21be", "file": "AppomattoxNewspapers_1912-1915a_0326.pdf", "page": 1, "text": "Will Work For Modern Highway From Bristol To Norfolk. Lynchburg.The Bristol-to-Norfolk Highway Association was formed in a meeting here, in which sixteen coun ties were represented, the object of which is to work for an east to west modern road crossing the State. It was pointed out that practically the entire route is under contract or con templated, excepting between Roanoke and Farmville. The officers chosen were President Henry Roberts, of Bedford county secretary-treasurer, T. T. Cor- with, Lynchburg vice-presidents, Washington county, A. J. Huff Smythe county, John P. Buchanan Wythe county, E. Lee Trinkle Pulaski county, H. T. Trolinger Mont gomery, Dr. S. W. Fletcher Radford, Judge George E. Caswell Roanoke, .T. A. Turner Roanoke City, J. H. Mar- steller Campbell, John T. McKinney Lynchburg, Ernest Williams Appo mattox, S. L. Ferguson Prince Ed ward, J. L. Hart Nottoway, Joseph M. Hunt Dinwiddle, E. S. Hubbs, and Norfolk county, C. P. Shaw. Other eastern counties will have vice-presidents selected later. The convention by resolution commended the proposed highway and calls upon the press of the State to work for it."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Ed ward, J. L. <mark>Hart</mark> Nottoway, Joseph M. Hunt"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Ed ward, J. L. <mark>Hart</mark> Nottoway, Joseph M. Hunt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2104.53, 249.51, 2268.92, 962.71], "bbox_id": "7942035b70", "file": "AppomattoxNewspapers_1912-1915a_0216.pdf", "page": 1, "text": "Will Work For Better Roads. Delegates were appointed by Gover nor Mann to the United States Good Roads Association, to be held at St. Louts, November 13-15, as follows L. J. Kellah, Belle Haven Edward Duncan,. Alexandria J. A. Sydnor, Mannboro J. R. Horseley, Appomat tox H. R. Byrd, Warm Springs C. A. Umbarger, Ceres R. E. Williams, Grundy E. A. Hicks, Evlngton Geo. P. Lyon, Woodford R. H. Wilson, Keysville J. E. Barnett,- Berryville H. P. Smith, Culpeper J. A. French, Clintwood Girard Chambers, Hamp ton R. R. Buckley, Clifton J. W. Elliott, Floyd J. L. Sink, Boone Mill F. E. Snldow, Pearisburg J. A. Kean, Irwin J. W. Malone, McMullen J. W. Johnston, Houston O. N. Nuckols, Rio Vista A. L. Jones, Monterey G. C. Mars ton, Toano R. F. Bland, Cologne W. N. Cundiff, White Stone M. H. Whitmore, Leesburg S. T. Bentley, Ontario T. D. Hudgins, Hay wood R. H. Stubbs, Saluda E. D. Brinkley, Cypress Chapel W. P. Tuns tall, Quinton Samuel Townsend, Townsend A. C. Bevllle, WellviUe M. H. Mayes, Stanley J. H. Warren, Witt J. L. Hart, Farmville J. B. Stone, Back Bay H. L. Trolinger Pulaski J. H. Hare, Newland S. F. Thrasher, Roanoke M. H. Harrison, Island Ford J. M. Quillen Nlckels- vllle J. N. Gass, Broad Ford Dr. T. A. Harris, Spottsylvanla !S. B. Bar ham, Runnymeade D. B. Daniel, Horsepen G. P. Bond, Morrison William Mayo, Coves Point W. P. Cassel, Wytheviile J. G. White, Red Hill E. M. Nettleton, Covington L. F. Jarr, Pedlar Mills John Crosby, Staunton S. F. Patterson, Bedford City E. W. Reynolds, Troutville J. R. Temple, Crichton W. J, Hugert, Buckingham R. E. Cox, Galax J. E. Hubbard, Charles City W. A. Hor ner, R. F. D., South Richmond J. P. Jones, New Castle F. W. Rhodes, Carteraville J. E. Perkins, Church Road George W. Ellis, Lloyd W. N. Tiffany, the Plains M. Snead, Carys- brook B. N. Lockhart, Trone J. N. Stubbs, Woods X Roads C. H. Ed wards, Oldtown W. R. Cato, North Emporia C. S. Luck, Ashland J. F. Gregory, Martinsvlllq J. W. Babb, Windsor W. B. Rose, King George Courthouse W. T. Mooklar, Mango- hick C. D. Fugate, Gibson Station W. T. Meade, Louisa C. E. Twymann, Twymanns Mill 3. W. Wall, Boyd- ton Dr. E. W. Fletcher, Blacksburg M. W. Coleman, Nellya Ford John. A. Codd, Portsmouth C. A. Coppedge, Lillian C. C. Taliaferro, Orange W. W. Spangler, Mayberry R. D. Tuck er, Powhatan A. N. Cocks, Dispu tants J. 7. Synoox, Dumfries J. J. Miller, Washington J. J. L. Kinear, Lexington C. T. Smith, Gardeners L. H. Zlrkle, New Market G. S. Mus- grove, Capron W. T. Payne, Brooke A. J. Hawks, Carson W. T. Turner, Front Royal W. W. Clendennen, Bristol J. L. Addington, Coeburn D. R. Norment, Magruder."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Warren, Witt J. L. <mark>Hart</mark>, Farmville J. B. Stone,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Warren, Witt J. L. <mark>Hart</mark>, Farmville J. B. Stone,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [153.35, 899.69, 486.93, 1761.73], "bbox_id": "0e04b4bc56", "file": "AppomattoxNewspapers_1905-1912a_0308.pdf", "page": 1, "text": "will uot do so this seas in, but will turn their attention to cows and oeam. In my humble opinion they I are making no mistake. 1 kaow the! to -weco crop is called the money I crop of this section of Virgiuia and  And he adds that the public could I yet the exception is to talk with a I not be better served than it is now I farmer who has made a profit rais- being represented bf bis neighbor the w ed. Ami without, profit I and friefid, Mr R. H. Walton, one I wonder is that any mortal man I of the most successful farmers of the 1 8 j10Uia bend to that work. The late county and a citizen of the finest I Lt Dabney, D. D., during type. It is subject of profound I ay he leading divino of the gratification to know how rich the I pregbyterian church, South, was I county is in offioial timber. I want to say that the farmer of Now that we are haying more sun-1 oathside Virginia who grew tobac- shine during the twenty-four hours 1 0Q were the njost atrenuous workers that go to make each day, the coal I  saw on any farn. And there I bill at the electric plant is not so I are others of us who share with the I heavy. Lights ars turned off an L reftt man vho was one of the  hour sooner in the morning and are jclo8tjit of observers, kept back more than an hour in the 1 -jlie ice man has been seen to I afternoon. Some day the Appomat-1 gmie of late anj the aeda fountain  tox may furnish the motive PWCT mau isnt looking ad. and then the coBt will aguin be I materially reduced. The wonder ial Gousin Caroeo is losing 2,000 that the stream hasnt been bar -1 ay because he has some dut in hiB I nessed before now. The force which Uhrott. Some mn certainly can turns onr mill wheels can be made j8tick t0 tbeir New Year resolutions, to give motion to the plant. The town counsel at its last ses-l njrt Canada, we are told, when I sion adopted report of a joint com -1 a jttW j 8 passed its law and its  mittee of the oonucil and citizens of 1 0 beyi-d.  Cant we have recipro- the town and agreed to pay the 0ity of law with Canada? water company the sum of 40,0001 _____ - -------- for their property, the ooutraot to I San Frunciaco is offering a prize I be consummated within forty-five 1 fm an exposition poem. Now days and the money to be paid by I for a boom in ink and typewriters, the first of July next. The voters of I among the near poets. the town will pass upon the question I _____ - ----- on the 18th of April and will no I The new president of the Mis doubt vote the issue of the bonds, jsouria Pacific is required to live in  And the bond issue will be for 65, at. Louis, Even highly lucrative! 008 to cover necessary improvements I ofQcea carry their pen lty. and plans lor extension of the sys -1 ---------   tem. This is happy ending of a vex-1 Corporations at last bae souls. I ed question and every body seems IA p etry Society was incorporated  satisfied. While the arbitrators had n New York the other day. fixed upon  66,000 as the sam the town should pay, the compromise was readily agreed to. This means that Farmville will own and operate all three utilities, water, light and sewer, and under competent man agement they will be profitably operated. A number of householders are asking for the convienees and no doubt all demands will be prom ptly met. And at the Bame session of the counc 1 plans were matured for repaving Main atreet with bit umen, and at the cost of 14,300. This amount will be met without bond issue, The work will he com menced cert inly by the 1st of May, and perhaps by the middle,of April. The company guarantees tbs work for five years and insist that it will live onger than any of us. In the death of Mr. J. 8 . Hart, father of editor Hart, of the Herald Farmville loses a venerable ind venerated citizen. He was a nate"}, "highlight": {"text": {"matched_tokens": ["Hart", "Hart"], "snippet": "of Mr. J. 8 . <mark>Hart</mark>, father of editor <mark>Hart</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart", "Hart"], "snippet": "of Mr. J. 8 . <mark>Hart</mark>, father of editor <mark>Hart</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [606.23, 1730.83, 760.9, 1798.76], "bbox_id": "c02f1bdd94", "file": "AppomattoxNewspapers_1898-1902a_0453.pdf", "page": 1, "text": "White Convict Beaten to Death. Winston-Salem, N. C. Special. The county commissioners passed an order requesting Gov. A ycock,to offer a reward of 200 for the arrest of Pink Fulton, the guard who stands charged with beating Rand Hart, a white con vict, to death."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "charged with beating Rand <mark>Hart</mark>, a white con vict,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "charged with beating Rand <mark>Hart</mark>, a white con vict,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [607.91, 1717.36, 762.34, 1785.18], "bbox_id": "35be1a3a44", "file": "AppomattoxNewspapers_1898-1902a_0454.pdf", "page": 1, "text": "White Convict Beaten to Death.  Winston-Salem, N. C. Special. The county commissioners passed an order requesting Gov. Aycock to offer a reward of 200 for the arrest of Pink Fulton, the guard who stands charged with beating Rand Hart, a white con vict, to death. __________"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "charged with beating Rand <mark>Hart</mark>, a white con vict,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "charged with beating Rand <mark>Hart</mark>, a white con vict,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2227.17, 491.01, 2387.14, 1276.95], "bbox_id": "13865ce1f1", "file": "AppomattoxNewspapers_1915-1918a_0410.pdf", "page": 1, "text": "While a severe eleotrioal storm was in progress one day last week Mr. P. P. Glover vfent to oarry a coat to Charlie Teeter, who was on the mower gutting hay the lad laid the lines down to put his coat on, qnd just then n sudden and loud peal of thunder came, which frightened the horses, ajnd they ran off with the mow er and hung it in a wire fenee, breaking it np quite badly. Fortunately no one was hart for were the horses muoh hurt. Mr. R. D. Hechler, in charge of the road foroes, has Lad shanties built for the hands and one for himself near the George E. Bolton plaoe. j There was a baptising at tylate River Mills, oonduoted by Rev. John J. Spencer, and most of those who made a profession of religion at Bethlehem church during the recent meeting held there were baptised. A party, traveling in, auto mobiles,1 stopped here and-rail ed for goods for which they tendered a Confederate note, gnd going to another store they swiped several buekets of molasses and bottles of coda Cola, while  the salesman was looking in anpther direction. Mr and Mrs. Thomas B .H all have another little girl and her name is Ruth-BlU   New wheat is on tie market and Virginia bag lots quoted St from 1.90 to-2.01  bushel porn has not changed in price and will not be likely toohange before the new crop comes in, if then. The immense orop of Irish potato, is nearly ready to be harvested and prioes have ma terially declined. Mr. James H. Noble died on Saturday, the 14th .after an ill ness of several weeks and he p ru laid to re stb y -th e eid eo f his dutiful wife in the Method ist cemetery. Mr. Noble was a native of Csrllsle. Pa. H e was an honest, good eitisen and m e m b e r of the  Methodist church. Rev, Beall preached at the Baptist church last Sunday mornng and there was a church meeting .after services to- arrange the business of the"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "Fortunately no one was <mark>hart</mark> for were the horses"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "Fortunately no one was <mark>hart</mark> for were the horses"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [987.33, 855.38, 1142.78, 971.63], "bbox_id": "172a4fb3c4", "file": "AppomattoxNewspapers_1902-1905a_0264.pdf", "page": 1, "text": "which troops will be withdrawn on ac count of the exposure of the railroad at these points. That the Japanese will arrive before a thaw permits the construction of defenses is thought here to be practically certain. It would appear also that the authorities expect Port Arthur to be besieged. Sir Robert Hart, director of Chinese imperial maritime customs, after sound ing Russian opinion in the matter, litis ordered the Chinese customs lightship and the channel buoy to be placed at the river mouth as usual. This step, how- the neutraliza-"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "be besieged. Sir Robert <mark>Hart</mark>, director of Chinese imperial"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "be besieged. Sir Robert <mark>Hart</mark>, director of Chinese imperial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1920.51, 683.08, 2086.11, 793.3], "bbox_id": "2ef794a0c6", "file": "AppomattoxNewspapers_1955-1957a_0091.pdf", "page": 1, "text": "WELL, WELL!  Traverse dirty, Mich.- Hart Stuart dropped his new glass fly rod overboard while fishing on Torch Lake last summer and gave it up for lost. However, while ice- skating over 20 feet of water re cently, he spotted the rod. With the help of a companion, he cut a hole and fished it outrod, reel and line."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "WELL!  Traverse dirty, Mich.- <mark>Hart</mark> Stuart dropped his new"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "WELL!  Traverse dirty, Mich.- <mark>Hart</mark> Stuart dropped his new"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1809.59, 392.31, 1977.58, 1828.39], "bbox_id": "69f1438733", "file": "AppomattoxNewspapers_1922-1923a_0465.pdf", "page": 1, "text": "Well, if they will make Bryan President for eight years, when Mr. Rooeevelt8 term expires, they may disfranchise me for life. Roosevelt in the Senate and Bryan in the White House. What a team and they pull so nicely together. Billy points out the way and Teddy just plumbs the track. By the way, your Arvonia writer says the candidates must make themselves understood on the whis key question. That writer has horse sense. The band wagon is up to you, Mr. Candidate, show your colors, or get left. I dont know how it was, Mr. Editor, that your wife should fall in love and marry such an ugly man, but yon are giving us a real good newsy paper. Our people around here think so tooabout the paper not your beauty, as there are abont five to one of any Virginia papers that comes to this office. It is eagerly sought for every Thurs day. Your Buckingham writer ib the first. I dont know how any one so deaf as he can hear so much. Mr. Cary McCraw and Mr. Wm. Shaw were good friends and loved to rig each other. Mr. McCraw was an auctioneer. At one of our county courts he was selling a horsi and a great crowd was around hiui. Mr. Shaw, in the outskirts, said, Hold him up Cary, hold him up, heres a fellow that made a bid, cant you hear?   Yeq, Mr, Mc- Cri w said,  I hear a good many things about you 1 dont want to hear. So it is I suppose with the Buckingham writer, he heats some tilings if he is deaf that he dont want to hear. Anyway we read him first and then turn to the Farmville man and read everything we see from there. The first sweet heart we ever had lived in Farm ville, and we have loved the town ever since. Few are jiow living that were then in mans estatein the fifties. Meade Davidson, Mr. Hart and Charley all I now remember and Ned Erambert of gosling state Sam Paulette and Bob Miler were juat kids they did go in the army and I dont remem ber whether they wore knee pants or not. 1 dont remember the fashions for boys then, I know the women had hoops and my! what big ones some did wear. It is said that one of the boys in Appomattox got a set, or pair, whatever they call them and a long-eared bonnet and raised the sympathy of th. enrolling officer, telling him of her poor husbands sufferiag in the ar my and was left quietly hoeing the trnck patch. Well when we got to talking about women we got clean off Sam, and Bob and the knee pants. The next war I get into I shall wear them. You see a fellow can get to the rear faster. If I had the pen of a reaay writ er like your Farmville man, 1 wonld like so to tell of the old folks. I would go from Mr. Warrens to Jenkins Shop on the west and Hil lards to the foundry on the east of Main. How many hundreds have passed over the river of death since then. Months of Sundays in tne evening did I hear Dr. Wm. Hoge preach Blind Bartimeus by the wayside? I heard he put his ser mons in book form. I have never seen a copy. I have got no bad news to write except Percy Spencers misfortune. I hear his left arm was cat off at the shoulder I dont know the par ticulars. Percy was a good boy, so far as we-know or believe. Stay at home boys on the farm. Intake this old land of ours bloom and blossom like, a garuen. Yes, and one death Was that bad news? I think not from a scriptural standpoint. Bles sed are the meek for they shall in herit the earth, as to what portion and at what time, I will leave that to Bible scholars. Mrs. Virginia Gregory died near Arvonia on the 11th, and was bnritd at the Moses Flood cemetery on the 13th. She was one of the best women I ever knew for over fifty years a member of Bethel Metho dist Chnrch, who lived that many years np to the vows she took at its altar. Her example is worthy of the highest immitation. She did the befit she could at all times, and"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "fifties. Meade Davidson, Mr. <mark>Hart</mark> and Charley all I"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "fifties. Meade Davidson, Mr. <mark>Hart</mark> and Charley all I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.48, 658.43, 1849.9, 808.33], "bbox_id": "25cbc91225", "file": "AppomattoxNewspapers_1954-1955a_0258.pdf", "page": 1, "text": "Weldon, as her grandfather, J. N. W. Smith, was with the forces under Gen. Robert E. Leewhen peace was made here juat ninety years ago. After the Surrender, her grandfather began the long journey to his home and loved ones at Andersonville, South Carolina. He made the entire trip from Appomattox, some four hun dred miles, on foot, except for a lift when he was within twenty miles of home. His daughter, Miss Lena Smith, 80, resides in Hart well, Ga., at the present time."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Smith, 80, resides in <mark>Hart</mark> well, Ga., at the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Smith, 80, resides in <mark>Hart</mark> well, Ga., at the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1911.35, 471.04, 2081.0, 511.54], "bbox_id": "cd870f268b", "file": "AppomattoxNewspapers_1960-1962b_0106.pdf", "page": 1, "text": "Week-end guests in the home of Rev. and Mrs. J. L. Hart were Mrs. J. A. Mosley and Mr. and Mrs. Douglas Powell, of Richmond."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Week-end guests in the home of Rev. and Mrs. J. L. <mark>Hart</mark> were Mrs. J. A. Mosley and Mr. and Mrs. Douglas Powell, of Richmond."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Week-end guests in the home of Rev. and Mrs. J. L. <mark>Hart</mark> were Mrs. J. A. Mosley and Mr. and Mrs. Douglas Powell, of Richmond."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.18, 1442.54, 1629.78, 1461.61], "bbox_id": "3f9a8ebc7d", "file": "AppomattoxNewspapers_1939-1943a_0509.pdf", "page": 1, "text": "Wedn.-Thur. Sept. 2-3 . Ginger Rogers in  ROXIE HART"}, "highlight": {"text": {"matched_tokens": ["HART"], "snippet": "Wedn.-Thur. Sept. 2-3 . Ginger Rogers in  ROXIE <mark>HART</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["HART"], "snippet": "Wedn.-Thur. Sept. 2-3 . Ginger Rogers in  ROXIE <mark>HART</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [597.34, 1208.81, 917.59, 2004.87], "bbox_id": "78c1af37df", "file": "AppomattoxNewspapers_1898-1902a_0302.pdf", "page": 1, "text": "Wedding in Buckingham. W. Htibard, who, after much pel - 1 jie mproing of June 6 a very suasion, made one of his striking i pretty wedding was solemnized at speeches which bristled with tell-  Kalonia, the home of the bride, ing a lidconvincing illustrations of U Buckingham  . l v , b . , ,, ...  . 1 trading parties were Mr. Jas. Hart the infamy of the Republican man- liobertgpn and Miss Mary Coffee agers, and closed with a prediction yioseley.  The parlor was tastefully of the election of Bryan for iresi- j and prettily decorated with ferns dent, Daniel fvr Vice-President, and j aud flowers. At the appointed hour Flood for Congress. The Ligbtfoot mining prope.ty was ottered for sale, and several bids were made upon it. Captain latte- sou, representing some Pennsylvania palties, bid 3,990 cash for it. The property was taken in, and will be offered for sale again at July court. See advertisement in this paper. Among those from a distance who were present we noticed lion. Win. Smith and Wm. Lancaster, Cumber land  F. C. Moon, Lynchburg J. D. Watkins, Farmville H. D. Flood, and A. II. Clement, Appomattox, Superintendent Haynes has lately returned from a pleasant visit to his 1 daughter in West Virginia. Dr. J. B. Nowlin was called to Lynchburg by a telegram announc ing the death of his father in that city. The Doctor came to this vil lage, and took the train for Lynch burg at 140 A. m . ou Tuesday. Many complaints were lodged vs. the postmasters of Buckingham by subscribers of T he T imes , who say that they do not get this papei reg ularly. We trust that the postmas ters will be more careful in future, and render better service to the pat rons of their respective offices. The largest tent-meeting ever yet held at White-Hall is to be held during the month of August. Some big Methodist preachers will assist in the services, and Rev. Mr. Brans- ford, it 18 -said, will again be there. The board of supervisors decided to adveitise for bids for the fire proofing of the clerks office, aud to provide for the better presentation of the county records. See the ad vertisement elsewhere in this paper. Col. J. T. Rogers is trying to ar range for a reunion of the Confed erate veterans of the county, at the Courthouse, some day this summer. A monument is to be erected, and a roster of the veterans published. Mrs. Fisher, the proprietress of the Maysville Hotel, continues to improve that popular and famous old hostelry. Many were the iuquiries as to who is Mrs. Nancy Blubaker. All said that she is doing a good work, and"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "parties were Mr. Jas. <mark>Hart</mark> the infamy of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "parties were Mr. Jas. <mark>Hart</mark> the infamy of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [288.47, 247.01, 440.02, 655.6], "bbox_id": "acd1cd5975", "file": "AppomattoxNewspapers_1962-1965a_0515.pdf", "page": 1, "text": "We were sorry to hear of the death of Little Laura Anne Run- ion, age 3, small daughter of Mr. and Mrs. Hobart Runion, who died Monday morning Oct. 12 and was buried Tuesday after noon in the Pamplin Community  Cemetery here. The Rev. John _L. Hart officiated. Our sympathy is extended to her parents, grandparents and relatives. Mrs. Wilson Fulcher received word Thursday that her mother t was ill and is now in Johnston- 1 Willis Hospital in Richmond. Mr.  and Mrs. Fulcher and Linda mo-  tored to Richmond Friday and returned home Saturday night.!  Miss Mamie Morris, a patient I in the Cobb Nursing Home, was i  taken suddenly ill Saturday aft-  ernoon and was rushed to th e !  Lynchburg General Hospital. Mr. and Mrs. Austin Goode j and family, from Dillwyn, visited Mr. Glenn Riddle, a patient in j the Cobb Nursing Home Sunday I Mr. and Mrs. Millard Slayton, Mr. and Mrs. Claude Slayton a n d ! two children, all of Farmville, I also visited Mr. Charlie Lackjr  in this same home Sunday after-1 i noon.   Mr. and Mrs. Alvis Thompson, j . of Ararat, spent last Wednesday i r with Mr. and Mrs. G. C. Max- i well. Mrs. W. J. Payne was on the sick list for about ten days. She is much better, is the latest re-1 _port. Her son, W. J. Payne, Jr., of Waynesboro, spent the week"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "The Rev. John _L. <mark>Hart</mark> officiated. Our sympathy is"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "The Rev. John _L. <mark>Hart</mark> officiated. Our sympathy is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1337.74, 659.62, 1465.39, 708.92], "bbox_id": "ce59af5ec3", "file": "AppomattoxNewspapers_1922-1923a_0468.pdf", "page": 1, "text": "we iTonlv one of hundreds who Lritten similar letters to-Dr. Hart- one such case as this entitles I? candid consideration of mu?simflariy afflicted. If this be f t h e Sim ony of one  o n wh at P of hundreds"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Lritten similar letters to-Dr. <mark>Hart</mark>- one such case as"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Lritten similar letters to-Dr. <mark>Hart</mark>- one such case as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2058.93, 594.44, 2226.91, 652.14], "bbox_id": "9e0050d620", "file": "AppomattoxNewspapers_1952-1954a_0084.pdf", "page": 1, "text": "We heard that some good reports were given in Government class on types of governments that exist in our world today, by Donald Hart, Jacqueline Lawing, Delores Jones, and Clarabelle Minnifield."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "world today, by Donald <mark>Hart</mark>, Jacqueline Lawing, Delores Jones,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "world today, by Donald <mark>Hart</mark>, Jacqueline Lawing, Delores Jones,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1179.07, 1312.01, 1311.29, 1558.6], "bbox_id": "6885304a4d", "file": "AppomattoxNewspapers_1922-1923a_0414.pdf", "page": 1, "text": "We have every reason to be that what this Concentrated has done, and is doing, for people, it will do for you, pro you will do your part by gM a fair trial which will cost you ing unless results are satisfactory This Concentrated Water Chronic Diseases, because it con 20 different minerals, which adapted to every organ of the h body, and when it is used, these erals replace those which hart caped from the system, thus ca sickness. If we cannot benefit you,  not care for your money. Go to see our local agent, an will give you his personal gn that we will live up to every P we make. 18 oz. bottles 1.00. A teM fnl in glass ot ordinary water, a dose."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "erals replace those which <mark>hart</mark> caped from the system,"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "erals replace those which <mark>hart</mark> caped from the system,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.39, 495.58, 532.63, 882.62], "bbox_id": "5bf0f43620", "file": "AppomattoxNewspapers_1974-1975a_0005.pdf", "page": 1, "text": "We have b een taking a closer look at Central Virginia Tomorrow - A Partnership Process. There is no reason the Process will not work in the Central Virginia Planning District as long as the planners and committee members remember the rural areas in the district. We recently attended a Planning Committee meeting at which a member of the consulting firm, American City Corporation, was present. The repre sentative has performed acts of consultation for Columbia, Md., Hart ford, Conn, and Jacksonville, Fla. among other cities in the U.S. None of the cities mentioned by the consulting representative have an agrarian economy such as we find in the area around Lynchburg, which is the hub of the Central Virginia Planning District Commission. The Process is challenging, but it can overcome the problems it will face if the people involved in its are really committed. The program must con stantly enrich itself by seeking out opinions of residents, all the residents in the area, or it will stagnate. It was with some disappointment that"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "consultation for Columbia, Md., <mark>Hart</mark> ford, Conn, and Jacksonville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "consultation for Columbia, Md., <mark>Hart</mark> ford, Conn, and Jacksonville,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [300.68, 216.98, 463.76, 1117.07], "bbox_id": "e2be7c6577", "file": "AppomattoxNewspapers_1905-1912a_0039.pdf", "page": 1, "text": "we can while the daylight lasts. We cannot follow them when the darkness lias hid the trail. 5 Simon H art made no reply, but the stern, determined look upon Ids coun tenance deepened, telling of the feel ings which animated his breast, and I w he longed to commence the work of avenging his lost ones. Swiftly, yet cautiously, they glided along the trail, while the sun went down behind the western treetops and the shadows of the evening began to gather thickly about them. Crowning an eminence, they could see through the twilight the hollow oak. beneath the branches of which they felt sure of finding the savages. The trail led directly thither, and there was little need of keeping upon it, they thought, so certain were they that they should find there those they sought. The night was come when at length they stood close to it, and saw shining through the trees the light of a camp fire. One portion of their task was over their work of death was soon to begin. Silently they crept nearer and nearer until at last they stood as close to the tree that they could count the savages clustering about the tire. They were seven in number. .Simon Hart was so impatient for his vengeance that lie would have sprung upon them at once, had not his com panion held him hack, and at the same time whispering In his ear  Keep quiet. if you would riot ruin all. W alt until they ore asleep, and then our task will he an easy one, and our vengeance sure. To strike now might ruin all. No one of those red fiends must on any account he suffered to escape. Simon Hart saw that his friend was right. Ho must possess himself with patience ns best he could. As motionless as statues they stood there, with their eyes fixed upon their enemies. Slowly the minutes went by. It seemed that the time for them to  strike would never come. The light of the camp fire grew paler and paler, and at last only a faint glow remained. The savages huddled about it, and to all appenr- nce each and every one was buried n slumber. The hour of vengeance had arrived. Noiselessly the two hunters crept tow- rd tlielr victims. In one hand they cid their rifles and in the other their Knives. A few steps brought them to  he side of the nearest savages. For my wife, my children! ex- rininmed Simon Hart, in a whisper, is lie burled his knfe to the hilt in the lenrt of a savage. The blow of Dick White was no less strong and sure, and two of the sav- nges lay weltering in their gore, their viroer ended forever. So silently end surely had the blows teen struck that neither h.ad uttered so mUch ns a groan. The! comrades still slept on, unsuspicious of the doom impending. rVfter the knives of the avengers were raised, and true to their aim they did the work assigned to them. But three of the savages now rc- nnined.  Another blow for my murdered mes. shouted Simon Ilnrt, in a tone of triumph which rang out like a trumpet through the stillness of the night. The remaining savages sprang to their feet, hut before they could rise and arm in their defense a couple of bullets ended the career of two of them forever. The remaining snvnge turned to flee, but he had hardly quitted his tracks before Simon Uart was upon him, and one blow com- pleld the work of vengeance. For years thereafter the Hollow Oak was known to the settlers of that re gion ns the Tree of Death.New York Weekly."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "seven in number. .Simon <mark>Hart</mark> was so impatient for"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "seven in number. .Simon <mark>Hart</mark> was so impatient for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [298.8, 216.08, 463.49, 1117.88], "bbox_id": "e5e299fd56", "file": "AppomattoxNewspapers_1905-1912a_0038.pdf", "page": 1, "text": "we can -while the daylight lasts. We cannot follow them when the darkness has hid the trail.  Simon Hart made no reply, but the stern, determined look upon his coun tenance deepened, telling of the feel ings which animated his breast, and how lie longed to commence the work of avenging his lost ones. Swiftly, yet cautiously, they glided along the trail, while the sun went down behind the western treetops and the shadows of the evening began to gather thickly about them. Crowning an eminence, they could see through the twilight the hollow oak. beneath the branches of which they felt sure of finding the savages. The trail led directly thither, and there was little need of keeping upon it. they thought, so certain were they that they should find there those they sought. The night was come when at length they stood close to it, and saw shining through the trees the light of a camp fire. One portion of their task was over their work of death was soon to begin. Silently they crept nearer and nearer until at last they stood as close to the tree that they could count the savages clustering about the fire. They were seven in number. Simon Hart was so impatient for his vengeance that he would have sprung upon them at once, had not Ills com panion held him hack, and at the same time whispering in his ear Keep quiet, if you would liot ruin all. Walt until they are asleep, and then our task will he an easy one, and our vengeance sure. To strike now might ruin all. No one of those red fiends must on any account be suffered to escape. Simon Hart saw that his friend was right. lie must possess himself with patience ns host he could. As motionless as statues they stood there, with their eyes fixed upon their enemies. Slowly the minutes went by. It seemed that the time for them to strike would never come. The light of the camp fire grew paler and paler, and at last only a faint glow remained. The savages huddled about it, and to all appear ance each and every one was buried in slumber. The hour of vengeance had arrived, uselessly the two hunters crept tow- u-d their victims. In one hand they  eid their rifles and in the other their nives. A few steps brought them to  tie side of the nearest savages. For my wife, my children! ex- Ialnmed Simon Hurt, lu a whisper, s he burled his knfe to the liilt In the ieurt of a savage. The blow of Dick White was no less trong anil sure, and two c.f the snv- ges lay weltering In their gore, their areer ended forever. So silently end surely had the blows leen squick that neither had uttered o much ns a groan. Tliel comrades tin slept on, unsuspicious of the ioom impending. After the knives of the avengers were raised, and true to their aim they did the work assigned to them. But three of the savages now re mained. Another blow for my murdered ines, shouted Simon Hnrt, in a tone of triumph which rang out like a trumpet through the stillness of the night. The remaining snvnges sprang to their feet, but before they could rise and arm in tlieir defense a couple of bullets ended the career of two of them forever. The remaining savage turned to flee, but lie liad hardly quitted his tracks before Simon Uiirt was upon him, and one blow com- pleid the work of vengeance. For years thereafter the Hollow Oak was known to the settlers of that re gion ns the Tree of Death.New York Weekly."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "hid the trail.  Simon <mark>Hart</mark> made no reply, but"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "hid the trail.  Simon <mark>Hart</mark> made no reply, but"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [517.17, 778.61, 673.8, 1432.0], "bbox_id": "e7ca4ecad6", "file": "AppomattoxNewspapers_1918-1922a_0511.pdf", "page": 1, "text": "Washington.A tentative plan for consolidation of all major American railroads into 19 great competing-sys tems was announced by the Interstate Commerce Commission. The proposed combination, author ized under the transportation act, is designed to remove weaknesses in the national railroad system shown by the operation of the rate-making power of the commission and to effect readjust ment of terminal and other subsidiary facilities, with resultant economy in operation and delivery of shipments. Weak lines which have shown their inability to live under rate schedules profitable to stronger roads would, un der the plan, be attached to systems more advantageously situated, but it was announced that in every case the effort was made to maintain the identi ty of existing strong systems. Hearings will be called by the com mission for the purpose of discussing the- proposed consolidations. Since, under the law, no plan can he adopted which has not been given the approval of the individual lines affected as well as that of the commission, it was ex pected that discussion would be pro longed and that a number of modifi cations from the plan made public to day would be suggested. We have sought to minimize dis memberment of existing lines and sys tems, the commissions announcement said. This tentative plan is put for ward to order to elicit a full record upon which the plan ultimately adopt ed can rest, and without prejudgment. As announced the proposed consoli dations are No. 1.New York Central, including the Cleveland, Cincinnati, Chicago and St. Louis Monongahela Boston and Maine Bangor and Aroostook, and others. No. 2.Pennsylvania, including To ledo, Peoria and Western Long Is land, Monongahela, as an alternative to the inclusion of that road Tnthe New York Central system, and others. No. 3.Baltimore and Ohio Read ing New York, New Haven and Hart ford Lehigh and Hudson and others. No. 4.Chicago and Erie Delaware, Lackawanna and Western Bessemer and Lake Erie Wabash lines east of the Missouri and others. No. 5.Lehigh Valley, New York, Chicago and SL Louis Pittsburgh and West Virginia and others. No. 6.Pere Marquette, Ann Arbor and others. No. 7.New York,, New Haven and Hartford Boston and Maine Bangor and Aroostook Lehigh and Hudson River, all of these being alternatively to be taken into other systems."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "York, New Haven and <mark>Hart</mark> ford Lehigh and Hudson"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "York, New Haven and <mark>Hart</mark> ford Lehigh and Hudson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.43, 266.69, 1831.12, 300.96], "bbox_id": "2db84717a8", "file": "AppomattoxNewspapers_1908-1909a_0435.pdf", "page": 1, "text": "WASHINGTON TO lOSE  TS HISTORIC HART"}, "highlight": {"text": {"matched_tokens": ["HART"], "snippet": "WASHINGTON TO lOSE  TS HISTORIC <mark>HART</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["HART"], "snippet": "WASHINGTON TO lOSE  TS HISTORIC <mark>HART</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1095.35, 567.61, 1252.05, 1149.7], "bbox_id": "2416e00354", "file": "AppomattoxNewspapers_1898-1902a_0321.pdf", "page": 1, "text": "Washington Special.From many sources testimony accumulates to the effect that the foreign legations in Pe kin have been destroyed and their in mates massacred, A dispatch to thè London Daily Mail from Shanghai purports to give, tin the authority of the Shantung Governor, details of the capture of the legations on the night of July 6 and the subse quent massacre of foreigners. Accord ing to this story, the legations suc cumbed only after an all-night attack. The forces of Prince Tuan defeated the regular troops of Prince Ching and of Wang Weng Shao before the foreign ers were slaughtered. Minister Wu has received at Wash ington a dispatch from Shèhg, at Shanghai, saying that a Chinese gen eral was preparing ts bombard thq. for eign legation! in Pekin July 7. A Shanghai dispatch, said tò be official from Chinese sources, says that the le gations had fallen and foreigners had been massacred before the departure from Pekin of a courier July 2. According to a London dispatch. Lady Hart, wife of Sir Robert Hart, Di rector of Imperial Maritime Chinese Customs, has received the following message from her husband, dated July 5 Our people, including the women, are in the legations. Prepare to hear the worst. The only substantial doubt thrown on the story is by Li Hung Chang, Who stated at Canton that several of the legations Wèrè still safe, and that hone of thè minister, éxfcept Vdp Eètteier, has beén killed. The fact that nò two stories agree perfectly as to the date of the massacre tends also to discredit them. Nearly all accounts have come originally from Chinese sources, and it is thought that the dates may have been juggled with. Dispatches from Tientsin tell of stub born fighting between the allies and the Chinese. Admiral Seymour has sent reports to London indicating that the allies are at least holding their own. He says that the foreign garri son has been reinforced by 1500 Ameri cans, presumably including the Ninth Infantry. The powers are said to have reached an agreement as to Chinese policy. They hav .practically given Up hope of saving the legations in Pekiri, and will not make an advance, it is said, until it can be done in overwhelming force. Li Hung Chang, it is stated posi tively, will go to Pekin immediately and try to restore order."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "a London dispatch. Lady <mark>Hart</mark>, wife of Sir Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "a London dispatch. Lady <mark>Hart</mark>, wife of Sir Robert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2199.79, 489.62, 2549.88, 999.8], "bbox_id": "6e7bb1ce20", "file": "AppomattoxNewspapers_1960-1962b_0317.pdf", "page": 1, "text": "Washington, D. C.  Manager Re-lph Houk, of the New York Yonkees, is In a hot seat as he begins the 1861 season. In the first place he follows a manager who was the most colorful, and popular,  in the game. If that were not enough he fol- r lows a manager who tang p a record of winning pennants which will be difficult for anyone to match and the Yankees start out this year as Ameraican League pennant winners of 1961, so in the seasons regular play they have nowhere to go but down. Add Do this the fact that Houk must deoil with players much eloser to his own age, while not - yet having earned the respect Casey Stengel had, and you can see that the new Yankee skipper has his work cut out  Just how strong the New York clnb will be this year is a good question. The strong hlfcting is considered certain - Mantle Maris, Berra, efc. The pitching, how ever, must hold up or the Yankees, with all their power tould be in trouble. It was pitching that almost cost the Yanks the pennant last year. That the strong point of the , challenging Baltimore Oriolee, who  made a fight of it down to Sep tember. Oriily two- tennis seem to much chanee of making a strong Mr. Tommy Ligon and Mias  nuflti onance or mami  a Nor.tan were week-end guests run for the pennant, along with the home of his parents, Mr. andjjfiw York. They are the Chicago Mrs. T. C. Ugon. I white Sox and the Baltimore Orl Miss Charlotte Hart, and Misaoles! Some believe the riole  Miarguerette Johnston, of Rich.f0de a bit this year, hat perhaps mond wer week-end guests in the ! Cleveland or Minnesota will gt home of Rev. and Mrs. J. L. Hart, into the pennant fimht. But at the outt the White Sox Mr. and Mrs. dairlton Wayne Orioles must be given the top and daughter joined ,her brothers  contending role. A1 Lopez is and sisters in,a family reunion  enough reason to put he White their old topme place Sunday. gox jn contention, end he has a"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Baltimore Orl Miss Charlotte <mark>Hart</mark>, and Misaoles! Some believe"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Baltimore Orl Miss Charlotte <mark>Hart</mark>, and Misaoles! Some believe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2210.63, 366.02, 2373.93, 662.31], "bbox_id": "bc66ed542f", "file": "AppomattoxNewspapers_1954-1955a_0087.pdf", "page": 1, "text": "Walker Baldwin, Sept. 4. Mrs. Hattie B. Richardson, Sept. 11 . David Lee Richardson, Sept. 9. Mrs. Edgar A. Baldwin, Jr., Sept. 14. Osben Hart Baldwin, Sept. 30. Shirley Paulett, Sept. 27. Macca Paulett, Sept. 28. Mrs. Charlie Paulett, Sept. 29. Mrs. Claude Jennings, Oct. 4. Mrs. Ida Moore, Oct. 2. William Henry Williamson, Oct, 12 . Mrs. R. E. Wilbun, Oct. 25 Mrs. Ruth Williamson, Oct. 21, Mrs. H. F. Martin, Sept. 28. Mrs. Bobby Mitehell, Oct. 1. Miss Ruby Richardson, Oct. 3. Betty Taylor, Oct. 5. Robert Roach, Oct. 12. Harry Ranson, Oct. 17. Loyd Richardson, Oct. 5, Allen Franklin, Oct. 1. Catherine Ranson, Oct. 28. B. B. Harris, Sr., Oct. 1. Mrs. B. B. Harris, Oct. 5. Mrs Raymond Pettijean, Oct. 7. Pfc. Thomas Franklin, Sept. 25. Mrs. Claude Jennings, Oct. 4."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Jr., Sept. 14. Osben <mark>Hart</mark> Baldwin, Sept. 30. Shirley"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Jr., Sept. 14. Osben <mark>Hart</mark> Baldwin, Sept. 30. Shirley"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2400.25, 610.27, 2572.87, 833.78], "bbox_id": "66737e9ee1", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "W. T. Spencer, with S. W. Ger hart, of Lynchbnrg, will visit his friends and relatives, of this phioiv and Buckingham Oonrt House, where he will spend a oonple  weeks and attend the Assoriatim A grand time is anticipated.  Mrs. E. P. Shepard is viritiqg Bar- . a toga. We are always glad to haty her with n i. - I Saratoga July It! H olt . V IBGIKIA  ià ji In the Clerks OfHoe of the C .. oultOout of the county of BíicilnrMa-n sa the 5 88th ay of June, UBB. . ,  . . . jsSEiaS! joke ThottM. . . . . . . . . . . . . . . . pitortut. . . . ACMiaft í Ids Thomas. . . . . . .       Defendant. The oMot of this suit Is to secure a divo roe, a Tlnoiuo MtrlmoaÜ.  A n tu a a S tH w il! lu boon made and med that the oeféndoat, ïoa Thomas, la not a resident of the S tete 1 ordered that she do days alter due"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "with S. W. Ger <mark>hart</mark>, of Lynchbnrg, will visit"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "with S. W. Ger <mark>hart</mark>, of Lynchbnrg, will visit"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1382.13, 1635.34, 1537.4, 1723.1], "bbox_id": "f01f811ec8", "file": "AppomattoxNewspapers_1898-1902a_0370.pdf", "page": 1, "text": "W o m a n C o m m its 8 u c id o . Keyser, W. Va. Special.Made despondent by the statement of her physician that a wasting illness with which she was affected must sooner or later prove fatal, Mrs. John Fout, wife of a prosperous young fanner of Hart- monsvllle, 15 miles from here, cut her throat from ear to ear with a razor. She had been married but little more than a year. _____________"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "prosperous young fanner of <mark>Hart</mark>- monsvllle, 15 miles from"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "prosperous young fanner of <mark>Hart</mark>- monsvllle, 15 miles from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.3, 1461.05, 1771.18, 1765.3], "bbox_id": "376331f8c8", "file": "AppomattoxNewspapers_1933-1936a_0440.pdf", "page": 1, "text": "W ILLIAM N. MNAIR, the Demo cratic mayor of Pittsburgh, ap peared as a witness before the house ways and means committee and was al most thrown out on his ear. Unable to halt McNairs biting tirade against wasteful spending on the one hand and the proposed new punitive tax on corporation earnings on the oth er, Chairman Robert L. Doughton threatened to call a policeman bodily to evict the mayor. Why all this dignity? shonted Mc Nair. Good night ! A committee clerk brought a police man to the front of the room as the congressmen quickly passed a motion to excuse the witness. McNair said he would leave gladly and departed. U NABLE to raise 3,200,000 to re deem two bond issues reaching maturity, the province of Alberta, Can ada, defaulted. Premier William Aber- hart, leader of the Social Credit party, admitted he conld not get the neces sary funds. In last falls election the Social Credit party won a big victory. One of the planks In Its platform ad vocated the payment of 25 of social credit dividends monthly to every citizen. None of these dividends has been forthcoming as yet."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "defaulted. Premier William Aber- <mark>hart</mark>, leader of the Social"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "defaulted. Premier William Aber- <mark>hart</mark>, leader of the Social"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1056.48, 1593.28, 1211.05, 1880.93], "bbox_id": "36acdbf7ba", "file": "AppomattoxNewspapers_1898-1902a_0293.pdf", "page": 1, "text": "W ild M an C au g h t In W o lf T rap. A wild man was captured in the hills near Plnm Fork a few days ago, He had been seen a number of times by different persons, bnt all efforts to capture him had proved fruitless un til Louis Brown, a farmer, set two of his strongest wolf traps at a cave where the man had been sleeping. He was caught in both traps by the nose and right hand. When Brown found him he was trying to loosen the trap from his nose, bat when he saw Brown he set up a most dismal howl and attempted tc run. He was re leased and oonfined in a stable be longing to William Biee. For several dsye he would not speak, but he was finally induced to talk. He said liis name was Levi Brewer, and that he was raised near Warfield on the Big Sandy. He appears frightened when strangers approach, bnt quiets down when he finds they do not in tend to hart him. His nails on his hands and feet are like the talons of an eagle, and he is completely cov ered with hair. He told the corre spondent that he had supported him self by fishing and catching game with his hands.  Louisville Ky. Courier-Journal."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "not in tend to <mark>hart</mark> him. His nails on"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "not in tend to <mark>hart</mark> him. His nails on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [60.48, 323.44, 434.49, 982.05], "bbox_id": "e59a13e8f7", "file": "AppomattoxNewspapers_1898-1902a_0665.pdf", "page": 1, "text": "W HAT WILL. YOU DO W ITH IT? The Democrats of Appomattox and Buckingham counties should a8semole in mass-meeting at their respective courthouses on May court day and instruct their delegates in the Constitutional Convention how to vote upon the proposition of put ting the new Constitution in force. The Democrats are pledged to sub mit the work of the convention to the people for ratification. What will you do Democrats ? Will you untie their bauds and let them pro claim the Constitution and be done with it, or will you instruct them to submit it to those who will have the right to vote under its provis ions? There are a few who will ask that it be submited to all who have the right of suffrage now- This would be unwi6e and suicidal to our mind. For it is certain that every element touched upon adversely by the new instrument would be against it. No man would vote to disfrauc hise himsdf.no office-holder to abolish his offioe, no corporation to restrict its powers. Either proclaim or submit it to the restricted suffrageeither will do, since we know what the instru ment isthe latter is preferable, becaue of the promise to submit it. Get together aud instruct your members of the Conyentiou. They will meet again on the 22ud of May to voice your sentiments upon this great question. Editor J. L. Hart of the Farm- ville Herald has shown by his re cent rrades edition what a live news paper is to a town of progressive people. It truthfully portroys the progress of the flourishing town and Mr. Harts enterprise will be dollars to Farmville, and her busi ness interests. N No., k Bf. And jyi K- . a"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "question. Editor J. L. <mark>Hart</mark> of the Farm- ville"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "question. Editor J. L. <mark>Hart</mark> of the Farm- ville"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.97, 970.09, 2089.27, 1550.03], "bbox_id": "c4e83a45ac", "file": "AppomattoxNewspapers_1912-1915a_0179.pdf", "page": 1, "text": "W esley C h a p e l. Mr. 8. G. Harvey is on the sick istihis week. The Harveys Gate Ball team crossed bats with Spont Springs oh Saturday last, the score being in favor of Spont Springs. Mr. S. M. Wooldridge bad the misfortune to fall from a load of hay on Wednesday last bnt not seriously hart. Miss Stella Wooldridge returned lome Saturday from a visit to ber onsin, Miss Mary Martin, of Cab Creek. On Friday, July 4th, Mrs. Anna Martin, wife of the late Samuel Martin, departed this life, aged 46 years. Mrs. Martin was a membei of old Rocks Church, and was a faithful ohnstian, and in death was sustained and comforted by His grace. She leaves two children, Mary and Hubert, and mother, Mrs. H. S. Eagles, who is 75 years of age four sisters and one brother, Mrs. Ella Wooldridge, Mrs. Bettie Gaat, Mrs. Lottie Davis and Miss jncy Eagles, and Mr. John Pagh, who will while deeply grieve, re- oice to believe ber at rest in her fathers home. And through di vine mercy they, following her, as she followed Christ, shall some day he reunited with her. We tendgi our sympathy to them. The fune ral took place at her home Saturday if ter noon and was attended by a large crowd of friends,, the floral lfering8 were abundant and beanti ini. The pall-bearers were Messrs, falter Paulette, Chap Harvey, Loyd Lewis, Moody Wooldridge, Walter Thomas, Andrew Roberts, Charlie Taylor and Henry Tolley. Che flower-bearers were her fonr lephews, John, Travis and Wiley Wooldridge and Jnlian Pugh."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "last bnt not seriously <mark>hart</mark>. Miss Stella Wooldridge returned"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "last bnt not seriously <mark>hart</mark>. Miss Stella Wooldridge returned"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2426.12, 395.63, 2625.39, 1638.93], "bbox_id": "2581981805", "file": "AppomattoxNewspapers_1892-1898a_0035.pdf", "page": 1, "text": "W ashington , Jan. 80.Mr. B talÉ ÍPl oould not have a private funeral. Every effort waa made to comply w tih to h et j understood wishes, and with the express-  ed desire of bis family in this regard, but g the surging wave of public interertswrpg  over harriers Imposed and made Ms j private funeral one of tbe M it lM pisiiiifi ive public demonstrations in hierdtvll the dead. Tb Prealdeut and bis Cnbtnet, Justices ot tbe. 8u pre me Ocurt, Senators and Representatives and diplomatic corps was not more significant than tho homage o f the waiting crowd w hltiijlp S respectful silence lined the streets through wnicn tno tunerai cortege, pasted. Tbe  parlor on tbe second floor, where th .  body lay in ite cedar casket, closely sealed,was fairly embioidered with floral tributes. The casket rested on if a H H i bed oí roses, viole to piilp leaves ipy terns, sent by Mi. Emmons Blatn,--! about nine feet long by fear feet wide,,,  tb Sowers artistically giving comblnn-  tion f colors to the design!, the o H m   ttTb parlor was far to small for th distinguished mourners who, by Invita-  tion, sought access to It. Th PregMent, 1 entered, accompanied by Mrs. McKe,  Privat Beertary Baltoid and I. rat. Parker, and the Vice-President jtetom- panted by Mrs. and ire Morton. Mem-  hart of the Uabiuet and many other dto- tlagutobed people followed TiÍÉre- monhto at tb honre were grand ip their Impllplty. Before the hour of ten thp I Invited guetta began,to arrive aud tah I their seats In tb fragrant and floral be- I decked front parior pf the mansion. J Thor er no ahsitf fe served for tbe President and for the lipa family of the deceased. fewmiitotfa.ailiefeleven tjtl,1, ___ era entered and tbe President and nil th .3gH distinguished concourse roe to pay fit-  iff! ting honor and sympalby to tbe sorrow of tiw . deceased, etaietman relartvva,MK The family was .followed by Rev. D r.. Ty  Hamlin, of the Church of  who, standing beside tb basket, in a low  j  ton, delivered the Prebyierian prayer -   for departed souls. As he did so Weller Damrosch touched tno keys Of thepif.n  to a alow dirge, and the torns waa an . S impressive ons. he Immediate mourn-  J era grouped around the casket were tb  f widow, her marti1 d daughter. Mrs. Dnto ?   rosefa Hauls Blame, James G. Blaine, I Mrs. Emmons Blains, Abigail Dodge . I Gull Hamilton Mr. Blaines tocrtw iM M I G. Blaine, Mother of tb dead states- 1 j  I man, and bis wife and daughter Hemp- yare I ton Denman, of Mluouri, cousin of lh.Jj I Blaines, Frank, Henry Horace I gust us Stanwood end WaiterStonera gist, m W. H. Hatch, all nephews of the decease. J  m lex-Secretary.    KmSfWmm I Dr. Hamlin returned tbftnki.to th at by hto power this Ufe wes ended if only that the life oflm mortality might be begun. He beseeched the Atanigbtgr ttifft -11 comfort might oome to every member ot the stricken household, because one thn bad gone out of this life had gone to igiíSj9H mortality. Let tbe consolation that comes  from above fell tenderly end. sweetly f upon tbem. Speak to them words of f l comfort, such as thou alona can teach. This we ask in the name of our 9avtour,,gS amen. v  , mm This completed tbe brief and Impre jjdB live services and the casket was closed n and tenderly borne to the batw! f  Solemnly and in alienoe tire family god  mourning guests left tbe honss, whioh has been so frequently invade by th - 4  angel of death, and the snd V o csretwg  fl wended ita way slowly to church. Outside thehouseth. street ws  I throng with spectators who reverently doff ? air bats as tbe pall bearers d- 1 I posited their sacred burden In tho b ea n  -i I and while the attendants temporarily  I buried it under as many flowere as oould  I be placed thereon. The cortege then .  I started for tho church. Exaotly at 19 oclock slow and solemn   I organ muslo aonounoed the arrival of li the funeral party at Ih door of tbÉ church. As the procession moved  F i3  the stole. Welter Damrosch, Blaines son-in-law, who was at tb organ, played an Improvisation mado np of several . hymns which Blulne loved more than U .  other tnnsiesl numbers. -All present ros and remained standing as tbe foneral. party moved up tbe, sitie. Dr, Hemlln,  the pastor, walked at tbe head ot tb mourners bolding In hto hand M o g H iD book containing tbe ritual of th Pres byterian worship and read, ss he d ! vanoed, selections from the scriptures.  Behind him came tb honorary p r t bearers two abreast, Senators Hale and Frye, representatives of tbe dead mans beloved State, leading tbe wey. body bearers moved wtih measured paoe  towards the chancel rail, wbwe they de- posited the oasket amid a . profusion o f   flowers. The family followed tbe body. I aud took thp front test on the left near  the remains. They knelt with totir ,  I beads bowed in prayer and remained In  I tbit attitude for some time. More 6 1 0 I tent relatives, intimate friends and  I other members of the firaeral party r t  were at the house cam In after tb I family were rested in pew rw ervti ppj I them. When all were seated end ti- deep peals of tbe organ -eased, Dr. Hantte, I lin, rising from hi place In tire PUlP  began tbe oburcb services by fen d tan jc selections from the scripture. Tbehgyl reading fioiibed, prayer whs offered hr.  I Dr. Hamlin. At theolose of the P IM M the funeral proeesston once more lormMl y aud tbe body was conveyed to O tk Hill  cemetery and there laid to rest. ."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "and ire Morton. Mem-  <mark>hart</mark> of the Uabiuet and"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "and ire Morton. Mem-  <mark>hart</mark> of the Uabiuet and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1882.3, 1201.67, 2261.85, 1665.92], "bbox_id": "71967f6b7e", "file": "TimesVirginian_1976_0023.pdf", "page": 1, "text": "w 51 yeaiSÿ Lynchburg Federal wasoood enough for nty papa, ibid good enough ior my Herbert. Now theytdlme  its got to be American Federal AhwelLI guessalittle progress never hart anybody7"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "w 51 yeaiSÿ Lynchburg Federal wasoood enough for nty papa, ibid good enough ior my Herbert. Now theytdlme  its got to be American Federal AhwelLI guessalittle progress never <mark>hart</mark> anybody7"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "w 51 yeaiSÿ Lynchburg Federal wasoood enough for nty papa, ibid good enough ior my Herbert. Now theytdlme  its got to be American Federal AhwelLI guessalittle progress never <mark>hart</mark> anybody7"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [349.69, 458.47, 545.57, 558.92], "bbox_id": "feeb21fb57", "file": "AppomattoxNewspapers_1974-1975a_0149.pdf", "page": 1, "text": "vvBao ijr -mumq H  2 ä j? . gern  r fee fwf tucmutn e w B   t í Hfe tanim W  tac tm y m r Ms am  uterwoi mvyy  y Si -.íJMsíK If- H yr   1  MSWM.UejU1 tfe! 1MK , SWIWHIK. UfM. MC ew 9  k ar. e  i iuBw aia x w ifí -ytn t UmmtCt-rs inartt Um mm i  j .  a t . smw  3 Mt hart m Mvi sß H  M it jm a t"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "t . smw  3 Mt <mark>hart</mark> m Mvi sß H"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "t . smw  3 Mt <mark>hart</mark> m Mvi sß H"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [383.05, 971.46, 531.7, 1228.25], "bbox_id": "dd55c7e559", "file": "AppomattoxNewspapers_1918-1922a_0530.pdf", "page": 1, "text": "Vote for Trinkle, Sauodere West, James, Hart, Johnson Koiner, Adams and Horseley Democratic nominees. The Oid Appomattox Ware house opened up Tuesday with a floor average of 22.49 for the whole sale. R obt . I rby  W. O. M oss , Proprietors Tanlac has b en an unfailing eouice of comfort to millions throughout the length and breadth of this, continent Have you tried it for you troubles? Chus. F. James. Her. aud Mrs. D. P. Rogers, of Amelia C. U., who have been spending a few days with the latters sister, Mre. D. E Caldwell, have returned to their home"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Trinkle, Sauodere West, James, <mark>Hart</mark>, Johnson Koiner, Adams and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Trinkle, Sauodere West, James, <mark>Hart</mark>, Johnson Koiner, Adams and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1892.43, 184.58, 2041.83, 698.05], "bbox_id": "64160d8fac", "file": "AppomattoxNewspapers_1974-1975a_0370.pdf", "page": 1, "text": "Visiting Mr. and Mrs. Burke Smoot last week were Mr. and Mrs. Claude Stinson, from Ohio Mr. and Mrs. Levi  Stinson and Janie, from Maryland Mr. and Mrs.  Herman Johnson, of Clifton I Forge. Mr. Christian Carter has returned home from Emmett Memorial Hospital in Clifton Forge. We hope he will soon be well. Mrs. Emmett Bolton remains I a patient in Lynchburg General Hospital. We hope she will soon feel better. Mrs. Doris Burks is a patient in Lynchburg General Hospital.  Rev. and Mrs. J. N. Williams, Renee, and Cheryl have returned home after visiting relatives in North Carolina and South Carolina. Mr. Wayne Mundy has returned to his home in Baltimore after spending sev eral weeks in the home of his grandmother, Mrs. Belle Mun dy. Mr. Lewis H arris has returned home from the hospital. Visiting him on Sunday were Mr. Charles Morgan, Mr. Joe Megginson, Mrs. Roy Harris and children, Mr. and Mrs. John Spiggle and Mr. Allen Baldwin, Mr. Hart Baldwin. Mr. and Mrs. Tommie Wallace and children, from Lexington, visited Mrs. Wal laces father, Mr. Russell Ragland, who continues ill at his home. We were sorry to hear of the death of Mr. Russell Raglands mother, Mrs. Joseph Ragland of Wingina. We extend deep"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Mr. Allen Baldwin, Mr. <mark>Hart</mark> Baldwin. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Mr. Allen Baldwin, Mr. <mark>Hart</mark> Baldwin. Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1082.9, 1468.7, 1257.84, 1734.59], "bbox_id": "57a04d7f21", "file": "AppomattoxNewspapers_1943-1947a_0590.pdf", "page": 1, "text": "VIRG-NIA In the Clerks Office of the Cir cuit Court 01 Appum-ttox County, on tne lath day 0 . re.ruary, iu-ri. W. .. N _ h and W. C. Aasn, Plain mis Against i-oa Nash, Moses Nash, Moselj Nas , Ena.e Nas.i Mzn.i.art, i . cj ,. Nash Ljno.v., i.....an .usn Car.cn Vtrta Nash and O.h.rs, Deieadanis. The object of this s..it is to ob tain and ha e parrit.on in sum- manner pr.iCiibeu by inv oi t twe tracts t la a ... Appum ... County, own 2 by M  id. ... and Tom N s?, . u .. . jointly. And it appearing by affida.it ill ed that i. d N si Icoses Nash Mosely Na.h, E..d.e Nash Min. hart Ruby Nasi. E.n re, Lillian Nas Carson and Vcrta Na.h, are no. residents of Virgi ia t ey are here by required to appear within ten days after the due publication of"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "Na.h, E..d.e Nash Min. <mark>hart</mark> Ruby Nasi. E.n re,"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "Na.h, E..d.e Nash Min. <mark>hart</mark> Ruby Nasi. E.n re,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [717.88, 348.34, 1231.42, 638.86], "bbox_id": "30f7e8d8a7", "file": "AppomattoxNewspapers_1933-1936a_0439.pdf", "page": 1, "text": "Virginian mounth, Ohio with her husband Rev. Brantley. R . Q . Lawing and f amily the Easter holiday in Petersburg1 with their parents. 1 Miss Lillie Claytor spent Easter in Baltimore. Miss Mildred Hart spent Easter in Petersburg with her aunt. Miss Martha Hamlin, of Lynch burg was the dinner guest Sunday of Mr. and Mrs. Julian Hamlin. Rev. Owens was the Sunday din ner guest of Mr. and Mrs. Douglass Watkins. Miss Ernestine Patterson spent Easter in Lynchburg. Professor E .T . Johnson gave an egg hunt at his school Monday. The burial of John Thornhill was held last Tuesday at the Galilee 1 cemetery. Bennie Pettie, of Promise Land is confined to his bed with pneu monia . Mrs.Paradise has returned home from a visit to New York, Rev. A . E .Jordon was called to Crozet last Thursday to preach the funeral of one of his church deac ons."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "in Baltimore. Miss Mildred <mark>Hart</mark> spent Easter in Petersburg"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "in Baltimore. Miss Mildred <mark>Hart</mark> spent Easter in Petersburg"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1271.48, 580.55, 1424.72, 793.05], "bbox_id": "5b8c07c7f1", "file": "AppomattoxNewspapers_1898-1902a_0683.pdf", "page": 1, "text": "Virginia pCnsihiis. Increase, restora tioji, reissue, c.-Thomas. Taylor, Co hbke 10 Samuel Hart,. National Mill tary H6mc, Elizabeth City, 10 Jeff Porter, Trevilians, 8 Joseph Hogg National Military Home, Elizabeth City 12 William Tracy, National Military Home, Elizabeth City, 12. Original Joel H- Whitehead, Arlington, 6 Rob ert Gleason, Norfolk, 6. War with Spain Louis B. Hill, Manchester, 6 Increase, Restoration Reissue, c.- Calvin MeCignneyj Couftland, 10 Rol ert Newton, National Soldiers Home Elizabeth-City, 10 Samuel Ldndenber- ger, National Soldiers Home, Elizabetl City, 12 Pattie Keeling, Driver, 8 Original War with SpainHenry B Start, Amelia . H., 6 Increase, Res toration, Reissue, c. Philip . Schmidt National Soldiers Home. Elizabeth City, 12 John B. Whiting, Williamsburg, 8  George C. Kellam, Pungoteague, 12 Washington Johnston, Winchester, 8 Thomas Edlin, Spottsylvania.C. H., 12 James Cuffy, Berkley, 6."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Co hbke 10 Samuel <mark>Hart</mark>,. National Mill tary H6mc,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Co hbke 10 Samuel <mark>Hart</mark>,. National Mill tary H6mc,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [969.54, 1069.52, 1144.71, 1789.9], "bbox_id": "76146c1ba4", "file": "AppomattoxNewspapers_1947-1949a_0426.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox, on the 17th day of February, 1949. Courtney Lee Gough Plaintiff vs Annie L. Harris, Nannie Lea Jas per, John A. Lee, David Toney, Fan nie Chambers, Porter Toney, Car bon Chambers, Rebecca Eldridge, Pearl Toney, Gracy Dorsie, Ella Toney, Elizabeth Toney, Florence Merrie, Alma Gene Toney, John Thomas Toney, William Cedi Ton- ey, Chris Smith, address unknown, James Aaron Smith, address un known, Arzie Johnson, John Aaron Dyer, Alexander Dyer, Ampy Dyer, Martin Dyer, Ella Lee, Fannie Ay ers, the unknown heirs at law of George H. Wooding, the unknown devisees and legatees of George H. Wooding, R. Delaware Wooding, Chicago, 111., James Wooding, Chi cago, 111, the unknown heirs at law of Martin Dyer and Others, Defendant. The object of this salt is to con test, question and tost and detar mine the validity of the Will of W E. Lee, which will is dated July 18, 1941, and admitted to probate In the Clerks Office of the Circuit Court of Appomattox County, Feb ruary 20, 1948, and recorded in the said Clerks Office in Will Book No. 2, at page 861, and further to have the Court to declare the above mentioned will is in valid and voil on the grounds of the mental incapacity of the said W. E. Lee. And it appearing by affidavit Sl ed that Annie L. Harris, Nannie Lee Jasper, John A. Lee, David Toney, Fannie Chambers, Porter Toney, Carfien Chamber, Rebecca Eldridge, Pearl Toney, Gracy Dor sie, Ella Toney, Elisabeth Toney, Florence Merrie, Alma Gene Toney, John Thomas Toney, William Cecil Toney, Chris 8mith, address un known, James Aaron, SmHH, ad dress unknown,John Thomas Smith, address unknown, Odfe Chambers. Artie Johnson, John Aaron Dy.r Alexander Dyer, Ampy Dyer. Mar in Dyer. Ells Lee, Fsnn Ayers, Pie l - n o w n Hart at law of George H. Wood! q the Unknown Devisees and Legat.e f Georg II. Wooding, R. Deljvsre Wooding, The Unknown hoi-. w of Martin Dyer, are rot residents of Virginia, or their addressee era un known, they are hereby required to appear within ten days after the due publication of this order and do what is necessary to protect their interests. Teste C. W. Smith, Clerk. 2-24-4 tc"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "n o w n <mark>Hart</mark> at law of George"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "n o w n <mark>Hart</mark> at law of George"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1795.91, 1536.32, 1961.89, 1710.48], "bbox_id": "77ecf8ae33", "file": "AppomattoxNewspapers_1915-1918a_0131.pdf", "page": 1, "text": "veek. Mr. E. W. Gilliam of Bluefield,! h is been spending a few days here  with his home people this week, i Mr. Oba Thornhill and Wife of  h Heights, spent 8unday at the  omeof Mrs. Ella Swan.  Mr Walter Covington of Holly- I wood, who waa so badly hart in a  rn rae runaway last week is im- I ooving very slowly and his con- Idition is at this time considered I -tenons. Mr. Walker CoFman of Ever- greei, who has many relatives"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "who waa so badly <mark>hart</mark> in a  rn rae"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "who waa so badly <mark>hart</mark> in a  rn rae"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2392.3, 1298.24, 2556.55, 1361.43], "bbox_id": "f3968182c0", "file": "AppomattoxNewspapers_1933-1936a_0096.pdf", "page": 1, "text": "vale MONOfw F. DPresident AngeK Yale University, Frealden President Cunem, of WsisfA Woolsey Hart, wherein the Nation a ChM Executive teeehrs hie honorary eegpf from tha Ceeneeocut sehool. 1"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "vale MONOfw F. DPresident AngeK Yale University, Frealden President Cunem, of WsisfA Woolsey <mark>Hart</mark>, wherein the Nation a ChM Executive teeehrs hie honorary eegpf from tha Ceeneeocut sehool. 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "vale MONOfw F. DPresident AngeK Yale University, Frealden President Cunem, of WsisfA Woolsey <mark>Hart</mark>, wherein the Nation a ChM Executive teeehrs hie honorary eegpf from tha Ceeneeocut sehool. 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [330.63, 199.56, 497.27, 1186.05], "bbox_id": "1c72628f16", "file": "AppomattoxNewspapers_1905-1912a_0360.pdf", "page": 1, "text": "vacancy occasioned by the promo tion of Mayor Barrow, Mr. W. M .Duvall was elected president of the body and accepted the honor in a speech redolent of thanks and in which he pledged himselt to a faith ful performance of the new duties No general manager for the town was selected at the meeting, but a committee was named to consider and report what was best to be done under the changed conditions of the town since it lias become the owner of all its utilities. Dr. Gills operated on a young man for appendicitis recently and eight days after the opeiationl went to inquire after his condition and found him out in the garden work ing for dear life. They cant beat tnat record at Richmond, John Hopkins nor in luris itself. The council lias pa-sed an ordi nance which will greatly break in upon a.custom of some of our mer chants who exhibit their goods, er- pecially fruits and such like on Main street. They will only be al lowed three feet for such display and that next to the store building itself. It has been the custom to place th y stands on the outer mar gin of the sidewalk where they could be seen by all passers by. Aud then our swinging signs can only be of the length of three feet and to hang eight feet above the surface. FarmvJle will yet be a city, if not in men at least in manners. Editor Hart is relieved that the election is over aud iiu won out. 1 could never understand why any man wants to be Supervisor, and yet some men do love the work, and of course tnis is well as the work must be done and the man in love with his job is bbst apt to attend to it well. Mr. C. B, Cunningham, who lost out in the race for the clerkship, is as cheerful and courteous as ever, aud the Bame kindly aud generous neighbor and friend. He visits more sick-beds of suffering than any other fi re men in ad Farmville. And after all Jeninie Deane, made immortal by Scott, was right when she said it ie not what we dq lor ourselves but what we do for others that will give ths most comfort when we come to die. The maiden spoke in Scotch, amt I marr her words by repeating them in English, and yet not having the book before me I am afraid to undertake the ori ginal. Jndge Hundley has beeu confined to his bed for some days by a sharp attack, but is better as I write. Dr. Irving enjoyed his visit to Boston, though like all ohers .who go to that city for the first time, was disappointed in the historic Com mons. I suffered like disappoint ment some years ago. And yet, bb some one has well said, doctors . should never lose their  patience nomatter how great the provoca tion or the disappointment. Dr. Anderson is looking forward to his visit to California with genuine hopes of a good time, and the madam will Bhare with him the pleasure of the outing."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "least in manners. Editor <mark>Hart</mark> is relieved that the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "least in manners. Editor <mark>Hart</mark> is relieved that the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [927.59, 1023.36, 1072.78, 1122.46], "bbox_id": "4ac1b4a778", "file": "AppomattoxNewspapers_1902-1905a_0155.pdf", "page": 1, "text": "v s r a m 1 drfld. If Wine of Ci - Mrs. Unrath hart taken  Cardui before her baby came ahe would not have been weakened as she was. Her rapid recovery should commend this great remedy to every expectant mother. Wine of Cardui regulates the menstrua flow. WINE or CARDUI"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "of Ci - Mrs. Unrath <mark>hart</mark> taken  Cardui before her"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "of Ci - Mrs. Unrath <mark>hart</mark> taken  Cardui before her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [316.79, 435.42, 497.14, 1151.02], "bbox_id": "4933d1189d", "file": "AppomattoxNewspapers_1933-1936a_0326.pdf", "page": 1, "text": "v m m By R. Q. Laving The reunion service conducted by the First Baptist church has dem onstrated a great deal of enthusiasm among tihe people of the county and neighboring churches. Each service was well planned and car ried out in a very satisfactory man ner. The pastor, Rev. J. J Washington in his introductory sermon gave the theme and the purpose of the ser vice, i. e. to renew and recreate our fellowship to the church and our Master, Jesus Christ. The theme was beautifully followed through the entire service by each minister. The service closed VWednesday night With Rev. H. H Cabbel, pastor of the Mount Airy Baptist church. The treasury of the First Baptist church was swelled by the sum of 40.00. Appomattox Loes to FarmviHe The Appomattox gangsters play ed their first football game of the season last Friday evening against the FarmviHe eleven, ft he game rer.ted la great deal of .interest among the spectators all the way through. FarmviHe made two touch downs in the first quarter and one m the second Iquarter. After the first half, Appomattox came back, on the field with the spirit of fight. Farmyille did not gain any yards during the third quarter. The last last quarter was hard fought. Ap ppomattox gained the ball in Farm- ville territory and carried it across the field in beautiful manner. Jasper West, .former captainj -11316  a touchdown. The game closed with the score 6 to 18, The game will be returned soon. Pln Farm Exhibit The members of the New Farmer of America organization are getting things in shape for their second farm exhibit at the Training School November 8, Each boy will have a exhibit of his supervised farm pro gram. The public is invited to at-  tend. B rief, end Per.onal. Rev J. . Washington, Rev P W Price and R. Q. Lawing were the dinner guests of Mrs. Anna Dora Johnson last Sunday, Willie Patterson and son, Otis, of Turners Station, Md., Mr. and Mrs Joanah Stewart, of Roanoke, and Mrs. Mason Lewis, of Tower Hill were Sunday visitors of Mrs. Bettie Flood, and their mother, Mrs Lucy Neal Patterson. Louis Ferguson, of Washington, spent the week end with his grand mother, Mrs Mary B. Lewis, of Towerhill. Miss Lillie Clayton has been sick for a few days. Rev. A, E Jordon atteded his church service at Crozet Sunday Rev. F D Yates, of Galilee church Mrs Lucy Stevens, Misses Mildred Hart, Hester Stevens and Lillie Clayton were dinner guests last Sunday in the home of Mrs. Thomas Tibbs."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Lucy Stevens, Misses Mildred <mark>Hart</mark>, Hester Stevens and Lillie"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Lucy Stevens, Misses Mildred <mark>Hart</mark>, Hester Stevens and Lillie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2202.14, 1702.02, 2366.14, 1769.37], "bbox_id": "0c55f288fe", "file": "AppomattoxNewspapers_1912-1915a_0368.pdf", "page": 1, "text": "v internal Revenue Collector Hart has appointed Mrs. Alpha H. Morton, of Lynchburg, deputy collector there. She takes the position of Mrs. Kate Flood, who was killed several weeks ago in an automobile accident Mrs. Morton formerly resided at Bon Air"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "v internal Revenue Collector <mark>Hart</mark> has appointed Mrs. Alpha"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "v internal Revenue Collector <mark>Hart</mark> has appointed Mrs. Alpha"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1256.41, 1307.48, 1415.15, 2014.88], "bbox_id": "4e141947be", "file": "AppomattoxNewspapers_1898-1902a_0321.pdf", "page": 1, "text": "UVVe see in this subject Dorcas, the disci ple, Dorcas the benefactress, Dorcas the lamented, Dorcas the resurrected. If Ì had not seen that word disciple in tny text, I would have known this woman was à Christian. Siich music ns that never came from a heart which is_ti0t chorded and strung by divine grace. BèfOrfe I show you the needlework of this woman I want to show you her regenerated heart, the source of a pure life and of all Christian charities. I wish that the wives and moth ers and daughters and sisters of all the earth yould imitate Dorcas in her discpie- ship. Before vou cross the threshold of the hospital, beforet you enter upon the temptations and trials of to-morrow, I charge you in the name of God and by the turmoil ànd tumult of the judgment day, 0 woman that you attend to the first, last and greatest duty of your lifethe seeking for God and being at peace With Him! When the trumpet shdll sound there will be an uproar and a wreck of mountain and continent, and no human arm can help you. Amid the rising of the dead and amid the boiling of yonder sea and amid the live, leaping thunders of the flying heavens calm and placid will be every womans heart who hath put her trust iu Christcalm notwithstanding all the tu mult, as though the fire in the heavens were only the gildings of an autumnal sun set, as though the awful voices of the sky were but a group of friends bursting through a gateway at even time with laughter and shouting, Dorcas the disci ple! Would God that every Mary and every Martha would this day sit down at the feet of Jesus! Further, we see Dorcas, the benefactress History has told the story of the crown epic poet has sung of the sword the pas toral poet, with his verse full of the redo lence of clover tops and a-rustle with the silk of the corn, has sung the praises ol the plow. I tell you tlie praises of th needle. From the fig leaf robe prepared in the garden of Eden to the last stitch taken on the garment for the poor the needle has wrought wonders of Kindness, generosity and benefaction. It adorned the girdle of the high priest, it fashioned the curtains in the ancient tabernacle, it cushioned the chariots of King Solomon, it provided the robes of Queen Elizabeth, ana in high places and in low places, by the fire of the pioneers back log and un der the flash of the chandelierevery whereit has clothed nakedness, it ha preached the gospel, it has overcome hosts of penury ana want with the war cry of Stitch, stitch, stitch! The operatives have found a livelihood by it, ana through it the mansions of the employer are con structed. Amid the greatest triumphs in all ages and lands I set down the conquests of the needle. I admit its crimes I admit its cruelties. It has had more martyrs than the fire it has punctured the eye it has pierced the side it has struck weakness into the lungs it has sent madness into the brainy it has filled the potters field it has pitched whole armies of the suffer ing into crime and wretchedness and woe. But now that I am talking of Dorcas and her ministries to the poor I shall apeak only of the charities of the needle. This woman was a representative of all those who make garments for the destitute, who knit socks ior the barefooted, who prepare bandages for the lacerated, who fix up boxes of clothing for missionaries, who go into the asylums of the suffering and desti tute bearing that gospel which is sight for the blind and hearing for tlie deaf, and which makes the lame man leap like a hart and brings the dead _ to life, immortal health bounding in their pulses. What a contrast between tbe practical benevolence of this woman and a great deal of the charity of this day! This woman did not spend her time idly plan ning how the poor of the city of Jopoa were to be relieved. She took her needle and relieved them. She was not like those persons who sympathize with imaginary pprrpws and go out, in thttggt aivijaugfl"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "man leap like a <mark>hart</mark> and brings the dead"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "man leap like a <mark>hart</mark> and brings the dead"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [174.23, 355.93, 492.02, 792.58], "bbox_id": "e46f92cde0", "file": "AppomattoxNewspapers_1902-1905a_0453.pdf", "page": 1, "text": "Utica, N. Y. Special. Two irain- Ctnen lost their lives anti a score or more atf passengers .were injured in a wreck on the New York Central Railroad at Whitesboro, three miles west of here. None of the injured was dangerously hart, their wounds being mainly cuts and bruises. The dead are John Allen, engineer, and John Brennen, fireman, of the loco motive on the Western express. As this train was passing the Buffalo special eastbound the boiler of the loco motive of the westbound train exploded. The force of the explosion and the up- Tteavel of the engine threw the entire I drain of 13 cars composing the special from the rails as if it had been a string of toy coaches. The rear Pullmans top- yel into a ditch on the side of the track,  nut the forward cars were hurled into an adjoining field at distances varying from 10 to 40 feet. Several lie tv from the supporting trucks and wheels and plowed deep into snow banks, their ends being demolished by the impact. The westbound train did not leave the track. The knowledge that an accident Jiad happened came to the sleeping pas sengers on this train when the cars stopped with suddenness and a shock which threw the occupants of the berths backward with great force, in some cases tossing them out on the floor. When the extent of the disaster to the east-  bound train became known to the rcs- cners they expected to find many dead I sponsibility rests upon the mnd injured. , Public Safety and other Itigl An hour or more was devoted to ex- cials. ricating passengers from the interior of Mrs. Chadwick refused to sign a pe- tne sleeping cars, but while many were titioti to Governor Pennvpackcr, of bound to be cut and bruised, no one was Pennsylvania, to commute the sentence dead. The work of reaching the passen- of Kate Edwards, sentenced to hang Kers was carried on in a freezing atmos- for the murder of her husband, pherc which benumbed the feet and Johann I loch, held in New York for bands and which caused great distress the Chicago authorities, was identified 0 such of the rescuers as had respond-  -- -  - -  - d only partially clothed. The roar of The explosion awakened nearby residents, who assisted in relieving the imprisoned passengers. Sleighs were procured, and"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "the injured was dangerously <mark>hart</mark>, their wounds being mainly"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "the injured was dangerously <mark>hart</mark>, their wounds being mainly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [617.48, 404.79, 819.1, 605.39], "bbox_id": "761689a454", "file": "AppomattoxNewspapers_1960-1962b_0036.pdf", "page": 1, "text": "Ushering in Holy Week, th e E to n Baptist Church, Pamplin, w ill c e le  brate Jesus Triumphant E n t r y in to Jerusalem, with Palm S u n d ay s e r v  ices at eleven and eight oc lo c k o n Sunday. The pastor, R everend J o h n Leslie Hart, will preach on, th e subjects. Who. Is This T h a t  C o m eth? in the morning, a n d  W h a t Jesus Saw, in the evening. Other services during th e w e e k are a candle-light celebration o f th e Last Supper on, Thursday e v e n in g at eight oclock, and G ood F r id a y service in observance of th e C ru c i fixion also at eight oclock. T h e p u b  lic is invited to all of th e se s e rv ic e s i and the choirs and p astors o f th- I er local churches are b e in g in v ite d to participate."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "o h n Leslie <mark>Hart</mark>, will preach on, th"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "o h n Leslie <mark>Hart</mark>, will preach on, th"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [415.7, 1488.74, 1664.82, 1630.77], "bbox_id": "f8836fc35a", "file": "AppomattoxNewspapers_1908-1909a_0378.pdf", "page": 1, "text": "us more Girl Sues Her Father for 10,000 for W hipping Her Butler, Mo.Charging she suffered humiliation and nervous shock from a whipping administered by her father after returning from a wiener roast. Miss Chloe Ehact, twenty-two, daugh ter of a farmer, filed a,10,000 damage suit against her parent here. As an other result of the whipping the girls mother, Mrs. Nellie Ehart, seeks a divorce from the father, Sylver. V. j E hart The Eharts have been mar ried 30 years."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "Sylver. V. j E <mark>hart</mark> The Eharts have been"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "Sylver. V. j E <mark>hart</mark> The Eharts have been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2363.28, 528.24, 2522.62, 750.14], "bbox_id": "9104a2d400", "file": "AppomattoxNewspapers_1922-1923a_0568.pdf", "page": 1, "text": "US. LIZZIE LOIIll. 1155 W. 13th St.. Iiicago. 111., vrit 1 take pleasure m writing you theae few line, thinking there iiuiy be other women unenng the same es I did.  I hart my complaints for over a year, night tw eala all winter and no appe tite. I was run-dow n so far that I had to sit down to do iny cooking, 1 was so weak. , . ,  I tried many different medicines and doctors also. Nothing seemed to do m any good The doctors wanted to operate h me. v I- .!  At last I wrote to Dr. Hartman. I told him jual exactly bow l waa, and he told me what ailed me and how 1 should take Ieruna. .  I did aa he told .ne for four month and noic I am a ll cured- No one can tell how thankful I,am to him, as l had given up all hopea cf evei getting well again.  1 am a widow and the mother of all small children who depend on my support. I work al day and seldom get tired.  I took live not ties of Ieruna in all. Any woman wishing to know mort about mv caae may. write to me and I will gladly tell all about it. I thank Dr. Hartman for what be hrt . done for me."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "es I did.  I <mark>hart</mark> my complaints for over"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "es I did.  I <mark>hart</mark> my complaints for over"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [385.19, 1040.77, 529.92, 1099.52], "bbox_id": "b63b7aaff7", "file": "AppomattoxNewspapers_1918-1922a_0572.pdf", "page": 1, "text": "Ur James L. Hart, ownet and editor of the Farmvillt Herald died at his home in Farmville yesterday after e long illness."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Ur James L. <mark>Hart</mark>, ownet and editor of the Farmvillt Herald died at his home in Farmville yesterday after e long illness."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Ur James L. <mark>Hart</mark>, ownet and editor of the Farmvillt Herald died at his home in Farmville yesterday after e long illness."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [174.25, 1147.91, 303.05, 1182.86], "bbox_id": "52b1950027", "file": "AppomattoxNewspapers_1926-1933a_0212.pdf", "page": 1, "text": "upt. Harri- Hart Kesigns Positi"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "upt. Harri- <mark>Hart</mark> Kesigns Positi"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "upt. Harri- <mark>Hart</mark> Kesigns Positi"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.21, 492.72, 1581.92, 833.61], "bbox_id": "b4e0ec02bd", "file": "AppomattoxNewspapers_1898-1902a_0689.pdf", "page": 1, "text": "Union, S. C., Special. This place was visited by a terrific tornado. The storm came from the north, and it seems there was also one from the southwest meeting In this vicinity. Four deaths and considerable loss df property resulted. The storm from the north was pre ceded by a heavy rain and what appeared to be a dark mass about 100 yards wide. It traveled with gfeat speed, and people barely had time to get indoors before the storm was upon the town. Knitting Mill hill, south of the town, caught the full force of the tornado, which blew down the schoolhpuse and two residences, converting them literally into kindling wood. The occupants lied from one of the houses before it went to pieces and took refuge in another near by., but this house also was crushed to splinters In this house the Misses Sallie Hart and Annie Lawson were instantly killed. Mrs. Maxev Sims died in an hour and her little daughter Vera died about 9 o clock. It took some time to get the victims from the debris. Every physician in towil was soon upon the scene, also Pres ident Nicholson and Manager Gault, of the Excelsior Knitting Mills, and willing hands assisted in relieving the sufferers as much as possible. Everything that the families had was destroyed. Jonesville reports, in a telegram to Mtss Lawson, the lady that was killed, , that the storm was fearful at that place, and one of her family had been killed there. Miss Lawson was dead when th. telegram arrived."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "house the Misses Sallie <mark>Hart</mark> and Annie Lawson were"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "house the Misses Sallie <mark>Hart</mark> and Annie Lawson were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1660.31, 1202.01, 1823.54, 1497.66], "bbox_id": "26fadc7d38", "file": "AppomattoxNewspapers_1947-1949a_0390.pdf", "page": 1, "text": "Undertaker Buries Car With Mechanic Who Built It MATTOON, ILL.Harvey Wis- hart, who had tinkered with auto mobiles most of his life, was buried with one he made. When Wishart, 68-year-old auto mechanic, died, his undertaker, F. S. Schilling, recalled a visit from him eight years ago. Wishart had brought in his will for Schilling to witness. He asked the undertaker if a car he had built could be used for his tombstone. Schilling said he doubted if this could be done. Well, then, I want it buried with me, Wishart said. So, after Wisharts coffin had been placed in the grave, a 200-pound au tomobile was lowered on top of it. The car was one of three which Wishart had built. Measuring five feet in length and one and a half feet in height, the car had only one seat. Wishart drove it with his feet in a pair of stirrups outside the body. Its one-cylinder motor came from a washing machine. It traveled about 12 miles an hour."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "It MATTOON, ILL.Harvey Wis- <mark>hart</mark>, who had tinkered with"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "It MATTOON, ILL.Harvey Wis- <mark>hart</mark>, who had tinkered with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [349.19, 212.76, 505.69, 363.8], "bbox_id": "0895f2cc0c", "file": "AppomattoxNewspapers_1918-1922a_0529.pdf", "page": 1, "text": "U K N O C itA T U  T IC K E T Election Tuesday, Nov. 8tb, 1921 For Governor B Lee Trlnkie, of V ytbeville. For Lieutenant Governor J Pi West, of Suffolk. For Attorney General J K launders, Middlesex. For secretary of the Commonwealth Ii u James, of Richmond. For 1 reaaurer C A Johnson, of Montgomery. For Superintendent of Public Instruction Harris Hart, of Koanoke. For Commissioner of Agriculture G w Koiner, of Augusta. Por State Corporation Commissioner I i Adams, of Charlotte. For House of Delegates J K Horseley, Appomattox Couuty. John 0. floatwright. Uuckiugtiam County"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "of Public Instruction Harris <mark>Hart</mark>, of Koanoke. For Commissioner"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "of Public Instruction Harris <mark>Hart</mark>, of Koanoke. For Commissioner"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1975.68, 696.92, 2152.03, 1025.18], "bbox_id": "07c1ad5733", "file": "AppomattoxNewspapers_1952-1954a_0224.pdf", "page": 1, "text": "u i i g u t i l i u U u i S u i i C i c n i t  15 the wind, riding off with the table thrown across his saddle. Mrs. Cus ter treasured this souvenir of the surrender and lent it on several occasions to fairs raising money for the Grand Army of the Republic and needy soldiers. It was deposited in the Smithsonian after her dauth. Maj or-General Henry Capehart, i of West Virginia bought the Grant armchair for 10 in gold. Some ! years after the war, General Cape- i hart presented the chair to General r W. W. Blackmer of Massachusetts,  Commander-in-Chief of the Grand . Army of the Republic in 1904, and . at General Blackmars death the 5 chair was placed in the Smithsonian . Institution. The cane-back chair used by General Lee was purchased by Col. E. W. Whitaker. In 1871, Col. Whitaker donated the chair to Post Lyon, G. A. R., Hartford, Connec ticut, as a prize for the most bene fit tickets sold at a Post drive. The chair was Won by Captain Pati lek OFarrell and donated by his widow to the Smithsonian in 1915. The secretary - bookcase, be cause its size precluded its removal as a souvenir, remained in the Mc Lean family and came into posse-"}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "war, General Cape- i <mark>hart</mark> presented the chair to"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "war, General Cape- i <mark>hart</mark> presented the chair to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1455.85, 393.25, 1630.15, 1332.2], "bbox_id": "5cfbcb4087", "file": "AppomattoxNewspapers_1892-1898a_0317.pdf", "page": 1, "text": "Two yawls going from shore at CIncinnat I o a steamer, capsized at the foot of Broad- I way from the swell of a passing steamer, I tnd threw seven men Into the river. Two oi I hem were drownedLouts Johnson and I another whose name Is unkown. ----- William 1 Kelly, of Utica, N. Y., was struck by a vohlcle I tt Santa Barbara, C al, and fatally injured. I ---- The jury In the case of John D. Hart, I Captain John OBrien, Mate Bdward Mur- I phy and Colonel Emilio Nunez, of the steam- I ihlp Bermuda, charged with violation of the I neutrality laws, in aiding and abetting a mil- I itary expedition to Cuba, rendered a sealed I statement of disagreement to Judge Brown I In the United States Circuit Court nt New I York. ----- At Sa .ta Fe, N M., the jury in the I case against JameB Addison Peralta-Rcavts, I charged with attempting to defraud the gov- I jrnment with u allegod Spanish grant cov- I srlng twelve acres of land In Arizona, re. turned a verdict of gnilty ----- Five alleged counterfeiterrs were arrested In St Louis by secret service detectives. ----- Postmaster Samuel A. Lansing, of Bridgeport, N. J ., has been summarily removed for violating tho civil service laws, and will also be presented criminally. ----- Charles Williams, colored, at tempted to murder his wife at Atlantto City and them comml.tod suicide. lie was slight ly demented ----- John L. Spsering, agent ol the Adams Express Company at Easton, P a , . committed suicide by shoot ug himself iu the mouth with a revolver. He was forty-nine years of age ai.d unmarried. Bad health is supposed to bo the cause. Bev. Ronard D Worth, of New York, was divorced in Oklahoma Territory from his wife ----- Benjamin Huff, of Bootjack, lnd., shot his daughter-in-aw and killed hln s ----- The five men comprising the Buck gai g were executed at Fort Smith, Ark. A. W. Barro and others, accused In Tampa, Fla., of filibustering, were discharged. ----- Crezon- 1 zo Merolo was executed at Scranton, Pa., I for the murder of Emanuel Loro. ----- Natalie I Mayser, aged fourteen years, oi New York, a I reader of sensational literature, set fire to a j churchto see the firemen and horses ----- It I is said that the Cla-lc and Contes thread firms have decided to amalgamate. ----- The I work of recovering the bodies of the minors I In the Plttston P a  mine is progrossing rapidly, but it is not believed that any tv LI I be rescued alive. ----- William Jarshutz, con- I victed of manslaughter in shooting and kill- I ing Robert Wilson, colorod, was sentenced to four months imprisonment to the Par sons eounty W. Va. jail. ---- The business men of Charlestown, W. V a , have organized an association for the purpose of inducing j manufacturing enterprises to locate there. ---- Governor MaoCorkie, of West Virginia, has announced himself as a candidate for Vice President on the democratic ticket ---- Mr. Garret A. Hobart, vice-presidential nominee, was the guest of Presidential Con- didate McKinley, at Canton, Ohio. ----- Mr. Albert Hager, republican, was renominated for Congress by ninth Iowa district conven tion. The history committee of the United Con federate Veterans met in Richmond, and de cided to recommend that a monument be erected to the women of the South. The sheriff of Wilmington, Del., seized the gas plant owned by J. Edward Addicks, in that city, who has refusod to pay taxes upon it because it is not in operation ----- Sadie E. McKeen, of New York, committed suicide in a Philadelphia hotel by shooting herself through the heart. ----- An overcrowded pier at Marine Park, Boston, collapse I. and thirty people were thrown Into the water, two of whom were drowned. ---- A number of miners engaged in trying to reach the hundred entombed men in the Twin Shaft, at Piltston, narrowly escaped a similar fate. Water has begun to pour into the slope, and old miners have abandoned all hope of sav ing their comrades who were caught In the cave_ln ----- The rise in West Virginia rivers did great damage to the fields of grain in the valleys.The schooner Norma, from Kodiakuta, arrived at Port Townsnd, Wash., with thirty-five stranded miners aboard, who pronounced Cooks In et min ing boom a fizzle. Over 3,500 miners are at the inlet stranded and unable to obtain em ployment, and supplies are going rapidly. ___ At Newport, Ky., Judge Helm overruled the motion tor a new trial for Alonzo Wall- lDg convicted as an an accomplice of Scott Jackson in the murder of Pearl Bryan."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "case of John D. <mark>Hart</mark>, I Captain John OBrien,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "case of John D. <mark>Hart</mark>, I Captain John OBrien,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1104.95, 429.99, 1256.54, 448.29], "bbox_id": "24a71f6834", "file": "AppomattoxNewspapers_1898-1902a_0472.pdf", "page": 1, "text": "Two Three Killed and One Slightly Hart, Women Hurled Great Distaace."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Two Three Killed and One Slightly <mark>Hart</mark>, Women Hurled Great Distaace."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Two Three Killed and One Slightly <mark>Hart</mark>, Women Hurled Great Distaace."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2214.03, 1323.11, 2399.85, 1395.11], "bbox_id": "feaf855053", "file": "AppomattoxNewspapers_1905-1912a_0332.pdf", "page": 1, "text": "Two more of onr yoanz men, Messrs. Robert Hart and Emmett Whitehead, have left onr neighbor hood for West Virginia. So many and I of the boys are leaving the farms tb e and going elsewhere."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "yoanz men, Messrs. Robert <mark>Hart</mark> and Emmett Whitehead, have"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "yoanz men, Messrs. Robert <mark>Hart</mark> and Emmett Whitehead, have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [682.55, 1708.45, 838.63, 1726.05], "bbox_id": "6b931b3658", "file": "AppomattoxNewspapers_1892-1898a_0321.pdf", "page": 1, "text": "Two Men Killed and Several Others Badly Hart,"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Two Men Killed and Several Others Badly <mark>Hart</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Two Men Killed and Several Others Badly <mark>Hart</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1986.71, 266.69, 2148.61, 420.53], "bbox_id": "533a483b07", "file": "AppomattoxNewspapers_1918-1922a_0054.pdf", "page": 1, "text": "Two gam e publicationsone relating to tidal fisheries laws the other to those of inland fisheries, game and dogshave just been issued by Colonel F Nash Billisoly, Commissioner of Game and Inland Fisheries Lew is H. Maohen, director of t h e Legislative Reference Bureau, compiled the publica tions with the assistance of M D. Hart and Robert T. Gorbell of Colonel B ilisolys staff."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "assistance of M D. <mark>Hart</mark> and Robert T. Gorbell"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "assistance of M D. <mark>Hart</mark> and Robert T. Gorbell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1886.14, 524.73, 2030.49, 670.12], "bbox_id": "d773a58e59", "file": "TimesVirginian_1981a_0205.pdf", "page": 1, "text": "Twenty-two students from the Lynchburg area have been awarded an associate degree from Ferrum College. Among them was Willis Fleshman, son of Mr. and Mrs. Willis Fleshman of Appomattox. The degree was presented by Ferrum College President Joseph T. Hart during May commencement ceremo n i e s. Attorney General of Virginia J. Marshall Coleman presented the commencement address."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "College President Joseph T. <mark>Hart</mark> during May commencement ceremo"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "College President Joseph T. <mark>Hart</mark> during May commencement ceremo"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1272.27, 179.08, 1412.63, 479.71], "bbox_id": "52e04483cf", "file": "AppomattoxNewspapers_1971-1973a_0352.pdf", "page": 1, "text": "turned from a visit to the Tidel water section of Va visitine friends for the past week, she brings greetings from the fol lowing Mesdames Mildred Hart Delaney, Ophelia M. Venable Elaine P. Lambert and Dr J ua ni ta Fisher Strawn and family, aU of Norfolk,  and Hampton, Va. While in Hamp ton, she attended the 102nd annual commencement at Hampton Institute, where one of her former students, Miss Rita Viola Johnson, graduated with honors. Miss Stevens wishes to thank Mrs. Eula P. Johnson for giving her such a wonderful trip to Norfolk, Va. While in Hampton the writer also attended the Installation Services for the Rev. William T. Perkins May 28th, 3 p.m., who is pastor of Third Baptist Church, of which Mrs. Mildred H. Delamey is a member. See you next week I"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "fol lowing Mesdames Mildred <mark>Hart</mark> Delaney, Ophelia M. Venable"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "fol lowing Mesdames Mildred <mark>Hart</mark> Delaney, Ophelia M. Venable"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1545.85, 615.14, 1713.04, 722.34], "bbox_id": "6b7402c151", "file": "AppomattoxNewspapers_1952-1954a_0083.pdf", "page": 1, "text": "Turkey releases this fall will reach an all-time high, Chester F. Phelps, chief of the Commission of Game and Inland Fisheries game division announces. Production at the Cum berland Game Farm, under the man agement of Dennis Hart, has sup plied approximately 4,000 bird! from which the release will be made This is about double last years pro duction."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "man agement of Dennis <mark>Hart</mark>, has sup plied approximately"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "man agement of Dennis <mark>Hart</mark>, has sup plied approximately"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2229.3, 560.61, 2401.05, 1170.47], "bbox_id": "2027856763", "file": "AppomattoxNewspapers_1952-1954a_0385.pdf", "page": 1, "text": "Tuesday of this week, Sunset at Appomattox, a documentary film,, produced in Hollywood, had its pre miere before a blue ribbon list of dignataries in Lynchiburg. Nearly 200 saw the advance showing, and came away thrilled at the splendid reproduction of the events of April 9, 1865 at Appomattox. At a dinner at the Virginian Ho tel preceding the showing, Represen tative W. M. Abbitt was toastmaster. Fred Helsaibeck, vice-mayor of the City of Lynchburg, gave the invoca tion. Distinguished guests, including educators and historians, were intro duced. Major-General U. S. Grant, III, grandson of Ulyssis S. Grant, spoke briefly, praising the peace at Appomattox reuniting the na tion. Rev. Richard H. Lee, a kinsman of R. E. Lee, spoke in the same vein. William A. Hart, director of adver tising, E. I. DuPont Company, pro ducers of Sunset at Appomattox, told the story of how the film, was made. Conrad L. Wirth, Director, National Park Service, thanked the DuPont Company for this documen tary contribution. Sunset at Appomattox will be televised nationally on DuPonts Cavalcade of America program, over ABC network, Tuesday night, Oct. 20. We understand WLVA - TV, in Lynchburg carries this program at 730 P. M. Attending the luncheon and the Premiere ... from Appomattox were r Mr. and Mrs. W. M. Abbitt, Mr. and Mrs. Chas. T. Moses, Judge and Mrs. Joel W. Flood, Mr. and Mrs. H. A. Gurney, Mr. and Mrs. D. T. Robert son, Mr. and Mrs. George Abbitt, Jr. C. W. Smith, Mr. and Mrs. J. A. Burke, Mr. and Mrs. C. T. Moses, Jr. Mrs. Charles Crawley, Mrs. C. M. Stratton, Mr, and Mrs. Calvin H. Robinson, Miss K u li a Ferrell, Mrs. E. Carroll Smith, Mr. and Mrs. J. H. OBrien, G. B. Buchanan, Miss Illah Buchanan, Mrs. J. C. Caldwell, Mr. and Mrs. W. W. Burke, Mr. and T. DeWitt Evans, Mrs. Richard G. Janatka, Garland Plunkett, Mr. and Mrs. David A. Christian, III Rev. B. T. Price, Mrs. J. R. Lawson, Mrs. F. C. Dresser, Mr. and Mrs, Otis P. Dewberry, Mr and Mrs. Carl A. Collins, Jr. Mr. and Mrs. Richard D. Robinson,"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "same vein. William A. <mark>Hart</mark>, director of adver tising,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "same vein. William A. <mark>Hart</mark>, director of adver tising,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [691.46, 449.04, 1090.84, 542.46], "bbox_id": "d1a234477f", "file": "TimesVirginian_1980a_0199.pdf", "page": 1, "text": "TROOPER D. P. BEAMON of the Virginia State Police and Deputy R. W. Baldwin of the Appomattox Sheriffs Department gave a drug presentation recently to fourth grade students in Mrs. Christine Knights class at Appomattox Elementary School. In connection with the Health class, the presentation was given to emphasize the laws and dangers of drugs, a supplement to the class study on drug use and abuse. Students present were Kevin Armentrout, Troy Beil, Van Burke, Terry Guthrie, Phillip Kershner, Joel McCormick Wilbert Steeples, Wayne Williams, Berri Anderson, Karyen Driskill, Jennifer Elder, Susan Hart. Cathy Johnson, Roni Johnson. Tammy Marsh, Apryl Moore, Betty Morgan, Cindy Seamster, Anita Wells, Tracey Woods, and Kim Woods."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Driskill, Jennifer Elder, Susan <mark>Hart</mark>. Cathy Johnson, Roni Johnson."}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Driskill, Jennifer Elder, Susan <mark>Hart</mark>. Cathy Johnson, Roni Johnson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [285.34, 201.49, 455.71, 697.28], "bbox_id": "a2a5db9020", "file": "AppomattoxNewspapers_1905-1912a_0273.pdf", "page": 1, "text": "trolled ihe movements of his own right hand. Faiiu.ille has never before in its history enjoyed such a musical treat. Mr. C. B. Cunningham Inis nn- uounced nis candidacy for the County Clerkship, and has already inaugurated an ..dive canvass for  the positi -n. Mr. Horace Adams, the present incumbent, is also aspir ant for re-election, and others aie spoken of who may yet enter the race. Mr. H. C. Crute, who for a num ber of years was a leading and po pular druggist of Farmville, but who some years since retired from active I usiness, is on the sick list. Dr. Holiaday, of ilampden-Sid- ney, who pronounces the musk-ra among the chief of table luxuries, sent on to Editor Hart recently, who is subjecting it to prescribed liminary treatment before cooking. By the way! he E lito had turnif salad and poached eggs for diun 1 on the same dav in January that the big Democrats of the Nation as sembled in Baltiin-ire to feed oi terrapin and wash it down with Mumma extra. The Virginia Farm Agency, nn der the management of Mr. W. I Smith, has been making recently some good sales of farming and timber lands. All of our real estate dealers arc looking forward to th year hopefully and cheerfully. The libel suit, which was set for bearing at the asb term of our Cir cuit Court has been postponed to the May term."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "sent on to Editor <mark>Hart</mark> recently, who is subjecting"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "sent on to Editor <mark>Hart</mark> recently, who is subjecting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2351.0, 330.53, 2518.73, 665.03], "bbox_id": "4557f31d3c", "file": "AppomattoxNewspapers_1939-1943a_0478.pdf", "page": 1, "text": "Tre marriage of Miss Rosa Elisa beth Martin, daughter of Mr. and Mrs. L. B. Martin of Lynchburg, and Private First Class Richard Dabney Inge, son of Mrs. Mildred Ingi and the late D. R. Inge, of Bsmplin, was celebrated June 9, 1942, at 1100 A M. at the par sonage cf Rocks Baptist Church, Evergreen, Virginia. Kev. C. A. Col tins, Jr., officiated. The bride wore a street dress of sky blue with white accessories. She had a shoulder corsage of swept? hart roses and white stephantpps. Her only jewelry was the locket and bracelet that, belonged to her grand mother and were worn by her grand mother in her wedding in 1871. Private Inge is a graduate of the Pamplin high school and Coynes Electrical School, Chicago. He is at pr. ssnt a Private First Class, in the 116th Infantry of the U. S. Army, and is Stationed at A. P. Hill Mjti tary Reservation, Virginia. .N The bride is a graduate, Glass high school and Rkd Teachers College. For the V Work she has been teaching in App county schools. After a shot ding trip, Private Inge will rtn his duties in the U. S. Army V Mrs. Inge will continue her studh at Farmville State Teacherae Col lege."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "shoulder corsage of swept? <mark>hart</mark> roses and white stephantpps."}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "shoulder corsage of swept? <mark>hart</mark> roses and white stephantpps."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [485.72, 1320.42, 854.86, 1456.12], "bbox_id": "197ae6de8f", "file": "AppomattoxNewspapers_1955-1957a_0438.pdf", "page": 1, "text": "tr. real tfs eor.try lie. Of s w m , tfce iW  basa Vrrti. rrsan rsodem eoBVwdeneea asd fAher new fads, garlgeta s, rd rryrrtaunrnent that rnallAowTi life way ruA hart. On At ether tebfsd, he AerA of the automobile, teLerrv4or. and modem nmvenianta jrwered by electricity hare made it podbie for the Urtsig in mnaU V  a and in. rurai area to hare massy of the tWrxi Auft. frmeriy were available only m Use eiUe, and to enjoy tb rruEfYjr of iwfwity well, A y poojiU w 5 x.j that moat ifma3Mwn peo j, or rural folV, have a wjrt of dijmrty of implifity which la both whole- t. orr.e and refrefdtinsr, and whir w me of the eharaoteriatie trait of the tyirl! American."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "rnallAowTi life way ruA <mark>hart</mark>. On At ether tebfsd,"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "rnallAowTi life way ruA <mark>hart</mark>. On At ether tebfsd,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1683.58, 1700.57, 1845.16, 1781.82], "bbox_id": "888bc92f7a", "file": "AppomattoxNewspapers_1922-1923a_0169.pdf", "page": 1, "text": "Town Clerk in Petticoats. Miss Clara McAlpine, the young daughter of William McAlpine of New Hartford, Conn., and recently a stu dent at the Gilbert preparatory school, is the only woman town clerk in the state, having qualified to act in the absence of F. A. Jewell of New Hart ford, who has gone to Buffalo for an"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "A. Jewell of New <mark>Hart</mark> ford, who has gone"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "A. Jewell of New <mark>Hart</mark> ford, who has gone"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [512.9, 1590.34, 665.31, 1765.19], "bbox_id": "06bf631343", "file": "AppomattoxNewspapers_1902-1905a_0025.pdf", "page": 1, "text": "Tossed Coin for a Bride. About two years ago a Boston beauty was beloved by two men one a lawyer, the other a alergymaa Both had asked her hand but she knew not to which one to give her hart. Accident brought the two to gether at a dinner party and the ldT fiknkly told her swains she could not decide between them, and then with a laugh, she asked If either had a sfv-er quarter In his pocket If M they might toss up aad the winner she would marry. No sooner said than  coin rang down on the tf bi  . ThTlaWTer WOB and she mar rled him. In twelve months he died and recently the ladys friends re celved cards announcing her marrtaae to the minister."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "one to give her <mark>hart</mark>. Accident brought the two"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "one to give her <mark>hart</mark>. Accident brought the two"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1628.37, 1578.04, 1774.87, 1765.63], "bbox_id": "499843d117", "file": "AppomattoxNewspapers_1962-1965a_0431.pdf", "page": 1, "text": "Torrence, Dremia Edm o n d s, Mary Nell Doss MaidensPet- tus Bowling, Debbie Rowe, Mar ty LeGrand, Brenda Bryant, Di ane Williams, Pam Carter. Mrs. J. L. Hart, WMU Super intendent of the Appomattox As sociation, will give the charges to the Queens. Other participat ing in the service will be Mrs. J. M. McAdcn, Intermediate GA Counselor Mrs. Carl Wooldridge Junior GA Counselor Mrs. Ro bert Hubbard, GA Director Mrs A. R. Harwood, Jr., WMU Presi dent. WMU Circles who sponsor Girls Auxiliary this year are Joanna Maiden Circle, Inter mediates, and the Kathleen"}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "Carter. Mrs. J. L. <mark>Hart</mark>, WMU Super intendent of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "Carter. Mrs. J. L. <mark>Hart</mark>, WMU Super intendent of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2217.09, 520.82, 2376.92, 626.27], "bbox_id": "764869ca93", "file": "AppomattoxNewspapers_1892-1898a_0037.pdf", "page": 1, "text": "Toppled Over an Em binM nw t Q uincy , Hto, Feto 3 The caboose of a freight train was derailed by a broken rail and toppled over an embankment 18 feet high. The caboose waa crushed to eplintm and the following persons hurts Charles K. Soule, superintendent of transportation  tha road, rib broken J. B. Dorsey, hart in ternally John Söderström, road master, back and d u st hurt A l Smith, conductor, ankle broken Georg Milter, back hurt T. Downey, hart in hack, and Dr. Hcnsrts, badly braised."}, "highlight": {"text": {"matched_tokens": ["hart"], "snippet": "broken J. B. Dorsey, <mark>hart</mark> in ternally John Söderström,"}}, "highlights": [{"field": "text", "matched_tokens": ["hart"], "snippet": "broken J. B. Dorsey, <mark>hart</mark> in ternally John Söderström,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1883.48, 627.29, 2049.5, 783.94], "bbox_id": "a12e506bf8", "file": "AppomattoxNewspapers_1939-1943a_0526.pdf", "page": 1, "text": "Too Much Civilization Proves Bear Undoing DECKERS, COLO.Quick Silver, a three-year-old bear, dieda vic tim of a desire for civilization. We had to dispose of the young fellow, explained John D. Hart, Colorado game warden. He was going into taverns and other places. Quite friendly. But when they tried to throw him out, he wanted to fight. Earlier in his career Quick Silver was taken higher up into the moun tains but he ambled back to civili zation."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "fellow, explained John D. <mark>Hart</mark>, Colorado game warden. He"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "fellow, explained John D. <mark>Hart</mark>, Colorado game warden. He"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [996.68, 1525.33, 1155.11, 1646.45], "bbox_id": "493a4b3663", "file": "AppomattoxNewspapers_1902-1905a_0440.pdf", "page": 1, "text": "To Mark Railroad Employes. New Haven, Special. Announce ment was made by the management of the New York, New Haven and Hart ford Railroad that a new system of merits and demerits as applied to at taches in the operating department will be adopted early in the present year More than 8,000 employes will be affect ed. By this system a certain number of demerits publicly posted will suffice to cause an offending mans dismissal."}, "highlight": {"text": {"matched_tokens": ["Hart"], "snippet": "York, New Haven and <mark>Hart</mark> ford Railroad that a"}}, "highlights": [{"field": "text", "matched_tokens": ["Hart"], "snippet": "York, New Haven and <mark>Hart</mark> ford Railroad that a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
