{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Henry", "F", "Bocock"], "snippet": "Ferguson. COUNTY CLERKSJohn T. <mark>Bocock</mark>, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, Geo. T. Peers,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Henry", "F", "Bocock"], "snippet": "Ferguson. COUNTY CLERKSJohn T. <mark>Bocock</mark>, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, Geo. T. Peers,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [165.84, 466.23, 312.32, 1762.57], "bbox_id": "0a8502fbfc", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "Palma Let him now take his stand in the front rank of American Heroes. By Maj. Samuel J. Walker - Bartholomew Cyrus the only surviving Revolutionary Sol dier present May his last days behübest. By Bartholomew Cyrus A Revolutionary Soldier - May the feelings which filled the hearts o f the Patriots of the Revolution be justly appreciat ed by the youth of the present day. By Dr. Wm. D. Christian Speedy peace with Mexico continued peace with Great Britian and the world. By Maj. Samuel J. Walker  Gen. Scott and Gen. Gaines The distinguished services of these Generals in the late war, and the blood the one spilt at Lundys Lane and Chippewa, the other at Erie, will protect them against the assualts of President Polk and his Secre tary of War. The American people understand how to estimate these services. By Thomas S. Bocock  Gen Scott We thank him for what be has done for his country and only wish that during the next Presidential term he may take his hasty plate of soup in privacy, without the fear of enemies either in front or rear. By Rkhard Perldiu invited Guest - The County of Appomattox, I hope the hospitality exhibited by her citizens this day Will form a closer alliance with her deserted parents. I was her greatest enemy in war, in peace her best friend. By QBss  Partwood  Henry Claftffie wisp end good May posterity do homage to hie destinguished ability, by implic it acquiescence in the great leading measures of his policy of our Government By Cat Beujamiae P. Walker - John J. Crittenden The unrivalled Orater, accomplish ed Gentleman and able Senator, he deserves the gratitude of his Country for his services on the Oregon Question. By P. B. Pankey - Col. T. H Flood - long the whig tide of Buckingham surely Hot diked by Appomattox. Loci Focoisn. By Capt. J. A. Hamer - General Taylor like a Washing ton and Jackson May he long be remembered by the Ameri can People. By Henry F. Bocock - The ladies  of Appomattox, as patriotic as they are fair. By A. A. LeGrand - The perpetuation of our Republican Government and the just appreciation of the rights of the governed. By G. W. A. Raine - E. J. Goode - Reader of the Declaration of Independence - May a distinction worthy of the intelligence and patriotism of his youth crown his entire manhood with the love and respect of his countrymen. By H. F. Bocock - R. M. T. Hunter A fearless advocate of the rights of the people, regardless of the consequences which may result to himself - May he fill the seat about to be vacated by our distinguished Senator, Wm. S. Archer. By Capt. Thomas W. Johns - Gen. Andrew Jackson The warrior and statesman sleeps with his fathers. His memory will evpr be reversed alike by philanthropists and patriots, his services both in the council chamber and upon the lentel field will be handed down to the latest posterity - and shine as morning lights in his countrys history. By A. A. North - The United States and Texas - Long may this union of the two republics last and long may it continue to disperse its blessing? to the countless millions who in the course of time, are determined to animate its soul. By E. B. le nd - Henry Clay - May his evening sun set as tranquil as was his meridan, bright and luminous. By A, W, Carter - Edmund J. Goode The handsome which he this day delivered, gives us promise of future distinction and usefulness, and"}, "highlight": {"text": {"matched_tokens": ["Henry", "F", "Bocock"], "snippet": "Ameri can People. By <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> - The ladies  of Appomattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "F", "Bocock"], "snippet": "Ameri can People. By <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> - The ladies  of Appomattox,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Henry", "F", "Bocock"], "snippet": "firs clerk, died and <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> his son, was named"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "F", "Bocock"], "snippet": "firs clerk, died and <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> his son, was named"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["Bocock", "Henry", "F", "Bocock"], "snippet": "th court, John T. <mark>Bocock</mark>f the firs clerk, died and <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> his son, was named"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Henry", "F", "Bocock"], "snippet": "th court, John T. <mark>Bocock</mark>f the firs clerk, died and <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> his son, was named"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["Henry", "F", "Bocock"], "snippet": "succeeded by his son, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, who .served until I860,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "F", "Bocock"], "snippet": "succeeded by his son, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, who .served until I860,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.26, 1165.54, 1774.53, 1538.43], "bbox_id": "4f019751ec", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "intment, and he was succeeded by his son, Henry F. Bocock 10 served until July 1860, when he was succeeded by the Ite Geo. T. Peers. The County Court was composed of the Justices of the Bounty, and they selected and appointed their own member- ip, being thus sell-perpetuating. It had jurisdiction over all roads, police matters, probate  fiduciary matters, the trial of misdemeanors and slaves, etc. It fixed the County levy and portioned the same among the white males over 21 years of age. There was also a Court of Sessions which met four imes per year, and a Superior Court which met twice a year, bout which we have no information. At that time there were eight postoffices in the County, and three towns, viz Bent Creek, formerly called Diuguidsville Damplin and Spout Spring. In 1850 a Constitutional Convention was held to revise Bnd re-write the State Constitution. This became effective in uly 1852, and provided for a number of changes in the form Bf County Government, and the new officers elected under it look office. I During these years, all mail and passengers were carried hrough the County by stage coaches, usually drawn by four porses, making regular stops to change horses or for refresh- i"}, "highlight": {"text": {"matched_tokens": ["Henry", "F", "Bocock"], "snippet": "succeeded by his son, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> 10 served until July"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "F", "Bocock"], "snippet": "succeeded by his son, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark> 10 served until July"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.07, 588.56, 2499.2, 1436.07], "bbox_id": "b2e07345fe", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "fty Calvin Robinson Clerk of the Circuit Court of Appomattox County, has submit ted his resignation, effective as of July 15. Smiths resignation was motivated by reasons of health and came with four years remaining in his current term of office. The resignation was submitted to Circuit Court Judge George F. Abbitt. Mr. Smith was bom In Fred erick County, Maryland, son of the late Mr. and Mrs. M. C. Smith. The family moved to Ap pomattox in 1907. He began his distinguished service in the Clerks office Feb. 8, 1908, as a Deputy Clerk under toe late John Rolfe Horsley. He became Clerk in 1919 and was elected to that Office in the fall of that year, and was re-elected, without op position in the county elections Of 1927, 1935, 1943, 1951 and 1959. This is thought to be a record for the State and indicative of the high respect and esteem In which he is held and reflects tribute to the efficiency and high quality of public service render ed. Since its establishment in 18- 45, Appomattox County has had six County Clerks John T. Bo- cock, Henry F. Bocock, Geo. T. Peers, George W. Abbitt, John Rolfe Horsley and Mr. Smith. In addition to his career aa Clerk, Mr. Smith has been most active in community, county and Church affairs. He was one at the drigttler of toe Appomat tox Light it Power Company In 1922. He wrote tf -Charter for the Town of .Appomattox when it was incorporated in 1925. He has served as Vice-President and Chairman of the Board of The Bank of Appomattox. He has served as Chairman of the Official Board of Memorial Methodist Church for 14 years served as Church Treasuer for 30 years. Superintendent of the Church School for 42 years and as a merriber of Monroe Lodge 301 AF  AM, Woodmen of the World and Appomattox L i o n s Club. In October of 1915, he was married to Miss Lucye Cabell Foster, who is an outstanding leader in local civic and church affairs. On toe occasion of the Cenn tennial of the forming of Appo mattox County in 1945, Mr. Smith wrote a splendid history of toe! county, which was widely dis tributed in booklet form. Despite the press of his many duties, he has found time for his favorite hobby, that of gardening, and his flower garden has been a show- place of the community. In World War II he served on the Appomattox Selective Service Board and through the years, Whenever the Community and! county needed the services of this modest and capable leader. The American Cancer Socle tys Appomattox unit will meet he has assumed assignments of Thursday at 730 p.m. at the responsibility. Farmers National Bank. All Mrs. Aldah B. Gordon, Deputy devoted almost an entire issue j board members and volunteers and Mrs. Joel W. Flood, assis- to Appomattox using the subject are urged to attend. I Continued on Page 3 title, Eighty-eight Years Later -- -----------------------------------  ------------------------"}, "highlight": {"text": {"matched_tokens": ["Henry", "F", "Bocock"], "snippet": "John T. Bo- cock, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, Geo. T. Peers, George"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "F", "Bocock"], "snippet": "John T. Bo- cock, <mark>Henry</mark> <mark>F</mark>. <mark>Bocock</mark>, Geo. T. Peers, George"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [527.3, 941.2, 686.45, 1029.08], "bbox_id": "080a1f6548", "file": "AppomattoxNewspapers_1892-1898a_0197.pdf", "page": 1, "text": "T  erk .s Office of the C ircuit C ourt of the county of Buckingham, on the 16th day of Novem ber 1894. Wm. A. Moss. J r in bis docdl Ahti i ni i w ! 8?.m  f pit,ie A. Mosele aoc d., A. . Moss, M. S. M atthews, J. R. Mos adm r. of Wm. A. Moss deed., Daisy A MdSi 1 rank it. Moss and C. F. Moss, the last throe named being infants who sue by A. G. Moss th eir b rother and n ex t frien d ............ plaintiffs AGAINST. Wm. A. Cabell adm r. of N. F. Bocook dnnvi Octavia R. Bocock, Henry iiobs and RosS his F r in k J W it?  h  Bv ? 0Ck- S allic P  hock lb rank  . B ocock ,  ictoria E. Curley in her"}, "highlight": {"text": {"matched_tokens": ["F", "Bocock", "Henry"], "snippet": "adm r. of N. <mark>F</mark>. Bocook dnnvi Octavia R. <mark>Bocock</mark>, <mark>Henry</mark> iiobs and RosS his"}}, "highlights": [{"field": "text", "matched_tokens": ["F", "Bocock", "Henry"], "snippet": "adm r. of N. <mark>F</mark>. Bocook dnnvi Octavia R. <mark>Bocock</mark>, <mark>Henry</mark> iiobs and RosS his"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [536.13, 1099.95, 694.23, 1313.1], "bbox_id": "950b937251", "file": "AppomattoxNewspapers_1892-1898a_0201.pdf", "page": 1, "text": "roe A.G. Mo -.-plaintiff! AGAINST. Wra. A. Cabell aimr. of N. F. Bocock decd. ctavia K. Bocock. Henry Gibbs and Rosa hi ife, John N. F. Bocock. Sallie P. Bocock. rank W. Bocock. Victoria E. Curley in her irn rifrbr and as admr. of James S. A lie eed. Mattie Allen. Ben Shaw Allen, Joh lien and James Allen, the last four name eing infants....................................defendant! The object of this suit is to obtain a deed onveying lots Nos. 5 and 6 in the town of Masille in Buckingham county, Va., tc Wm. A. Moss, Jr., A.G. Moss, M. S. Matthew aisy A. Moss. Frank B. Moss and C. F. Mo hey being the parties entitled thereto. And 3 affidavit having been made and filed that the defendant Frank W. Bocock is not a resi- ent of the State of Vinrinia.it is ordered that e do appear here within fifteen days after ue publication hereof, and do what may be eccssary to protect his interest in this suii And it is further ordered that a copy hereof be published once a week for four successive reeks in the A ppom attox and B uckingham D im es , and that a copy be posted at the front loor of the Court House of this county on the irst day of the next term of the county ourt. A copv T este P. A. F o r bes , Clerk. E. W. H ubard , p. q."}, "highlight": {"text": {"matched_tokens": ["F", "Bocock", "Bocock"], "snippet": "Cabell aimr. of N. <mark>F</mark>. <mark>Bocock</mark> decd. ctavia K. <mark>Bocock</mark>. Henry Gibbs and Rosa hi"}}, "highlights": [{"field": "text", "matched_tokens": ["F", "Bocock", "Bocock"], "snippet": "Cabell aimr. of N. <mark>F</mark>. <mark>Bocock</mark> decd. ctavia K. <mark>Bocock</mark>. Henry Gibbs and Rosa hi"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [518.11, 1079.11, 689.02, 1579.29], "bbox_id": "86e832fe62", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "PRIVATES. Abbett Geo. Dallas Alvis Ed ward, died in hospital at Mt. Jack- son, 1862 Alvis Wm. M., wounded Bagby Luke, discharged Banton James Bell Wyatt H . Bingham, Jno. S., discharged Bocock, Jno, T., deserted in December 1863 Bragg, Jno. J., transferred Bran ham, George W., from Albemarle county Brown, C. C. Carson, Jno, J. Carson, M. J. Carson M. W. j Cawthorn, Hudson  Cheatham, R, H., wounded at 2nd Manassas, Sept. 22nd 1862 Chick, J. J., captured wounded at Hanes Shop, May 28th, 1864 Chick, E. A . Clock, Cotton  Clock, William Clarke Henry Clarke William Coleman Drury  Coleman Henry, died in hospital Coleman, J. A., captured at Toms Brook, Oct. 9th, 1864 Colemtn Madison Coleman, Schuyler, died pt home 1862 Connelly, Warner Geo. Conner Allen, discharged lb overage Crawley, Richd, trans ferred  Crenshaw, Jno J., captured u Ilanes Shop. May 28th, 1864. Crumby, Frank, died in hospital in Richmond 1862 Davidson Jas II., died Diggs, John Doss, Jos. E. Dunn,put in substitute Elliott, Jno W. died at home in service Elli ott, Thos. wounded at Toms. Brook, Oct. 9th, 1864 Featherston, Jas. H. detailed with Hills, A. P. Signal j corps Ferbush, Henry discharged f Furbush, J. D. killed at Fort Ken- i"}, "highlight": {"text": {"matched_tokens": ["Henry", "f"], "snippet": "Signal j corps Ferbush, <mark>Henry</mark> discharged <mark>f</mark> Furbush, J. D. killed"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "f"], "snippet": "Signal j corps Ferbush, <mark>Henry</mark> discharged <mark>f</mark> Furbush, J. D. killed"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1402.29, 1168.59, 1510.38, 1373.16], "bbox_id": "1058339b5a", "file": "AppomattoxNewspapers_1955-1957a_0219.pdf", "page": 1, "text": "United States Congressmen . within five miles of the McLean House at Old Ap- r  notber spot able to b claim? The four were r Bcck, the statesman of Lf crossroads next to old  Bocock was a member i j? nd came within one . mii  named Speaker just He was then named Confederate Con- FjT  second, was Henry i i o f i eminent political Aff f T n of the House Wor n ommittee at the H War L And- third, Hood served out an un- rm for the old Tenth . And- fourth, the l Representative, Watkins"}, "highlight": {"text": {"matched_tokens": ["Henry", "f"], "snippet": "Con- FjT  second, was <mark>Henry</mark> i i o <mark>f</mark> i eminent political Aff"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "f"], "snippet": "Con- FjT  second, was <mark>Henry</mark> i i o <mark>f</mark> i eminent political Aff"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.98, 1005.26, 1974.4, 1089.91], "bbox_id": "08e871afe9", "file": "AppomattoxNewspapers_1962-1965a_0609.pdf", "page": 1, "text": "The -Reverend Walker Bocock Education of , the First, PreJjy- Healy, D.D., pastor of the F irst fcerian Church in Houston, Tex., Presbyterian. Church in Roanoke, and as Pastor in Monticello, and great - greandson of Henry  Arkansas and Hot Springs, Va- Flood Bocock, first clerk of Ap- j and pastor of the First Presby- drtailTbutW what! Pomattox county and builder of terian Church in Fayetteville N. details about w h a t  house in which the Park su- C., before coming to the First perintendent now resides, will be i Church in Roanoke eight years the speaker at the Peace Serv-I The Appomattox County Min-"}, "highlight": {"text": {"matched_tokens": ["Henry", "Bocock"], "snippet": "and great - greandson of <mark>Henry</mark>  Arkansas and Hot Springs, Va- Flood <mark>Bocock</mark>, first clerk of Ap-"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Bocock"], "snippet": "and great - greandson of <mark>Henry</mark>  Arkansas and Hot Springs, Va- Flood <mark>Bocock</mark>, first clerk of Ap-"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [208.08, 1270.8, 710.81, 1703.69], "bbox_id": "6faeb5f74c", "file": "AppomattoxNewspapers_1915-1918a_0560.pdf", "page": 1, "text": "p wi i 1  H 1 í i 30 Amos Lee Cress Pamplin 20 39 Chas. A. Bocock Vera 21 ujb 25 William Price Martin Appomattox 22 B  g te  12 Lyle Foster Caldwell Spout 8pring 23 ppnd no J R j Jf!j B  1 34 Henry Augustus Tames Appomattox 24 i   , m m t i 2 John McCartney Scott Appomattox 25 S r i a B ! IB B i, 1 46 Add Alvis Washing Branch Pamplin 26 fyiEOcl l A H H j l l p l l 8 Frank Obey Covington Hollywood 27 sjmgii c H lfí Í 2 n lr f  ü 40 George Ferguson Vera 28 1 38 Clarence Fletcher Moore Oakville 29 H n oB fii 7 Bennett Harding Beckham 30 foTphn dMfi  27 Durward Belmont Thomas Appomattox 31 Hoft w sH BF VjL- 1 James R. Alvis Spout Bpring 32 HM. ohH  52 Lucius Ashton Harrison Appomattox 33 D i i H .  jal a 6 Charles Reames Morris Concord Depot 34 24 Doctor Connie Baldwin Evergreen 35  4 j 14 Clarence Burnett Simmons Evergreen 36 19 Silas Paul Cawthon Vera 37 Hem H . 11 j 37 James Leonard Blackwell Appomattox 38 B r K.v 36 Geo. Wesley Tolley Evergreen 89 1 Jff i . 1 BBBBj h yl Vc.-i y  44 Junius D ud gee Spout 8pring 40 16 Jesse Peyton Harvey Evergreen 41 ftSflrai RS 26 Nick Burrell Pamplin 42 IpfMilwjB y Si 31 Allen Howard Mayberry Appomattox 43 B  i H I i B I B K i 63 John Henry Stephens Appomattox 44 43 Thomas Doss Spout Spring 45 23 Melvin Davis Childers Vera 46 H r 22 Joseph Rufus Burnett Stapleton 47 21 Thomas Tyndal Pugh Appomattox 48 IVeg 50 Walter Day Bent Creek 49 É É p ?fl 47 Ossie Watson Evergreen 50 P aaH HpODt jtff -T Jifííg i   Es 9 Emmett Mott Perdieu Spout Spring 61 20 William Ernest Layne Spout Spring 52 H P f  5 Ernest Wightman Harwood Pamplin 63 42 Nelson Harris Spout Spring 54 L ocal B oard A ppomattox C ounty ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [346.59, 300.51, 523.09, 1763.43], "bbox_id": "f490ffaac6", "file": "AppomattoxNewspapers_1902-1905a_0217.pdf", "page": 1, "text": "l ii i c k i i iK h a i i i. At a largely attended mass-meet ing B. F. Nuckola was nmde chair man and _ P. Grigg, secretary. Fhe object of the meeting was the adoption of the resolutions printed below, bidding fuiewdl to tbe old County Court system, and the strong ndorsement of Judve Moss, as a Tair and impartial judge, who has -irerided over the court for the past twelve .rars. Col. Kobt. T. Hub bard. Hon. E. W. Hubbard, A. P. Grigg and others spoke feelingly to the resolution and Judge A. 8. Hall, while not opposing the resolution, -aid he was glad the constitution bad abolished the Conntv Court -ysteni. The resolution was adopt ed, and the Messrs. Hubbard and Col. James Lyons were appointed a committee to inform Judge Moss of I - he action of the meeting, and the Judge came forwa-d and in a few well chosen remarks thanked the bar and the meeting for the expres sions of confidence and esteemed the resolutions contained. Whereas our English ancestors rod their decendants in America have for nearly a thousand years had i court of tbe shire, or county court for hearing and determining the minor controversies of the people, a court especially intended for the masses of small means to save them from journeys and heavy expense, nd whereas such local tribunal is t great convenience to them and either it or some substitute will be necessary for letting to bail, ap pointment of guardians and person- 1 representatives, probate of wills tnd etc., therefore Resolved, by this mass-meeting  -f citizens of Buckingham county, held at this December connty court, 1903, that we regret the change in the, constitution abolishing this court. 2nd.  That in severing our rela tions with the incumbent, Judge John R. Moss, we bear cheerful testimony to tbe intelligence, integ rity, ability and dignity with which he has discharged the duties of County Judge, and in his retire ment will carry with him our best i wishes for bis wellfare. 3rd. That these proceedings be certified to the County Court with the request that they be entered on I the minutes of the Court. Jndge Moss will tender his resig nation as Connty Judge of Buck ingham as soon as the present term is adjourned, and will assume his duties in the Legislature the first of the year. Governor Montague! will be requested to appoint Jndge Crute, of Farmville, to hold the I January term. In the Court the only case of any importance was that of J. A. Le- Sneur  Bro., applicants for liquor license at lpha, which was opposed by a large petition to the Judge, ask ing that license be not granted. The Jndge continued the case, and ren dered an opinion, in which he said he had rather the new Court would pais upon the application for . li cense when there is objection. J. A. Trent ws granted  license to sell liquor near Arvonia, there being no opposition to him. Peter Coles, of Albemarle, and Mr. Addie Spencer were hunting at New Store last week. They were! the guests of Mr. L. D. Jones. Mr. J, W. Word has been ap- to the position of store keeper for the National Government at a salary of 2 per day. It iB said Mr. Wiley Hubbard will be married on the 16th to a Miss Sims. Marriage licenses have been is sued during the month as follows Jas. P. Andrews to Emma Lang- horn Gantt, J. E. Pnrvis to Mary E. Miles. Mr. Henry Glencrossi Hebditch to Mies Ora Kyle Spen- oer, at Enon church on December 23rd at noon. The young lady is a daughter of Willis Bocock Spencer, and the groom to be is a son of Mr. J. W. Hebditch. I Justice Garnett held a trial Mon-1 day night, and fined Isiah Moss 5 1 and cost for swearing upon the i.reet, and placed him under a peace bond of 200. Mr. William Spencer, is perhaps, the happiest travelling man who represents a Lynchburg house. He sold for the Quin-Marshall Co., in about eleven months time 100,000 in drygoods and notions. When this fact was reported to Mr. Spen cer, he promptly served notice ou his employers that he had a vaca tion due him. His request was granted and for two weeks be has been the guest of his brother, Mr. Sidney Spencer, down in old Buck- iugham, where he has made many a fleety buck bite the dost before his unerring aim. December 15, 1903."}, "highlight": {"text": {"matched_tokens": ["F"], "snippet": "attended mass-meet ing B. <mark>F</mark>. Nuckola was nmde chair"}}, "highlights": [{"field": "text", "matched_tokens": ["F"], "snippet": "attended mass-meet ing B. <mark>F</mark>. Nuckola was nmde chair"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [978.51, 362.72, 1150.09, 1159.19], "bbox_id": "fd6e710fa1", "file": "AppomattoxNewspapers_1952-1954a_0564.pdf", "page": 1, "text": "j TEXAS LADY DESIRES DATA ON HER FAMILY TREE Dallas, Texas April 2-1, 1954 j Editor, Times-Virginian, Appomattox, Virginia Dear Sir Recently I had a clipping given me from your paper. It was given I me by a friend, who husband has a I brother living in Appomattox. They had written him sometime back and  asked him if he knew Judge Joel W.  Flood, who is a family connection of I mine. So he had sent them this clip ping from the paper of February I 25th. entitled, Father Darkleaf by c. h. r. I enjoyed it so very much, and thought I would write you and see if you might have some information from the early editions of your pa per, which might be of interest to me about the members of my fam ily who lived in Appomattox in the early days. My ancestors who lived there were Samuel Bocock, the home place was called, Wildway, which was half way between Bent Creek and Vera, Virginia, from material I have that my uncle, the late Charles Henry Buchanan, had sent my mother. He said that in 1934 it was owned by J. S. Kinney, Rt. 3, Appomattox, Va. Then I wondered if there was a Thomas family who lived there in those early days, whose daughter, Judith married Capt. John Bocock. This must have been around 17 hun dred and something. I cant put my hands on my data which has the dates on it, right now, anyway, the son of the above, John Thomas Bo cock married Mary Flood, and I be lieve the Flood family lived there also. One of the Floods married a Mary Fuqua, it was either John or Thomas. I have information which says one and then the other. I am most anxious to locate information on the Fuqua family, and to straight en out about which one of the Flood family is my ancestor. Judge Flood wrote me that it was John Flood II, and I feel sure he is correct. John Thomas Bocock and Mary Flood Bocock were the parents of my grandmother Mary Flood Bocock who married January 1, 1854 in Ap pomattox Appomattox Court House Virginia, John Rice Buchanan of Rockbridge County, Virginia. My mother, Mary Flood Buchanan was their daughter. I shall appreciate it very much if you could send me some material on these ancestors of mine. I know a great deal about the Bocock line, but you might have some material I do not have. If you do not have any records about them in your early file, you might be able to give me the name and address of some one who may be able to give me some. f Most sincerely, Frances Hall McCracken, note We will be glad to give the ftwuiwa y i iUvurttwKSii  any of our readers who may wish to write her regarding the above."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "lived there were Samuel <mark>Bocock</mark>, the home place was"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "lived there were Samuel <mark>Bocock</mark>, the home place was"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "that time T. S. <mark>Bocock</mark>, Tower Hill J . P."}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "that time T. S. <mark>Bocock</mark>, Tower Hill J . P."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.71, 709.14, 2272.52, 1337.46], "bbox_id": "a2b52e6266", "file": "AppomattoxNewspapers_1915-1918a_0552.pdf", "page": 1, "text": "e r g r e e n . William Prioe Martin, Apf .0 mattox. Niok Burrell, Pamplin, R F D 1. Durward Belmont Thomas, Appomattox. Josiah Foster Watson, Vera. James Harry Leiris,Pamplin.  Amos Lee Cross, Pamplin. Allan Howard Mayberry, Ap pomattox. Lovester Lloyd Ferguson, Ap pomattox. William Andrew Gilbert, Ap pomattox. Henry Augustus Turnes, Ap pomattox. Clarenoe McClellan Evans, Evergreen, Va. Geo. Wesley Tolley, Ever green. James Leonard Blackwell, Appomattox. Clarence Fletcher Moore, Oakville. Edword Hall Moore, Appo mattox. George Ferguson, oolored, Ve ra.  Thomas Lee Kelso, colored, Vera. Nelson Harris, colored, Spout Spring. Thomas Doss, colored, Spout Spring. Junius Dungee, colored,8pout Spring. Pittman Wright, oolored, Ap pomattox. Add D o w r y Washington Brown, oolored, HurtsvUle. Ossie Watson, oolored, Ever green. Jnlian Walter Jones, oolored, Oakville. Charles A. Bocock, oolored, Vera. Walter Day, oolored, Bent Creek. Walker Clarenoe Doss, Appo mattox. Lucius Ashton Harrison, Ap pomattox."}, "highlight": {"text": {"matched_tokens": ["F"], "snippet": "Niok Burrell, Pamplin, R <mark>F</mark> D 1. Durward Belmont"}}, "highlights": [{"field": "text", "matched_tokens": ["F"], "snippet": "Niok Burrell, Pamplin, R <mark>F</mark> D 1. Durward Belmont"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.53, 267.4, 1773.18, 1764.4], "bbox_id": "d1f7f47b98", "file": "AppomattoxNewspapers_1902-1905a_0454.pdf", "page": 1, "text": "acres, exchange. C. E. Lewis to,Nel8on Bocock 53 acres, exchange and 117. C. H. iSarkill, comr to Crawford H. Going, 280 acres, 240. R. B. Cralle c.. trustees to Farm ville Bldg.  Tr. Co., 26 acres, 125. Reuben Brown to J. B. Shearer, 12 acres, 250. E. W. Gilliam, c. to H. E. Gil liam, 319 acres, 10Q0. J W. Flood c. to T. B. Scruggs, 54 acres, 126. T. B. Scruggs to W. D. Sandidge, 202 acies, 600. W. J . Martin to T. W. Oder And Robt. Irvey, 3 acres, 135. Altert Thornhills Heirs to Thos. Chambers, 158 acres 400. Madison Cyrus to O. S. Cyrus, 101 acres, 400. Madison Cyrus to S. A. Cyrus. 50 acres, 500. Madison Cyrus to D. H. Cyrus, 50 acres, 500. J. M. Dnrphey to 8. E. J. Bur- ford, lot 11-16, 1625. Wm. W. Wright to Elizabeth S. Wright, 57 acres, 100. Annie H. Bocock to Ellen Morgan, 100 acres. 500. M. P. See c. to Flood and Fer guson 805 acre-, 800. Emeline Cheatham c. to T. S. Ferguson, 6 acres, 15. Etna Iron  M. Co. to E. M. Schaefer 115 acres, 2500. Wm. A. Miller to E. C. Marshall, 319 acres, 747.23. J. H. Robertson to Henry Jack- son, 5 acres, 150. J. M. Abbott to Henry Jackson, 5 acres, 1500. C. Wiley Tucker to E. E. Chism, 2 acres, 135. Jos. R. Abbitt to Obey Mann, 100 acres, 200. Robert Meadows to Marion Mose ley, 30 acres, 91.20. C. P. Marshall to C. H. See, 31 acres, 120. R. C. Maun to Z. N. Harris, 8 acres, 175. Saml Worley to Mary D. Worley, 11 acres. . aunders F. Wright to Fannie B. Wooldridge, 120 acres, 500. W. Q. Ligon to H. Ai. Marshall, 19 acres,1200. R. H. Purdum to Joel T. Caw- thorn, trustee for Liberty Church 3 acres, 93. Juo. W. Fvans to J. Hudson Cheatham, 11 acres, 200. Samuel A. Glover, c. to Thos. W. Moses, 4 acres, 40. J. R. Caldwell to Chas. Glover, 100 acres 280. F. C. Moon Comr to Eugene M. McCormick, 40 acres, 250. Farmers Exchauge to C. W. and C. A. Hancock, store and lot 2000. Nina E. Jones to J. C. Jones, 277 acres, 3000. J. C. Jones to Jno. Wilson Dur- rum, 277 3000. W. A. Durrum to Ann R, Dur- rum, 17 acres 207. W. E. Moo e to Peyton Vf. Calla- ham, 81J acres, 170. A. B. Scruggs to T. E. Fwen, 100 acres, 400. Sallie M. Featherson to H. R. Feathe stou, 305 acres, 1500. T. E. Oweus to L. S. and T. . Do s, 30 acres, 200 Lucv F. Caris to Jane E. Coleman, 75 acres, 375. Mattie W. Harvey to Ja-e E Coleman, 106 to 250.  - Jno. S. Davis to Jas. D. McDear- man Va a lot, 75. N. ii Featherston to Monroe L. Garrett, 201 acres, 900. J. A. Cheatham to School trustee South3ide and Court House,  acre, 37. H. F. Venable to School trustee Southside, 1 acre, 3. R. S. Burke to R. F. Burke acre iots, 595. Thos. H. Paris, trustee to Hun er M. Moore, 167 acres, 1400. C. S Morton, to S. W. Thornton 5 acres, 35. Flora E. and L, D. Th rntoir to S. W. Thorn cn, 39 acres aud 2 lots, Saml H. Gordou to W. Scott Thomas, 25 acres, 90. M. S. Davidson to D. T. Wool dridge, 50 acres, 350. T. W. Moses to D. T. Wooldridge 25 acres, 250 B. W. Bocock Comr io H. D. Johnson, lOaces, 78. Wm. Patteson to H. D. Johnson, 29 acres, 60. Jno. L. Davis and wife to W. E, Wooldridge c. 20 acres. Jno. L. Davis to Wesley Chapel Lruste l i acres, gift. A. B. Hoarman to J. W. Nash Jno. R. Phelps Heirs to 8. E and W. A. Wills, 50 acres, 100. A. A. White to Clifford Beck, 10 acres. 180. G. A. J. Pennell to Geo. W, Thomas, 19 acres, 200 G. W. W, Thomas to Oueida Lhomas 19 acres. Signora P. Fore to M. E. Agee 163 acres. S. S. and Elma Coleman c. to H. W. McKinney,  lot, 1200. J. R. Horsley Comr to Eliza Wright, 5 acres, 100.  E P. Evans Est. to N.  W. Ry. Co. 365-1000 acres, 260. A nna Staples Est. to N.  W. Ry. Co. 283-1000 acre, 100. B. W. Bocock Comr to D. M. Anderson 24 acres, 72. E. M. Schaefer to W. B. Sampso n 104 acres, 5. C. W. Hunter, Jr. trustee to N.  W. Ry. 17-100 acre, 15. N. C. Manson, Jr. Comr to Jos. O OBrien, 260 acres. 5455. John Reid to N.  W. R. R. Co. lot 1 acre, 400. C. W. Hunter to Sallie McKinnev"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "C. E. Lewis to,Nel8on <mark>Bocock</mark> 53 acres, exchange and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "C. E. Lewis to,Nel8on <mark>Bocock</mark> 53 acres, exchange and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
