{"document": {"bbox": [585.05, 246.72, 736.76, 912.89], "bbox_id": "cafbc4e37f", "file": "TimesVirginian_1976_0394.pdf", "page": 1, "text": "With the Vice President Dr. Merwyn Williamson presiding in the absence of the President, Mr. Gilbert Lusk, the Appomat tox County Historical Society held its regular October meeting recently. The resignation of the President, due to a transfer of professional duties to Gettys burg National Park was accepted with regrets. Highlight of the October meeting focused on a seven hundred dollar donatimi for historical research from the Woodmen of the W orld, donation of 1914 news articles and other documents concern ing the late Congressman Henry D. Flood, and the Birth Pangs of Appomattox County depicted in a talk by Mr. Ron Wilson. Mrs. Harry Clark Rucker presented the Flood news articles to the Glory of God and to the members of the society. To her the beauty of any possession is dependent on  the degree to which it is shared i with others. Amy possession to predoifl to share is not worth  having. The thing then becomes j the master of the man. Mrs. Rucker, the former j Helen Nowlin, the great-grand-1 daughter of Lawyer John Woodson whose office is one of ! the restored buildings at J Appomattox National Park, is i the daughter of the late Annie ! Thornhill and Albert Sidney ! Nowlin. Her mother, from the I Hollywood area of the county, and her father, from the! Oakville area, are widely j related throughout the county. The firuest speaker for the evening, Ron Wilson, Historian at Appomattox Court House Rational Historic Park, spoke on th e Birth Pangs of Appomattox County,1845 - 1870. The speech, based on research, one by Dr.  John Moore, Research H istorian, University of Virginia, depicted the February 8,1845 birthing of Appomattox County from the parent counties of Buckingham, Campbell, Prince Edward and"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "ing the late Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, and the Birth Pangs"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "ing the late Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, and the Birth Pangs"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [284.41, 223.08, 447.14, 1727.23], "bbox_id": "c328505bc3", "file": "AppomattoxNewspapers_1912-1915a_0004.pdf", "page": 1, "text": "with the power of selecting and ap pointing the members of the various committees, which committees un der those rules, passed on all pro posed legislation, framed the langu age of the bills, and practicall de cided whether or not legislation should be enacted by the House Under the present rule, the mem bers of the various committees are elected by a majority vote of tbe memberrs of the House. AJao, under tbe Cannon rnles, tbe Speaker was chairman of the power ful committee on rules, and since he bad the appointment of his brother members on that committee, he ac tually controlled the shaping aDd direction of all legislation brought before the House. Under the pre sent rales, not only is the Speaker shorn of bis former autocratic power to appoint members of com mittees, and thns to control the ac tion of the committees, bnt he him self is not permitted to be a member of the committee on roles. Not content with the above-men tioned changes, the House progres sives adopted certain rnles which changed the committees from arbi trary bodies to advisory bodies, and which greatly enlarged the power and influence of the individual members of the Honse. For in stance, under the Cannon rnles, the chairman of a committee could practically prevt a vote being taken on a measure which had been referred to bis committee while un der the prednt rules, although a committee cnairman is influential and powerful when it comes to shaping legislation coming before his committi e, he cannot prevent thy Honse from voting as to whet her or not a measure shall pass the House. The standpat Republicans, toget her with a few reactionary Demo crata, most of whom have since been retired to the shades of private life, fought hard againss the revision of the Cannon rnle, bnt tbey were overwhelmingly defeated, the new rnles were adopted, and Cannon- ism took its place among the things that used to be. In the fighting that preceded tbe final victories of the progressives in the lower Honse of Congress, Mr. Flood was always on the firing line, and he, together with Bepresenta tives A. Mitchell Palmer of Penn sylvania, Clande Kitchin of North Carolina, and James Hay of Vir ginia, ably assisted Bepresentative Oscar W. Underwood of Alabama in the bringing about of those pro gressive reforms that practically re stored to the people the power to shape legislation in the halls of Congress. Previously, when tbe Bepnbli- cans were in control of the Honse, Mr. Flood had frequently attacked the reactionaries who had entrench ed themselves behind the Gannon rnles, and on one occasion when the infamy of those rnles was under discussion on the floor of the Honse, particularly with reference to their application to a bill for the relief of the tobacco growers of Virginia, the member from the Tenth Dist rict, himself the author of a mea sure having for its purpose the re- ief of the Virginia growers, rose in his seat, and by the grace of Mr. Speaker Cannon, delivered a most forctble address in which he scored the antocratic power exercised by the Cannon regime, which, be re marked, had taken from the mem bers of the HonBe the powers dele gated to them by the Federal Con stitntion. Space does not permit me to give yon more than a taste of the milit ant progressivism with which that particular speech was charged, so 1 must content myself with quoting one small paragraph, reserving for my next weeks letter a fuller ac count of the speech, whioh itself alone stamps Henry D. Flood as one of that band of active progres sives whose efforts jrill be a step nearer fnll fruition when Woodrow Wil.on takes his sent in the White Honse. Mr. Flood said When Oliver Cromwell cleared ont liie Parliinent Honse with a file of soldier, it whb no whit more tyranmoal, no whit moie subversive sf the fundamental principles of representative government, than this aeeumptiou of a power which should only be exercised by a ma jority of -this Honse,namely tbe power to legislate. The above words are a matter of record. Tbey stamp the man who uttered them as the kind of fight ing progressive who counts. O b s e r v e r ."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "whioh itself alone stamps <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> as one of that"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "whioh itself alone stamps <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> as one of that"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1346.14, 525.32, 1498.43, 617.37], "bbox_id": "3e0250b53c", "file": "AppomattoxNewspapers_1922-1923a_0013.pdf", "page": 1, "text": "Winchester.State Senator H. F. Byrd was at Appomattox, to qualify as guardian of the two infant children of the late Representative Henry D. Flood, uncle of Senator Byrd, who also recently qualified as administrator of Mr. Floods estate. His selection as guardian of the two infants was at the suggestion of Mrs. Flood, the widow, it was said."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "of the late Representative <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, uncle of Senator Byrd,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "of the late Representative <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, uncle of Senator Byrd,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [468.23, 245.47, 628.06, 791.65], "bbox_id": "617e68be44", "file": "AppomattoxNewspapers_1905-1912a_0601.pdf", "page": 1, "text": "which are either compleelv without foundation in fac, or else  re based on a perveisiou of fact, and it veiy frequently hannens that h is m - able wholly to repair tbe injury done him by so  owardly a method of attack. As a COUCVie example take the present Gas.? of the HonoraM H. D. Food. R-piesentaive in Con gress from the Tenth Virginia dist rict, who of late has been the target of many absolutely unwarranted at tacks on the part of what 1 am glad to siy constitutes but a small por tion of the Virginia press. To be lieve what these papers sav eiher editorially or in their news columns, one nnfamiliar wih Representa tive Floods excellent public re cord, would be led to regard him as a reactionary of the reactionaries, while a matter of fact, from the beginning of his public career, Mr. Flood h is been not only consistently piogiens ve, I ut he has been actively and constructively progressive. Doling the next few weeks I pro pose to give you, as briefly as may be, a e cciuct statement of the varied and valuable services render ed to Virginia and to the Nation by Henry D. Flood. My next leter will deal with Mr. Floods unre mitting, earnest and effective work in helping so to change the Can non Rules as again to make of the National House of Representatives a deliberative body responsive to the will of the people, as it was intend ed to be by the framers of the Con stitution, instead of a helpless gat hering absolutely dependent upon the personal or political whims of the Cannon Committee of Five. O bserver ."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "to the Nation by <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>. My next leter will"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "to the Nation by <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>. My next leter will"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [301.45, 328.86, 463.44, 1635.45], "bbox_id": "79c6f47c41", "file": "AppomattoxNewspapers_1912-1915a_0012.pdf", "page": 1, "text": "W ashington L etter. My lust two letters dealt princi pally with the earnest, nnremitting work in Congress done by the Hon. Henry D. Flood, and I wound up my last letter by promising to give yon a brief outline of the many progressive measures which tbe Member from the Tenth Virginia District has actively advocated, ami which prove beyond shadow of doubt tbat for a long time past he has been entitled to the name of Flood the Progressive. In the first place, I am reminded that Mr. Flood was a strong and active advocate of the Campaign Publicity Bill, which was demanded by all progressive Democrats and by a few progressive Republicans. Under the provisions of tbat Bill, the public would have been inform ed, both before and after election, as to the contributors to any campaign expense fund, the amount of money contributed and how it was spent. The standpatter countered against this Bill by passing a law which went only half way, and which in reality had the effect of locking the door after the horse was stolen. However, the progressives, of which Mr. Flood was and is one, finally attained their end. Then takr the three tariff-revi sion bills passed at the extra session of Congress which met in 1911, the Wood Bill, the Farmers Free- List Bill and the Cotton Bill. Mr. Flood actively and aggressively sup ported those measures, and voted for them at their passage. It will be remembered that the siandpatteis fought hard against those three bills, and that President Taft sided with them. Next came the four tariff-revision bills passed at the regular session of Congress this year,the Wool Bill the Metal Bill, the Chemical Bill and the Sugar Bill. Mr. Flood has aotively and consistently supported these measures, while the standpat ters in the House went to defeat fighting against them, and stood firmly against their passage by the Senate. In the latter body the pro gressive Republicans aided the De mocrats in saving two of the bills,in modified form, joined with the standpatters in killing another, and assisted the Democrats in passing a sugar bill, whioh while entirely dif ferent from the bill passed by the more progressive Honse, was far more in accord with the demands of the people than either the Dingley or the Payne tariff laws. And it should not be forgotten that while in 1911 the reactionaries were routed in both Houfe and Senate by i combination of progressive Demo oratsand Republicans, they were saved by the Presidential veto. W hat finally will happen, this year cannot be fore-told, but thus far the reactionaries have been beaten all along the line, and in every battle, Henry D. Flood has been in the front rank of the Progressives. In the very important matter of the admission of Arizona and New Mexico to the sisterhood of States, the right of the people to frame their own constitutions was vigor ously opposed by the reactionaries, and Progresssive Democrats were forced to accept that position be cause of their inability to mnster a two-thirds vote to over-ride the Presidential veto. The wrong Las been righted, however in America by the people themselves, who latei by an amendment to their State Constitution brought about the adoption of the identical idea that the Progressives in the Honse of Representatives had fought for, and that President Taft had vetoed. Mr. Flood was the author of tbr bill admitting Arizona and New Mexico to statehood, and workei unremittingly to accomplish the re suit to which the Democratic part was pledged, and to whioh the Re publican party had also been pledg ed for years, but whioh they had failed to bring about. O b s e r v e r ."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "done by the Hon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, and I wound up"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "done by the Hon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, and I wound up"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1207.19, 1009.34, 1362.48, 1391.79], "bbox_id": "ca7f46beb2", "file": "AppomattoxNewspapers_1918-1922a_0627.pdf", "page": 1, "text": "Unable to muster sufficient strength to suspend the rules, Senator G. Walter Mapp, of Accomac, again made a futile effort to bring the movie censorship bill up on the floor of the Senate. His work, however, resulted in the dis charge of the Committee on Laws from further consideration of the Adams- Jeffreys bill, and it now has a place on the calendar. That the bill will pass the Senate is generally believed. Its adoption by the House is considered a big victory as that body was in the doubtful col umn regarding censorship. Senator Mapp is said to have enough votes pledged to carry the bill through. Senator S. L. Ferguson, of Appomat tox, presented resolutions reciting the services of former Congressman Henry D. Flood, who served in both branches of tfee Legislature, in the constitutional convention and for twenty years in the national Congress. Senator Ferguson spoke cf his record in public life from a few months after he attained his majority until the day of his death. He had won his place by sheer force of character, the confidence of his peo ple and his unswerving loyalty to party and State. The resolutions provided that a copy shall be sent to the family and the adjournment of the two houses to be in his memory. Senator Robertson, Senator Leedy, Senator Early, Senator Mitchell and Senator Mapp paid tribute to tbe worth, ability and courage of Henry D. Flood. The resolutions were adopted."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "services of former Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, who served in both"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "services of former Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, who served in both"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [266.42, 1235.92, 424.11, 1657.71], "bbox_id": "3d434667f8", "file": "AppomattoxNewspapers_1918-1922a_0136.pdf", "page": 1, "text": "Twyman, G. H Agee, L P Gills, G. G. Camden, A. H Williams R. II. Wood, and W T. Sr.mdv These delega tes go I uniustructed and it was decid ed that the delegates in voting in the convention should adopt j the unit rule. The following resolutions were adopted ty the mass meeting held on March 9th 1920. Resolved, by the Democrats of Ruckingum county in mass melting assembled. 1st We endorse th Democratic admin istration of our National gov ernmect under the wise ano stotffiu.au like leadership oi our president, Woodrow VVilsoo 2nd We esteem it a privilege as well as a. duty to congratu- lat-e and felicitate our distin guioned Representatives, in Congress the lion. Henry D Flood for h i s conspiquoiu services to liis country. He has aided with great ability and unflagging zsal all the foreign end domestic policies of the chief of our party and has been in the torefront in promoting the measures of tais Democratic administration W i ext ad to bm our warm aud hearty support tor anothei term in the house of Ripre sente uvea"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "in Congress the lion. <mark>Henry</mark> <mark>D</mark> <mark>Flood</mark> for h i s"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "in Congress the lion. <mark>Henry</mark> <mark>D</mark> <mark>Flood</mark> for h i s"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [175.9, 927.22, 354.09, 1769.32], "bbox_id": "3fe7a4947b", "file": "AppomattoxNewspapers_1912-1915a_0129.pdf", "page": 1, "text": "Titles to Congress. The House of Representative!! will be called on to decide whethei one of its Members who holds his seat by virtue of a technical certifi cate of election issued according to the letter of tbe law, or whethei one of his opponents in ihe last gmeral election, who actually re ceived a larger number of votes, B entitled to that seat. Th issue liée between the Bon. H. Olin Young, de facto Republican Member fiom the Twelfth Michigan district, and his Bull Moose opponent, the Hon William J. MacDonald. The facts are as follows  The Bnll Moose State Secretary, to cor rect a previous error in the spelling of Mr. MacDonalds name, tele-1 graphed the clerks of the several! counties comprising the district,!  Congressman Twelfth district I should be spelled William J. Mac I Donald. The telegram received by the clerk of Ontonagon county read Congressman Twelfth dist rict should be Sheldon William J MacDonald. Consequently 458 Bull Moooers of Ontonagon county voted for Sheldon William J. Mac Donald, while the Bull Moosers of the other counties in the district voted for William J. MacDonald. When the vote was canvassed, it was found that H. Olin Yonng had received a popularity of 215 ove William J. MacDonald and Shel don William J. MacDonald, anu Young was given the certificate of election. Had the 458 votes cast by the Bull Moosers of Ontonagon county been counted for the man for whom they were intended, Mr MacDonald would have had a plnralityof 243 votes in the dist I .riefc, and would have received thf-l certificate, to which ne rightly I claims title.  This contest recalls the fact tha following the election of 1896, and I under almost identical circum- stances, the Hon., Henry D. Flood I was awarded the certificate of elec-1 tion as Representative from the j Tenth Virginia district, over bis Re publican opponent, the Hon. J. Yost. In that case, from all coun ties except Buckingham, J. Yost was certified to the State Board of Canvassers as having received the Republican votes cast in those counties while  Jacob Yost was i certified as having received the I 1272 Republican votes cast in Buck ingham oounty. The legally certi fied returns from the entire dist rict showed a plurality of 1125 votes for Mr. Flood over J. Yog. so d Jacob Yost, and, according"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "circum- stances, the Hon., <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> I was awarded the"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "circum- stances, the Hon., <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> I was awarded the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [716.65, 220.63, 865.22, 1261.77], "bbox_id": "3a141e31f0", "file": "TimesVirginian_1976_0361.pdf", "page": 1, "text": "The Appomattox County Historical Society recently received 1914 news articles and other documents that will be of interest to county residents. The donor of the articles, Mrs. Harry Rucker of Monroe, is the former Helen Nowlin. She was the daughter of the late Annie Thornhill and A, Sidney Nowlin of Lynchburg. Mr. and Mrs. Nowlin were descendents of Appomattox County residents frqm the Oakville and Tower H É areas of the county. It was from the steps of the John H. Nowlin home, later known as the Owen home, Oakville, that Congressman Hal Flood made his first political speech. Reportedly asked, Didnt your father advocate C-session he answered Yes! and shouldered his musket and went to war.? One of the articles is reprinted below DAY SET FOR FLOOD - PORTNER MARRIAGE. Washington Soc iety Girl to Wed Congressman here on the Eighteenth of April. All rumors concerning the engagement of Miss Anna Portner and Congressman Henry D. Flood of Virginia were set at rest this morning when several hundred Wash ingtonians found in th eir morning mail a card reading Mr. Alvin O. P ortner requests the honor of the presence of  ------- 1 at the marriage of his sister, Anna Valer, to Mr. Henry Delaward Flood, on Saturday, April 18 at 5 oclock, All Souls Church, Washington, D. C. Reception immediately after the ceremony at the Highlands. The engagement of Miss Portner and Congressm an Flood was announced last spring and several dates for the wedding have been set by rumor, but when the time came, there was no wedding. Rumor then declared that the engagement was broken. In the m eantim e Miss Portner spent the summer abroad and since her return in the fall has spent much time between Washington and New York. During her travels she has gathered one of the most elaborate trousseaux that has been seen in Washington for . several seasons. Miss Portner is the daughter of the late R obert P ortner and -.Mrs. Tortner dfMtiaksiVk. She made her debut séHrtsritl Sétóons ago, bút diiringf the list few years had not taken an active part in society on account of mourning for her mother. She is one of five girls, all of whom are famed for their brunette beauty. This season Miss, P ortner and her youngest sister, Miss Hildegarde Port ner, have made their home at  the Highlands. It has been known amqng the most intimate friends of Miss Portner for a fortnight that the wedding was to take place on the 18th, but they were pledged to secrecy. The bridal party has not been entirely selected. Mrs. Lorimer Graham and Miss Hildegarde Portner will attend their sister and Miss Edith Grade, Miss Portners most intimate chum, will also be"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "Anna Portner and Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> of Virginia were set"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "Anna Portner and Congressman <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> of Virginia were set"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [300.95, 1089.42, 463.09, 1530.4], "bbox_id": "b3a2c8eaf2", "file": "AppomattoxNewspapers_1905-1912a_0585.pdf", "page": 1, "text": "That Flood and Ryan Episode, Editor T imes -V irginian A great furore has been kick ed up, a regular tempest in teapot. Every goBsiper is rolling under his tongue a toothsome morsel, multiplying it by ten or twenty according to his parties lar personal inclination, an passing it along in a new guise to his brother whisperers with utter disregard for the facts in the case. And what is this luscious piece of gossip? Nothing more nor less than that .the Hon Henry D. Flood, Representative in Congress frmn the Tenh Vir inia Disric , w ng e-handec and alone, excvt for ligh. aic of that hyd 1 a-headed a d forked tailed monster, the so-callec Virginia Machine, did name elect and end Mr. Thomas For tune Ryan 8 a De egate from the Tenth Virginia District to the Nlinnai Democratic Con vention at Bal imore. Pa tculady has this tooth some morsel see - to appeal to the righteoui indignation o the able youn editor of the Staunton Da ly Leader, who  eized upon it wiih the usual zeal of yonth, and takes upon himse f the responsibility of speaking for the good people of Staunton and Augusta County, in the following language The voters of both city and county are disgusted with Mr. Floods part in the seating of Thomas F. Ryan in the Virgin a Delegation, his attitude towards Wi son, his at ack on Bryan"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "than that .the Hon <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Representative in Congress frmn"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "than that .the Hon <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Representative in Congress frmn"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.35, 911.38, 1895.51, 1353.19], "bbox_id": "5cedaac6d6", "file": "AppomattoxNewspapers_1947-1949a_0054.pdf", "page": 1, "text": "son, of the University of Virginia1 effective pastor of the New nope three granddaughters, Mrs. Tyree1 group of Baptist Churches, recent- Finch, of Chase City and Misses ly tendered his resignation, effec- Eleanor and Anne Faulkner John- live August 1. We understand that son, of Richmond four great-grand- be has accepted a field of churches daughters, Misses Jane and Susan including Reedy Springs, TJnion Johnson, Sally Bocock Finch and Hill, and Ebenezer, southwest of Anne Yates Reynolds. Also present here. At present he is understood was Mr. Bococks nephew, Dr. Will- to be making plans to live just out- is Bocock, of the University of side of Appomattox on the Red Georgia, with Mrs. Bocock and their! House Road, granddaughter, Miss Bessie Bocock,. and Mrs. Henry D. Flood and Boll-   ing Flood, of Washington. I J  O X Mrs. Lewis Littlepage, of Norfolk president of the Virginia Division,1 O 1 1 C ! ___ _ U. D. C., presented the tablet,which D e l l I O U U  C!5 was accepted by Col. E. Griffith ______ Dodson in the absence of the Gov- DROp TW0 ernor. Colonel Dodson reviewed the course of the legislation by which After holding first place in the its erection had been anthorized, Virginia Central League for the and mentioned that the resolution first half of the season, the Appo- had been introduced by Senator mattox Red Sox dropped  to second Charles Mdses, of Appomattox. j piace by losing both games over Mrs. Cabell Flournoy, of Lexing- the week-end. ton, spoke eloquently of Mr Bo- Jn Saturdays game, Hurt edged Spring cocks service to Virginia and to, Appomattox 910 8 in a very close cake, , the nation. She sa a that after the me Hurt coliected 16 hits toA p-and Ui war he received a fla.terng offer pomattoxs 10. Bass arid Guillwere Mr. H to make his home in New York, but on the mound for the Red Sox. the daj like General Lee, he preferred to ancj w share the sufferings and privations Red Sox 350 000 000 8 p0jj0Wj of his felloe Virginian i.  Hurt 201 010 131 9 nolds In conclusion, Miss Mann fead At Miller Park in Lynchburg ville, Mr. Bococks speech accepting the Sunday, Fairview Heights battled Earl  1 position of Speaker of the Confed- the Sox in a ten-mmng game to green 1 erate House of Representatives and win 8 to 7, And to take over the Evergi presented a copy to Mrs. Roberts lead m the Central League. This burg, onbehalf of the committee. was the fourth game between the Reyno. i  two teams, and each team has now noias, Immediately after the ceremonies defeated the other twice. Earl 1 Mrs. Roberts entertained a number"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood", "Flood"], "snippet": "Bessie Bocock,. and Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> and Boll-   ing <mark>Flood</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood", "Flood"], "snippet": "Bessie Bocock,. and Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> and Boll-   ing <mark>Flood</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [568.28, 254.9, 727.53, 455.94], "bbox_id": "5a0e488ae3", "file": "AppomattoxNewspapers_1898-1902a_0346.pdf", "page": 1, "text": "Otey. Seventh DistrictHon. James Hay. Eighth DistrictHon. John F. Rixey. Ninth. DistrictHon. W. F. Rhea. Tenth DistrictHon. Henry D. Flood. I think every one of the partys congressional nominees will be elected, said Hon. J. Taylor Flly- son, chairman of the State Commit tee, yesterday. The-party is in good shape everywhere. Active campaign work jias begun iii every district, but the real opening of the campaign will occur on next Satur day. I believe in short contests, and warm ones. Six weeks is long enough.Richmond Dispatch."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "F. Rhea. Tenth DistrictHon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>. I think every one"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "F. Rhea. Tenth DistrictHon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>. I think every one"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.69, 286.3, 1978.23, 659.74], "bbox_id": "594827a1a6", "file": "AppomattoxNewspapers_1908-1909a_0552.pdf", "page": 1, "text": "On October 25, 1877, Mr. Tucker married- Henrietta Prestori Johnson, of Lexington, and to this mrriaga were born six children, John Randolph Tucker, Richhiond Rosa Johri- iston, Mrs. Silas B. Mason, of I I ,A Y i m r i- A lv  1 7 . A l l . _ i   i-n ,, i y ns aj  ìviason  9 ot Continued from Page One !Lexmgtori, Ky Albert Sydney March 4, 1889 to March S  ohnf on Tcke, maor U S. , to March á,A Laura Powell, Mrs. For- 1879, and was, not a candi date for reel.ecteon in 1896. He was reelected March 2 1 , 1922, sixty-seventh congress a rill Ithe vacancy caused by. vhe death of Henry D. Flood ndyJas reelected to 1 the six-  eighth sixty-ninth, seventi- îth, seventy-first and seventy- econd congresses. -Mr. Tucker was born in Winchester, Frederick county, Apnl 5 1853, the son of Laura Powell and John Randolph Tucker. Washington  Lee Man He attended a private schoril in Richmond during the War Between the States and a private preparatory school at Middleburg from 1865 to 1871. He was graduated from the law department at Wash- irigton and Lee University in 1876, and was admitted to he bar the same year, and began"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "by. vhe death of <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> ndyJas reelected to 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "by. vhe death of <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> ndyJas reelected to 1"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [305.47, 298.08, 470.22, 1682.32], "bbox_id": "cf956204d4", "file": "AppomattoxNewspapers_1918-1922a_0607.pdf", "page": 1, "text": "nounced Saturday that they have sufficient yotes pledged to nominate Tucker on the first ballot when the tenth district democratic convention meets at Staunton, February 14th, to nominate a successor to the late Representative Henry D Flood. There will be 135 votes in the convention. A majority, or 68, will be necessary to nom inate. and Tucker headquarters at Lexington last night claimed that the Lexington candidate already was assured of 74. The Tuckerites are claiming as a minimum 11 votes from Botetourt, 12 from Nelson, five from Craig, five from Cumber land, three from Highland, 13 from Rockbridge, 15 from Au gusta and 10 from Staunton, a total of 74 Delegates were elected Sat urdav from Bath, Botetourt, Craig, Nelson and Fluvanna. Former State Senator Floyd W. King, of Clifton Forge, who had previously carried Clifton Forge and Buena Vista, carried Fluvanna over Tucker by a vote of 141 to 111. The dele gates from Bath, which will have four votes in the conven tion, were instructed for Com mon wealths Attorney H H Byrd, of Warm Springs. The delegation from Bath is con sldered anti-Tucker. Botetourt county elected 32 delegates, each with one half vote. Eighteen of them representing nine votes, were instructed for Tucker. Of the remaining 14. three are conceded to Tucker, with the Lexington candidate claiming one or two additional NelBon with 12 votes and Craig with five were reported solii for Tucker with all delegates instructed. Probably the most inteieB t ing fight was w g-d in Nelson county, the rival candidates there being Mr. Tucker and Col. Aubrey E. Strode, of Am herst, both of whom were present at Massies Mill. The Massies Mill district elected four Tucker delegates, the vote being 135 for Tucker and 13 for Strode. Lovingston district elected five Tucker delegatee, the vote being 127 to 109 Satur day. Schuyler district, by a vote of 40 to 25, elected two Tucker delegates.  1 am relieved that the fight is over, of course I am gratified with the results in Nelson Botetourt and Craig, said Mr. Tucker. Stuart Moore, Tucker manag er at Lexington, issued a state ment declaring that  returns from the counties selecting delegates to the democratic convention to be held in Staun ton, February 14th, make it a foregone conclusion that Harry St. George Tucker will be the choice of .that body as the partys candidate for Congress to succeed the late H. D. Flood. Anti-Tucker politicians con tented themselves with point ing out that the three delegates from Highland, five from Cum berland and two of those from Botetourt, who are claimed for Tucker, are not instructed, and so far as they know, have not announced whom they will support As the matter now stands, Tucker claims six more than enough votes to nominate on the first ballot and is confident that no futures developments can bring about his defeat. Alleghany county delegates are instructed for Major Rich ard F. Beirne, of Covington, and those from Appomattox are not instructed. Amherst county elected ten delegates Monday and instruct ed them for Col. Aubrey Strode  and Mr. Tucker as a second choice. Buckingham elects eight delegates to-day and it is expected that the delegation will be divided between Mr. Tucker and Col. Strode."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "to the late Representative <mark>Henry</mark> <mark>D</mark> <mark>Flood</mark>. There will be 135"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "to the late Representative <mark>Henry</mark> <mark>D</mark> <mark>Flood</mark>. There will be 135"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [900.21, 205.83, 1055.78, 773.67], "bbox_id": "0fb0239365", "file": "AppomattoxNewspapers_1918-1922a_0419.pdf", "page": 1, "text": "Mr. and Mrs. Flood in Cali fornia Four people figuring promin ently in the public eye, having been recent gucstfe at the Hotel St Francis. 8e?dom, could four such notables be found under one roof. Thomas For tune Ryan, one of the Big Five in the financial- market of the United States, accompa nied by Mrs Ryan and their Suite, including a chef, arrived at the St Francis on Sunday afternoon, with Mr. and Mrs. Henry D. Flood of Washington, a? their guests. Mr. Flood, who attended the last session of Congress, as United Slates Representative from Virginia, is a prominent figure in the Capital city. His name will go down in history, as the statesman who introduced m Congress the measure declaring War against Germany and Austria, when he realized Woodrow Wilson faced the great moment that must make the United States one of the Allies The other two mem bers of the remarkable quartette are Douglass Fairbanks, a fa miliar figure on both sides of the water, and one of the  big four of the Movie Act or mill- ionaries, who reached the St Francis on Sunday evening with Mrs Fairbanks, our famous Mary Pickford, the chii drens best-loved actreBS. On an evening following the Fair banks arrival, a party of hand somely gowned women gather ed in the lobby, laden with flowers, awaiting the return of the Sweetheart of America, from the theatre"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "with Mr. and Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> of Washington, a? their"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "with Mr. and Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> of Washington, a? their"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [568.55, 1242.89, 724.19, 1264.39], "bbox_id": "c7cd6aa116", "file": "AppomattoxNewspapers_1898-1902a_0539.pdf", "page": 1, "text": "Messrs. Henry D. Flood, Saml L. Ferguson, and Allen H. Clement are"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "Messrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Saml L. Ferguson, and Allen H. Clement are"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "Messrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Saml L. Ferguson, and Allen H. Clement are"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [686.93, 653.44, 848.06, 1152.84], "bbox_id": "81f8099684", "file": "AppomattoxNewspapers_1898-1902a_0295.pdf", "page": 1, "text": "MEMORIAL EXERCISES, FRIDAY JUNE 1 -4 OCLOCK P. fl. The procession will file out from the lot adjoining N. U. Gregorys. Line of march will be as follow! Up Grove avenue to Main, out Main to Court, then along the quiet high way to the cemetery. Leadiug the procession will be the Confederate veterans, followed by the aides of the chief marshal. Chief-marshalMaj. J. W. Flood. MarshalsMessrs. Ned LeGrand, R. F. Burke, Johu T. Lee, John W. White, Jas. P. L. Fleshman, G. L. Ferguson, Daniel Ferguson, N. H. Gregory, Geo. T. Peers, W. H. Ab bitt. AidesMessrs. J. G. Fisher, J. W. Trent, C. A. Trent, F. W. McKin ney, John Overton, R. C. Harvey, H. W. McKinney, Joe OBrien, Wat kins Nowlin, Hunter Abbitt, Robt. Caldwell, Walter Ellett, Frank Ab bitt, Hnbbard Coleman, Joel Cole man, Ran. Fleshman, R. C. Mann, George Purdum, R. L. Burke, J. W. Childsess, Jake Childress, and J. B. Abbitt, Daniel Browning. Next in line will be the Daugh ters of the Confederacy and ladies of the Memorial Association, follow ed by young ladies as flower-bearers then citizens and friends. The solemn exercises at the cem etery will be opened with prayer by Rev. Dr. Taylor, followed by singing Nearer, my God, to Thee, recita tion by Miss Mary L. Paris, intro ductory remarks by Hou. Henry D. Flood, address b y ---------- , singing, recitation by Miss Alice Burke. The flag bearers will be Misses Lucy Smith and Pearl Burke. The exercises will be closed with prayer by Rev. P. M. Bell. All Confederate veterans are cor dially invited to take part in these exeeises."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "ductory remarks by Hou. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, address b y ---------- , singing,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "ductory remarks by Hou. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, address b y ---------- , singing,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1514.6, 1671.48, 1845.43, 1718.75], "bbox_id": "9e58b074e6", "file": "AppomattoxNewspapers_1912-1915a_0410.pdf", "page": 1, "text": "L , i l T i j i. laloome candidates should notify the Hebron Ghnreh for mòre than half I . . . . . .  . t o r .  t a w . . t o f f . f r a i l , I S T T  01  p,tt 1Ub 1914, and Whereas, Hon. Henry D. Flood,"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "1914, and Whereas, Hon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "1914, and Whereas, Hon. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [238.26, 1289.69, 406.76, 1794.78], "bbox_id": "485e03dd47", "file": "AppomattoxNewspapers_1905-1912a_0471.pdf", "page": 1, "text": "IB ANXIOUS TO AID FKUITl MEN. CongreMBisn Henry D. Flood left! Tuesday for WMbington, sfter pending Cbriatmu with relative in Winchester. In conversion with s represen tative of The Star, Mr. Flood an nounced bii intention of shortly in troducing s bill in Congress to com pel the cold storage houses to make monthly reports to the Department of Agriculture of the number of barrels of apples in storage, and have the Secretary of Agriculture I consolidate this information and is sue the same to fruit growers and organizations. The passage of this bill would! give accurate infotmation to the fruit growers of the number of bar rels of apples in storage and wonld be of inestimable benefit in deter- trininp the prices the grower Should obtain for their frnit. At the present time the apple I buyers are organised and they ob-1 tain each month confidential infor mation of apples in storage.  u This bill would be along the same lines of a bill recently passed by Congress to compel the tobacco warehouses to report the amount of tobacco in storage. Mr. Flood also said that he wonld use bis influence with the Department of Agriculture to have the estimate of the apple crop made in barrels and not in peroentegee, aa estimates in barrels would be of much greater benefit to the appls powers."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "AID FKUITl MEN. CongreMBisn <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> left! Tuesday for WMbington,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "AID FKUITl MEN. CongreMBisn <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> left! Tuesday for WMbington,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [463.19, 995.36, 781.38, 1051.42], "bbox_id": "1ee6d6b114", "file": "AppomattoxNewspapers_1898-1902a_0358.pdf", "page": 1, "text": "His Life Was Saved. Mr. J. E. Lilly, a prominent citizen of Hannibal, Mo., lately had a w.uderful deliv erance from a frightful death. In telling of  teken with Typhoid Fe-1 bought of Mr. Henry D. Flood the ver that ran Into Pneumonia. M? Lungs be- r. , - i. came hardened. I was so weak I could not Dickerson farm near Evergreen. We"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "Fe-1 bought of Mr. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> the ver that ran"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "Fe-1 bought of Mr. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> the ver that ran"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [384.0, 228.51, 518.01, 239.51], "bbox_id": "685e26089b", "file": "AppomattoxNewspapers_1918-1922a_0551.pdf", "page": 1, "text": "HENRY D. FLOOD DEAD"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark> DEAD"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark> DEAD"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1165.2, 1195.69, 1264.78, 1214.96], "bbox_id": "e9a621eb51", "file": "AppomattoxNewspapers_1892-1898a_0034.pdf", "page": 1, "text": "HENRY D. FLOOD, ATTORNEY at law ,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY at law ,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY at law ,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1179.6, 1688.59, 1277.52, 1711.18], "bbox_id": "a8be072e56", "file": "AppomattoxNewspapers_1892-1898a_0030.pdf", "page": 1, "text": "HENRY D. FLOOD, ATTORNEY AT LAW,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY AT LAW,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY AT LAW,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1174.1, 1482.44, 1274.04, 1505.04], "bbox_id": "74e68f88cb", "file": "AppomattoxNewspapers_1892-1898a_0025.pdf", "page": 1, "text": "HENRY D FLOOD, ATTORNEY AT LAW,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark> <mark>FLOOD</mark>, ATTORNEY AT LAW,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark> <mark>FLOOD</mark>, ATTORNEY AT LAW,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1164.26, 1426.39, 1262.63, 1447.47], "bbox_id": "8a000705be", "file": "AppomattoxNewspapers_1892-1898a_0020.pdf", "page": 1, "text": "HENRY D. FLOOD, ATTORNEY AT LAW,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY AT LAW,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORNEY AT LAW,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1151.48, 1435.76, 1253.89, 1457.63], "bbox_id": "38eea56ca9", "file": "AppomattoxNewspapers_1892-1898a_0018.pdf", "page": 1, "text": "HENRY D. FLOOD,, ATTORNEY AT LAW,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>,, ATTORNEY AT LAW,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>,, ATTORNEY AT LAW,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1157.49, 1696.56, 1256.14, 1718.52], "bbox_id": "c292cc40af", "file": "AppomattoxNewspapers_1892-1898a_0027.pdf", "page": 1, "text": "HENRY D. FLOOD, ATTORHtV AT UW,"}, "highlight": {"text": {"matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORHtV AT UW,"}}, "highlights": [{"field": "text", "matched_tokens": ["HENRY", "D", "FLOOD"], "snippet": "<mark>HENRY</mark> <mark>D</mark>. <mark>FLOOD</mark>, ATTORHtV AT UW,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.18, 351.91, 1762.87, 744.0], "bbox_id": "ea41f2c236", "file": "AppomattoxNewspapers_1918-1922a_0254.pdf", "page": 1, "text": "friends in Danville, Va. Mrs. J W. Puckett is visit- I    ives aud friends near Madisonville, Va Mr Pierce Odor, of Balti m ote, has been visiting reia- I tiv68 id thecouuty Mrs. W G. Whitlow, of Blue  field, W. V a , j visiting her parents, Mr. and Mrs. J. P L Fleshman. .Prof- Havilah Babcock and Miss Callie Babcock came from Klon College, N C , to spend the we-k end at Dome herr. Mr. LIyod L- wis fell from his drill Friday and broke Re is now in hospital. Mrs. C G. Chandler, Misses Pearl Caldwell and Gladys Patteson have returned from Lynchburg, where they bad their tonsils and adenoids re moved. Appomattox will welcome the boys and girls of New Lon don Academy to our great sobool here. Prof. Crawley can handle them if arrange ments can be made. Lets get em here. Mrs. Henry D. Flood m atched Mrs. Woodrow Wilson by pre senting her personal check for 100 to the Democratic cam paign fund of Virginia through Captain W. D. Cardwell."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "get em here. Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> m atched Mrs. Woodrow"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "get em here. Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> m atched Mrs. Woodrow"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1804.77, 864.9, 1945.85, 1484.55], "bbox_id": "5d995958cf", "file": "AppomattoxNewspapers_1962-1965a_0132.pdf", "page": 1, "text": "Eighty-seven persons donated blood when the Bloodmobile visited here Friday. Donors were Tom E. Holland, John T. Hall, Harry T. Ferguson, Jr., Thomas C. Patteson, Charlie B. Rush, Samuel R. Lawson, Fred C. Smith, Junius G. Davis, William F. Burge, Ruby R. Williamson, Lockie M. Ayers, Dorothy W. Da vidson, Shirley C. Massie, Jesse N. J e n n i n g s , Margaret W. Bragg, B e r n a r d C. Harris, Lewis R. Thompson, Samuel R. Coleman, anti Ralph D. Reyn olds. Also Maynard L. Mitchell, Ar- dell R. Lawson, Nellie A. Kraus, T. Hunter Dickerson, Jim Reed, Alton E. Lucado, Charlie C. Cart er, Jean M. Pitsenber, William A. Harvey, Edward N. Harvey, L. Woody, Roland W. Lee, Clar ence E. Webber, William C. Paulette, David R. Caldwell, Lou ise D. Carnefix, Wallace G. Ha ley, Dennis W. Torrence, June B. Chenault, Howard E. Torrence Henry D. Flood, Katherine J Godsey, Mrs. Agnes P. Wilker- son and Eva P. Marsh. Also Druscilla W. Shelton, E- ory W. Mullins, Merle R. Nash, Spurgeon R. Page, Doris Mitch ell, Lorraine H. Torrence, Tho mas F. Norris, Fred H. Lawson, Milton C. Cyrus, Ernest R. Brown, James E. Burge, Carl E. Martin, Thomas E. LeGrand, Ce cil G. Woolridge, Graham Pitsen- berger, Cabell G. LeWis, Ben D. Wheeler, Mary S. Hudson, Wil liam C. Hubbard, Frances D. Herncall, John L. Harrison, Alta T. Evans, Bertha Shelton, David M. Trent, Len R. Godsey, Ran dall S. Robertson, William E. Layne, Jr., Millard V. Harvey, Claude B. Cabaniss, and Joseph M. Cobb Jr. Also Robert L. Austin, Edward F. OBrien, William A. Soniggs, Mrs. Laura H. Henry, S. R. Cole man Jr., Mrs. Aileen M. Harvey, Lewis G. Harvey, 1111101x1 E. Har vey, William A. Hunter, Mrs. Harriet S. Redding, Marvin A. Glover, Jr., Carl M. Glover, Rich ard L. Winfield, Gordon Staples and Peggy Woolridge. Dr. A. A. Fatrick, county Blood mobile chairman, said new Blood mobile quotas for the 1963-64 year will begin July 1."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "Chenault, Howard E. Torrence <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Katherine J Godsey, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "Chenault, Howard E. Torrence <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, Katherine J Godsey, Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [374.4, 373.18, 542.36, 1891.0], "bbox_id": "6e4838a3cb", "file": "AppomattoxNewspapers_1918-1922a_0152.pdf", "page": 1, "text": "Democratic Mass-Meeting Saturday after a well-attend ed meeting of the Democrat of Appomattox county was held in the cpurthouse here, Col. Joe Button, of Richmond, presiding, the following reso lutions were adopted . By S. L. FergusonResolved we endorse the Democratic administration of our national government under the wise and statesmanlike leadership of our president, Woodrow Wilson. We esieem it a privilege as well as a duty to congratulate and felicitate our distinguished representative in congress, the Honorable Henry. D. Flood, for his conspicuous services to his country. He has aided with great ability and unflag ging zeal all the foreign and domestic policies of the chief of our party, and has been in the forefront in promoting the measures of this Democratic administration. We extend to him our warm and hearty sup port for another term in the House of Representatives. By L. W. ThrockmortonRe solved that the Democrats of Appomattox county in mass meeting assembled this 8th day of May, point with pride to the very efficient, able and capable officers of this county, and eachof the magisteriol districts hereof, and of the efficient, progressive and economic ad ministration which the Demo cratic party, through its officers has given to the taxpayers and people of this county. By 8. L. Ferguson Whereas the death of the Senior Senator of Virginia, the late Thos. S. Martin, has occurred since the Democrats of this county last assembled, therefore be it now Resolved, that the Democrats of this county feel keenly his deathwill miss his able coun sel, characterized in State and National affairs with distin guished ability and recognized statesmanship. By R. F. Burke  Resolved that the seven votes to which Appomattox county is entitled in the Democratic State Con vention to be held in Roanoke, on the 19th of May, be cast by the Delegates who are present in that convention on all ques tions as a majority of the dele gates present may determine. By J . R. HorsleyResolved that the delegates from this county to the Roanoke conven tion be instructed to vote for the re-election of Hon. R. A James as chairman of the State Democratic committee and for the re-election of Hon. Carter Blass as member from Virginia on the National Democratic committee. By C. W. Smith  Whereas, the Democrats of Appomattox county have been fortunate in electing to the Legislature of Virginia a typical Virginia gentleman, a man of high character, broad experience intelligence, ability and sound legislative judgment, who has faithfully and efficiently repre sented the people of Appomat tox county during the last session of the Legislature, and among other measures has in troduced and secured the pas sage of some important State Road Legislation, Therefore, be it resolved by the Democrats of Appomattox county in mass meeting assem bled this the 8th day of May 1920, that we heartily endorse the course and career of the Hon. J . R. Horsley as our rep resentative in the House of Delegates of Virginia. By R. L. BurkeWhereas since the Democrats of Appo mattox county last met in mass meeting on Dec. 31st, 1918, at which time they called upon the Hon. S. L. Ferguson to be come a candidate for the State Senate, and Whereas, he bowed to the will of his countymen and friends, and laid aside bis personal considerations, and has been twice elected to the Senate of Virginia from the 18th District, and has ably, intelli gently, faithfully and efficient ly represented us in the extra sessioirof 1919 and the regular Vsssion of 1920, during the era of re-construction and re-ad justment following the world war, when the State and Nation called for the best statecraft of our ablest men who proper ly safeguard our institutions, and provide for the new order of things which must inevitab ly follow Therefore, bo it resolved by the Democrats pf Appomattox county, in mass meeting assem bled this the 8th day of May, 1920, that we believe that he is one of the ablest représenta tives it has had, and we hearti ly endorse the course of the Hon. S. L . Ferguson in the Senate of Virginia. The following delegates, with one-fourth vote each, were elected to the Roanoke con vention which meets on the 19th of M nyin that city H.j"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "in congress, the Honorable <mark>Henry</mark>. <mark>D</mark>. <mark>Flood</mark>, for his conspicuous services"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "in congress, the Honorable <mark>Henry</mark>. <mark>D</mark>. <mark>Flood</mark>, for his conspicuous services"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [496.3, 1122.77, 661.74, 1277.26], "bbox_id": "a098fe0377", "file": "AppomattoxNewspapers_1912-1915a_0338.pdf", "page": 1, "text": "Congressman Flood Weds Miss Anna V. Portner. Washington, D. C.One of the most brilliant weddings of the week was that which took place, when Represen tative Henry D. Flood, of Virginia, married Miss Anna Valer Portner. The ceremony took place at 5 oclock at All Souls Church and was followed by a brilliant reception at the Pan- American Bureau, which was offered by Mr. Barrett, director of the Pan- American Union, who was an usher, as a compliment to Mr. Flood, who is a member of the Foreign Relations Committee of the House. Miss Port-"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "place, when Represen tative <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, of Virginia, married Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "place, when Represen tative <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark>, of Virginia, married Miss"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1553.49, 472.5, 1688.39, 584.0], "bbox_id": "706ac9812d", "file": "AppomattoxNewspapers_1960-1962b_0315.pdf", "page": 1, "text": "Atwood was its first Pres- Henry D. Flood was Vace- bt, with R. F. Burke as , These men, plus S. L. Fer- J. R. Horsley, Wilson H. Joseph Button, D. A. Lang- J. M. Harris and J- C. vere the first Directors, ressman Hal Flood became nt upon the death of Mr. i. and served until 1921."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "was its first Pres- <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> was Vace- bt, with"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "was its first Pres- <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> was Vace- bt, with"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [626.16, 1039.01, 783.9, 1180.0], "bbox_id": "a766e1bc86", "file": "AppomattoxNewspapers_1898-1902a_0212.pdf", "page": 1, "text": "Application has been made to the Governor for the removal of the po litical disabilities of Renben David son, a negro of Appomattox countv, who was couvicted iu a magistrates court of larceny, and sentenced to a term in jail, which he served. The petition states that the negro was convicted of stealing a watermelon, which the son of the owner of the patch had told him to take, State- Senator Henry D, Flood, Common wealths Attorney of Appomattox, heads the petition.Lynch. News."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "to take, State- Senator <mark>Henry</mark> <mark>D</mark>, <mark>Flood</mark>, Common wealths Attorney of"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "to take, State- Senator <mark>Henry</mark> <mark>D</mark>, <mark>Flood</mark>, Common wealths Attorney of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [605.04, 612.7, 759.7, 732.49], "bbox_id": "63d00b28de", "file": "AppomattoxNewspapers_1918-1922a_0255.pdf", "page": 1, "text": "-- IB  welcome the boys and girls of New Lon don Academy to our great school here. Prof. Crawley can handle them if arrange ments can be made. Lets get em here. Mrs. Henry D. Flood matched Mrs. Woodrow Wilson by pre senting her personal check for 100 to the Democratic cam paign fund of Virginia through"}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "get em here. Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> matched Mrs. Woodrow Wilson"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "get em here. Mrs. <mark>Henry</mark> <mark>D</mark>. <mark>Flood</mark> matched Mrs. Woodrow Wilson"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2081.5, 1174.01, 2242.16, 1325.25], "bbox_id": "bbcb2c1a2e", "file": "AppomattoxNewspapers_1915-1918a_0083.pdf", "page": 1, "text": "1 W H Ferguson, work on road ....... Z N Harris,   ....... 1R I Orange, labor-... .................. i. E Smith, supplies ...... - .............- IC B Tailor, work on road.............. Hoimsey Inge,   ............... J ft iifipor  ,,  J Shelfon Ferguson, wof k on road Steppe and Conner,  F A OBrien, on salary.................... R H Baber, work on road .............    J T U Conner, labor ........... .  81886015 D Almond, work on road.............. 1J R Bingham,  ........ ST Megglnson,  ......... E F Wifliauis,    ....... , ------ Grow,  ......... C D Almond, labor......................... . Henry Flood, catting tree out of riv e r- ......... . .............. Cabell Carter, work on H H Davis,  Ben Davidson,  A K iurues, V  f j A A w C Garrett, work on road"}, "highlight": {"text": {"matched_tokens": ["D", "Henry", "Flood"], "snippet": "F Wifliauis,    ....... , ------ Grow,  ......... C <mark>D</mark> Almond, labor......................... . <mark>Henry</mark> <mark>Flood</mark>, catting tree out of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Henry", "Flood"], "snippet": "F Wifliauis,    ....... , ------ Grow,  ......... C <mark>D</mark> Almond, labor......................... . <mark>Henry</mark> <mark>Flood</mark>, catting tree out of"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2137.68, 430.09, 2288.5, 618.94], "bbox_id": "4ff88d96b3", "file": "AppomattoxNewspapers_1918-1922a_0485.pdf", "page": 1, "text": "New Democratic Chief. Richmond. The State Democratic Committee will be called to meet in Richmond the latter part of this month, it was announced by Secretary Jaoob Brena- man Rorer A. James of Danville- Several names have been mentioned for the place, but, in view of the fact that the members of the committee are scattered all over the State, it has not been possible to Interview enough of them to gauge the strength of any of the men suggested for the office. General W. W. Sale, who managed Senator Trlnkles campaign for the governorship former Governor Henry C. Stuart, Congressman H. D. Flood and State Senator Harry F. Byrd, Winchester editor, have been men tioned tor the chairmanship."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "Flood"], "snippet": "the governorship former Governor <mark>Henry</mark> C. Stuart, Congressman H. <mark>D</mark>. <mark>Flood</mark> and State Senator Harry"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "Flood"], "snippet": "the governorship former Governor <mark>Henry</mark> C. Stuart, Congressman H. <mark>D</mark>. <mark>Flood</mark> and State Senator Harry"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1049.26, 451.6, 1222.79, 738.65], "bbox_id": "4bf915b14a", "file": "AppomattoxNewspapers_1939-1943a_0367.pdf", "page": 1, "text": "sys em of voting by mall we igno rant voters would like some more light on the subject than a general charge -of fraud. We thought if a voter had hs ballot fixed, put in the  ballot box and counted for the can didate he wished, that would not be i fraud. We are too ignorant to take  in a blanket charge of ?.-aud, if Mr. s Muse knows so well of the fraud, let him name the particular cases, who the ones were who committed the fraud, and have the voters in ques- ion witness .them stating that on ac count of fraud on the part of the election officials their votes were I not cast and counted for the candi date they wished to vote for. lUn 1901 and 1902 the Constitu tional Convention met, and we thought the main object was to have an abridged electorate. In that con vention were John W. Daniel, John Goode, William E. Cameron, H. D. Flood, Alfred P. Thoms, Carter Glass, Joe Wisor, Henry C. Stuart, John Garland Pollard, William Gor don Robertson, Walter Watson and lots of others might be mentioned. We thought these men were out standing in intellect, vision, inte-"}, "highlight": {"text": {"matched_tokens": ["D", "Flood", "Henry"], "snippet": "William E. Cameron, H. <mark>D</mark>. <mark>Flood</mark>, Alfred P. Thoms, Carter Glass, Joe Wisor, <mark>Henry</mark> C. Stuart, John Garland"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood", "Henry"], "snippet": "William E. Cameron, H. <mark>D</mark>. <mark>Flood</mark>, Alfred P. Thoms, Carter Glass, Joe Wisor, <mark>Henry</mark> C. Stuart, John Garland"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [512.88, 178.16, 674.06, 1054.2], "bbox_id": "5d188f8ddd", "file": "AppomattoxNewspapers_1918-1922a_0508.pdf", "page": 1, "text": "Col. A u c l oroil WrvuK State Chairman H. D. Flood, refuting the charge repeatedly made by Colonel Henry W. An derson, and spread through the State bv Republican campaign orators, that there were 45,000 persons in Virginia connected with or in the employ of demo cratic state and local authori ties, today gave out the follow ing statement  The Republican candidate for governor m his speeches makes the statement that there are over 45,000 persons con nected with or employed by the state and local govern ments of this Commonwealth. This statement before had been deliberately embodied in the Kepublican platform adopt ed at Norfolk and is being re peated by all or the orators the Republican party is send ing through Virginia to slander and traduce the state and its people. I have made careful inquiry to ascertain what baBis, if any, there is for these figures, and have been unable to secure any facts or figures that could by any stretch of the imagina tion justify this exaggerated statement. The following is a list of officers connected with the state and local governments of this commonwealth Examiners of Records 32. Judges 57, Officers and employ ees provided for in State Budget and various state institutions 3,400. 123 Local Boards of Re view, three months each 369. 23 Cities, average of twenty officers each, 460 100 Counties, average of tn officers each, 1 ,- 000. 450 Magisterial Districts, average of seven officers, 3,150. County and City treasurers 123. Clerks of Courts 127. Commit sioners of the Revenue 230 School Trustees 1,659. School Superintendents 109. Exam iners of Clerks of Courts 125 Total 10,841. I believe this number is a correct one, it is certainly ap proximately correct. I have uot included the 6,500 Notories Public because they are ap pointed for the convenience of the people and not only cost the state nothing, but actually pay the state five dollars each for their commissions. The total number of officers employed by the state and local governments are less than one-fourth the number claimed by Colonel Anderson. The Republican claim is but a sample of the inaccuracy of charges so freely set forth by the Republican candidate for governor and his followers Other statements and criti cisms of the administration of the affairs of Virginia by the successive Democratic ad mini strations are even more inac curate and misleading than that answered above."}, "highlight": {"text": {"matched_tokens": ["D", "Flood", "Henry"], "snippet": "WrvuK State Chairman H. <mark>D</mark>. <mark>Flood</mark>, refuting the charge repeatedly made by Colonel <mark>Henry</mark> W. An derson, and"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood", "Henry"], "snippet": "WrvuK State Chairman H. <mark>D</mark>. <mark>Flood</mark>, refuting the charge repeatedly made by Colonel <mark>Henry</mark> W. An derson, and"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [345.84, 239.69, 513.71, 1898.29], "bbox_id": "1b1fb03096", "file": "AppomattoxNewspapers_1918-1922a_0508.pdf", "page": 1, "text": "W ho W ill You V ote F or V ir gin ian s Halifax, Va., Sept. 26th., Speaking before a tremendous and enthusiastic audience -at Halifax this afternoon Con gressman H. D. Flood created a sensation by reading a letter from Judge George J. Hundley, of Farmville, addressed to the chairman of the Democratic S t a t e Central Committee, charging that Colonel Henry W. Anderson, in an address de livered at Farmville on August 30tb, had expressed himself as ashamed of the star in the United States flag which repre sented the State of Virginia. This astounding disclours fell as a thunder bolt upon the voters of the Fifth District who were present at the speaking. The letter, signed by Judge Hundley, the oldest circuit judge in Virginia, was written under date of September 9th. It was in reply to a communi cation from J. N. Brenaman, secretary of the Democratic State Committee. It reads in full, as follows Office of Geo. J. Hundley, Judge of the Fifth Judicial Cir cuit of Virginia. Farmville, Va , Sept. 9,1921. Hon. J. N. Brenaman, Sect. Democratic Committee, Richmond Va. My dear Mr. Brenaman Yours of the 6 th instant re ceived, and I write you, as ac curately as I can, what occur- at the time of Colonel Ander sons speech at Farmville. I note that you say the incident may be used by the committee. I have no objection to your using it,provided it is not based alone upon my statement, for it has been made public. It was published in the Farm ville Herald, and quoted and commented on by the Lynch burg News. I intended that it should be come buplic property, and that there should be no issue of veracity between him and my self, so I repeated to him what he had said, in the presence of the audience, and asked him if 1 had understood him correctly, and he admitted it. He saidWhen he was in the Balkans, trying to help and uplift those miserable people, he carried on the front of his automobile,the American Flag, and the women and chil dren would ccme up and kiss the flag, but that he was really ashamed to let them do this, for he felt that he was practic ing a fraud upon them, to al low them to kiss a flag having upon it a star representing the State of Virginia whose gov ernment was so unrepublican, so despotic, and so disgraceful as that of the State of Virginia. I waited quietly, until he closed, but before the audience dispersed, called upon him to explain thii.t statement, repeat ing what 1 had understood him to say. He did not deny it, but admitted it, with an awkward attempt to explain and which did not explain at all. I did not discuss anything with him but contented myself with Bay ing, Col. Anderson, there are men here who followed the flag of Virginia for four years in the Givil War, and those who fought for that Flag of ours in France, and shed their blood for it, and I want to say for them, that in all our history, there never has been a time, and there never will be a time, whilst the sun shines, that such a thing, as you have said, could be true of the Star repre senting our glorious old State on the Flag of our Common Country. W ith kind regards and best wishes, I am, Yours sincerely, Geo. J. Hundley. Judge Hundley, who presides over the fifth judicial circuit, is a veteran Virginia jurist and a veteran of the Givil War. He has a son, Lieutenant Robert G. Hundley, who saw service on the fighting front in France. Judge Hundley enlisted first with the Albemarle Howitiers, after which he served with the Fifth Vsrginia Infantry. He resigned from this regiment to enter the cavalry, in which arm of the service he remained until the close of the war be tween the states. He was seriously wounded while lead ing a cavalry charge. Lieutenant Robert G. Hund ley, also a war veteran, spilled bis blood in France in defense of the Stars and Stripes. His record was a brilliant one. He served with Company B., 306th Infantry, 77th Army Division with Company F., 120th Infan try, 30th Division, and with Company B., of the 369th New York. This latter regiment was brigaged with troops in the 161st French Army Divis ion, Fourth French Army. Lieutenant Hundley, who is now stumping for the Demo cratic ticket, was deeperately wounden in the campaign offensive on September 30th., 1918. Four major operations were performed on him and for some time his life was diapaired of. He saw eleven months active service in the Western front in France."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "afternoon Con gressman H. <mark>D</mark>. <mark>Flood</mark> created a sensation by"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "afternoon Con gressman H. <mark>D</mark>. <mark>Flood</mark> created a sensation by"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1813.45, 1535.19, 1976.0, 1777.2], "bbox_id": "216e3faa94", "file": "AppomattoxNewspapers_1892-1898a_0294.pdf", "page": 1, "text": "V IRGINIA, Appomattox Couny Before R. H. Poor Special Commissioner of said County to restore lost records. E. M. Noel and Comma his wife and Dais and Tempy his wife.  vs., petition, Jno B. Dickerson, Charles J. Dickenson, Fannie Fore. Beauregard Dickerson, Queen Price Lclia Mann, Gilliam Mann, Rosa Wil- kerson, John Wllkerson, Kobt. Dickerson, James Dickerson, Mollie Dickerson, Nannie Dickerson, Jno B. Terry William Terry, James Glover. Sami. Glover, Baby Glover, Aggfs Glove, Sami. H. Wooldridge, Joel L. Wool dridge, and David Shields. Affidavit having been made before me R. B. Poore Npeciai Commissioner as aforesaid that Robt Dickerson, James Dickerson, Mollie Dickerson, Nannie Dickerson William Terry, James Glove, 8aml Glover, Baby Glover, Aggie Glover, Sami. H. Wooldridge, Joel L. Wooldridge and David Shields are non resi dents of Virginia it is ordered that said non residents appear before roe at my office at  West Appomattox on May the 15th 1896 to de fend their interest in this suit. R. B. POORE. Special Commissioner MEMO The object of this proceeding is to restore to record a deed to300 acres ot land situated in said County which was conveyed by proper deed by Henry D. Dickerson Ad ministrator, C. T. A. of David Diokerson de ceased, to Joseph Dickerson. The. said deed and record of the samo having been destroyed by fire on the 2nd day of Feb. 1892. R. fi. POORE. Special Commissioner, H. D. FLOOD  U _  8. L. FERGUSON, t p  4 1M t"}, "highlight": {"text": {"matched_tokens": ["Henry", "D"], "snippet": "by proper deed by <mark>Henry</mark> <mark>D</mark>. Dickerson Ad ministrator, C."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D"], "snippet": "by proper deed by <mark>Henry</mark> <mark>D</mark>. Dickerson Ad ministrator, C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1653.07, 417.78, 1807.08, 1238.31], "bbox_id": "b2aecd7f0b", "file": "AppomattoxNewspapers_1918-1922a_0492.pdf", "page": 1, "text": "uivees Jonnin Armstrong and  Dickinson are gueets ol fr and Mrs. O. P- James. Miss Margarite Ellen Bell has JUTth. goe ol Mi B.oh.1 ferguson. Mias Flora Lawson is on a imping trip at Flannagane ood, Columbia, Va. . . .  Leon Anderson, of Lynchburg, ie visiting Mr. 8. Anderson, of Stonewall. Misses Jessie Harvey , Annie food Louise and Elizabeth lones and Hilda Baldwin are Juests of Mrs. E D. Caldwell iis week. Mrs. Mary Ann Thomas died L her home near Spout Spring, Sunday, in the 84th year of her be. Burial at Salem church. Misses Evelyn and Avis Rruwn and Miss Elsie Carson lave returned from a pleasant git to the Misses Walton at Burkeville. Great reduction in Ohervolet hare Four ninety 725 deliver- Ohervolet F. B 1090. E ula M ay B urke , Dealer. 8-17 4w Miss Ivie Profitt, of Lynch. Lrg Business College, spent khe week end with her sister, Ifrs. L. J. Morris. Messrs. R. L. Burke, H. D. flood and S. L. Ferguson are i Richmond on business. Ool. Joe Button and wife L ima through town Saturday In-route to his river farm in his oounty. Appomattox grows notwith standing the fact some of her own people are said to be fclosefisted. Mrs. J. W. Puckette has re sumed from an extended visit o relatives and friends in pbarlotte county. Mr. and Mrs. J. A. Booker jtnd children, of Roanoke, are visiting Mr. C. R. Woodall, pear Hollywood. Cashier Dickerson and Rob rt Harrison, of the Peoples National Bank were visitors here last week. Mr. George Brodie, of Peters burg, and Mr. Henry Robert loa, of Washington, D. C., have peen on a visit to Mr. and Mrs. L Ferguson."}, "highlight": {"text": {"matched_tokens": ["D", "flood"], "snippet": "R. L. Burke, H. <mark>D</mark>. <mark>flood</mark> and S. L. Ferguson"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "flood"], "snippet": "R. L. Burke, H. <mark>D</mark>. <mark>flood</mark> and S. L. Ferguson"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.5, 1549.72, 1961.12, 1807.12], "bbox_id": "00aea36394", "file": "AppomattoxNewspapers_1892-1898a_0292.pdf", "page": 1, "text": "Ü í FBBGUbON. p q 4-9-41. V IRGINIA, Appomattox Couny Before B. B. Poore Special Commissioner of said County to restore lost records. E. M. Noel and Comma his wife and Datls and Tempy his wife. vs., petition, Jno B. Dickerson, Charles J. Dickenson, Fannie Fore. Beaugard Dickerson, Queen Price Leila Mann, Gilliam Mann, Bora Wil- kereon. John Wllkerson, ttobt. Dickerson, James Dickerson, Mollle Dickerson, Nannie Dickerson, Jno B. Terry W i 1 liam Terry, James Glover. Sam. Glover. Baby Glover, Aggls Glove, Sami. H. Wooldridge, Joel L. Wool dridge, and David Shields. Affidavit having been made before me B. B. Poore pedal Commissioner as aforesaid that Bobt Dickerson, James Dickerson, Mollle Dickerson, Nannie Diekerson William Terry, James Glove, ami Glover, Baby Glover, Aggie Glover, Sami. H. Wooldridge, Joel L. Wooldridge and David Shields are non resi dents of V irginla It Is ordered that raid non rest ients appear before me at my office at West Appomattox on May the lth 1896 to de fend their Interest In this suit. B. B. POORS. Special Commissioner, MEMO The object of this proceeding Is to restore to record a deed to900 acres ot land situated In raid County which was conveyed by proper deed by Henry D. Dickerson Ad ministrator, C. T. A. of David Diekerson de ceased, to Joseph Dickerson. The raid deed and record of the samo having been destroyed by fire on tbe 2nd dav of Feb. 1892. B. B. POORB. Special Commissioner, H. D. FLOOD l n n 8. L. FERGUSON, f pq 4 4t"}, "highlight": {"text": {"matched_tokens": ["Henry", "D"], "snippet": "by proper deed by <mark>Henry</mark> <mark>D</mark>. Dickerson Ad ministrator, C."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D"], "snippet": "by proper deed by <mark>Henry</mark> <mark>D</mark>. Dickerson Ad ministrator, C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1820.89, 1550.02, 1986.26, 1791.52], "bbox_id": "cf3966dcfd", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "TTIBGINIA, Appomattox Couny V Before H. B. Poore Special Commissioner of said County to restore lost records. E. M. Noel and Comma his wife and Dais rod Tempy Ills wife. vs., petition, Jno B. Dickerson, Charles J. Dickenson Fannie Fore. Beauregard Dickerson, Queen Price Leila Mann. Gilliam Mann, Rosa Wil kerson John Wilkerson. Kobt. Dickerson James Dickerson. Mollie Dickerson, Nannie Dickerson, Jno B. Terry William Terry, Jame Glover. Sami, lover. Baby Glover, Aggi Glove, Sami. II. Wooldridge, Joel L. Wool drids-e, and David Shields. Affidavit having been made oefore me K. B, Poore special Commissioner as aforesaid that Robt Dickerson. James Dickerson, Mollie Dickerson, Nannie Dickerson William Terry James Glove, Sami Glover, Baby Glove Aggie Glover, Sami. 11. Wooldridge. Joel 1 Wooldridge and David Shields are non rcsl-1 dents ef Virginia it Is ordered that said non I residents appear before me at my office at West Appomattox on May the 15th 1896 to de fend their Interest In thlSj8UpQ0 jE Special Commissioner, M E M O T h e object of this proceeding is to restore to record a deed to 300 acres ot land situated In said County which was conveyed by proper deed by Henry I. Dickerson Ad ministrator, C. T. A. .of David Dickerson de ceased, to Joseph Dickerson. The said deed and record of the same having been destroyed by fire on the 2nd davof Feb. 1892.  K. B. POOKE. Special Commissioner, H. D. FLOOD In  4-0-4t S.L. FERGUSON,  p"}, "highlight": {"text": {"matched_tokens": ["D", "FLOOD"], "snippet": "POOKE. Special Commissioner, H. <mark>D</mark>. <mark>FLOOD</mark> In  4-0-4t S.L. FERGUSON,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "FLOOD"], "snippet": "POOKE. Special Commissioner, H. <mark>D</mark>. <mark>FLOOD</mark> In  4-0-4t S.L. FERGUSON,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [729.1, 317.87, 895.11, 1071.1], "bbox_id": "fed8fb21f7", "file": "AppomattoxNewspapers_1908-1909a_0133.pdf", "page": 1, "text": "To the Clark Office of the r lrcnlt court of A the County of Appomattox on the ttb d a ro i August 1927. Marys. Klimoo in her own right and Littleton Howard Kilmon, her husband Plaintiffs against 3, Orausbeory Sawyer, in his own right and I nune Sawyer, bis wife, and ethers Defends ts The objeet of this suit Is to bave partition of the real estate In Appomattox County. Virginia, of whloh the late Anna V. Saw yer, died seised and possessed. And an affldawft laying been made and filed that the defendenc 3. G. Sawyer and Laune Sawyer arewOt residents of the State of Va. it is ordered Mist they do appear within 15 days after due pabUoation hereof, and do what maybe necessary to protect their inter est In this soli. And it is lurtber ordered th at a copy hereof be published onee s week for four suoceeslre weeks In the Tims-Vir gin Ian, a newspaper published in the County of A pomattox. and that a copy be posted at ths front door of the Court, House of th s C runy on or before the ith day of August, 1997, that being the next succeeding Rule day after this order was entered. A copy1Testet C. W. Fmith, Clerk. Somers h Flood, p. q, 9-11-97 4t T Trustees Sale OF 180 ACRE FARM In Stonewall District, Appo mattox County, on public road from Vera to Bent Creek. Pursuant to the terms of a cer tain deed of trust from John L- Logan, unmarried, dated Septem ber 27th, 1923, and of record in the Clerks Office of the Circuit Court of. Appomattox County, Virginia, in Deed Book 23,. at page 406, default Raving been made in thè payment of the debt therein secured and being re quested so to do by holder of the debt,tbe ttodersigned wifi-nelF at public auction at the front door of Appomattox Courthouse on - ..   ... SATURDAY, AUG. 20,1927 at 11 oclock A, M. That certain valuable farm of 180 acres, more or less, in Stone wall District, AÉPomattox, Va., and adjoining the lands of Henry D. Johnson, Tom Irvine, W. T. Gunter,. and others, and upon which A. J. Shockley formerly resided. This farm is about 4 miles nerthwest of Vera, and fronts the public road leading to Bent Creek, about one-half mile. On this farm there is a dwelling of some 3 or four rooms and several out buildings. The land is well watered, and ati can be profitable worked. Term s. Cash. Taxes and in surance prorated.  M ayo C. B rown , Trastear F. E. T urner , J r ., Trustee. Better terms may be arranged upon application to F. E Turner, Jr., Trustee, 1101 Church S t, Lynchburg, Va before day of ate.  8-4-27 3t"}, "highlight": {"text": {"matched_tokens": ["Henry", "D"], "snippet": "adjoining the lands of <mark>Henry</mark> <mark>D</mark>. Johnson, Tom Irvine, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D"], "snippet": "adjoining the lands of <mark>Henry</mark> <mark>D</mark>. Johnson, Tom Irvine, W."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.25, 421.88, 1695.99, 1392.91], "bbox_id": "91ce3e8732", "file": "AppomattoxNewspapers_1902-1905a_0491.pdf", "page": 1, "text": "The following distinguished  ar- olinians were present Gov. Glenn, Chief-Justice Walter Clark, General James I. Metts, General W. P. Roberts, Major Henry A. London and wife, udjutant-General Theo dore Garnett, now of Norfolk Sec- retary-of-State Bryan Grimes, Ad jutant-General T. R, Robertson, In surance Commissioner J . R. Young, General Julian S. Carr, Henry Je  rome Stockard, who composed the ode for the day Gapt. W. T . Jenk ins and wife Major E . J . Holt, Mrs. Mary Grimes Smith, daughter of the late General Grimes Superin tendent J . S. Mann, of the State prison Ool. Charles E. Johnson, Col. Benehan Cameron, Captain W. H. McLaurin, Captain T. M. A r rington, State Senator T. A. Ricks, Dempsey Grimes, Austin Grimes, Col. Thomas S. Kenan, Cyrus B. iVatson, of Winston Major W. A. Smith aud others. The North State press was repre sented by Josephus Daniels, Editor of the News and Obser - er, Raleigh Sanford L. Rotter of the Post Raleigh Col. F. A, Olds, correspond ent, Raleigh Dr. A . J . McKelway, Presbyterian Standard and the News, Charlotte K . R. Hoyle, of the Times, Raleigh, and C. M. Poe, Progressive Farmer, Raleigh. Forty years after the surrender the table on which the terms of sur render of the army of Northern Virginia were written, was present ed to the war department by Mrs. Elizabeth B. Custer, wife of Gen. George B. Custer. It was given her by General Sheridan, April 10, 1865. Col. Marshall, C. S .. A. says it is the same table. Social Event The home of Mrs. J . R. Atwood, at West Appomattox, was the cen ter of in terest before and after the ceremony, foi it was there the dis tinguished visitors were received and entertained with old Virginia hospitality. A luncheon was given by Mr. and Mrs. Atwood and Con gressman H . D. Flood. A commit- te of Lynchburg ladies, who went from Lynchburg on Governor Glenns special car, assisted Mrs. Atwood. They were Mrs. A. F. Anderson, Miss Mollie Early, Mi-s Hettie Bagly, Mrs. A. T . Powell, Mrs. Mary Nowlin, Mrs. Hubert Watts, Miss Lucy Langhorne and Mrs. M. L. Harvey. Among the other guests of Mr. and Mrs. Atwood were Major Lon don, Mrs. Moffitt, Colonel Carr,Gen eral Grimes, Mrs. Mary Grimes Smith, Miss MacGill, Mrs. Hall, Mrs Garland Jones,Governor GLpti, Gov ernor Montague, Colonel Beneham Cameron, Colonel Fred A. Olds, Mr. Josephus Daniels, aDd Mr. Harrison Watts. Among the guests and callers of Mr. and Mrs. C. W. Hunter during the North Carolina unveiling were Maj and Mrs. George A . Arrnes Vahtng,inn. Mrs, Kirkwood Otey, Mr. W. T. Simpson, M 8. G. H Jones, Mis. Hale, Gov. Glenn and p.,rty. Dr. C. W. Jones, Mr. 1. S. Evan, Mis- Gladys Jenkins, Capt. Turner, Col. Carr, Col. and Mrs. London, Maj. Johnsotl, Gov A. J, Montague, Col. Wines aud Gen. Roberts. ______ ___________  the pri-"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "and Con gressman H . <mark>D</mark>. <mark>Flood</mark>. A commit- te of"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "and Con gressman H . <mark>D</mark>. <mark>Flood</mark>. A commit- te of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.19, 544.1, 1980.92, 1388.09], "bbox_id": "be728430e3", "file": "AppomattoxNewspapers_1939-1943a_0294.pdf", "page": 1, "text": "The Appomattox met JTbeaday night. Dr. and Mrs. Havilah Babcock, of  Columbia, S. C., will arrive thisj week-end to spend the summer at  Hotel Appomattox. Mrs. L. M. Ringham, of Bluefield,! spent several days here this week with her parents, Mr. and Mrs. J. H. Cheatham. Mrs. Ringham had been to Columbia, S. C., to attend j the graduation exercises at the University of South Carolina, where her daughter, Alice Bright, was among the graduates. Huck Babcock, of Columbia, S. C., has arrived to spend the sum mer at Hotel Appomattox. He re ceived his B. A. degree this year  at the University of South Caro-  lino. Mrs. S. J. Evans and daughter, I Ann, of Lynchburg, spent Tuesday  with Mrs. Clarence Evans. A. F. Godsey. and Ray Godsey,  who hold positions at Radford, were   home for the week-end. We are sorry to hear that R. F.  Jamerson continues sick. The Appomattox baseOall team  plays in Buena Vista Saturday, in  Altavista Sunday and in Blackstone  Monday night. Mrs. H. D. Flood, and son, Boll-J ing, of Washington, are spending several days this week at Hotel Ap pomattox. Mrs. S. J. Jones has returned from an extended trip to relatives in Tennessee. We are sorry to hear that F. L. I Martin is sick. Mr. and Mrs. J. A. Smith were recent guests of Mrs Alfred1 Dots, of Concord. Mrs. Jim Gunter and Mrs. Eddie Guntcir were recent visitors in the home of Mrs. J. A. Smith. John Booth, of Lynchburg, was in Appomattox Sunday. Mrs. Eddie Sadow..xi. of Balti more, visited her parents, Mr. anJ Mrs. I. G. Smith last week. Miss Colyer Smith was a recent guest of her sister, Mrs. Henry Perdieu. Mrs. Eva Roth and grandsons, Fred, Jr., Bobby and Billy Roth, and Fred Hatch, J r, of Philadelphia spent the holidays with Mr. and Mrs. R. N. Dawson and Mrs. Mattie Traylor. Mr. and Mrs. Dan Brown ing, of Richmond, also visited in the same home. Mrs. Mattie Traylor is in New port News. W. W. Scott, of Bla.kstone w hpme for the week-end. Miss Ansie Hancock, of Salem, will be home this week-end. Miss Rebecca White is out after a tonsil operation. Garland Morris, of V. P. L will arrive this week-end to spend the slimmer here with his parents. Mrs. Albert Baird spent last night at her home in Buckingham. Miss Susie Plunkett, of Chatham,"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "Monday night. Mrs. H. <mark>D</mark>. <mark>Flood</mark>, and son, Boll-J ing,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "Monday night. Mrs. H. <mark>D</mark>. <mark>Flood</mark>, and son, Boll-J ing,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "W. C. Franklin, H. <mark>D</mark>. <mark>Flood</mark>, Samuel L. Ferguson, Joel"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "W. C. Franklin, H. <mark>D</mark>. <mark>Flood</mark>, Samuel L. Ferguson, Joel"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [553.92, 790.13, 818.75, 876.22], "bbox_id": "76b39bc3a0", "file": "AppomattoxNewspapers_1898-1902a_0165.pdf", "page": 1, "text": "Rv. Henry Brown, au aged col- p a st thjs anuounce -1 ored preacher died on the farm of Beet to the action of Mr. H. D. Flood Monday of paralysis. ic primary. I thank pr their kind support C0luty has escaped the inl and hope it will be ccssity for compulsory vaccination, ire to again elect me  hut vaccination should he kept up by the people."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "action of Mr. H. <mark>D</mark>. <mark>Flood</mark> Monday of paralysis. ic"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "action of Mr. H. <mark>D</mark>. <mark>Flood</mark> Monday of paralysis. ic"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1814.4, 976.11, 1990.25, 1485.06], "bbox_id": "dc676e9c23", "file": "AppomattoxNewspapers_1892-1898a_0335.pdf", "page": 1, "text": "rer-gusen, g,  alle, V. 1 . 1 uge,Hector an T. L.  Evans,Jas. Connor, 1 Cawthorn, V. T. . Wm HLitlid-e, j V. m. McCormacks r , . J, Wr j fo. F. Inge, S. W. Cra. Rutledge, Harry H. lDge,J. W. .  1 Jno. Lucado, Wm. McCormack, jr., Sam Marsh,Col. T. J. M. Cheatham, EVE. Chism, W. P. Gills, Henry P. Gills, Jno. W. Snell, R. 11. Brown ing, A. N. Harvey, S. W Harvey, B. F. Gunter, W. E. Wooldridge, C. T. Evans, Tom Finch, Will Finch, Don Foster, J. N. Wooldridge. On motion of Mr.. J. L. Davis, the club was named Evergreen Free Silver Club. The chair being empowered, the following committees were ap pointed. On Engagement of Speakers Messrs. J. P. Fergnson, S. M. Ran som and C. T. Evans. On lights and hallMessrs. B. F. Gunter, W. E. Wooldridge and E. E. Chism. On RegistrationMessrs. C. N. bbitt, B. F. Gunter, Jno D. Caw thorn and S. W. Harvey. The club was made  committee of a whole to solicit members and will meet every two weeks, the next meeting being Saturday night before the second Sunday in September. lion. H. D. Flood the Democratic nominee from this district was on hand and made a ringing speech of al.out one hours duration, devoted principally to free silver and was well applauded throughout. W. P. G ills , President."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "in September. lion. H. <mark>D</mark>. <mark>Flood</mark> the Democratic nominee from"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "in September. lion. H. <mark>D</mark>. <mark>Flood</mark> the Democratic nominee from"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.03, 765.3, 1900.15, 1298.29], "bbox_id": "8ad8b36b88", "file": "AppomattoxNewspapers_1892-1898a_0159.pdf", "page": 1, "text": "pupils, and reflected no little ability this county are preparing on the part of the teachers in the art of training the young idea to shoot, and how to keep pace with the most advanced ideas of learning in Physics Technology and Hygiene. Medals and prizes were awarded to the following pupils To Miss Lillian Stinson, for proficiency in English, and to Master Luther Stinson, for proficiency in Junior Mathematics, both of whom also received schol arships, tbformer for four years, thé latter for one to Master Sam Scott, for punctual attendance  to Master Joe Amiss, for proficiency in Spelling. There were several visitors from Albemarle, Nelson, and Appomattox counties, also Richmond City and there would have been many more but for the change of time. The Polk Miller combination, Hon. Jno. E. Massey and others came, but could not remain till the commence ment, on account of pre-engage ments. Hon. H. D. Flood, State Senator from Appomattox and a risiug young lawyer who took quite a prominent stand in our last General assembly, and who is now a candidate for nom inated to Congress from this district, in opposition to the lion. Henry St. George Tucker,beingpreseu t and call ed upon,gave us a very happy, inter esting and forcible speech on the line of education. His address made a fine impresseon. Mr. Flood, I can confidently say, made many friends and metliinks, deservedly, and if he continues to gain in popularity, as he has commenced Hon. Henry St. Geo. will have no walk over, I assure you. S."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "pre-engage ments. Hon. H. <mark>D</mark>. <mark>Flood</mark>, State Senator from Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "pre-engage ments. Hon. H. <mark>D</mark>. <mark>Flood</mark>, State Senator from Appomattox"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [418.79, 232.83, 557.39, 596.11], "bbox_id": "3cf0f34b62", "file": "AppomattoxNewspapers_1974-1975a_0396.pdf", "page": 1, "text": "Mrs. Eleanor Flood Schoel- Ikopf, 58. of 2733 25th S t, Washington, D.C. died Thurs day in the Washington Hospital Center. Born in Washington, D.C., she was a daughter of the late congressman Hal D. Flood and Anna Portner Flood. She lived her early childhood at Eldon, the Flood estate home in Appomattox. She was a member of St. M argarets Episcopal Church, Washington, D.C. and the Robert E. Lee Foundation. She is survived by her husband, Walter H. Schoel- lkopf, Jr. of Washington, D.C. two sons, Walter H. Schoel- lkopf III of Snowmass, Colo, and Henry Flood Schoelkopf of Washington, D.C. a daughter, Anna S. Lacher of Aikens, S.C. a brother, Bolling Byrd Flood of St. Petersburg, Fla., and a grandson, David Flood Lacher of Aikens, S.C. Funeral services were con ducted in Appomattox at 2 p.m. Tuesday from Memorial Meth odist Church by Rev. Floyd M. Lucas. Entombment was in the Flood family mausoleum, Ap pomattox."}, "highlight": {"text": {"matched_tokens": ["D", "Flood", "Flood"], "snippet": "the late congressman Hal <mark>D</mark>. <mark>Flood</mark> and Anna Portner <mark>Flood</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood", "Flood"], "snippet": "the late congressman Hal <mark>D</mark>. <mark>Flood</mark> and Anna Portner <mark>Flood</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2178.01, 1397.24, 2342.62, 1796.27], "bbox_id": "c2ccce5843", "file": "AppomattoxNewspapers_1902-1905a_0068.pdf", "page": 1, "text": ".Major Flood H as Work - Done Here. Mr. T. J, Orndoff, the marble worker,of this city, today shipped to Major Joel W. Flood, of Appo mattox Court House, Ya.. father of Mrs. K. E. Byrd, of Winchester, seven pieces of marble work which will mark the graves of Major Floods relatives. Thy stones are elaborately land b-autifully worked. They con tain tbe following inscriptions ! Col, Henry De La Warr Flood. Horn Aug. 14, 1864. Died April 21,1872. Uh il. tttli, wkure la thy atlus- Oh rare, where Is thy victory? Eliza Bolling, West. Wife of Dr. J. W. Flood. Born May 6, 1798. Died April 19, 1864.. . tBIessed are tbe pure in heart  Dr. Joel Walker Flood. Born July 11, 1799. .Died April 19, 1859. lie rests from his labors and bis works do follow hiui  Ella W. Faulkner. Wife of Maj. J. W, Flood. Born July 28, 1844. Died Oct. 31, 1884. I am the resur rection and the life.  Holmes Boyd Flood. Born 8ept. 28, 1866. Pied Sept.,-28,1872. Suf fer little children to-oome unto me. Mary Kliazbeth Trent Wife of Col. H. D, Flood. Bora July 10. 1822. Died Jan, 2fi, 1839. Blessed I re the dead who dis in tbe Lord.  Jennie C. Pleasant Wife of Ma- j r J. W. Flood. Born Jan. 30.1838.  Med Tone 5. 1889. She has gone ! her reward. Winchester Star."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "Wife of Col. H. <mark>D</mark>, <mark>Flood</mark>. Bora July 10. 1822."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "Wife of Col. H. <mark>D</mark>, <mark>Flood</mark>. Bora July 10. 1822."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.35, 520.92, 1780.2, 1201.17], "bbox_id": "16376684b9", "file": "AppomattoxNewspapers_1892-1898a_0147.pdf", "page": 1, "text": "Lively Times in the Tenth. A Richmond correspondent of the Washington Post reviews at length the political situation in the tenth congressional district of Virginia, and speaks as follows of the situation in this the Tenth district There will be a livelier racket for the Democratic nomination in the Tenth tnan in any other district in Virginia. It is now represented by Mr. Henry St George Tucker, who is serving his third term. He will be opposed for the nomination by State Senator H. D. Flood, of Appo mattox county, and who is a nephew of Senator Faulkner, of West Vir ginia. Mr. Flood is also distantly related to the Tuckers, bnt kinship does not prevent him from doing all he can to get the nomination. Another strong competitor for the nomination will be State Senator Pink Jones, of Highland county, He is ranked as the ablest man now in the Btate senate, and will make strong fight against Tucker. It also said that State Senator Echols, of Staunton, Mr. Tuckers home town, will be a candidate, and if he comes out there surely will be trou ble for the member from the Tenth. Senator Flood was a warm supporter of Thomas S. Martin, of Albemarle, for United States Senator. In fact, he was one of his managers, while Tucker sympathized with General Lee, and the Martin following, being powerful one in the state, they will naturally do all they can to help Flood to capture the nomination, As there is any chance of Tucker getting the nomination General Fitz- hugh Lee, who lives in the district, will not permit his name to be used in connection with the congressional nomination, bnt if it becomes known that Tucker is about to be knocked out it is more than likely that Gen eral Lee may be brought forward as a compromise man. At any rate, it looks as if there would be a red-hot fight in the Tenth. It is believed that Ex-Congressman Yost will be the Republican nominee in the dis trict this year. It is conceded he can have the nomination if he wants it."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "by State Senator H. <mark>D</mark>. <mark>Flood</mark>, of Appo mattox county,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "by State Senator H. <mark>D</mark>. <mark>Flood</mark>, of Appo mattox county,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.78, 180.29, 1906.47, 993.81], "bbox_id": "3d71aedee5", "file": "AppomattoxNewspapers_1974-1975a_0268.pdf", "page": 1, "text": "listeners a brief history of Virginias efforts during Civil War and urged the erowd to preserve its countys history and accom plishm ents.  J patriotic appeals stirring e crowd to frequent appl e 1 urged the women especially i become interested, saying t men talk but women act   After encouraging the people o j keep up the work of marking i the local battlefield until it was properly completed and refu - ing North Carolinas claim that her men were last to fight at Appomattox, Senator Dame j ended his speech and com- menced shaking the hands of well-wishers as the chorus of singers sang The Sweet Bye and Bye. The monuments cornerstone was then laid by the Masons with the Hon. H. D. Flood giving the Masonic address. After the formal portion of the ceremonies ended, it was announced that a dinner had been prepared for. all present with old soldiers given the right of way to the tables. In an after dinner speech, former Confederate General Thomas T. Munford, present at Appo mattox in 1865 as a leader of cavalry, spoke feelingly of his old commander Robert E. Lee. The days events were judged by all to have been a success and promises to return for the monuments unveiling the next May were made as the crowd separated for their homes. The monument was indeed dedicated the next year and ever since has stood with its soldier perched above silently watching the movement of the countys citizens on Court Street below. Almost 70 years have passed since that Saturday in the fall of. 1905 when Appomattoxs war dead were remembered and honored. Their sacrifice and that of those sons who have fallen in battle since will again be remembered in May of this year. May we never forget today what so many gave - yesterday. LOOKING BACK... 1. She organized the Appomat tox Chapter, U.D.C. a. Mrs. Andrew Dreszer b. Mrs. Richard Baron c. Mrs. Chas. Hunter d. Mrs. J. R. Atwood 2. He designed and built the Conf. Monument, a. Jacob Oyle b. J. Henry Brown c. Thomas Caldwell d .r Donald Brantley 3. The pair operated a store in. Evergreen"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "with the Hon. H. <mark>D</mark>. <mark>Flood</mark> giving the Masonic address."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "with the Hon. H. <mark>D</mark>. <mark>Flood</mark> giving the Masonic address."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.89, 1427.42, 816.09, 1957.79], "bbox_id": "c926eabaf7", "file": "AppomattoxNewspapers_1898-1902a_0406.pdf", "page": 1, "text": "Karl. The LadieB Aid Society of Bethel church will give an oyster supper with other refreshments and a char ade in the afternoon and night of Wednesday, December 26th at Mr. G. Andie Al viss instead of Mr. Ber nard Chicks as stated. The pro ceeds will be given towards the building of a parsonage. Come kind friends and help in tbis needed cause. If the weather on the 26th of December is not favorable the en tertainment will be tbe next fair day. Come one come all for we are going to have a gi and time. I see that Vermont Legislature has passed a bill prohibiting the sale of cigarettes iu the State. I wish old Virginia would do tbe same. Will some one please see our friend H. D. Flood and ask him if he will do all he can iu behalf of our Virginia boys iu this cause, for cig arettes are sending more boys to the asylum and death tnan any one curse we kuow of. If nothing else cau be done bring it before the peo ple and we will vote them out of j Virginia so quick that it will make your head swim. Will all fathers look to this matter in behalf of his boy. Messrs. Sampson Moore and Ar sen Leet have returned from Buck ingham on a deer hunt. We have not learned their success bat hope they had a grand old time. The farmers are selling their to bacco as fast as they can get it ready for market in tbis section. Mr. Ed Owen last Saturday got 9 for over 2000 pounds. Mr. Ed Alvis, who has been very ill is somewhat better. Mr. Huie Tanner, of Hagerstown, Md., visited his sister Mrs. Henry Anderson on Saturday and Sunday last. sw"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "see our friend H. <mark>D</mark>. <mark>Flood</mark> and ask him if"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "see our friend H. <mark>D</mark>. <mark>Flood</mark> and ask him if"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [678.23, 739.04, 840.54, 1457.03], "bbox_id": "b2df7eac5f", "file": "AppomattoxNewspapers_1915-1918a_0271.pdf", "page": 1, "text": "FourthWalter A crat, re-elected over Republican. FifthE. W. Saunders, Democrat, re-elected over Beverly Davis, Republi can. SixthCarter Glass, Democrat, re elected over George W. Wilson, Re publican. Seventh  Thomas W. Harrison, Democrat, defeated John Paul, Re publican. EighthCharles C. Carlin, Demo crat, re-elected over John L. Crupper, Republican. NinthC. Bascom Slemp, Republi can, re-elected over E. Lee Trinkle, Democrat. TenthHal D. Flood, Democrat, overwhelmed Charles P. Nalr, Re publican. The constitutional amendments were not voted upon, because the Legisla- I ture failed to provide the necessary ! machinery for putting the question be- j fore the people. Delaware.Complete unofficial re turns from all districts in Delaware  show that Charles E. Hughes carried j the State by a plurality of 1,798. The vote was as follows Hugh, 27,909 Wilson, 26,111. The complete vote for United States Senator was Josiah O. Wolcott, Dem., 25,326 Henry A. du Pont, Rep., 22,974. For Congress, Thomas W. Miller, Rep., 24,021 A. F. Polk, Dem., 23,890. For Governor, John G. Townsend, Rep., 26,174 James H. Hughes, Dem., 28,171. The Democrats selected their candi date for attorney general. New JerseyWith 12 counties com plete and 25 small districts missing in the eight remaining counties, Charles E. Hughes presidential plurality was 54,774 over President Wilson. The vote for Hughes was 262,386 and for I Wilson was 207,612. Walter E. Edge, Republican candi- I date for governor, ran ahead of the presidential plurality In his successful contest against H. Otto Wittpenn, Democrat. With 25 districts missing Edge polled 241,795 votes, against 174,- 730 for Wittpenn, or a plurality of 67,065. New York.The Republicans made a clean sweep of New York State, with Governor Whitman running ahead of Hughes, and William Calder, United States senatorial candidate, far ahead of his running mates. The following are the pluralities Hughes over Wilson, 155,000 Whit man over Seabury, 200,000 Calder over McCombs, 220,000. Pennsylvania.Charles E. Hughes has carried the State by about 200,000 plurality. Philander C. Knox was elected to the Senate by the Republicans by a  large plurality, and the entire Republl-  can State ticket also was successful  by a plurality a little less than that for Hughes. South Dakota.Hughes has carried South Dakota by a plurality of 15,000. i The prohibition amendment was  adopted by 20,000 and the suffrage"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "Lee Trinkle, Democrat. TenthHal <mark>D</mark>. <mark>Flood</mark>, Democrat, overwhelmed Charles P."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "Lee Trinkle, Democrat. TenthHal <mark>D</mark>. <mark>Flood</mark>, Democrat, overwhelmed Charles P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [728.67, 312.73, 887.87, 490.03], "bbox_id": "bdf2828ef6", "file": "AppomattoxNewspapers_1922-1923a_0007.pdf", "page": 1, "text": "Fiood who died at nis horuu ia W ash  ington, D O , on D-c 9th, last, ia valued at approxim ately 87,000, according to the petion for ancillary lett-.-rs of adminis tration of the estate filed in probate court ia W ashington ay Henry Flood Byrd, admin iitrator. The widow, Mrs. Anna P Flood, aud to chil iren, Bailing D ami Eleanor F. Ftood are the heirs at laws. ihe above is taken from a W ashington D ispatch, which"}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "ia W ashington ay <mark>Henry</mark> <mark>Flood</mark> Byrd, admin iitrator. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "ia W ashington ay <mark>Henry</mark> <mark>Flood</mark> Byrd, admin iitrator. The"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1943.97, 277.23, 2124.2, 1757.62], "bbox_id": "ec465d0b43", "file": "AppomattoxNewspapers_1902-1905a_0573.pdf", "page": 1, "text": "Dr. W. W. Moore, president of the Union Theological Seminary, Richmond, has been called to Blowing Rock, N. C., to the bedside of his son, Francis, who is ill with typhoid fever. Congressman H. D. Flood predicts that Congressman Swanson will defeat Judge Lewis for Governor by at least 25,000. , The Chautauqua which will be held September 7 to 18 in Roanoke will in clude the Otterbrin Quartet, Miss Edan George, of Boston Jahu DeWitt Mil ler, Dr. W. L. Davidson, of Washing ton Dr. William Spurgeon, of England Rev. Sam P. Jones, Prof. P. M. Pear son, Prof. W. B. Patty, the scientist in liquid air, radium and wireless teleg raphy Ellsworth Plumstead, Lon J. Beauchamp, Capt. Richmond Pearson Hobson and Dr. A. A. Willets. A family horse driven to a buggy by Mrs. Newton K. Larrick, of Bayfield, became frightened at an automobile sev eral miles west of Winchester and ran away, throwing out Mrs. Larrick, who was caught in the reins. Mrs. Larrick, who was dragged on the ground for a long distance, was picked up in what was at first believed to be a dying con dition, but she finally regained her senses. She was badly cut and bruised and suffered severe nervous shock. The automobilists were not caught. While, the syndicate that has under taken the extension of the South and Western Railroad from the Virginia coal fields to a point on the South Atlantic oast is busy with the construction work in the North Carolina mountains, and also has several forces of men at work in Southwest Virginia, there is another project on foot to carry Virginia coal to the coast by a direct route. Henry K. McHarg, who owns the Vinginia and Southwestern Railroad, has deter mined to build a road from Clinchport to the Toms Creek Mines,, in Wise coun ty, Va., on practically the same route se lected by the South and Western peo ple. Mr. McHarg is having his proposed route surveyed and is said to be accu mulating material for construction work. There is a rumor that Mr. McHarg and Thomas F. Ryan, whose cash is back ing the other project, have been in inference with a view to joining capi tal and constructing only one road in stead of two. Dr. I. E. Huff and Mr. Francis, broth- r of the late Maurice Francis, who a month ago was assassinated in Floyd county while on his way to visit his sweetheart, have employed Hoge  Penn, of Roanoke, and Hon. J. C. Wysor, of Pulaski, to assist in the prosecution of John Richards, the young University of Virginia student, who is charged with the crime. The defense has secured the services of Judge Phlegar, of Christians- burg. Miss Grace Arcnts, one of the wealthi est women of Richmond, has been op erated on for appendicitis at her hand- gome home in that city. Her condition is favorable. Miss Arents is a niece of the late Major Lewis Ginter, the tobacco millionaire . She has won a State-wide reputation by her charities and church work. C. C. Williams, of Crewe, a freight conductor on the Norfolk and Western Railway, was very seriously injured at Fords Depot. He was poling some cars, and, in stepping back on an oppo- site track, lie wgs struck snd knocked down by a locomotive. The locomotive ran over his arm and crushed it so badly that amputation was necessary. Wil liams was badly bruised about the body and his condition is critical. The body, of a . one-armed unknown negro was found in the Appomattox River, near Bates Spring, in Prince George county, a short distance from Petersburg. Around the negro s neck was a rope and on him was found a re volver. Mr. Bishop Weaver Stern, of Harri sonburg, and Miss Lucy F. Dovel, daughter of Mr. David I . Dovel, of Alma, were married in the Luray Cav erns at Luray. Elder John R. Daily, of the Primitive Baptist Church, officiated. The attendants were Mr. Floyd Dovel, of Harrisonburg, and Miss Annie Coff man, of Luray. This is the eleventh marriage that has taken place in the Caverns since their discovery in 1878. A recent compilation of the records of Fairfax county gives some interest ing data relative to the wealth of George Washington. Washington inherited Mt. Vernon fromhisbrotherLawrence in I 75 2 but did not commence to reside thera until 1759, at the age of 27 years. At that time he owned in Virginia and other States 50,795 acres of land, besides sev eral thousand acres in Fairfax county. The magnitude of his farming opera tions in 1787 can be imagined from the fact that he had 580 acres in grass, 400 acres in oats, 700 acres in wheat and 700 acres in barley, buckwheat and other .cereals. He owned 140 horses, 112 cows, 226 oxen, 500 sheep and a large number of hogs. He employed 250 negro hands. In 1780 the records show that he slaugh tered 150 hogs for the use of his family and servants. B. J. Megginson, superintendent of the Newport News and Old Point Railway Company, was stabbed in the back and painfully injured by C. W. Burkhead, a North Carolinian, temporarily residing in Hampton. . . Brooks Robinson, a well-known citizen, of Roanoke, was crushed to death under a plie of lumber at Catogins lumljer yard, where he was employed. Both legs were crushed and death was due to in ternal injuries. He leaves a large fam- j ily, including two niarriel daugnters, Mrs. J. D. Bowers aud Mrs. E. D. ! Coleman. James IT. Winn, a driver for the Star i Laundry Company, of Danville, was painfully injured in an elevator accident at the Hotel Burton. Winn had placed a bundle of laundry in the freight ele-  vator on the lower floor of the building j and, as he stepped into the car himself, it gave way and fell into the basement.  Mr. Winns feet were caught between the elevator and the floor of the hotel, I and he was suspended in a perilous po- I sition. When rescued it was found ! that his right leg was broken just above I the ankle and the left leg was badly lacerated. The injured man was re moved to the General Hospital. W. A. Bone was crushed to death by a Southern Railway train at Pinners Point. He was 45 years old and had been employed many years as a car sweeper. He attempted to cross the track in front of the switch engine and was knocked down. His body was cut ! in two. Rev. George Floyd Rogers, of Hamp ton, has received a call to the Episcopal church at Covington. I At Pocahontas a petition has been I presented to Judge W. J. Henson, sign- j ed by over a third of the voters, asking I him to grant a local option election in I October."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "typhoid fever. Congressman H. <mark>D</mark>. <mark>Flood</mark> predicts that Congressman Swanson"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "typhoid fever. Congressman H. <mark>D</mark>. <mark>Flood</mark> predicts that Congressman Swanson"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.73, 1495.7, 1926.11, 1768.5], "bbox_id": "e5c273fcdc", "file": "AppomattoxNewspapers_1902-1905a_0177.pdf", "page": 1, "text": "C. R. MOORMAN W. P.TYREE Auctioneer!. None better. Well- known workers. mons decree of divorce. S. L. Ferguson vs. Henry Elam decree for sale of five-acre tract. B. N. Tanner, o., vs. Mary J. Tanner decree of sale of 156 acres for division. H. D. Flood vs. A. H. Clemeut decree for 207.19. This was by far the warmest chancery case that has I been terminated in tbe circuit court here for years, Messrs. Flood  Fer guson appearing for the plaintiff, and A. E. Strode and A. H. Clement j for the defendant. On the law docketNeighbors, I Ac., va Scruggs a damage suit for letting ont fire verdict for 170.00 1 The conrt pat the plaintiffs under  rale to accept  100 , or he would set aside the verdict as excessive, which sntn was accepted. Geo. E. Gaskie 1 and A. H. Clement for defendants"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "acres for division. H. <mark>D</mark>. <mark>Flood</mark> vs. A. H. Clemeut"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "acres for division. H. <mark>D</mark>. <mark>Flood</mark> vs. A. H. Clemeut"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.04, 432.26, 1737.44, 1077.06], "bbox_id": "a776f86573", "file": "AppomattoxNewspapers_1892-1898a_0090.pdf", "page": 1, "text": "C ircuit Court Proceedings, v The following decrees were entered in chancery at this term of the Cir cuit court J. R. Atwood against Willis Inges administrator, etc., order to convey land. J. R. Coleman, etc., against Joseph B. Coleman, etc., order to collect rents and pay cost. John R. Phelps against Jane. Phelps heirs etc., report confirmed. John H. Walker etc., against John A, Phelps etc., report confirmed. Samuel H. MeKinney against William E. Patteson etc., final decree. Edward S. Brown receiver, againist Milton S. Fore etc., order of sale. Frank P. Inge against Henry Inge admistrator etc., order for sale of land. John R. Franklin against William A. Durrum, referred to R. B. Poore, special commissioner. Mahala Davis against James E, Mitchels heirs referred to W. D. Thornton special commissioner. Wooldridge and wife against Webb, order of account. John W. Fisher against P. P. Pan key and Wife, order to rent out land. Sydnor Webb against S. D. Sears, order to rent out land. Allison and Adderson against Sarah Harvey and sons, order of ac count. Aug. Wright againsf S. R. Frank lin, report of H. D. Flood, order to collect and disburse. C. R. Pearsman and wife against J. Rolph Horsley and Fannir D. Horsley, order to divide land. Alex Johuson against Izetta John son, order against plaintiff to pay defendant 50 to defend her suit. Sami. M. Bryan and wife against R. A. Forbes trustee, and Wm. Ros ser, final decree. Mary E. Hannah against John R. Franklin, order to allot dower and order of account. S. F. Abbitt against Mary A. Rob ertson, final decree reestablishing decree."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "lin, report of H. <mark>D</mark>. <mark>Flood</mark>, order to collect and"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "lin, report of H. <mark>D</mark>. <mark>Flood</mark>, order to collect and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [510.01, 1016.86, 667.61, 1922.56], "bbox_id": "35e7bb1f7c", "file": "AppomattoxNewspapers_1918-1922a_0592.pdf", "page": 1, "text": "Buckingham If the first seven months of the year are like the first seven days of January 1922, bwe should rejoice and be satisfied that far. Mi. W. J. Hubard has been laid up with rheumatism for some days. Mr. John B. Boatwright leaves for Richmond today to attend the session of the legis lature. Mrs. Boatwright ex pects to keep house at her home here during the winter. Mr. Charlie Teeter left Mr P. P. Glovers home for Dan ville last Saturday. Mrs. John D. McArthur who was Miss Bertha Teeter before her marriage has been spend ing some time with Mrs. P. P. Glover. The many friends of Mr. P. P. Glover will be glad to know that bis hand that was so badly cut is getting well as fast as could be expected. There was a dance at the Warminster school house on Friday night. The Gunter brothers made excellent danc ing music and square dances seem to have been the order of the day or rather night. Mr. Henry C. Glovers home was the scene of an enjoyable affair on Friday night in Xmas there was music and dancing and re freshments served. Mrs E. G. S. Robinson was a visitor to her friends in Buck ingham last week. A successor to the late H. D. Flood will be nominated by a convention which is to meet in Staunton The Democratic County Committee will meet at the call of the chairman to deoide on the plan and the time for electing delegates to the Staunton Convention. Sales made on the Dillwyn market the past week seem to have given good satisfaction as regard prices. The Times-Dispatch is mak ing a special offer to subscrib ers who may want to read the proceedings of the legislature. A party at Monroe, New Tork, is anxious to find any one who remembers anything about Lavinia Bondurant and her husband that used to live in this county they are colored people and are supposed to have been slaves on the farm of Ool. Bondurant at Variety Shade . I am told that Messrs. Will iams and Miller bave purchas ed the old Rice property here. How many readers of this"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "to the late H. <mark>D</mark>. <mark>Flood</mark> will be nominated by"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "to the late H. <mark>D</mark>. <mark>Flood</mark> will be nominated by"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.95, 286.67, 562.82, 947.71], "bbox_id": "7eb9b0f336", "file": "AppomattoxNewspapers_1918-1922a_0282.pdf", "page": 1, "text": "At a meeting of the Board held at Cleric office Dec. 8present w H Llgou, L  Smith and 8 E Andenon, the following claim were allowed POOR HOUSE AND PAUPERS G W watgon, board and care of In mate to Dec. 16 80 00 Joe Woolrldge 3 00 Mr Sallie Reger 8 10 Mr Nannie Warner 2 60 C Roach Mann 4 00 Kate Petty for Frank Thornton 2 60 Ann John  60 Mrs Anna B Burton 2 CO Marshy Hancock 2 00 Marla Scruggi 2 00 Lou Conner 8 00 Ella Elliott 2 00 Humphrey North 2 60 Ossie May Flesh man 8 00 John Denni for daughter 6 00 Robert Fleshman 2 60 Sarah Giles, Dec. and Jan. 10 00 Ed Forbes 2 60 CONVICT ROAD MAINTENANCE 18 00 Henry Scruggs, painting bridges C, H. AND YARD D L Martin, cleaning, eto. SCALPS C W Smith to pay for scalps ELECTIONS A H Clement, printing ballots FGiWjLH KILLED Mrs Annie L Robertson, 2 turkeys CLERKS OFFICE . Everett Waddey CL Modern Index Corporation M L Barman, lights Appox Telephone Co T W Odor, kindling wood MISCELLANEOUS C W Smith, making and certifying list of oounty and district officers 8 L Ferguson, legal service regarding county farm B B Anderson, services as spoolal agent of Board L B Smith, same J w Flood, permanent improvements to office COMBS VIEWING ROAD E P Carson, locating road on W J Goodmans land J T Whitten, same J B Chilton, same A H Howerton, same H B Marshall, same 8 B Anderson, agent of the Board to look after the repairing of the flu at Bent creek bridge, made a Anal report to the Board wbioh tbe Board accepted whereas, under the law the Oounty Treas urer b entitled to have an office furnished him, which office la on the northern wing of tbe courthouse and W here as. sinoe Mr. Burkes Incumbency in office as treasurer he has not used this office and the same oas been used p?rt of the time by courtesy of Mr. Burke by H D Flood and was then turned over to 8 L Ferguson by courtesy of Mr. Burke sinoe bis election and Qualification at State senator, wbioh vacated his office as Commonwealths attorney and Whereas, tbe offices in the Clerks office building bad been formerly ooeupled since their completion by H D Flood as Common wealths attorney, and then by Mr. Fergu-"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "Mr. Burke by H <mark>D</mark> <mark>Flood</mark> and was then turned"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "Mr. Burke by H <mark>D</mark> <mark>Flood</mark> and was then turned"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [235.19, 1165.36, 409.85, 1927.05], "bbox_id": "a4bb475291", "file": "AppomattoxNewspapers_1898-1902a_0684.pdf", "page": 1, "text": "t h e c o n s t i t u t i o n t o b e P R O C L A IM E D . The mass-meeting held at Buck - ingbam Monday was of the old type and really gives the sentiment of none except those who bear the speeches. The opinion of those who are informed upon the question say that there is but little doubt about the proclaimers carrying the convention when they assemble next week. This will give us some better and nobler ambitions, and it is bet ter for the party to stand firm by the constitution, certainly the Dem ocratic party, is very gracious and considerate about the Republican party in construing the Norfolk pledge. If the Democratic party is responsible for the calling of the convention, and there can be no doubt aoout the factthe Norfolk convention adopted the child and Baid to Virginia, we the Democratic party make ourselves personally re sponsible for the acts of this con vention, our child, which is the ob ject of affections and adoption. The Republican party has no right to say that the Democrats are not keep-  ing faith with the people, when they proclaim or submit to the restricted suffrage. It is a Democratic meas ure and if the Democrats are afraid of their own record and in the hour of despair shall feel that the aid of the old enemy is needed to carry the work through we as Democrats ac knowledge our incompetency. Its idle talk to say the people have not the right to instruct their servants, at any time and upon any question. The very fact that a majority of the counties have accepted the constitu tion and instructed their representa tives to proclaim it may have an im portant bearing upon its legal status since brilliant legal minds differ about the right to proclaim. We practically have the initiative and referrendum. The Democrats say to their representatives proclaim the workthe master has spoken and the faithful servant obeys, therefore we take it that we have a Democratic instrument endorsed by Democrats and despised by Republicans. For our part we are glad it is over, and that Appomattox has produced the man and the bill which will forever live iu the history of VirginiaMr. Henry Deleware Flood."}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "the history of VirginiaMr. <mark>Henry</mark> Deleware <mark>Flood</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "the history of VirginiaMr. <mark>Henry</mark> Deleware <mark>Flood</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [262.81, 643.27, 422.5, 1271.84], "bbox_id": "bec54d8188", "file": "AppomattoxNewspapers_1902-1905a_0183.pdf", "page": 1, "text": "Prospect Notes. How forcibly are we reminded of the near approach of winter when, sitting by early fires, we hear the howling of the chilling wind as it sweeps down from the ice-bound regions of the Northland. Trunks and boxes are unpacked and winter clothing overhauled ready to meet the frost king when he comes. So with life. In the spring time all seems joyous and bright the air is laded with gladsome song and de licious odors as bird and flower, in .field and forest, make glad the heart of man. Then summer with its fields of ripening grain waving  d the flood of mellow light falling in golden bars accross our pathway. Then fall with its stubble fields, and faded flowers and falliug leaves. How it depresses us I Then we be gin to feel old age creeping upon ns. The harvest time is about passed, faculties are failing, there are silver threads among the jet, and we are conscious that the winter of  old age  is upon ns. May we all be prepared for its coming, looking back over the way whence we have come in full assurance of the blessed  harvest home. I have recently heard many kind expressions of friends for the T imes and its Editor, and I am sure the circle is enlarging. The people re gard the paper as being published in the interest of the whole people, and its Editor as being one of them, and in full sympathy with them. The paper continues to improve. I wish I had some means to con vince the Supervisors of San Frau- tiico district, Buckingham county, that people really do have to travel over the road from Venables bridge to Concord church. That road from the bridge to Henry Coxs is in a I dangerous condition for a loaded vehicle. Mr. Frank L. Bell, of Lynchburg, I recently visited his brother, Rev. P. M. Bell. Mrs. Emmie Walton, of West Ap pomattox, was the guest of her sis ter, Mrs. Annie Lewis, last Saturday. Mrs. W. H. Walden accompanied I her husband on a trip to Lynch burg last Thursday. Little Embree Bell was taken to Farmville recently by his father, and he has much to say about the things he saw in that busy town. October 10 , 1903."}, "highlight": {"text": {"matched_tokens": ["d", "flood"], "snippet": "of ripening grain waving  <mark>d</mark> the <mark>flood</mark> of mellow light falling"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "flood"], "snippet": "of ripening grain waving  <mark>d</mark> the <mark>flood</mark> of mellow light falling"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [784.81, 841.46, 952.41, 977.01], "bbox_id": "d5534fed56", "file": "AppomattoxNewspapers_1954-1955a_0170.pdf", "page": 1, "text": "Mrs. Robert James Shores, of Washington, D. C., announces the marriage of her daughter, Mrs. Marie Medora Peterson, to Mr. Bolling Byrd Flood, son of Mrs. Flood and the late Representative Henry DeLaWarr Flood. The cere mony was performed December 1st in the Trinity Presbyterian Church in Arlington, the pastor, the Rever end Dr. Foster, officiating in the presence of only the members of the two immediate families."}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "and the late Representative <mark>Henry</mark> DeLaWarr <mark>Flood</mark>. The cere mony was"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "and the late Representative <mark>Henry</mark> DeLaWarr <mark>Flood</mark>. The cere mony was"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [445.65, 764.19, 1009.1, 900.19], "bbox_id": "e680ceba88", "file": "AppomattoxNewspapers_1898-1902a_0485.pdf", "page": 1, "text": "forsieutuiiii and iuttidiiug tobacco. i The verdict of the jury was for the i plaintiff, and this verdict the.courts refused  to set a s id e . The counsel j for the plaintiff were F. C Moon, and Henry Ü. Flood, while Uob.t T. j com m ander of th e arm ies of th e N orih aud  Jahard, E. W. Hllbard, and John iw ice P resident, and afterw ard the lia tered  J, M o8g jpregeuted the defendant.  There were a great many witnesses j j n ATWOOD a t the surrender. AÜ else has fallen away.  f r o m Lynchburg who te s tif ie d ill tile j    have lta s o il to believe t l u t tlie main  To-day his best and most enduring m onum ent I c a s e . reliance o f the lat.er is that Mr. is in th e h earts of th e m e n who surrendered j There were many lawyers from a i leiiauoe ui vue u.v  to his overw helm ing force, and who rem em - j Adams, running a s an independent  a,,,, m a t he"}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "F. C Moon, and <mark>Henry</mark> Ü. <mark>Flood</mark>, while Uob.t T. j"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "F. C Moon, and <mark>Henry</mark> Ü. <mark>Flood</mark>, while Uob.t T. j"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [669.33, 1145.28, 837.28, 1898.38], "bbox_id": "f9600f9cc7", "file": "AppomattoxNewspapers_1918-1922a_0551.pdf", "page": 1, "text": "Butkiuali.uii  Verily iu lit we are death  Virginia mourns tbe loss of her favorite and most distinguished son. Henry Delaware Flood was my friend I pupporled him through amosl the lingtn of Lis political and official career, beginning with tin time when he first ran for the State Sonate, he appreciat ed my efforts in hie behalf and was not slow to say bo ant also he was ready to further my interests when they die notcouflct with public welfare fnat u. was au able man is attested by the positions 01 , bonor mas were confered ou him, no.- ooly by his constiiu eats but by his Colleagues in Congre8i auu the comments made by his friends in both houses at Washington tipecu a i m is rife as to wno Will be the Dtx Congressman from the 10th District.  lo Ihur day of last week Mr Trie? Glover while operat iug a woud saw at the home of his brother, Mr. H. C. Glover, b a t h e misfortune to get his r-aht hand badly cut, loosing tmee of his fingures besides getting bis hand so badly cat m at Dr Perkins Giov. r and D P. E Tucker thought it b st to take bim to a Kichmo b spitil for treatment. Dr 8 el ton Horseley rendered such service as tbe doctors here w re not prepared for under the circumstances and the host of friehda Mr. Giover has here are hoping  to see him back Home again in a short while. Mr Thomas B Hall took a load of tobacco to Ddlwyn last week aud not being satisfied with tbe price he was offered be took it on to Farmville where be gained 36 in the pro- ceedB of the load. Misses Fannie aud Eliza Haskins visited their sister, Mary,and Mrs. Spenovr Gilliam at Andersonville spending the week-end. Mrs. Bettie M. Swoope spent the wesk-end with her daugh- ter, Mrs. P. P Glover. Mrs. Hall left here by way"}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "and most distinguished son. <mark>Henry</mark> Delaware <mark>Flood</mark> was my friend I"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "and most distinguished son. <mark>Henry</mark> Delaware <mark>Flood</mark> was my friend I"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [364.58, 238.22, 526.74, 1457.23], "bbox_id": "985baeddf0", "file": "AppomattoxNewspapers_1918-1922a_0500.pdf", "page": 1, "text": "B uckingham The rain, the beautiful rain came on Saturday and I hope it was every where as copious and refreshing as it was here. Yerily God is good, and we should be so thankful. The Buckingham High school opens here this Monday morn ing with a corps of teachers that I hope may prove the right people in the right place. A party of young people went out to Fountain Ridge the hospitable home of the Misses ilover, oae night last week and were delightfully enter tained there. Miss Eleanor Davidson spent last week visiting friends in this part of the county. Mr. Robert Eugene Hender- lite has been visiting around among his friends in this coun ty and he is a general favorite especially with the ladies. Hon. Henry Deleware Flood is a worthy and able successor Rorer A. James as State chair man of the Democratic party and to my way of thinking will make one of the ablest ex ecutives ol the party that haB served in Virginia since the days of the Hon. John S. Bar bour. I am told there was a reduc tion of 75 on Ford cars to take effect as of September 1st. Folks around here have been drinking fox grape wine and where it is well made it is very good indeed. Farmers are hesitating about fallowing land for wheat now that it is so late. The road and bridge have been completed near Curdsville and now we have a fine road, the length of the county from Wingina to the Prince Edward county line and on to Farm- ville. A request will be made to the Ford company to donate a Fordson Tractor to the agricul tural students here. Mr. D. N. Davidson has been employed as principal of the High School here for the coming session and it is probable that his wife will also be one of the teachers here. There is a vacancy in the teaching force at Dillwyn one of the ladies who was to have taught there having tele graphed on Saturday that she was not coming. The Buck ingham county and school fair will be held here November 3rd and 4tb, 1921. Protracted meeting began at Bethlehem church last Sunday. The Trustee Electoral Board met here recently and elected one trustee in each district for a term of three years as far as was practicable at the time the meeting was held. Mr. Rolf Wood was elected to fill the vacancy on the J ames River Board caused by Mr. H. M. Harris leaving the county. W. W. Haskins was elected to suc ceed himself as a trustee in Maysville school district. I ordered 1000 sheets of good writing paper at a price of 1.- 60 for the lot prepaid. There is general complaint of weevil in wheat and at the mills they are compelled to run the wheat through the cleaning machinery to get the little black bugs out, and unless cooler weather sets in soon much wheat will be rendered unfit for seed 1 50 seems to be the price for seed wheat as against 2.50 a bushel this time last year."}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "with the ladies. Hon. <mark>Henry</mark> Deleware <mark>Flood</mark> is a worthy and"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "with the ladies. Hon. <mark>Henry</mark> Deleware <mark>Flood</mark> is a worthy and"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.34, 594.9, 1739.26, 1010.74], "bbox_id": "459de4caee", "file": "AppomattoxNewspapers_1955-1957a_0494.pdf", "page": 1, "text": "In an effort to promote better at- tndance, the Appomattox Lions Club has divided its membership in to pairs1, with one member of each pair to check in advance on the at tendance of the other. The pair ings are as follows George Alblbjtt, Leonard Anderson Henry Barger, James Redding J. A. Burke, George Buchanan W. W. Burke, Twyman Coleman Edwin Garter, T. T. Mlartin John Cole, Calvin Robinson Wlm. Dudley, T. M. Trent DeWitt Evans, Ivey Holland Murrell Ferguson, Ned LeGrand J. W. Flood, C. T. Moses, Sr. K_ C. Gregory, Bob Match ell John Grinds, Joe Flemiken A. R. Harwood Jr., F. L. Murphy Bob Jamerson, H. W. Runkle Raymond Jamerson, S. A. Lawson James Lucado, Burke Gmiil Jack Miarshall, Henry Pack W, D. Morris, H. A. Gurney C. T. Mioses Jr., Keneth Christo pher C. G. OBrien, H. Y. Spencer R. B. Parris, Jim Smith David Robertson Lewis McDear- mon Richard Robinson, Garland Plunk ett R A. Seans, R. L. Burke, Jr. Joe Terry, Marvin Herncall Charles Thomas, W. S. Gill Hugh Brown, Bill Hunter J. N. Jennings, C. W. Simdth G. S. BObth, W. M. Ablbitt C. C. Poe, Martin Webb Cfnas F. James, H. C. Pulliam Ira Wilkins, Ed Dickerson."}, "highlight": {"text": {"matched_tokens": ["Henry", "D"], "snippet": "Burke Gmiil Jack Miarshall, <mark>Henry</mark> Pack W, <mark>D</mark>. Morris, H. A. Gurney"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D"], "snippet": "Burke Gmiil Jack Miarshall, <mark>Henry</mark> Pack W, <mark>D</mark>. Morris, H. A. Gurney"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2119.7, 956.36, 2280.65, 1795.91], "bbox_id": "de4cc8bd25", "file": "AppomattoxNewspapers_1943-1947a_0225.pdf", "page": 1, "text": "Miss Hildia Mae Cartter Mrs. Adelia M. Ferguson Mrs. Adelia M Ferguson Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds C. Courtney Harvey Samuel L. Stanley Bryant T. Jamerson Zack E. Cheatham Robert B. Haley J. Hudson Cheatham William T. Nash William T. Nash  William T. Nash William T. Nash  William T. Nash George W. Perdue Edward P. Davis Mrs. Annie L. McCormick Mrs. Annie L. McCormick Mrs. Annie L. McCormick Mrs. Annie L. McCormick Arthur D. Bates Bennie W. Harvey Bennie W. Harvey Bennie W. Harvey Bennie W. Harvey Ben lie W. Harvey Bennie W.  Harvey Mrs. Mary C Roberts u John Lloyd Lewis John Lloyid Lewis John Lloyd Lewis John Lloyd Lewis John Lloyd Lewis Mrs. Alma Spiggle M iss Lucille M. Coleman Edward N. Harvey Charles F James Mrs. Alice Irene Moore Mrs Alice Irene Moore Mrs. Alice Irene Moore Mrs. Alice Irene Moore Mrs. Alice Irene Moore Edward N. Harvey William D. OBrien William D. OBrien Miss Peggy Dawn Garrett Miss Helen E. Smith Edward N. Harvey Mrs. Lillie B. Moses Willie J. Mitchell Willie J. Mitchell James Robert Dinkins Gilbert Moses Dinkins Arris Beryl Covington Arris Beryl Covington Mrs. Alma Wright Harris Mrs. Rachel H. Jones Daniel A. Clapp Daniel A. Clapp Daniel A. Clapp Daniel A. Clapp Miss F. Sylvia Clapp Mrs. Edna B. Patterson Mrs. Earle P. Robinson Miss Beulah M. Robertson Miss Anne Culvin Abbitt Oscar Cleveland Paulett Mrs. Ethel Judith Paulett Miss Dorothy G. Austin Mrs. Eleanor Harwood Caudle Miss Julia Ann Burton Mipsi lean tGibbings Burton Richard Nicholas Burton James Perry Burton Edward N. Harvey Miss Mary A. Adcock Samuel H. Collins Mrs. Lorraine H. Torrence Richard A. Hamilton Mrs. Bertha OBrien Gills Cecil Ray Bass Mrs. Ora H. Baker Mrs. Nellie L. McClenny Miss M. Aileen McClenny Henry De La Warr Flood IV"}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "Miss M. Aileen McClenny <mark>Henry</mark> De La Warr <mark>Flood</mark> IV"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "Miss M. Aileen McClenny <mark>Henry</mark> De La Warr <mark>Flood</mark> IV"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2189.73, 514.09, 2480.13, 747.23], "bbox_id": "772225f8b1", "file": "AppomattoxNewspapers_1962-1965a_0393.pdf", "page": 1, "text": "Judge Joel West Flood, 69 a  Attorney General of Virgnia, and native of Appomattox died at a i Assistant U. S. Attorney for the Richmond hospital Monday night  Western District of Virginia. He after an illness of five months.! .served as Judge of the 5th Judi- He was born August 2, 1894, a  cial Circuit of Virginia since his son of Major Joel Walker .and eection by the General Assemb- Sallie Delk Flood. He was a  ly of Virginia in January 1940. graduate of Appomattox H i g h  He was a Mason, a member School, and attended Washington i and a Vestryman of St. Anns and Lee University. He studied ! Episcopal Church, law at the University of Virginia j He is survived by his widow, and Inns of Court, Oxford Uni-1 Dorothy Evans Flood, a son, versity. Henry de la Warr Flood, IV, He served in Company A. 305 bth of Appomattox. Virginia a Engineers, 80th Division, U. S. lecf- Horton Schoell- Army in World War I, and w.as kopL of Washington, D. C., three on the staff of the late Governor nephews. Senator Harry Flood E. Lee Trinkle for four years.  Berry ville, Tom Byrd, He was a former Common-  oyc! , anu Bolling Byrd wealths Attorney of Appomattox  FP0I ci Washington, D. 9 County. Special Assistant to the In uf     are requested to make contributions to Boys Home, Covington, Vir ginia, or Jackson-Field Home for Girls, Jarrett, Virginia."}, "highlight": {"text": {"matched_tokens": ["Flood", "Henry", "Flood"], "snippet": "Oxford Uni-1 Dorothy Evans <mark>Flood</mark>, a son, versity. <mark>Henry</mark> de la Warr <mark>Flood</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood", "Henry", "Flood"], "snippet": "Oxford Uni-1 Dorothy Evans <mark>Flood</mark>, a son, versity. <mark>Henry</mark> de la Warr <mark>Flood</mark>,"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2218.27, 664.94, 2479.97, 1739.36], "bbox_id": "96d21c9db4", "file": "AppomattoxNewspapers_1933-1936a_0041.pdf", "page": 1, "text": "I Flood, Jas. M. Watson, Gus 1.86 1  STONEWALL DISTRICTWHITE 5.191 Vdams Bros. Paynes Co. .92 I lvis, R. H. 16.741 Vnderson, E. L. Eat. 9.921 Bell, E. W. 2S.221 Bell, R. E. 13.051 Bell, R. E. 1.64 I Blackwell, B. M. 20. 4 I Burge, Wm. F. 13.571 Carson, E. H. 18.821 Carson, Susie B. 2.87 I Chick, E. L. 17.42 ! Childers, M. P. 8.07 I Coleman, C. Lewis I Cooper, Wm. Heirs 27.651 Drinkard, Clarence D. 7.611 Eagle, Mary C.  J. B. 14.261 Eagle, Mary C.  J. B ._ 2.301 Eagle, Richard G.  J. B. g., 94 1 Eagle, Richard G.  J- B. 20.511 Fracker, N. K. 15.09 I Hawes, H. B. 25.68 I Hale, L. J.  23.03 I Hamilton, R. A. , 7 1 1 Hamilton, R. A. 20.481 Hamilton, R. A. 6,04 I Harvey, Thomas 5.62 I Hockhart, W. J. 4 77 I Tamerson, D. W. 2 , 01 1 Laughon, J. H. A G. Olive 20.361 Marsh, E. J. 6,72 I Martin, T . Raymond 13.88 I Martin, H. O. 19.35 I Martin, H. O. 13.28 I Martin, H. O. 24.29 I Megginson, S. T. I Moore, R. W. Et. I Moore, Mrs. Minnie M. 10 98 I Moore, Mfrs. Minnie M. 93 I McCormick, jNorcissus 9 Ì 00 I Nutall, J. S., L. G. Kapler A J. . 68 1 Oscar Loraine 7,07 I Phelps, Thomas 19.83 I Phelps, Thurrto 285 I Powell, Martha E 7 , 4 g I Robertson, J. H. 18.611 Robertson, Mrs. Neola 2 34 I Robertson, The Co. Inc. to be 2.401 paid by B. H. Wood 13.021 Scruggs, Lily A. 1.36 I Scruggs, William M. 5.971 Shelton, J. Thomas 13 hr I Stephenson, Iverson W. 6.18 Taylor, Geo., W. 5 . 87 1 Thomas, D. T. 13.88 Beasley, Stephen Est. 2.11 Beasley, Stephen Est. 2.50 Beasley, Stephen Est. 2 63 Beasley, Stephen Jr. Beasley, Demosthenes Beasley, Demosthenes 23.24 Callaham, P. W. A Lougenia 8.52 Cousin, Hattie 13.02 Craigway, Nancy 23.67 Daniel, ÎW. T. 1.53 Daniel, Elijah 27.50 Davidson, William 17.30 Doss, Thos. A Agnes .68 Echols, Docia Ferguson, Charles - 07 Ferguson, Mary  Ferguson, O. K. Ferguson, Winston .93 Flood, Gabriel 7.07 Flowers, Henry 22.18 Flowers, Annie 19.34 Goff, Dabney .76 Hancock, Julia 14.63 Hancock, Scott 11.36 Humbles, William 15.35 Humbles, William 9.67 Johnson, Ella M. 9.67 Johnson, J. H 13.10 Johnson, Napoleon 18.31 Johnson, Alice 5.36 Johnson, Abingdon 20.95 Johnson, William 10 22 Johnson, Calvin 5.02 Jones,, Alex 10.25 Jones, Charles 2.64 Lewis, Claude 10.11 Morgan, James 4.76 Morgan, Edd 21.54 Morgan, Philip Jr., A Co. 3.32 McCoy, Jno. W. A Josie 30.20 Moore, Leslie Y. 10.33 Moore, S. W A S. G. 10.13 Myers, John H. 8.31 page, Ida and Sarah J. Flowers 4.01 Pankey, Nelson C. 7.14 Pankey, Hubert 25.49 pankey, Hubert 7.07 pankey, Eugene 8.86 Preston, Emma Wyatt 12.18 Reveley, Dorothy 19.58 Robertson, James 19.72 Robertson, Lucy 7.88 Scott, Early - .32 Scruggs, Edd A Mary J. 2.04 Scruggs, Éllison 24.43 Scruggs, Frank Ponkey Smith, Peter S. A J. M. FanJcey 55.19 Stratton, Ned Est. Turner, Henry Turner, Henry , ___ _ Vaughter, Pleas Anderson Vawter, Anderson Vswter, Thos. A Others Woodson, Isaac Wright, John A. A N. M."}, "highlight": {"text": {"matched_tokens": ["Flood", "Henry"], "snippet": "K. Ferguson, Winston .93 <mark>Flood</mark>, Gabriel 7.07 Flowers, <mark>Henry</mark> 22.18 Flowers, Annie 19.34"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood", "Henry"], "snippet": "K. Ferguson, Winston .93 <mark>Flood</mark>, Gabriel 7.07 Flowers, <mark>Henry</mark> 22.18 Flowers, Annie 19.34"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1047.8, 1041.44, 1217.56, 1278.24], "bbox_id": "b5ad80e50a", "file": "AppomattoxNewspapers_1943-1947a_0055.pdf", "page": 1, "text": "Vera, May 11.- Miss Irene Gar- rette, of Lynchburg spent the week end with her parents, Mr. and Mrs. Soencer C rrette. Mr. and Mrs. Ed Blackwell spent Sunday ith Mr. and M ts . J. J. Chernanlt. , Mr and Mrs R L Harris m d family, Mr. and Mrs Flood Harris and son were guests in the home of Mr.and Mrs J .J . Ohernault re cently. Mrs, Maude Abbitt and Mr. and Mrs. R.H.Coleman also visit ed in this home. Pvt. Henry T Chemault, of Camp Tyson, Tenn. spent a three  day le-ve with his parents, Mr. and Mrs. J. J . Chemault. Sgt. Russell A. Chemault, of Fort Myers, Florida is spending a 15-day furlough here with his par ents,  Mr .and Mrs. J . J . Chemault."}, "highlight": {"text": {"matched_tokens": ["d", "Flood"], "snippet": "R L Harris m <mark>d</mark> family, Mr. and Mrs <mark>Flood</mark> Harris and son were"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "Flood"], "snippet": "R L Harris m <mark>d</mark> family, Mr. and Mrs <mark>Flood</mark> Harris and son were"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2076.05, 1102.32, 2351.65, 1536.61], "bbox_id": "2d8d73fb62", "file": "AppomattoxNewspapers_1892-1898a_0165.pdf", "page": 1, "text": "side of the walk leading from theandall apd enjoy the day. stile to the courthouse and Mr. Tuckers on the right- Tellers from both parties were then appointed to count each side, with the result that Tucker received 334 and Flood 288, Tuckers majority being 46, The speeches and leadership of Mr. Lee, who was in charge of Mr. Floods interests, were very brilliant. Excitement ran very high and the partisans of the two gentlemen at times became very bitter, resulting in many tights. The proceedings of the meeting were conducted with perfect fairncBB. A rrivals at H otel Appom attox. The following were the arrivals at Hotel Appomattox, on the twelfth of this month F arm ville Messrs. W. P. Ven able, Earnest Whitehead, Joe. Lynn, E. Irwin Bugg, Albert Baldwin, J. D. Allen, A. F. Morris, J. D. Crawley, R. B. Crawley, W. A. Stone, F. A. Motley, Henry Gray, J. W. Kyle, D. D. Wilkerson, L. H Drumelier, Dr. W. E. Anderson P. J. HarVey, Floyd Morris,J. lUCnn- ningham, Misses. Clara Cunningham, Pearl Cunningham, Jno Stokes, W. M. Adams, Mrs. Dr. Winston, R ichmond Mrs. P. J. White, Misses Fannie Morris, Dolley John son, Kathryn Johnson, and Mr. Thos O. Burton."}, "highlight": {"text": {"matched_tokens": ["Henry", "D", "D"], "snippet": "Stone, F. A. Motley, <mark>Henry</mark> Gray, J. W. Kyle, <mark>D</mark>. <mark>D</mark>. Wilkerson, L. H"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "D", "D"], "snippet": "Stone, F. A. Motley, <mark>Henry</mark> Gray, J. W. Kyle, <mark>D</mark>. <mark>D</mark>. Wilkerson, L. H"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.68, 555.75, 2171.41, 1026.3], "bbox_id": "0cfe4d4e3a", "file": "AppomattoxNewspapers_1892-1898a_0444.pdf", "page": 1, "text": "d re n  land and all h er personal property,tock of goods. S. W. Nowlin to M. A. Nowlin  1371 acres. D. A. Christian, Com., to Henry W ebb 230 i acres. Marcellus W. Cheatham to Tucker Fleshman, Beverly Fleshman aud Henry Fleshm an 81 acyes. The will of Miss Winnie Inge pro duced and admitted  property goes to her sister Miss Leiia. Special grand jury empanelled and presented the following indictments. Commonwealth vr. C. W. Harvey  true bill. Same vs. Will LeGrand  true bill. Same vs. James Randolph and Bichard Randolph  not a true bill. On the application of J. S, Thorn hill, J. B. Horseley and others, the court ordered W. A. Moses to appea r before the next term-of the court to show cause why his liquor license should not be revoked. W. T. White withdrew his applica tion for a license to sell liquor here. Commonwealth vs. lames Flood, grand laroeny, guilty, term fixed at three years in the penitentiary. A r gument for new trial will be made during term.  Same vs. Will Legraud, felonious assault guilty, term fixed at one year in the penitentiary argument for new trial will be made durin term. Commonwealth vs. C. W. Harvey, felonious shooting now on trial."}, "highlight": {"text": {"matched_tokens": ["D", "Henry"], "snippet": "A. Nowlin  1371 acres. <mark>D</mark>. A. Christian, Com., to <mark>Henry</mark> W ebb 230 i"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Henry"], "snippet": "A. Nowlin  1371 acres. <mark>D</mark>. A. Christian, Com., to <mark>Henry</mark> W ebb 230 i"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.88, 698.17, 1780.45, 1200.25], "bbox_id": "a2c4896f79", "file": "AppomattoxNewspapers_1908-1909a_0153.pdf", "page": 1, "text": "..Miss Julia Gunter of Lynch burg spent Saturday and Sun- ham County, celebrated his birth-   and among those present were six ___ of named Wm. Swan. Mr. Swim ii Richmond was also a visitor in I now far past the octogenfirian our neighborhood for the week mark and is whole and hearty and enj - j the writer looks forward to such Mr and Mrs. Martin, Mr. and Ia v8it each year. Mrs. McCormick, Mr. Qpweyl The stork is most generous Taylor and Miss. Ruth Abbit, all n his visits to some homes, on of Lynchburg spent Sunday at Tuesday of last week he left twins, a boy and a- girl in the Mrs. Joel W. Flood, widow of home of Mr. Ira Southall. Both Major W. Flood, was buried atmther and chilldren are doing the family boring ground Sunday  WH T . M  in presence of a large crowd. W e Mr- 8d. .Mrs John ue extend to our C om m onwealthl and Mr. Eugene Gilliam Attorney, Joel W. Flood, o u r M Mr. Henry Covington spent SvWtWfv. several days of last week in Washington. The Hixburg School truck has been on right good tíme now for, softie time, and If anyone thinks  We wte having plenty of rain one can always avoid car trouble and damp weather. The land  just try going down a steep hill I continues so wetthe farmerson a w etday. cannot get iheir wheat sowed.  Another saw mill is located Falling has been out of its bankshere, thif. last one on the term twice find that is a great quanity o f Hix Brothers and now we of water. M u c h of the crops on have five mills in hearing dis- i the low grounds are damaged.tehee, no wonder help is scarce There has been several frost, butjand hard to get. lighter-no damage done.    .- j Many from this neighborhood j C le r g y m e n H ldO FS6 attended the fair at Appomattox  , -r xt7 P Hr fr u ir a run. and it was such a treat to meet N  W F Ü D tO Ü P R ni so many people we had not seen  T e l l M g YYt íy ? Iffyears.if The exhiite werej -  M n  f altogether it was the N o c l  n ttet h M S  th e U  W f Appomattox cao  t"}, "highlight": {"text": {"matched_tokens": ["Flood", "Henry"], "snippet": "Gilliam Attorney, Joel W. <mark>Flood</mark>, o u r M Mr. <mark>Henry</mark> Covington spent SvWtWfv. several"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood", "Henry"], "snippet": "Gilliam Attorney, Joel W. <mark>Flood</mark>, o u r M Mr. <mark>Henry</mark> Covington spent SvWtWfv. several"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [551.49, 192.89, 782.38, 1036.36], "bbox_id": "8bf34d06ea", "file": "TimesVirginian_1976_0075.pdf", "page": 1, "text": "Linda Morris of Richmond was Sunday dinner guest of Mr. and Mrs. C. W. Morris. Afternoon visitors were Mr. and Mrs. Arlis Maxwell of Appomattox. , Several in the community are ill with the flu. Mrs. Katherine Carson and Robin Carson of Spout Spring were Saturday visitors of Mr. and Mrs. K. M. Beasley, Jr. Mr. and Mrs. Don. Morris took Mr. and Mrs. Lewis Morgan out for supper Sunday. The occasion - Mrs. Morgans birthday. Mrs. Roger Morris, Kathy Sarah and Becky attended the 50th anniversary of her parents, Mr. and Mrs. Rice Seay, at Andersonville Sunday. Friday visitors in the home of Mr. and Mrs.W. T. Cook were Mr. and Mrs. Clifton Archer and son, CUR Mrs. Henry Layne and Mrs. Harris, aU of Rockville.  Mr. Kemper Beasley, Sr. is steadily improving1 after having eye surgery some weeks past. Tommy Mottley, of Burkeville, spent Tuesday in the Beasley home. Mrs. Ralph Repass, Mr?. GU Price and David were Wednesday supper guests. Other recent visitors were Mrs. C. A. Simpson of Prospect, Mrs. Mildred Bales, Phyllis Bales, and Jerry Jones, all of Hampton Mr. a n d . Mrs. Howard Townsend, Mr. and Mrs. Jack Manis, Mrs. Oddi Kirby, Mrs. T. M. Manis, Mrs. Virginia Clabo, all of Farmville Frank Chernault of Appomat tox Mrs. Katherine Carson of Spout Spring, Mr. and Mrs. K. M. Beasley, Jr. and Kathy of Dillwyn, Rev. R. L. Hurt of FarmviUe. The Rev. and Mrs. Dott Bryan attended the funeral of Mrs. Fred Green at Culpeper Wednesday. Mrs. Don Morris and boys and Mrs. W. T. Cook were Wednesday visitors of Mrs. Lewis Morgan and Mrs. Mary Pearson of Dillwyn. Cathy Walker of Sprouses Corner will teach a Misson Study Class at the Chestnut Grove Baptist Church Friday, Feb. 27, at 730 p.m. v v Mrs. T. N. Saul, Mrs. Ray Repass, Mrs. Bill Senger, Mrs. R. L. Harris attended the Senior Citizens meeting at The Buckingham County Bank Monday.  andMssaii iHaariiiiiI ia i Roanoke area. Blgon of ChestW , visited M p h k d jH St WT. Coot Sunday. Flood Harris, of Green Bay, was a Saturday visitor of Mr, and Mrs. R. L. Harris."}, "highlight": {"text": {"matched_tokens": ["d", "Flood"], "snippet": "M p h k <mark>d</mark> jH St WT. Coot Sunday. <mark>Flood</mark> Harris, of Green Bay,"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "Flood"], "snippet": "M p h k <mark>d</mark> jH St WT. Coot Sunday. <mark>Flood</mark> Harris, of Green Bay,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [209.51, 790.8, 372.48, 1122.8], "bbox_id": "fd53b602ae", "file": "AppomattoxNewspapers_1908-1909a_0120.pdf", "page": 1, "text": "Parted 24 Years, 3 Reunited by Letter Philadelphia.  But for a letter opened by mistake Henry J. Llttrell, seventy, of Alavlsta, Va., might never have-been reunited here with Uls two sons, who have mourned him as dead for 25 years. Some twenty-five years ago a storm and flood razed n small town in the Middle Vest where Mr. Llttrell hfcd taken up his residence, and after It abated he had vanished. Although the sons searched for hia body for days, they never found It . Some time later he was declared dead by the courts and bla stats was disposed of. Two weeks ago James Llttrell,yfe, a, grandson, was taking a business trip thtauxb Virginia. He had requested hi associates to address his mall to general delivery along the routw be proposed to pursue. At Roanoke he received a letter ad dressed to Llttrell, with the first name erased. Believing it to be bts own, he opened It. Inquiries at the post office disclosed thin? the litter must hsve been meant for Henry J Llttrell. The younger Llttrell decid d to deliver the letter to the person tt had been sent to. The old man and he young man be, an to talk nnd before long discov ered their relation!hlii."}, "highlight": {"text": {"matched_tokens": ["Henry", "d"], "snippet": "hsve been meant for <mark>Henry</mark> J Llttrell. The younger Llttrell decid <mark>d</mark> to deliver the letter"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "d"], "snippet": "hsve been meant for <mark>Henry</mark> J Llttrell. The younger Llttrell decid <mark>d</mark> to deliver the letter"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [259.49, 1467.91, 549.3, 1835.49], "bbox_id": "2fd00647f8", "file": "AppomattoxNewspapers_1926-1933a_0167.pdf", "page": 1, "text": "MISCELLANEOUS Treasurer of Virginiacost auditing treasurers acct. etc ..............  B. N. Woolridgecleaning oft C. H. l o t ............................................ R. L. Burke, treasurerfiling cases, tax tickets and office ex penses ...................................................... .. ..................................... L. F. Caldwellsealer weights and measures ......................... .. Appox. Fair Associationappr. for premiums . ............................... H. W. McKinneysum. petit Juries . ................................................... L. E. Smithmem. lo. bd. equalization ........................................... J. P. Alvis, mem. lo. bd. equalization ............... .. ............................... F. A. OBrien, mem. lo. bd. equalization............................................ C. W. Smith, clerk lo. bd. equalization . ....................................... .. . E. G. Blackwell, repairing old C. H. and Jail . ............................... C. W. Smith, clerkexp. Conf. Veterans to reunion, epl. services on budget, etc...................................... ............................................... Tlmee-Vlrginlan, printing financial statement, public noticea, etc, Appomatox Hdw. Co., key for lock at old Jail ................... B. M. Ferguson, Jury com .................... .. ...................... - A , ...............  Don Moses, Jury com. . ....................................................... V ............. J. P. Alvis, Jury com................................... .. ........................ .................. Henry Troemsr-die tor sealer welghte and measures . . ............ Joel Guillcleaning off old C. H. l o t ................... .......... .................. Town of Pamplinbank stock erroneously col................ Ould-Lawson Hdw, Co.26 stool trape . ........................................... IfcieiUL. -i .I... at .  i . i i f f i l i i L     i I 4 i  ! .  OFFICERS SALARIES H. W. MqKlnney, sheriff and Jailer ..................................... .. H. W. McKinney, sheriff and probation o ffic e r ................. C. W. Smith, clerk of Board of Supervisors and Rd. Orders C. W. Smith, county d o r k ......... . ........... .................................... J J. W. Flood, commonwealth a tto rn e y ............. J. A. Burke, supt. schools ................................. N. R. Deatherson, eupt. schools ......................... J. O. OBrien, comr. rev. . ................................ Robt. F. Hutcheson, Judge . .. .. .................. D. N. Twyman, supervisor . ............ F. A. OBrien, supervisor ............................... . O. E. Anderson, supervisor ................... , .......... H. G. Harding, overseer of the poor . . . . . . . B. G. Harvey, overseer of the poor . ................ 3 - U , Ferguson, overseer of the p o o r ............."}, "highlight": {"text": {"matched_tokens": ["d", "Flood"], "snippet": "C. W. Smith, county <mark>d</mark> o r k ......... . ........... .................................... J J. W. <mark>Flood</mark>, commonwealth a tto rn"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "Flood"], "snippet": "C. W. Smith, county <mark>d</mark> o r k ......... . ........... .................................... J J. W. <mark>Flood</mark>, commonwealth a tto rn"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.68, 1175.63, 1671.81, 1543.72], "bbox_id": "8f369b496d", "file": "AppomattoxNewspapers_1949-1952a_0511.pdf", "page": 1, "text": "louse at Marion .. and The Cedars. Uways think of the late Sherwood Lnderson and his son, Robert Lane, Vhenpass through Marion. And hen liear Emory and Henry College trhere the late Pedie Jackson coach- d great football teams. We will ave to pay another visit to famous ibington. The Martha Washington jnn, mountain laurel wrappings for -oliday decorations .. hurley to- acco warehouses, the New Dixie, ictory and Vanns. And then by .ntermont College at Bristol, and ence,j after lunch, into Tennessee. Tot far along is Kingsport, a boom- lg town. The big Eastman Kodak lant has a fabulous pay roll, and ibh its wide streets and many new omes it stands as evidence of -what e were to see all along in Tennes see unparalled prosperity. Rogers- ille with its great high school and nother tobacco warehouse. The tourist business was worth 450,000,000 last year in Tennes- ee. And one of the greatest pro- sets of all times, the Tennessee alley Authority TVA is really aying off. You are at Oak Ridge, nd you realize this is modern merica, producing and on the oom. Farm lands are being reclaim- d and you see how man is con oiling, disantrous flood waters. And thus on into Knoxville, home f the Tennessee Volunteers and the ipitl. j It was somewhat sad there,"}, "highlight": {"text": {"matched_tokens": ["Henry", "d"], "snippet": "hen liear Emory and <mark>Henry</mark> College trhere the late Pedie Jackson coach- <mark>d</mark> great football teams. We"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "d"], "snippet": "hen liear Emory and <mark>Henry</mark> College trhere the late Pedie Jackson coach- <mark>d</mark> great football teams. We"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [156.48, 279.58, 347.09, 1072.29], "bbox_id": "afbf0aebcf", "file": "TimesVirginian_1984a_0018.pdf", "page": 1, "text": "Henry Edgar Chilton. 99, died fo n o ry 16, 1964 In the Lynchburg General HospitaL He is survived ly five children two sons, Thomas Arthur Of Appomattox in d Carlton of Philademhia, F eu  and three daughters Mrs. R on B. Mitchell of Philadelphia, Pa., Mrs. Eulla G. Harvey Spout Spring, Va., and Mrs. Ella H. Harvey of PittsburgVPOi thirty-one grandchil dren, fifty-five great grandchildren, ind twelve great great grandchildren. V iew ing of the body wifi be on SSiursday evening at the West Funeral parlor, Patricia Ann Lane, Appomnt- I 9 X, Va. .-V.    Funeral and burial will be at the Promise Land Baptist Church on Friday, Jan. 20, 1984 p.m. Andrew B. MB Gyres- v Andrew Baxter Bill Cyrus, 61, of Route 2, Rustburg, died at 230 p.m. Friday,, Jan. 13, 1964, in Duke University Hospital in Durham, N.C. He was the husband of Edith Litchford Cyrus. .Born in Campbell County.Vfee was a on of the late John Bunion and Sallie JCate Moore Cyrus. He was an employee of Old Dominion .Box Company, where herorked for 36 ears, a veteran of World War H, and a Member Of New Chapel Baptist Church near Rustburg.   Ip. In addition to hfo wife, he is survived  6 y  son, Ronald L. Cyrus, and a daughter, Lavgrn G. Rogers, both of Rystburg four sisters, Lucille C. Phillips, Greenville, S.C., Georgia C. Mann, Appomattox, and Helen C.  Brooks and J anuiAABryant, both of Lynchburg two grandchildren, Lee Cyrus and Kim Rogers, both of Rustburg.  - Funeral services were conducted at. 3 y.m . Monday in New Chapel Baptist C hurchby the Rev. Douglas W. Gibson. Burial was in the church jbemetery. Whitten Park Avenue Chapel was in Charge of arrangements. - Mrs. Joel Flood Drinkard  Mrs. Mary Edna Cobb Drinkard, 74, fof 2606 Camden Road, Greensboro, 3.C., died Sunday, Jan. 15, in -Louisville, Ky. She was the wife of the llte Joel Flood Drinkard. Born in Gilford County, North Carolina, she was the daughter of the ate John and Mary Emma Cobb. Surviving are two sons, Henry Brandon Drinkard, Greensboro, N.C. - The Rev. Joel Flood Drinkard, Jr., of  Louisville, Ky. one sister, Mrs. Nell  Brown, Greensboro, N.C., one brother, Clarence Cobb, Salisburg, N.C. four, .-grandchildren and one great-grand- 1 child. HA funeral service wBLbeooadueted - today Wednesday at Hanes-Lineber-  Jy North Elm Chapel in Greensboro.  Interment will be in the Drinkard Fam ily Cem etery in Appomattox - County at 3 p.m today Wednesday."}, "highlight": {"text": {"matched_tokens": ["Henry", "Flood"], "snippet": "Surviving are two sons, <mark>Henry</mark> Brandon Drinkard, Greensboro, N.C. - The Rev. Joel <mark>Flood</mark> Drinkard, Jr., of  Louisville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "Flood"], "snippet": "Surviving are two sons, <mark>Henry</mark> Brandon Drinkard, Greensboro, N.C. - The Rev. Joel <mark>Flood</mark> Drinkard, Jr., of  Louisville,"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2338.1, 1232.96, 2507.79, 1401.1], "bbox_id": "f86310b494", "file": "AppomattoxNewspapers_1947-1949a_0502.pdf", "page": 1, "text": "The Daily Vacation Bible School of the Presbyterian Church has been in progress since July 6 and will conclude on Friday, July lj5. The director of the school and teacher of the Intermediate Department, is Miss Katherine Dunlap, of York, S. C., who will graduate next session at the Training School in Richmond. Teachers in the Junior Department are Mrs. D. E. Caldwell. Jr., Mrs. Amy Glenn, Mrs. Joel Flood and Mrs. H A. Gurney in tho Primary Department M s. DeWili Evans, Mrs. Jane House and Mrs. Henry Pack. Mrs, L. C. McKenie is the teacher of the Beginners"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "Junior Department are Mrs. <mark>D</mark>. E. Caldwell. Jr., Mrs. Amy Glenn, Mrs. Joel <mark>Flood</mark> and Mrs. H A."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "Junior Department are Mrs. <mark>D</mark>. E. Caldwell. Jr., Mrs. Amy Glenn, Mrs. Joel <mark>Flood</mark> and Mrs. H A."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "W. Marshall, Dr. Rueben <mark>D</mark>. Pa mer, Col. Benj. P. Walker, Co Thomas H. <mark>Flood</mark>, Nathan L Hancock, Bryant"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "W. Marshall, Dr. Rueben <mark>D</mark>. Pa mer, Col. Benj. P. Walker, Co Thomas H. <mark>Flood</mark>, Nathan L Hancock, Bryant"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["D", "Flood"], "snippet": "W. Marshall, Dr. Rueben <mark>D</mark>. Pa mer, Col. Benj. P. Walker, Coi Thomas H. <mark>Flood</mark>, Nathan t Hancock, B"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Flood"], "snippet": "W. Marshall, Dr. Rueben <mark>D</mark>. Pa mer, Col. Benj. P. Walker, Coi Thomas H. <mark>Flood</mark>, Nathan t Hancock, B"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.9, 1184.6, 2202.67, 1486.39], "bbox_id": "de60fb4c0c", "file": "AppomattoxNewspapers_1955-1957a_0213.pdf", "page": 1, "text": "Appomattox Democrats met at the court house here Saturday after- and named delegates to the State Democratic Convention to be held in Richmond on July 27, at the Mosque. Appomattox County w v have ciht votes at the state parley, -fend at the local mass meeting, forty delegates were named, to vote as a unit, and authorized to name their own alter nates. The delegates C. W. Smith, Samuel Ferguson, George F. Abbitt Jr., C. T. Moses Sr. David T. Robertson, G. B. Buchanan, H. C. Pulliam, Dorothy Flood, J. A. Bingham, C. C. Harvey, Calvin H. Robinson, Henry Cabell, H. T. Williams, A. W. Cavington, J. W. Conner, Chas. F. P. Crawley, J. P. A!vis Jr. John E. Herndon, W. W. OBrien, W. W. Woodson, Mrs. Russell Wagers, D. A. Conner, W. M. Abbitt, J. G. Plunkett, J. H. OBrien, H. Y. Spencer, J. H. Luca- do, Nettie M. Dresser, Grover E. Smith N. E. Farrar, P. B. Stratton Earle Robinson, C. Roland Smith, Walter Conner, Leonard Anderson, R. D. Robinson, Irby B. Wheeler, Thomas Davidson, J. A. Martin, C. T. Moses Jr."}, "highlight": {"text": {"matched_tokens": ["Flood", "Henry"], "snippet": "H. C. Pulliam, Dorothy <mark>Flood</mark>, J. A. Bingham, C. C. Harvey, Calvin H. Robinson, <mark>Henry</mark> Cabell, H. T. Williams,"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood", "Henry"], "snippet": "H. C. Pulliam, Dorothy <mark>Flood</mark>, J. A. Bingham, C. C. Harvey, Calvin H. Robinson, <mark>Henry</mark> Cabell, H. T. Williams,"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "carrier on R. F. <mark>D</mark>. No. 2, employed at"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "carrier on R. F. <mark>D</mark>. No. 2, employed at"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [413.46, 649.49, 562.97, 1140.47], "bbox_id": "4897c9a3e7", "file": "TimesVirginian_1976_0024.pdf", "page": 1, "text": "Upon this rock I will build my church. Miss Rosetta M. Berkley, of Richmond, spend the New Year Holiday here visiting her parents and family, Mr. and Mrs. Floyd Berkley, Sr. of Pamplin. Also visfting in that am home were Luther Hix and Brother Lewis of New York City, also Mr. and Mrs. William Chamber, Mr. Reed Berkley and Rev. H. O. Flood andr family, of Pamplin, and Mr. James Scott of Prospect. Our community was sadden ed to hear of the death of the late Major William Forbes on last week. May God be with the family in their hour of sorrow.. Mr. and Mrs. David Wool ridge, of Detroit, Mich., and Mrs. R. Davis, of New Jersey, all were visiting here over the holiday and Mr. Henry Pankey, also of New York. M rs. M illie Berkley and children visited in the home of her sister, Mrs. Hazel Walker and family on last Stmday afternoon. W e are very sorry to lesra tl t Mi.5 Albert tiffe d til w im side list in Washington, D.C. We hope he will soon improve May God bless him. The Holiness Gospel Singers of Pamplin will render f program at the Gravel Hill Baptist Church on the fourth Sunday evening in January at i p.m. We are asking everyone to come out and be with us. Mr. Jim H. Berkley visite here a few weeks ago. He is"}, "highlight": {"text": {"matched_tokens": ["Flood"], "snippet": "and Rev. H. O. <mark>Flood</mark> andr family, of Pamplin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood"], "snippet": "and Rev. H. O. <mark>Flood</mark> andr family, of Pamplin,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [631.72, 1106.02, 792.7, 1331.13], "bbox_id": "7a5178f17a", "file": "AppomattoxNewspapers_1912-1915a_0083.pdf", "page": 1, "text": "Titanic Survivors Ask For More Than 10,000,000 Damages. New York.A flood of petitions for damages through the loss of the steamer Titanic, filed Wednesday, In cluded one from Mrs. Irene Wallach Harris, who claims 1,000,000 for the loss of her husband, Henry B. Harris, the theatrical manager. This is thé heaviest of the 279 claims so far filed. Mrs. May Futrelle, of Scituate, Mass. asks 300,000 compensation for the. loss of her husband Jacques Futrelle, author. The claim of Mrs. Lily B. Millet, widow of Francis D. Millet, thé artist, a Titanic victim, is 100,000. United States Judge Hand extended the time for mine petitions of claims to February 11 . The claims amount to more than  10 , 000 , 000 , but the White Star Line contends that its liabilities is limited under the United States statutes to less than 100,000 the value of recovered records and passage money."}, "highlight": {"text": {"matched_tokens": ["flood"], "snippet": "10,000,000 Damages. New York.A <mark>flood</mark> of petitions for damages"}}, "highlights": [{"field": "text", "matched_tokens": ["flood"], "snippet": "10,000,000 Damages. New York.A <mark>flood</mark> of petitions for damages"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1563.58, 1037.3, 2200.79, 1333.64], "bbox_id": "7d54d6ac79", "file": "AppomattoxNewspapers_1902-1905a_0348.pdf", "page": 1, "text": "their loss. Well, Mr. Editor, for fear this , . . . . . may find its way to the waste basket, too strong. And at the finale in this course the general opinion is that I j w-jj cjoge success to the interesting trial the jury stood three Mr. Flood was satisfied of the fact I T im e s . for not guilty and nine for guilty that Judge Hundley -would refuse J August 1,1904, as charged In the within indict -1 the prisoner bail, or else he would ment The speeches, both for the U aye applied for it. I Sheppards defence and for the Commonwealth,   the meeting at the T aber-U naT ave com T lt lL t and the I poxxiattox, is visiting her sister, Mr nacle is now a thing of the past. We I ground is now too wet to plow. J W. R. Gheadle. ever and anon recall with ecstatic Thei Woolridge case has been the Miss Blanche LeGrande, of Lynch  . , 1 ,. I chief topic of conversation for the  hnr_ g viaitiuv at Mr. R. G. Jen joy the communion of saints at this   week8 Me88ra. L. a Pol. bur 18 vl8Uiag dear old place dnring the ten d ay slard W- G Moss, Fulton Baughan 1tung8  t  between and including J.nly 27 th I and Henry Cox from this neighbor-1 Hiss Courtney Uses, and 26th. It is true that the success J hood were on the jury. Store, Buckingham county, was vis of the meeting was greatl v marred     ut ,o r ho of I iting in. this neighborhood last week. 7 , _  , ? .  ,   Miss Susie Garnett and Mr. Tom by the fearful and far-reaching I g . x gmyrna church on August 3. court .trial that was going on at thel The Misses McDearmou, of Ever- Canrt House so near by, bat thanks I green, who have been visiting Mrs. to a kind Providence that never iRanson at Airlie, have returned turns a deaf ear to the ory of His I horn?- j i Miss Elizabeth Binford and Lona little ones, this dear meeting was I jjjan0j 0f Prince Edward, and Miss not without its abundant harvest for I Marian Binford, of Petersburg, are the Heavenly garner. There were I expected at Airlie to-day. reclamations and  Mrs. M. B. Pollard, who has been suffering with rheumatism, is im-"}, "highlight": {"text": {"matched_tokens": ["Flood"], "snippet": "jury stood three Mr. <mark>Flood</mark> was satisfied of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood"], "snippet": "jury stood three Mr. <mark>Flood</mark> was satisfied of the"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.03, 907.81, 1681.66, 1282.14], "bbox_id": "3b65ac2c7a", "file": "AppomattoxNewspapers_1954-1955a_0390.pdf", "page": 1, "text": "The following committees have been annoiinced for Appomattox Post 104 of the American Legion Membership Committee Chairman, L. G. McKenzie George W. Wool dridge, John C. Cole, Ray Ferguson, James L. Blackwell, Jr., B. Curry Harvey, Ivey Holand, and James Terry Rogers. Legion Grounds Committee Chair man, George W. Wooldridge Gilbert Mays, Marvin House, T. C. Harvey, Jr., Charlie W. Scruggs, John C. Harvey, and Charlie Carter. Entertainment and Refresment Committee Chairman, Emile Bruce W. D. Morris, John Hall, eulian C. Guill, Reginald Speir, and Fred ff.  Lawson. Visiting Committee Chairman, L. P. Brown? W. D. Moris, Gene L. Paulette. Americanism Committee Chair man, C. T. Moses, Jr. Joel W. Flood, Fred Smith, Frank E. Carr, Robert A. Sears, Eames Powers, and David T. Robertson. Child Welfare Committee Chair man, John P. Taylor Murrell Fergu son, C. T. Moses, Jr., Peyton Harvey, Henry B. Pack, and Thomas E. Le- Grand. Auditing Chairman, J. G. Plunk ett Berkley H. Guill, and W. D. Morris. Legion Building Committee Chair- continued on Page Eight"}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "Chairman, Emile Bruce W. <mark>D</mark>. Morris, John Hall, eulian"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "Chairman, Emile Bruce W. <mark>D</mark>. Morris, John Hall, eulian"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2171.71, 530.79, 2340.32, 1818.88], "bbox_id": "41faaba8f4", "file": "AppomattoxNewspapers_1918-1922a_0102.pdf", "page": 1, "text": "The cold spall of last week came in good time for people to kill hogs, and although the moon was not right for tho imsiness, many people killed And I only heard of one sale of oork on the local markht and that was at a price of 18 cents a pound. The prices of tobacco bn the local market were not so good the past week Mr James H Pit z rerald sold a lor d on the Farmviile market at an aver age of about 30, ahd a colored man near, here sold a small lot of wrappers on the same mar ket last week nt 1 pound The p ipers report a sate of tohacoo n the Danvill. m irket at 150 per hundred, vbioh broke tae record for prices f r o n t bacoo. Mr. Win F. liofr- - f or - Carolina, b uht he  Tv irs Rest tract of lan. i in ti.i county last week. Tui is rm aerjd land and was a pirtof tha estate of the lae Loui D Jones. la answer to the cal of the State Superintendent, Harm- dart, a good many sohool trus tees of this oouuty will attend the meeting o sohool trustees in Riobmond. Toe legislature will be asked to enact suoh Laws as will supply the need of money to run the schools on the increased salaries demand sd by the teacher. I would like to see Hon. II.D. Flood in thb senate of the U. 8 and he can safely count on a good majority in Buckingham sounty. Mrs. Temple Ragland has been spending some time witb Mrs. Maggie F. Moss at this place. Tbere is some talk of having an electric plant and generate electricity enough to light up the houses in this village and near by farm houses. Mr. W. H. Jones, of Colum bia, 8. U., was in Buckingham the past week on business and while here visited his relatives in the county. Rev Plummer F. Jones, jf New Cantos, has a tobacco warehouse on bis farm, whioh is to be managed this season by two men from North Carolina The First National Bank of Dillwyn has as an advertising scheme planted mile posts or  boards along the road leading from here to Dillwyn. Tee Merchants and Planters Bank Dillwyn has been made a national bank. The road machine bae been run over tbo saad-clay road asid somewhat repaired th damages done by the heavy motor trucks, Mrs. Q. L. Brown expects to leave tbit week for on extended visit to her Lome people. We are just beginning to feel the war expenses when we buy goods along certain lines.. The merchant names a price and then says the war tax has to be added to the price. Mik q o w b are in great de eg and at big prices, but stock cattle are dull sle at reduced prices. Mr. Jack Hoopsr is ill at his home near here and bis friends fear he may not recover. Mr. and Mrs Ben Gilliam are living in the house with Mr Hooper and take care of him. Mr. Diok Grigg has been stayiug a while at his old home here. Professor Henry Groseclose killed a big turkey gobbler on Saturday that weighed twenty ponnds Pot hunters have been kill ing the few birds that have survived the terrible cold win"}, "highlight": {"text": {"matched_tokens": ["d"], "snippet": "rerald sold a lor <mark>d</mark> on the Farmviile market"}}, "highlights": [{"field": "text", "matched_tokens": ["d"], "snippet": "rerald sold a lor <mark>d</mark> on the Farmviile market"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.9, 942.06, 1609.91, 1809.19], "bbox_id": "18e17810dc", "file": "AppomattoxNewspapers_1952-1954a_0508.pdf", "page": 1, "text": "t it. iO U n ccv u v a i tobacco commission mer- bacco leaf dealers and no 22 chewing tobacco manu- were listed. Tobacco ware- re Friends, Lynchs, Lib- j-tins, Moormans, Paces, Sc. George A. Diuguid   undertakers at 46 Main, e Lynchburg was disposed directory, on page 195, ets around to the miseel- ppartmer And therein at Appomattox County was fth Judicial CircAiit, with stavus A. Wingfield hold- ere the 15th of March and of September. He served, rounties of Bedford, Camp- nd I Amherst, as well as the f Lynchburg. Henry T. Parrish judge of the county court in  u b x , holding court the firs daw after the first Monday in mofth. is alnost incredible to find out H er of secret, benovolent ther societies and organizations d in the 1880s. Marshall 39, Hill City Lodge No. iburg Chapter No. 10, De r kmandery No. 4, Covenant 12, Star of the West e, Prince Hall Lodge No. 29, hapter No. 5, Knights of ujth two lodges, I. O. txyo lodges, I. O. R. M., gbities, Legion of Honor, mm, Knights of Honor, ite with four units, St. eneficial Society, St. viers, Ladies of the Al- en add in the Garland lub, Oliver Twist Club, ty Boat Club, The Gentle- ng Club, Ladies Glee ordia Glee Club, Mozart ___ and Opera House. Gee, sver stayed at home no won- m didnt need television! to newspapers, there were The Lynchburg News pub- evefcr morning except Mon- WHfgjplso got out a tri-weekly 1 onlMonday, Wednesday and i, and on top of that a weekly  enlThursday. That seems to P toJTEN issues a week. The bum Virginian and the Daily lC j tbe same, except that dvaniee got out a semi-weekly  fa tri-weekly on top of its and weekly issues it all indi- tbai 29 papers a week were led.A. Waddill was proprie- ThigNews and a young fellow 8 6Pne of Carter Glass was ditor. JgjBpomattox way, N. H. Rag- ras mstmaster and ran a gen- aerchndise store. The school nown as Budwells High L mbert P. Pattei son was the  daitor. Joel W. Flood was  cattle dealer, as was W. tneyUEdward G. Hix ran the loteLIWilliam H. Gills was the 7 hwosurer, David A. Christian I William A. Plunkett aeriff, John Robertson was the akerand T. P. Taylor was e of peace. John and Will- osser ran stores. Leading farm- nr w Woodson, John .M   Sears, Charles H. Sack- ilhsjgb,e, William Trent. Allen pings Conner, Ed S. -ontmfced on Page Four"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "as the f Lynchburg. <mark>Henry</mark> T. Parrish judge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "as the f Lynchburg. <mark>Henry</mark> T. Parrish judge of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [515.96, 172.1, 690.05, 1391.91], "bbox_id": "8d1a5f00be", "file": "AppomattoxNewspapers_1918-1922a_0551.pdf", "page": 1, "text": "son, 8 L. Ferguson, Wm. A. Gleason, Jr , W. T. Harrison, Thomas F. Ryan, R. F. Burke, J. T Fitzpatrick, Joseph But ton, Oscar Portner, E W. Hub  bard, W. F. Tinsley, Joseph F I Lowman, A. 0- Portner, Dr. E I A. Alderman, Claude F.itcheu, jE. Lee Trinkle, Wm F Rhet., j Dr Thomas Nelson Page, R. L Burke, Alfred P Thom, Wm H Manu, Breckinridge Long. Ken neth cKellar, Joseph T. Rob inson, Oscar W. Ufiderwood, Judge Henry T. Wickham, Dr A. 8. Priddy, Joseph M Bauser man, Judge 8 C. Graham. James Hay,Joseph A Glasgow, Dr James Abbitt, W. W. Sale, Robert Lansing,Henry 0 Stuart , Geo. Peary, C. Lee Moore, John R. Saunders, Julian Gunn, J D. Hank, J. E West, N. R Feath erston, Judge Goe. J. Hunk ley, S. C. Stratton, F. C. Moon, Bland Massif, M. B. Booker, C J. Campbell, Clyde 8aunders, W E. Carson, E. V. Barley, A. H. Williams. Our special Washington cor respondent says of him The death of Flood is directly due to his fine devotion to his State and partv When tbs Republicans gave it out that they were going to break into the solid South and that Vir ginia was to be the gateway, everyone knew that it meant another loosening of the strings of the long purse that poured out millions and millions for the election of Harrison, Me Kinley, Roosevelt, Taft and Hardingthe long purse of privilege. The Virginia leaders looked over the field and could see no one but Flood to lea the fight to prevent the Repub licans again getting a foothold in the State that was still re- membring painfully the days of the carpet baggers So Flood wae drafted for the iob, though already Chairman of the Demo cratic Congressional Commit tee, he went into it like he went into every other fight with every ounce of force there was in him Of course he wod , aud the Democrats carried Vir ginia by the biggest majority ever known, but Flood came back to Washington and took to hi bed, never to leave it. Of him it can be truly said  He died with the harness on, the broad sword leaping, the wild fight surging fast  Rich as the party is in leadership, Democracy can ill spare him, this proud Virginian, proud of his clean hands, his clean pub tic record, Lis clean profession al career and his spotless personal character. It is re membered of bim that when he first came t j Congress, defeat ing Jacob Yost, a Republican, the result was very close ano he was offered the certificate of election on. a technicality, wbereu ton be refused to accept it, preferring to stand aside until the status of every ques cioned ba lot wae determined, be knew he might lose by so doing, but be preferred it that way. The folio wiug tribute paid our distinguished countyman by a life-long friend is worthy of both men Nobody seems to be able to realize chat Hal Flood, of Ap pomattox, is dead. We cannot grasp the fact that the mao of vigor and force and activity upon wuern we Had learned to rely, and under whose devoted watch care we had learned to feel secure has been suddenly called from his earthly duties, ank that our friend is no more. Mr. Floods great abilities and worth in public life were uaiversaly recognized. But to the people of Appomattox nr was held in esteem as nowhere else, because it was here that tiis worth in private life was best known. Many years"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "Oscar W. Ufiderwood, Judge <mark>Henry</mark> T. Wickham, Dr A."}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "Oscar W. Ufiderwood, Judge <mark>Henry</mark> T. Wickham, Dr A."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [216.95, 215.73, 796.14, 506.64], "bbox_id": "8863a67c28", "file": "AppomattoxNewspapers_1908-1909a_0077.pdf", "page": 1, "text": "R. U Burke.Trsss..1921-26 tax tickets, stationery, Treasurer of Virginia, one-half cost audit Treasurer accounts Ik F. Caldwell, salary as Local Sealer of Weights and Measures Henry Troemer, recutting die for local sealer, e t c ------ --- Schwarts, report cards local sealer     printing financial statement, notices, etc.,-  ? f f e sr  - ju w _ McKinney, sum. petit and special Juries ------------ -  r jj.W. Flood, Trustee, costs and fees selling old poor house farm Showing resources and disbursements f o r U p p .p u o x  jir   ri e n  p miu     rear beginning September 1st, 1925, and end- J Dr. D. A, Christian, scarlet fever inspection  - --------- --------- , 3 , nA r u R. Smith, service as member of Local Board of Review ------ i n g A u g u s t  0 , lS z J b  IF. A OBrien, service as member of Local Board of Review. -----  5 m p Aivis aervide as member of Local Board of Review Board pf Review ------ RECEIPTS. To balance due by Treasurer Aug. 5, 1925 _  __  ___ -  - ------ I 8,172.63 To takes on real estate, tangible, personal property, railroads, telegraph telephone, light and power and express compan ies -property, total value 93,184,047.26, at 50c - _______  To tax on merchants and Bank C apital __ ___________ _  -- ------ - To penalty added ____ , ------------- --------- ----------- - -------------------- To interest on funds on deposit in Bank  - --------------- ------- N.  W. Ry. Co., costs of special ju rie s ------------- - ----  -- ----- C. R. Wood and J. H. White, primary ent. fees i. ________ T. B. M oorland others, subscription on W. I. Creek bridge _  8 . E. Anderson and C. A. Moore, brick and frames from Clerks Office  __  ___ -     _________ _  - Bounties returned by the Game D epartm ent _ _ ___________ _ S. L. Ferguson, light rent to Jan. 1, 1926 ________ - _________  Capitation Tax returned and delinquents col. by C lerk ______ - From joint maintalnance fundrefund for maintainance work paid for by Board  _ _____ _  ___ _ ______ _ _ ___ _ ____ _ 6,073.52 Delinquent Land Taxes collected by Clerk and from sa le s_____ 230.29"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "of Weights and Measures <mark>Henry</mark> Troemer, recutting die for"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "of Weights and Measures <mark>Henry</mark> Troemer, recutting die for"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1458.95, 788.55, 1618.17, 1353.6], "bbox_id": "e961f29e10", "file": "AppomattoxNewspapers_1892-1898a_0321.pdf", "page": 1, "text": "Patrick Carney, sixty years oldvas eickei to death ia Chicago by James Wilson. Major W. C. Murland, ex-city attorney o Pittsburg, pleaded guilty to a charge of em bezzling city funds. ----- 1 he Peoples Saving Bank, of Lansing, Mich., tailed t open itf doors and wi 1 go Into tho hands ot a re oeiver. The bank is capitalized at 150,000 ----- Tbe Virginia Bar Association will mee ot Old Point Comfort.- The battleship Texas came out of the dry dock at the Nor folk navy yard. ---- James L. Taylor wa drowned at Pinners Point, Va. A masket man robbed nnd shot Bnrkeeper Tomlinsoi at NomeldorFs saloon, In Kanawha, W. Va ----- Mrs Henry Inske, wife of a farmer nea Big Bracken Creek, in Ohio, was drownec by the flood. ----- The Agricultural Depart ment has issued an appeal for a bird day, to be obsorved throughout tho country.  . H Roberts, a Nebraska farmer, killed hi wife and himself. ----- Ely, the train robber has been captured in Lawson, Mo. ----- 1 train on tho Lehigh Valley ran into a cov near Hazleton and was wrecked. Bevera persons were fatally injured. ----- Specln Master Crawford filed his audit in thi United States Circuit Court iu Philadelphii ot the account of the receivers of the Phiia delphia and Reading Railroad Companj for May la s t ---- Two incendiary fires occur red in Toledo, Ohio, and at one of them i policeman and a fireman were badly hurt Tne aocideat occurred nt the planing mill o Maclaren  Sprague. Robert M. Hunter and William Joyce, cabin boys on the steamer Bonanza, shot.and killed Peter Whitaker in Pomeroy, Ohio. The killing was the result of the rivalry over a woman. Their homes are in Cincin nati ----- As the freight train 218, on the Fitchburg Railroad was on its way to Con cord, Mass , it jumped the track just outside of Concord Junction, and ten cars contain ing live stock were demolished. Over 00 calves, sheep and oxen were killed, nnd numbers were so badly injured that they had to be killed immediately - In tbe fedoral court in Seattle, Washington, Judge Halford has made an order d smissing Oakes, Rouse and Payne, the old receivers of the Northern Pacific, excusing them and their sureties from further liabilities and wiping out the charge of contempt of court which have been pending against them ----- Eight of the in firmary at Cincinnati died from the effects of a Fourth of July feast ----- The Mallory Line steamer Colorado struck a mud scow in New York harbor, and was so badly damaged that her captain beached her. ----- The United States Educational Association held Its an nual meeting at Lawrence. Kansas."}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "Kanawha, W. Va ----- Mrs <mark>Henry</mark> Inske, wife of a"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "Kanawha, W. Va ----- Mrs <mark>Henry</mark> Inske, wife of a"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [165.84, 466.23, 312.32, 1762.57], "bbox_id": "0a8502fbfc", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "Palma Let him now take his stand in the front rank of American Heroes. By Maj. Samuel J. Walker - Bartholomew Cyrus the only surviving Revolutionary Sol dier present May his last days behübest. By Bartholomew Cyrus A Revolutionary Soldier - May the feelings which filled the hearts o f the Patriots of the Revolution be justly appreciat ed by the youth of the present day. By Dr. Wm. D. Christian Speedy peace with Mexico continued peace with Great Britian and the world. By Maj. Samuel J. Walker  Gen. Scott and Gen. Gaines The distinguished services of these Generals in the late war, and the blood the one spilt at Lundys Lane and Chippewa, the other at Erie, will protect them against the assualts of President Polk and his Secre tary of War. The American people understand how to estimate these services. By Thomas S. Bocock  Gen Scott We thank him for what be has done for his country and only wish that during the next Presidential term he may take his hasty plate of soup in privacy, without the fear of enemies either in front or rear. By Rkhard Perldiu invited Guest - The County of Appomattox, I hope the hospitality exhibited by her citizens this day Will form a closer alliance with her deserted parents. I was her greatest enemy in war, in peace her best friend. By QBss  Partwood  Henry Claftffie wisp end good May posterity do homage to hie destinguished ability, by implic it acquiescence in the great leading measures of his policy of our Government By Cat Beujamiae P. Walker - John J. Crittenden The unrivalled Orater, accomplish ed Gentleman and able Senator, he deserves the gratitude of his Country for his services on the Oregon Question. By P. B. Pankey - Col. T. H Flood - long the whig tide of Buckingham surely Hot diked by Appomattox. Loci Focoisn. By Capt. J. A. Hamer - General Taylor like a Washing ton and Jackson May he long be remembered by the Ameri can People. By Henry F. Bocock - The ladies  of Appomattox, as patriotic as they are fair. By A. A. LeGrand - The perpetuation of our Republican Government and the just appreciation of the rights of the governed. By G. W. A. Raine - E. J. Goode - Reader of the Declaration of Independence - May a distinction worthy of the intelligence and patriotism of his youth crown his entire manhood with the love and respect of his countrymen. By H. F. Bocock - R. M. T. Hunter A fearless advocate of the rights of the people, regardless of the consequences which may result to himself - May he fill the seat about to be vacated by our distinguished Senator, Wm. S. Archer. By Capt. Thomas W. Johns - Gen. Andrew Jackson The warrior and statesman sleeps with his fathers. His memory will evpr be reversed alike by philanthropists and patriots, his services both in the council chamber and upon the lentel field will be handed down to the latest posterity - and shine as morning lights in his countrys history. By A. A. North - The United States and Texas - Long may this union of the two republics last and long may it continue to disperse its blessing? to the countless millions who in the course of time, are determined to animate its soul. By E. B. le nd - Henry Clay - May his evening sun set as tranquil as was his meridan, bright and luminous. By A, W, Carter - Edmund J. Goode The handsome which he this day delivered, gives us promise of future distinction and usefulness, and"}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "day. By Dr. Wm. <mark>D</mark>. Christian Speedy peace with"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "day. By Dr. Wm. <mark>D</mark>. Christian Speedy peace with"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [254.41, 272.42, 744.42, 572.61], "bbox_id": "6d532481c0", "file": "AppomattoxNewspapers_1908-1909a_0182.pdf", "page": 1, "text": "Owing to illness of a son of I Farmers-were very glad to see judge Hutcheson, Judge Henry I the nice showers Sunday and C. Leigh, of the Corporation I Monday. Some have been using Court of Danville, held court I tobacco planters and planting here Friday and Saturday in his I tobacco. stead. Judge Hutcheson will be I Mrs. J. A. Stratton is visiting on the bench here to-day to finish! relatives in Lynchburg Mid at- up the business of the term. I tending the Randolph Macon S. P. Loving pleaded guilty to I Womans College finals, where the indictment found against I her daughter, Miss Frances, was Misses Earle Pattteson, Vera him for defrauding State Bank I a member of the graduating Connor and Virginia Puckett L f pamplin of approximately I class. are visiting their cousin, Miss I 35 060 , upon the recommenda-l miss Annie Alvis, of Farm- Anna Jordan, and other relatives Ljon 0f Commonwealth Attorney I vine, arrived Tuesday to spend at Cullen, Va. Flood was given a sentence oflgeveral weeks with her parents. Mrs D. E. Caldwell and D. E. only three years in the peniten.lr. and Mrs. J. P. Alvis, before Calwdell, Jr.,  of Bluefield, W. tiary. Many of Lovings friendg gojng to Columbia University, Va have been attending com-had petitions asking for the New York.  mencement exercises at State minimum punishment. 1 The Stonewall School closed Teachers College, Farmville, Va., j Wesley Coleman was given a I Friday night with an attractive where the formers daughter, fine of 100.for driving automo. program by the children. Misses Miss Lillian Caldwell, graduated, j bile under the influence of liquor I Smith and Reynolds returned to While away they also visited land a suspended jail sentence of I their homes at Appomattox Sat- friends at Amelia C. H., and thirty days.  lurday, we hope to have these Richmond. I Edward Lucado charged with I young laies with us again next"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "see judge Hutcheson, Judge <mark>Henry</mark> I the nice showers"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "see judge Hutcheson, Judge <mark>Henry</mark> I the nice showers"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1717.91, 291.68, 1891.69, 1151.76], "bbox_id": "c23e28625b", "file": "AppomattoxNewspapers_1955-1957a_0300.pdf", "page": 1, "text": "Mrs D. G. Trent is spending some time in Williamsburg, with her son-in-law and daughter, Mr, and Mrs. John Tabb. John D. Littell returned to his home in Pittsburgh, Penna., Tues day after spending the summer with his brother-in-law and sister, Mr. and Mrs. J. Berkley Drinkard. Mr. and Mrs. Robert D. Almond, John T. Hall, Mrs. Eppes Johnson and daughter, Sarah Jane, and Mrs. B. S. Stewart were week-end guests of Mr. and Mrs. Charles Compton, in Ohley, West Virginia. Miss Mary Louise Gills, who re cently underwent an operation at Johnston-Willis Hospital, has re covered sufficiently to return to her home at 218 South Blvd., Rich mond. Mrs. Joel W. Flood, president of the Alice Kyle District, Virginia Federation of Womens Clubs, at tended a meeting of the board of directors of the Virginia Federation at the Cavalier Hotel in Virginia Beach last week. Miss Edna Gregory, a student at the College of William and Mary, Was home for the week-end to at tend the George - Stanley wedding. Miss Gregory had as her house guest, Miss Elizabeth Hix, a senior at Westhmpton College. Mrs. Irvin C. Moses visited her son-in-law and daughter, Mr. and Mrs. Spencer Garrett Jr. in Balti more for the week-end. Also Mrs. C. B. Page, son and daughter-in- law visited her son-in-law and daughter, Mr. and Mrs. Kent Guth rie in Baltimore over the week-end. Mary Alice and Peggy Henry, daughters of Mr, and Mrs. Walter Henry have entered Longwood Col lege. Mary Alice, a junior, is study ing to be an elementary teacher, while Peggy is majoring in journal ism. Mrs. Alpha Higginbotham return ed home .Saturday, after spending several weeks in Norfolk with her daughter, Mrs. Robert A. Elliott. Mr. and Mrs. Elliott and daughter, Susann accompanied her home and spent the week-end. Mr. and Mrs. J. D. Childress, of Lynchburg, are announcing the birth of a son, J. D. Jr., born at the Virginia Baptist Hospital Oct. 6. Mrs. Childress will be remembered here as Miss Shirley Mitchell, the daughter of Mr. and Mrs. Curtis Mitchell. William Childs Martin, son of Mr. and Mrs. Howlette Burge Martin, of Spout Spring, has returned to Hampton-Sydney College, where he is a member of the junior class Hampden-Sydney is now in its 180th session. Mrs. M. T. Shipman and daugh ter, Mrs. Gardner Tyler Brooks, of Williamsburg spent the week-end with Mrs. Shipmans niece, Mrs. Watt H. Stanley. They were here for the George - Stanley wedding on Saturday evening. Miss Rosa Mae Wooldridge, Mists Laura McFadden and Mrs. Stanley C. Boyce, as members of the board of directors of the new Lynchburg General Hospital, motored to Lynch burg Monday afternoon, where they joined other directors in making a"}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "Mrs <mark>D</mark>. G. Trent is spending"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "Mrs <mark>D</mark>. G. Trent is spending"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1026.23, 344.89, 1187.46, 550.49], "bbox_id": "72281435b5", "file": "AppomattoxNewspapers_1933-1936a_0208.pdf", "page": 1, "text": "Mrs. A. G. Childress, 10 John C. Stanley, 25 lick Lawson, 5 Reggie Stanley, 25 J. W. Canten, 5 W. J. LeGrand, 25 W. W. Mar tin, 10 Miss MaBelle Smith, 25 Edward OBrien, 5 Mrs. W. L. God sey, 5 Miss Lorean Godsey, 5 Miss Jewel Godsey, 5 Ryland Godsey, 10 B. B. Flood, 10 G. H. Ranson, 10 E. T. Mitchell, 5 Miss Ella Carter, 10 Miss Rosa Falkner, 10 Mrs. Ola Harris, 10 Mrs. Falkner, 1.00 Henry Lewis, 5 Paten Seay, 20 J. H. Flowers, 5 C. Hudrex, 10 Frank Ellisworth, 10 Jennings OBrien, 10 Flax Branch, 25 L. Harvey, 10 W. D. Martin, 5 Ned LeGrand, 25 J. H. OBrien 25 W. H. Conner, 5 L. T. Lucado, 10 lash Children, 10 Loyd Doss, 10 Billy Childress, 10 Mrs. Lucy Jack- son, 1.00 Nannie Watson"}, "highlight": {"text": {"matched_tokens": ["Flood"], "snippet": "Godsey, 10 B. B. <mark>Flood</mark>, 10 G. H. Ranson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Flood"], "snippet": "Godsey, 10 B. B. <mark>Flood</mark>, 10 G. H. Ranson,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2004.0, 227.14, 2154.37, 1226.14], "bbox_id": "cb78bc0598", "file": "AppomattoxNewspapers_1971-1973a_0328.pdf", "page": 1, "text": "Mr. and Mrs. R. C. Moore, Jr. of Fairfax spent last week with Mrs. T. N. Saul. Mrs. Bob Bryan and Mrs. W. T. Cook attended The James River Association at Bethlehem Baptist Church Thursday. Our Pastor the Rev. Robert E. Jo hnson of Richmond also attend ed. Mrs. T. N. Saul, Mrs. R. C. Moore, Jr. and Mrs. E. R. Re pass spent Thursday in Rich mond. Mrs. Roger Morris was host ess to the Womans Missionary Society Meeting at the Chest nut Grove Baptist Church Fri day night. Mr. and Mrs. Charles Wayne Cook of Lynchburg spent Friday night and Saturday in the home of Mr. and Mrs. W. T. Cook, Saturday supper guest of Mr. and Mrs. Charlie Simpson at Prospect were Mr. and Mrs. Kemper Beasley, Sr. Mr. Frank Beasley Mr. and Mrs. Ralph Repass. Wednesday visitors of Mrs. T. N. Saul and Mrs. E. R. Repass were Mrs. Len Gills of Farmville, Mrs. Otis Gil liam of Prospect Mrs. Eliza beth and Iva Young both of Prospect. Mr. and Mrs. Henson Morris returned home Wednesday after two weeks visit with Mr. and Mrs. C. J. Morris and Cindy at Highland, California. The Rev. Robert E. Johnson of Richmond was Sunday dinner guest in the home of Mr. and Mrs. Joe Harris. In the after noon they all visited Mr. D.A. Manis at St. Johns nursing home in Lynchburg. Mrs. Ruth Beasley has return ed home after spending some time with Mr. and Mrs. Sam Baldwin at Rustburg. She was Sunday dinner guest of Mr. and Mrs. Odell Kirby in Farmville. Mr. Henry Gills of Farmville spent Monday with Mr. and Mrs. Kemper Beasley. In the after noon they visited Mrs. Mamie Hancock near Appomattox. Mr and Mrs. Marshall Cas sidy of Crewe were Saturday visitors of Mr. and Mrs. Bill Senger. Mr. R. W. Senger of Cumber land visited Mr. and Mrs. Ed ward Senger Sunday. Mr. and Mrs. Kemper Beas ley, Sr. were Sunday visitors of Mr. and Mrs. Richard Webb and Walker Webb, all of Appo mattox. Faye Harris had two of her  gfrl friends from school to spend Wednesday night with her in celebration of her birthday, Mary Jane Bolling and Barbara Edwards. Thursday overnight guest of Donna Harris were B r e n d a Woodall of Farmville, Debbie Ragland of Glenmore. The Youth Group of the Chest nut Grove Baptist Church enjoy ed a Wienie Roast Friday night given by Mrs. Bob Bryan. Mr. and Mrs. Roger Morris and family visited Mr. and Mrs. Rice Seay at AndersonvilleSun. Flood Harris of Green Bay was dinner guest of Mr. and Mrs. Russell Lee Harris Sun. Afternoon visitors were J. C. Tompson, Barbra Maxwell of Farmville, Ann Maxwell of Hix- burg Mrs. Dicky Shorter and"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "Kirby in Farmville. Mr. <mark>Henry</mark> Gills of Farmville spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "Kirby in Farmville. Mr. <mark>Henry</mark> Gills of Farmville spent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
