{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["Henry", "T", "Parish"], "snippet": "T. Peers as clerk. <mark>Henry</mark> <mark>T</mark>. <mark>Parish</mark> was county judge and"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry", "T", "Parish"], "snippet": "T. Peers as clerk. <mark>Henry</mark> <mark>T</mark>. <mark>Parish</mark> was county judge and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["T", "Parish"], "snippet": "House H.D. Flood, H. <mark>T</mark>. <mark>Parish</mark>, R. B. Poore and"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Parish"], "snippet": "House H.D. Flood, H. <mark>T</mark>. <mark>Parish</mark>, R. B. Poore and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1028.15, 1330.12, 1195.14, 1745.16], "bbox_id": "547a8dba43", "file": "AppomattoxNewspapers_1902-1905a_0087.pdf", "page": 1, "text": "HEIDKF.K is a beautiful bay horse. _ _ m etrically proportioned, with black mane and tail is Bve years old and stands sixteen bands high. He was bred by Anthony J Drexel, the milUonaire banker of Philadel phia, passing from him into the hands of A. J . Twaddell, c f the same city, from whom the l resent owners purchased bm several months ago. Danesfort, the sire of HEIDREK, stands at  behead of Oak Hill Stud. Aldie, Virginia, the property of Hon. Henry F ainax, where one of bis progeny. Fiery Dane, a half broth e r to HEIDBBK, and a recent winner of first and second prises in the three yearold classes a t both Philadelphia and New York, was bred and schooled. Fiery Dane. Immediately after the Horse Show in New York last November, was sold by Senator Fairfax to John H obart Moore, of Chicago, for the princely sum of iteo.tbQusaud dollars. Heroine, tbe dam of HEIDREK, was im ported into this country by Dr. W. Seward Webb, a son-in-law of the late William H . V anderbilt, and placed among a string of mperbly bred Hacking mares at Shelburne Fa rms, Vermont, where she produced several inize winners, prominent among whom is Mouutain Maid, a frequent winner a t New York for her owner. Lewis Wormser. esq. Heroine is herself a prize winner, having carried off several ribbons at Madison Square .arden during the Horse Shows of !-VI and I  . She Is now a brood mare in the celebrat ed Plymouth Hackney Stud of Eden D, Jp r tteitjesq, of Hostnii, Mass. Dau gelt. the sire oi picsfnrf. and gland sirenf H El t 1EH- Md  I rnty live i bous and dollars wnen thirteen .years..Id, lie was tie sire of Matchless, pf i.ondesiioi-o, i oyat lia-egelt. Itsadirand linnvinede. a 1 oj c 1 -111 were chuplons il til dr ri.iy. e Dnmark. the sjreo f Ianegelt. and lairo Derby 2 d., tbe grandsire Ianesfqrt  iet! the Hackney pedigrees i.gt i eiin g t-u and Leamington are to the Amor, an rad horses no good imps without aslio x in g of theii blood, Monarch, tbe sire of Heroine, and grand sire of HEI DUEK, on his duius side wa- prol ably tbe greutest Norfolk llacknevstall ion of a half centurv. it is said ufhim that bis foals paid the ren t Ot Ills parish for a de- fcWle, He w rttl ho.ide a boat of ahow horses I IttiO ohaimdon pillions t- asht-oi and Reality 1  HKlTiMBK, is perfectly docile, a chSnsot eristic f tile Hackney breed, has line speed fur a youngster, as well as great pow eraor on u ranee, and bis get from either high class or common work mares should make horse admirably adapte 1 to the farm or road. The owners of H- IDRBK.do not propose to charge an extortionate ree for hls servicT simply 1 cause he is a fine horse, and bre,. -in tbe purple, but they are exceedingly an xious to improve the stock of horses in theii. vicinity, and to that end, will the following fee. which, pqsidenng tha ---? nfurinnw g tU ttir. .U.S"}, "highlight": {"text": {"matched_tokens": ["t", "parish"], "snippet": "foals paid the ren <mark>t</mark> Ot Ills <mark>parish</mark> for a de- fcWle,"}}, "highlights": [{"field": "text", "matched_tokens": ["t", "parish"], "snippet": "foals paid the ren <mark>t</mark> Ot Ills <mark>parish</mark> for a de- fcWle,"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1099.7, 1634.81, 1263.92, 1882.79], "bbox_id": "7a42e6c7a9", "file": "AppomattoxNewspapers_1898-1902a_0056.pdf", "page": 1, "text": "TN THB CUEHKS OFFICE OF THE Clii- X CCUT Court of the County of Ruckinham on the 19th day of September 198. Annie E. Perkins and J. F. Perkins her hus- oand.., .................................................... Plaintiffs against Bettie Davis and F. S. Wilkinsons adminis trator and others .............. ....... Defendants The object of this suit is to perfect and quiet the litlc of Annie E. Perkins one o f the plaintiffs to the tract of land in Buckingham county, Virginia, bounded by the CartcrsvilJe Road on the south, on the east by land of SamuelC. Wilkinson, deceased, on the north by Pardee and Terrell land, on the west by Pardee and Lee land and others, containing 45414 acres more or less, w hich was formerly owiied by F. L. Wilkinson, deceased. And an affidavit, having been made and tiled that the defendants Bettle Davis an d ---------- Davis her husband, Emily Parish a n d --------- Parish her husband, Christopher Meyers, Roberl Meyers, Addie Meyers, Mary Meyers, Davy Meyers, uratsford Meyers, Samuel C. W ilkin.on, Fannj A. Wilkinson, Nettie L. Wilkinson, William Wilkinson, Bessie Wil kinson and Henry Wilkinson arc not residents of the State of Virginia, it is ordered that  they do appear here within fifteen days after due publication hereof, and d  what may bc- necessary to protect their interest in this suit. And it is further ordered that a copy hereof be published once a week for foursu. . cessive weeks in the Appomattox and Duck- I inghain T imes and that a copy be poste  at the front door of the courthouse of this  county on the first day o f the next terin of I the county court. A copyTeste P. A. FORBES, Clerk. E W. HUB A it D, p. q. 9-2 4w"}, "highlight": {"text": {"matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> a n d --------- <mark>Parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> a n d --------- <mark>Parish</mark>"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1065.11, 996.66, 1221.79, 1433.16], "bbox_id": "fddee8e491", "file": "AppomattoxNewspapers_1898-1902a_0072.pdf", "page": 1, "text": "T h e little  D octors Book  toll alt abotr them , an d a w e e k s T reatm en t F ree, prove- e v e ry w o rd true. Com plete T re a tw c a v , 26 . M OW N MFS. CO.. N. V. I   greM t,iiu. fen I N THE CLERKS OFFICE OF THE Cl CD1T Court of the County of Bucklnglm on the 10th day of September IMS. Annie B. Perking ana J. F. Perkins her bu oand......................................... .. ....... Plttiutn against Bettie Davis aud F. 8. Wllhinaons admini- trator and others ............. ....... Defendant The object of this suit is to perl eet au qniet the title of Annie E. Perkins one of tli plaintiffs to the tract of land In Uuuklntfluu county, Virginia, bounded by the Carteravlli Hoad on the south, on the east by land u Samuel C. Wilkinson, doce.iscd, ou the i-m i by Pardee aud Terr,-!! land, on the -1 u Pardee and Lee land and others, contai.-iii. 4644 acres more or loss, which was foameil owned by K. L. vv ilkinson, deceased. And au affidavit having heed made un i lile- thnt the defendants liettic Davis and ------ Davis her husband, Emily Parish and  - Parish her husbai.d. Cnri-tophcr Meyers Robert Meyers, Addie Meyers, Mary Meyers Davy Meyers, Unn.sford Meyers, egmuel C Wilkin on, Fanny A. Wilkinson, Nettie I. Wilkinson, William Wilkinson, tiussie Wii kinson and Henry Wilkinson are nut resident, of the State of Virginia, it is ordered tha they do appear here within lUtuen days alter due publication hereof, and d what may In necessary to protect their interest in lh - suit, Aud it is farther ordered that a copy hereof be published ouce a week for four su- cesslve weeks In the Appomattox aud luck Ingham T imes and that a copy be pouted a the front door of the courthouse of thi county on the flrst day of the next term o the county court. A conyTeste P. A. FORRES, Clerk. B W . H U B A R D , p . q . 0 -flx 4 w. r RUST EES SALE. By virtue of a deed of trust, dated 29tl. day of November. 1806, of record in the Clerk Office of Appomattox county court, D. R. 3. pages 233-4, default having been made in th payment of the debt thereby secured, anc being required by the beneficiary so to do, i will sell by auction, at Appomattox Court House on THURSDAY, DEG. 8TH, 1898, the following property A tract of land con taining 107 acres, with buildlnifs thereon, it the county of Appomattox, south of Ever green. and bounded by the estates of K. tv. wheeler and Presley Paulete and the land o E. G. Harvey and owned by Sarah A. Harvey. TERMS Cash Sufficient to defray expense, of executing this trust and a debt of 161.87. with interest thereon from July 1. 1806, and residue upon such terms as may be prescribed by Mrs. Sarah A. Harvey or myself, which will be announced at sale. 10-3m. P. R. WOOL UBIDGB.-Trastee."}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "<mark>T</mark> h e little  D"}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "<mark>T</mark> h e little  D"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1099.18, 1061.81, 1257.45, 1311.14], "bbox_id": "99be2d763a", "file": "AppomattoxNewspapers_1898-1902a_0068.pdf", "page": 1, "text": "N THE OLE UKS OFFICE OF THE CIK- L CUlT Court of the Couuty o f I5uckinhrtir. on the 19th day of September 1898. Annie E. Perkins and J. F. Perkins Fier hus- Dand........................................................Plaintiff. against Dettic Davis ami V, S. Wiikinsous adminis trator and others..........................Defendants The object o f this suit is to perfect and juiet the  itie of Annie K. Perkins out, oi the iriaintitfs to the tract of land iu Buckingham county. Virginia,bounded by the Cartersvilie Hoad fin the south, on the east by land of aniuel C. Wilkinson, deceased, on the  trth y Pardee and Terrell arid, on the viest by Pardee and l.ee land and others, containing acres more or less, which was formei 1 wned by F. L Wilkinson, deceased. And an affidavit having been made and lljed that the. defendants Nettie Davis an d ---------- Davis her Uusbaud, Emily Parish a n d -----  Parish her husba-d, Christopher Meyers, itoberi Meyers, Addie Meyers, Mary Meyers, Davy Meyers, lirar.sford Meyevs, Mmucl O. Wilkin on, Fanny A. Wilkinson, Nettie !,., Wilkinsou, William Wilkinson, llessio Wil kinson and Henry Wilkinson fire not residents of the State orVirginia, it is ordered that they do appear here within fifteen days alter due publication hereof, and 1 what may u accessary to protect their interest in this uit. And it is further ordered that a copy hereof be published once a week for foursu oessivc weeks in the Appqmaitnx and liuek-  ogham T im ks and that a copy be posted at the front door of the co.uihouse of this county On the first day of the next term of the county court. A copyTeste  P. A. FOLUIES, Clerk. E W. HUBAttD, p. q. 9-2x 4v."}, "highlight": {"text": {"matched_tokens": ["Parish", "Parish"], "snippet": "Davis her Uusbaud, Emily <mark>Parish</mark> a n d -----  <mark>Parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish", "Parish"], "snippet": "Davis her Uusbaud, Emily <mark>Parish</mark> a n d -----  <mark>Parish</mark>"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1093.9, 1788.26, 1257.32, 2039.41], "bbox_id": "836abeb4d4", "file": "AppomattoxNewspapers_1898-1902a_0060.pdf", "page": 1, "text": "I N THU CLERKS OFFICE OF THE CIB- CU1T Court of the County of Buckingham on the 19th day of September 1M88. Annie E. Perkins and J. F. Perkins her hue- oand .............................................. ..Plaintiffs against Bettie Davis and F. S. Wilkinsons adminis trator and others........................Defendants. I The object of this suit is to perf ect hnd quiet the title of Annie E. Perkins one of the plaintiffs to the tract of land in Buckingham county, Virginia, bounded by the Cartersville Hoad on the south, on the east by land of Samuel C. Wilkinson, decease, on the north by Pardee and Terrell land, on the west by Pardee and Lee land and others, containing 464h acres more or less, which was formerly owned by F. L. Wilkinson, deceased. And an affidavit having been made and died that the defendants Bettie Davis and --------- Davis her husband, Emily Parish and --------- Parish her busbmxi, Christopher Meyers, Robert Meyers, Addle Meyers, Mary Meyers, Davy Meyers, Brauford Meyers. Samuel C. Wilkin-on, Fannj A. Wilkinson, Nettie L. Wilkinson, William Wilkinson, Bessie Wil kinson and Henry Wilkinson are not residents of the State of Virginia, it is ordered that they do appear here within fifteen days after due publication hereof, and d . what may be necessary to protect their interest In this suit. And it is further ordered that a copy hereof be published once a week for foursne. cessive weeks in the Appomattox and Buck ingham T m 0 anu that a copy be poste.1 at the front door of the courthouse of this county on the first day of the next term of the coJbty court. A copyTeste P. A. FOBBES, Clerk. B. W. H CHARD, p. q. ft-22-tw."}, "highlight": {"text": {"matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> and --------- <mark>Parish</mark> her busbmxi,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> and --------- <mark>Parish</mark> her busbmxi,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [989.76, 1290.98, 1151.73, 1724.03], "bbox_id": "fe68394250", "file": "AppomattoxNewspapers_1902-1905a_0083.pdf", "page": 1, "text": "i horse, sym- black mane and tail is live years old and stands sixteen hands high. He was bred by Anthony J. DrejceJ, the millionaire banker of Philadel phia, passing from him into the banus of A. J. Twaddell, cf the same city, from whom the present owners purchased him several months ago.  Danesfort, the sire of HEIDREK, stands at the bead of Oak Hill Stud. Aldie, Virginia, the property of Hon. Henry Fairfax, where one of his progeny. Fiery Dane, a half broth er to HEIDREK, and a recent winner of first and second prizes in the three year old clause at both Philadelphia and New York, was bred and schooled. Fiery Dan6, immediately after the Horse Show in New York last S ovember. was sold by Senator Fairfax to John Hobart Moore, of Chicago, for the piincely sum of ten thousand dollars. Heroine, the dam of HEIDREK, was im ported into this country by Dr. W, Seward Webb, ason-ki-law of the late William H. Vanderbilt, aud placed among a string of superbly bred Hacking mares a t Shelburne Farms, Vermont where she produced several prize winners, promiuent among whom is Mountain Maid, a frequent winner at New York for her owner, Lewis Wormser. esq. Heroine is herself a prize winner, having carried off several ribbong a t Madison Squarr Harden during the Horse Shows of 1891 and 1892. She is now a brood marc in theccriebrat d Plymouth Hackney Stud of Eden D. Jor ien. esq, of Dos ton. Mass. Dan- gelt, the sire of Danesfort. and grand ire of H El f REK. sold for tw enty-live tbous ind dollars when thirteen years old. He wa the sire ol Matchless, of Londesboro, loyai Danegelt, Kosadorend Gatmymede. u l oi wh im were chapions in their doj cv Dnmark, the sire of- Danegelt. and Lord Derby 2d., the grandsire o f Daneslort. are t. the Hackney pedigrees  hat I.ev in g tn and Leamington are to the American race horses no good ones w ithout a showing of theii blood. Monarch, the sire of Heroine, and grand sire of HEIDHBK, on his dams side wa- probably the greatest Norfolk lluckne.v stall- ton of a hall eeqtury. I t is said of him that ids foals paid tbp jvrit of his parish for a de cade. He siren beside a host, o f show horsep .Wil2LFMaifnn Reality HKlDliKK, 1perfectly docile,u oUuraoo .vistie of tlio Hackney breed, lias fine ape. for a .voumrat. as welt as great powers of en uranee, and lus get from e.t her bigb class or comniou work mares should make horse admirably adabtei to tho farm or road The owners of H IDBEK.do not propose to charge an extortionate Tee for his service simply bicaue ho ie a fine horse, and bred fn the purple, but they are exceedingly an- , xionsto improve the stock of horses in their I vicinity, and to th at end, will make the lollow ingfee, which cosidering the brcedinr of KElDHF.fi. they think is very reasonable! j season ...... . ........ Insqi e,.,"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "the property of Hon. <mark>Henry</mark> Fairfax, where one of"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "the property of Hon. <mark>Henry</mark> Fairfax, where one of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.96, 648.94, 2448.89, 1229.99], "bbox_id": "806518be2b", "file": "AppomattoxNewspapers_1892-1898a_0145.pdf", "page": 1, "text": "E T ! from Charlottesville to It is probably the best thorougbfto ... in Albemarle conntv. - carelessness on the part, of the oar- rier and sometimes it does not  It Lynohburg News, Tuesday The,., is, however, not necessary that there tynob House was closed Up last should be complaints for frequently Bight RtgBobert the cards are put in the boxes of the he been conducting the hotel most efficient men. Of course tbey son rime, Bays his lease does not are happy when hey discover them, piro tiil June !, but be -prefert  But where a box is missed in whioh nP how rather than take out there is a green card, then the oar oeuse for another year whiofe rier is bound to get into trouble, and would have to. do if e Very serious trouble at that. This hotel after May 1 card has beett in use by the Postofflce At the end of the current by Department for a good mimy years in year the Bev. Dr. Moeea D. Ho all parts of the county. will have been pastor of the W. W. L ong . Presbyterian Ohnridti A Landslide In Quebec.  yeWS. - - About 830 oolpok Friday bight Lest Friday night some bad the inhabitants of the village of St. into a moving tnrfnbn tb Albans, situated fl?ty miles frdln doab Vally branch of the Norfolk J i  3  here in Port Nenf, heard a terrific Western railroad, and oame noise, resembling the rpU of thunder striking Henry Flynn, a ten-year-old in the distance. The oil oommenc- boy living at Lnray. ing to vibrate, apanio ensued. The buried itself farmers ton- out of their dwellings to woodwork o f, the car One avoid being buried under the ruins, special agents of the road bait ships as they believed the ground was going afreated Perry Nichols, a whito to give way beneath them.. At the charging him with the crime, and npper end of the village, gome three has confessed. His oase as sent miles from the parish _ church, is a the grand jury .by a magistrate and curve formed by a river, St. Anne, he is now in jail at Luray. and close to the curve is a water-fall The negro, Fprguson, charged 150-feet high.. The ground forming with attempted aasanlt on t little the right-hand side of the fall gave white girl in Matthews county, was way,burying a pulp-wood mill,which a the Norfolk jail Tneaday, was situated right underneath, and braking the course of the satream.The stream, -which was very rapid on account of the melting of snow, r , . -y_ l . 1 - spread over the adjoining farms and , .. F  , 6 . , , and freight agent of the Bichmoad caused the undermmed embankment _ ...  . ... . . to.M etoK , .p . Several houses along the .river  bank . ..   were carried into the river. One of It is announoed that ex-Mayor J. them were oooupied by a family Taylor EUyson, of Biohmond will named Gauthier,number four persons be a candidate for the Detnocratfei all of who perished. Smoke was seen nomination for Virginia in 188 T. -"}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "E <mark>T</mark> ! from Charlottesville to It"}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "E <mark>T</mark> ! from Charlottesville to It"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [145.7, 1050.64, 314.09, 1741.99], "bbox_id": "633e61ae4e", "file": "AppomattoxNewspapers_1912-1915a_0017.pdf", "page": 1, "text": "been restored and the purchaser of Hie Bible let the church buy it hack. Norfolk.With nearly 500 delegates in attendance, the Virginia Reunion association of the Order of Elks held its annual convention at the Elks Home in this city. The visitors were welcomed by Past Exalted Ruler W. H. Venable, of Norfolk Lodge. They were taken to Cape Henry on a special train In the afternoon, where one of the shore dinners made famous by the visits of President Taft in 1910 was served. Lynchburg.  Max Guggenheimer, Jr., known as the father of the whole sale trade and shoe business of Lynch burg, died at the Hotel Netherland, New York, where he was taken Mon day night upon landing from a trip to Germany. Born in Bavaria in 1842, he came here in 1856 to visit relatives. I p his visit he became a resident of Lynchburg. Bristol.The Fulkerson Camp of Confederate veterans has fixed Sep tember 19 as the date for the six-  teenth annual reunion of the ex-Con- federate soldiers of Southwest Vir ginia and East Tennessee. The re union will be held in Virginia Park here and a basket dinner will be a feature. Commander N. D. Bachman is arranging for speakers. .Lynchburg.Rev. J. Mack Franklin, for five years pastor of the West Lynchburg Baptist Church, preached his farewell sermon Sunday night. Next Sunday he becomes minister to a group of Baptist churches, with headquarters at Greenville, Augusta county. Under his pastorate the church grew from a struggling mis sion to a congregation with a member ship of 200. Fredericksburg.A monument to the memory of the Confederate dead  of Mathews county will be unveiled at Hthews Courthouse on September 11. A program has been arranged and there will be prominent speakers. Fredericksburg.Announcement is made that the site of Old Muddy -Church, four miles above Lambs Creek Church, will be deeded to the trustees of the parish by the present owner. Muddy Creek .Church was . probably the first church erected in the upper part of King George county. The yard is now a jungle, with only one tombstone standing, the others having gone to make grindstones and stepping stones in the neighborhood. The old site will he cleaned up by the Colonial Churches Commission. Bristol.  Following the divorce granted Washington College from Tuscnlnm College, after a four years union of these historic Presbyterian schools of Eastern Tennessee, the hoard of trustees of Washington Col lege has elected Dr. James T. Cooter,"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "were taken to Cape <mark>Henry</mark> on a special train"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "were taken to Cape <mark>Henry</mark> on a special train"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [858.25, 416.09, 1023.57, 820.18], "bbox_id": "be364632ac", "file": "AppomattoxNewspapers_1902-1905a_0040.pdf", "page": 1, "text": "_________________________ BBL. .. sym I metrically proportioned, with black mane tail is five years old and stands sixteen hands high. He was bred by Anthony J . Irexel, tne millionaire banker of Philadel phia, passing from him into the hands of A. J. Twaddell, c f the same city, from whom the present owne8 purchased h.m several months ago. Danesfort, the sire of HEIDREK, stands at 1 he head of Oak Hill Stud. Aldle. Virginia, the property of Hon. Henry Fairfax, where one of His progeny, Fiery Dane, a half broth- or to HEIDREK, and a recent winner of first and second prizes in the three year old classes nt. both Philadelphia and New York, was bred and schooled. Fiery Dane, immediately after i he Horse Show in New York last .November, Was sold by Senator Fairfax to John Hobart Moore, of Chicago, for the piincely sum of ten thousand dollars. Heroine, the dam of HEIDREK, was im ported into this, country by Dr. w . Seward Webb, h son-in-law of the late William H. Vanderbilt, and placed among a string of superbly brad Hacking mares at Shelburne Farms, Vermont, where she produced several .prize winners, prominent among whom is Mountain Maid, a frequent winner a t New York for her owner, Lewis Wormser, esq. Heroine is herself a prize winner, having carried off several ribbons at Madison 8quare Garden during the Horse Shows of 1891 and 1892. She is now a brood mare in the celebrat ed Plymouth Hackney Stud of Eden D. Jor- den. esq, of Boston, Mass.  Danegelt, the sire of Danesfort, and grand 8iraof H B1DREK. sold for twenty-five thous and dollars when thirteen years old. He was tbe sire of Matchless, of Londesboro, Royal Danegelt, Rosadorsnd Gannymede, all of whom were chapions in their day. Denmark, the sire of Danegelt, and Lord Derby 2d., the grandsire of Danesfort. are to the Hackney pedigrees what Lexingt n and Leamington are to the Ameriean.race horses no good ones without a showing of their blood. Monarch, the sire of Heroine, and grand sire of HEIDREK, on his dams side, was probably the greatest Norfolk Hackney stall ion of a half century. It is said of him that his foals paid the rent of his parish for a de cade. He sired beside a host of show horses, the champion stallions Fashion and liReality. HEIDREK, is perfectly docile, a charact eristic of tbe Hackney breed, has fine speed lor a youngster, as well as great powers of endurance, and his get from either high class or common work mares should make horses admirably- adapted to the farm or road. The owners of H  IDREK.do not propose to charge an extortionate fee for his service simply bocause he is a fine horse, and bred in the purple, but they are exceedingly an xious to improve tbe stock of horses in their vicinity, and to th at end, will make the"}, "highlight": {"text": {"matched_tokens": ["Henry"], "snippet": "the property of Hon. <mark>Henry</mark> Fairfax, where one of"}}, "highlights": [{"field": "text", "matched_tokens": ["Henry"], "snippet": "the property of Hon. <mark>Henry</mark> Fairfax, where one of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
