{"document": {"bbox": [1651.18, 965.46, 1692.95, 972.96], "bbox_id": "f0010569d6", "file": "AppomattoxNewspapers_1898-1902a_0569.pdf", "page": 1, "text": "HORSLEY"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "<mark>HORSLEY</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "<mark>HORSLEY</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1967.1, 752.44, 2397.75, 924.44], "bbox_id": "bc55934aeb", "file": "AppomattoxNewspapers_1922-1923a_0565.pdf", "page": 1, "text": "Ztte. Let the life-long prohibjtionist I ence. the Misses Horsley, of I stick to bis colors like a mann We learn that Mr. Andis For be st. Among those pres-j ought to do, but just why Judge a ill soon move to his home at old Wert. While some are moving out others are moving in and we hope our neighbo. hood will not be roarce of neighbors as we feared. We are sorry to no t Mr. S. V. Beasley lost a fine horse a few days go. We learn that Mr. Bessie has his new dwelling nearly com plete, so that he is moving iq it. Thanksgiving passed off vet Never even heard a"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "I ence. the Misses <mark>Horsley</mark>, of I stick to"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "I ence. the Misses <mark>Horsley</mark>, of I stick to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [848.38, 221.28, 990.58, 640.71], "bbox_id": "d82a084137", "file": "AppomattoxNewspapers_1971-1973a_0141.pdf", "page": 1, "text": "Ye belong to Christ, Mark 941 Mr. and Mrs. Richard Krantz, Connie and Kimberley and Mrs. Elsie Krantz arrived homefrom Orlando, Fla. Tuesday. All had a grand time. They saw Disney- Land which was really wonder ful. Mr. and Mrs. Howard Elder and Mrs. Mary Gilliam, Mr. and Mrs. Melvin Stratton were din ner guests of Mr. and Mrs. Bert Stratton last Wednesday. Mrs. Annie D. Horsley under went surgery on Tuesday. Our prayers are with her. Mrs. Elsie Krantz visited her sister in Virginia Baptist Hos- sister, Mrs. Dorothy Morris, in Virginia Baptist Hospital last week. Mr. and Mrs. I. B. Wheeler went to Colonial Heights, Va., Sunday and spent the night with her sister, Mr. and Mrs. Sep Spencer. Mr. and Mrs. Hop Elliott vis ited her sister, Mrs. Jewel Trent, in Lynchburg last week. Mr. and Mrs. Howlett Martin visited Mr. and Mrs. I. B. Wheeler last Friday afternoon. Mr. Crawford Davidson goes everyday to visit his sister, Mrs. Horsley at Virginia Bap tist Hospital. The Tuesday morning Prayer Meeting met with Mrs. Penny Davis on Tuesday."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wednesday. Mrs. Annie D. <mark>Horsley</mark> under went surgery on"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wednesday. Mrs. Annie D. <mark>Horsley</mark> under went surgery on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1668.49, 1677.99, 1820.94, 1752.7], "bbox_id": "d293921384", "file": "AppomattoxNewspapers_1898-1902a_0162.pdf", "page": 1, "text": "Y R. HORSLEY., . I . Notary Pnbllc, v V.O. Spanish Oaks. Va. i-onntv Surveyor of Appomattox County. Land promptly  d accurately surveyed and plot made. __ _______________ _ A ll 01 EMENT . Attorner-at Law and Notary Pobllc. . Attorney wst Appomattox, Va. Practice In the Court of Appomattox, Buckingham, Campbell and Amherst. __"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "Y R. <mark>HORSLEY</mark>., . I . Notary Pnbllc, v"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "Y R. <mark>HORSLEY</mark>., . I . Notary Pnbllc, v"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1288.12, 1571.88, 1405.81, 1590.84], "bbox_id": "5aa520bdc1", "file": "AppomattoxNewspapers_1905-1912a_0547.pdf", "page": 1, "text": "y mover post oí Peace a . j. Horsley, postofflee"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "y mover post oí Peace a . j. <mark>Horsley</mark>, postofflee"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "y mover post oí Peace a . j. <mark>Horsley</mark>, postofflee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [532.55, 720.74, 645.5, 741.54], "bbox_id": "d3a87be5fb", "file": "AppomattoxNewspapers_1898-1902a_0165.pdf", "page": 1, "text": "Y M respectfully, K R. HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "Y M respectfully, K R. <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "Y M respectfully, K R. <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.32, 1455.7, 1556.71, 1688.21], "bbox_id": "b5f3efa0d3", "file": "AppomattoxNewspapers_1954-1955a_0199.pdf", "page": 1, "text": "Y are indebted to Carrie V. Route 1, Pampiin, for mail-  us an old copy of this news- dated April 26, 1911. The is- Dnsisted of eight pages, four printed and four of patent- We found it most interest- read through this issue. One that caught our eye was an- ement that our town is now on city-like appearance JE?V automobiles now here and H I on the way. Dr. D. N. Twy- M fas Hated as the owner of the nd car in town, and I believe earlier record showed that Anderson had the first. And cUraer of the third may have We late J. R, Horsley. I Resume that this issue had S"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "We late J. R, <mark>Horsley</mark>. I Resume that this"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "We late J. R, <mark>Horsley</mark>. I Resume that this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1704.95, 879.75, 1849.99, 989.29], "bbox_id": "78eee3dc79", "file": "AppomattoxNewspapers_1898-1902a_0332.pdf", "page": 1, "text": "x. FERGUSON, 1 iAttordby-at-lraw,and Commissioner! In Chancery,  West Appomattox, V4 urtsFederal and State. _______ B . HORSLEY.  u Notary Public, _ . P. O. Spanish Oaks, v  anty Surveyor of Appomattox County. Jds promptly dd accurately survey plots mime. _______ ft h . clbm B nt . IU Attorney-at Iraw and Notary Publlo. West Appomattox, V ractico in the Courts ol Appomatto Ifyngham. Campbell and Amherst."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "urtsFederal and State. _______ B . <mark>HORSLEY</mark>.  u Notary Public, _ . P."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "urtsFederal and State. _______ B . <mark>HORSLEY</mark>.  u Notary Public, _ . P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2000.42, 976.82, 2507.67, 1148.33], "bbox_id": "a34bbce6f4", "file": "TimesVirginian_1983a_0415.pdf", "page": 1, "text": "WOW meets rfctired farmer and a member of Eton ChM iK bf Vrtiich he was1A lifetintodeacon. In addition to his wife, he is survived by a son, Thomas A. Horsley, Jr., and a daughter, Mrs. G ilbert Carolyn Branch, both of Madison Heights three brothers, Ray Horsley, Madison Heights, and Benjamin Horsley and Colvin Horsley, both of Lynchburg four sisters, Mrs. Jim Geneva! Childress, Appomattox, and Mrs, Lonza Hazel EUiott, Mrs. Edgar Vadia Shelton and Mrs. T. R. Lillian .Linn, all of Lynchburg, and seven, grandchildren."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "a son, Thomas A. <mark>Horsley</mark>, Jr., and a daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "a son, Thomas A. <mark>Horsley</mark>, Jr., and a daughter,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [143.3, 781.15, 467.2, 919.05], "bbox_id": "4117647197", "file": "AppomattoxNewspapers_1905-1912a_0238.pdf", "page": 1, "text": "Wo solicit your check account! which every body should have-the only Moser wm to do bustnesa Pay with check, and your check will be a egel rec. pt. Ro mlttehow email your account let ua have It and w. guarantee eatlefaotion. naoo vour surplus money with us on Interest account. 8 per sent P  mmaialng 8 months, 1  per cent If remaining 8 months, and 4 per sent If rem Bag 18 months. Patronize your friends and build up your own County. Every famers account wanted. DIRECTORS, J. 0. Jones, Jo. Button. H. D. Flood, . A Atwood,  L. Ferguson, Jno- . Bears, J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Jno- . Bears, J. R. <mark>Horsley</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Jno- . Bears, J. R. <mark>Horsley</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [386.39, 202.76, 526.19, 730.5], "bbox_id": "eb64f0d331", "file": "AppomattoxNewspapers_1974-1975a_0146.pdf", "page": 1, "text": "Wkoto putteth kiA trust in th Lord shall be safe.  Prov 2925 Rev. and Mrs. Moore and daughters were Saturday night upper guest of Mr. and Mrs. Dallas Gillaspie. Mrs. Elsie Krantz and Mr. and Mrs. I. B. Wheeler were supper guest of Mrs. Hazel Gillaspie Saturday nigit. A delicious meal was enjoyed. She had a lovely birthday cake with candles on it for Mr. Wheelers birthday. Mrs. Annie Horsley is im proving slowly at the Lynch burg General Hospital. So glad to have Mrs. Minnie Burnett at church Sunday. Mr. and Mrs. Ben WheMfcr. Mr. and Mrs. H. B. Jones, Kathy, Richard and Irby visited Mr. and Mrs. I. B. Wheeler Sunday. Sunday night Mr. and Mrs. I. B. Wheeler visited Mr. and Mrs. Bob Worley. Mrs. Mundy Moore is in the hospital. Hope she will improve fast and be able to come home soon. Mrs. I. B. Wheeler and Mrs. Elsie Caldwell have been notified of the illness of their sister, Mrs. Sep Spencer. She is in a hospital in Richmond. She is expected to be hospitaliz ed for two more weeks. Well a lot of people will be eating venison soon as so many deer were killed in this section on Saturday. Mr. and Mrs. Wallace Bon- durant had as their dinner guest last Sunday Mrs. Ruby Oakes of Rustburg, Mr. and Mrs. Romie McNaulty and children, of Chester, Va. Mrs. Hazel Gillaspie was dinner guest Friday of Mr. and"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wheelers birthday. Mrs. Annie <mark>Horsley</mark> is im proving slowly"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wheelers birthday. Mrs. Annie <mark>Horsley</mark> is im proving slowly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.08, 915.87, 1894.38, 1740.21], "bbox_id": "e1af8c101e", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "with Miss Mary Elizabeth Paris Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messrs. John Rolfe Horsley, B. Watkins Nowlin, John Overton and lampton Steele. The little ribbon- bearers were Jerry Burxe and Jao- queline Atwood Curtis Taylor and Fraces Abbitt Kendall Huuter and Katie Woolridge, and James Stanley and Mattie Sears. Before thp bridal party entered one verse of O Promise Me was softly-sung by Miss Eula Burke ac companied by Mrs. J. R. Atwood. At the conclusion of the solo follow ed the strains of Lohengrins wedding march. The bridesmaids entered from the left wing of tbe church near the altar and passed in front of the altar and down the right aisle. The male attendants entered the left aisle at the front of the church and marched down the right aisle while the bridesmaids passed up the left, forming a semi-circle around the al tar. Following the attendants the groom on the arm of the best man en tered the right aiale, while the bride on the arm of her father, Mr. H. F, Burke, appeared in the left aisle, and proceeded to the alter. The bride was preceded by the maid of honor and followed by her colored maid, Sarah. The bride was attired in a hand some traveling dress of broad-cloth with hat and gloves to matcl. She carried in her hand a small white bible and a white rose-bud. The maid of honor wore a gown of cream crepe cloth, with trimmings of pearls and chiffon, and carried in her hand a large bunch of white chrysanthemums. Tfie bridesmaids wore dresses of white silk mull wearing aigrettes in their hair, and each carrying a white rose iu her hand. After lunching at the brides home they happy pair left on the 130 oclock train for a tour through the West, followed by the best wishes of a host of friends. The groom is a son of Mr. John Steel, of Concord, and bolds the re sponsible position of Agent at Spout Springs of tbe N.  W. By., and is a young man highly esteemed and very popular wherever known. He  has for his young bride a daughter I of Mr. B. F. Burke, cashier of our bank. She is attractive popular, j and highly accomplished. She is  an expert at the telegraph key and Mr. Steele will have a help mate ca pable as be. The presents were  costly and beautiful."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "were Messrs. John Rolfe <mark>Horsley</mark>, B. Watkins Nowlin, John"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "were Messrs. John Rolfe <mark>Horsley</mark>, B. Watkins Nowlin, John"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [248.89, 488.33, 385.38, 516.93], "bbox_id": "060bc946f7", "file": "AppomattoxNewspapers_1898-1902a_0598.pdf", "page": 1, "text": "Wilson H. Cralle, J. R. Horsley, o"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wilson H. Cralle, J. R. <mark>Horsley</mark>, o"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wilson H. Cralle, J. R. <mark>Horsley</mark>, o"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [239.71, 527.42, 375.96, 556.27], "bbox_id": "836057c7d1", "file": "AppomattoxNewspapers_1898-1902a_0587.pdf", "page": 1, "text": "Wilson H. Crai le, J. R. Horsley, 0"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wilson H. Crai le, J. R. <mark>Horsley</mark>, 0"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wilson H. Crai le, J. R. <mark>Horsley</mark>, 0"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "N. Abbitt, J R <mark>Horsley</mark>, J. E. Chick, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "N. Abbitt, J R <mark>Horsley</mark>, J. E. Chick, W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [392.65, 199.01, 531.54, 695.55], "bbox_id": "9d75af9c90", "file": "AppomattoxNewspapers_1974-1975a_0147.pdf", "page": 1, "text": "Whoso putteth his tnu t m th Lord shall be safe.  Prov 2925 Rev. and Mrs. Moore and daughters were Saturday night supper guest of Mr. and Mrs. Dallas Gillaspie. M rs. Elsie Krantz and Mr. and Mrs. I. B. Wheeler were supper guest of Mrs. Hazel Gillaspie Saturday nigit. A delicious meal was enjoyed. She had a lovely birthday cake with candles on it for Mr. Wheelers birthday. Mrs. Annie Horsley is im proving slowly at the Lynch burg General Hospital. So glad to have Mrs. Minnie Burnett at church Sunday. M r. and Mrs. Ben Whetter. M r. and Mrs. H . B. Jonea, K athy, Richard and Irby visited Mr. and Mrs. I. B. Wheeler Sunday. Sunday night Mr. and Mrs. I. B. Wheeler visited Mr. and Mrs. Bob Worley. Mrs. Mundy Moore is in the hospital. Hope she will improve fast and be able to come home soon. Mrs. I. B. Wheeler and Mrs. Elsie Caldw ell have been notified of the illness of their sister, Mrs. Sep Spencer. She is in a hospital in Richmond. She is expected to be hospitaliz ed for two more weeks. Well a lot of people will be eating venison soon as so many deer were killed in this section on Saturday. Mr. and Mrs. Wallace Bon- durant had as their dinner guest last Sunday Mrs. Ruby Oakes of Rustburg, Mr. and Mrs. Romie McNaultv and"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wheelers birthday. Mrs. Annie <mark>Horsley</mark> is im proving slowly"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wheelers birthday. Mrs. Annie <mark>Horsley</mark> is im proving slowly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [567.32, 1026.26, 730.62, 1733.45], "bbox_id": "2bd11671c6", "file": "AppomattoxNewspapers_1915-1918a_0531.pdf", "page": 1, "text": "who ia the last surviving member of a family of six. Mr. Fones never married. Mrs, A. F. Brady died at her home in this county last Friday night. Mr. Brady waa, before her marriage, Miss Minna Scott of this i county. 1 never aw more active prepara tion than are being made to plant a large orop of tobacco the higb prioe which obtained the past sea son has, and ia, noting as a stimulus for extra exertion. At the same time ground is being broken for corn which has not bsen cultivated in many years.  We get 10 lbs. of sugar now for 1 and it ia wranped in paper out of loose barrel or bag. The volunteer military company organised at Dillwyn met on Fri day night. Mias Roma Garnett, one of the teachers in the graded school  Warmii iter, spent a part of last week here helping to mike ont tht odier hoys. Miss Grace Armstr us was a vis itor at Fountain Ridae last Sat urday and Sunday. The young poople had an Eastej egg hunt at the home of Mr. and Mrs. J. M. Seward on Saturday. Goods ordered from mail order houses frequently as not come, and merchants here complain that they cannot get what they order. The clocks have been turned up one hoar at the high school here 15 minutes for lunch, dose 215, thus giving pupils longer time to help with home work. Mr. Peroy Horsley, who died at her home near Wingina, is thought I to have bad hydrophobia. There I was a mad dog killed near Dentons store last week. Of the ten men who were to have gone to training camp from here last Friday, only seven went at that time. Mr. Leake Gary continue quite an well at his home in this county. The Ladies Aid Society of the Presbyterian church will meet at Mount Rush, the home of MrB. Rebecca Ellis, on next Friday. Mr. Wm P. Ellis, after spending several months in Atlanta and Bir mingham, has c me borne, looking much better than when he went away,"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "home work. Mr. Peroy <mark>Horsley</mark>, who died at her"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "home work. Mr. Peroy <mark>Horsley</mark>, who died at her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1804.28, 559.57, 1973.51, 1023.92], "bbox_id": "56d32cd84e", "file": "AppomattoxNewspapers_1943-1947a_0547.pdf", "page": 1, "text": "Which came first? and who thought of it first? are the two questions asked since time im memorial. These questions have baffled historians, challenged de tectives, caused law students to burn the midnight oil  but most of allhave intrigued the public. For the last few years theres been a big to-do about the first Christ mas card and the subject has fas cinated many greeting card col lectors, art dealers, museum cura tors and a sizable portion of the American and British public. The earliest Christmas card on record, in the light of recent find ings, appears to be that of W. M. Egley, dated 1842. Discovered in a mass of skating prints by the Brit ish museum, it is indisputedly a Christmas card and seems to have been produced for general use. It resembles the early New Years cards of German origin with its va rious scenes enclosed in a half- gothic, half-rustic trelliswork and it depicts the Christmas pantomine Harlequin and Columbine, a pup pet booth, skaters and other scenes relating to the holiday season. Its sentiment reads A Merry Christ mas and A Happy New Year to You. Until the Egley card was discov ered, the first known Christmas card was, for years, tho to have been the one designecy J. C. Horsley RA for Sir Henry Cole in London in 1846 who wanted a card to send to his friends at Christ mas. Horsleys card was litho graphed by Jobbins of Warwick court and a thousand copies struck off. These were colored by hand and featured among other scenes a merry family group holding filled wine glasses aloft."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "one designecy J. C. <mark>Horsley</mark> RA for Sir Henry"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "one designecy J. C. <mark>Horsley</mark> RA for Sir Henry"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [324.27, 1239.61, 482.38, 1425.66], "bbox_id": "7651f9d28a", "file": "AppomattoxNewspapers_1905-1912a_0530.pdf", "page": 1, "text": "Wheroaa, a t a form er m eeting of this Board, on September 8th, 19S9, certain citi zens of this county who were interested In the perm anent Improvement of certain pub UC county roads, appeared before tbe board and proposed to contribute tw o-thirds of the am ount required by law to be raised by any County or iocaUty under the m ate Aid provision of the law, If the County would appropriate the other one-third, which pro position was agreed to by this board, th e carrying out of which agreem ent Is now pending, and W hereas It has been suggested to the Board th at other public spirited citizens of the county m ight desire to extend m e work of perm anent road Im provem ent under similar agreement Therefore be It ordered th at whenever any eitlzen or aggregation of citizens desire to contribute tw o-thirds of the am ount required under said law to be raised by a oounty as a condition for receiv ing State Aid for tbe perm anent im prove ment of any road In any section of this oounty, th a t this board will appropriate the other one-third of the money requisite for such Improvement, upon any such road or roads. J. R. ATWOOD, Chairman. A CopyTeste J. R. HORSLEY, Clerk,"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "A CopyTeste J. R. <mark>HORSLEY</mark>, Clerk,"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "A CopyTeste J. R. <mark>HORSLEY</mark>, Clerk,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2009.97, 207.31, 2142.32, 269.03], "bbox_id": "e600134140", "file": "AppomattoxNewspapers_1974-1975a_0151.pdf", "page": 1, "text": "what shall a man give in exchange for kit soul? . Mark 837 . Mrs. Annie Horsley was moyed from Lynchburg Gen era Hospital last Tuesday to"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "what shall a man give in exchange for kit soul? . Mark 837 . Mrs. Annie <mark>Horsley</mark> was moyed from Lynchburg Gen era Hospital last Tuesday to"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "what shall a man give in exchange for kit soul? . Mark 837 . Mrs. Annie <mark>Horsley</mark> was moyed from Lynchburg Gen era Hospital last Tuesday to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1222.55, 757.23, 1374.93, 894.62], "bbox_id": "3671673a9c", "file": "AppomattoxNewspapers_1915-1918a_0242.pdf", "page": 1, "text": "what may be necessary to proteot his inter est in this suit. And It is farther ordered that a copy hereof be published once a week for four successive weeks in the Times-Vlr- ginlan. a newspaper published In the county of Appomattox, and th at a copy be posted a t the front door of the Court-house of this county on the 18th day of September, 1916. th at being the next succeeding Rule day after this order was entered, J A copyTeste J. B. HORSLEY, Clerk  T  by O. W. Smita, D. C. S, L. Ferguson, p. q, g g  NEW STORE -A T  Apporriatto, Ya."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "A copyTeste J. B. <mark>HORSLEY</mark>, Clerk  T  by O."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "A copyTeste J. B. <mark>HORSLEY</mark>, Clerk  T  by O."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [465.85, 1628.62, 626.88, 1764.57], "bbox_id": "63b7c535c2", "file": "AppomattoxNewspapers_1898-1902a_0147.pdf", "page": 1, "text": "West a . CoorteFederal and State. J R. HORSLEY. __ . Notary Pnbllc, P. O. Spanish Oaks, Va. nonnty Surveyor of Appomattox County. Lands promptly and accurately surveyed snd plots made. ____________________ A  _H. CLEMENT,  Attomey-at Law and Notary Public, West Appomattox, Va. Practice In the Courts of Appomattox, Buckingham, Campbell and Amherst. M oon  h abris , Attorneys-at-Law, 8UV Main Street, Lynohhnrg. Va. court of Lynchburg Cltv. Campbell county 1 .Jhi.iiiolnlnKcounties. ReferencePeople  O T  BSnkV Lynchburg, and FldeUty"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "and State. J R. <mark>HORSLEY</mark>. __ . Notary Pnbllc, P. O."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "and State. J R. <mark>HORSLEY</mark>. __ . Notary Pnbllc, P. O."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [228.7, 665.08, 387.45, 865.18], "bbox_id": "f9fee63239", "file": "AppomattoxNewspapers_1892-1898a_0227.pdf", "page": 1, "text": "Wereg et very much to learn that Judge John 1. Horsley contemplates resigning thejudgship of this circuit. Helms been Judge of the Circuit Court for nine years, and in the dis charge of the diltlcult duties ol t..e position, has, we believe, given uni versal satisfaction. Our bar and people were iitiatii- moiis for bun pmls, because bis high character and ability would have adorned th-t bench, but we hated the idea of los ing him even for this promotion. His loss will be much more keenly felt when he goes not to a higher judgeship.but back to the profession."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "that Judge John 1. <mark>Horsley</mark> contemplates resigning thejudgship of"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "that Judge John 1. <mark>Horsley</mark> contemplates resigning thejudgship of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1034.88, 229.2, 1178.64, 389.64], "bbox_id": "b688c70a94", "file": "TimesVirginian_1981a_0025.pdf", "page": 1, "text": "welter weight contender on January 31. This match will be teièviséd on the ESPN Sports Channel. .  Kenny is currently training in Lynchburg with top middle weight, Jimmy Horsley. Stutts  , elected president"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "top middle weight, Jimmy <mark>Horsley</mark>. Stutts  , elected president"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "top middle weight, Jimmy <mark>Horsley</mark>. Stutts  , elected president"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.83, 1202.61, 2288.57, 1500.64], "bbox_id": "6b6d6d06a1", "file": "AppomattoxNewspapers_1908-1909a_0557.pdf", "page": 1, "text": "well Discussioon Leader J. G. Bruce.  . _ Round Table Discussion on County Problems and Work for the Coming Year. The members oi the county advisory board ares L C. Abbitt, S. E. Anderson, B. G. Anderson, R. L. Burke, John E. Burnett, Owen Oarion, Cary Carey Jr., W. T. Chil dress, J. O. Davidson, D. W Dinkins, B. C. Drinkard, M. I Garrett, R. B. Hudgins, A, R. Harwood, Tom Harvey W. C, Harvey, Layton Hatcher, J. R. Horsley, Wilson Hix, L. N. Lig .n, W, A.- Moon, Emmett- Mar tin, Clarence Moore, R. W. Morris, Herman Moore. A. D. Marshall, W. T. Nash, R. E. OBrien, Welter OBrien, j. P. Paulett, Frank Raneon, d P ley Ranson, Jim R   P P n, Calvin R o b in  aig iiil, eZ nolds, B l a  p P   , E. P. S e a ra  afH  C o tt, .John Tay W  f iP f h Wright, R. W. WH-"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Layton Hatcher, J. R. <mark>Horsley</mark>, Wilson Hix, L. N."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Layton Hatcher, J. R. <mark>Horsley</mark>, Wilson Hix, L. N."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.29, 994.75, 1215.12, 1225.9], "bbox_id": "d6a18b8714", "file": "AppomattoxNewspapers_1926-1933a_0219.pdf", "page": 1, "text": "week ago last Thursday at his home in Charlotte County. His death was attributed to a di seased heart. Funeral services conducted by the Rev. Mr- White, of Selections which will be! yjn Stratton, colored one fo r Played during the evening are, shooting his wife and the sec. .. - . .. God Bless You, Randolph- ond for carrying concealed f7?P m were _ held at th Jfiac.on  fg, from weapons. An indictments was   d e Chapel Methodist n ercolate into the nockets of Hood, Tell Not of at brought against Nora McCor- P1?1?1 of which Mr. St. John F h T d M M h ? m i c k for shooting her husband.   member for MtJ the drought stricken farmers -1 Now Let Every Tongue Adore! nd one for illal nossession one years. n Ty Tinion Thee, Still, With Thee, A- 0f ardent spirits and an indict- Surviving him are his wife, e doubtful as a means of re- dormaua pp  t Mirror 01 aaent Pirs ana an inaict Mrs-MarvL- St John and four avincr nnpinnlovmpnt for few oornmus i e Lttes Mirror, ment was brought against Jvr., j iVAay, e unemployment tor lew Moonlight On The Lake,, Leonard McCormick on the children besides Mrs. Mann, worth-while farmers can ever An Thru The Night, Lassie j fftter chafse alTo The last Cullen St. John, Mrs- E. W. Cov afford to Quit their farms for Q, Mine, Mosquitoes, Integer L w0 indictments were held ington, Crafton J. St. John and any length of time to engage Vitae and the Bell of St.  er  r theText term of court ------ I in highway construction. Marris  Alonsm Hava and W. V j tne j16, term OI QU  Mr. Horsley urgea tnat raxn T u arry both of Prospect, were er the solution to the problem wjjj sjng jn chorus, lies with the farmers themsel- fbe orchestra, known ves. He added that numerous Reed Battins Jacketeers"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "term OI QU  Mr. <mark>Horsley</mark> urgea tnat raxn T"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "term OI QU  Mr. <mark>Horsley</mark> urgea tnat raxn T"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1634.62, 212.73, 1779.7, 522.97], "bbox_id": "2bb52d8d24", "file": "AppomattoxNewspapers_1962-1965a_0425.pdf", "page": 1, "text": "Wednesday. They will spend the night with the parents, of Mr. Jennings on their way home. Mr. and Mrs. I. B. Wheeler j visited Mrs. Van Webb and Mr. j and Mrs. Ben Wheeler Saturday night. Miss . Kate Davidson, Mrs.  Annie Horsley, Mr. Osbarne and i Crawford Davidson spent Sun -1 day afternoon in the home of Mr. and Mrs. C. T. Roach, of Farmville. Mrs. Minnie Burnett was able to attend church Sunday. So glad  to repo t Mrs. Agnes Carson j visited her one day last week. Mr. and Mrs. I. B. Wheeler and Mr. and Mrs. Hop Elliott visited their kinfolks in Roanoke I Sunday afternoon. Miss Kathy Caldwell attended a picnic at Holliday Lake Satur day. Miss Betty Jane Alvis had her room mate and Mr. Jerry Con way for week end visitors. Mrs. Betty Wheeler and M. Dave Kidd, of Lynchburg, were married on May 30. Best wishes for a long and happy life togeth er."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Kate Davidson, Mrs.  Annie <mark>Horsley</mark>, Mr. Osbarne and i"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Kate Davidson, Mrs.  Annie <mark>Horsley</mark>, Mr. Osbarne and i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.05, 718.53, 2265.29, 865.13], "bbox_id": "11f18a6b58", "file": "AppomattoxNewspapers_1908-1909a_0251.pdf", "page": 1, "text": "Wednesday, Sept. 8, at Stonewall, 10 A. M. Thursday, Sept. 4th, at Ap pomattox C. H., 10 A. M. AJ1 land owners of Appo mattox County wishing to be heard in regard to Equalizing their assessments are request ed to appear before the Board at any of these meetings. Horsley, Chm. Lo cal Board, of Equalization of Assessments, L N. Ligon, Secy. 2t"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "any of these meetings. <mark>Horsley</mark>, Chm. Lo cal Board,"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "any of these meetings. <mark>Horsley</mark>, Chm. Lo cal Board,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.49, 1600.01, 1710.75, 1786.17], "bbox_id": "e02b4fc8bd", "file": "AppomattoxNewspapers_1952-1954a_0137.pdf", "page": 1, "text": "Wednesday, Dec. 17.- The Wrecl Island Home Demonstration Club will meet at 200 P. M- with Mrs. J R. Horsley and Miss Kate Davidson co-hostesses. Thursday, Dec. 18.- Spout Spring Home Demonstration Club will meet P vuvugni oi at 200 P. M. with Mrs. Harry Rey son had1 R00c nolds. Note change in date. i  5 London Dec 19  28  Hme Aent   iIH tUne and the on leave- ay. 6ard the BeNs on Monday, Dec. 29.- The Lee Home Ml rector Demonstration Club will hold their a wondorf,, annual Christmas party at 7 30 P. !1 We thought, jj. at the home of Mr. and Mrs. H.  h i   Kntrs f A. Torrence. All members and their ars d I families are expected to attend."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "with Mrs. J R. <mark>Horsley</mark> and Miss Kate Davidson"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "with Mrs. J R. <mark>Horsley</mark> and Miss Kate Davidson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.78, 739.93, 1632.78, 789.03], "bbox_id": "91bc5fe9a4", "file": "AppomattoxNewspapers_1949-1952a_0035.pdf", "page": 1, "text": "Wed., Jan. 18.- The Wreck Island Home Demonstration Club Will iieet at 2 0U P. M. with Mrs. George Jennings. The demonstration will be ven by Mrs. J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Wed., Jan. 18.- The Wreck Island Home Demonstration Club Will iieet at 2 0U P. M. with Mrs. George Jennings. The demonstration will be ven by Mrs. J. R. <mark>Horsley</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Wed., Jan. 18.- The Wreck Island Home Demonstration Club Will iieet at 2 0U P. M. with Mrs. George Jennings. The demonstration will be ven by Mrs. J. R. <mark>Horsley</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [127.46, 311.71, 449.03, 447.45], "bbox_id": "a926f89366", "file": "AppomattoxNewspapers_1905-1912a_0204.pdf", "page": 1, "text": "We solicit your check accounts which every body should havethe only roper way to do business Pay with checks and your check will be a legal receipt Ko matter hew small your account let us have It and we guarantee satisfaction. Place vour surplus money with us on Interest account. 8 per cent per annum II remaining 3 mootUs, 3 per cent if remaining 8 months, and 4 per cent if remain ing 12 months. Patronize your friends and build up your own County. Every farmers account wanted. DIRECTORSi t. R Atwood, J. 0. Jones, Jos. Button, H. D. Flood, S. L. Ferguson. Juo A. Sears. J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "A. Sears. J. R. <mark>Horsley</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "A. Sears. J. R. <mark>Horsley</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2118.51, 1614.52, 2460.23, 1752.92], "bbox_id": "37b167951e", "file": "AppomattoxNewspapers_1905-1912a_0097.pdf", "page": 1, "text": "We solicit your check accounts which every body should havethe only I proper way to do business Pay with checks and your check will be a legal receipt.  No matter how small your account let us have It and we guarantee satisfaction. Place your surplus money with us on interest account. 8 per cent per annum it remaining 2 months, pet cent if remaining 6 months, and 4 per cent if remain ing 12 months. Patronize your friends and build up your own County. Every farmers account wanted. DIRECTORS J. R. Atwood. J C. Jones, Jos. Button, H. D. Flood, 8. L. Ferguson, Jno. A. Sears, J. R. Horsley."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "A. Sears, J. R. <mark>Horsley</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "A. Sears, J. R. <mark>Horsley</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1531.4, 1557.31, 1696.63, 1812.65], "bbox_id": "1ddfb413d3", "file": "AppomattoxNewspapers_1918-1922a_0038.pdf", "page": 1, "text": "We regret to learn of the sudden death of Mrs. John Moultrie, of Waverly Hall, Ga She is a stranger to us, but her  daughter, Mrs. Frank Wool dnge, now of Grifton, N. G is well known throughout thie I county, and we extend to her our deepest sympathy in this  hour of trouble. J. R. Horsley, Clerk of Appo mattox county and ex officio Clerk of the Circut Court, hav ing offered his resignation eel such Clerk, which resignation has been accepted by the Court, O. W. Smith, as Deputy Clerk, has been appointed Clerk oil Appoaattex county, in tL place and stead of J . B. Hors ley, resigned."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "of trouble. J. R. <mark>Horsley</mark>, Clerk of Appo mattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "of trouble. J. R. <mark>Horsley</mark>, Clerk of Appo mattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.15, 1223.7, 1886.25, 1594.05], "bbox_id": "04e8a002a6", "file": "AppomattoxNewspapers_1898-1902a_0709.pdf", "page": 1, "text": "We PAY CASH SweBng salesmen. Outfit free, aqfljflg PaastUl. U. t. ed the horse show , Mr. A. B. CorneMijj spent a few days in this ihood. Miss Sally Scott gmed to I her home near Howii gfter a visit to the Misses H Miss Ida Horsley Dg this week with her aunt, 1 p . Bra dy, near Howardsville Quite a lot of whe geeded in the county last wee 0f the farmers having finishe Mr. Nick Sutton .tijfc at tended the sales of loeo .at Hardware. Mr. J. J. S. Horsley lv at tended the meeting of pu trackmen in Richmond. Mr. Sidney Taylor, of tao, this week visited his son, ,y lor, at Warminster. Miss Helen Davis Woop herst, is this winter teachiM home of Mr. George W. Pt Mrs. Otho Button and spent last week at Island V We are delighted to havt ns once more Miss Virginia Wheeling, West Virginia, Mr. Otho Sntton this"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Misses H Miss Ida <mark>Horsley</mark> Dg this week with"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Misses H Miss Ida <mark>Horsley</mark> Dg this week with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [169.7, 1439.31, 489.57, 1475.95], "bbox_id": "dfb9358748", "file": "AppomattoxNewspapers_1892-1898a_0113.pdf", "page": 1, "text": "We have recently gotten a first class Plan! i r t n _ ,    w B    v   a R  e  v i n B B i iw i l l n s Mill, and are prepared to fill orders for afi grades of DRESSED LCMBER. Those who desire to build will find It to their Judge Horsley and Judge Mann  S S ?"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "It to their Judge <mark>Horsley</mark> and Judge Mann  S"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "It to their Judge <mark>Horsley</mark> and Judge Mann  S"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [657.33, 1097.94, 2533.68, 1314.43], "bbox_id": "be40caab0e", "file": "AppomattoxNewspapers_1908-1909a_0540.pdf", "page": 1, "text": "WE CLOTHE THE FEET COMPLETE Parker  Horsley of Bent Creek, died July 21. Burial services were conducted by V. S. Reed of the Y. M- C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves. His son, Rev. William Abbitt, of Kentucky, is visiting him Master Braxton Hancock enr tertained a number of his lit- friends in the celebration of his birthday last Tuesday. Mrs- Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon. The deceased was formerly Miss Godsey, of Appomattox County.  Graham"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "THE FEET COMPLETE Parker  <mark>Horsley</mark> of Bent Creek, died"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "THE FEET COMPLETE Parker  <mark>Horsley</mark> of Bent Creek, died"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2000.91, 1568.8, 2332.49, 1629.95], "bbox_id": "048573a870", "file": "AppomattoxNewspapers_1922-1923a_0298.pdf", "page": 1, "text": "We are sorry to note the death 0f U  ch complimented  J thanked Mr. Parker Horsley of Bent Creek. l for the n,ce way m wb,ch the Con The end came on Saturday. He had been ill for some time. He leaves a mother five sisters and one brother"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "J thanked Mr. Parker <mark>Horsley</mark> of Bent Creek. l"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "J thanked Mr. Parker <mark>Horsley</mark> of Bent Creek. l"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.57, 380.77, 2061.16, 1172.7], "bbox_id": "7b35fca0a8", "file": "AppomattoxNewspapers_1922-1923a_0500.pdf", "page": 1, "text": "We are glad to note an improve ment in Mrs. Sue C. Gipson after spending about 6 months in the hospital in Lynchburg. Mr. Charles Cunningham, of Clifton Forge, is v.siting his broth er, G. W. Cunmugham. Our popular and efficient R. F. D. carrier, R. II. Patteson, was on the sick list last week. Dr. T. H. Lacy filled his appoint ment at Grace and Memorial on Sunday. We are glad to have him back, as he has been attending the Sunday School convention in Rome, md traveling in  The Mother Country. The members of the church at Grace have made many improvements on the inside as a sur prise to the Doctor ou his return home. A very delightful dinner party was givin by Mr. and Mrs. John Lewis at Sunnyside, in honor of Mr. and Mrs. Wingfield Brown, of Montana, on Friday last. Among those present were, Mr. and Mrs. H. G. Goins, Mr. and Mrs, A. G. Horsley, Mr. and Mrs. G. W. Pat teson, Mr. Howell Lewis, Mr. and Mrs. Wm. Lewis and Misses Bellel visiting relati Irviue and Kate Jones, of Rich mond. Mr. Walker Steger is in Rich mond under medical treatment. Dr.Clover se ms kept quite busy as there is a lot of sickness aroutu . Mr. E. K. Langhorn ays he can give us Buckingham farmers some pointers ou wneat raising, as he has the bes yet t.hreshed-365 bushels, And from the looks1 of his corn fields there will he some shucks to fling. It is good to hear the ring of horses hrofs on our new bridge across Sycamo.e Creek. It is a dandy. Rev W. P. Province- will con duct revival services at Woodland Church commencing Sunday next. We agree with our Buckingham correap ndent and so-do our ladies. The tobacco crop- seems very poor, b t corn is doing nicely, on the river. Mr. J. C. Woodson, of Lynch turg, spent seveial days at the home of Mrs 8. C. Gibson this week. Mr. J. R. Cunningham tells us his corn and tobacco were, very much cutup by hail on Friday last. Mr. B. G. Boatwright visited the Jill City this week,"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "and Mrs, A. G. <mark>Horsley</mark>, Mr. and Mrs. G."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "and Mrs, A. G. <mark>Horsley</mark>, Mr. and Mrs. G."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1425.35, 636.67, 1573.81, 804.41], "bbox_id": "349df07fe3", "file": "TimesVirginian_1981a_0330.pdf", "page": 1, "text": "WARREN, Midi.  Percy Christian Chris Crimnan, died to S a.m. Friday, Ort. 2, here. He wee born in AppaniattoiK May 11,1911, n sen of Edward 1 Afexradar Coleman and Crilie Horsley Coleman. ?i,  He is survived by his wife, W g ia ttM to ri Cirieman, one son, Ronald Christian Crieman, ope daughter. Jene Shanks, tod tore granddaughters, Ke ren Shanks and Deborah Coleman, aN of Detroit, M itt. four sisters, Lucflfe Graham, M arguerite Blackburn and"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Afexradar Coleman and Crilie <mark>Horsley</mark> Coleman. ?i,  He is"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Afexradar Coleman and Crilie <mark>Horsley</mark> Coleman. ?i,  He is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1568.64, 1146.09, 1738.89, 1664.6], "bbox_id": "92ada0ee7f", "file": "AppomattoxNewspapers_1912-1915a_0096.pdf", "page": 1, "text": "Warminster. Snobs wintergrand, pleasant land deiightfnland has it - been fully appreciated? I fear not. Tobaooo seems to be selling very well in Richmond. Tonr humble servant received 8f for lags. Him Lonim Brady Horsley is pending some time a Ridgway nar .Oharlottevilie the home of Mr. tod Mrs. Chat. E. Bine. Here gives a list of those who et- tended the farmers meeting in tbo HiU City t o t week Mr. and Mrs.  A 0. Horsley, Miss L B Horsley,  Mr. F. R. Moon, Mr. and Mte. J. G. Glover, Mr. J. W. Ooombers, Mr. H. D. Omohnndro, Mr. O M. Sntion, toLAlleiWood. . Miieer Mildred and Fannie Hor skj and Gay Gilliam qpent the week-end atlbs hospitable home .of M.aad Mys. G. A Brady near HowardsviUe.  J  Dr. Peroy Barrie, of NtFWOod has located in Soottsvijle mid Dr. Potmen bn moved to Norwood. We wish them both much snooess in their new-fields. Many are the fields that are turn ed apTSid down. Winter plowing is the thing and onr farmers realise it Com. G. W. Kniner has arranged to. have the Farmers Institute train top ft Warminster. We hope to! have  large atteodanoe, also to have the six schools to turn, out in a body with the six fine young Iodise in the lead. Mrs. Richard M. Bolling way cal led to Lynchburg to the bedside of her consin, Mrs. BUiott"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "lags. Him Lonim Brady <mark>Horsley</mark> is pending some time"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "lags. Him Lonim Brady <mark>Horsley</mark> is pending some time"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [408.93, 873.06, 1889.78, 995.63], "bbox_id": "cbb9e579c0", "file": "AppomattoxNewspapers_1954-1955a_0244.pdf", "page": 1, "text": "Wanted To Buy m   A  i g   EXECUTORS NOTICE We have qualified as Executors of the estate of the late J. Horsley Har ris, Gladstone, Va. All those indebted to this estate or having claims against same, please come forward for settlement. George Abbitt, and PeW itt Evans, Executors. Apppmgttpx, Va. 3-24-2tc"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "of the late J. <mark>Horsley</mark> Har ris, Gladstone, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "of the late J. <mark>Horsley</mark> Har ris, Gladstone, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.56, 1594.87, 1673.61, 1746.4], "bbox_id": "5c78be1c77", "file": "AppomattoxNewspapers_1905-1912a_0293.pdf", "page": 1, "text": "Walk a mile before breakfast    I and scare np an appetite, addresses getlenan of fine J . man has to walk education and daring hu ressence IT eancaao - - -- 1 farther than that here of a tow years had made m y e friends. Hi remains were prepared I F F ___ for shipment by G. A. Diugnid audl hipped to llartraaburg, accom- Mined by Messrs R. P. Qnrke, A L. Pugoson and J-  Horsley. The deoaued was a fit cousin of Hon. H j flood and  nephew of Mrs. Thofc 8, Booock."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "L. Pugoson and J-  <mark>Horsley</mark>. The deoaued was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "L. Pugoson and J-  <mark>Horsley</mark>. The deoaued was a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1655.3, 1003.58, 1942.91, 1014.76], "bbox_id": "bd333d0657", "file": "AppomattoxNewspapers_1954-1955a_0274.pdf", "page": 1, "text": "W reck Island .............................. Mrs. J. R. Horsley"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "W reck Island .............................. Mrs. J. R. <mark>Horsley</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "W reck Island .............................. Mrs. J. R. <mark>Horsley</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1270.53, 1750.79, 1387.78, 1764.95], "bbox_id": "abd5437959", "file": "AppomattoxNewspapers_1905-1912a_0589.pdf", "page": 1, "text": "w r e L     F F 01over Pt- A.C. Horsley, poomoe"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "w r e L     F F 01over Pt- A.C. <mark>Horsley</mark>, poomoe"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "w r e L     F F 01over Pt- A.C. <mark>Horsley</mark>, poomoe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2155.42, 389.77, 2319.78, 615.4], "bbox_id": "4275d7a7b2", "file": "AppomattoxNewspapers_1949-1952a_0492.pdf", "page": 1, "text": "W ow a li Jern C ustom Look at the paintings on the Christmas cards you send and receive  youll find famous names and some of the best contemporary art. Here is how it all began. On a December day in 1843, a middleclass Englishman, H e n r y Cole, sat at the library desk of his London home addressing to his friends what were probably the first Christmas cards ever printed. The cards depicted a Victorian family as sembled at the festive board and the traditional Christmas customs of giving to the poor. They also bore the now-classic greeting A Merry Christmas and a Happy New Year to you. Cole, in a historic move, two months before had commissioned John Calcott Horsley, a Royal"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "had commissioned John Calcott <mark>Horsley</mark>, a Royal"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "had commissioned John Calcott <mark>Horsley</mark>, a Royal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.29, 393.71, 1910.11, 589.26], "bbox_id": "24b0c23077", "file": "AppomattoxNewspapers_1912-1915a_0211.pdf", "page": 1, "text": "W lngina. Rev. G. W . Presley held a fine m eeting a t W oodland Church last week. Mrs. A. S. H arris, of Lyneh- burg, and Miss N ettie H ackett, of this place, were the guests of Mrs. J. B. Horsley last week. Mrs. W. W . H ackett will leave on the 6th of this m onth for a w eeks visit in Lynch burg. Mr. O. A. W ood, of Lynch burg, w as the guest of Miss i Nettie H ackett Saturday and Sunday."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "of Mrs. J. B. <mark>Horsley</mark> last week. Mrs. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "of Mrs. J. B. <mark>Horsley</mark> last week. Mrs. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1884.68, 410.07, 2055.67, 959.43], "bbox_id": "56df5da62c", "file": "AppomattoxNewspapers_1922-1923a_0596.pdf", "page": 1, "text": "W ingina. The inf nt child of Mr. and Mrs. John McFadden died Saturday evening and was buried Monday at the home of Mrs. Chas Horsley, at Yellow Gravel. . Mr. Leslie Scruggs, operator at James, on the Norfolk and Western Railway, will shortly move back to old Buckingham to reside with hiB father-in law on Mortevideo farm. Misses Loulie and Fannie HorB- ley, of Travellers Rest, left for Richmond to join their cousin, Mr. Benson Caldwell, who will take them to Charlotte, N. C., on a visit of three weeks. Mr. E. H. Swinley who left nine years ago for the Phillipine Islands has retarned to Travellers Rest,I and will make that his home fori the present. Mr. S. A. Harris, of Lynchburg,! is vititing Mr. and Mrs. Johul Horsley, at Yellow Gravel. He was verv successful in bis hunt, carry ing back twenty birds and six rab bits. Shooting off chickens, pigs, and 1 turkeys seem to be all the go now iu Buckingham. Mr. Province, the Methodist minister has succeeded in building a pretty church near Woodland. We will have services the 4th Sun-j day in February. Mrs. Gibson will soon return to her home near Manteo, greatly ben- efitted by her trip. Her grand daughter who has been living in Kentucky since her marriage will also live there. We are glad to welcome her back. Mrs. A. C. Horsey, of Warmis- I ter, is quite sick with grippe."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "home of Mrs. Chas <mark>Horsley</mark>, at Yellow Gravel. . Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "home of Mrs. Chas <mark>Horsley</mark>, at Yellow Gravel. . Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1797.11, 1292.79, 1963.41, 1689.14], "bbox_id": "ffe720da61", "file": "AppomattoxNewspapers_1905-1912a_0065.pdf", "page": 1, "text": "W ingina, Mr. John Dameron died at his hrne near this place on Jan. 27tb. He had a stroke of paralysis fonr years ago, and he lingered until last Thursday, when he passed away, age 60 years. Fonr sisters and one brother mourn their loss. We ex tend onr sympathy to the bereaved ones, and may they not sorrow as those without hope. We are glad to say the Woodland Sunday School is still flourishing with G. O. Ripley as Superintendent and Mr. J. B. Horsley Assistant. Brothers Hossley and Ripley are having good success with their cot tage prayer meeting aronnd in this commnnity. The Woodland people are no. to be left ont, bnt we are sorry to report Mr. J. B. Horsley is somewhat complaining now. Mr. John D. Ripley, onr promi- net C. Si O. operator has a position at Warminister, having fully re covered from a very severe attack of tonsilitis. Mrs. T. H. Scruggs has had a very sick child, threatened with pneumonia. Miss Annie M. Ripley is some what indisposed at this writing."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "and Mr. J. B. <mark>Horsley</mark> Assistant. Brothers Hossley and"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "and Mr. J. B. <mark>Horsley</mark> Assistant. Brothers Hossley and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.31, 665.2, 2092.11, 987.19], "bbox_id": "58309b50f9", "file": "AppomattoxNewspapers_1922-1923a_0620.pdf", "page": 1, "text": "W in gin a. Mrs. S. C. Gibson died in Rich mond Thursday evening after 1 long illness. She was a beautif chiistian and bore her sickness wi h great fortitude and resignation. She was loved by all who knew he , and will be greatly miesed in the neighborhood. Her remains weiv taken to Lynchburg for burial. Mr. George Cunningham is quiie sick at bis home. Mrs Ohas Horsley is much bet- j ter after a severe spell of grippe. The little daughter of Mr. an  Mrs. John Horsley has been ver. sick, but is much better. Mr. Henry Taylor, of Travelers Rest, has regained his health con siderably and is well enough to go to farming this spring. Wheat crops are backward, but the last few bright days have  brought it out considerably. The farmers are very much behind in their work, veiy little plowing be ing done, and few oats sowed."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "bis home. Mrs Ohas <mark>Horsley</mark> is much bet- j"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "bis home. Mrs Ohas <mark>Horsley</mark> is much bet- j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [236.14, 526.76, 371.88, 554.84], "bbox_id": "16c2205691", "file": "AppomattoxNewspapers_1898-1902a_0606.pdf", "page": 1, "text": "W ilson H. Cralle, J. R. Horslèy, e"}, "highlight": {"text": {"matched_tokens": ["Horslèy"], "snippet": "W ilson H. Cralle, J. R. <mark>Horslèy</mark>, e"}}, "highlights": [{"field": "text", "matched_tokens": ["Horslèy"], "snippet": "W ilson H. Cralle, J. R. <mark>Horslèy</mark>, e"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [241.21, 475.89, 347.65, 502.34], "bbox_id": "27df21506f", "file": "AppomattoxNewspapers_1898-1902a_0610.pdf", "page": 1, "text": "W ilson H. Crai le, J. R. Horsley,"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "W ilson H. Crai le, J. R. <mark>Horsley</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "W ilson H. Crai le, J. R. <mark>Horsley</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [254.15, 475.74, 390.83, 502.87], "bbox_id": "a08e4b7fb1", "file": "AppomattoxNewspapers_1898-1902a_0602.pdf", "page": 1, "text": "W ilson H. Crai le, J . R. Horsley, 0"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "W ilson H. Crai le, J . R. <mark>Horsley</mark>, 0"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "W ilson H. Crai le, J . R. <mark>Horsley</mark>, 0"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1803.34, 1035.8, 1947.69, 1713.99], "bbox_id": "13c39d4aaa", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "W illie David OKeefe George W esley Powell Norm an Baker Elm ore Wilkereon W illiam W alker McCormack Sam uel Lee Loomis Van Buren Webb Claude W Smith L arkin Foster W illiam s Alex Robertson Jerry Allen Burke W illie H unter Bradley Whitney Baboook Corie Cabel Baldwin N athan Fleshm an Lewis Saunders McCormick W alter Allen Heflin Edw ard Tray ham Price George W esley Phelps Norm an W att Page Jam es Burton Goff Terry Colley Durham Samuel Joel H arvey Edw ard Irving Bingham H enry Alvin D rinkard W ade Hampton Ferguson H arry Leonard Cumby Joseph Edwin Dinwiddie Eddie C arter Thom as Homer Babcock H unter MarshallJMcCoy Winden Blackwell Bernard Dickerson Thom as Charles Clarence Thomas Ju lian Deleware Pugh F ran k Snyder H arry Mickle William A nthony Jones Russell Mack Charles Davis Aubrey McCoy Thom as David Grover Pugh Em m ett W arren Oakes W illiam John Johnson Joseph Preston Coleman H erbert H arris William Tunstall Morgan Charley W ashington Tanner William Fletcher G arrett H enry Harrison Williamson Edw ard W atson W illie Wesley M itchell Ciaude Davidson George Elliott Cheatham Allen Thornhill John Wiley Davis H arry Leonard Doss Jam es Clarence Horsley Ewell Ferguson Rexford Lion M artin Alfonso Godsey Hal. Thornhill Baber H ow ard Thomas Williams Thom as Talm age Phelps Jam es Tazewell Jones Samuel Boyd Johnson Colonel Oscar Patterson W ilm er I. Smith Willie Alvin T rent George H arrison White"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Doss Jam es Clarence <mark>Horsley</mark> Ewell Ferguson Rexford Lion"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Doss Jam es Clarence <mark>Horsley</mark> Ewell Ferguson Rexford Lion"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [366.25, 1496.62, 527.48, 1827.47], "bbox_id": "d24c00dc5c", "file": "AppomattoxNewspapers_1898-1902a_0208.pdf", "page": 1, "text": "W. HUBAUD, . - Attorn y-at-Law-Attorney for the Commonwoath. Buckingham U- H., va. CourtsState and Federal. T. ROGERS. . Attornoy-at-lJtw. Buckingham C. H., CourtState and Federal! _ ____  S L. FEBOUSON, o Attorney-at-Law, and Commissioner In Chancery, West Appomattox, Va. I CourtsFederal and State. B. HORSLEY. , Notary Public, P. O. Spanish OaVfj, Va. i ounty Surveyor of Appomattox County. ands promptly tod accurately smveyed nd plots made. H. CLEMENT, Attorney-at Law and Notary Public, West Appomattox, va. Practice in the Courts of Appomattox, ckinghara, Campbell and Amherst. M o o n  H a r r is , Attorneys-at-Law. SUM Main Street, Lynchburg, Va. Courts of Lynchburg City, Campbell county nd adjoining countles. Reference-Peopleg National Ban, Lynchburg, and Fidelity iBank, Scottsville. .. . . .  Business promptly attended to. J H. ROBERTSON, __ . Surveyor, Mt Vinco P. O.. Buckingham Co.. Va ewliefer to Hon. Wm- M. CabU. General TM. Logan also to the County Judge, Cierk and S h e r if f . _______________________ 8. SWANN, Land Surveyor Hi lxhurg, Va. - u r p a des having land to be surveyed In m tnm isrx Prince Edward, Charlotte, Pckt3fefiauf or Campbell counties wlB And to their interest to give me a caU. fca.ls- Dtlon guaranteed in work and prices."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "CourtsFederal and State. B. <mark>HORSLEY</mark>. , Notary Public, P. O."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "CourtsFederal and State. B. <mark>HORSLEY</mark>. , Notary Public, P. O."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [225.84, 728.47, 388.64, 1399.16], "bbox_id": "592274152f", "file": "AppomattoxNewspapers_1892-1898a_0219.pdf", "page": 1, "text": "W e heartily concur in the sugges tion contained in the letter of Mr. J. R. Horsley published in another column in reference to a good roads maes meeting here next court day. Our roads are indeed in a deplorable condition and some system must be devised to improve them. We are inclined to favor the old system. It is true the court of Appeals in the Proflit case which went up from Louisa county, held in effect, that to require a citizen to work on the road was the imposition of a poll tax on said citizen and as the constitution only authorized, a poll-tax of one and a half dollars, all laws enacting the labor system were unconstitutional. We have never seen the full text of this de oision, but we are constrained to the belief that there is something in the Louisu law, peculiar to itself to justify such a finding by our appellate court. We know that such was the opiuion of our A tty for the Commonwealth nearly a year ugo and that at that time he filed an opinion with Judge Chris tian bolding this view and advising the court to enforce the old sys tem. At any rate the effort to enforce thiB system should be tried now and if there is complaint let a case be made up and taken to the new court of Appeals. This court has just reversed the decision of the old court in the ceV ebrated Mary Miller case. This de cision was rendered by the old court iu January 1892 and since that tim has cost the people of this State more than a quarter of a million of dollars. By the Mary Miller decis ion the old court took from Justices of the Peace, almost all of their criminal jurisdiction and forced the county courts to try even the most trivial ctises. By their reversal of this decision the new Democcratic court restored to the J. Ps. their jurisdiction, which will save to the taxpayers large sums of money annu ally. We believe if the road question was taken to the new court, the Proffit case would meet with the same fate as the Mary Milier case"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "of Mr. J. R. <mark>Horsley</mark> published in another column"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "of Mr. J. R. <mark>Horsley</mark> published in another column"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [329.74, 211.71, 507.78, 1639.39], "bbox_id": "d71d014c3c", "file": "AppomattoxNewspapers_1912-1915a_0471.pdf", "page": 1, "text": "W B Harrison 8 00 1 Mrs W B H arrison 2 00 W C H arvey 5 00 Mrs J R Atwood 50 00 Mrs Annie Pretlow and S S class l 45 E E Gills 50 R L Burke 96 J T Mann 50 J W Caldwell l 00 W P Gills 5 00 T H Hancock l 00 Russell A bbitt 50 Cleveland Fore 25 Lynolee Atwoods class 75 Len Caldwell 1 00 Berkley W oolridge 1 50 Lloyd Goin 1 00 Mrs Lillie Gregory 5 00 Miss Jacqueline Atwood 1 00 Miss Louise Gills 50 Miss May W alton and class 3 46 C W Hancock 50 00 Miss Ella D rinkard 2 00 Womans M issionary So ciety of Liberty chureh 10 00 W T Davidson 2 00 Miss Odelle Woolridge 25 Mrs W S W oolridge 25 M C Caldwell 2 00 Miss jC V H ardy 1 00 W illis Inge 50 M L Erm an l 00 irs W alker Patterson 25 Mrs C A Hancock 1 00 tfiss Myrtle Inge 1 00 Hiss Maggie Flesbm an 26 R F Jam erson 1 60 tfyrtle Smith 10 Margaret Smith 10 Elizabeth Smith 10 Caroline Smith 10 R F Burke 1 00 Jam ie Gills 60 C A Hancocks class 2 40 Florence Caldwell 26 Mattie 8eiirs 25 Della Inge 10 Mr and Mrs T A W alton 7 00 Mrs M E Walton 1 00 Mrs Sallie Cheatham 2 26 Cash 56 Mrs G A Walton 50 Vay Abbitt 26 Ver nia Oden 26 Eva Woolridge 26 Earl Patterson 06 Lynolee Atwood 1 0 Bessie, Alice and Eleanor Harwood 2  Eloise Atwood 21 Carrie Giles Oi Inge  Morris 3 04 W S Taylor  Son 1 21 S D Sears l 01 W alter W oolridge l 04 M C Smith  fam ily 10 04 Mrs J B A bbitt i 04 Ilene Smith 24 J R  Chas Caldwell 5 0i Ed Dinwiddie 2 0 J W Uurrum 1 0. Miss E M Burke l  S D Cheatham 5 0 L F Ferguson 2 O J R Horsley 2 O Mrs C H Allen l o Miss Lennis Inge l 0 Mrs T H Inge l o De.la Morris 2 Bennie Morris 0 W F Burge 1 0 J T Cawtbon 5 0 E R A bbitt i o C S McDearman 5 0 Ed Harvey i 5 Miss Ida Jones 5 0 Mrs A F D rinkard 3 2 F B Jones 5 0 Mrs E M Ford 1 0 Mrs W T Steele 1 0 W C Nowlin 1 0 R W Nowlin 1 0 Mrs R W Nowlin 1 0 Jas A Webb 1 0 Phil H Gilliam 6 0 Floyd A Gilliam 2 0 H ix Bros 10 0 John H M arshall 2 5 Mrs John H M arshall 1 0 Joel W Coleman 1 0 Wm L Ford 1 u Mr and Mrs H C W heeler 1 5 Elijah F Baldwin 7 Lloyd Coleman 1 0 Mr and Mrs J W Davis 1 5 J R Fore 51 W W Vaughn  Thos H Glenn 51 Robt Biglow 51 Geo R Johnson  Roberts  Anderson 4 O Ragland Featherston 1 01 Mrs W F D rinkard 1 Oi"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "2 O J R <mark>Horsley</mark> 2 O Mrs C"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "2 O J R <mark>Horsley</mark> 2 O Mrs C"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.63, 505.85, 2061.39, 994.74], "bbox_id": "8476054465", "file": "AppomattoxNewspapers_1912-1915a_0488.pdf", "page": 1, "text": "W arminster- . i Mr. R D. Bond, of Roanoke, was in the neighborhood look ing over real estate ia view of settling here. Some of our most progres sive farmers took advantage of the finé fail and early winter and did a lot of fallowing while others are left with the wrong side of the land up. Dr. T. H. Lacy filled his regu lar appointment at Grace Church Sunday afternoon. Last year we had a one-room school and now we have two rooms and an enrollment of 57 under the judicious manage ment of Misses Teeter and Pat- tesón. Miss Louise B. Horsley and Mrs. F. Russell Moon visited the Hill City Ut week and at tended The Legend of Leo nora, played by Maud Adams. Suoh an ioe harvest as there has beenno excuse Mr. Empty House.  Old James took on quite a swell last week although there was quite a little damage done so far as we know. Mr. Todd, of Richmond, was up several days last week look ing over the old Lanesville farm, now owned by the James Rivet Red Apple Orchard Oo. F. R. Moon St.Arid Jr. visit ed Mrs. O. C. Moon near Scotts- vijle for several days."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "tesón. Miss Louise B. <mark>Horsley</mark> and Mrs. F. Russell"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "tesón. Miss Louise B. <mark>Horsley</mark> and Mrs. F. Russell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [362.9, 212.54, 528.74, 455.59], "bbox_id": "a5e936e9d5", "file": "AppomattoxNewspapers_1905-1912a_0389.pdf", "page": 1, "text": "W arm inster. Misses Louise B., Mildred, L. S , and F annie E. Horsley have returned from a stay of ten days at V irginia Beach and other points of pleasure. _T hey seem to have had a very de lightful stay. M r, and Mrs. F. K. Moon visited B uckingham C. H. last week. 1 Mr. Geo. W . Patteson is hav ing a well boared a t his store house a t Manteo, and Mr. O, M. Sutton expects to have one a t his home,  Interbrook, in the near future. Mrs. M ary G. B oatw right, Miss Adocia Gibson, and Mrs. W. F. W oodson and little son,"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "and F annie E. <mark>Horsley</mark> have returned from a"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "and F annie E. <mark>Horsley</mark> have returned from a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [219.62, 1138.68, 379.46, 1657.27], "bbox_id": "2d914bebb8", "file": "AppomattoxNewspapers_1905-1912a_0318.pdf", "page": 1, "text": "W arm inster. Dr. T. H. Lacy will have Bishop Tucker with him at Emanuel and Giace Churches on the 4tb Sunday. Rev. Geo. W. Persley very kindly offered to hold his services on the fifth Sunday so as not to conflict. Messrs. J. S. and Gilmer Horsley spent several days in Richmond laBt week. Mrs. Percy HarriB, of Norwood, is spending several weeks in Phila delphia visiting her mother. Mr. Elmore Scruggs, of Bluefield, W. Va., is spending some time at the home of his uncle, Mr. John Mathews. Mr. W. N. Farmer, of Midway Mills, is spending some time at his old home near Richmond. Master Channing Moon is spend ing a month with his grandmma near Scottsville. Mrs. J. M. Spears, of Manteo, has returned from a visit to friends and relatives in Lynchburg and Blnefield. The Times-Dispatch and otbei papers seemed to have gotten things very much mixed in regard to the shooting of W. L. Fields by Con stable W. L. Hughes at this place some time back. They bad it tha Hughes was in jail charged with murder and that the coroner jury could not agree, which reports were not true as Hughes was never even put under bond so plain was it a case of self-defence, and the coroner jury agreed as did the two magis trates that tried the case and the grand jury indorsed the papers of coroner jury."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "J. S. and Gilmer <mark>Horsley</mark> spent several days in"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "J. S. and Gilmer <mark>Horsley</mark> spent several days in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [252.21, 1702.6, 410.46, 1773.29], "bbox_id": "6da67940cc", "file": "AppomattoxNewspapers_1905-1912a_0451.pdf", "page": 1, "text": "W ar Mills atr. Dr. T. H. Lacy delivered s vary able serm on oa E ternal punishm ent a t Graoe church B aa day afternoon. M iss Louis Gilm ar Horsley"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "iss Louis Gilm ar <mark>Horsley</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "iss Louis Gilm ar <mark>Horsley</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2210.63, 404.26, 2373.57, 620.72], "bbox_id": "235b22c46e", "file": "AppomattoxNewspapers_1918-1922a_0106.pdf", "page": 1, "text": "W ar H isto ry F or A p p om attox The Local Branch for the W ar H istory Commission or gnnixed Wednesday night The local branch is as follows 8. L Ferguson, Chairman C. W. Sm ith, Secretary and Treasurer MissM Louise Gills, Historian The local collaborât jrs aro as follows Hon J. R Horsley, A. H. Clement, Rev. H Parlett Est, Prof. Lindsay Crawley, Hon. Joel W. Flood, Hon. R L. Burke, Misa M. Anna Jonas, Haviluh Baboook, Miss Eula May Burke, J A Burke."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "follows Hon J. R <mark>Horsley</mark>, A. H. Clement, Rev."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "follows Hon J. R <mark>Horsley</mark>, A. H. Clement, Rev."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.29, 369.4, 2394.08, 1454.83], "bbox_id": "c3f61a1dfb", "file": "AppomattoxNewspapers_1915-1918a_0216.pdf", "page": 1, "text": "W alter W. Scott, Appomat tox, 27879, P aige 25. W . L. Brow n, Appom attox, 27871, Ford 20. T. E. T urner, A ppom attox, 26563, Ford 20. A. B. T urner, Appomattox, 26983, Ford 20. E. T. Price, Appom attox, 27083, Ford 20. O. W. Hanoook, Appomattox, 25026, Ford 20. Appom attox Hdw. Co., A p pom attox, 25247, Ford 20. J. A. Burke, A ppom attox, 26Ò27, Ford 20. A. H. Clement,- Appom attox, 18860, Hudson 30. H enrietta E. Soott, Appom at tox, 18872, jN ational 30. C. W . Jones, Appom attox, 19074, O verland 35. 0 . A. Hancook, Appom attox, 20898, Ford 20. W. H. Turns, Appom attox, 21085, Ford 20. Jas. B. A bbitt, Appomattox, 21151, M axwell 25. W. W. Lee, Appomattox, 15580, Ford 20. 0 . A. Hancock, Appom attox, 18508, Cadillac 40, B. G. Anderson, Appom attox, 10560, Ford 10. Mrs J . R. Atwood, Appom at tox, 10958, Chalm ers 48. H. D. Flood, Appom attox, 6044, Hudson 60. B. F. Oden, Appomattox, 6045, Chalm ers 30. J . M- K notts, Appom attox, 9162, Ford 20. D. N. Tw ym an, Appomattox, 11461, O verland 30. J. R Horsley, Appomattox, 11573, Metz 20. Appomattox Hdw. Co., A p pom attox, 11870, Ford 20. H. W , M cKinney, Appom at tox, 12716, Ford 20. . S. L. Ferguson, Appomattox 1204, Overland 85.  M. L. K arm an, Appom attox, 23856, Ford 20. E. F. Pittenger, Pam plin, 4259, Ford 20. J . A. Y oung, Pam plin 4640, Tord 20. E. E. W alker, M. D , Pam  plin, 16714, Ford 20. J P. Maloney, Pam plin, 15620, Ford 20. L. N. Ligón, Pam plin, 15573, Overland 30. O. E. Peterson, Pam plin, 7029, Ford 20. L. W. Hoffman, Pamplin, 23558, O verland 86. E. F. Williams, Pam plin, 19251, Ford 20. Tom Baker, Pam plin, 17640, Ford 20. R. L. Franklin, - Pam plin, 17287, Dodge 25. J. D. C arter, Pam plin, 26491, Ford 20. T. C. Young, Pam plin, 27684, Ford. 20. W . D Rodgers, Pam plin, 23550, Ford 20. F. H. Lukin, Pam plin, 7423, Ford 20. D. A. C hristian, J r., Vera, 16643, Ford 20. J. K. Megginson, V era, 25072, Ford 20. C. Inge, S p o u t S p r i n g , 30303, Ford 20. W . D. Robertson, 8 p o u t Spring, 18491, Ford 20. C. Inge, Spout 8pring, 17404, Overland 30. 8. W . Alvis, Spout Spring 26004, Buick 30."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "verland 30. J. R <mark>Horsley</mark>, Appomattox, 11573, Metz 20."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "verland 30. J. R <mark>Horsley</mark>, Appomattox, 11573, Metz 20."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [374.06, 1333.37, 531.26, 1649.57], "bbox_id": "5163d582bf", "file": "AppomattoxNewspapers_1915-1918a_0015.pdf", "page": 1, "text": "W a rm U lster. Mr. A. R. Holladaj, of Riel, mond, is at his summer hou here. Mr. Richard Bolling, of Ric h mond, is spending the week at the home of his sister, Mrs. P B. Cabell. A. C. Horsley Jr. is ot horn for several weeks. He and hu brother, Gilmer, expect to leave for Wheeling, W. Va. very soon. Mr. and Mrs. F. H. Mo n visited Lynchburg  Better A c  quaintance Week and took li the trip to Natural B. idge giver- all visiting merchants by t o Board of Trade. They report a very delightful time. Rev. Fruit concluded Lis meeting at Woodland Church on Tuesday last and opened at Glenmore on Sunday last. He delivered some very able dis courses on the hereafter and making a preparation for it."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "B. Cabell. A. C. <mark>Horsley</mark> Jr. is ot horn"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "B. Cabell. A. C. <mark>Horsley</mark> Jr. is ot horn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [131.78, 1069.36, 296.64, 1622.48], "bbox_id": "64d739edba", "file": "AppomattoxNewspapers_1905-1912a_0358.pdf", "page": 1, "text": "W a rm in ste r. Min Mildred Horsley was taken to the Memorial Hospital on No. 10 Sunday by Dr. Peroy Harris, of Norwood. 8he was operated on for appendicitis Sunday night and was doing well this a. m. A carrier pigeon was in my store this morning. I fed it and started it on its homeward jonrney the band had T. Y. 15294 on it. Mr. J. M. Spears is,having a very nice residence erected on the place jnst below here. I saw in the same hill squaeb that had just come up and ones that had young ones on them, all planted together about 6 weeks ago. Mrs. Ella Morris is spending some time at Island View, the hospi table home of Mrs. S. P. Sutton. A. 0. Horsley Jr. and E. R. Moon attended the play in Scotteville las week. Tobacco is being planted today on a half a season and now if it will only rain so it will live. Mr. Robert Wilkerson, of Lynch Station recently was the guest oi Miss Horsley at Cartage Hill. Miss F. E. Horsley has returned from spending some months in Alabama, where she had a v. ry de lightful stay. We are glad to report Mr. Geo W. Patteson ns improving aftei suffering a good deal from beinp thrown from a horse. Gardens are a failure, spring oats re nothing, the hay crop is not worth catting at all, but corn is growing, and wheat seems to be very well filled ont. Mr. E. G. Powers, onr popular gent, is spending some time in Newport News."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "ste r. Min Mildred <mark>Horsley</mark> was taken to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "ste r. Min Mildred <mark>Horsley</mark> was taken to the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1962.49, 974.8, 2144.11, 1582.75], "bbox_id": "60349e9d14", "file": "AppomattoxNewspapers_1905-1912a_0295.pdf", "page": 1, "text": "W a r m i n s t e r . I W ingina Lodge I. O. O. P-l No. 110 gave a meat and oyster I supper to 30 or 40 hungry men I and boys Saturday night. Oysters, ham, chicken, coffee, cake, crackers and bread al lowed no one to leave hungry..  Miss Gay Gilliam and Miss Louise Horsley spent Monday in the city of Scottsville. Mr. and Mrs. A. O. Horsley spent Friday and Saturday ini Richmond. I Quite an enjoyable evening! was spent by the young people! of the neighborhood at Syca-1 more, the bachelor depart ments of Messrs. Geo. W. Jr. and Davy Patteson at Manteo. As I write I can see two boy  tramps, one w ith short pants, age about 10, and the other about 17, waiting for a freight train to beat their way to Richmond. It is indeed a piti-1 I full sight to see so many young j boys on the tram p when there! is so much in this big world of I ours to be done, and the future! of this great country is depen dent on the young generation  for all the. good or bad it may do. Mrs. Percy H arris, of Nor wood, and two children recent l y spent several days at the home of the Misses Horsley. Mr. N. M Sutton is back at his post of duty after an ab- IB6HC6 of 30 days, j M,S Dos well spent Saturday and Sunday at her home near! New Canton. Ou farm ers are well up on their plowing and well they m ight be, for such w eather as we have had none but such as  Peter Tum bledown should De behind."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Gilliam and Miss Louise <mark>Horsley</mark> spent Monday in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Gilliam and Miss Louise <mark>Horsley</mark> spent Monday in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.7, 744.61, 1645.08, 801.61], "bbox_id": "2f40936091", "file": "AppomattoxNewspapers_1898-1902a_0007.pdf", "page": 1, "text": "W. 8. HORSLEY, O  Notary Public, P. O. Spanish Oaks, Va. v feonnty Surveyor of Appomattox County. fTWande promptly and accurately surveyed an plots made. A - H. CLEMENT,   XX. Attorney-at Law and Notary Public,"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "W. 8. <mark>HORSLEY</mark>, O  Notary Public, P."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "W. 8. <mark>HORSLEY</mark>, O  Notary Public, P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [488.64, 640.37, 621.94, 748.27], "bbox_id": "672bd6baff", "file": "AppomattoxNewspapers_1898-1902a_0169.pdf", "page": 1, "text": "Voters of Appomattox jireby announce myself a can for the clerkship of the of Appomattox, subject to democratic primary to be n April 29,1899 and I re- illy ask the support of iny gnen. rVery respectfully, J. R. HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "rVery respectfully, J. R. <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "rVery respectfully, J. R. <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2205.81, 657.25, 2369.0, 1050.99], "bbox_id": "32f74c44d2", "file": "AppomattoxNewspapers_1918-1922a_0106.pdf", "page": 1, "text": "Virginians of Distinguished Service a Men in Servioe, b CiviliausJ R Horsley. Pre-W ar Conditions and Ac tivities a Editorials, b StatisticsA. H. Clement. Virginia Churches in War Tin9   8e v oa Flag, V ServicesRev ti Parlett E ist Virginia Sohuols s a l Col lege in the War  j Sob 1 ls  College StuaeuiM-U ndiej Crawler. Men in 8 r ie    v. teers, b Dr a t- d v ie _ joel Vi Flood, Economic Conditions in War a Financial, h E-.oo mieK L Burke. The Red Cross in Virginia a Statistics, b Hietorj Miss tt. Anna Jones. Work and Relief Organisa ions  1  United W ar Work, b Local AssociationsHavil- ah Babcock. W ar L r tterg, friaries and Inoidqnts a Original Con tributions,  0  Clippings Miss Eula May Burke, Host War Conditions ana Activities a E iitorials, b StatisticsJ A. Burke."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Servioe, b CiviliausJ R <mark>Horsley</mark>. Pre-W ar Conditions and"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Servioe, b CiviliausJ R <mark>Horsley</mark>. Pre-W ar Conditions and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1305.56, 588.42, 1439.7, 821.36], "bbox_id": "8087121a00", "file": "TimesVirginian_1980a_0149.pdf", "page": 1, "text": "Virginia Federation of HjJme Demonstration Clubs held at VPI  SU, Blacksburg. The clubs past presidents were Mrs. AnnieCaldwell, Miss Kate Davidson, MfS. J. R. Horsley and Mrs. Ella Leitner. Miss Kate Davidson serv ed as county chairman 1944-1947, Mrs. J. L. Harrison served as county chairman 1961-1962, Mrs. T. O. Davidson served as epunty treasurer 1970-1971, - Mrs. Tilden Lee served as county reporter in 1969, knd has served as county secretary for the past two Bethany"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Davidson, MfS. J. R. <mark>Horsley</mark> and Mrs. Ella Leitner."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Davidson, MfS. J. R. <mark>Horsley</mark> and Mrs. Ella Leitner."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [483.35, 1593.85, 644.44, 1683.24], "bbox_id": "51df0fd68d", "file": "AppomattoxNewspapers_1898-1902a_0143.pdf", "page": 1, "text": "-Virginia and ü  vourw _____ _ _______ s  u FERGUSON, Attorney-at-Law, and Commissioner ln Chancery, West Appomattox, Va. Federal and State. ____________ Courts r R. HORSLEY. otarypubilCi P. O. Spanish Oaks, Va. roonty Surveyor of Appomattox County, lands promptly  d accurately surveyed gnd plots made. ________________"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "State. ____________ Courts r R. <mark>HORSLEY</mark>. otarypubilCi P. O. Spanish"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "State. ____________ Courts r R. <mark>HORSLEY</mark>. otarypubilCi P. O. Spanish"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1927.88, 1076.77, 2252.88, 1434.31], "bbox_id": "f42ea490c6", "file": "AppomattoxNewspapers_1922-1923a_0624.pdf", "page": 1, "text": "vided in their opinions of the pen-180 much to make her last days hap- sion bill recently made a law. Justl pjer and easier to bear, so, and it is natural that they  Mis. Dnncan Sams recently should be divided on the question I gpent several days at the homeof those who are yet young and whoher brother, F. R. Moon, have no idea of teaching as long as Mr. J. S. Horsley was in Lynch- 25 years or near that long will look I burg last week, forward with a feeling of rest and I Mary Lizzie, the little daughter security to the time when they be-l0f Mr. and Mrs. R. H. Patteson come eligible and are put on the J jias been quite ill, bnt is improving retired list. I now under the careful treatment of A writer in one of the Richmond I r g, R. Glover, papers wants to know why district The Methodist Quterly meet school boards close some schools at I Dg will be held in the new Wood the end of 5 months and continue h and church on March 31st and other schools for a longer time in I April 1st and 2nd. the same district. It not infre- Rgy, w. P. Province filled his quently happens that the school has I regular appointment at Woodland not done well, that teacher or pupil Ichuroh on Sunday last, or teacher and patron did not get p r Perkins Glover, of Arvonia on well together and at the end of I dipped a car load of nice hay from the term one or the other, or per-1 bis river farm last week. Mr. G. W. Patteson received tom turkey that weighed just 42 pounds. He is a beauty. Mrs. F. W. Woodson is expected home this week accompanied by Mr. Wocdsons annt, Mrs. Raymos, Messrs. E. H. Swinley and F. R. Moon expect to be in Lynchburg"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "as Mr. J. S. <mark>Horsley</mark> was in Lynch- 25"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "as Mr. J. S. <mark>Horsley</mark> was in Lynch- 25"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [483.59, 239.07, 641.9, 437.27], "bbox_id": "917d73f5af", "file": "AppomattoxNewspapers_1902-1905a_0233.pdf", "page": 1, "text": "vice-presidents and J. F. Pnrdnm secretary and treasurer. After the election of officers, Mr. J. R. Horsley, the secretary of tb meeting, by request of the chairman, invited all present who wished to have their names enrolled as mem bers of the instituís to come for ward and give their names to him. Nearly all present came forward and had their names enrolled as members. It is believed that if this Institute is carried out on tbe lines contem plated it will result iu much bene fit to the farmers, and they should all lend a hand in helping to make it a success."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "officers, Mr. J. R. <mark>Horsley</mark>, the secretary of tb"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "officers, Mr. J. R. <mark>Horsley</mark>, the secretary of tb"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1584.7, 898.85, 1654.85, 1023.83], "bbox_id": "ad5f9765af", "file": "AppomattoxNewspapers_1971-1973a_0241.pdf", "page": 1, "text": "V leM ele-C elU a. v ille H ylton ..................... B . J o y c e ..................... X . Joyo ............ . Cook . ...................... Drwwg ............... 3Martii . ........ . ...... Horsley .................. Totals .................. A ppom attox G a ffo r d . .................... Garrett ............. . Layne ........  W a d d e ll ..................... Johnson ... R obinson . . . . . . . . . . Totals .................. Fieldale-Colllaa villa A ppom attox ..........."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Joyo ............ . Cook . ...................... Drwwg ............... 3Martii . ........ . ...... <mark>Horsley</mark> .................. Totals .................. A ppom attox"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Joyo ............ . Cook . ...................... Drwwg ............... 3Martii . ........ . ...... <mark>Horsley</mark> .................. Totals .................. A ppom attox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2124.87, 855.23, 2298.77, 1363.51], "bbox_id": "05dc892cce", "file": "AppomattoxNewspapers_1902-1905a_0059.pdf", "page": 1, "text": "V eriiilllon. As we never see any tiling abou ouii little postoffice iu your paper 1 will write and let you know that w are .still alive. We have had right much rain weather of late, but we are looking to a bright future when the-spfingi time opens an.l the flowers b.eiifn bloom and the birds begin to sing and our coal and gold minefi-OfieO up,then aurdiwle village wHI-be- oil boom. Bitt we  think 1 M-ftLdliftu . 0b gold mi 11 iugousiness into the oat kib business, aud. he wishes to. ask all of his friends if-they have any cats to give away that they will please lei him know. We all wish hrti great success in his new business and truly hope be will have bettei luck iu tbe future than he had a Mr. Barlows the other day when h ran two cats to Piney mountain and after a long chase lost them Those having any kind of skins cat find sale for them at Mr. Garden Mr. W. C. Nowlin Las on a broa smileit is a boy.   Miss Alma Hamilton visited friends near Glenfall last week. Mi-s Callie Horsley is now a1 home. Miss Lizzie Ferguson ha been for the last two weeks visiting hei cousin, Bailie Bush Inge. Miss Mittie B. Nowlin spent last week with her grandmother, vh has been quite sick. Mr. Willie Childers returned from kmherst the other day, after b-a8ant visit to friends. The Patteson school closes nex T.iuiiday, at which, time they ex pect to have an entertainment. Mr. W. L. Coleman expects to uoit the Hill City with tobacco next week. Mr. Luther Morris has gone iu with Mr. Beasley at Andersons mill March 8, 1903"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "last week. Mi-s Callie <mark>Horsley</mark> is now a1 home."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "last week. Mi-s Callie <mark>Horsley</mark> is now a1 home."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1352.65, 1402.64, 1666.78, 1627.04], "bbox_id": "09e4ad33e8", "file": "AppomattoxNewspapers_1905-1912a_0483.pdf", "page": 1, "text": "ustice of the PeaceC, ce Aliens Level, ustice of the FeaeeA. 8 to nice Bucaingtaam. ustice of PeaceW. H. Spencer, postofflee I E ustice of Peace K. B. Newton, postofflee lwyn. onstabieJoseph A. verseer of PoorM. J, Taylor, postofflee at Mr. S. D. F ranklins, of tavuu II Buckingham, last Saturday rUABCUOO DISTBICT. I    upervlBorAlexander Forbes, poatoffioe I and Sunday. re s  to a e, I , _ _ _  . ,  ol tne Icace L ouis D. Jones, post I Mr. DQ Mr8. JLiGH r rQKllD, ustice ot me Peace-p. m . Jones, post-of Buckingham , have moved ee stheppards. I. Justice ot ttae PeaceK. V. Anderson, post I into tuOir 110 W DO HI G WDICll ce Andersonviiifc. I ,  , HviU0  Forbes, postofflee Ander-1 thsy rcCGDtlY purCDft80CI,  We extend our heart-felt JAHES BlVla D18TUIOT. I _ _____ ___ . _ ,.  j 2ft,rvta0r. C- Wood, poatoffioe Wlnglna 18y  T oi the Peaee-F W bereaved fflcewingiia  . a n T i I fam ily of Mr. R. H Payne ofcanteo11 Pea06p- p. Giover post-1 which gentlem an died Jan. 11 anteo o Pe,ice- A- Horsley, postofflee Constable-Willis Basket,poi owerîlrtï.0 Poor c Ws stoffice Hubard right, poatoffioe"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "anteo o Pe,ice- A- <mark>Horsley</mark>, postofflee Constable-Willis Basket,poi owerîlrtï.0"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "anteo o Pe,ice- A- <mark>Horsley</mark>, postofflee Constable-Willis Basket,poi owerîlrtï.0"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [617.74, 809.1, 774.37, 855.3], "bbox_id": "49c4711313", "file": "AppomattoxNewspapers_1898-1902a_0247.pdf", "page": 1, "text": "Ur. G. B. Tay lor attended i ne marriage of Mr. Lewis VV. Cabell lo Mbs ivuth iJ. Horsley in Nelson Tuesday."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Ur. G. B. Tay lor attended i ne marriage of Mr. Lewis VV. Cabell lo Mbs ivuth iJ. <mark>Horsley</mark> in Nelson Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Ur. G. B. Tay lor attended i ne marriage of Mr. Lewis VV. Cabell lo Mbs ivuth iJ. <mark>Horsley</mark> in Nelson Tuesday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.28, 1187.84, 1596.03, 1231.89], "bbox_id": "a661422e5d", "file": "AppomattoxNewspapers_1915-1918a_0268.pdf", "page": 1, "text": "unstable, M. J. DunnavanL Janies River D ibui . i tices of the PeaceP. P. Glover. F. W. Swan, Wingina A. Horsley, Warminster."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "unstable, M. J. DunnavanL Janies River D ibui . i tices of the PeaceP. P. Glover. F. W. Swan, Wingina A. <mark>Horsley</mark>, Warminster."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "unstable, M. J. DunnavanL Janies River D ibui . i tices of the PeaceP. P. Glover. F. W. Swan, Wingina A. <mark>Horsley</mark>, Warminster."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [555.6, 929.5, 785.19, 1089.34], "bbox_id": "63c144ccdd", "file": "AppomattoxNewspapers_1926-1933a_0219.pdf", "page": 1, "text": "Unless road funds are ex travagantly spent, with prefer ence given to inexperienced unemployed labor, road pro jects will do little to aid the drought stricken farmer, de clared J- R. Horsley, speaking efore the third annual session of the Virginia State grange Tuesday afternoon. Ask any intelligent practi cal farmer, the speaker chal lenged his hearers, how much of this road construction money will directly or even indirectly j Rbin Hood"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "de clared J- R. <mark>Horsley</mark>, speaking efore the third"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "de clared J- R. <mark>Horsley</mark>, speaking efore the third"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [550.56, 904.48, 711.47, 1051.57], "bbox_id": "8c4076145f", "file": "AppomattoxNewspapers_1926-1933a_0220.pdf", "page": 1, "text": "Unless road funds are ex travagantly spent, with prefer ence given to inexperienced unemployed labor, road pro jects will do little to aid the drought stricken farmer, de clared J- R. Horsley, speaking before the third annual session of the Virginia State grange Tuesday afternoon- Ask any intelligent practi cal farmer, the speaker chal lenged his hearers, how much of this road construction money"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "de clared J- R. <mark>Horsley</mark>, speaking before the third"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "de clared J- R. <mark>Horsley</mark>, speaking before the third"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [541.89, 883.4, 711.25, 1031.24], "bbox_id": "aaba88ee08", "file": "AppomattoxNewspapers_1908-1909a_0220.pdf", "page": 1, "text": "Unless road funds are- ex travagantly spent, with prefer ence given to inexperienced unemployed labor, road pro jects will do little to aid the drought stricken farmer, de clared J. R. Horsley, speaking before the third annual session of the Virginia State grange - Tuesday afternoon. - Ask any intelligent practi cal farmer, the speaker chal lenged his hearers, how much of this road construction money"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "de clared J. R. <mark>Horsley</mark>, speaking before the third"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "de clared J. R. <mark>Horsley</mark>, speaking before the third"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [448.8, 746.16, 606.94, 949.3], "bbox_id": "8dfcf425b8", "file": "AppomattoxNewspapers_1898-1902a_0352.pdf", "page": 1, "text": "uMtiRMth anqurv V unoa am m oououja A taw gm v a v id t-ia iio n v suxoiiy r  TiRHdKvo f KONsavrU I N W. HCPARD, J. Attorn, y-at-LawAttorney for tbe Con .mon wealth. Bucklmtliam O. H.. Va. Courts - State ml Federal. J T. ROGERS. . Attorney-at-Law,  _ _ ItueklUKham C. H., V CourtState and Federal. S L. FBRGCSON, . Attornoy-at-Law, and Commlsakiner In Chancery,  - , , West Appom attox, Va. CourtsFederal and State. R. HORSLEY.    Notary Public, _ __ P. O. Spanish Oaks, Va. oounty Surveyor of Appom attox County. Lands prom ptly and accurately surveyed and plots Wade. H. CLEMENT, . Attorney-at Law and Notary Publlp,"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "CourtsFederal and State. R. <mark>HORSLEY</mark>.    Notary Public, _ __ P. O."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "CourtsFederal and State. R. <mark>HORSLEY</mark>.    Notary Public, _ __ P. O."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.8, 656.17, 1669.37, 746.97], "bbox_id": "f8ff5f0a76", "file": "AppomattoxNewspapers_1918-1922a_0407.pdf", "page": 1, "text": "uJireof J.C. Horsley, of Oak- .Uuntv of Appomattox, and Lkia.  bankrupt. Notice 1 EteuoDthe 9b day of Mtrcb, Um ld J.C. Horsley .was duly .MDkrupt and th at the first it creditor will I held at the t RiSford,Beferee.965 Peoples Ink Building. Lynchburg, vlr- Lh hiv ot Maroh, 1921. a t ten torenoon, at wilob time the  attend, prove their lot a trustee, examine the bank- rnmet suoh other business as ocae before said meeting."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "uJireof J.C. <mark>Horsley</mark>, of Oak- .Uuntv of"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "uJireof J.C. <mark>Horsley</mark>, of Oak- .Uuntv of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1291.7, 1523.87, 1608.01, 1659.01], "bbox_id": "3607cc423e", "file": "AppomattoxNewspapers_1912-1915a_0137.pdf", "page": 1, "text": "Uájatkeof th, Office Shi Jui eppar, eAudi Juir erso hie about to  fc  ?A Peace- Ieott Gui8 P8t Doubtless as the oar was  Kd p  Anderson, postoffloe An. I poke its nose aronnd the dangerou JAMES KIVEH DI8TKIOT, the I.. -. . ism . I comer at McKinneys Stable, Colonel was so enrapp.ed with the 1 Peaoe-P. f . Glover post-U r future trips, and 8P- hnSo8olpaee a . c . Horsley, postoffloe I purently dreaming of some flowery    ll8HaoPotofficeHubard hell, the little red car took a plunge e.ior j. o. Giover. postoiBco I the new fence of Mrs 133. 147 a moo 20 Acre I Hunter."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "8P- hnSo8olpaee a . c . <mark>Horsley</mark>, postoffloe I purently dreaming"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "8P- hnSo8olpaee a . c . <mark>Horsley</mark>, postoffloe I purently dreaming"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2022.55, 1561.34, 2070.3, 1569.34], "bbox_id": "563c42ccc3", "file": "AppomattoxNewspapers_1892-1898a_0263.pdf", "page": 1, "text": "U. HORSLEY,"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "U. <mark>HORSLEY</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "U. <mark>HORSLEY</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2114.1, 808.79, 2440.74, 888.54], "bbox_id": "fb2ee04079", "file": "AppomattoxNewspapers_1905-1912a_0266.pdf", "page": 1, "text": "tug IS mouths.  friends and build up your own County. Patronize your Every f am ers account wanted. DIBBCTORSi Jos. Button, Sears. J R- Horsley. I. R Atwood, . O. Joños, L. Ferguson, J-"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Button, Sears. J R- <mark>Horsley</mark>. I. R Atwood, . O."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Button, Sears. J R- <mark>Horsley</mark>. I. R Atwood, . O."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2191.14, 1541.05, 2358.62, 1779.05], "bbox_id": "b61d5bc20e", "file": "AppomattoxNewspapers_1955-1957a_0224.pdf", "page": 1, "text": "Tuesday, July 17.- The Appomat tox Home Deomnstration Club will not meet until further notice. Wednesday, Jully 18.. Wreck Is land Home Demonstration Club will meet at 200 P. M., witlj Mrs. G. P. Jennings. Mrs. J. R. Horsley will be in charge of demonstration. Thursday, July 19.- The Pamplin Home Demonstration Club will meet at 1030 A. M., with Mrs. L. N. Ligon and Mrs. W. C. Dudley, co hostesses. Mrs. J. A. Williams and Mrs. .Percy Lucado will give the dem onstration. Members will bring a salad or dessert. Saturday, July 21- The Glendale Home Demonstration Club will meet at 600 P. M. at the home of Mr. and Mrs. Hunter Nash. Mrs. E. W. Marshall, Sr., and Mrs. F. J. Nash, Sr., will have charge of the demon stration. Members will bring a salad or dessert."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Jennings. Mrs. J. R. <mark>Horsley</mark> will be in charge"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Jennings. Mrs. J. R. <mark>Horsley</mark> will be in charge"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1531.2, 1154.57, 1699.68, 1286.46], "bbox_id": "2038c95ee5", "file": "AppomattoxNewspapers_1960-1962b_0517.pdf", "page": 1, "text": "Tuesday, January 16th Appo mattox Club will m eet ait 1030 a.m. with Mrs. R. C. Hubbard Tuesday, January li6h Spout Spring d u b will meet a t 115 p.m. with Mrs. John Tweedy. W edpesdlay, Jahuiary 17 Wreck Island Qlub will mi?iet at 2 P. M, with Miss Kate Davidson and Mrs. J. R. Horsley, Thursday, January 18th Pamp- Un Club will meet a t 2 p.m. with Mrs. J. A. Williams."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "and Mrs. J. R. <mark>Horsley</mark>, Thursday, January 18th Pamp-"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "and Mrs. J. R. <mark>Horsley</mark>, Thursday, January 18th Pamp-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.8, 488.49, 1633.58, 593.74], "bbox_id": "95741bb405", "file": "AppomattoxNewspapers_1915-1918a_0230.pdf", "page": 1, "text": "TreasurerR. F. Burke, Appomattox. SheriffH. W. McKinney, Ap pomattox. ClerkJ. R- Horsley, Deputy ClerkC. W. mattox. Attorney for Commonwealth- Ferguson, Appomattox. Commissioner of RevenueE. R. Ab- bitt, Appomattox. County SurveyorW. A. Moses, Ap pomattox. SCHOOL OFFICERS"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R- <mark>Horsley</mark>, Deputy ClerkC. W. mattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R- <mark>Horsley</mark>, Deputy ClerkC. W. mattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1782.23, 334.06, 1941.92, 453.71], "bbox_id": "e88ca54252", "file": "AppomattoxNewspapers_1915-1918a_0173.pdf", "page": 1, "text": "TreasurerR. F. Burke, Appomattox. Sheriff, F. W. McKinney, Appomattox. Deputy SheriffH. W. McKinney, Ap pomattox. ClerkJ. R. Horsley, Appomattox. Deputy ClerkC. W. Smith, Appo mattox. Attorney for Commonwealth S. L. Ferguson, Appomattox. Commissioner of RevenueE. R. Ab- bitt, Appomattox. County SurveyorW. A. Moses, Ap pomattox. SCHOOL OFFICERS"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R. <mark>Horsley</mark>, Appomattox. Deputy ClerkC. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R. <mark>Horsley</mark>, Appomattox. Deputy ClerkC. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1495.2, 272.06, 1657.08, 379.48], "bbox_id": "78f8c12f7b", "file": "AppomattoxNewspapers_1915-1918a_0254.pdf", "page": 1, "text": "TreaauMrR. F. Burk, Appomattox. SheriffH. W. McKinney, Ap pomattox. ClerkJ. R Horsley, Appomattox. Deputy ClerkC. W. Smith, Appo mattox. Attorney for CommonwealthS. L. ForoniBAn A finOlt ftttAT. I A lW iu c    --------------- Ferguson, Appomattox. Commissioner of RevenueE. R. Ab- liom m i  tt   -  bitt, Appomattox. . County SurveyorW. A. Moses, Ap pomattox. SCHOOL OFFICERS"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R <mark>Horsley</mark>, Appomattox. Deputy ClerkC. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Ap pomattox. ClerkJ. R <mark>Horsley</mark>, Appomattox. Deputy ClerkC. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [367.89, 469.34, 532.51, 601.54], "bbox_id": "da483a5434", "file": "AppomattoxNewspapers_1905-1912a_0389.pdf", "page": 1, "text": "Travellers R est, the home of Misses Horsley. Misses W illie Kyle and Jan ie C hristian are spending some tim e visiting friends and rela tives in and near Roanoke. Crops are grow ing nicely since we have had such nice showers, but gardens are a failure sure. Mr. W. F. W oodson, of Rich-"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "the home of Misses <mark>Horsley</mark>. Misses W illie Kyle"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "the home of Misses <mark>Horsley</mark>. Misses W illie Kyle"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [676.09, 207.84, 837.5, 1114.03], "bbox_id": "66d6182769", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "tox r f d 4 688 Howard D. Appomattox r f d 4 539 Robert Peniz, 540 Albert Daniel Beckham 541 Judge Hayse McDaniel, Bent Creek 642 John James Humbl-s, Vera 543 Frank Moses, Appomat tox r f d 4 544 John William Trent, Ap pomattox r f d 4 545 William Edward Patter son, Appomattox 546 Matthew Madison, Oak ville 547 Robert Larkin McDaniel, Bent Creek 548 William David Ferguson, Appomattox r f d 4 649 Jesse D. Booker, Oakville r f d 1 550 Robert Hubert Woodson, Bent reek 551 Fleming Martin, Oakville r f d 1 552 John Clarence Spiggle, Appomattox 553 William Broadus Taylor, Appomattox 654 Fiecell McKinley Parks, Vera 555 John Alex Harris, Appo mattox r f d 4 556 Richard Braury Cole man, Bent Creek r f d 1 557 Thomas Underwood Oil bert, Vera r f d 1 558 Thomas Kenneth Moore, Oakville 559 William Joseph Dixon, Bent Creek 560 Samuel Bernard Page, Appomattox 561 William Thomas Deaner, Oakville r f d 1 562 Ernest Wilson Smith, Bent Creek 663 William Clay Bell, Oak ville 564 Major Perry Cumbie,Ap pomattox r f d 4 565 Hubert Hunter Cald well, Appomattox r f d 3 566 Irby Banks Wheeler, Ap pomattox 567 Frank Lee W oolari, jr. Appomattox 568 Charlie Berkley Perdieu Bent Creek 669 John Wesley Moss, Appo mattox 570 Taylor Horsley Coleman Appomattox 571 Samuel Alviu Bell, Oak ville 572 Herbert Moore, Beckham 573 Henry Gibbs Martin Beckham 574 Howlett Burge Martin Oakville 575 Judson Crawford David son, Appomattox 576 Charles Baxter Page Oakville"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Appo mattox 570 Taylor <mark>Horsley</mark> Coleman Appomattox 571 Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Appo mattox 570 Taylor <mark>Horsley</mark> Coleman Appomattox 571 Samuel"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [900.51, 1713.83, 1064.96, 1815.81], "bbox_id": "de704dfb45", "file": "AppomattoxNewspapers_1898-1902a_0705.pdf", "page": 1, "text": "Total ................ ............. 1.371,722 65 STATE OF VIRGINIA   City of Lvnchburg, s. I, E. P. Miller, Cashier of the above-named bank, do solemnly swear that the above state ment is true to the best of my knowledge and belief. E. P. MILLER, Cashier. Subscribed and sworn to before me this 18th day of September, 1902. 1. A. PAYNE, Notary Publio. Correct, A ttest J. D. HORSLEY,  ERNEST WILLIAMS,-Directors. WM. A. OBRIEN, 1 7-23-3mos"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "A ttest J. D. <mark>HORSLEY</mark>,  ERNEST WILLIAMS,-Directors. WM. A."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "A ttest J. D. <mark>HORSLEY</mark>,  ERNEST WILLIAMS,-Directors. WM. A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.2, 1157.83, 1922.86, 1257.48], "bbox_id": "c0932c96de", "file": "AppomattoxNewspapers_1915-1918a_0453.pdf", "page": 1, "text": "Total ........... .................... ........... 227.886 38  1. R L. Burke. Cashier, do solemnly I I swear th at the above is a true statem ent of I 1 the flnanolal oondltion of The Bank of Ap- I pomattox located at Appomattox, in the I county of Appomattox, Utate of Virgbtla, at I the close ot business on the 11th day of Bept. 1917, to the beat of my knowledge and belief. R. L. BURKE, Cashier. CorrectAttest J, A. B e a ns, s. i . F erguson , J. R. HORSLEY, Directors. S tate of V ir g inia . C ounty of A pfomat -"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "F erguson , J. R. <mark>HORSLEY</mark>, Directors. S tate of"}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "F erguson , J. R. <mark>HORSLEY</mark>, Directors. S tate of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2328.69, 1713.89, 2488.27, 1810.91], "bbox_id": "b0c2927b07", "file": "AppomattoxNewspapers_1902-1905a_0128.pdf", "page": 1, "text": "Total ........ ............ . 1,496,498 47 STATE OF VIRG IN IA   - City of Lvnchbunr, . I, K. P. Miller, Cashier of the above-named tank, do solemnly swear that the above state ment is true to the best of my kawwisdaeoad C o d d er. my knowle ILLER, i before __ lief.  E. P. MI Subscribed and sworn to 12 -h day June, 1903 D. A. PAYNE, Notary Publie. Correct. A ttest J . D HORSLEY,  C H.LUM 8 DKN. 1 Dlreetom ERNEST WILLIAMS. f"}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "A ttest J . D <mark>HORSLEY</mark>,  C H.LUM 8 DKN."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "A ttest J . D <mark>HORSLEY</mark>,  C H.LUM 8 DKN."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2086.11, 945.32, 2392.9, 1094.01], "bbox_id": "decce777b8", "file": "AppomattoxNewspapers_1915-1918a_0212.pdf", "page": 1, "text": "tor instead of the pedal which LdetxV G. Horsley. Secretary-, operates the brake when he found his m istake he looked down to m ake the ohange, when the big car got beyond his control, and landed in a ditch. The occupants were more or less hurt Mrs. Thomas Ellis and Mrs. Thomas Hall seemed to be the worst injured, and were attended by Dr. P. E. Tucker. As usual,a big crowd attend-"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "pedal which LdetxV G. <mark>Horsley</mark>. Secretary-, operates the brake"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "pedal which LdetxV G. <mark>Horsley</mark>. Secretary-, operates the brake"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.05, 634.86, 1765.29, 743.52], "bbox_id": "22e8b41e21", "file": "AppomattoxNewspapers_1898-1902a_0160.pdf", "page": 1, "text": "To the Voters of Appomattox I hereby announce myself a can didate for the clerkship of the courtsof Appomattox, subject t the Democratic primary to h, held on April 29,1899 and I re spectfully ask the support of my countymen. Very respectfully, J. R. HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.82, 877.44, 1763.28, 984.59], "bbox_id": "a07468a8b0", "file": "AppomattoxNewspapers_1898-1902a_0172.pdf", "page": 1, "text": "To the Voters of Appomattox I hereby announce myself a can didate for the clerkship of the courts of Appomattox, subject to the Democratic primary to he held on April 29, 1899 and I re spectfully ask the support of my countymen. Very respectfully, J. R. HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [524.88, 670.61, 683.97, 779.42], "bbox_id": "457e01829a", "file": "AppomattoxNewspapers_1898-1902a_0149.pdf", "page": 1, "text": "To the Voters of Appomattox I hereby announce myself a can didate for the clerkship of the courts of Appomattox, subject to the Democratic primary to he held on April 29, 1899 and I re spectfully ask the support of my countymen. Very respectfully, J. R. HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "Very respectfully, J. R. <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1634.66, 612.88, 1793.18, 719.72], "bbox_id": "ac9fd5c18c", "file": "AppomattoxNewspapers_1898-1902a_0168.pdf", "page": 1, "text": "To the Voters ef Appomattox I hereby announce myself a can didate for the clerkship of the courts of Appomattox, subject to the Democratic primary to lie held on April 29,1899  aud I re spectfully ask the support of my countymen. Very respectfully, JR . HORSLEY."}, "highlight": {"text": {"matched_tokens": ["HORSLEY"], "snippet": "countymen. Very respectfully, JR . <mark>HORSLEY</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["HORSLEY"], "snippet": "countymen. Very respectfully, JR . <mark>HORSLEY</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
