{"document": {"bbox": [552.06, 805.32, 590.77, 812.32], "bbox_id": "fcdd6d57f7", "file": "AppomattoxNewspapers_1898-1902a_0622.pdf", "page": 1, "text": ". Hundley."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": ". <mark>Hundley</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": ". <mark>Hundley</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1652.45, 1137.29, 1885.59, 1411.09], "bbox_id": "f77902755d", "file": "AppomattoxNewspapers_1908-1909a_0304.pdf", "page": 1, "text": "Zone. She is the daughter of Mrs. Hundley and the late Ja son C. Hundley, of Washington Dr. Haynes is a graduate of the University of South Caro lina and a member of the staff of the Rockefeller foundation. He has been doing Research work for the last year in Nigeria, West Africa, and af ter an extended wedding trip, Dr. and Mrs. Haynes will sail March 15 for Lagos, Nigeria, where the groom is stationed for the present. The bride was a school girl here for years and lived here with her mother until the fam ily moved to Lynchburg. She was quite popular here among right much Iher yun2 associates. ."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "the daughter of Mrs. <mark>Hundley</mark> and the late Ja"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "the daughter of Mrs. <mark>Hundley</mark> and the late Ja"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.7, 360.45, 1839.69, 504.94], "bbox_id": "a93aad0ce4", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "XR OFFICERS. APPOMATTOX, OOUNTT OrriOIRS. Judge of Circuit CoimOeo. J, Hundley Courts, tin t day of April itnd October. Judge of County CourtD. A. Christian Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Iter. - a tto rn e y for CommonwealthH. D. Flood r-benffS- P. Coleman. TreasurerD. Mott Bvbertson. C om m issioner of Revenue-L. K. Smith. B oard of Supervisors W. h . Ligón, chair- man 8. C. Stratton and J. C. Jones. Board j m eats on Wednesday after first Monday In March, June, September, end December."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "of Circuit CoimOeo. J, <mark>Hundley</mark> Courts, tin t day"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "of Circuit CoimOeo. J, <mark>Hundley</mark> Courts, tin t day"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [336.25, 734.86, 647.03, 957.49], "bbox_id": "ee499dea34", "file": "AppomattoxNewspapers_1915-1918a_0370.pdf", "page": 1, "text": "working all day I give an hour to them in the afternoon and am re freshed, espeoially when I am made to laugh. Billy Sunday believes in laughter imagine that the war ia as far off as and makes more people laugh than ii Germany and that they neednt I aQy actor on the stage. This is a bony about going to the front. Still, I bed rather be a volunteer than a oonsoript. I have heard no taxpayer disouss that bond issue and I am densely ig norant as to what the verdict will be at the polls. Judge Hundley made a war talk the same evening Dr. Tbompso poke, and the war spirit tuok pos session of him. Residences in the west end have j been robbed of money and jewelry in"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "at the polls. Judge <mark>Hundley</mark> made a war talk"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "at the polls. Judge <mark>Hundley</mark> made a war talk"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [994.31, 1403.24, 1154.62, 1489.74], "bbox_id": "cc2fd09830", "file": "AppomattoxNewspapers_1905-1912a_0276.pdf", "page": 1, "text": "Woman Killed By Auto Identified. Thè elderly woman killed the other night by an automobile driven by Dr. G. Tyler Hundley, was identifled-as Mrs. India Carroll, employed in the bag department of the Virginia Caro lina Chemical Company, in this city. She w7as about 65 years of age and had no relatives in Richmond."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "by Dr. G. Tyler <mark>Hundley</mark>, was identifled-as Mrs. India"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "by Dr. G. Tyler <mark>Hundley</mark>, was identifled-as Mrs. India"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2220.62, 567.38, 2365.47, 788.08], "bbox_id": "f955be51d7", "file": "AppomattoxNewspapers_1962-1965a_0108.pdf", "page": 1, "text": "William O. Johnson CHARLOTTE COURT HOUSE William Oscar Johnson, 83, ! died Mbnday in a Lynchburg hospital. Born in Campbell coun ty, he was a son of Witt and Lucy Johnson. He is survived by two brothers, George Hundley Johnson, of Loui sa, and Simmie Johnson, Brook- neal and 29 nieces and nep hews. Funeral services were conduct ed Wednesday at 2 p.m. at Cen tenary Methodist Church. Madi- sonville, by Rev. Carl T. Poughf and Rev. R. P. Welch, with bur ial in the church cemetary. Pallbearers were Kenneth H. Moore, James C. Moore, Robert B. Moore, Fred H. Moore, Earl Johnson and Norman L. Ram sey, Jr."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "by two brothers, George <mark>Hundley</mark> Johnson, of Loui sa,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "by two brothers, George <mark>Hundley</mark> Johnson, of Loui sa,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [305.99, 193.02, 469.99, 531.07], "bbox_id": "dbe4862b79", "file": "AppomattoxNewspapers_1905-1912a_0267.pdf", "page": 1, "text": "which Jones and Perkins were I sentenced ro death, was that the I lower court erred in not granting change of vemie. It was stt d that feeling was very high in the Bounty at the tim ot the trials, and that it was doubtful if there wae that unprejudiced atmosphere to which every accused tnan is entitled. The court now follows up the I decision for new trials by instruct iog that, the men he tried in Rich mornl. For several weeks past they have been confined in the Henrico count v j il, from whch it will not I now be necessary to remove them W. Dallas Wignt, the white man who was convend of the samel c me, and to whom the Supreme Court .efujed a new tiial on a echniclit,, will be re3enncfd by Judge Hundley However, there is little doubt, that he will teceive a espite from the Governor, and that hS fate w!l depend upon that of the negrops. inasmuch as the evi d e n t against all three is exactly similar"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "be re3enncfd by Judge <mark>Hundley</mark> However, there is little"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "be re3enncfd by Judge <mark>Hundley</mark> However, there is little"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [831.35, 231.19, 999.85, 1118.85], "bbox_id": "2f0701a6b4", "file": "AppomattoxNewspapers_1902-1905a_0153.pdf", "page": 1, "text": "Well, if I talk too long, you will get tired so I will branch off on- the election. I had thought and hoped that the New Constitution, the Barksdale law. Masonic obliga tions would constrain our people to have a fair primary, I never heard more complaint. I dont know that Johns half-and-half man voted or not bat it is charged that two-fify, or three hundred floaters, mostly Republicans, did that whiskey and money flowed freely. These things certainly ought to be stopped. This was Democrat vs. Democrat. Now, when it comes this fall, Democrat vs. Republican, let us see that it shall be fair. No power on earth can stop the buying but, with com mon sense, backbone, and a heart for honest elections, the delivery of bought votes can be stopped. Jack Hooper, Willie Trent, and other have pledged themselves to each other and to their district that no honght votes shall be delivered here unless under the penalty of the law I suppose any offender will be tried under Judge Hundley, as the county- court will end soon after the election I am not in eithei party shall vote for the best man, so far asI know at the time, let him be a Democrat, Republican, or Populist. There is one thing certain here on the farm, if two men make application for work, the one who does not drink gets the job with my consent, only such Shall be employed to make or execute the laws of this good old Commonwealth. I have no ill-trill inst any of the nominees, but drinking men, or men of immoral habits shouldnt be voted for. Thai example to the young is too bad. Well, I thought I was through, but it is raining, and I am rested 24 hours after I began but Ill talk mu to death, wont I ? Mr. Albert Steger, when a yoimg man, went to Alabama. In the town where he ivect was a Frenchmanboth great talkers. A wager was made as to who was the best. They were left over nigh! in the same room. Next morning the Frenchman was found dead, and Mr. Steger was found whispering in his ear.  I dont want to kill yon. Lawyers, editors, and doctors are thought by some to know all things. As you are lawyer and editor, I wish yon would tell me what became of the money collected for sale of ands delinquent for taxes iu De cember, 1873. The Auditor has written me twice that there were no lands sold in the State after the war ntil 1886 for delinquent taxes. Hundreds, if not thousands, of dol- ars was paid to the Treasurer of this county for lands purchased ai the December sale, 1873. I have a list of some 40 or 50 tracts, names of buyers, and the amount sold for. ou get even with Mr. Thomhili by making him enquire into this when he gets to Rich mono. There was, undoubtedly, such a sale of delinquent lands in Novem ber or December, 1873. This was rather more than ten years before Auditor Marye went into office, and more than twelve years oe.fore the second sales, made iu 1886. May peace on earth and good will to man be our motto now and ever more. Andersonville, August 11,1903."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "be tried under Judge <mark>Hundley</mark>, as the county- court"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "be tried under Judge <mark>Hundley</mark>, as the county- court"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1766.63, 849.24, 2501.83, 963.14], "bbox_id": "fb970f4967", "file": "AppomattoxNewspapers_1915-1918a_0027.pdf", "page": 1, "text": "WE NEVER SLEEP. A P P O M A TTO X . VA, The Fall term of onr Circuit I Court will open here on October 1st. Judge Hundley has written here that he will come up on that day, set the cases and will adjourn court over to the 11th, when hel will endeavor to clean up the docket. and Mrs. W. T. Mann."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "on October 1st. Judge <mark>Hundley</mark> has written here that"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "on October 1st. Judge <mark>Hundley</mark> has written here that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1318.56, 1321.71, 1463.61, 1391.71], "bbox_id": "a4e4d9d75c", "file": "AppomattoxNewspapers_1892-1898a_0286.pdf", "page": 1, "text": "We have letters from Arvonia nd Hundley Springs which came late for publication. They will ppear in our next issue. Commun- ations should be sent in not later an Tuesday ."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "We have letters from Arvonia nd <mark>Hundley</mark> Springs which came late for publication. They will ppear in our next issue. Commun- ations should be sent in not later an Tuesday ."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "We have letters from Arvonia nd <mark>Hundley</mark> Springs which came late for publication. They will ppear in our next issue. Commun- ations should be sent in not later an Tuesday ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [176.64, 771.43, 493.28, 1041.82], "bbox_id": "66e7dc0810", "file": "AppomattoxNewspapers_1902-1905a_0325.pdf", "page": 1, "text": "was alleged it could be tried by an .inpartial jury, unsurrounded by my possible prejudice, hut Judge Hundley finely refused to grant Col. Jo Button has been to Sain. I he content ion, retain ng the c -se in Louis the Democrat can now meet I Buckingham county, and setting and nominate Judge Parker, Ifthe third M nday in July as the they do, we shake Jo, not the plum I time for the trial, treefor are not we original Parker I The trial of this case brought meD ?  f.irth testimony of iutenss interest iiid developed features that go to novc only more surely than ever lie remarkably sensational character if this knotty case. Prom all sid- s comes the confirm i ion from the citizens, as well as ,rom barristers, that no such myste r ous case has ever been known or heard of in this section of the State before. Mr. V. E. Howard filed the uffi davit of the three prisoners begging ot a change of venire, but a change"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "possible prejudice, hut Judge <mark>Hundley</mark> finely refused to grant"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "possible prejudice, hut Judge <mark>Hundley</mark> finely refused to grant"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1400.15, 856.89, 1685.59, 958.29], "bbox_id": "90b39566d4", "file": "AppomattoxNewspapers_1915-1918a_0302.pdf", "page": 1, "text": "WantedColored family on large farm. Good wage and. land for working people. Address, with particulars, Box 28, Route 1 , Ever green, Va. H od  Geo. J. Hundley, Judge, purt meets Tuesday after tbe 2nd idsy in November Tuesday after 12nd Monday in March Tuesday p the 2nd Monday in May Tues- I after the 2nd Monday in Septem-"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "H od  Geo. J. <mark>Hundley</mark>, Judge, purt meets Tuesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "H od  Geo. J. <mark>Hundley</mark>, Judge, purt meets Tuesday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [673.89, 675.54, 834.85, 860.4], "bbox_id": "bd6948ab1e", "file": "AppomattoxNewspapers_1908-1909a_0534.pdf", "page": 1, "text": "Wanted Veal Calves 75 to 150 lb. Hogs at market price. L. E. Smith, Appomattox, Va Sep. 24 2t ________ For Sale Apples 50c bu. at storage house, Appomattox, Va. A. H. Clement. 9-24-2t Sweet Cider For Sale, at 40c per gal. In 10 gal. lots- A. H. Clement, Appomattox, Va. 9-24-2t_  For Sale90 Whitefjace Calves, weaned. 40 young An gus cows and heifers bred to registered Angus bulk 50 steers. W. S. HUNDLEY, Boydton, Va. 1-10-2t"}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "50 steers. W. S. <mark>HUNDLEY</mark>, Boydton, Va. 1-10-2t"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "50 steers. W. S. <mark>HUNDLEY</mark>, Boydton, Va. 1-10-2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [139.45, 234.27, 324.6, 1778.86], "bbox_id": "51b8acb3b0", "file": "AppomattoxNewspapers_1912-1915a_0408.pdf", "page": 1, "text": "w vA liM V lL L K . Tne summer harries by a d are ungrateful enough to complaii. of August suns while revelliug it garden luxuries and all manner i, creature comforts. A soaking rail is needed but without it growing, things are growing finely wlnle tin flowers bloom md in the early morn ing hours the birds make melody in the tre tops. Flour gone up 25 cents in the barrel but who cares foi bread when cantaloupes are 25 cents a dozen? Business dull even in tht clerks office where only 30 paper were admitted to record last month against an average of sixty. Tin war across the seas gets in its blc tt on this side the waters. No peaches from Buckingham this Besson and mores the pity a we were wont to get some Iccciou on 8 from her trees. At the last session of the town council the committee having the mat-ei in charge made report on town extension accompanied with a map showing a sweeping taking in of subnrbs. If Judge Hundley con firms the report Fartnville will have an increase of popuiati n o  at lraat 500. A k ck, bowevor, is comirg and a hot fighc after the ordr of the Richmond fight wil ce tn .d. State taxes aliea ly h i, h enough a d town added n.eu g a doubling up. The fight will ue watched with in terest. At the same meeting of ti e body Mrs. Chappell was authorized t have erected a handsome porti o fronting tae Continental hotel, which will greitiy improve the ap pearance of the property and at th same time be an ornament to thi street. The southern suburbs of the town have been greatly improved of late. Caps Bob Miller is finishing a handsome residence about a mile south, Mr. N. B. Davidson is having built a .uugalow to cost 5,000, tie Nursery is alive with fruits, flowers, ornamental and trait tree Mayor Barrows farm of fiity actes shines cut in giory Mr. Woodsou Venables dairy farm is rich incow an I gras , while to the east the Ba ber farm oi which Gonl Jos. E. Johnston was bern, is in a high late ot oultwa lion, the old mansion still standing, and nothing like it in modern day aichitecture, with ihe Serpell fatui hard ty presenting a record bre Ic ing corn and hay crop in spite o the drought. Siuce Mr. II. Buxtet Tuggle pur chased the old Berkeley home it h s become the center of a gracious and generous hospitality. The family rarely sit down to the table alone. Tne latch stri- g hangs on the out aide and the invi ation is to ente and enjoy whatever there is pre pared. Recently Mr. And Mrs. Tuggle have entert tined Mr. J. A. Armi-tead, Jr. and family, Mis Price, of Columbia, S. C  Mr . W. C. Burnet, of Savaunab Mr. John Sheppard, of Richmond, and a host o  town friends, Mrs. B. C. Peters has sold the old Blanton property on 2nd street to Mr. B. M. Bliss. While the former owner, the late O. W. Blan ton lived this was also the home of princely hospitality. Ue rarely went to dinner without having with him a number of friends from the country, and its said that he entertained more people day after day than registered at the hotels. 1 had an ideal summers dinner today and for the benefit of other housekeepers in these days of the high cost of living I beg to mention the only meat dish. The theught- fnl housewife had saved over from the day before scraps of ham, veal and ehieken. These were out np and run through the grinder making the most delightful roquets 1 ever trated. The vegetablei were staffed peppers, broiled tomatoes and corn. Winding up yith water melon of the Jaokson kind, long, large and luscious. An inexpensive u.eal but more than fit for the god. Mr. J. W. Garnett and Mr. T. A. Gray, Jr. have just returned fiom an extensive auto trip through the Valley, taking in all points of in terest and having a genuinely good time. Only one puncture aud that delayed them for only 15 minutes. Mr. N. B, Davidson has also toured as far as to Washington in hs car and he too reports the time of his life Mr. T. W. Vaughan and Mr. Frank Epes also span down to Richmond and thence to Rocky Moant, N. O. No ma ter where the machines tro the drivers bring back no complaiut  uf bad roads. Postmaster Garnett took in the Holiness meeting last Sunday and says he never knew the Bockngham highways in sueto a Pd plight. Even e oasing Willis!"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "of subnrbs. If Judge <mark>Hundley</mark> con firms the report"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "of subnrbs. If Judge <mark>Hundley</mark> con firms the report"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [636.49, 1322.47, 780.2, 1352.01], "bbox_id": "fb436f0864", "file": "AppomattoxNewspapers_1952-1954a_0371.pdf", "page": 1, "text": "W. S. Hundley, Boydton, Va. Oct. 8"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va. Oct. 8"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va. Oct. 8"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [677.77, 666.52, 761.78, 685.67], "bbox_id": "d05d54493f", "file": "AppomattoxNewspapers_1952-1954a_0367.pdf", "page": 1, "text": "W. S. Hundley, Boydton, Va."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [701.31, 1212.08, 784.26, 1231.68], "bbox_id": "42abf2e20e", "file": "AppomattoxNewspapers_1952-1954a_0360.pdf", "page": 1, "text": "W. S. Hundley, Boydton, Va."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "W. S. <mark>Hundley</mark>, Boydton, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1829.99, 246.74, 1993.99, 327.83], "bbox_id": "9a6fd9b2f6", "file": "AppomattoxNewspapers_1922-1923a_0288.pdf", "page": 1, "text": "w. p. h il l , Adjt. I hope our comrades of the Cav alry and uorse artillery will take notice and avail themselves of this cordial invitation. GE0B6E J. HUNDLEY July 17 th, 1906."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "cordial invitation. GE0B6E J. <mark>HUNDLEY</mark> July 17 th, 1906."}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "cordial invitation. GE0B6E J. <mark>HUNDLEY</mark> July 17 th, 1906."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [301.2, 243.24, 458.44, 981.31], "bbox_id": "186b50228a", "file": "AppomattoxNewspapers_1902-1905a_0334.pdf", "page": 1, "text": "W o o lr ld g c - F o r b e s T r ia l As the 18th of July approaches we hear more talk about the trial of the two prominent citizens of Buck ingham county who are charged with the burning of the property, including the residence of the late John S. Forbes. Tbe grand jury returned nine indictments against tbe men, and they have pleaded not guilty and Judge Hundley has fixed upon the 18th day of July third Monday for the trial of the cases. Wool ridge was in ton this week ii consultation with his attorney, Mr. Flood he is a shrewd talker and ne is aiding his attorney in running down rumors. Woolridge appears natural, though somewhat nervous iu conversation. If be is permitted to take the staud his evidencewill be most interesting reading matter, lie was apparently iu the best of hu mor, but said nothiug for publica tion. Mr. Volney Howaid came down .Iso last week to see his client, bu lie Forbes, who failed to get ail. Mr. Howard was accompanied .0 Buckingham by Night Operator Steel from this place, who remem bers selling Charlie Forbes a ticket 0 Lynchburg, but Mr. Steel has uo collection of the night. Tnis bit of interesting evidence has been re ferred to by onr Buckingham cor respondent, it is certain that no alibi can be proven for the flight of March 3, 1904, by Mr. Steel. If Forbes claims be boarded the train Here during the night of March 3d, uud any one knows that fact, it will aid the authorities in the adminis- 1 ration of justice for such parties to come forward and let the fact be .nown. Such an alibi would almost 1 suredly secure for Charlie Forbes liia reedom. Oa the other hand .-lionld it turn out that it was some night after the 3d of March it might have its bearing upon other evidence, which might be very dam- iging. The circumstances, tbe promi nence oi the parties connected with he tragedy, all serve to bring to court, when tbe case is called, the most interested crowd of spectators ver in attendance at a Buckingham o u t . Able lawyers have hold of the c-se on both sides, and lively sparing iid good speeches are expected."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "not guilty and Judge <mark>Hundley</mark> has fixed upon the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "not guilty and Judge <mark>Hundley</mark> has fixed upon the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1572.7, 491.7, 1839.92, 646.78], "bbox_id": "7d82199647", "file": "AppomattoxNewspapers_1898-1902a_0585.pdf", "page": 1, "text": "W .n.,illiam s. . TreasurerJefferson Hat is. ... . .. . I he Uitlghitm case is Se! C , tssioner ot llcvenue, 0 strict No. 1. i  can. District No. 2, C. t .Camden. div ill t lie Iodlllv ! H.ll. Rnard of Supervisors P. A. tnifg chati- - n, lexauder Forbes, Korrcst Gut line, M. si hie I luit it nut .o tier v is Thomas Tindall and Allie I. Wood-  t meets first Monday In each mouth. laler lay luring tlie trim. CUMBKHI.ANI. COUNTY OFFICERS. M   hOHUlti liallCOok jud c of Circuit CourtGeo. .1. Hundley, will lie residents ol 1 he vil JlJtl v Ul Vltutwv  Courts, 7th May, 7th November. , judge of County Court l. M. Mdlei. few days. CtirkofcfrcutiUandUtAunty Courts-.t. II. T Attorneyorthe Commonwealth-Wm. M. FieaBurerO. , Flippen. SheriffH. K Adams. S urveyor  . - Difififs. Ronu  f Supervisors-.!. A. Steger, vhair- man hos. II. Perkins and Win. II. Itlmdcs."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "of Circuit CourtGeo. .1. <mark>Hundley</mark>, will lie residents ol"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "of Circuit CourtGeo. .1. <mark>Hundley</mark>, will lie residents ol"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [436.3, 528.77, 600.1, 563.02], "bbox_id": "231c49e947", "file": "AppomattoxNewspapers_1898-1902a_0060.pdf", "page": 1, "text": "w nge Hundley will hold circuit I court here commencing Saturday, f The docket is very light."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "w nge <mark>Hundley</mark> will hold circuit I court here commencing Saturday, f The docket is very light."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "w nge <mark>Hundley</mark> will hold circuit I court here commencing Saturday, f The docket is very light."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [361.65, 801.85, 524.2, 1725.27], "bbox_id": "fdf787bf3c", "file": "AppomattoxNewspapers_1915-1918a_0447.pdf", "page": 1, "text": "w m taking in so mnch money that it didnt know what to do with it Congratnlationa to the Cockade City, for there was a time when it suffered all the horrors of war and knew aone of the blessings. I hats a farmer friend who atoms to town on Saturday afternoons to pay off his hands and last Saturday I u t by him as he dealt out the ready oash. When he had settled with one of the number he remarked to me, That man h u been with me continuously for 27 years, and hu rained a large family of ehildren and grandchildren on my farm. No vexed labor problem on that farm. The eeoret is, that tbe owner is just, and prompt pay. And this farm hahd h u had a better home and more oomforti than any hand who is employed on pnblio workfall rations, and pay better than the av erage laborer of the world gets. Farmville already begins to feel the thrill incident to the return of the Normalites not that they are all here, lot that some of the advance guard h u arrived and others soon to follow. Farmville never bad suoh a bn si nesa asset, and u to oth er advantage growing ont of the lo oation of the school here, it hard to estimate. Capt. John Agee Booker, of Cum berland, w u here yesterday, and, thonch a Confederate veteran and now 79 years old, has,reotatly or ganized a company for home guard purposes at Cumberland and already has enlisted 85 men and will soon have 100. And he uys,  Well be ready to render aervioe anywhere in Virginia. I have been urging a home guard for Farmville bnc it looksnow that we would have to call on Capt. Booker and hia  boys in oase of emergenoy. I regard the home guard as essen tial for each community, ia these days, when German representatives are at work the world over. I think  Judge Hundley may snap his fiagsrs in the faces of all oritics of his conduct as judge, since the Supreme court has endorsed him. He can reasonably u k for nothing more. Of course, 1 appreciate that newspaper criticism annoy the best of men bnt the man who it criti cised, being right, can defy the world. Mr. James Yonng, tbe town- farmer, is busy filling his silo and has choice corn for the purpose. I dont know a better farmer and I watch him day by day. I was told this morning that Mr. D. M. Gannaway, of Bnckingham, had old primings whioh brought him some nine hnndred dollars. Those primings were worth saving few crops of tobacco bring as much money. I congratulated one of my farmer friends on Saturday, who sold his wheat for 2.90 a bnshal in advance of the day when President Wilson had fixed on that as the minimum prioa. Bather remarkable coinci-"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "over. I think  Judge <mark>Hundley</mark> may snap his fiagsrs"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "over. I think  Judge <mark>Hundley</mark> may snap his fiagsrs"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [583.45, 781.01, 739.29, 852.0], "bbox_id": "272012dfce", "file": "AppomattoxNewspapers_1922-1923a_0142.pdf", "page": 1, "text": "W. L. Brown has been ap pointed by Judge Hundley as Judge of the Juvenile and Domestic Relations . court in place of W. C. Fitzpatrick resigned."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "W. L. Brown has been ap pointed by Judge <mark>Hundley</mark> as Judge of the Juvenile and Domestic Relations . court in place of W. C. Fitzpatrick resigned."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "W. L. Brown has been ap pointed by Judge <mark>Hundley</mark> as Judge of the Juvenile and Domestic Relations . court in place of W. C. Fitzpatrick resigned."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [882.51, 1476.33, 1045.2, 1544.5], "bbox_id": "5968deaebd", "file": "AppomattoxNewspapers_1922-1923a_0182.pdf", "page": 1, "text": "W i l y P . O .  Buckingham County, Va. P h o n e N o. 174. Refer to Hon. T. S. Martin, Scottsville, Va C. J Johnson. Wlngina, Va Judge Geo. J. Hundley, Farmville, Va Fredk E. Notting, Richmond, Va  í . H. Clement, West Appomattox, V a."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Va Judge Geo. J. <mark>Hundley</mark>, Farmville, Va Fredk E."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Va Judge Geo. J. <mark>Hundley</mark>, Farmville, Va Fredk E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [345.84, 239.69, 513.71, 1898.29], "bbox_id": "1b1fb03096", "file": "AppomattoxNewspapers_1918-1922a_0508.pdf", "page": 1, "text": "W ho W ill You V ote F or V ir gin ian s Halifax, Va., Sept. 26th., Speaking before a tremendous and enthusiastic audience -at Halifax this afternoon Con gressman H. D. Flood created a sensation by reading a letter from Judge George J. Hundley, of Farmville, addressed to the chairman of the Democratic S t a t e Central Committee, charging that Colonel Henry W. Anderson, in an address de livered at Farmville on August 30tb, had expressed himself as ashamed of the star in the United States flag which repre sented the State of Virginia. This astounding disclours fell as a thunder bolt upon the voters of the Fifth District who were present at the speaking. The letter, signed by Judge Hundley, the oldest circuit judge in Virginia, was written under date of September 9th. It was in reply to a communi cation from J. N. Brenaman, secretary of the Democratic State Committee. It reads in full, as follows Office of Geo. J. Hundley, Judge of the Fifth Judicial Cir cuit of Virginia. Farmville, Va , Sept. 9,1921. Hon. J. N. Brenaman, Sect. Democratic Committee, Richmond Va. My dear Mr. Brenaman Yours of the 6 th instant re ceived, and I write you, as ac curately as I can, what occur- at the time of Colonel Ander sons speech at Farmville. I note that you say the incident may be used by the committee. I have no objection to your using it,provided it is not based alone upon my statement, for it has been made public. It was published in the Farm ville Herald, and quoted and commented on by the Lynch burg News. I intended that it should be come buplic property, and that there should be no issue of veracity between him and my self, so I repeated to him what he had said, in the presence of the audience, and asked him if 1 had understood him correctly, and he admitted it. He saidWhen he was in the Balkans, trying to help and uplift those miserable people, he carried on the front of his automobile,the American Flag, and the women and chil dren would ccme up and kiss the flag, but that he was really ashamed to let them do this, for he felt that he was practic ing a fraud upon them, to al low them to kiss a flag having upon it a star representing the State of Virginia whose gov ernment was so unrepublican, so despotic, and so disgraceful as that of the State of Virginia. I waited quietly, until he closed, but before the audience dispersed, called upon him to explain thii.t statement, repeat ing what 1 had understood him to say. He did not deny it, but admitted it, with an awkward attempt to explain and which did not explain at all. I did not discuss anything with him but contented myself with Bay ing, Col. Anderson, there are men here who followed the flag of Virginia for four years in the Givil War, and those who fought for that Flag of ours in France, and shed their blood for it, and I want to say for them, that in all our history, there never has been a time, and there never will be a time, whilst the sun shines, that such a thing, as you have said, could be true of the Star repre senting our glorious old State on the Flag of our Common Country. W ith kind regards and best wishes, I am, Yours sincerely, Geo. J. Hundley. Judge Hundley, who presides over the fifth judicial circuit, is a veteran Virginia jurist and a veteran of the Givil War. He has a son, Lieutenant Robert G. Hundley, who saw service on the fighting front in France. Judge Hundley enlisted first with the Albemarle Howitiers, after which he served with the Fifth Vsrginia Infantry. He resigned from this regiment to enter the cavalry, in which arm of the service he remained until the close of the war be tween the states. He was seriously wounded while lead ing a cavalry charge. Lieutenant Robert G. Hund ley, also a war veteran, spilled bis blood in France in defense of the Stars and Stripes. His record was a brilliant one. He served with Company B., 306th Infantry, 77th Army Division with Company F., 120th Infan try, 30th Division, and with Company B., of the 369th New York. This latter regiment was brigaged with troops in the 161st French Army Divis ion, Fourth French Army. Lieutenant Hundley, who is now stumping for the Demo cratic ticket, was deeperately wounden in the campaign offensive on September 30th., 1918. Four major operations were performed on him and for some time his life was diapaired of. He saw eleven months active service in the Western front in France."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "from Judge George J. <mark>Hundley</mark>, of Farmville, addressed to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "from Judge George J. <mark>Hundley</mark>, of Farmville, addressed to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1412.4, 529.9, 1868.36, 736.37], "bbox_id": "93a87df48f", "file": "AppomattoxNewspapers_1912-1915a_0317.pdf", "page": 1, "text": "W hen Circuit Court opened ff f here on the 10 th instant it was I  V    learned th at Mr. E. W. H ubardl ,. ml  H was in Riohmond and not weU   enough to come here, so Judge Hundley designated Mr. Frank 0. Moon to act for the time a s  mi6jim Attorney for the .Commoki I wealth, and all of the crim inal fohdjjjjS 8 leases were continued until f May term of Court. Mr, John I t .  I G arnett, who is oharged with Miöh. No. 1 tiiaothj arnesi, w h o w o u  r 8  u M içfa l i g t t m ix 9 d cutting Mr. Maxey, applied for I l a  i   .A T u A ma U iim r ila w n a a P ti I   Seven Seven"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "come here, so Judge <mark>Hundley</mark> designated Mr. Frank 0."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "come here, so Judge <mark>Hundley</mark> designated Mr. Frank 0."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1330.46, 897.47, 1463.44, 946.61], "bbox_id": "ffb9c6fe73", "file": "AppomattoxNewspapers_1949-1952a_0391.pdf", "page": 1, "text": "Visitors of the Rev. and Mis, I P. Leitner are Mrs. Leitners moth-1 er, Mrs, C. E. Hundley and her is N. Anderson and ft Portsmouth."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Visitors of the Rev. and Mis, I P. Leitner are Mrs. Leitners moth-1 er, Mrs, C. E. <mark>Hundley</mark> and her is N. Anderson and ft Portsmouth."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Visitors of the Rev. and Mis, I P. Leitner are Mrs. Leitners moth-1 er, Mrs, C. E. <mark>Hundley</mark> and her is N. Anderson and ft Portsmouth."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [348.5, 240.14, 512.86, 866.73], "bbox_id": "ed715fc38b", "file": "AppomattoxNewspapers_1922-1923a_0457.pdf", "page": 1, "text": "visiting in Washington and Balti more, is at home again. A goodly number of our people attended the opening of the Exposi tion. It is a little remarkable, if not al together shemefui. that the Board of Supervisors for the Ct unty of Prince Edward should refuse to make an appropriation for a sum mer Normal to be held in Farmville, when Buckingham contributed 100 and other sister counties substantial sums.  The gods help those who help themselves. Picked members of the Normal faculty will have charge of the school and the advant ages will be of the finest sort. No better buildings could have been s leeted for the purposes. Mr. H. E. Wall has announced his candidacy as member of the Board of Supervisors from this dis trict. He would make an ideal member. Mr. W. J. Cox and bride have been visiting in town. Mrs. Dr. Gills has returned from Asheville, N. C. Messrs. Duvall, Son  Co. lost some 1,500 by the recent fire at their storage room. The Farmville base ball boys are making a good record during the season.  Play ball is in the air. Aunt Mary Bland, the oldest colored woman in town, is dea She was a noted cook in her day. At a recent meeting .of farmers wnich was held at Rice, enthusiasm ran high. Mr. E. T. Bondurant lives near there and his enthusiasm is contagious. fudge Hundley in the appoint inent of a Commissioner of tin Revenue will have a long list o good men to select from. Friends of aspirants are profuse in their recommendations, and every mans man is best man. Miss Thompson, of Bluefield, W. Va., is honor girl of this years graduating class at the Normal, and"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "enthusiasm is contagious. fudge <mark>Hundley</mark> in the appoint inent"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "enthusiasm is contagious. fudge <mark>Hundley</mark> in the appoint inent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2174.42, 1141.03, 2339.42, 1407.62], "bbox_id": "f697e3a18e", "file": "AppomattoxNewspapers_1922-1923a_0516.pdf", "page": 1, "text": "Virginia, was brother, Mr. P. week. Messrs. Jeff aud Phil Paulette and Joshua Ha vey expect to visit I Jamestown next week. Mr. Frank Hunter, of Bluefield, visited his home people last week. He was uocomjttnied by his friend, Mr. Buford McClung, Ir. W. W. Farrar and fam ily were the guest of his mother Satur day and Sunday. M . and Mrs. J. J. Farrar visited Mr. and Mrs. William Godsey on Saturday last. What has become of tne Hundley Spring correspondent ? Wake up and give us the news. If all the correspondents were like Farmville the Editor would have to enlarge bis faper."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "has become of tne <mark>Hundley</mark> Spring correspondent ? Wake up"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "has become of tne <mark>Hundley</mark> Spring correspondent ? Wake up"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [489.1, 1098.77, 660.1, 1787.46], "bbox_id": "66d8db0e12", "file": "AppomattoxNewspapers_1952-1954a_0172.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court of Appomattox County. Mattie Leete Paris and Others, Pliantiffs vs. Ossie Leete Christian and Others, Defendants TO.Mattie Leete Paris- JamesM. Leete, DeWitt T. Leete, Norma Leete Coffey- Marjorie Leete Harrell, E. Birch Leete, Clarice Leete San- didge, Lillian Leete, Margaret Leete Bryant, Mortimer U. Leete, Vera Williams Hundley, Elizabeth Leete King, Ossie Leete Christian, Mebel Leete Guinn, Sadie Williams Bryant, Mildred Leete Hudson. The Unknown Heirs, Devisees and Successors in Title of Etna P. Tan ner, Deceased, who are made Party Defendants by the General des cription of Parties Unknown, and W. M. Abbitt, Guardian ad Litem for Parties Unknown, Plaintiffs and Defendants in the above styled suit. You are hereby notified that I have fixed Saturday the 24th day of January, 1953 at 1030 a. m., as the time and my office at Appomattox Court House, Virginia, as the place for taking the several accounts ordered by decree of the Circuit Court of Appomattox in the above styled suit, at the December Term 1952, as follows 1. Who are the owners of the real property described in the Bill of Complaint filed in this cause. 2. What liens are aginist the pro perty, their priorities and by whom held. 3. What is the fee simple and an nual value of the real property. 4. Whether the real property de scribed in the Bill of Complaint filed in this cause is susceptible of partit ion in kind amongst the owners in any of the modes prescribed by law and if not 5. Whether any of the owners is willing to take the whole property and pay to the others such sums of money as their interests may entitle them to and if not 6. Whether the interest of those who are entitled to the subject or its proceeds will be promoted by a sale of the entire subject and division of the proceeds and if so  7. Whether the proper parties are before the court in this cause to en able the court to effect such sale. 8. Any other matter, specially stated, which the Commissioner may deem pertinent or which any party iay request to be so stated. Given under my hand this 12th day of January, 1953. C. W, Smith, Comr. in Chancery. l-15-2tc"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "U. Leete, Vera Williams <mark>Hundley</mark>, Elizabeth Leete King, Ossie"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "U. Leete, Vera Williams <mark>Hundley</mark>, Elizabeth Leete King, Ossie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.28, 1366.64, 1797.82, 1606.83], "bbox_id": "3ea153b88c", "file": "AppomattoxNewspapers_1918-1922a_0164.pdf", "page": 1, "text": "Violation of Liquor Law udge Frank Obristian held I irt here for Judge ilundly  iterday, Judge Hundley be  engaged in tbe trial of a 11 case at Farmville. The following grand jurors re sent to their room W.  Brown, JoelT. Cawthorn, J. Ferguson, B L Wheeler, A . ! Harwood, M. C. Hmitb, C. j Drinkard, W. A Narh and i W. Beale, and renrned five lictments for violations of   prohibition laws. The indicted express them- ves as being greatly sur- eed, that any evidence  jula be presented which j uld make them even appear j violators of the law, aud i U show tbe court and countv June lltb whether they are ilty or not."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Judge ilundly  iterday, Judge <mark>Hundley</mark> be  engaged in tbe"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Judge ilundly  iterday, Judge <mark>Hundley</mark> be  engaged in tbe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.3, 796.55, 988.71, 1083.3], "bbox_id": "5f3a0f7006", "file": "AppomattoxNewspapers_1922-1923a_0041.pdf", "page": 1, "text": "Victorious Appomattox The best ball game ever played her, w .. bat at b a t , go., j  M te Rkh- Friday, when the Appomattox mmd Vtu team clashed with the strong Doss, Robert. Farm ville aggeegation. Farrell j   w., discharged for dis- f or Appom attox hurled the ball ability. _ from the box, while at the rubber McDaniel was hard to Evans, J. D. beat. Manley in the left field I   -tille d at Sailors Creek, and Adam Clement caught Furbush, Henry, flies which set the fans crazy. Foster, YL H. Franklin the heavy hitter land Finch, W. H. ,d oa. one for ,hT bT ! I T   . scoring two runs and finally Flypin, Tyman, transferred, getting home tiring the score Grow, W. A. 3 to 3 But for a surplus I Js. H, killed at Sailors of errors Appomattox would I  Creek. b  have enjoybd a great victory. j. w., died at Castle Thunder. Game was called on acdount Harris, W. M. . 7 _ Hams, Tandy, of darkness. Howard, Wm. The visitors have a good team Hundley, J.R. and a strong pitcher and cooch. Bgdrfck, Goode. Yesterday Red House tried  Hill, J. R., died in 1861"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "have a good team <mark>Hundley</mark>, J.R. and a strong"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "have a good team <mark>Hundley</mark>, J.R. and a strong"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [181.21, 262.62, 349.56, 712.76], "bbox_id": "6bc44822be", "file": "AppomattoxNewspapers_1902-1905a_0167.pdf", "page": 1, "text": "Venner. The farmers are busy saving fet and catting tobacco. The meeting closed at Centenan last Friday- night. Our belovei pastor, Rev. P. M. Dell, of Prospec did the preaching. His sermons  were very much enjoyed by all whoi heard them. Both the. attendance and attention were good. Miss Evie Baker, of Ilinpdeu- Sidney, is visiting friends and rela tives in this neighborhood. Miss Lottie Woodson, who baej been visiting her aunt, Mrs. Richard Woodson, near Hundley Springs, re-, turned to her home not long sinc. Misses Lizzie and Vernelle Price, of Prospect, were visitors at tin home of Mr. and Mrs. Beu Rossrj last week. Mrs. Willie Wilkerson, of SpriDg Creek, was the guest of her father, Mr. D. 0. Womack, last Saturday. Mr. and Mrs. Luther Carwile, of Charlotte, and Miss Edna Price, of I Five Forks, spent Saturday and Sunday at the pleasant home of Mr. and Mrs. J. W. Glenn. - Little Dillard Baker, who had the  misfortune to fall and break his leg some time ago, we are glad to say is much improved under the skillful treatment of Dr. Walker, of Pamn lin City. Mr. Sam Thackston, of Roapok Bridge, visited at Mrs. H. C. Baker!- last Sunday. September 14, 1903."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Mrs. Richard Woodson, near <mark>Hundley</mark> Springs, re-, turned to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Mrs. Richard Woodson, near <mark>Hundley</mark> Springs, re-, turned to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [330.63, 199.56, 497.27, 1186.05], "bbox_id": "1c72628f16", "file": "AppomattoxNewspapers_1905-1912a_0360.pdf", "page": 1, "text": "vacancy occasioned by the promo tion of Mayor Barrow, Mr. W. M .Duvall was elected president of the body and accepted the honor in a speech redolent of thanks and in which he pledged himselt to a faith ful performance of the new duties No general manager for the town was selected at the meeting, but a committee was named to consider and report what was best to be done under the changed conditions of the town since it lias become the owner of all its utilities. Dr. Gills operated on a young man for appendicitis recently and eight days after the opeiationl went to inquire after his condition and found him out in the garden work ing for dear life. They cant beat tnat record at Richmond, John Hopkins nor in luris itself. The council lias pa-sed an ordi nance which will greatly break in upon a.custom of some of our mer chants who exhibit their goods, er- pecially fruits and such like on Main street. They will only be al lowed three feet for such display and that next to the store building itself. It has been the custom to place th y stands on the outer mar gin of the sidewalk where they could be seen by all passers by. Aud then our swinging signs can only be of the length of three feet and to hang eight feet above the surface. FarmvJle will yet be a city, if not in men at least in manners. Editor Hart is relieved that the election is over aud iiu won out. 1 could never understand why any man wants to be Supervisor, and yet some men do love the work, and of course tnis is well as the work must be done and the man in love with his job is bbst apt to attend to it well. Mr. C. B, Cunningham, who lost out in the race for the clerkship, is as cheerful and courteous as ever, aud the Bame kindly aud generous neighbor and friend. He visits more sick-beds of suffering than any other fi re men in ad Farmville. And after all Jeninie Deane, made immortal by Scott, was right when she said it ie not what we dq lor ourselves but what we do for others that will give ths most comfort when we come to die. The maiden spoke in Scotch, amt I marr her words by repeating them in English, and yet not having the book before me I am afraid to undertake the ori ginal. Jndge Hundley has beeu confined to his bed for some days by a sharp attack, but is better as I write. Dr. Irving enjoyed his visit to Boston, though like all ohers .who go to that city for the first time, was disappointed in the historic Com mons. I suffered like disappoint ment some years ago. And yet, bb some one has well said, doctors . should never lose their  patience nomatter how great the provoca tion or the disappointment. Dr. Anderson is looking forward to his visit to California with genuine hopes of a good time, and the madam will Bhare with him the pleasure of the outing."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "the ori ginal. Jndge <mark>Hundley</mark> has beeu confined to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "the ori ginal. Jndge <mark>Hundley</mark> has beeu confined to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1271.5, 775.91, 1567.3, 819.59], "bbox_id": "018e868d16", "file": "AppomattoxNewspapers_1905-1912a_0589.pdf", "page": 1, "text": "v ille Base i3 a ll te a m . S a tu r d a v ON. GEORGE J. HUNDLEY. JUDGS, I ava  - - J OULUruay fct meets Tuesday alter the 2 nd Monday ie v e n in g , July 20th, b e g in n in g a t 2 Member Tuesday utter the 2nd Monday  Oc lo c k . G o m e o n e n n m .  n , chTuesday altet the 2nd Mondayln I , VJUiue o n e , COme a ll a n d uesday alter the  nd Monday In Ju ly. I h a v e a g o o d t im e ."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "v ON. GEORGE J. <mark>HUNDLEY</mark>. JUDGS, I ava  - - J"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "v ON. GEORGE J. <mark>HUNDLEY</mark>. JUDGS, I ava  - - J"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.31, 626.56, 1586.96, 669.39], "bbox_id": "eb9afd1fcd", "file": "AppomattoxNewspapers_1915-1918a_0105.pdf", "page": 1, "text": "UUCK.foiiAM. jaKOBOE J . HUNDLEY. JUDGE. Lets Tuesday alter theSnd Monday Elr- Tuesday utter the find Monday Tuesday at it-i tte Mnd Monday in day after tue . ltd Monday in Sept."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "UUCK.foiiAM. jaKOBOE J . <mark>HUNDLEY</mark>. JUDGE. Lets Tuesday alter theSnd Monday Elr- Tuesday utter the find Monday Tuesday at it-i tte Mnd Monday in day after tue . ltd Monday in Sept."}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "UUCK.foiiAM. jaKOBOE J . <mark>HUNDLEY</mark>. JUDGE. Lets Tuesday alter theSnd Monday Elr- Tuesday utter the find Monday Tuesday at it-i tte Mnd Monday in day after tue . ltd Monday in Sept."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1736.43, 981.19, 1898.16, 1294.29], "bbox_id": "7fdadb3d86", "file": "AppomattoxNewspapers_1918-1922a_0111.pdf", "page": 1, "text": "Upon recommendation of the Board of Supervisors, Judge Hundley has appointed Mr. A. F. OBrien to assess the lands of this county and bis salary will be 6 nor day. We urge the Board to have two assis tants and require them to travel together and lets have one assessment that is fair and properjustice to the county and every tax-payer. Mr. OBrien has our best co oper ation. Mr. John L. Freeman, ot Watseka, Hi., has purchased of Mr. S. L. Ferguson the Old Graupner or John A Rosser place, at Old Court House. Mr Freeman was born and raised in Scott county, Virginia, but has been living in the West for several years, lie is operating a farm there on a large scale, and will probably not move to Virginia for a year or two. He"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Board of Supervisors, Judge <mark>Hundley</mark> has appointed Mr. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Board of Supervisors, Judge <mark>Hundley</mark> has appointed Mr. A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1693.72, 1512.91, 1845.2, 1606.66], "bbox_id": "ed0c9d22ec", "file": "AppomattoxNewspapers_1898-1902a_0566.pdf", "page": 1, "text": "up rattier than stand suit. The chancery ducket has nut bei reached. The ducket, both law amij chancery, is the heaviest for years. Court will probably adjourn on Friday, as Judge Hundley wishes tc so to Franklin on that day to hob. court for Judge Saunders."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "on Friday, as Judge <mark>Hundley</mark> wishes tc so to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "on Friday, as Judge <mark>Hundley</mark> wishes tc so to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [461.28, 1374.9, 591.43, 1684.35], "bbox_id": "e2cf045d26", "file": "AppomattoxNewspapers_1918-1922a_0279.pdf", "page": 1, "text": "Uircu it C ourt e Hundley opened court Friday and left on the Bg train Saturday for The grand jury indicted Is Owen for selling liquor pon his plea of guilty was 50 and given 80 days in motion to suspend the ntence was resisted by Attorney for Common and all efforts of his By were unavailing. Jail pees and no suspensions i insisted upon hereafter Jlquor violations b y the ey for the Common- it is said. Violators of lihibition law will take Mice. In the meantime ren is the first offender law in this county to i jail sentence, indictment was also against John Tweedy jury."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "it C ourt e <mark>Hundley</mark> opened court Friday and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "it C ourt e <mark>Hundley</mark> opened court Friday and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [416.64, 417.36, 556.69, 502.76], "bbox_id": "840e3782d6", "file": "AppomattoxNewspapers_1918-1922a_0621.pdf", "page": 1, "text": "UioB Dorothy Hundley, oi vncbburg, has been visiting ends here. Everybody who tries Tanlac  Bomething good to say out it. Cbas F. James. I A d old darkey  Rachel"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "UioB Dorothy <mark>Hundley</mark>, oi vncbburg, has been visiting ends here. Everybody who tries Tanlac  Bomething good to say out it. Cbas F. James. I A d old darkey  Rachel"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "UioB Dorothy <mark>Hundley</mark>, oi vncbburg, has been visiting ends here. Everybody who tries Tanlac  Bomething good to say out it. Cbas F. James. I A d old darkey  Rachel"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.12, 578.98, 1561.35, 595.51], "bbox_id": "3fd89e9f92", "file": "AppomattoxNewspapers_1915-1918a_0074.pdf", "page": 1, "text": "UChii-AM. HUE J, HUNDLEY, JUDGE."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "UChii-AM. HUE J, <mark>HUNDLEY</mark>, JUDGE."}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "UChii-AM. HUE J, <mark>HUNDLEY</mark>, JUDGE."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1688.39, 642.95, 1849.94, 907.27], "bbox_id": "a02f519c7d", "file": "AppomattoxNewspapers_1905-1912a_0350.pdf", "page": 1, "text": "U ro w n in g -L e e . At high noon on Saturday, June 3rd, at the home of Mr. J. R. Lee neat Hundley Springs in this County, a beautifnl wedding was solemnized. The contracting par ties weie Mr. Aubrey Browning, and Miss Eva Kathleen Lee. MisR Li e is the attractive daughter of Mr. Jar. R. Lee, of this county, and Mr. Robert Anbrey Browning is the son of Mr. R. H. Browning, also of this county. After the ceremony an old fashion Virginia dinner was serv d to the bridal party, and a irge number of friends. Mr. and Mrs. Brown.ng left on the five oclock train for Rich mood and other points, and on their return will reside at the home of the grooms father at old Appomattox Court House."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "J. R. Lee neat <mark>Hundley</mark> Springs in this County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "J. R. Lee neat <mark>Hundley</mark> Springs in this County,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1407.09, 451.16, 1571.04, 552.34], "bbox_id": "0649ac5185", "file": "AppomattoxNewspapers_1912-1915a_0506.pdf", "page": 1, "text": "U l U k U T O K Y . C ourt . n r x a JU D IC IA L CIRCUIT flOM. ono. J HUNDLEY, JU D G E, FARM V ILLE, VA. Appom attox First day of April, June Ootooer and Deoember. CharlotteFirst Monday in January, March May. July, September and November. CumberlandTuesday after the fourth Monday in January, April, .September and Novemour. Prince EdwardTuesday after the third Monday in January, M e-, September and November."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "CIRCUIT flOM. ono. J <mark>HUNDLEY</mark>, JU D G E,"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "CIRCUIT flOM. ono. J <mark>HUNDLEY</mark>, JU D G E,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1399.71, 525.81, 1557.83, 584.51], "bbox_id": "381a8fb5e9", "file": "AppomattoxNewspapers_1912-1915a_0510.pdf", "page": 1, "text": "U L K ltO T O U l. DOUBT. I f TH JUDICIAL CIRCUITHOW. GEO. J  HUNDLEY, JUDOS F ABM V ILLS, VA ffippomattoxFirst day of April, June Eoher and December.  _ . barlotteFirst Monday in January, Mprch"}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "JUDICIAL CIRCUITHOW. GEO. J  <mark>HUNDLEY</mark>, JUDOS F ABM V"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "JUDICIAL CIRCUITHOW. GEO. J  <mark>HUNDLEY</mark>, JUDOS F ABM V"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2370.51, 1371.36, 2537.74, 1438.76], "bbox_id": "7a659a5a89", "file": "AppomattoxNewspapers_1922-1923a_0172.pdf", "page": 1, "text": "U iii iI,Mtrlie Jawfcborn. from Mikeis,the guest of his cousin, Mies Eva Lee this week. I Mr. C. R. Ferguson and wife made a flying trip to Hundley Spring test week from Evergreen"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "a flying trip to <mark>Hundley</mark> Spring test week from"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "a flying trip to <mark>Hundley</mark> Spring test week from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1302.71, 529.17, 1425.71, 571.42], "bbox_id": "6470d9aeaf", "file": "AppomattoxNewspapers_1912-1915a_0281.pdf", "page": 1, "text": "U C C hi-v AM. J. HUNDLEY, JUDGE. 6 Tttt8 LfjiueflW u  tlieänd Mondan U te J n d M o n d a y i n a M o n d a y in MotiUay m 6t.pt,"}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "C hi-v AM. J. <mark>HUNDLEY</mark>, JUDGE. 6 Tttt8 LfjiueflW"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "C hi-v AM. J. <mark>HUNDLEY</mark>, JUDGE. 6 Tttt8 LfjiueflW"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1770.92, 209.56, 2089.01, 371.05], "bbox_id": "4bb0cf5f47", "file": "AppomattoxNewspapers_1915-1918a_0586.pdf", "page": 1, "text": "two children are down Mist led home, after a visit to Lynch- Louhie Gills and Teddy Gills I burg and to Norwood, are stricken Mrs Cliff Mann is The Bad intelligence reached aick Miss Virginia and Joe here on last Thursday of the Ferguson are sick Mrs. T. W Plhert Beasley, one of and Mrs. C T. and Miss Nettie Iour j  -io was fighting for Moses are sick at J. O OBrien   over there. He was kill wife and children and sick. led in action on Sept. 0. It is a Miss Lougenia Patteson is consolation to know that be recovering from the flu  All I died for a great cause, namey, the sick at Mr. W. B. Oald I that of democracy, wells are reported batter Mrs. I Mrs. M. A Harvey spent Sun J- C. Hundley and family a r e  day with her mother, Mrs. Ty also reported better"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "spent Sun J- C. <mark>Hundley</mark> and family a r"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "spent Sun J- C. <mark>Hundley</mark> and family a r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [145.9, 659.08, 468.6, 956.62], "bbox_id": "dada6e9776", "file": "AppomattoxNewspapers_1902-1905a_0433.pdf", "page": 1, "text": "TUG RECORD. How short a time since we last greeted yon with New Year resolu tions. The record for 1904 is closed, that for 1905 has just begun. Cat we not profit by the experience of I the Buckingham jail, past years and make the record, bet- now confined in the Prince Edward ter -lor 1905? Let the effort be 1 jail made at leas1 it is far better to trj I Chas. J. Forhes who is also and fail than never to have made an I charged with the burning will not hone.t effort to do better. We have I be tried before the 18th instant tried to give our friends a good Witnesses have been recognized to paper, worthy of the support t of a I appear on that dpte, noble people, bat we admit that we Judge Hundley who is presiding have often failed to do our full over the court is doingjall he can to juty_ I dispatch tne trial, and be sent the The response to our call for finan-1 Prince Edward Sheriff after wit cial aid from onr subscribers is I ness Sutherlin who resides in A1 being promptly and generously I bemarl - county and also directed - a  I . L . Ot.AM.jy Ltal n m A I IvAavirt wl made. We are encouraged in our work and T hb T imes will be fnrth er improved. We again invite all the people of Appomattox and Buckingham to use the paper as a weapon of defense of their civil"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "admit that we Judge <mark>Hundley</mark> who is presiding have"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "admit that we Judge <mark>Hundley</mark> who is presiding have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1659.35, 493.88, 1831.3, 1677.28], "bbox_id": "15bf29c3c5", "file": "AppomattoxNewspapers_1902-1905a_0081.pdf", "page": 1, "text": "TT B uckingham . What interests the people shonld interest the Times, and I believe it does. Although the election has been had on the question of liquor or no liqnor and the people have-un- mistakably said Mno liqnor, the liqnor element, I am informed, is dispeed to have the election nulli fied. Shonld this be so ? . Nay, and even though it is done thanks to the Mann bill we are still fortified fori cant conceive bow a man cond so far forget his manhood and gentle manly instincts as to vote dry and yield to the persuasion of a would- be barkeeper and put his name to a petition asking for the sale of liqnor. And eyen though a majority of the citizens of Maydville district should sign a petition asking that license- be granted a certain petitioner, the fact that tbe unbiased vote of the district has been recorded against the sale of liqnor therein should not be without its weight. We are glad tqi report that Mrs. Dr. Nowlin, who was quite ill a few days since, is very mnch improved A. 0. Garnett, Jr., the II, an aged newcomer of the extreme age dfllf days, now on a permanent visit.at tbe home of his prood parents, is doing nicely. We are glad tosay that his mother, who has been quite sick, is improving. Mr. H. 8 . Goodale, who has been boarding at the Fisher hotel for,the past thrsè years, leaves today fondu far-off Massachusetts home. We are sorry to give Mr. Goodale np, and really hope he will come back to us again. We are aocustoined to look upon him now aa one of onr towns men. He carrier with him our best wishes. Mrs. Swell Morgan, of Bedfort City, together with her two little giris, is on a .visit to the home of her, parents, Mr. and Mrs. J . H. Noble, of this village. We are glftd to, learn thàtiMrs Lizzie Fwbeswhoahas . 8 gffgnedtto many relapsesdokhrg  hen Wickmess is improving. The Board of Supervisors meets today to considei the prpposttianoC employing assistant counsel rto resist the county-appreqpriatioa to the building of therhridge,eross the river at Wingina. Kt is to be hope that the county legislatore wil not plce itself ia she attitude of resisting erection of this public necessity imply beeauBe all The dis tricts of the county will n e t be directly becivffÉed. T bito Can uo suGoeeefnli contradiction that James Btvèr district is in actual need of thisbridge. Thè orossingLthat joint is now beoomiug hazardous as many accidéhts  have happened at that point recently. Will the other districts of the comity.refuse to tbis tbe .largest district in. the county thonly bridge she bee-ever asked atrthe hands of the county ? Jt is qnfair to these people. Although the 25 th is the. appoint ed day for the commencement of Circuit Court, we are informed by the clerk that Judge Hundley will, hot be Able to i each here to com mence court tiH Monday, tbe.2?tb. We learn that Mrs. Col. James Lyons, who has been quite sick, for awhile is improving. Owing, I dare say, to the sudden changes in the weatber there .aeons to be an u d usual-amount of siieknes around here. There seems to be al most an epidemic of insanity judg, injg from the number of sufferers that have been brought to the couutv jail within the -last two or three months. Mrs. P. L. Moseley and daughter left yesterday for Lynchburg, where she goes to consult a specialist."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "the clerk that Judge <mark>Hundley</mark> will, hot be Able"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "the clerk that Judge <mark>Hundley</mark> will, hot be Able"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.08, 745.71, 2078.2, 1072.51], "bbox_id": "c4f16a171e", "file": "AppomattoxNewspapers_1915-1918a_0078.pdf", "page": 1, "text": "tt  i tiKiavTd 8 Òn?pptÌ-1 hunting trip to Buckingham. Mr. Bryant Ferguson, who e sides near Vei million, died this __ uiorning. He was about 65 yrs Cornelia Gils, Annie Purdum, of age and had been ill for some jflb BaLcock, Lucile OBrien, t me. -  Gladys Agee, Kathleen Morgan ________ Little- Edward Galliab, while I Nettie Moses, Mary Tayor I 0rganiztiou until 1891, when playing on a pile of lumber last ! dilla, Jamsie Ferguson. the resigned and retired from Friday, caught hiB foot and broke I Six grade Clemmie Gun er,  acjye business. Lee Giles, Angus Feen, Regi ma 1 Stanley. Fifth gradeWilliam Burke, Elmer Smith. Boscoe Burkey, Avis Brow n,. Evelyn Brown, Noia Burkey j Vera Morris, Ruby Walton. Fourth gradeGeòrgie Inge, Jude Hundley held bis regolar I John C aroli Stanly, Charles rm of the Circuit Court here last Robinson, Orote D rinkard... . gerved bu . . sheriff d . m . worn, po.oaice J week. Very little court work was j anet Austin, Julia F e r g u s o n , ! .   that  pacit   sheriff-jotmG.Mtuer, poBwutoej disposed of. A few chancery r-1 Mary Rucker. Bessie Harwood, I tbirty-seven years  He w couuty-w. J. Hutorn. poBtomeejders and decrees were entered. Nannie Carter, Esther 8cheff0 iginally amemberof Marshall m -G . M. Bosera, posfoinee His Honor, George J. Hundley Her. Myrtle Smith. lodge o f,Masons, leaving that ey for tae commonwealth-. w .hHg been de8lgnated by the Gover Third grade-L yle M c D e a r - 1 at tbR time of tbèo ani. noi to nold Court for Judge West. I man, Arthur Robertson, Oto Our Judge will have a t at of thelGodsey, Luther Godsey, Lewis real Hopewell side of the docket. I McDearmon, Nettie Harvey,"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Fourth gradeGeòrgie Inge, Jude <mark>Hundley</mark> held bis regolar I"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Fourth gradeGeòrgie Inge, Jude <mark>Hundley</mark> held bis regolar I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [304.51, 431.13, 471.11, 737.4], "bbox_id": "f4303637ff", "file": "AppomattoxNewspapers_1912-1915a_0145.pdf", "page": 1, "text": "Trial Set for June 19th. Buckingham , Va., May 13  The case against Mott Glover, charged with killing young Meade Hanes on the 5th day of I May, w h s called in the Circuit Court here today and the 19th if June was set for the trial to begin, a t which tim e Judge Hundley will hold a special term of tbe Circuit Court here Congressman Flood and Sena-1 tor Gayle will appear for the I lefense and Commonwealths Tttorney E W. Hubard will be I assisted in the prosecution by Mr. Aubrey E. Strode. I t was clear from w hat wa3 said ini court the defense will try to I prove th a t Mott Glover w as in-  sane a t the tim e of the shoot ing. Congressman Flood and Mr. Aubrey E. St ode are both here todav. Jam es H ardin was tried ini the Circuit Court here todaj charged with cutting a colore boy named Joe Spencer and was acquitted.  Lynchburg  News."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "which tim e Judge <mark>Hundley</mark> will hold a special"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "which tim e Judge <mark>Hundley</mark> will hold a special"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1336.81, 675.6, 1462.2, 696.35], "bbox_id": "2c0e60416a", "file": "AppomattoxNewspapers_1902-1905a_0057.pdf", "page": 1, "text": "Trany Martin is sick at her tear Hundley Springs."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Trany Martin is sick at her tear <mark>Hundley</mark> Springs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Trany Martin is sick at her tear <mark>Hundley</mark> Springs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [324.96, 1077.53, 485.03, 1722.51], "bbox_id": "13290ae2c5", "file": "AppomattoxNewspapers_1902-1905a_0429.pdf", "page": 1, "text": "traded a good horse while grossing creek. Judge Hundley has shown himself to be a firm.lover of law an order  and in all of hismilings he has shown a disposition to  hew tr the line, mid let the chips fall where they may. And we severely mis judge the people of this county they are unappreciative of such judiciary after knowing it to be such, Mr. J. G. Suoddy and family left today for their new home at Red Spring in North Carolina. We will miss this family from our midst Mr. and Mrs. Snoddy were reared our midst. Their children wer reared herb and we feel that they are a part and parcel of our com munity. We part with them with sincere regrets. May their new home be pleasant and happy It is pioposed to organize a branch of  The American Society Equity among the farmers of this county, for the benefit more par tic ularly of the crop producers of the county. It is hoped that by concer of action among the farmers with view of discouraging the sale  farm products, at a price below the cost of production, the price of all produce from the farms may greatly enhanced. We welcome any reform or action that will result the benefit to this class of citizens. They are truly the bone and sinew of the nation. Dr. H. 0. Forbes is now at the home of his father, Mr. P. A. Forbes, our popular county clerk, preparing himself for that most important event in the course of a young physi cian who contemplates the practice of medicine in the stale of Virginia, nam ely the examination by the s-tate examining board. Elsewhere in these columns will be found an account of an impor tant invention by Dr. W. M. Wade, who istoo well known to the people of this county for me to attempt to introduce. We wish Dr. Wade reat success in the introduction of his valuable invention. Mr. W, W. Moseiy and his frier.d"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "while grossing creek. Judge <mark>Hundley</mark> has shown himself to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "while grossing creek. Judge <mark>Hundley</mark> has shown himself to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [312.25, 178.38, 479.6, 537.57], "bbox_id": "8259a0ab23", "file": "AppomattoxNewspapers_1912-1915a_0393.pdf", "page": 1, "text": "town and the structure was entirely consumed. Foitunately he had used the ice and still has another house well filled. Please say to my Appom ittox critic that I am feasting on canta loupes for breakfast and corn field peas and tomatoes for dinner. The mortal who thus feeds and isnt haDpy is a profound pessimist. Judge Hundley and Mr. J. F. Walton have gone to the Craig Heal- ing Sp.ings for recreation. La-a season they were fed on canned goods while there bnt are assured this time of fresh vegetables and all manner of table luxuries. No man can afford to leave Farmville just now to eat out of cans. Complaint is being made of the noise made during the night by the running of the new fire-story mill erected by Mr. T. A. Gray. I re gret that the hum of industry dis turbs anybody, Sleeping as I do out in the wide open country I en joy an  otium cum dig without jai or jostle. I have tender pity for town folks any how. God made the country and God made man."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "a profound pessimist. Judge <mark>Hundley</mark> and Mr. J. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "a profound pessimist. Judge <mark>Hundley</mark> and Mr. J. F."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [495.35, 1333.61, 812.41, 1474.52], "bbox_id": "df9bd79ad2", "file": "AppomattoxNewspapers_1918-1922a_0616.pdf", "page": 1, "text": "Total - ------------------------------------------------ .535.40 Officers Salaries Joel W. Flood, Commonwealths Attorney ______________________  600.00 H. W. McKinney, Sheriff and Jailo r ______________ v ___________ 628.00 H. W. McKinney, Probation Officer _________________ _ ______ t _____ 100.00 G. W. Smith, County Clerk ___ _ ________ _ _________________ H l OOOioO C. W. Smith, Clerk of Board of Supervisors and road work _______ llO.OO W. H. Ligon, Supervisor ___________________________________ 108.00 L. E. Smith, Supervisor ________ _ ____ _ _________ ____________ 97.60 S. E. Anderson, Supervisor _________________________________ 115.20 R. T. Phelps, Overseer of Poor ____ __________________________ 2o!oO D. P. Ferguson, Overseer of P oor___________, ______ _ _ H U _ _ 2010 S. G. Harvey, Overseer of P o o r _____________ v ________ .......V 20.00 D. L. Martin, Janitor Clerks Office___________I,___________ _ ___ 24.00 E. R. Abbitt, Commissioner ReVenue, extending levies, c _______ 1,509.82 Geo. J. Hundley, Appomattox countys part of Sy __________  ____ 211.76"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "c _______ 1,509.82 Geo. J. <mark>Hundley</mark>, Appomattox countys part of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "c _______ 1,509.82 Geo. J. <mark>Hundley</mark>, Appomattox countys part of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1279.65, 732.12, 1725.84, 787.25], "bbox_id": "6a62512454", "file": "AppomattoxNewspapers_1902-1905a_0245.pdf", "page": 1, "text": "tom 9 nndCu,aietV riiaybevoid- 1 The depth of our snow which fell usual custom. This remedv is used by many h a8t Thursday is 9 inches. The Certificate of qualification of nds of mothers and has never gcboo,g cloge or tbe week, but Judge Hundley before Hon. B. R. known to fail If ls aa  m08t 0f them are at work again. Wellford, Judge of Circuit Court of nlv remedy that can always pe t w .  Richmond was entered here for his"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "tbe week, but Judge <mark>Hundley</mark> before Hon. B. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "tbe week, but Judge <mark>Hundley</mark> before Hon. B. R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1603.24, 233.09, 1760.09, 603.84], "bbox_id": "bd7ca1530e", "file": "AppomattoxNewspapers_1915-1918a_0478.pdf", "page": 1, "text": "to vote. Mr. J. F. Purdum is on a vis it to relatives in F ittsburg and Maryland. Mr. T. W. Odor has finished his nice residence near here and moved in. Mr. Clarence Hundley, of Pittsburg, Pa , is visiting his mother, Mrs. J. 0. Hundley, here. Preaching at the Presbyteri an church on Sunday morning. Sacrament of the Lords Sup per will be observed. Sportsmen are in tbe field and many birdsthe farmers friendsare falling prey to their unerring and deadly aim. The Virginia Annual Confer ence of the Methodist Episoo- oal church will meet in Lynch- on Nov. 14tb. Still time to put in wheat, and be certain to have a small patch of rye for grazing and early spring feed. Do it now, farmer. Messrs."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "moved in. Mr. Clarence <mark>Hundley</mark>, of Pittsburg, Pa , is"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "moved in. Mr. Clarence <mark>Hundley</mark>, of Pittsburg, Pa , is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [325.19, 182.07, 814.95, 406.58], "bbox_id": "0ab84ecbfd", "file": "AppomattoxNewspapers_1912-1915a_0199.pdf", "page": 1, "text": "to me that so many peop!e go abroad carrying in their bodies seeds of this iusidious disease, utterly uu- concious of the fact. I am not in sympathy with all modern day scientific fade, and yet I am glad to know that the doctors are on the bunt for disease aud when they find it, are prepare i to treat it News from Judge Hundley at the Springs is to the effect that heisim proving. Mrs, Hundley, who was with him, is at home again. Mr. John F. Walton, one of our most successful merebauts, encour aged by reports from tbe Judge, will join hiio. i a0haS been used in the State of Virginia"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "it News from Judge <mark>Hundley</mark> at the Springs is"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "it News from Judge <mark>Hundley</mark> at the Springs is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [153.84, 1478.6, 504.62, 1802.66], "bbox_id": "9680306445", "file": "AppomattoxNewspapers_1905-1912a_0265.pdf", "page": 1, "text": "to his interest to spend the rest of S u n lig h t Co., the winter in that State. In the L y n c h b u rg , V a. early spring he will return to re- G e n tle m e n Y o u m a y sen d sume bis practice. m e fu rth e r in fo rm a tio n in re - Dr. Paulua A. Irving has recently g a rd s to been appointed Secretary of the ............ Acetylene Gas., Medical Society of Virginia to fill a ............ aeo me. n J o  put 2 in front of one you are interested In. I ft vacancy occasioned by the death of the late Dr. Landon B. Edwards. Cashier Thornton of the defnnet Charlotte bank was in town on last Friday with his counsel to renew his bail bond before Judge Hundley. One of our county officials, who perhaps knows the county better than any other citizen insists upon it that the census man did not do justice to the county in reporting that there had been a loss in poru- latioa during the last decade, while many of the people of Farmville re perfectly s-.ttisfiel that we have four instead of three thousand peo jrito. The farmers tell me that the re-"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "bail bond before Judge <mark>Hundley</mark>. One of our county"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "bail bond before Judge <mark>Hundley</mark>. One of our county"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2028.91, 1513.52, 2161.98, 1584.22], "bbox_id": "574d035564", "file": "AppomattoxNewspapers_1933-1936a_0143.pdf", "page": 1, "text": "to Front store opens here. - Frueman and family, of 111- nove to Old Ccurt House, i Ro He Hundley and Dr. T. .nes married. tly W. Hunter, age 61 died Lome near B nt Creek. Construction"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "House, i Ro He <mark>Hundley</mark> and Dr. T. .nes"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "House, i Ro He <mark>Hundley</mark> and Dr. T. .nes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.77, 1396.11, 1738.42, 1483.38], "bbox_id": "6675442ff3", "file": "AppomattoxNewspapers_1902-1905a_0470.pdf", "page": 1, "text": "To Cure a Cold in One Day Take Laxative Bromo Quinine Tab lets. All druggists refund the money if it fails to cure. E. YV. Groves signature in each box.. 26c. BucKingham County Officers. J Hundley, Judge. J B. Gilliam, Treasurer. Williams, Sheriff. wealthHubard Attorney for the i omraon"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "BucKingham County Officers. J <mark>Hundley</mark>, Judge. J B. Gilliam,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "BucKingham County Officers. J <mark>Hundley</mark>, Judge. J B. Gilliam,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.18, 1460.34, 1727.7, 1651.51], "bbox_id": "bbcf22bb5d", "file": "AppomattoxNewspapers_1902-1905a_0466.pdf", "page": 1, "text": "To C ure a Cold in O ne D av la k e Laxative Bromo Quinine Tab lets. All druggists refund tin money if it fails to cure. E. W Groves signature in each box. 25c. N otice to S tonew all T a x p a y e rs I have in my hands for collection the tax tickets for Stonewall Dis trict. Please have the money ready for me when I call. BucJrlttghain C ounty Officers. George J. Hundley, Judge. J . B. Gilliam. Treasurer. Wm. Williams, Sheriff. wealthHubard- atto rn ey for the C omraon- . M.C. Elcan. Commissioner of Bevenue. Dis- tn e t No. j . DtLNo.t1 Cmml8al0ner 01 Reve P. A, Forbes, Clerk, Board of SupervisorsP. A. Grlkir Alexan. der Forbes, Allle C, Wood, B. F. Nuckota L, Layne and Forrest Guthrie."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "ounty Officers. George J. <mark>Hundley</mark>, Judge. J . B. Gilliam."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "ounty Officers. George J. <mark>Hundley</mark>, Judge. J . B. Gilliam."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [309.34, 329.77, 474.8, 722.37], "bbox_id": "17dd9ff2b6", "file": "AppomattoxNewspapers_1912-1915a_0291.pdf", "page": 1, "text": "Tne January term of the Circuit Court is in session and as this is written the oase of Allen Bros vs. Norfolk  Western is on. Dam age of 12,000 are claimed for di- ersion of water from their mill near Prospect. Messrs. McCormick and Kirkpatriok appear for the defend- -tnt company, and Mr. Coleman, of Lynohburg, and Mr. Wall, of the local bar, represent the plaintiffs. Other case8 of more than ordinary interest may be tried. Judge Hundley is nnmoved by the honor of being re-elected without opposi tion. The grand jury, at this te rn, presented to the judge the names of a number of Prince Edward mer chants who, in their opinion, had tailed to give a full statement of purchases made by them. They will appear at an adjourned meet ing of the body to make each ex planations as they desire. Talking with one Farmville merchant n the subject ho said, I keep accu rate account of all goods bought and simply add up the figures when I make retnrn to the commissioner. This seems to the average being the only safe and method of keeping the matter straight."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "may be tried. Judge <mark>Hundley</mark> is nnmoved by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "may be tried. Judge <mark>Hundley</mark> is nnmoved by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1670.15, 1311.99, 2182.67, 1416.79], "bbox_id": "7be3c32791", "file": "AppomattoxNewspapers_1943-1947a_0348.pdf", "page": 1, "text": "ties in the Navy than are now a- ed to his base at Memphis, Tenn.,  Sff?e i5?a,Views  Pamplin Mrs. vailable in civilian life, according after spending a furlough with . e mallory, o. Fries, and one to a statement made by Chief his wife and relatives. He is with rs- Tilda Messer, of North Hundley of the Navy Recruiting the Air Transport Command. j Carolina. Station in Lynchburg. Chief Hund- - - ------------- Funeral services were held from ley went on to say that first en-  u c r - u in n _____ Piney Ridge Methodist Church on lstmertts and . rjc-enlistments in H s  REPORT  Sunday afternoon at two oclock, the Navy through his office have , . , . . 7 . . . . . .  conducted by Rev. J. S. Moore, increased at a rate of almost 100! T , igh school Jield its pastor of the Pamplin Baptist per cent since the first of Janu-1regu ar Tci ap1 pr ral? TJanu Church. Interment was made in ary. Piay Ri.dge Church cemetery,"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Tilda Messer, of North <mark>Hundley</mark> of the Navy Recruiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Tilda Messer, of North <mark>Hundley</mark> of the Navy Recruiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1350.24, 783.97, 1477.23, 818.36], "bbox_id": "a7b2a3c4eb", "file": "AppomattoxNewspapers_1905-1912a_0508.pdf", "page": 1, "text": "ti. OKOItGB J. HUNDLEY. JUDGE. b eets Tuesuav .i m r the 2nd Monday ber Tueadu a ..o r the 2nd Monday h 1ueBday a lei tl.e 2nd Monday in esday al te r tile lid M onday in J u iy ."}, "highlight": {"text": {"matched_tokens": ["HUNDLEY"], "snippet": "ti. OKOItGB J. <mark>HUNDLEY</mark>. JUDGE. b eets Tuesuav"}}, "highlights": [{"field": "text", "matched_tokens": ["HUNDLEY"], "snippet": "ti. OKOItGB J. <mark>HUNDLEY</mark>. JUDGE. b eets Tuesuav"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2212.83, 439.34, 2380.1, 499.58], "bbox_id": "547f1eb16f", "file": "AppomattoxNewspapers_1954-1955a_0083.pdf", "page": 1, "text": "Three girls from the Appomattox area were among the first residents of the newly-completed womens dormitory at Lynchburg College, Hundley Hall, which opened for the first time this month."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Three girls from the Appomattox area were among the first residents of the newly-completed womens dormitory at Lynchburg College, <mark>Hundley</mark> Hall, which opened for the first time this month."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Three girls from the Appomattox area were among the first residents of the newly-completed womens dormitory at Lynchburg College, <mark>Hundley</mark> Hall, which opened for the first time this month."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [298.55, 545.69, 473.99, 1522.37], "bbox_id": "088834d932", "file": "AppomattoxNewspapers_1905-1912a_0219.pdf", "page": 1, "text": "those men who requires no watch ing. And he has bought a farm which he is having profitably worked while he works for another. The one mistake he has made in life  b in not having married. Some good woman is entitled to just such a husband as he would make. And all such men should be taxed by the State into marrying. If they will not support one woman they should be forced to support at least two. Rev. W. E. Hill, pastor of the Presbyterian cbnrch, enjoyed his visit to Appoma.tox, and speaks often and kindly of bis reception and tle generous hospitality which was dis  meed by her good people. Rev. Fugste, of the Baptist church, conducted a meeting of two weeks at bis church and did all the pi caching. His congregations were large and the people heard him gladly. Rev. Green, of the Methodist church, has only been here for one year and I presume Conference will return him. And the same is true of tho presiding elder, Rev. Dad- man. The town council at its last ses sion refused the application of the overall factory managers to ereot frame structure within what is cal led the  fire limits of the town They wanted to build ou ast Third j Stree, one square from Majn. They may now decide to e net a brick building or else select auother site. The arbitrators who have in charge the que tion of tho value of the water and sewer Bystems of th town have b on heald from and will hold a meeting at an early day. This is a matter of great import ance as many new buildings are ready for the conveniences. Of oourse the  Qld Reb, Capt, S. VV. Parilett, attended the re union of the Confederate Veteran at Norfolk, and those of us who know him will not admit that any other sounded the yell more vig orously. His euthusiaBm as a Con federate he never uses the ex kuows no abatement, no relaxing. And if  Bob Miller had gone with him Norfolk would not have held them. Our race track is kept warm these afternoons as the Sir Knights and he racers prosecute he practicing for tho days of teat. Appomrttox must come to the Fair with best si iipies of corn aud tobacco. The premiums are wortn tho inning and then a good time is promised. And the oysters will be flue. Judge Hundley held an adjourn ed term of the Circuit Court but no matters ol general interest were heard. With the derarture of the oorn field pea aud the toasting ear the sweet tater has the right of way, and the butter be u is still iu the ring. Speaking of the butter bean reminds me that I read recent ly of a Pennsylvania trucker who sold 165 worth of lima beaus, as they call them from an eighth acre of land. Why not cultivate one acre and rest on results."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "will be flue. Judge <mark>Hundley</mark> held an adjourn ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "will be flue. Judge <mark>Hundley</mark> held an adjourn ed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [372.5, 196.87, 538.39, 1714.25], "bbox_id": "31717b6ee9", "file": "AppomattoxNewspapers_1905-1912a_0387.pdf", "page": 1, "text": "this Senatorial district. No speeches being made, no treating, no barbe cues, no attendance upon  big mee - ings, and if there is any kissing ol the babies it is so quietly done that the smack isnt beard across the room. Two of our policemen are six ieet till, and that which the third one lacks in reaching upwards he makes up in rotundity. The summer boarders we have with us this season have been sing ing the praises of Farmville weither for Che past few days, but up to that time had been insisting tnat the tropics were cool in comparison. And it w hs hot. Two new residences are going up on the Serpell heights, and seven more lots have been sold upon w.hich the parties purchasing are ex pected to build. It may not be long before those acres are thickly dotted over with dwellings. Aud Mr. Ser- peil will not be satisfied until the factory sites are also occupied. The N.  W. seaside excursion was not largely patronized by Farm- vilie folks. The fact is the most of us are so well saiisfied with our homes aud our work that ordinary inducements fail to move us. 1 hope it will not be inti mated that we remain here because we are not able to pay the freight. Mrs. H. E. Barrow and some of the younger of t e children, Mr. and Mrs. A. M. Barr w and child, are at the Pulaski Alum. Mrs. and Miss Tabb ar9 touring in Canada and visiting Northern summer resoi ts. Mr. and Mrs. D T. Elam are at home from the mountains. Mrs. W, W. Jackson and daugh te r are at Mi iuii tain Lake. Mrs. Jas. A. Armiste d is h I bo there. Mr. and Mis. Creyke aud the  baby of Washington, are guests in the home of Mr. R. H. Paalett. Mr. J. L. Bugg has returned from his visit to Auiston, Ala. Mrs. Nannie Hatchett, who is visiting friends in Crewe, was taken suddenly ill on yesterday, and Dr. Gills, who was called to her bedside in consultation, reports her condi tion as 8 irious. Mrs. W. C. Burnet, of Savannah, G a, is visiting in the old home. Miss Lottie Linwood Whitlock became the bride of Mr. Shields L. Layne on the evening of the 27th, and the marriage was periormed at the Presbyterian manse, the pastor, Rev. W. E. Hill, officiating. Judge Hundley writes from the White Sulphur that he is steadily regaining his strength Tne burning of the Cumberland Planing Mdl is much to be regretted, but Mr. Stuart is a man of enter prise and will no doubt come again. Farmville has b en leo.dving large quantities ol lumber from the plaut. The Garland  Martin Insurance Ageucy carried a policy of 2500 ou the property. -I have not been ad vised of other insurance and as the loss was a total one this by no means covers it. At the last shoot of the Gun Club Dr. Gills and Mr. Ogburu divided honors for the weekly medal. It is reported that Mr. W. S. Gar den, ef Prospect, is raising an In dian Ruboer Du  k which he be lieves will sweep t ie market. 1 await with interest for a bite. Dr. Holladay and Editor Hart dined on yesterday at the home of Mr. R. W. Fuqua, and report his crops looking much better than they expected to fiud them. Friend Fuqua is a fine farmer but has been somewhat scared over crop condi tions this season. Mr. D. T. Elam, who rode recent ly through the Rice neighborhood, report tbe crop out-look as good. Prof. Jas. R. Thornton died at his home at Hampden Sidney on the 27th of July, after long and distress- i ig illnes?. H - lea es a widow, and bvothe-, Prof. VVf. M. Thornton, of the faculty of the Uuiversi y of Vir ginia, and cue of ihe leading mathe- mariciams of the couutry, and a host of friends to mourn him. Prof. Thornton was a model man,model in all that constitutes true mauhood, as modest as a woman, and yet in presence of duty as immovable as was the immortal Stonewall. He was the idol of the students he taught, honored and beloved by all who knew him. His father, the late Col. J. T. Thornton, received his death wound on the bloody field of Sharpsburg, but a noble mother lived long enough to rejoice that the eons were worthy sons of a noble site. He rests from nis labors and his works will follow him. Nature abhors a vacuum, aud so no vacan cies are allowed to exist in human ranks, but nis placo will be hard to fill."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "E. Hill, officiating. Judge <mark>Hundley</mark> writes from the White"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "E. Hill, officiating. Judge <mark>Hundley</mark> writes from the White"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2171.44, 512.58, 2336.62, 1813.12], "bbox_id": "d12428571e", "file": "AppomattoxNewspapers_1918-1922a_0031.pdf", "page": 1, "text": "There was an unusually large crowd here on court day. Judge Hundley misBed his train and did not get here until late in the evening. The ngro boy, Ed Brown, who had been confined in jail for eome months, was acquit ted. Chapman Oliver, appealed a case from a justices court, where he was fined 25, the higher court affirmed the decis ion. Joe Perkins was tried on the chargq of wounding Robert E. Newton and was put in charge of Lewis Williams for twelve monthsbut allowed to 8ay on his own form. Mr. Williams will have this man in chargt- as probation officer of the county. Mr. 8. L. Ferguson, of .ppj rnattox, was here court day re- uewing old frieodsnips ann making new ones. Mr Fergu son is one of ihe iargsttax payers in the districthe pays about 1003 a yearand sayi be likes to pay it. He made an excellent impression here and 1 hope he will have no opposi tion tor the Senate. He stands for good roads and good schools. All of us should clap our hands and congratulate Sena tor Swanson for being able to get his bill passed appropriat ing 4,000,000 as Federai aid to road building in Virginia. It is estimated that we will-have to pay u tax of 15 cents on eaoh 100 dollars of ttxibld value to raise an amount Virginia will have to raise before this 4,000,- 000 will be available. 1 will rejoice to pay my pari of tbis tax and anybody will be glaa to pay it when they find out what roads w j will nave if thie money is judiciously expended Mr. A. L. Pitts, jr., was here at court and said so far as be knew he had no opposition iu his candidacy for the House cf Delegates. Mr. Pitts is popu lar here and i hope will make a painstaking representative. A good many young men were here at court wearing their uniforms and many other soldier boys are expected home soon. Mr. Cleveland Goin is get ting 57 50 a month as insur ance on the life of one of his sons who died in camp. Mr. C. J Taylor is another citizen who is getting insurance money, since his son lost his life on one of the vessels th a t was sunk during the war. Mr. Roy Spencer, who vol- antered for naval service and served, until after the w ar closed, has received an honor able discharge aud has come to bis home near here. Mrs. J. P. Andrews, who has ueen for some tim e at ttt. Eliza beths hospital in Richmond, has been operated on for appen dicitie and other troubles, and we hope to see ner well and at home again soon. . The trustees in Maysville district decided to close the one- and two room schools, for lack of funds. Mrs. Maggie P. Moss is still in Richmond for medical treat ment and we shall be delighted to know that she is improving Mrs. F. E. Fitzgerald has been quite ill at her home near Slate River mill. Mr. John B. Boatwright has been appointed commissioner of accounts to succeed the late Sands Gayle. The Trustee Electoral Board will probably meet one day this week and make an appoint m ent to fill tha vacancy on th- school board caused by the death of Mr. W. A Wood. Mr. E. W. Hubard has re"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "on court day. Judge <mark>Hundley</mark> misBed his train and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "on court day. Judge <mark>Hundley</mark> misBed his train and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1964.4, 1535.19, 2123.49, 1630.18], "bbox_id": "d3277db0ec", "file": "AppomattoxNewspapers_1902-1905a_0513.pdf", "page": 1, "text": "There was a large congregation at the Red House Baptist church Sun day. Rev. Mr. Hubble took for his ,ext Jeremiah 9, 23. What is thejmatter with Hundley Spring? Awake, thou that sleep- eth. May 16, 05."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "What is thejmatter with <mark>Hundley</mark> Spring? Awake, thou that"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "What is thejmatter with <mark>Hundley</mark> Spring? Awake, thou that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2242.07, 457.68, 2402.98, 1666.01], "bbox_id": "5303219c48", "file": "AppomattoxNewspapers_1915-1918a_0593.pdf", "page": 1, "text": "There is to be no November term of circuit court here this time. Judge Hundley wrote to Clerk Hubbard about the .mat ter and Mr. Hubbard conferred with the members of County Board of Health and with other prominent ciiizns here, and wrote the Judge that it was the concensus of opnioa here that it would be unwise for the peo pie to oome together in public gathering at this time. Dr. Morriss, one of the mem bers of the Health Board, has been ill of influenza for the past week. But Drs. Randolph and Mitchell, the other mem bers of the Board, met here and discussed the question of the public schools being reopened. Lhe Board deoided that schools could reopeh last Monday, bui that district seno-ri boards would have the right to orde any schools hot to open, wher- there is still danger of th spread of the prevailing die -tase. . A great number of farmers have raised sorghum and they have been making the m las- ses the past week. I sold 25 barrels of corn on Saturday at 8 a barrel, and some changed hands at 9. Strange t say, corn is not wtll cured, notwithstanding the lovely weather we have had. I have a new Westenholm pocket knife I prize very high y, and I lost it. Tben T pray ed earnestly that 1 might find it, nd next morning I went a half mile to the place where 1 thought I loit it, and sure enough there it was. Mr. G. W. Newton leaves to day for New York to see his son, Grandison Newton, who has been ill with pneumonia, following influenza. This is Mr. Newtons second trip to Bee his son. Mr. H. Turner has decided not to teach school this year. His mother is old and feeble and needs him with her and besides, be has his crop at home to attend to. It is expected that Misses Bessie Patteson and Appling Moss will teach 8t. Andrews sohool. Mr. G. I. Taylor, who moved to Richmond with his family, is not pleased with the Capital city and contemplates moving back to his old home in the near future. Veal calves shipped to Rich mond have been bringing 18c a pound, Dressed fowls have been sell ing at prices to almost cause the ladies to sell their reserve stock. There will be no educational conference in Richmond this year, as the pupils and teach ers have lost so much time al ready. The School Fair and Agricul tural Fair, as stated before, are to be held at on and the same time at this place, on the 28th and 29th November Letters from the soldier boys in Fiance have come in to their people freely of late. Two let ters from D W. Patteson reach ed his home people last week Mr James Young and his wife have decided to move to Louisa county, where Mr. Y hss purchased a farm. We county people regret to give up such neighbors as these. Mr. John Poore has purchas ed a farm and will move down near the Cumberland line. Mr. Poore is a practical farmer,who makes farming pay."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "here this time. Judge <mark>Hundley</mark> wrote to Clerk Hubbard"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "here this time. Judge <mark>Hundley</mark> wrote to Clerk Hubbard"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1571.5, 1604.35, 1898.37, 1695.45], "bbox_id": "dabf87ac75", "file": "AppomattoxNewspapers_1902-1905a_0423.pdf", "page": 1, "text": "there  my wife in her haste to prt  j for the year 1904 is ended. Judge a fresh supply of bread, got George J. Hundley presided. The the sulphur jar instead for pare hold of court only lasted three days. There I was H i criminal ca.e on docket and  nothing on the common law docket j was tried aud only chancery busi-  ness was transacted, which Judge u s ul"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "bread, got George J. <mark>Hundley</mark> presided. The the sulphur"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "bread, got George J. <mark>Hundley</mark> presided. The the sulphur"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1563.58, 1037.3, 2200.79, 1333.64], "bbox_id": "7d54d6ac79", "file": "AppomattoxNewspapers_1902-1905a_0348.pdf", "page": 1, "text": "their loss. Well, Mr. Editor, for fear this , . . . . . may find its way to the waste basket, too strong. And at the finale in this course the general opinion is that I j w-jj cjoge success to the interesting trial the jury stood three Mr. Flood was satisfied of the fact I T im e s . for not guilty and nine for guilty that Judge Hundley -would refuse J August 1,1904, as charged In the within indict -1 the prisoner bail, or else he would ment The speeches, both for the U aye applied for it. I Sheppards defence and for the Commonwealth,   the meeting at the T aber-U naT ave com T lt lL t and the I poxxiattox, is visiting her sister, Mr nacle is now a thing of the past. We I ground is now too wet to plow. J W. R. Gheadle. ever and anon recall with ecstatic Thei Woolridge case has been the Miss Blanche LeGrande, of Lynch  . , 1 ,. I chief topic of conversation for the  hnr_ g viaitiuv at Mr. R. G. Jen joy the communion of saints at this   week8 Me88ra. L. a Pol. bur 18 vl8Uiag dear old place dnring the ten d ay slard W- G Moss, Fulton Baughan 1tung8  t  between and including J.nly 27 th I and Henry Cox from this neighbor-1 Hiss Courtney Uses, and 26th. It is true that the success J hood were on the jury. Store, Buckingham county, was vis of the meeting was greatl v marred     ut ,o r ho of I iting in. this neighborhood last week. 7 , _  , ? .  ,   Miss Susie Garnett and Mr. Tom by the fearful and far-reaching I g . x gmyrna church on August 3. court .trial that was going on at thel The Misses McDearmou, of Ever- Canrt House so near by, bat thanks I green, who have been visiting Mrs. to a kind Providence that never iRanson at Airlie, have returned turns a deaf ear to the ory of His I horn?- j i Miss Elizabeth Binford and Lona little ones, this dear meeting was I jjjan0j 0f Prince Edward, and Miss not without its abundant harvest for I Marian Binford, of Petersburg, are the Heavenly garner. There were I expected at Airlie to-day. reclamations and  Mrs. M. B. Pollard, who has been suffering with rheumatism, is im-"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "for guilty that Judge <mark>Hundley</mark> -would refuse J August"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "for guilty that Judge <mark>Hundley</mark> -would refuse J August"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.5, 1365.25, 1631.0, 1508.5], "bbox_id": "73deafbb29", "file": "AppomattoxNewspapers_1962-1965a_0448.pdf", "page": 1, "text": "their guests last week his broth er, Mr. F. E. Leitner, from Baltimore, and Mr. H. F. Leitner from Portsmouth Mr. and Mrs. Hedgepath, of Richmond Mr. and Mrs. Wallie Kidd and Sherry from Portsmouth Mr. and Mrs. E. M. Hundley and Ethel Ann, from Hampton, and Mrs. Leit- ners mother, Mrs. Ethel B. Hundley, who will spend this week with them. Mr. and Mrs. Wallace Bondur- ant had as their dinner guest Mr. and Mrs. Richard Bondur-"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "and Mrs. E. M. <mark>Hundley</mark> and Ethel Ann, from"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "and Mrs. E. M. <mark>Hundley</mark> and Ethel Ann, from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1719.8, 447.78, 2046.14, 720.07], "bbox_id": "d5b2332af6", "file": "AppomattoxNewspapers_1902-1905a_0423.pdf", "page": 1, "text": "their assessment one fellow i the I Ad f this has been done by Judge city by the sea paid-double. When- Hundley to whom the people are ever I call on John and Sam t h e y nuch indebted, and he is growing are always w illing Thirty-six popular with the people of the years ago a boy in his teens left t h i s county every day and is regarded as neighborhood for Kentucky, with J e best judges we have ever not money enough to pay hi 8 way Sheriffs Adams and I hill.ps worked in Tennessee for funds to re kept busy trying to keep the finish the trip  he has been on the P  P 1 from 8 Pitting on the new farm all his life, today he owns CttTet . . , _ three g o d farms, has educated his j he Judge appointed Mr. Joha B. children from the best schools, somé Philhps and Mr. Donald McRae to of whom are professional men. hiJ assess the lands of the county for crop of wheat avera.es about 2000 be year 1905. The appo.ntmeut bushels he is respected and honored en re 9tttU,0 eig libere and beloved and  Mr. Phillips has been au cf- ottey. a b , hi, fuiilw What he has i  the county for a number of done others can do. 1 1 never knew. J   and i entirely famlar with him to drink liquor hr use tobacco. h er,V frm ,n the county and he mad- ita li by the sweat of b i s K people have confidence n his r ludgment to dischare the dutiea of brow on the farm. r . . .  tl 0 Honor and shame, from no condi- important position. Mr. McRae, .ion rise, act well your part, there hough a young man, s considersd"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "the sea paid-double. When- <mark>Hundley</mark> to whom the people"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "the sea paid-double. When- <mark>Hundley</mark> to whom the people"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [973.2, 428.1, 1135.14, 958.15], "bbox_id": "73f11a44e3", "file": "AppomattoxNewspapers_1905-1912a_0576.pdf", "page": 1, "text": "the ten Commandments as the particu lar slogan of the new party. I make special reference to that commandment Thou shalt not steal, he said. We place Colonel Roosevelt in nomination to-nightwe, the people of the United States, the sovereign vot ers of this land, will elect him in Nov ember, Mr. Prendergast concluded. Representatives of twenty-two States composed the notification committee which informed Colonel Roosevelt of his nomination, and in a sense stood as sponsor for the movement. Ths committee consisted of Comptroller W. A. Prendergast, of New York Meyer Lissner, of California Former Congressman Richmond Pearson, of North Carolina Frank Knox, of Michi gan Matthew Hale, of Massachusetts James R. Garfield, of Ohio David Browning, of Kentucky Everard Bier- er, Jr., of Utah Walter Thompson, of Vermont Judge Oscar R. Hundley, of Alabama Judge Ben B. Lindsey, of Colorado Andrew Rahn, of Minne sota Judge Stevens, of Iowa Judge Lowder, of North Dakota Willian Al len White, of Kansas John C. Green way, of Arizona ex-Governor John Franklin Fort, of New Jersey Colonel E. C. Carrington, of Maryland Pearl Wight, of Louisiana Lorenzo Dow, of Washington Walter Clyde Jones, of Illinois and Frank Frantz, of Oklaho ma. Colonel Roosevelt was escorted to the hall by this committee, accom panied by Senator Dixon and Governor Stubbs, of Kansas. As the Colonel en tered the hall there was a storm of applause. The people leaped to their feet with a shout, and for five minutes there was pandemonium. Col. Roose velt mounted the platform and waved his hands, smiling with delight at the reception. Whmen he said he would accept the nomination there was an other frenzied demonstration. Governor Johnson, said Mr. Roose velt, you and the honestly elected delegates, and you, my friends, con trast this with the Coliseum conven tion this afternoon. Mark the differ ence between a peoples convention and a convention operated with a steam roller."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Vermont Judge Oscar R. <mark>Hundley</mark>, of Alabama Judge Ben"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Vermont Judge Oscar R. <mark>Hundley</mark>, of Alabama Judge Ben"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [318.01, 256.5, 482.67, 1085.14], "bbox_id": "ddb87b419e", "file": "AppomattoxNewspapers_1902-1905a_0429.pdf", "page": 1, "text": "The son of Cornelius Booker, who was so badly shot by the acci dental discharge of his gun by a dog, while endeavoring to extract a rabbit from a hole in the gronnd, an ac count of which was given in yonr last issue, succumbed to his injuries a day or two ago. It is supposed that he died from blood poisoning, esnlting from wadding from the gun, which entered his leg. This is the second or third death tjia has como to the home of Cornelius with in the past few months. Truly troubles never come single hand ed. Well we are beginning to hear of wars and rumors of wars iu connec tion with the Circuit judgeship in this district. The forces are lining p and we aFe inclined to infer how the ting stands by the outside weathercocks, who by their opin ions ? simply voice the opinions ind sentiments of those who direct but do not express until the cover ceases to cover We have made some inquiry along the line of ascer taining the choice of the people ind like the people usually are when unbiased by the professional mani pulators, they are satisfied with our present judiciary. We hear them taking  what has our present judge lone that his removal is sought? They all say that they do not want to retain Judge Hundley on account of any unworthiness that may be pointed out in the opponents of him but his record is such as to give ample satisfaction to all who wish a judge with spotless emine, and who dares to do right, though sometimes he be dared to do it. We have no words of abuse lor Judge Hundleys opponent. It is not that. We are simply paying tribute to whom trib ule is justly due. And we are in clined to think that the people of Buckingham will not be quick to forget the noble and commendable stand taken by our fearless judge in a recent notable and crucial test in the course of one of the criminal canes yet undetermined in this county. When we consider this case in all of its bearings, with, the possibility yea probability of incurr ing the lasting displeasure of a con siderahle political power by taking decided stand for what he conceived to he right we must admit tl-at Judge Hundley showed the stuff i that good judges possess. Therefore instead of regarding the advice ol him who said  it is better to bear the ills that be, than to fly to those we know not of in retaining out competent, courageous and court- eous judge, we are following the plan of the sensible man wht never A i"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "want to retain Judge <mark>Hundley</mark> on account of any"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "want to retain Judge <mark>Hundley</mark> on account of any"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [694.77, 293.13, 861.84, 2004.83], "bbox_id": "02ae436ebd", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "The Senatorial Convention Nominates H. D. Flood by AcclamationThe Buckingham and Cumberland Dem ocrats Nominate E. W. Hubard for the House of DelegatesSenator Martin Endorsed. Promptly at the appointed hour, Chairman V. E. Pratt, of the Buck ingham Democracy, called to order the convention of the Eighteenth senatorial district Iu the courthouse ou Monday. The convention organ ized by electing Dr. Pratt chairman and W. W. Haskins secretary. This organization was made permanent. The chair appointed the follow ing committee on credentials Frank Moon, of Buckingham Paul Pettit, f Fluvanna Joel Watkins, of Ap pomattox. The committee reported!he fol lowing delegates present and end- lied to stats in the convention BuckinghamFailed to get the names of these delegates. AppomattoxJoel Watkins, A. II. Clement, James B. Abbitt, II. 8. Coleman, A. B. Thornhill, J. W. Davidson, W. F. Wright. FluvannaA. A. Gray, Paul Pet- dt, C. B. Wood, W. C. White, W. F. Snead. Mr. A. A. Gray, of Fluvanna, then nominated Hon. H. D. Flood to suc ceed himself as Senator from this district, iu a speech which was well received, by the audience, and which elicited much applause, showing plainly that the audience endorsed his eulogistic remarks on Mr. Flood and his record as a representative. Mr. Gray is a pleasant speaker, aud his remarks were timely and highly appreciative. Mr, A. B. Thornhill, of Appomat tox, in a beautiful speech, seconded the nomination of Mr. Flood. He referred to the magnanimity with which Mr. Flood refused the certifi cate of election to Congress in 1896, and presented figures showing that iie received 4,000 more votes than diu Mr. Tucker in 1894, and 6,000 more than did Mr. Quarles in 1898. Mr. Thornhills remarks made a good impressiou, and he was the re cipient of congratulations upon his peech. Messrs. F. C. Moon and Ednt. W. Hubard, ou the part of Bucking ham, made short speeches seconding the nomination. At the conclusion of these speech es Mr. Paul Pettit moved that the nomination be made by acclamation, which was adopted, and the chair appointed Messrs. Gray, Thornhill, and Hubard to iuform Mr. Flood of his nomination, and to present him to the convention. Mr. Flood accepted the nomina tion in a speech of twenty minutes, which aroused much enthusiasm. He assured the peopie of his appie- fiaaou of the honor conferred, and of their endorsement and loyalty, to him and his public acts. He spoke earnestly of the faithful service to the laboring people of Virginia ren dered by Senator Martin, aud of the light he made for him in the Demo cratic caucus six years ago, assuring the Democracy of Virginia that, if- they would lay the mantle of the seuatorship upon Mr. Martin at that time, the Democracy of the Old Do minion would approve their action. Mr. Flood referred to the large ma jority of counties having gone for Senator Martin as proving the truth of his prediction, and said that Mr. Martin would be renominated by a four-fifths majority. At the con clusion of his speech he was pre sented wit-h a bouquet of beautiful flowers. Mr. F. 0. Moon offered the follow ing resolutions, which weie unani mously adopted Resolved, That the course of Hon. T. S. Martin, United States Senator, is fully endorsed and approved and the nomiuee of this convention is in structed to vote for and support Him for re-election to that position. . 2d, That the tiominee of this con vention is instructed to vote for and support Hon. George J. Hundley for re-electiou as Judge of this judicial circuit. Mr. W. W. Haskins said that he was instructed by the Maysville-dis- trict meeting to bring up the ques tion of moving the courthouse aud the nominee was instructed to op pose any movement looking to the removal of the courthouse. The senatorial convention then adjourned, and the house conven tion, composed of delegates from Buckingham and Cumberland, as sembled for the purpose of nomi nating a candidate for the House of Delegates. Dr. Pratt and Mr. Haskins were retained as chairman and secretary, respectively, of the convention.  W. M. Smith, of Cumberland, and F. C. Moon, of Buckingham, were appotiled a committee on creden tials, who reported the following delegates present and entitled to scats in the cony.epjbj.Qn t CumberlandW. if. South, H. D. Woodson. H. K. Adams, E. B. Davis, A. B. Armstrong, and J. W. Adams. BuckinghamWe are nnable to give the names of these delegates. F. C. Moon uommated Hon. E. W. Ilubar.t for delegate to the General Assembly from tjiis district, com posed of Buckingham an,d Cumber land counties, Mr. W. M. Smith, of Cumberland, in a few well chosen remarks, sec onded the nomination. Mr. John W. Adams moved that it be made by acclamation, which was done with a whoop. Sfr. Hubard was informed of his nonuuatiQQ, and was presented to the convention for a speech. Mr. Hubard made onj ?fp t his h.ap-i py speeches, full of logic and rea-! sou. He was severe on independ ents, and promised that the flag of Democracy should not trail in the dust, aud predicted a great victory fojt tjie party at the general election. He appealed ty his hearers with much force io si an cl by fthe nomi nees, saying it was not now afight, of Flood and Hubard, but a fight for the supremacy of Democratic"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "support Hon. George J. <mark>Hundley</mark> for re-electiou as Judge"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "support Hon. George J. <mark>Hundley</mark> for re-electiou as Judge"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1756.54, 1154.78, 1927.29, 1327.77], "bbox_id": "209d26034e", "file": "AppomattoxNewspapers_1960-1962b_0113.pdf", "page": 1, "text": "The Rev. and Mrs. John P. Leit ner had as their guests last week her brother and family, Mr. and Mrs. Lowry Hundley, of Ports mouth, Mrs. W. R. Stratton and Mrs. Annie Laura Martin, of Ap pomattox, and Mr. and Mrs. Lester Carson. Rev. and Mrs. John P. Leitnei visited his sick members in the hos pitals last week. They. bring sun Shine to the bedside of all they visit. Mrs. S. E. Anderson and Mrs, Martin Krause visited Mrs. BeW Harvey at Oakville last week."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Mr. and Mrs. Lowry <mark>Hundley</mark>, of Ports mouth, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Mr. and Mrs. Lowry <mark>Hundley</mark>, of Ports mouth, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.7, 1508.17, 1840.4, 1591.62], "bbox_id": "e1f5a837de", "file": "AppomattoxNewspapers_1898-1902a_0110.pdf", "page": 1, "text": "The remains of Chi laid were brought iron pTuesday and conveyi borne near Hundley K torment.. He married rand-daughter of Wooldridge of this coni"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "The remains of Chi laid were brought iron pTuesday and conveyi borne near <mark>Hundley</mark> K torment.. He married rand-daughter of Wooldridge of this coni"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "The remains of Chi laid were brought iron pTuesday and conveyi borne near <mark>Hundley</mark> K torment.. He married rand-daughter of Wooldridge of this coni"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [414.01, 1482.22, 574.79, 1565.17], "bbox_id": "50311c2af5", "file": "AppomattoxNewspapers_1898-1902a_0111.pdf", "page": 1, "text": "The remains of Charles Fitzge r ald were brought .from Lynchburg Tuesday and conveyed to his old home near Hundley Springs for in terment. He married Miss Farrar, grand-daughter of Mr. Dabney Wooldridge of this county."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "his old home near <mark>Hundley</mark> Springs for in terment."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "his old home near <mark>Hundley</mark> Springs for in terment."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [279.59, 243.06, 423.59, 697.05], "bbox_id": "59f64171e3", "file": "AppomattoxNewspapers_1962-1965a_0455.pdf", "page": 1, "text": "The rain was surely welcomed by all. Everything has taken on new life. Mrs. Jack Caldwell, Kathy and Elsie Caldwell visited Mr. and Mrs. Sep Spencer in Colonial Heights Sunday. Mrs. Spencer is much better now. She has recent ly been in the hospital in Rich mond. Mr. and Mrs. John Alvis, Wil liam and Betty, spent last Sun day with Mrs. Alvis parents, Mr. and Mrs. Mathews at Orange Mr. and Mrs. Parks Jennings has his sister, Mrs. Lottie Gillis- pie, their son, George and fami ly for a visit this week end. Mrs. Leitners mother, Mrs. Ethel B. Hundley, is still with her. So glad to have her at Heb ron Sunday. Edward Davidson spent last week at Charlottesville visiting his aunt, Mr. and Mrs. Claude Trent. Mrs. I. B. Wheeler visited her daughter Wednesday and Ronnie and Dennis Jones came with her home and stayed until Saturday. They called it their vacation. Mr. and Mrs. Bob Wheeler, Jerry, Steve, Linda Becky and Joan spent Week end in the same home. Sunday Mr. and Mrs. Tom Ray Burnett and Tim were dinner guests of the Wheel ers and afternoon visitors were Mr. and Mrs. H. B. Jones, Ron nie, Dennis, Kathy, Irby and Richard Jones. Mrs. Erah Elliott and Mrs. Hap Elliott were business visi tors in town last Friday. Mrs. Agnes Carson is having trouble with her knee. She has gone to visit her sister, Mrs. Davis Smith in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "mother, Mrs. Ethel B. <mark>Hundley</mark>, is still with her."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "mother, Mrs. Ethel B. <mark>Hundley</mark>, is still with her."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [528.7, 180.25, 691.03, 896.13], "bbox_id": "5411efd35e", "file": "AppomattoxNewspapers_1915-1918a_0011.pdf", "page": 1, "text": "The protracted meeting w ill begin at the Presbyterian Church here on Tuesday night after the 4th Sunday in August and on W ednesday there will be all day preaching and din ner on the grounds. Rev. J. E. Cook w ill assist the pastor, Rev. 0. M. Barrell and effort w ill be made to make this a m eeting of unusual interest and of great good for our church and community. Mr. A. J. Stinson is building a new bridge across the creek running through the Bailey farm, and Mr. Rush is building a bridge across the river near Mr. M. T. Jones place in Fran cisco district. It is probable the road force under Mr. R. D. Hechler will complete the work they have undertaken from Dentons store to the W ingina road this week. Mr. and Mrs. H. C. Glover and their children went on a pleasure trip to Crab Tree falls last week. Miss Fannie G. Haskins, who is teaching at Kellum, N. C., expects to get home in time to resume her studies at the Slate Normal at Farmville. Miss Fannie Miller, who was attending the Summer Normal at the University of Virginia was taken sick there and Mr and Mrs. Miller went to Char lottesville to be with her. Misses Ann and Favan Ca bell, of Fluvanna County, are visiting th Misses Ellis at  Mt- Rush. Messrs. Dabney end Eldridge Barqes, of Columbia, S. C., are with their uncle, Mr. John E ld ridge, at his home near Toga Mr. and Mrs. Jam es Young have returned from a visit to Mr. Youngs old home. Miss Rosa Gibbs is spending some time with her aunt, Mrs. S. R. Bondurant. Mrs. Geo. J. Hundley has been oq a visit to Mr. and Mrs James P. Andrews. Mr. L- W. Jones is thinking of opening up a store here."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Bondurant. Mrs. Geo. J. <mark>Hundley</mark> has been oq a"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Bondurant. Mrs. Geo. J. <mark>Hundley</mark> has been oq a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [814.77, 436.67, 976.06, 625.79], "bbox_id": "a6f7dcd189", "file": "AppomattoxNewspapers_1892-1898a_0485.pdf", "page": 1, "text": "The Prominence of fl Families  The Burriai of Mrs. Cole man The Wounded Brother, c. Saturday morning between the hours of 9 and 10 oclock, the home of Messrs. Emmett, Douglass and William Marshall, situate between Reedv Spring church and Hundley Spring P. 0., in this county was the scene of an awful tragedy, in which Mrs. William Marshall lost her life and Mr. Douglass Marshall received a bad wound in the right arm."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Reedv Spring church and <mark>Hundley</mark> Spring P. 0., in"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Reedv Spring church and <mark>Hundley</mark> Spring P. 0., in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [573.24, 443.99, 735.38, 1904.36], "bbox_id": "e897b16927", "file": "AppomattoxNewspapers_1918-1922a_0268.pdf", "page": 1, "text": "The Progressive Farmer and this paper, 2. Best weekly farm paper for this section The fellows opposed to good roads will not be beard from until tbe birds begiu to sing. Miss Bubie William, of Lynchburg, was the week-end gnest of Miss Gladys Smith. Messre. Clarence and Richard Hundley are visiting  their mother here. Miss Eloise Atwood has been spending a few days at home 8be returned to Hollins Monday. Read the ad of the big spe cial picture to fie on the boards at the Goldwyn Theatre next Saturday, the 20th. There will be no services at Memorial church on 8unday, as Bev. Bates will not get in until first of the week. Miss Mildred OBrien, of Farmville Normal, spent the week end with her parents, Mr. and Mrs. F. A OBrien. Miss Bettie Morris, of Farm ville Normal,was the week-eod iuest of her parents, Mr. and Mrs. Bob Morris. Miss Louise Car wile, of near Pamplin, spent the week-end with relatives and friends here attending the Chautauqua. cs. L. Ferguson, Jr ,.left San day for Leendalfe, W. V a, where he has accepted a posi tion. You can post your land for 3 months for 60 cents in this paper, and yon can bay posting cards for 50 cents h dozen. 11-10 2w Mr 0 L Turnes and son, Dewey, ofPettry, W. Va yhave been spending their annual-va oation with relatives in Appo mattox, town and c o u n ty . Rev. L. L  Banks . will reach Appomattox next week and will fill his appointment at Trinity at 11 a. m,, and Bethel at 3 p. m., on 8unday the 28th Stormy weather caught many of our people without coal. The price is said to be reduced at mine, but no reduction to con sumer. Judge H undley notifies the llerk of the court here that he will not open court here until December 2ad. He will be de tained with caseB at Farmville. The fight for the post office lere has begun. We under stand the applicants are ex postmaster Robert Irby, Havi- lah Baboock and W. Pierce Oder. Attention of our readers is called to tbe advertisement of the sate of the James Gorman place in Campbell county, by Walker  Mosby, to take place on Saturday, Dec. 4oh. Misses Bessie Oarwile, Anna and Carrie Jordan and Mr ioward Ferguson, of Charlotte county, were the Sunday gues s at the home of Mrs. J. W. atteson. Many of our young men will attend the Thanksgiving foot ball games at University of Virginia and Boanoke. .Joel flood and Kendall Hunter are among those who will attend. Mrs. Andrew Kean Leake an nounces the marriage of her daughter, Margaret, to Mr. Ed mund Wilcox Hubard, on Sat day, the twenty seventh of No vember, Richmond, Va. Another thing this town is badly in need of is a better electric lighting system. An already overtaxed plant is be ug farther overtaxed with each new light installed. Appomattox stockholders of tbe K F.  0. Tire Co ,of Roa noke, report that a t.a recent meeting of the directors it was decided to begin the msnnfao tore and disposition of the air- ess tire on tto first of the year In the suit of Wilkes Vs. Brown, o , the Supreme court ias awarded the defendant a supersedeas and injunction re straining the plaintiffs from  interfering with the trustees in handling the funds. Mrs. W Brown, of this place, is trus tee."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Messre. Clarence and Richard <mark>Hundley</mark> are visiting  their mother"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Messre. Clarence and Richard <mark>Hundley</mark> are visiting  their mother"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1278.71, 314.66, 1595.58, 525.82], "bbox_id": "1d09d94f8f", "file": "AppomattoxNewspapers_1912-1915a_0233.pdf", "page": 1, "text": "The Peoples Drag Store haye i new adv. in this issne. Read it. _____ , Mr. Will Walton, of Riohmbud ftSeMn on fawn. Address, no . i. College, is at home for a few days. IOf Q Vft, I J  ITTZThavelor sale one m are and Wf Well represented JeouiyeS od-norsee. wefirok. at the State Fair in Richmmd last one old V. EMKNT. Appomattox, Va. I week. Mlde. a . n.  __________ _ __________ x ------- I , .  Mw   L  Mr- Connie Woodall, of Prince 8oi- Edward County, was in the village pPc S d Ladles To Qualify For Law-1 S u n d a y .   M u o n s . _ Foaitlous becured Upon I J VuVitiOn 8 . rOSlUOUB o w u . - .  Guaranteed Salary F irst Yeai i D n  v  If R  R  Huubard ,eft thi8 week Aynihburií, va. io-3o-iyfr Halifax, where he will assist in a meeting.. lilKECTOKY. Mr. Wesley Drigcell, of Hundley Springs, is visiting the Golden Gates, California."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Mr. Wesley Drigcell, of <mark>Hundley</mark> Springs, is visiting the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Mr. Wesley Drigcell, of <mark>Hundley</mark> Springs, is visiting the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [793.17, 382.65, 964.11, 741.89], "bbox_id": "5964cc651d", "file": "AppomattoxNewspapers_1954-1955a_0001.pdf", "page": 1, "text": "The new womens dormitory at Lynchburg College now nearing completion will be known as Hund ley Hall, honoring Dr. and Mrs. J. T. T. Hundley who led the college through some of its most critical years, President Orville W. Wake has announced. The main classroom building known now only as main building or administration building, will henceforth be Hopwood Hall in hon or of Dr. and Mrs. Josephus Hop- wood, founders of the college. Dr. Hopwood was president of the col lege when the building was erected in 1908. In memorializing Dr. and Mrs. Hundley, the college formally pays tribute to the man who was called i from the pastorate of a church in Norfolk to assume the presidency of what was then, in 1915, Virginia Christian College during the dark est years of its history. In spite of difficulties, he brought the college to full accreditation, led in he de velopment of buildings and grounds and secured support of the young institution. During his administra tion, which ended in 1936 with his retirement, the name of the college was changed to Lynchburg Col lege."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Mrs. J. T. T. <mark>Hundley</mark> who led the college"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Mrs. J. T. T. <mark>Hundley</mark> who led the college"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2122.27, 421.57, 2294.47, 1669.36], "bbox_id": "97eca3106a", "file": "AppomattoxNewspapers_1892-1898a_0291.pdf", "page": 1, "text": "The Leesburg Washingtonian has this to say about the wheat outlook In Loudoun county It ia very discouraging to hear the unfavorable reports the farmers give us aa to the present condition and prospects of the wheat orop In this oounty. They tell us they never saw it look more unpromising. The fields In most plaoea look bare. At a meeting ot A. P. Hill Camp of Con federate Veterans of Petersburg resolutions approving ths scheme for the establishment of a national park upon the battlefields around Petersburg, to be known as Appo- matox Park, and requesting the Hon. Wm. B. McKenney and Senators John W. Daniel and Thomas 8. Martin to do all In their power to secure the proper legislation la Congress to earry out the object had In view. a t. 0. Wood Dailey, ot Randolph county, is suggested aa the democratio nominee for Congress In the second district. Mr. Dailey formerly livedjn Keyser. The Dudley farm ot 222 acres Just north ot Staunton which was sold tothe8taunton Im provement Company several years ago at 816,000 has been bought by Mrs. O. E. Dud ley tor 88,000. Luolnda Marshall and her daughter, about sixteen years old, living on the Baptdan river, about three miles north of Orange, were fatally burned by the explosion of a lamp. A Richmond paper announces the engage ment ot State Senator Henry Fairfax, ot Loudoun county, and Miss Eugenia Tennant, daughter of Mrs. D. B. Tennaut, ot Blah- mond. In event of Congressman McKenney de clining a renomtnatlon In the Petersburg dis trict the honor is likely to fall on Gen. G orgs J. Hundley, of Amelia oounty. Dr. E. S. Fugate, of .Russell oounty, died last week. About six months ago be was thrown from his buggy and sustained serious Injuries, which proved to ba fatal, Gen. Fltzhugh Lee will deliver tbe annual oration to the graduating class of the Uni versity Collage ot Medicine, in Richmond, on the evening of the 29th of April Over two hundred persons protested eon- version at the meetings oonduoted In Flncos- tla by Evangelist Strouse. The Ktbler and Stoneberger murder oases have been continued until the next term of the Pago County Court In Scott oounty Barlow Benton shot and killed Sonney Williams. At 8 oolook in the morning tho sloreSotue, with the entire stock of goods, belonging to F. Nash, at Phones Woods, Westmore land oounty, was destroyed by fire, also a barn near by. Loss unknown. Ths fire or iginated, It Is thought from the stove. Mr. Nash and a Mr. Goldman, who were sleeping In the store at the time, narrowly escaped with their Uvea. Pompey Hanks, while sitting at his dash In the freight depot ot the Atlantic Coast Line In Petersburg, was struck in the head by a ball fired from a pistol byaa unknown party. He was badly hurt Mrs. Sarah W. Berryman, a well-known aged lady living near Danville, who was an invalid, was burned to death while sleeping in her chair near tbe fire. Her dress Is sup posed to have caught froth a spark. As T. Scott Carter wm passing Metz Sta tion, Herbert Davis, who keep a store there, made an Insulting remark to him. A feud of long standing has existed httween the two, and Oarter, thinking that Davis would open on him with a Winchester he was reported to have on band, rode to the side of the store house. Davis fired from tho window killing Carters horse and shooting Carter through the left arm. A warrant was Issued for Daviss arrest. Mr. W. G. Fox, proprietor of the Miners! Hotel, at Crewe, In Nottawny county, on the Norfolk and Western Railroad, was drowned In a pond near Nottoway county courthouse. He sod three companions were In a boat fishing, when by some means the craft was overturned and ths occupants thrown Into tbe water. Fox, being unable to swim, was droned, but the other three men swam to shore. The unfortunate man came to Crewe from Farmvllle. He leaves a widow, with ons child. His body was recovered. Great excitement prevails in Lancoetei oounty over the murder ot Mr. Charles Car ter, aged about twenty years, son of Mr. Peyton Carter, of that county. Young Car- I ter had been engaged for some tims In the j store of Mr. W. P. Burnett, at old Christs Church. He was a young man highly es teemed in tbs community. When found by Mr. Burnott young Carter was lying on bit face behind tbe counter cold in death. Alarm was at once given ajd a messenger was dis patched to Dr. W. B. Newblll, but It was, of course, beyond bis power to do any thing for the unfortunate man. Mr. Burnetts dwell ing adjoins the store. When he retired at dlght about 9 oclock be left Mr. Carter alone In the tore. He soon beard some one talking. He called to Hr. Carter to know if he was In tbe store and received an affirma tive reply. Upon tbe head of Mr. Carter were found several wounds, and on the outside ot the store was found an axe covered with blood and hair, and tbe storehouse was open just os Mr. Burnett left It and the lamps were still burning. Nothing In ths store seemed to be disturbed In tbe least The coroners jury rendered a verdict that the decased came to his death at tbe hands ot some one unknown to the jury. The board ot supervisors ot Rockbridge county met In the courthouse at Lexington and after an all-days session, by a unani mous vote, decided to build a new court house and fire-proof clerks office combined, the cost not to exceed 820,000. The money to be used lu paying for it, otherwise than what is now in the treasury, is to be raised by an issue of bonds, one-fifth of which shall be paid off each year for tbe next five years."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Gen. G orgs J. <mark>Hundley</mark>, of Amelia oounty. Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Gen. G orgs J. <mark>Hundley</mark>, of Amelia oounty. Dr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [998.12, 317.76, 1181.38, 1384.5], "bbox_id": "2b66468d7b", "file": "AppomattoxNewspapers_1915-1918a_0486.pdf", "page": 1, "text": "The leaves and grass are dry j again and fires are being re- ported to the authorities. There was a case against a  man for allowing his engine to set the woods on fire tried in the circuit court here thé past week and the jury allowed ! damages in the sum of 2000. Another case was the Amiss-1 Duty case, where the defend ant was charged with shooting. The charge was not sustained by the evidence and Judge I Hundley told the jury if they  brought in a verdict against the defendant he would have to set it aside. Mr. Charles L. Glover had one of his horses stolen out of  the pasture at W ell Water, his  home, recently and it is thought  that a young negro, who is  now in the army, did the steal-1 iag I expect the thief would prefer going to the penùentia-  ry to going to France.  Some people predict that the   war will come to an end in Jan- uary or February. They read in the Book of Revelations what they base their opinion upon. The Kaisers birthday is the 27ih of January and the war will have been in progress for 42 monthsI think som tims in Februaryand accord- ing to the prophesy they say it should end at that time. 1, however, think it will cud when Germany and her dllies are utterly crushed, or when their revenues are so depleted that they shalt be unable long er to continue the struggle- Dr. Lacy, before preaching at Emanuel church last Sun-1 I day, asked the congregation to I rhise a certain sum for the Y M. C. A the congregation gave much more than was appor tioned to them. The people of the county are asked to con-  tribute . 000 to this cause and I do not think there will bel any trouble in raising this amount.  The Red Cross Society met here last Saturday. The Red Cross Society is be ing eitended to the negroes, and one societyor chapter, perhaps it is calledhas been organized among them they have relatives and friends in the army who will need atten tion as much ap the whites. John Chambers, a very relia ble colored man, saw what he thinks was a panther near his home near Glenmore, and says it killed his dog. Whether this is true or not it will sdlwe the purpose of keeping folks in that vicinity in their homes at night. With the coming of a warm rain much tobacco will be sold. A Lynchburg warehouseman told me 46 was the highest price that had been paid on that market and Messrs. Grig and Watkins, who Were both here at court, said they had never seen such prices as were being paid in Farmville for to bacco. I told one of them I wanted 30 around for my crop and he said he had gotten as much as that for some tobacco j Merchants here say they are"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "evidence and Judge I <mark>Hundley</mark> told the jury if"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "evidence and Judge I <mark>Hundley</mark> told the jury if"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1372.28, 387.99, 1675.16, 653.39], "bbox_id": "dcf9f4bb9b", "file": "AppomattoxNewspapers_1898-1902a_0711.pdf", "page": 1, "text": "The latest State apportionment of school funds is as follows Appo mattox, 3,630 children, 1,008.15 Buckingham, 6,480 children, 1,- 782.82. Rev. Luther R. Thornhill, D. D , .who recently resigned as pastor of eJohn m Giiiiam. . Orlean Baptist Church, in Fauquier sioner of Revenue, Distrlot No. 1.1 r _ an. Distriet No. s, c. c. Camden.  countv. has reconsidered bis action, af SupervisorsP. A. Grigg, chair-1 , , . .. wander Forbes, Forrest Gutnrio, m . I und withdrawn his resignation. Thomas Tindall and Allle C. Wood-1 beets first Monday in each month. Mr Geo_ A Coleman, who has for C umberland . I ieverai weeks been in Johns Hopkins f circuit CourtGeo. j . Hundley j Hospital, Baltimore, is to-day report- J  t T c o u  a m M. Smith, ed alarmingly ill. Dr. J. H. Abbitt fcirrcuHUSdaycounty courts-J. b . left on the evening train for BaM- seytorcommonwealthPaul McRae. I more. Mm. _ O , Flippen. I T i7h Adams. Mr. and Mrs. E. W. Taylor are jj DlKSB I pHU to  and wm.8H.Rhode8r I iu WashingtoH, D. 0. The climate  --------------- I of North Dakota is said to be too IIOUS APPOINTMENTS. rigid for, Mrg Taylor8 constitution. stRev. H. W. Dunkley, Paa-1 qijjejr many Virginia friends would"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "f circuit CourtGeo. j . <mark>Hundley</mark> j Hospital, Baltimore, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "f circuit CourtGeo. j . <mark>Hundley</mark> j Hospital, Baltimore, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [168.51, 454.26, 331.68, 1792.92], "bbox_id": "93dd1b7e6f", "file": "AppomattoxNewspapers_1902-1905a_0458.pdf", "page": 1, "text": "THE JUDGESHIP CONTEST IN THE TH CIRCUIT. To the General Assembly of Vir ginia, In obedience to law it will be your duty to elect a successor to judge George J. Hundley as Judge of the Fifth Judicial Circuit, and it is with pleasure and confidence that we. the nndersignea resident and practicing attorney 8 in the Cir cuit present, the claims of Judge Hundley for re election. For seven years he haB presided over our Court and by his courageous, im partial and efficient discharge of duty and dispatch of business, lie has won laurels and added dignity to the judicial ermine, and his name will form a strong connect ing link in the chain of  irginiaa distinguished Judiciary.  As evi dence of his eminent fitness and qualifications for the position, we refer with pride to the fact that during seven years administration of justice, he has only been re versed four tims. Judge Hundley is a man of ability, experience and culture a first class lawyer, aid we hope the time will never come in Virginia when the General Assembly will torn out an able and efficient judge simply to give place to an other who wants the office. His R ecord A s a S oldier . He enlisted at the commence meat of the war was a gallant sol dier, serving throughout the war, and was dangerously wounded in battle. His R ecord A s a C itizen . At the close of the war he com menced the practice of law and soon attained high rank in his pro fession. He has been a .lifelong Democrat and as such served in the House of Delegates and Senate of Virginia and until his electon as Judge was one of the most active and efficient State canvassers for the Democratic party. The accom panying papers will demonstrate tha be is overwhelmingly the choioe of the bar, officers of court and people in the Circuit, and we confidently rely upon his re-election in accordance with precedent under such circumstances, and as a jus tribute to merit and worth. E. W. H dbard , Commonwealths Attorney of Buckingham. W m . M. S mith , Commonwealths Attorney and late County Judge of Cumberland, Vo. A. H. C lement , of Appomattox bar. A. B. A rmstro  o , of Prince Ed ward bar. We pnblish as a matter of news the above petition signed by a com mittee representing, as we are in formed more than three-fourths of the resident bar of this Circuit and about seven-eighths of all the law yers practicing in this cncuit. It is no secret that an effort is being made in certain quarters to defeat the reelection of Judge Handley and this is the response of the law yers. What have the people of Aj pomattox to say on this important subject? Perhaps if Judge H und ley is to be defeated they will wain to know the reason why. The peo ple do not elect their judges di rectly, but they do elect the men who elect the judges. The lawyer are not the only people interested it the election of capable, impartial and fearless judgesjudges who have the honesty and the courage ti administer law without respect to persons and before whom all men stand upon a level so long as they obey the laws of the land. The election of Governors and Senators is very important, but these are far removed from the people. Thei judges touch them more nearly than any other officials, No man can estimate the harm that a weak and oscilating judgeone courting the favor of men of power and influence, may do, aud in such cases it is the good, plain, indus trious people w ho suffer. The law yers know the law and can protect themselves in a measure, but the plain people want to feel when they fie down to sleep at night that a fearless, independent and upright judge stands between them and all wrong and injustice. Thank God, the people are free once more, since the shadow of negro domination is removed far from them, and we are about to return to the old order of things, when politicians were the servants and not the masters of the people. Perhaps the people may aak candidate for the Legislature. How are you going to vote on the Judgeship question? or they may even dare to instruct their driegate Who knows?"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "to judge George J. <mark>Hundley</mark> as Judge of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "to judge George J. <mark>Hundley</mark> as Judge of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.63, 1038.69, 2043.95, 1231.4], "bbox_id": "6706940597", "file": "AppomattoxNewspapers_1905-1912a_0356.pdf", "page": 1, "text": "The Jam es River Baptist As sociation begins on Tuesday after the 4th Sunday in July at Mulberry Grove Church. Great crowds usually attend I the witness fees will not com-1 these meetings and have a nice pensatefor the loss in other I time spiritually and socially, directions. I The 11th day of July is the In my letter of the last issue I time for the regular term of II inadvertently said that there I circuit Court to begin here, would be a Masonic dinner o n juige Hundley has been sick, the 24th inst., 8t. Johns day, I but it is hoped he will be well when . I m eant to say there I in time to hold Court, would be no dinner given byl Mr. Frank Ellis and family the Masons oil th at day. In-L e spending some time a.t his j terested parties will take n o -0ldhome."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "dinner o n juige <mark>Hundley</mark> has been sick, the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "dinner o n juige <mark>Hundley</mark> has been sick, the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [449.29, 165.91, 631.8, 1552.09], "bbox_id": "237e2c2933", "file": "AppomattoxNewspapers_1918-1922a_0595.pdf", "page": 1, "text": "the iron was hot and they sent Mr. Hubbard Baird to Norfolk to .bring back a truck for use on the roads of this county. It is being told as a joke on a lady in this county that a man who is a semi-idiot came to her house and when she met him at the door instead of tell ing what he wanted he follow ed her in the house then she became frightened, and sent for the men folks out in the field and when they came past haste, they found the lady holding her gun on the man whom they at once recognized as the feeble minded young man from a neighbors house. She said it was the most strenu ous time of her life when she stood there holding that gun on the man. People who are beforehanded got busy ordering a good sup ply of sugar last- week and when the expected raise takes place it is likely to find many people with a supply on hand. The superintendent of a coal mine in West Virginia sent for a man from this county who has mined for years and told him to bring all the old time miners with him who wanted work. It is said that the war tax has been taken off the Rail road tickets and also off of other things. Hon John B. Boatwright in writing to me from his seat in the legislature sends his re garde to his friends here. The people living near St. Andrews school house and church have decided to start to digging a well for use of both school and church, they propose to get the work done by voluntary iabor by the men each one contributing so many daos work. Messrs. H. C. Glover, Willie Patteson and F. R. Moon are among those who have recent ly shipped tobacco to Lynch burg. Mr. E. W. Hubard und wife have come to the court bouse and are boarding at the Pear son hotel. Mrs. J. D. McArthur leaves this week for her home at St. Paul, N. C. Some ice has been harvested but it was not very thick. There was a threat made tu take a post office from a mer chant because he was a demo crat and he said that was all right his partner was a repub lican and he would get the ap pointment. The burning of the dormitory at Blackstone Female Institute and then the burning of the Military school for boys there caused considerable loss to Buckingham boys and girls. Miss Connor, of Diilwyn, was one of the lady Btudents there and Mr. Russell Moon Jr , was one of the boys there from thiB county. It is truly remarkable how much more readily negroes who have some education will subscribe to a newspaper than white people. Cattle in the northern part of the county have been mak ing their living on blue grass up to this time and there has been ao snow as yet to cover the grass up. Turkeys for breeding purpos es have been selling at 10 for the toms and 5 for hens. Dress goods have come down considerably lower than the cnee and considerably lower in price. Dr. Thomas Hugs Lacy filled bis appointments ai St. An drews Emanuel churches on Fndiy and Sunday respective ly and was looking much better than he did when he wee here last month. Judge George Jefferson Hundley will succeed himself a judge of this Judicia.t circuit He is 84 years old"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "month. Judge George Jefferson <mark>Hundley</mark> will succeed himself a"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "month. Judge George Jefferson <mark>Hundley</mark> will succeed himself a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1607.04, 633.6, 1765.05, 819.3], "bbox_id": "f9a91926d9", "file": "AppomattoxNewspapers_1915-1918a_0548.pdf", "page": 1, "text": "The home of Mr. Ellis Wool- ndge is very sad since Miss Bernice, his daughter, has re turned to Lynchburg and bis two boys gone to Oamp Lee. Mrs. Annie Hundley was at tached by her oow early Mon day morning and received sev eral bruises, though she was not badly hnrt. Seed potatoes for sale1 have 100 bushels McCormick seed potatoes for sale at 75 per bnshel at my farm. G. A. F cheffler , 6 29 2w Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Oamp Lee. Mrs. Annie <mark>Hundley</mark> was at tached by"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Oamp Lee. Mrs. Annie <mark>Hundley</mark> was at tached by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.1, 1081.44, 1858.9, 1260.19], "bbox_id": "52eabeec5b", "file": "AppomattoxNewspapers_1892-1898a_0276.pdf", "page": 1, "text": "the High School Glee Club will give a song a song may also be expected I C0UUJ- from a chorus of little girls. I Hundley Spring Notes, .The attendance at the lecture! in looking over your paper I never should be such as to show the offi- see a thing from our little post cers of the Library Association that 10gjce t reckon its owing to they will he fully sustained in the I neighb0rh000d being so very quiet course of lectures they are so kindly I tjjafc nothing of an unusual nature arranging for the profit and pleasure eyer occurs of the community. I ftaam rmnor says one of your The committee having the lecture 1 YiUare beaux intend to take one of in charge is Mr. J. R. Atwood, Mrs. I our Rnrai flowers. Well my best M. L. Harvey and Miss Emma wigheg g0 wjfch them Evans. Admission, adults 15 cents! Qur gcflool is getting on nicely and children 10 cents. I unjer the administration of our new"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "of little girls. I <mark>Hundley</mark> Spring Notes, .The attendance"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "of little girls. I <mark>Hundley</mark> Spring Notes, .The attendance"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [317.74, 182.66, 483.44, 398.61], "bbox_id": "4f69e0a7e3", "file": "AppomattoxNewspapers_1912-1915a_0381.pdf", "page": 1, "text": "the growing of tobacco, and this done successfully I believe the farmers of this section will be better off as they insistr they are growing it at a loss. Mr. Horace Richardson and Mr. E. T. Bondurant, both veteran to bacco growers, met with repreaeuta tive dark growers in W ellington, went before the Congressional com mittee and were cordially received by the President and come back with some hope of relief but bring with them no pirn to lie pursued judge Hundley held u special term of Prince Edward Court dur ing the week and heard two criminal cases. The fire fiend who set fire"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "to lie pursued judge <mark>Hundley</mark> held u special term"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "to lie pursued judge <mark>Hundley</mark> held u special term"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [128.41, 730.25, 289.03, 823.05], "bbox_id": "934269c4da", "file": "AppomattoxNewspapers_1912-1915a_0220.pdf", "page": 1, "text": "The Fredericksburg Chapter, United Daughters of the Confederacy, has sleeted the following delegates to the State convention in Richmond Mrs. Fannie E. Barney, Mrs. George H. Chewning, Mrs. J. Bowie Gray, Mrs. W. N. Hamlet and Mrs. Lewis Pilcher alternates, Mrs. Ferdinand H. Hart, Mrs. Ves Chancellow, Mrs. Alwyn Hundley and Miss Lizzie Eckenrode."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Ves Chancellow, Mrs. Alwyn <mark>Hundley</mark> and Miss Lizzie Eckenrode."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Ves Chancellow, Mrs. Alwyn <mark>Hundley</mark> and Miss Lizzie Eckenrode."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [922.56, 921.64, 1085.22, 1370.74], "bbox_id": "d44349ef82", "file": "AppomattoxNewspapers_1898-1902a_0379.pdf", "page": 1, "text": "The following Farms in Appomattox county No. 1A tract of land containing about one hundred and ninety acres, known as the Moon Place, about one mile from Spout, Spring, on the Norfolk  Western Railway. There is a dwelling house and small orchard on th s  lace, barns aud other usual out line st s No. 2A tract of land containing s me two hundred and twelv acres, adjoining No. 1, and known us the Home Place. There is a large a welling and orchard on this place, four or five barns and other usual outhouses- Tracts Nos. i nd 2 wiil b-. offered both sep I arately and as a whole, and that method of sale will be adopted which produces the best prica. No. 3A tract of land containing some four teen and one-half acres, adjoining the lands I of Franklin, Furbush and others, some mile and one-half from Spout Spring. There are no buildings on this place. No. 4A tract of land containing some sixty-nine acres, adjoining J. H. Robertson, some three miles from Spout Spring. There is one cabin on this place. No. 5A tract of land containing ninety- four acres, on buck Creek, some lour miles from West Appomattox. There is a log house, burn, blacksmith shop and small orchard on this place. I t adjoins the lands of Mrs. DanU McKinney, Joel Flood and others. No 6 A tract of land on Wreck Island Creek, known as The Brooks Place, and containing some six and one-half acres. It adjoins M rs. Wm. Davidson and others. There are no buildings on this place. No. 7A tract of land on Wreck Island Creek, known as Hundleys, about a mile and one-half from Concord Depot, and con taining forty-live acres, No. 8 A tract of land on Davids Creek, containing some three hu dred and thirty- one and one half acres, known as the Kyle Tract, adjoining the iands belonging to E. C. Kob.rtsons estate. There are two log cabins on this place. No. 9A one-half undivided interest in a brick store house a t the old Court House. No. ItA tract of land in Campbell county. nfcar Concord Depot, containing some one hundred and forty-three acres a part of the Sampson Evans place, adjoining D. J. Evans, Hundley and others. The sale in each instance is by the tract ami not by the acre. TERMS OF SALE One-third cash, the balance bn a credit of one and two years. For the deferred payments, the purchasers bonds, bearing six per cent, interest from the day of sale, will be required, and the title to the property will bo retained till the whole of the purchase money is paid. II. D. FLOOD. N. C. MANSON. J r ., Commissioners. Mary li. Wood, Ac., vs. D. P. Robertsons Adnirs., e. The bond required by the decree in fhe above suit has been execu ed by N. C. Man- son, Jr., one oi the commissioners, with am ple security. Teste G eo , T. P eers . Clerk,"}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Island Creek, known as <mark>Hundley</mark>s, about a mile and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Island Creek, known as <mark>Hundley</mark>s, about a mile and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1428.27, 1022.33, 1589.72, 1095.68], "bbox_id": "6aa52a5ae1", "file": "AppomattoxNewspapers_1912-1915a_0111.pdf", "page": 1, "text": "The Eastern Star Chapter, of Fredericksburg, has elected the fol lowing officers Worthy matron, Mrs. W. H. Brulle worthy patron, Mrs. Victor M. Moon secretary, Mrs. Mary Quinn-Hicks treasurer, Mrs. Alwyn Hundley conductress, Mrs. Minnie E. Tompkins."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "Quinn-Hicks treasurer, Mrs. Alwyn <mark>Hundley</mark> conductress, Mrs. Minnie E."}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "Quinn-Hicks treasurer, Mrs. Alwyn <mark>Hundley</mark> conductress, Mrs. Minnie E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [681.1, 1410.28, 843.51, 1898.34], "bbox_id": "41486f24bc", "file": "AppomattoxNewspapers_1918-1922a_0505.pdf", "page": 1, "text": "The Campaign Opened The Democratic State Cam paign will be opened formally at Clintwood, Dickinson ooun ty, September 27, when the Hon. E. Lee Trinkle, party gubernatorial nominee, will ad dress the voters of that section on campaign issues by deliver ing his key note address. Congressman H. D. Flood, state democratic chairman, is booked to address the voters of Halifax at Halifax September 26th. Chairman Flood will speak at Middlesex the follow ing day and at Amherst on October 10th. As the Demo cratic campaign is largely under the direction of the State chairman Mr. Flood will be kept busily engaged daring the next few weeks. The Tenth district congressman h a s thrown himself very heartily into the fight and is confident of leading the democratic forces to an overwhelming victory. Speaking assignments are now being mapped out for Senator Swanson,Senator Glass Governor Westmoroland Davis, as well as all of the Virginia members of Congress. Robert G. Hnndley, veteran of the World War and a son of Judge George J. Hundley, of the cirouit benob, will .deliver an address at Cumberland Court Honse September 27 th."}, "highlight": {"text": {"matched_tokens": ["Hundley"], "snippet": "of Judge George J. <mark>Hundley</mark>, of the cirouit benob,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hundley"], "snippet": "of Judge George J. <mark>Hundley</mark>, of the cirouit benob,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
