{"document": {"bbox": [596.63, 270.47, 800.5, 982.0], "bbox_id": "776e439489", "file": "AppomattoxNewspapers_1926-1933a_0017.pdf", "page": 1, "text": "years 1914 to 1916. At the same time, these leading growers, through their cooperative efforts in handling the surplus, have caused an increased demand tor that portion of the crop sold over the auction floors which has netted the growers over 75 per cent more than pre-war price. During the four years which the cooperative association has operated, there has been a grad ual decrease in the production ot dark fired tobacco in spite of the comparatively good prices which were being paid. The production for 1922 was ap proximately 49,000,000 pounds for 1923 44,000,000 pounds for 1924 43.000,000 pounds and for 1925 41,000,000 pounds. It is, of course, recognized that weath er conditions had more to do with this decreased production than any other one factor, but there is reason to believe that a cooperative association con trolling a sufficient quantity of the product can gradually con trol production through grad ually lowering prices when pro duction is too high, and grad- uolly increasing prices when production is too low. It may be said that this is just what happens under the auction sys tem, but the objection to this system is that the price fluctua tions are too violent. For in stance, under the auction system a 36,000,000 pound crop of Vir ginia dark fired tobacco in, 1919 sold on the auction floor for an average price of nearly 25c per pound, while the 4, 000,000 pound crop produced in 1920 brought only about 9c per pound, and the 49,000,000 pound cropldence. produced in 1922 brought nearly 20c per pound. There can be no permanent prosperity among farmers as long as we have such violent fluctuations in prices from year to year. In view of these facts, it would seem that cooperation still has much to offer to the tobacco growers and other business men of the Virginia dark fired belt If this much could be accom plished when our farmers know practically nothing about coop erative marketing, is it no logi cal to expect that more can be accomplished during the next five years with our farmers hav ing learned much by practical experience concerning both the limitations and possibilities of cooperation? J. R. Hutcheson."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "of cooperation? J. R. <mark>Hutcheson</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "of cooperation? J. R. <mark>Hutcheson</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.07, 569.74, 1767.4, 1028.04], "bbox_id": "47d3d3b267", "file": "AppomattoxNewspapers_1918-1922a_0455.pdf", "page": 1, "text": "without discussion the Federation .stained the action of Its commit tee on organization in nonconcurring on a resolution calling for one body of workers through amalgamations, federations and protective agree- nients. , . . T T The declaration presented by J. L. Pauley, of the West Virginia State Federation of Labor, also urged all national and International unions to Insert clauses in their working agree ments whereby they can render such assistance as is needed by any and 11 crafts when called upon to do so. It asked that all unions arrange the dates of their contracts so that they would expire at the same time. The convention was thrown into confusion when several delegates by objections denied the negro delega tion permission to introduce a resolu tion condemning the mob violence of the Ku Klux Klan, or White Cap, of the South. President Samuel Gompers had great difficulty in restoring order, as nearly  score of delegates Jumped from their seats and demanded the names of the delegates who had ob jected. He declined to give the names. As the confusion increased President Wil- - Ilam Hutcheson, of the United Brother hood of Carpenters and Joiners, arose and said If you want to know who the ob jector isIt is I. Several delegates called his name aloud as the convention proceeded to further business. The resolution also urged that steps be taken to have the Government abolish this unlawful organ known as the Ku Klux Klan or white caps, and that the Federation use Its best endeavors to protect organized labor as represented by the colored work ers."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "increased President Wil- - Ilam <mark>Hutcheson</mark>, of the United Brother"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "increased President Wil- - Ilam <mark>Hutcheson</mark>, of the United Brother"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2106.71, 1152.2, 2552.76, 1316.02], "bbox_id": "96aa8cf41d", "file": "AppomattoxNewspapers_1926-1933a_0306.pdf", "page": 1, "text": "without a dissenting vote re quested that Mr. Hutcheson make an effort to have Mr. Stone come to Lynchburg at an early date to address the dark tobacco growers here. 0NEHALF PRICE!"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "re quested that Mr. <mark>Hutcheson</mark> make an effort to"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "re quested that Mr. <mark>Hutcheson</mark> make an effort to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2376.84, 1147.01, 2540.39, 1209.86], "bbox_id": "d1cd0cdbbe", "file": "AppomattoxNewspapers_1908-1909a_0306.pdf", "page": 1, "text": "without a dissenting vote re quested that Mr. Hutcheson make an effort to have Mr. Stone come to Lynchburg at an early date to address the dark"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "without a dissenting vote re quested that Mr. <mark>Hutcheson</mark> make an effort to have Mr. Stone come to Lynchburg at an early date to address the dark"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "without a dissenting vote re quested that Mr. <mark>Hutcheson</mark> make an effort to have Mr. Stone come to Lynchburg at an early date to address the dark"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [871.44, 1678.55, 1353.51, 1759.65], "bbox_id": "c065b260bb", "file": "AppomattoxNewspapers_1908-1909a_0237.pdf", "page": 1, "text": "will John R. Hutcheson, Vice Chairman of the Virginia Drought Relief Commission made the principal address of Mrs. Mary Douglas, of A l __ ___ _ ______  .lumwiluu, the tavisba, is spending some time . On account of thedrought the National, and State plans for with her niece, Mrs. Arthur! progect work was not good , Continued on Page  I Irby . i"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "will John R. <mark>Hutcheson</mark>, Vice Chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "will John R. <mark>Hutcheson</mark>, Vice Chairman of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [546.02, 627.99, 719.56, 872.99], "bbox_id": "0547a89392", "file": "AppomattoxNewspapers_1939-1943a_0036.pdf", "page": 1, "text": "Whm the Democratic caucus of tlje General Assembly of Virginia .Répéta next Tuesday to nominate a Jadge to succeed the beloved Robert Ï. Hutcheson of the fifth judicial clilt, it will paufce with proper inspect to the memory of one of the j bleat jurists ever to serve in the! Qtd Dominion, The Times Virginian j believes that Judge Hutcheson was sut peer. To ante his successor will require careful study of qualifi erions of any mentioned for the im partant post. We have before us a copy of Who Who In America and we lve opened it on a page which lists the qualifications of an able attor ney who, we are convinced, should ha oomined for this judgeship. His name is JOEL W. FLOOD, of Appomattox. We are greatly im pressed with the long record of pub lic service rendered by this distin guished Virginia Gentleman. He is a veteran of the county, stats and federal courts. As commonwealths"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "the beloved Robert Ï. <mark>Hutcheson</mark> of the fifth judicial"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "the beloved Robert Ï. <mark>Hutcheson</mark> of the fifth judicial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.1, 878.39, 1659.0, 1147.13], "bbox_id": "2b67259780", "file": "AppomattoxNewspapers_1908-1909a_0375.pdf", "page": 1, "text": "WHITER JUNE Seed Pota toes for sgle at G. W. Lewis farm. 1.75 per bushel. The best potatoes on earth. See us today. ISAAC LEWIS  BRO., 6-6-3t  Appomattox, Va Judge Hutcheson adjourned his court here Saturday until June 13th, at which time he ex pacts to finish Up the term. Only one or two law cases anc some chancery matters were disposed of.  Miss Emily Harvey enter tained at aovely bridge party Monday evening, consisting of six-tables,pf bridge. Miss Earl Pattesoh won high score and Miss Virginia Reynolds low score. A delicious ice course was served."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "6-6-3t  Appomattox, Va Judge <mark>Hutcheson</mark> adjourned his court here"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "6-6-3t  Appomattox, Va Judge <mark>Hutcheson</mark> adjourned his court here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [323.49, 896.73, 635.18, 1010.13], "bbox_id": "62c559527d", "file": "AppomattoxNewspapers_1915-1918a_0303.pdf", "page": 1, "text": "which, basing figures on the mortality I P any, Lynchburg W. G. Carve, Brls- ot 1914 and 1915, will claim thousands Eol J. L. Camp, Franklin C. I. Millard, of victims within this period.  Roper Lumber Company, Norfolk Guy Buell, Suffolk Robert S. Hutcheson, Despite the fact that there was a decrease in circular mail matter on account of prohibition, the Richmond postofflee receipts for December, 1916, are approximately 2 per cent, more than they were ih December, 1915. The receipts for December, 1915, were 92,- 387.72 for December, 1916, they were 93,951.41, or 1,113.69 more."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Buell, Suffolk Robert S. <mark>Hutcheson</mark>, Despite the fact that"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Buell, Suffolk Robert S. <mark>Hutcheson</mark>, Despite the fact that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.83, 607.03, 1859.16, 856.77], "bbox_id": "9fc91a8123", "file": "AppomattoxNewspapers_1952-1954a_0042.pdf", "page": 1, "text": "weanesday atternoons speak ers before the board will be Dr Walter S. Newman, president of V, P. I. Mrs. C. E. Myers, past presi dent, Virginia Federation of Home Demonstration Clubs and Dr. John R. Hutcheson, president of the V. P. I. Education Foundation, Inc. Pre siding over the sessions will be Dr. Paul D. Sanders, board chairman, editor of the Southern Planter, Rich mond, Va. The Federation also will meet July 30, with Mrs. Will S. Dicker son, Fredericksburg, presiding. The annual Institute of Rura Affairs opens Wednesday evening July 30. Speakers not named pre viously include Dr. Herman M. i Southworth, agricultural economist Bureau of Agricultural Economics, Washington, D. C., scheduled for the economics section Thursday morn ing and Dr. Arthur Mauch, agri cultural economist, Michigan State College, for the economics section,"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and Dr. John R. <mark>Hutcheson</mark>, president of the V."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and Dr. John R. <mark>Hutcheson</mark>, president of the V."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.74, 400.58, 1645.1, 896.36], "bbox_id": "0fa09daa6f", "file": "TimesVirginian_1976_0108.pdf", "page": 1, "text": "Way land Ferguson repre sented the DECA chapter of Appomattox High School at the 33rd Annual Virginia Distribu tive Education Clubs of America S tate Leadership Conference, The SLC was held at the Hotel Roanoke on March 12-14. While attending the .confer ence Wayland joined approxi mately 600 delegates in electing State Officers and in planning work programs for the coming year for local chapters. Contest finalists from twenty-four Vir ginia DCA districts competed for state awards and the chance to represent Virginia at the National Career Development Conference in Chicago. The conference was high lighted Saturday night starting with a buffet dinner. From 8-10 p.m. an awards ceremony to recognize contest winners was hosted by Kevin Reynolds, who has been the featured Vocalist at the Miss America Pageant. After the ceremony an Awards Ball was given and everyone enjoyed dancing and the music by Reynolds and Co. Mr. Jack Hutcheson, Distri butive Education coordinator at ACHS, accompanied Wayland to Roanoke. Mr. Hutcheson served as a chaperone for the State Leadership Conference. Wayland is a senior at Appom attox County High School and employed by Webbs Tire Company. His parents are Mr. and Mrs. William D. Ferguson, Jr. of Oakville."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and Co. Mr. Jack <mark>Hutcheson</mark>, Distri butive Education coordinator"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and Co. Mr. Jack <mark>Hutcheson</mark>, Distri butive Education coordinator"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [785.05, 333.41, 954.35, 716.62], "bbox_id": "b7bd7e5401", "file": "AppomattoxNewspapers_1955-1957a_0120.pdf", "page": 1, "text": "Washington, D. C.- The National League baseball picture is not as complicated, this training season, as is the American League picture. In the junior loop there are five teams which might win the flag and a sixth strong one. In the National, Brooklyn com pletely outclassed the competition last year and the question is wheth er there are teams in that circuit which will put up a good light for the pennant this year. ___________ There is this in favor of the challengers first, Brooklyns stars are not youngsters, for the most part. Second, they havent got Johnny Podres, who won the World Series for them. Third, there will be some improvement shown by sev eral competing teams. Fred Hutcheson is new at St. Louis. There he will try to take Stan Musiel, who is only to be a- round so much longer, and the oth er regulars and youngsters, and get the Cardinals back into the flag fight. Chicagos young team, which lead the league a while last year, will probably be stronger. But St. Louis and Chicago finished 7th an d 6th last year. It looks like New York, and Milwaukee will have to provide the keen competition again in 1956. The Phillies and Redlegs, who came in 4th and 5th, may get into the act, but neither looks like a pen nant winner. If Chicago and St. Louis are years away, Brooklyn"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "eral competing teams. Fred <mark>Hutcheson</mark> is new at St."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "eral competing teams. Fred <mark>Hutcheson</mark> is new at St."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1365.11, 477.1, 1507.79, 598.3], "bbox_id": "1cf8b43b5c", "file": "AppomattoxNewspapers_1926-1933a_0409.pdf", "page": 1, "text": "Wanted Cross tiesWe have r contract at higher price n NW has been paying, igt L. E. S mith . udge Hutcheson is holding a cial term of the Circuit Court Buckingham this week. ihe County Tekchers Institute been set for February 16th he High School Auditorium"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "E. S mith . udge <mark>Hutcheson</mark> is holding a cial"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "E. S mith . udge <mark>Hutcheson</mark> is holding a cial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.3, 1270.75, 2043.29, 1307.85], "bbox_id": "d160c023b9", "file": "AppomattoxNewspapers_1933-1936a_0352.pdf", "page": 1, "text": "W. L. Hutcheson was appointed by resident William Green of the Amer ican Federation of Labor as that or ganizations delegate to the forthcom"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "W. L. <mark>Hutcheson</mark> was appointed by resident William Green of the Amer ican Federation of Labor as that or ganizations delegate to the forthcom"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "W. L. <mark>Hutcheson</mark> was appointed by resident William Green of the Amer ican Federation of Labor as that or ganizations delegate to the forthcom"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2242.8, 412.43, 2415.5, 1120.52], "bbox_id": "69ce98b01f", "file": "AppomattoxNewspapers_1892-1898a_0101.pdf", "page": 1, "text": "W ashington , D. 0, Nov. 8 ,- S enate . The Committee on Appro priations held an earlier meeting than was expected, and have reported an adjournment resolution, which was immediately taken bp for dis cussion. Messrs. Gray, Cockrell, Mills, Cul- lom and Blackburn favored adjourn ment, and Allen and Peffer opposed the passage of the resolution, Peffer asked for the yeas and nays, bnt the demand was not seconded. The Senate then passed the resbln- tion, providing for adjournment at 8 oclock this afternoon, in accord ance with the House resolution.  The Senate has appointed Messrs. Bansom and Cnllom a committee to act with the House committee to no-  tify the President that Congress if, i ready to adjourn and has gone, into executive session to blear up tho 1 nominations pending.  r I f H ouse . The last day of the ses sion began ith a slim attendance oin the floor and in galleries. The bill remitting the duties on - imported exhibits at the World Fair, which may be donated to or . purchased for the new Colpinbipn Museum, was taken Up and discussed. The house refused to eonoarin the Senate amendment and order conference at 1955. ! - A message was received iron th e.. Senate announcing the résolution and fixing 3 p. m, today am the hour of ad journment, and has been passed by  that body. The speaker appointed Hulman and Turner, of Georgia, And Dingley a committee to urüt upon the President in connection with the Senate committee and to .notify him that the business of the session is  ended. _ j -w 3 A resolution was entrodueed by Mr.  Bichardson, of Tennessee, continuing the sevices of the employees of Con gress during the recess. It met with a small, bnt determined opposition, which assumed the shape of a filibus- ter led by-Mr, Hutcheson, of Texas, An agreement has beenreached by conferees on the bill remitting the duties of the Worlds Fair exhibits sold. The House  accept the Senate amendment, and the conferees will report their agreement as soon as the oportunity is offered."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "filibus- ter led by-Mr, <mark>Hutcheson</mark>, of Texas, An agreement"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "filibus- ter led by-Mr, <mark>Hutcheson</mark>, of Texas, An agreement"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [379.44, 528.28, 543.43, 636.02], "bbox_id": "c9da848a1f", "file": "AppomattoxNewspapers_1908-1909a_0112.pdf", "page": 1, "text": "v Judge Hutcheson opened his court promptly yesterday with a light docket and adjourned Court to June 14. Hannah vs Board Supervisors of Appomattox will come up for trial on the 15th June. Mrs. L?cy J. Connor and Mrs Emma Bagby were added to the"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "v Judge <mark>Hutcheson</mark> opened his court promptly"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "v Judge <mark>Hutcheson</mark> opened his court promptly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [262.56, 732.96, 426.87, 917.26], "bbox_id": "07d4e34df3", "file": "AppomattoxNewspapers_1908-1909a_0184.pdf", "page": 1, "text": "urday- It is reported that he is I getting along nicely and Judge! Hutcheson expects to be here next week for Court. Mrs. Jennie Bondurant, of near Lynchburg, had as her guest Sunday Mr. and Mrs. Tom Drinkard, Mr. and Mrs. Victor  , Messrs. Earl and Alton j Drinkard, Albert and Elmo Stone, Robert Giles, Malcolm Bondurant and Miss Eleanor Bondurant, of Lynchburg Mr. and Mrs. V. B. Carson and Eu- I gene Roberts."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "along nicely and Judge! <mark>Hutcheson</mark> expects to be here"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "along nicely and Judge! <mark>Hutcheson</mark> expects to be here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2168.64, 281.0, 2363.55, 330.85], "bbox_id": "d259864b95", "file": "AppomattoxNewspapers_1926-1933a_0415.pdf", "page": 1, "text": "u i? I w s o n overseer oi poor a o Warding overseer of poor b G. Harvey overseer of poor Robert F. Hutcheson judge County Farm Agents-white and colored."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "of poor Robert F. <mark>Hutcheson</mark> judge County Farm Agents-white"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "of poor Robert F. <mark>Hutcheson</mark> judge County Farm Agents-white"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1068.26, 550.03, 1237.71, 669.93], "bbox_id": "b273c74353", "file": "AppomattoxNewspapers_1939-1943a_0245.pdf", "page": 1, "text": "TWO YEARS AGO Program for 30 additional miles  of REA lines in Appomattox county being pushed. John R. Hutcheson, off Blacks burg, speaks at March meeting of Ruritan club. Schedule announced for Appo mattox high school baseball team, as coach C. A. Hilt leads boys in practice sess.ons."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "being pushed. John R. <mark>Hutcheson</mark>, off Blacks burg, speaks"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "being pushed. John R. <mark>Hutcheson</mark>, off Blacks burg, speaks"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.62, 369.66, 2019.47, 695.46], "bbox_id": "64fadf5a75", "file": "AppomattoxNewspapers_1952-1954a_0173.pdf", "page": 1, "text": "Two agronomic schools for live stock and dairy farmers have been scheduled by the VPI agronomy de partment for February. The fanners will be briefed or. trends and latest reccomendation on silage and pasture, farm building and equipment, and other production practices. Research work underway at VPI Agricultural Experiment Stat ion is on the agenda for discussion. One school is scheduled for Feb ruary 18 for beef cattle and sheep producers and 19 for dairymen at the Middleburg community house The other school, planned for Char lottesville, has not yet been definitely scheduled. Agronomists said these schools will be similar to the 1952 school at Mid dleburg which was attended by about 700 farmers from throughout north ern Virginia. Dr. John R. Hutcheson, chancellor of VPI, will act as chairman of the schools. To take part on the program are Dr. C. B. Bender, director of research in grassland farming, The Sperry Corporation, New York G. W. Litton, G. D. Kite, R. G. Connelly, Dr. H. L- Dunton, and W. W. Lewis, all of the staff at VPI."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Virginia. Dr. John R. <mark>Hutcheson</mark>, chancellor of VPI, will"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Virginia. Dr. John R. <mark>Hutcheson</mark>, chancellor of VPI, will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [540.0, 1361.82, 878.5, 1517.02], "bbox_id": "8828db2997", "file": "AppomattoxNewspapers_1939-1943a_0034.pdf", "page": 1, "text": "tûon in all land-use programs of the Department of Agriculture and for closest coordination with State ef forts along that line. Of special interest to Virginians are a number of changes in the Ag riculture program. Changes in the rate of credit for soil-building practices under the 1940 AAA Program will emphasize con servation rough practices not nor- ,  I  w  W VW VU 0 l i V , i l U i uuty winners were sent to Blacks- mally carried out, including greater burg to compete in the stale canning use of Kme and phosphate, and win- contest. The exhibit of Mrs. W.A. ter cover crops, Director Hutcheson Wtpon won first place in the State, with a prize of 50 in ersh to be di vided between her and the club."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "ter cover crops, Director <mark>Hutcheson</mark> Wtpon won first place"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "ter cover crops, Director <mark>Hutcheson</mark> Wtpon won first place"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [710.39, 433.06, 852.21, 591.16], "bbox_id": "7a0c5113d1", "file": "AppomattoxNewspapers_1974-1975a_0515.pdf", "page": 1, "text": "Tuesday, Nov. 18 from 730 - 830 p.m. for all people interested. On Wednesday the 19th, members have planned a career day assembly for presentation to the student body. Friday the 21st has been designated dress-up day. For further information about DECA week or the distributive education program at Appomattox High School, call Jack Hutcheson, DECA chapter advisor at 352-7146 or ask any DE student."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "High School, call Jack <mark>Hutcheson</mark>, DECA chapter advisor at"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "High School, call Jack <mark>Hutcheson</mark>, DECA chapter advisor at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1355.48, 1012.53, 1461.6, 1165.88], "bbox_id": "6cfbe0eb7b", "file": "AppomattoxNewspapers_1926-1933a_0114.pdf", "page": 1, "text": "Tom Doss and Frank of Blackstone, were week attending com-1 t. pback lots and keep t of street in front of ty. See town ordin- save trouble and costs Hutcheson will be on here again on the 14th instant to hear cases  days."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "save trouble and costs <mark>Hutcheson</mark> will be on here"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "save trouble and costs <mark>Hutcheson</mark> will be on here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.91, 893.0, 1975.24, 1182.95], "bbox_id": "16277207f1", "file": "AppomattoxNewspapers_1908-1909a_0488.pdf", "page": 1, "text": "to celebrate the centennial in dersen. She lurtner nas a originai church, those at- good group picture of General tendi are requested to bnng Lee s staff, which is for sale. thejr own iunch or arrange- ments will be made for same to be on sale on.the grounds. I A splendid program is being arranged. J. K-- Megginson, -- ------- , clerk of the association, re- Judge Robert A. Hutcheson  that Dr f . W. Boat- has just entered an order re- wrjght, president of the ,Uni- appointing G. M. Rogers as verjty Gf Richmond, will trial justice f o r Buckingham 8peac Friday, and other prom- county, for a term of four jnen Baptists have been pe- years. P. H. Moss, former cured  present the story ot substitute trial justice, has re- one.hundred years of Baptist signed and the judge has ap- jjjoory in this section and in pointed E. B. Glover of this the state place, as his successor. . I __ Ther Judge has --also fixed j Buckingham court house as the . place for the trial of all cases oefore the Trial Justice court. Heretofore the cases have been heard at Dillwyn on Tuesdays and Buckingham on days of each week."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "re- Judge Robert A. <mark>Hutcheson</mark>  that Dr f . W."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "re- Judge Robert A. <mark>Hutcheson</mark>  that Dr f . W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [741.85, 297.68, 1458.14, 506.0], "bbox_id": "f2f6b68e5f", "file": "AppomattoxNewspapers_1933-1936a_0454.pdf", "page": 1, "text": "TJMES VIRGINIAN APPOMATTOX, VIRGINIA THURSDAY Giliiarn, if any there be, do on the 30th day of May, 1930, at 1000 oclock A . M ., before ths Judge of the Circuit Court of Appomattox Coujity, Virginia, at his office at Charlotte C .H ., Va., show cause, if any they can, against the payment and delivery of the money and other estate of the said Floyd A . Gilliam, deceased, to his heirs and legatees, without requiring a refunding bond of them or any of them. It is is further ordered that a copy of 1 this order be published once a week f -our successive weeks in The Times Virginian, a newspaper published in Appomattox County, Virginia. R obt.F. Hutcheson, Judge. A copyTeste C. W. Smith, Clerk."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "County, Virginia. R obt.F. <mark>Hutcheson</mark>, Judge. A copyTeste C."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "County, Virginia. R obt.F. <mark>Hutcheson</mark>, Judge. A copyTeste C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2343.86, 135.56, 2526.65, 755.99], "bbox_id": "e241d1a47e", "file": "AppomattoxNewspapers_1908-1909a_0306.pdf", "page": 1, "text": "tirââeàrRank lSHiÉaM on-in if Cooperative marked plied to dark fired tobacco,, a topic increasingly of to farmers jn this section a s1  indicate Monday at the annual agricultural outïdt conference held in Vi Hotel sponsored by the Lyi burg -Chamber of C 01 cooperating with the VI Polytechnic Institute extension division, and attended by mhi than 125 of the leading farm ers and bankers aa w ell as ag ricultural agents from fourfeebl counties in this part of the I state John R. Hutcheson, director of the extension division, gave statistical information indicat- ing probable price trends for farm produce and livestock during the coming year and which might serve as a basis for intelligent planning, of tfifc years work. T. B. Hutcheson led the discussion of such top ics as building up pastures to facilitate livestock raising but, again and again those attend ing, many of whom were them , selves tobacco growers, led the discussion back around to the problem of marketing this portant money crop. Direct handliniPo f tiie ques tion came in the afternbon when John J. Scanlon, repre sentative of the bureau of ag ricultural economics, of tbe United States department agriculture who recently made a detailed study of cooperative marketing of tobacco  spoke. Mr. Scanlon told something of the history of organizations of"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "I state John R. <mark>Hutcheson</mark>, director of the extension"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "I state John R. <mark>Hutcheson</mark>, director of the extension"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [411.34, 362.89, 569.63, 551.23], "bbox_id": "d83db5041d", "file": "AppomattoxNewspapers_1926-1933a_0062.pdf", "page": 1, "text": "Thomas B. Hall has been ap pointed by Judge Hutcheson as supervisor in Mayesviile district to fill the vacancy caused by the resignation of Dr. G. L. Morriss, who has been appointed treasur er of the county, to fill the vac ancy caused by the death of for mer Treasurer James L. Ander son. .. Mr. Hall will make a good supervisor as he knows the needs of his district and will render the public valuable service in his new position, the Judge, the peo pie and Mr. Hall are to be con gratulated ___________ Reduce Taxes"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "ap pointed by Judge <mark>Hutcheson</mark> as supervisor in Mayesviile"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "ap pointed by Judge <mark>Hutcheson</mark> as supervisor in Mayesviile"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [406.78, 344.9, 565.33, 505.14], "bbox_id": "62bed1c9eb", "file": "AppomattoxNewspapers_1908-1909a_0062.pdf", "page": 1, "text": "Thomas B. Hall h i. been ap pointed by Judge Hutcheson as supervisor in Mayesville district to till the vacancy caused by the resignation orJDr. G. L. Morriss, who has been appointed treasur er of the county, to fill the vac ancy caused by the death of for mer Treasurer James L. Ander son.  Mr. Hall will make a good supervisor as he knows the needs of his district and will render the public valuable service in his new position, the Judge, the peo ple and Mr. Hall are to be con gratulated."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "ap pointed by Judge <mark>Hutcheson</mark> as supervisor in Mayesville"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "ap pointed by Judge <mark>Hutcheson</mark> as supervisor in Mayesville"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2341.18, 599.59, 2509.98, 849.34], "bbox_id": "f269a11eb2", "file": "AppomattoxNewspapers_1939-1943a_0069.pdf", "page": 1, "text": "Thic April term of the circuit court of Apipmat1X county will convene here Monday at 1000 A.M. This will be the first term of the local circuit! court presided over by Judge W. Flood, recently appointed by the General Assembly to serve the unexpired term of the. late Judge Robert F. Hutcheson. A large attend ance is expected for the opening sessions Monday. The criminal docket for the term will be fairly light. Indications are that there will be only three In dictments, and that the term can be completed in two days. Judge N. S. turn bail, of Victoria, Tias been de signated 0 preside hi certain chan cery matters in which Judge Flood was an attorney prior to his eleva tion to the bench. He is expected to come here for this purpose Tues day or later Iri the session. Trial Justice L. F. Terguson .will hold court here Saturday to hear a case resulting from a recent auto mobile accident. . . -."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "late Judge Robert F. <mark>Hutcheson</mark>. A large attend ance"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "late Judge Robert F. <mark>Hutcheson</mark>. A large attend ance"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1987.91, 709.72, 2153.24, 798.67], "bbox_id": "8072aea8dd", "file": "AppomattoxNewspapers_1949-1952a_0497.pdf", "page": 1, "text": "These additional facilities and equipment will enable the Experi ment Station to greatly strengthen its work with pastures and forage crops, Dr. Hutcheson pointed out. He also said that such research will pnve of permanent value to all live- sl.ok producers in the eastern half of the United States."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and forage crops, Dr. <mark>Hutcheson</mark> pointed out. He also"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and forage crops, Dr. <mark>Hutcheson</mark> pointed out. He also"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.23, 1119.98, 1838.84, 1498.86], "bbox_id": "cffa04037f", "file": "TimesVirginian_1976_0396.pdf", "page": 1, "text": "There wifi be shoplifting prevention clinic Wednesday, November 10th from 7-10 p.m. The clinic wifi be held in the Distributive Education Class room 305  a t Appomattox County High .School. Cost for the seminar is 2.00 per person. Appomattox County Adult Distributive Education in coop eration with the Sheriffs office and the Commonwealths At torney are sponsoring the workshop. Content is aimed at persons in management level positions. J . E . Richardson, Sheriff of Appomattox County, will show t a movie designated to help businessmen recognize and deal with shoplifters. Sam Kerr, Commonwealths Attorney, will speak to the group on legal aspects concern ing Virginias new shoplifting laws. There wifi be a question and answer period at the  conclusion of the clinic. To register or obtain further inform ation,- contact R- B. Carter at 352-8251 or Jack Hutcheson at 352-7146. Dont miss out on this workshop - shoplifting costs amount to 3.5 billion a year!"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "at 352-8251 or Jack <mark>Hutcheson</mark> at 352-7146. Dont miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "at 352-8251 or Jack <mark>Hutcheson</mark> at 352-7146. Dont miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2263.88, 438.67, 2435.57, 1167.73], "bbox_id": "9181c9aaf2", "file": "AppomattoxNewspapers_1892-1898a_0102.pdf", "page": 1, "text": "The Two Houses Have Finished Their Work. W ashington , D. O., Nov. 8. S enate , The Committee on Appro--, priatifins held an earlier meeting, than was expected, and have reported an adjournment resolution, which was immediately taken hp for dis cussion. Messrs. Gray, Cockrell, Mills, Cal- lorn and Blackburn favored adjourn ment, and Allen and Peffer opposed the passage of the resolution, Mr. Peffer asked for the yeas and nays, but the demand was not seconded. The Senate then passed the resolu tion, providing for adjournment at 3 oclock this afternoon, in accord ance with the Honse reso lu tio n . The Senate has appointed Messrs. Ransom and Collom a committee to act with the Honse committee to no-.  tify the President that Congress is ready to adjourn and has gone into executive session to clear np the nominations pending. H ouse . The last day of the see- ! sion began with a slim attendance oh the floor and in galleries. i The bill remitting the duties on  imported exhibits at the Worlds Fair, which may be donate to or purchased for the new Gelpnfd Museum, was taken up and discussed.  The honse refused to concur in the Senate amendments, and order the conference at 1255. t  1 4 A message was received fron the Senate announcing the resolution and fixing 8 p. m. today as the hour of ad journment, and has been passed ty that body. The speaker appointed Hulman and Ttimer, of Georgia, ahd Dingley a committee to wéft upon the President, in connection with the. Senate committee and to notify him that the business of the session .is  ended.  A resolution was entroduced by Mr. Richardson, of Tennessee, wmtihtiing the seviees of the employees of Con- iff gress during the recess. It met with a small, but determined opposition, which assumed the shape of a filibus- ter led by-Mr, Hutcheson, of Texas. , An agreement has beenreached by J conferees on the bill remitting the duties of the Worlds Fair exhibits sold. The House  accept the Senate , amendment, and the conferees w ill report their agreement as sood as the  oportunity is offered."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "filibus- ter led by-Mr, <mark>Hutcheson</mark>, of Texas. , An agreement"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "filibus- ter led by-Mr, <mark>Hutcheson</mark>, of Texas. , An agreement"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.98, 1059.24, 1914.1, 1160.14], "bbox_id": "9683a6257d", "file": "AppomattoxNewspapers_1912-1915a_0214.pdf", "page": 1, "text": "The Tidewater Telephone Com pany has elected the following offi cers A. W. Withers, president W. DeW. Dimmock, vice-president and general manager H. E. Hutcheson, secretary and -treasurer., Board of Di rectors, A. W. Withers, John L. Farin- holt, W. E. Corr, R. S. Bristow, J. Marshall Lewis, G. S. Marchant, I. B. and B. F. Weaver, W. DeW. Dimmock and J. W. Downs."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "general manager H. E. <mark>Hutcheson</mark>, secretary and -treasurer., Board"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "general manager H. E. <mark>Hutcheson</mark>, secretary and -treasurer., Board"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.55, 561.8, 1618.91, 1047.31], "bbox_id": "20ad64e1f8", "file": "AppomattoxNewspapers_1908-1909a_0261.pdf", "page": 1, "text": "The State held a ptfw wlw on the farm of J- R. Horselèÿ on the 2nd And had some farm ers present from Amherst anc other places to yiew the pas ture field on this farm, conduc ted by the State. Lunch was served by Appo mttox 4-H club girls. The various fertilizer and lime trea-tinents used on these plots were, explained in detai by Prof. T. R - Hutcheson, oi Blacksburg, An outsf andini impression left in the minds o the farmers of Piedmont Vir- ginia from these experimental plots was the evident result that is hieing obtained from an application of ohe ton ol ground limestone and 406 pastures were carrying four phosphate per acre. This fer tilizer and lime, as .stressed by Mr. Hutcheson,, was appliec to the. native pasture soil.  No seed  was added nor was the ground ploughed ,tr cutlivatec in any way before the treat ments. Another outstanding fact was that these .treatec pounds i of 16 per ceni acic yearling steers,on five acres o pasture. This compares favor ably to the general rule of three to five acres of pasture for one steer.. They also! visited the regis- - tered Aberdeen-Angus herd of CrBT. Feagaxis nearLyncfiburg, and many important points ÌB regard to this breed ofcafile were discussed by Dr. Wallcer and Mr. Feagahs.   --- - --- - O -------- ------------ Around Five Forks"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "by Prof. T. R - <mark>Hutcheson</mark>, oi Blacksburg, An outsf"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "by Prof. T. R - <mark>Hutcheson</mark>, oi Blacksburg, An outsf"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1462.13, 582.64, 1625.2, 1047.97], "bbox_id": "9bf15ca57f", "file": "AppomattoxNewspapers_1926-1933a_0261.pdf", "page": 1, "text": "The State held a pCw wow oq the farm of J. R. Horseley on the 2nd fcnd had some farm ers present from Amherst and other places to view the pas ture field on this farm, conduc ted by the State. Lunch was served by Appo mattox 4-H club girls. The various fertilizer anc lime treatments used on these plots were explained in detai by Prof. T. R. Hutcheson, of Blacksburg, An outstanding impression left in the minds ol the farmers of Piedmont Vir ginia from these experimental plots was the evident resull that is being obtained from an application of one ton ol ground limestone and 40C pastures were carrying four phosphate per acre. This fer tilizer and lime, as stressed by Mr. Hutcheson, was applied to the native pasture soil. No seed was added nor was the ground ploughed ,or cutlivated in any way before the treat ments. Another outstanding fact was that these .treated pounds i of 16 per cent acid yearling steers.on five acres of pasture. This compares favor ably to the general rule of three to five acres of pasture for one steer. v They also visited the regis tered Aberdeen-Angus herd of C. B. Feagans near Lynchburg, and many important points In regard to this breed of cattle were discussed by Dr. Walker and Mr. Feagans."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "by Prof. T. R. <mark>Hutcheson</mark>, of Blacksburg, An outstanding"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "by Prof. T. R. <mark>Hutcheson</mark>, of Blacksburg, An outstanding"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [543.35, 855.67, 702.34, 983.26], "bbox_id": "443e533213", "file": "AppomattoxNewspapers_1915-1918a_0170.pdf", "page": 1, "text": "The prize of 5 in gold, offered by the Fredericksburg Chapter, United Daughters Confederacy, for the best paper on the Life and Services of Commodore Matthew Fontaine Maury, was won by Miss Mabel Walker, of the sophomore class of the normal school. Those receiving honorable mention were Misses Edna Morton, Fay Sprlnkei and Ilus Hutcheson, of the normal school. Thirteen papers were submitted to a committee consisting of Rev. It. C. Gilmore, Captain M. II. Rowe and C. R. Howard."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Fay Sprlnkei and Ilus <mark>Hutcheson</mark>, of the normal school."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Fay Sprlnkei and Ilus <mark>Hutcheson</mark>, of the normal school."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1411.2, 1197.11, 1566.48, 1621.76], "bbox_id": "8c18b3bd47", "file": "AppomattoxNewspapers_1898-1902a_0517.pdf", "page": 1, "text": "The Porto Rican Assembly unani mously passed the free trade resolution. The Navy Department received a message from Commander Schroeder at Guam stating that the Filipino prisoners there have a government of their own, with General Pilar as president. Judge Taft took the oath and was formally installed as governor of the Philippine Islands. Governor General Wood, of Cuba, re ported that he is ill with typhoid of a mild type. Gen. Chaffee is preparing to push Mal var, the insurgent chief, in Southern Lu zon. He has ordered the transfer of the Fifth Infantry from Northern Luzon to Batangas province. Gen. Chaffee has not formulated plans for the occupation of the Island of Min doro. Gen. Hughes, at his request, wilt be permitted to continue in command of the Visayas Islands until the Samar cam paign is completed. Consequently, Gen. Davis will continue, temporarily, to be provost marshal at Manila. A detachment of the Fourth Infantry, scouting on a volcano island in Lake Taal, has captured Gonzalez, an insur gent leader, his adjutant, and several others. Bills have been passed establishing a board of health for the Philippines, and providing for laboratories in connection therewith. Gen. Chaffees staff appointees are as follows Adjutant general. Col. William P. Hall quartermaster general, Brj - Gen. Charles F. Humphrey inspector general, l.ieut.-Col. Joseph P. Sanger, and military secretary, Capt. Grote Hutcheson, Sixth Cavalry. Four American prisoners who escaped from Calapan, Mindoro, June 25 in a sailboat, have been recaptured. Several insurgent officers and 350 bolo- men have voluntarily taken the oath of allegiance at Cuino, province of B?taan. Capt. Adams, with ten men, scouting in Albay province, lias killed ten insurgents and captured a Filipino captain and ten"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "military secretary, Capt. Grote <mark>Hutcheson</mark>, Sixth Cavalry. Four American"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "military secretary, Capt. Grote <mark>Hutcheson</mark>, Sixth Cavalry. Four American"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2055.57, 547.95, 2223.92, 773.25], "bbox_id": "f515a85811", "file": "AppomattoxNewspapers_1936-1939a_0030.pdf", "page": 1, "text": "The October term of the circuit court of Appomattox county, with Judge Robert F. Hutcheson presid ing, will convene here Monday, at 10 A.M . The probability is that there will be only three indictments, and that the matters to come before the court can be disposed of in two days. Nevertheless the usual large attendance at court sessions here is expected. For the first time in a decade, prisoners confined in the county jail made good an escape last week-end. Three negro prisoners opened a hole in the brick wall opposite their se cond flood cells early Friday morn ing and lowered themselves down a blanket-ladder to freedom. They pried the bricks loose during the night, without awakening a fourth prisoner in the same cell. Saturday afternoon one of the ea-"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "with Judge Robert F. <mark>Hutcheson</mark> presid ing, will convene"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "with Judge Robert F. <mark>Hutcheson</mark> presid ing, will convene"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1374.95, 535.09, 1531.4, 814.04], "bbox_id": "29a5915d25", "file": "AppomattoxNewspapers_1908-1909a_0408.pdf", "page": 1, "text": "The Lynchburg Chamber of Commerce enjoyed having the Supervisors, Bankers mid Dem onstration Agents as guests at a luncheon at th e Virginian Hotel. Mr. W. W. Dickerson welcomed the visitors. Mr. C. C. Taylor of V. P. I. spoke on the protective tariff for farmers and denied that it would afford them any relief. Director J. R. Hutcheson on extension work explained to those present the objects of the conference. Col A. E. Strode spoke of the con ditions of the receivership of the Cooperative Tobacco Association saying that there was about 20.- 000,000 pounds of tobacco on hand. . ......... -  ... APPOMATTOX FIRES BURNED 1011 ACRES By District Forester J. P. Andrews"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "relief. Director J. R. <mark>Hutcheson</mark> on extension work explained"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "relief. Director J. R. <mark>Hutcheson</mark> on extension work explained"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.3, 555.61, 1535.63, 793.91], "bbox_id": "34017034ac", "file": "AppomattoxNewspapers_1926-1933a_0408.pdf", "page": 1, "text": "The Lynchburg Chamber of Commerce enjoyed having the Supervisors, Bankers and Dem onstration Agents as guests at a luncheon at th e Virginian Hotel. Mr. W. W. Dickerson welcomed the visitors. Mr. C. C. Taylor of V. P. I. spoke on the protective tariff for farmers and denied that it would afford them any relief. Director J. R. Hutcheson on extension work explained to those present the objects of the conference. Col. A. E. Strode spoke of the con ditions of the receivership of the Cooperative Tobacco Association saying that there was about 20,- 000,000 pounds of tobacco on hand."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "relief. Director J. R. <mark>Hutcheson</mark> on extension work explained"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "relief. Director J. R. <mark>Hutcheson</mark> on extension work explained"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1724.67, 1293.87, 1890.62, 1415.27], "bbox_id": "3b77580244", "file": "AppomattoxNewspapers_1936-1939a_0035.pdf", "page": 1, "text": "The joint Achievement program of the County Farm and Home Co workers will be held on Friday Oct ober 20, at the Appomattox high school auditorium. John R. Hutcheson, director of the Extension Division, Blacksburg, will be the principal speaker for the occasion. Complete details for the program will be announced by Miss EHa Smith, home demonstra tion agent, and R.B . Hudgins, co unty agent in next weeks paper."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "school auditorium. John R. <mark>Hutcheson</mark>, director of the Extension"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "school auditorium. John R. <mark>Hutcheson</mark>, director of the Extension"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1542.44, 526.32, 1709.79, 1084.22], "bbox_id": "292d7cf74d", "file": "AppomattoxNewspapers_1952-1954a_0051.pdf", "page": 1, "text": "The Hixburg Presbyterian Church and the Mathews Baptist Church will observe the Sesquicentennial of old Mathews Church, which was a union church from which both of these churches came. Chaplain Richard S. Hutcheson, Moderator of the West Hanover Presbytery, will preach at the Hix burg Presbyterian Church on Sun day, August 31, at 1030 oclock. The historical background of these churches will be of interest throughout the state, to many who once lived here or whose ancestors worshipped in that church. At the time a Sabbath School was organized, this portion of Ap pomattox was a part of Prince Ed- ,vard County, and the records there show that later a lot of about two acres was given by Dr. J. Walker on which a Union Church was to be built. This was to be used by any denomination-, ---Sstestant or Catho- lie. On the grounds oaks were planted by twos to form a W. Some of these are still there. At the time of the War Between the States, Capt. William Mathews, a veteran of the War of 1812, own ed the farm surrounding the church. When General U. S. Grant and his army passed through the farm, Capt. Mathews, to retard Grants progress to Appomattox, invited him to spend the night in the Mathews home. General Grant declined, and Capt. Mathews replied, You will come back from Appomattox faster than you went up there. The next day, Gen. Grant stopped along the same red clay road, and told Capt. Mathews that he knew Lee was going to surrender when he went up there. The little church, with a plank nailed down the middle to separate the ladies from ths gentleman, was near the road, but the Northern soldiers did it no harm. In the grove where once was the Union Church now stands the Hix burg Presbyterian Church. On an adjoining lot is Mathews Baptist Church."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "came. Chaplain Richard S. <mark>Hutcheson</mark>, Moderator of the West"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "came. Chaplain Richard S. <mark>Hutcheson</mark>, Moderator of the West"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.9, 523.84, 2249.33, 1128.33], "bbox_id": "e9ac4fd0cd", "file": "AppomattoxNewspapers_1943-1947a_0600.pdf", "page": 1, "text": "The following article is from the A Told to Cappy column in Oh Petersburg, Va. Progress and In dex Appeal of March 14 My friend, Burke Steele, has he unusual honor of being the , . . . . . youngest president of the oldest   y . sent the following invitation bank in the oldest state in the Uni-  dary attnd 8 meet ted States - president of the Peters- in here next Wednesday burg Savings and American Trust j There will be a meeting of the Company cf Petersburg, Va. dairy farmers at 1030 A. M.,. on Well, there was one thing in   ednsdayL  8rC 8t th Ap particular that I always liked about   a x  8  Burke, and that was the respect j Dairy farmers should never lose artd love that he had for his grand- sight of the fact that improvements daddy - a prominent Virginia bank- must b made in feeding the dairy er of the old gchool. cow, breding, pastures supplying i   280 days grazing, and marettngof One morning, not so long ago, I was sitting in Burkes unpreten-  2 awn  0Ue tious office in the bank, and during   the course of my visit Burke hap-, Knowing that sagny of yeu are pened to glance out of his office producingmilk and others will aeon door onto the banking floor. Be begin their first production, we noticed an elderly gentleman wan- have arranged the following pro dering about and who aeemod to be gram.  ll at ease in his surroundings. Turke immediately excused him- We are fortunate Jn securing a ef and took particular pains to   Connelly, dairy specialist Dk. ee to it that the old gentleman T. B. Hutcheson, dean of agricud was properly guided and received ture H. E. McSwain, district 4f- he business courtesies of the bank. Kent, and George Coble, of Coble Dairy Products, Inc., to discuss iin- Returning to his office, Burke portant dairy subjects. said, Cappy, that old gentleman minds me of a story having to The program lo with my grandfather. The Bank i 030, Introduction, by R. B f Appomattox, the firrt bank m Hudgina County Agent. bat county, was opened in 1901, _ .. . . . if which my grandfather, Richard . end Management 1?. Burke  for whom I was named R. G, Connelly, fis cashier and later president.He Gairy Specialist, really had to teach many of his 1100- Discussion, ural customers a good many things 1116- Pasture and Hay La Hout banking. It seems that he System of Dairying, Dr. T ?d a customer, a very fine old Hutcheson, Dean o i Agriculture, man retired from work, whose only ll45. Discussion, banking experience consisted ofde-  Summarization, by H. I oostme savings in a city .bank MaSwain district Agent, some 30 miles away. .  _  . , . . . 1230- Adgourn . for lunch. One cold and snowy morning i 3o. Artificial Breeding. R.  e rode horseback about 10 miles Connelly, Dairy Specialist. Lo the bank and handed the aasia- artt cashier his montHy stateliest, asked if there was any error in it, to which he replied, No sis, it checks to the penny, but Yu know old man Dick Burke means what he says, and in the left hand omer of this envelope it said, Re turn to the Bank of Appomattox in five days. Today is the fifth day nd if I had not brought it back there would be Hell to pay."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "old gentleman T. B. <mark>Hutcheson</mark>, dean of agricud was"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "old gentleman T. B. <mark>Hutcheson</mark>, dean of agricud was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1864.29, 794.53, 2035.88, 1110.13], "bbox_id": "b16c6104d9", "file": "AppomattoxNewspapers_1943-1947a_0013.pdf", "page": 1, "text": "The feed shortage may lead lo  food sho tage as far as Virginia., production is concerned, directoi Hutcheson told a group of profes ional wor! r in a special meeting aere this i orning. Just how ser ious the feed crisis will become, it s difficul io predict, but we d now that it will .be bad enoug nd that Virginia farmers shoulc egin now to take such steps as hey can to produce all the live ock feed their farms are capable  producing. It is estimated that were the .eed available, -Virginia farmers vquld buy from western states wice as much this winter as they lid iast winter. But the high corn log ration, the unusually large .lumbers of livestock in and near he guiin producing areas, eavy demands from grain-using iidustries.have greatly.. reduced th h .low of feed grains Virginia farmers have but two alternatives,  Hutcheson pointed out.  They must produce much more of their own feed or make some reduc.ion in livestock num bers. Except for the dispersal of low producing animals, we want if possible to avoid any great red-uc-"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "production is concerned, directoi <mark>Hutcheson</mark> told a group of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "production is concerned, directoi <mark>Hutcheson</mark> told a group of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [302.4, 1147.88, 459.95, 1766.6], "bbox_id": "3c87660cfb", "file": "AppomattoxNewspapers_1902-1905a_0334.pdf", "page": 1, "text": "The Electric Railroad for Ap pom attox. On las! Thursday a large Dumber .of represbnative men of Appomattox and Charlotte counties met at the Red House for the purpose of organizing capital to construct au elietric railway from Appcmut- iix station, on the Norfolk and Wes tern Railway to Drakes Branch, on he Southern Railway. It is pro posed to run this road by Red House, which is on the border of the two counties, and by Charlotte Court house to Drakes Branch. Mr. Frank S. Jennings was cho sen to preside over the meeting and Mr. C. M. Hutcheson was elected secretary. A company was organized with the following officers and members President, B. P. Eggleston, of Drakes Branch Vice President S. L. Ferguson, of West Appomattox Treasurer, E. C. Thornton, of Char lotte Courthouse Secretary, C. M. Hutcheson, of Charlotte Courthouse Directors Colonel Joseph Button, of Walkers Ford J. P. L. Fleshman, of West Appomattox J. C. Jones of West Appomattox H. D. Flood of West Appomattox E. C. Marshal of Red House W. F. Cuuniughani, of Red House J. C. Carrington, W. H. Smith, of Chariotte Couithouse George B. Russell, P. W. Payue, of Drakes Branch G W. Berkley, of Rough Creek Charter members H. D. Flood, J. C. Jones, J. R.Hors ley, S L. Feiguson, J. P. L. Flesh- man, J. R. Atwood, R. F. Burke, C. W. Hancock, Dr, J. B. Abbitt, L. E. Smith, J. T. Moses, J.L. Driskill, W H. Lewis. W, T. Collins, L. C. Mar shall, C. P. Marshall, W. F. Cun ningham, F. S. Jennings, lr G. W. Jones, L. P. Bailey, G. W. Berkley, W. H. Webb. W. M. Berkley. John W. Elam. C. M. Hutcheson A.L.Cox B. P. Eggleston W. H. Smith, J. E. Robertson, J. C. Carrington, F. C. Thornton, W. G. Williams, W. E. Scott, S. C. Daniel, George B. Rus"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and Mr. C. M. <mark>Hutcheson</mark> was elected secretary. A"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and Mr. C. M. <mark>Hutcheson</mark> was elected secretary. A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.5, 1191.05, 2075.8, 1312.39], "bbox_id": "a1218b28c4", "file": "AppomattoxNewspapers_1943-1947a_0263.pdf", "page": 1, "text": "The Board of Visitors of V. P. I. at its August 14 meeting named Dr. John R. Hutcheson to head the institution, and L. B. Dietrick to 1 be director of the Agricultural Ex tension Service. Dr. Hutcheson was director of the Extension Service for more than 25 years. He was made act ing president last January and now takes full charge of the af- . fairs of the States land-grant col- ___ has 1 lege which was established in 1872 jeep bushes down on more land"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "named Dr. John R. <mark>Hutcheson</mark> to head the institution,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "named Dr. John R. <mark>Hutcheson</mark> to head the institution,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [594.96, 196.13, 734.76, 457.42], "bbox_id": "9a5b2aef07", "file": "AppomattoxNewspapers_1974-1975a_0489.pdf", "page": 1, "text": "The avenge person if asked how many Americans were victims of high biood preaaure probably wouldnt come doee in his guess. It is estimated 23 million Americans have high blood-pressure in one of its several forms and that 1 in 6 adults is probably affected. In order to provide the people of Southside Virginia with an opportunity to have their blood-pressure checked at no charge. The Exchange Club of Farm ville, with the coopera tion of the Virginia affiliate of the American Heart Associa tion, and assistance of local medical personnel, will hold a Blood-Pressure Screening on November 22,1975. Location of the screening will be the offices of Drs. C. E. Hutcheson. Jr. and Paul P. Hicks, Jr. in the College Plaza Shopping Center in"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "of Drs. C. E. <mark>Hutcheson</mark>. Jr. and Paul P."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "of Drs. C. E. <mark>Hutcheson</mark>. Jr. and Paul P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [216.7, 680.19, 882.09, 749.5], "bbox_id": "33bf145a7d", "file": "AppomattoxNewspapers_1908-1909a_0131.pdf", "page": 1, "text": "That Injunction out buildings. The land is well watered, and all can be profitable worked. Terms -An injunction-bill was pre sented to Judge Hutcheson At Charlotte C. H. Monday by at-"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "pre sented to Judge <mark>Hutcheson</mark> At Charlotte C. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "pre sented to Judge <mark>Hutcheson</mark> At Charlotte C. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.02, 704.13, 1511.92, 921.33], "bbox_id": "4d07a39611", "file": "AppomattoxNewspapers_1926-1933a_0389.pdf", "page": 1, "text": "T. Price of Brookneal, was je yesterday and it is said bed his brick store building to new garment factory. isses Verta and Emma Smith Mr. Don Moses attended the eral of Mrs. Hunter Smith in etteville, N. C., Tuesday. isses Vay Abbitt and Mary y Irby, of Farmville S- T. C., nt the week-end in the home rs. J. E. Sears here. udge Hutcheson will hold ecial term of his court on May 28th for the trial artinBurge and State k of Pamplin cases."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "E. Sears here. udge <mark>Hutcheson</mark> will hold ecial term"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "E. Sears here. udge <mark>Hutcheson</mark> will hold ecial term"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1626.26, 657.29, 1951.27, 676.89], "bbox_id": "cb46f1eb41", "file": "AppomattoxNewspapers_1905-1912a_0302.pdf", "page": 1, "text": "T. B. Hutcheson. I daughter. Miss A unie., visited friends 1-30-230 Practice in corn jndg- 8 ."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "T. B. <mark>Hutcheson</mark>. I daughter. Miss A unie., visited friends 1-30-230 Practice in corn jndg- 8 ."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "T. B. <mark>Hutcheson</mark>. I daughter. Miss A unie., visited friends 1-30-230 Practice in corn jndg- 8 ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [995.76, 481.72, 1167.59, 647.02], "bbox_id": "a25fc1b9d1", "file": "AppomattoxNewspapers_1939-1943a_0355.pdf", "page": 1, "text": "Still higher goals of production, especially inmilk, pork, poultry and beef have been set for Virginia farms in 1942, and attaining these goals will create many problems. There will, of course, be the pro blem of shifts in production. Some ocalities will have difficulty in find ing farm labor. More equipment and I more fertilizer will be needed. Social  changss are likely to take place. ! These are but a few of the highly important problems tiîat Virginia fanners are facing, says John R. Hutcheson, dirèctor, Virginia Agri cultural Extension Division and al ready steps are being taken toward finding the right answers."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "facing, says John R. <mark>Hutcheson</mark>, dirèctor, Virginia Agri cultural"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "facing, says John R. <mark>Hutcheson</mark>, dirèctor, Virginia Agri cultural"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [891.62, 155.16, 1035.57, 438.75], "bbox_id": "4d82d67da7", "file": "AppomattoxNewspapers_1974-1975a_0529.pdf", "page": 1, "text": "state DE supervisors to develop plans for a national organization. The first con ference that fed to the adoption of a resolution to form a m anual organization was held in Memphis. Tennessee in 1947. The 17 charter member states were Arkansas, Georgia, Indiana. Kansas. Kentucky. Louisiana. Michigan, Missouri, North Carolina. Ohio, Okla homa. South Carolina, Tenn essee. Texas, Utah, Virginia and Washington. The growth and develop ment of DECA has been rapid, according to Hutcheson. Many interested educators and busi ness organizations have given their advice, their cooperation and their support. Past growth and plans for the future give every indication that DECA is destined to become one of the leading student organizations of our time, he added."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "been rapid, according to <mark>Hutcheson</mark>. Many interested educators and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "been rapid, according to <mark>Hutcheson</mark>. Many interested educators and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.59, 326.92, 1689.45, 806.36], "bbox_id": "80ea2b30fa", "file": "AppomattoxNewspapers_1952-1954a_0342.pdf", "page": 1, "text": "SPEAKERS NAMED FOR THE ANNUAL EXTENSION CONFERENCE Discussions on agricultural poli o s __ in Virginia and in the nation are on the agenda for the VPI Agricultural Extension Services an nual conference, August 24-28. Virginias Extension Service poli cies will be discussed on the open ing day by W. H. Daughtrey, asso ciate director. Turning the Searchlight on Agri cultural Policies will be the topic of an address by J . C. Bottum, Pur due University economist, August 27.Other speakers for the opening sessions will include VPI President Walter S. Newman, who will discuss needs  of VPI and H. C. Sanders, director of the Louisiana Extension Service, who will discuss The Fu ture of the Agricultural Extension Service. August 26 will be devoted to sub ject matter sessions, and to meet ings of the Virginia Farm and Home Agents Associations. T. M. Hepler, Montgomery county agent, will preside over the farm agents sessions Mrs. Lela Atkinson, Bed ford home agent, will preside oyer the home agents sessions. Initiation of new members of Epsilon Sigma Phi, honorary Extension Service organization, is scheduled for Wed nesday night. Other speakers will include E. W. Aiton, USD A Extension Service T. R. Timm, economist at Texas A  M Dr. John R. Hutcheson, chancellor at VPI George F. John son, visual aids specialist, Pennsyl vania State College and Miss Ame lia Fuller and K. E. Loope, of the VPI staff."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "M Dr. John R. <mark>Hutcheson</mark>, chancellor at VPI George"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "M Dr. John R. <mark>Hutcheson</mark>, chancellor at VPI George"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1478.33, 576.12, 1646.13, 1033.76], "bbox_id": "1bddc9cdce", "file": "AppomattoxNewspapers_1926-1933a_0095.pdf", "page": 1, "text": "Southern Women is the name of a new book donated to the school library here by U. D. C. Chapter. Mens and womens cotton hose 9c. 36 inch bleached and un bleached cotton 9c, thick pencil tablets 4c, lots of other similar values. Inges Novelty Shoppe. It was an inspiring scene on Main Street Sunday morning to see fifty mules pass along on way to the convict camp near h9re, where they will be engag ed in grading the State highway. Cole Loving, every inch a road man headed the drove.  Judge Hutcheson called the attention of the bar to a meet ing of the lawyers of his circuit to be held in Farmville on the 18th to send delegates to the State Bar Asso. meeting to con sider legislation proposed by members of the association. Mr. and Mrs. E. M. Schaubach motored up from Crewe last Saturday to visit the latters parents, Mr. and Mrs. R. E. Caldwell, Sr. On Sunday they were accompanied by Mr. H. B Marshall, Misses Grace and Fanie Caldwell, all motored up to Buf falo Station, and spent the day in the home of Mr. and Mrs Samuel M. Golladay."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "headed the drove.  Judge <mark>Hutcheson</mark> called the attention of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "headed the drove.  Judge <mark>Hutcheson</mark> called the attention of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1292.15, 603.04, 1465.9, 696.59], "bbox_id": "62fbe822aa", "file": "AppomattoxNewspapers_1939-1943a_0163.pdf", "page": 1, "text": "Slratford, Sept. 25.- The Robert E. Lee Memorial Foundation an nounced today that Mrs. Clara Dris coll, of Corpus Christi, Texas, and Judge Joseph C. Hutcheson, of1 Houston, Texas, would be the prin cipal speakers at Stratford on Oct ober 12, on the occasion of the an nual Robert E. Lee Memorial pro gram to ibe presented there"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and Judge Joseph C. <mark>Hutcheson</mark>, of1 Houston, Texas, would"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and Judge Joseph C. <mark>Hutcheson</mark>, of1 Houston, Texas, would"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "J. Hundley, Robt. F. <mark>Hutcheson</mark> and Joel W. Flood."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "J. Hundley, Robt. F. <mark>Hutcheson</mark> and Joel W. Flood."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2314.09, 596.25, 2488.05, 921.14], "bbox_id": "101680fdf7", "file": "AppomattoxNewspapers_1949-1952a_0373.pdf", "page": 1, "text": "Seottsville,The wedding of Miss Billie Jane Burcher, daughter of Mr. and Mrs. William Lewis Burcher of Howardsville, and Edward Grady Covington, Jr., son of Mrs. C. C. Buie of Jackson, Miss and E. G. Covington, of Summer Hill, Albe marle County, was solemnized in the Seottsville Presbyterian Church at 330 oclock Sunday, June 3. The bride entered the church with her father, who gave her in mar riage. She wore an afternoon dress of white embroidered marquisette over white taffeta. She carried a white prayer book topped with a white orchid. Miss Nancy Peters, of Howards ville was the only attendant of the bride. E, G. Covington was his sons best man. The double ring cere mony was performed by the Rev. R. G. Hutcheson, pastor of the Presbyterian Church, assisted by the Rev. Jack B. Taylor, of the Methodist Church. Mr. and Mrs. Covington left Sun day night for a Southern wedding trip, which will take them to visit his mother in Jackson, Miss."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "the Rev. R. G. <mark>Hutcheson</mark>, pastor of the Presbyterian"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "the Rev. R. G. <mark>Hutcheson</mark>, pastor of the Presbyterian"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2144.12, 541.98, 2332.03, 1109.28], "bbox_id": "a438b7e618", "file": "AppomattoxNewspapers_1939-1943a_0101.pdf", "page": 1, "text": "Saturday, May 25, is the date for the referendum oh the creation of the proposed Bobert E . Lae Soil Conservation Djstridb. Voting will take place between the hours of 9 A, M. end 6 P .M . and in Appo mattox county voting placeo will be open at the following placeo Stone wall school, , Spout Spring school, Evergreen school, and Pamplin, Hix- .  burg and Appomattox. Votes may . be cart at any of these places, re-.-j, gardless of where in the prosposid district the vover resides. The pro- posed district .will include Bucking-  , ham and Campbell counties and au .  of Appomattox county except an are i n the northwest portion.  of the county which is excluded, B. B. Hudgins, county agent sd- . vises thalt any person holding title to three or more acres oif land i n - , , the proposed district, may vote.The votes will be checked against the land books .before the results of tin election are announced, The state committee on soil con servation districts is composed of the following outstanding agrieuttur . al leaders Dr. J . R. Hutcheson, ... director of the extension division D r. A . W . Drinksrd, director of ,. the state experiment stations Dr Hyman Carrier, coordinator of tbs soil conservation service L . M . Wal- . ker, state commissioner of agricul ture and J . R. Horseley, superin tendent of the Appomattox soil con servation experiment station. W , W. Scott, chairman of the Appomattox county Agricultural ad visory Board, has released  state ment endorsing the establishment of a Soil Conservation District, aa fol lows We, the merchants and butine as men of the county of Appomattox, in conference assembled for consid eration of the establishment of a Soil Conservation District inclusive  of Appomattox county, upon mature- consideration of thé material advan tages to the econoriric welfare of the people generally and as a contribu tion to tiie future security at the corinty, state and nation and prosperity of our farmers Unqualified ly endorse the formation of the pro posed District end heartily recom mend favorable action by the land owners in the referedum to be hold.  10-17-39"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "leaders Dr. J . R. <mark>Hutcheson</mark>, ... director of the extension"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "leaders Dr. J . R. <mark>Hutcheson</mark>, ... director of the extension"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1938.28, 1041.93, 2098.43, 1069.22], "bbox_id": "b4a1638358", "file": "AppomattoxNewspapers_1933-1936a_0465.pdf", "page": 1, "text": "Robt. F . Hutcheson, Judge. A copy Teste C. W. Smith, Clerk."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Robt. F . <mark>Hutcheson</mark>, Judge. A copy Teste C. W. Smith, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Robt. F . <mark>Hutcheson</mark>, Judge. A copy Teste C. W. Smith, Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1637.69, 344.76, 1809.84, 822.76], "bbox_id": "c81e2fb3b0", "file": "AppomattoxNewspapers_1939-1943a_0275.pdf", "page": 1, "text": "Richmond, Va., April 30.- Rural Virginia does not realize the ser iousness of the world war situation as it affects America, the State De fense Council was told By Dr. John R. Hutcheson, director of the VPi Extension School and chairman of the Radford regional defense coun cil.I know our country people, Mr. Hutcheson said. Our most pressing problem now it to get them to un derstand the seriousness of the issues confronting America.  Having accomplished many initial defense tasks, the State Council and regional councils are now asking where do we go from here,  Gov ernor Price was informed. General James A. Anderson, State Defense co-ordinator, said the army should guard railroad bridges and prevent sabotage, or ask the State to _ as sume this protective role. Washing ton will tell us, or we must tell them, General Anderson said. Asked by Governor Price what the General Assembly could do to extend public health service in the State, Dr. I. C. Riggin, State Health Commissioner, declared the most constructive step would be to provide county health units in the 52 counties not now rendering this essential function. Dr. Douglas S. Freeman, State Council chairman, emphasized that America is the only ?.ee _ nation able to furnish arms to resist world agressors. Defense activities at this stag would be diverted, General Ander son said, by building air-raid shel ters and evolving civilian evacua tio nplans. Immediate problems, he said, concern access highways, housing, machine tool inventories, public health a!t concentration points and soidier-sailor recreation. A review of Virginia defense act ivities in the past year shows the. following highlights"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "By Dr. John R. <mark>Hutcheson</mark>, director of the VPi"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "By Dr. John R. <mark>Hutcheson</mark>, director of the VPi"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.95, 575.86, 1693.69, 714.79], "bbox_id": "ffe2c1f286", "file": "AppomattoxNewspapers_1947-1949a_0122.pdf", "page": 1, "text": "Richard B. Car ter, son of Mr. and Mrs. Thorn ton Carter, R.F. D. 3, Appomat- .....  _ __ tox, has, been a- WHmm. awarded a onle- year scholarship to the Virginia Polytechnic Insti tute, it has been announced by T. B. Hutcheson, dear, of the agri"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "announced by T. B. <mark>Hutcheson</mark>, dear, of the agri"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "announced by T. B. <mark>Hutcheson</mark>, dear, of the agri"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1510.54, 668.67, 1923.68, 873.82], "bbox_id": "8f841edcf0", "file": "AppomattoxNewspapers_1933-1936a_0460.pdf", "page": 1, "text": "REYNOLDS Gilliam, if any there be, do on the I 30th day of May, 1936, at 1000 oclock A .M ., before the Judge of the Circuit Court of Appomattox County, Virginia, at his office at Charlotte C .H ., Va., show cause, if any they can, against the payment and delivery of the money and other estate of the said Floyd A . Gilliam, deceased, to his heirs and legatees, without requiring a refunding bond of them or any of them. It is is further ordered that a copy of this order be published once a week orv four successive weeks in The Times Virginian, a newspaper published in Appomattox County, Virginia. Robt.F. Hutcheson, Judge. A copyTeste C. W. Smith, Clerk."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Appomattox County, Virginia. Robt.F. <mark>Hutcheson</mark>, Judge. A copyTeste C."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Appomattox County, Virginia. Robt.F. <mark>Hutcheson</mark>, Judge. A copyTeste C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.14, 851.83, 1849.54, 969.07], "bbox_id": "8bbc4f3100", "file": "AppomattoxNewspapers_1918-1922a_0234.pdf", "page": 1, "text": "Rev. E- F. Burnett, of Green I detained l county, has accepted a call to I mac coun the Baptist field of churches I cided that Hollywood, Rocks, Central and j young to ti Reedy Spring, provided be can u 0 other qi get suitable home for his fa m i-L red hv t ly here. We would be glad to I Hutcheson have Mr. Burnett and his fami- Accomac,  ly here and feel that he will be L f Appomt a blessing to U 8 . j defense an j"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "be glad to I <mark>Hutcheson</mark> have Mr. Burnett and"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "be glad to I <mark>Hutcheson</mark> have Mr. Burnett and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1501.43, 845.19, 1661.37, 1089.74], "bbox_id": "77929192fa", "file": "AppomattoxNewspapers_1926-1933a_0375.pdf", "page": 1, "text": "R. H. Wright farm will be sold Tuesday at 1030 in lots Attend this auction sale. See advertisement on first page. WHITE,, JUNE Seed Pota toes for sale at G. W. Lewis farm. 1.75 per bushel. The best potatoes on earth. See us today. ISAAC LEWIS  BRO., 6-6-3t  Appomattox, Va. Judge Hutcheson adjourned his court here Saturday until June 13th, at which time he ex pects to finish, tip the term.. Only one or two law cases and some chancery matters were disposed of. Miss Emily Harvey enter tained at a lovely bridge party"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "6-6-3t  Appomattox, Va. Judge <mark>Hutcheson</mark> adjourned his court here"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "6-6-3t  Appomattox, Va. Judge <mark>Hutcheson</mark> adjourned his court here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1699.92, 567.44, 1868.8, 1458.95], "bbox_id": "f5d0831a8b", "file": "AppomattoxNewspapers_1954-1955a_0223.pdf", "page": 1, "text": "R. B. Hudgins, Appomattox Coun ty Agent since the spring of 1926, will retire March 31, according to announcement made this week. The veteran agricultural leader will be succeeded here by James A. Smith, a native of South Carolina and a graduate of Clemson College. Mr. Smith, 29, is at present assistant agent in Halifax County. He is a veteran of World War II, and dur ing his work with the Extension Service has won recognition for his activities with 4-H Clubs, as well as general assistance to farmers. The retirement of Mr. Hudgins will be made the occasion for a testimonial banquet, scheduled for Thursday night, March 10. Leaders of the V. f. I. Extension Service will join with local farmers and business men in honoring Mr. Hud gins. The banquet, scheduled for the school cafeteria, will include among its distinguished guests Dr. John R. Hutcheson, of V. P. I., and Judge Edwin W. Hudgins, Chief Justice of the Supreme Court of Virginia. He is a brother of R. B. Hudgins. The banquet is being arranged by the County Agricultural Board. Rueben Boatwright Hudgins is a native of New Canton, Bucking ham County. He attended Fork Un ion Military Academy and attended Virginia Polytechnic Institute. He served with the old Tri-State Tobacco Growers Association from 1922 until 1926. He is a Mason, a member of Liberty Baptist Church, and has received many honors dur ing his career in Extension work. Extension work began in Appo mattox in 1911. Major J. W. Flood was the first county agent and served from 1911 to 1913. Major Flood used horseback and a buggy to cover the county preaching the theory that a program and lime apd legumes would increase yields and make profits for farmers. His per sonality was an inspiration to farm ers and Major Flood declared that we could produce more corn and other crops on farmland by using smart methods.  In 1914, Bernard G. Anderson became the Appomattox County A- gent. He was the first agent ap pointed under the Smith-Lever Act. He was a 1906 graduate at V. P. I., and had served as assistant at the V. P. I. Experiment Station under E. H. Mathinson. He served as the county agent here until 1918, and is affectionately respected by every citizen of the county for his long career in farm, school and church activities. Mr. Anderson is now re tired and resides at his home here. W. H. Byrne succedded Anderson as county agent, iq 1918. He serv ed for even years. He was not above taking the handles of a plow to show farmers how to use the ridge system of cultivating tobacco and corn. He worked day and night showing farmers how to mix fertili zers, and better their ways of do ing things.. And then from his of fice he directed a variety of activi ties, such as 4-H Clubs. All the while he preached the worthwhile ness of Extension Service to farm ers. His efforts attracted wide at tention and he moved up in promo tion in 1926. Continued on Page Eight"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "guests Dr. John R. <mark>Hutcheson</mark>, of V. P. I.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "guests Dr. John R. <mark>Hutcheson</mark>, of V. P. I.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.07, 733.67, 1849.52, 948.62], "bbox_id": "2b087b7d82", "file": "AppomattoxNewspapers_1918-1922a_0358.pdf", "page": 1, "text": "Quite a nut tox people aitf dleys court terday the habeas corpul H. A. Odor tol of his 2 year s detained by mey county, cided that tb young to takel No other quesl ered by the f Hutcheson ar Accomac, and of Appomattij defense and plaintiff."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "ered by the f <mark>Hutcheson</mark> ar Accomac, and of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "ered by the f <mark>Hutcheson</mark> ar Accomac, and of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [724.79, 742.08, 878.99, 956.08], "bbox_id": "fc42b0552b", "file": "AppomattoxNewspapers_1918-1922a_0359.pdf", "page": 1, "text": "Quite a number of Appomat tox people attended Judge Hun dleys court at Farmvjlle yes terday the occasion being a habeas corpus proceeding by H. A. Odor to obtain possession of his 2 year old son, which is detained by his wife in Acco- mf county. The Judge de cided th at the baby was too young to take from its mother.  io other question was consid ered bv the Judge. Messrs. Hutcheson and D aughtery of Accomac, and S. L. Ferguson of Appomattox, appeared for defense and A. H. Clement for plaintiff."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "bv the Judge. Messrs. <mark>Hutcheson</mark> and D aughtery of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "bv the Judge. Messrs. <mark>Hutcheson</mark> and D aughtery of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2196.95, 1682.92, 2361.45, 1720.77], "bbox_id": "764aad62c8", "file": "AppomattoxNewspapers_1939-1943a_0447.pdf", "page": 1, "text": "President Roosevelt ha reappoint ed Sterling Hutcheson as the United States attorney for the Eastern Dis trict of Virginia."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "President Roosevelt ha reappoint ed Sterling <mark>Hutcheson</mark> as the United States attorney for the Eastern Dis trict of Virginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "President Roosevelt ha reappoint ed Sterling <mark>Hutcheson</mark> as the United States attorney for the Eastern Dis trict of Virginia."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [468.7, 339.25, 626.86, 612.55], "bbox_id": "9420091b82", "file": "AppomattoxNewspapers_1922-1923a_0121.pdf", "page": 1, "text": "Prepared by the United States Department of Agriculture. Wakefield farm, Westmoreland coon- ty, Virginia, has been enrolled In the Better Slres-Better Stock movement conducted by the various states and the United States Department of Agri culture. This Is the farm where George Washington was born In 1732, and the present occupants, Latane Brothers, come from straight Washing ton stock. It Is noteworthy that pure bred sires of good quality are hence forth to be used for all classes of live stock raised on this farm which Is fa mous as the birthplace of the Father of His Country. The stock on the his toric estate include cattle, horses, swine, sheep and poultry. All sires are now purebred the females are purebred, crossbred, and grade, and are to be gradually improved. County Agent L. M. Walker, Jr., In terested Latane Brothers In the na tionwide movement for Improved live stock, and John It. Hutcheson, director of extension for Virginia, regards the enrollment as of particular inter est since George Washington was a good farmer and a lover of good stock."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "stock, and John It. <mark>Hutcheson</mark>, director of extension for"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "stock, and John It. <mark>Hutcheson</mark>, director of extension for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.04, 1059.57, 1882.29, 1290.6], "bbox_id": "85f44d9f43", "file": "AppomattoxNewspapers_1952-1954a_0306.pdf", "page": 1, "text": "PLANNING NOW FOR VA. FAIR THIS FALL Richmond,- Va., July 1.- Eight members of the Agricultural Advis ory Committee of the Atlantic Ru ral Exposition headed by Dr. John R. Hutcheson, chancellor of V. P. I.i met with the executive committee of the State Fair here and outlined a program to extend the usefulness of the Exposition to the rural popula tion of Virginia, R. O. Glover, execu tive vice president said today. The committee, representing the major organized farm groups, will seek to stimulate more and better exhibits by men, women, boys and girls from all parts of the state will stimulate local press and radio coverage of participants in the fair, and will outline the aims and pur poses of the fair to all affiliated groups."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "by Dr. John R. <mark>Hutcheson</mark>, chancellor of V. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "by Dr. John R. <mark>Hutcheson</mark>, chancellor of V. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1471.43, 468.19, 1622.62, 554.89], "bbox_id": "40ee35f33e", "file": "AppomattoxNewspapers_1939-1943a_0093.pdf", "page": 1, "text": "Pay Tribute To Late Judgi Hutcheson"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Pay Tribute To Late Judgi <mark>Hutcheson</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Pay Tribute To Late Judgi <mark>Hutcheson</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1317.09, 610.32, 1545.93, 958.76], "bbox_id": "4a49ece87d", "file": "AppomattoxNewspapers_1908-1909a_0086.pdf", "page": 1, "text": "p, of Lynch-1 1015-1045 Soybeans adapted irents, Mr. J to Appomattox, Geo. W- Patte- Hast week. jaon. hiring g o o d s  lO45-ll00 Discussion, pm over be-1 1100-1130 Forage crops for Ife. hogs, T. B. Hutcheson. Shnet. Shop. I H30-ll45 Discussion, uger of this! 1145-1200 Club work and its jng distance I importance to the boys and girls I djed last I of Appomattox. 1200-100 Lunch. L m 0f w I 100-130 Soil fertility, T. B. b a visit Hutcheson. Ft today fori 130-145 Discussion, wo children. 145-215 Producing feeds and ...  feeding the farm cow, Geo. H. ng_ wjL-g  Corry, Asst. Husbandman.  on display! I 215-230 Babcock test for,   milk, Eugene Carson and Rich- Bonnet Shop.  ard Jenkins. yf Appomat- 230-800 The importance of powers took of seed, Geo. W. Patteson. 25 for his 300-315 Discussion, jacco in he 13 a-m- to 300 P- m  Pul- j to have a Prof- A- L. Dean.  There has been no time in the , I history of this generation that has eccepteij j thetobacco grower should. give serious attention to the"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Ife. hogs, T. B. <mark>Hutcheson</mark>. Shnet. Shop. I H30-ll45"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Ife. hogs, T. B. <mark>Hutcheson</mark>. Shnet. Shop. I H30-ll45"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [254.41, 272.42, 744.42, 572.61], "bbox_id": "6d532481c0", "file": "AppomattoxNewspapers_1908-1909a_0182.pdf", "page": 1, "text": "Owing to illness of a son of I Farmers-were very glad to see judge Hutcheson, Judge Henry I the nice showers Sunday and C. Leigh, of the Corporation I Monday. Some have been using Court of Danville, held court I tobacco planters and planting here Friday and Saturday in his I tobacco. stead. Judge Hutcheson will be I Mrs. J. A. Stratton is visiting on the bench here to-day to finish! relatives in Lynchburg Mid at- up the business of the term. I tending the Randolph Macon S. P. Loving pleaded guilty to I Womans College finals, where the indictment found against I her daughter, Miss Frances, was Misses Earle Pattteson, Vera him for defrauding State Bank I a member of the graduating Connor and Virginia Puckett L f pamplin of approximately I class. are visiting their cousin, Miss I 35 060 , upon the recommenda-l miss Annie Alvis, of Farm- Anna Jordan, and other relatives Ljon 0f Commonwealth Attorney I vine, arrived Tuesday to spend at Cullen, Va. Flood was given a sentence oflgeveral weeks with her parents. Mrs D. E. Caldwell and D. E. only three years in the peniten.lr. and Mrs. J. P. Alvis, before Calwdell, Jr.,  of Bluefield, W. tiary. Many of Lovings friendg gojng to Columbia University, Va have been attending com-had petitions asking for the New York.  mencement exercises at State minimum punishment. 1 The Stonewall School closed Teachers College, Farmville, Va., j Wesley Coleman was given a I Friday night with an attractive where the formers daughter, fine of 100.for driving automo. program by the children. Misses Miss Lillian Caldwell, graduated, j bile under the influence of liquor I Smith and Reynolds returned to While away they also visited land a suspended jail sentence of I their homes at Appomattox Sat- friends at Amelia C. H., and thirty days.  lurday, we hope to have these Richmond. I Edward Lucado charged with I young laies with us again next"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "glad to see judge <mark>Hutcheson</mark>, Judge Henry I the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "glad to see judge <mark>Hutcheson</mark>, Judge Henry I the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [619.89, 398.1, 785.71, 523.04], "bbox_id": "0f1c5f1b2b", "file": "AppomattoxNewspapers_1939-1943a_0323.pdf", "page": 1, "text": "of which the world has never seen. They agreed that a negot iated peace would be little better. Dr. John R. Hutcheson, director of the Virginia Agricultural Ex tension Division, suggested that farmers take advantage of the pre sent situation by using any extra income to pay off debts, improve soil, repair buildings, and other wise put their farms in condition to weather a storm of less prosper ous times."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "better. Dr. John R. <mark>Hutcheson</mark>, director of the Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "better. Dr. John R. <mark>Hutcheson</mark>, director of the Virginia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [425.05, 231.42, 563.85, 451.66], "bbox_id": "e523b657e4", "file": "AppomattoxNewspapers_1974-1975a_0430.pdf", "page": 1, "text": "of the T a n af Appomatte wffl be aaa eves n o u an M n u d at the third aanuxi Historic Appomattox Railroad Day Festival to be held oa Oct. II aad 12. This is the first m a series of articles to acquaint the reader with life in Appomattox fifty years ago. The Charter of the Town of Appomattox states that a peiitk for incorporation was presented oa June 2, 1925. at the Circuit Court, held for the county of Appomattox at the Court House. Robert J. Hutcheson. Jode. S. L. Ferguson. A. H. Clement. C- W. Smith aad more than 20 other duly qualified voters of the thickly settled"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Court House. Robert J. <mark>Hutcheson</mark>. Jode. S. L. Ferguson."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Court House. Robert J. <mark>Hutcheson</mark>. Jode. S. L. Ferguson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [407.03, 714.31, 556.04, 1082.4], "bbox_id": "978840518d", "file": "TimesVirginian_1976_0067.pdf", "page": 1, "text": "of the skills they have acquired in the classroom. DECA members from A CHS were in competition with DE students, from eight other schools in the area. Students who took part in the competition and their events are as follows Terry Almond, Job Interview I Walter Mosley, Sales Judging Harvey Carter, Parlimentary Procedure Bud Moses, Job Interview, Coop William Hen- I ry Display Allen Harris, Decison Making  Student of the Year Wayland Ferguson, Group Sales. Trophy winenrs were William Henry, Wayland I Ferguson, Allan Hams, BUd Moses, Walter Mosley, Eddie I Ragland served as the chapters voting delegates and Mr. Hutcheson, chapter advisor, also attended. I The chapter, would like to I extend a special note of thanks  to Mr. R. B, Cqrter, directw of  Vocational Education, and Mr. Tim Stephens, a student teacher from Va. Tech, who helped drive and were judges for the Parliamentary Proce dure Contest."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "voting delegates and Mr. <mark>Hutcheson</mark>, chapter advisor, also attended."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "voting delegates and Mr. <mark>Hutcheson</mark>, chapter advisor, also attended."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [467.96, 1172.46, 1377.91, 1287.06], "bbox_id": "f294075ba0", "file": "AppomattoxNewspapers_1915-1918a_0345.pdf", "page": 1, "text": "of Delaplan, concussion shattered glass in scores of houses in the imme diate vicinity of the explosion. B. A. Rucker, _ unanimously elected president Virginia Corn Growers assoei the ninth annual meeting held 1 auditorium of Murphys HoWS ceeding H. Manicke, of Newsi T. B. Hutcheson, a former mel the board of directors, was 1 as vice-president, while E- - son, of Blacksburg, was again 1 mously named secretary and tWm of the organization. I"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "of Newsi T. B. <mark>Hutcheson</mark>, a former mel the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "of Newsi T. B. <mark>Hutcheson</mark>, a former mel the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1119.14, 474.64, 1350.52, 791.63], "bbox_id": "a593fac0e5", "file": "AppomattoxNewspapers_1949-1952a_0449.pdf", "page": 1, "text": "of Buckingham Marsoon Albermarle County, ducted the Communion Service. Rev. R. G. Hutcheson, Sr., of Louisa, opened the afternoon session vwith a devotional service. Lunch was served to fifty in the Sunday School Annex, in which also there was shown a moving picture of special interest as much of it dealth with the origin and progress  of the Old Providence Rural Par-  ish under the leadership of Dr. T. a H. Daniel,  Superintendent of the  Presbyterys Home Missions, and of i Rev. R. -G. Hutcheson, Sr., pastor1 v of the Parish, both ,of whom were! present.  y unanimous vote, a resolution presented by Rev. W. Mcllwainej I Thompson of the faculty of Union   Theological Seminary, was passed friends at protesting against the appointment nrr was! an ambassador to the Vatican, and  1 directing that copies of the resolu- . n  i tion be sent before this coming Sun day to all the churches of the Pres-, bytery to be read to the congrega tions with recommendation of pro-! test by the individual churches! against the appointment."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Service. Rev. R. G. <mark>Hutcheson</mark>, Sr., of Louisa, opened"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Service. Rev. R. G. <mark>Hutcheson</mark>, Sr., of Louisa, opened"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1785.87, 1107.06, 1945.88, 1466.55], "bbox_id": "d90df4e70a", "file": "AppomattoxNewspapers_1915-1918a_0006.pdf", "page": 1, "text": "Notice Farmer! The following Farmers In stitutes will be held in the County on Monday and Tues day, August 9th and 10 th re spectively At Appomattox C. H., Mon day, August 9th, 1000 a. m. At Hixburg, Monday, Au gust 9th, 200 p. m. At Stonewall High School, Tuesday, August 10 th, 930 a. m. At Oakville High School, Au gust 10 th, 200 p. m. At Liberty Chapel High School, Tuesday, August 10 th, 1000 a. m. Among the speakers will be Prof. J. R. Hutcheson, Prof. Ralston, Dr. Hays and W. P. Moore. Subject discussed will be Soil Improvement. Spraying, pruning and care of trees. Feeding and growing of live-stock. Hog cholera, etc. Come and bring your friends."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "be Prof. J. R. <mark>Hutcheson</mark>, Prof. Ralston, Dr. Hays"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "be Prof. J. R. <mark>Hutcheson</mark>, Prof. Ralston, Dr. Hays"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [840.5, 850.5, 2046.47, 1014.58], "bbox_id": "19116f2705", "file": "AppomattoxNewspapers_1952-1954a_0401.pdf", "page": 1, "text": "No Teen-Age Dance Tonight The usual Teen-Age dance will not be held tonight, it has been an nounced. and Ellen Miss Mary Nell Puryear Mr. and Mrs. Percy Staten  Mrs. June MacKay and daughter, Donna Mr. and Mrs. Ray George and son, Ray, Jr. Mrs. J. M. Lucado Miss Blanche Hutcheson Mrs. Irene Trent Mr. and Mrs. Clinton Childers, Joan and Patsy Mr. Thomas E. Childers Miss Miidred Burgess Mr. and Mrs. Bill Slusher Mr. and Mrs. G. E. LeFew Mr. Carroll Childers and sons, Kenneth and Barry Mrs. Eliza beth McCarthy Mrs. Ossie Fergu son Mrs. Iva Pillow Mr. Shearer Robertson Mr. Roland Ferguson"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "M. Lucado Miss Blanche <mark>Hutcheson</mark> Mrs. Irene Trent Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "M. Lucado Miss Blanche <mark>Hutcheson</mark> Mrs. Irene Trent Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [216.0, 349.91, 374.8, 654.96], "bbox_id": "e6407149ad", "file": "AppomattoxNewspapers_1926-1933a_0057.pdf", "page": 1, "text": "News reached here today that James L. Anderson, Treasurer of Buckingham county died there yerterday. He had been treasu rer for many terms and was also president of the Merchants and Planters Bank at Dillwyn. He was deservedly popular and his death will be generally re gretted by the people of the county. He had been ill for sometime. His death will neces sitate the appointment of a treasurer for the unexpired term by Judge Hutcheson. There are two candidates for the office for 1927 election. Sheriff Harry Griffin and Su pervisor Dr. G. L. Morris. It is reported that Dr. Morris will be a candidate for appointment for the unexpired term. That 1,900,000 Gap Fund"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "unexpired term by Judge <mark>Hutcheson</mark>. There are two candidates"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "unexpired term by Judge <mark>Hutcheson</mark>. There are two candidates"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [201.61, 344.42, 368.25, 607.67], "bbox_id": "7949005a93", "file": "AppomattoxNewspapers_1908-1909a_0057.pdf", "page": 1, "text": "News reached here today that James L. Anderson, Treasurer of Buckingham county died there  . yerterday. He had been treasu rer for many terms and was also president of the Merchants and Planters Bank at Dillwyn. v He was deservedly popular and his death wiil be generally re gretted by the people of the county.  He had been ill for sometime. His death will neces- , sitate the appointment of a treasurer for the unexpired term by Judge Hutcheson. There are two candidates for the office for 1927 election. Sheriff Harry Griffin and Su pervisor Dr. G. L. Morris. It is reported that Dr. Morris will be a candidate for appointment for the unexpired term."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "unexpired term by Judge <mark>Hutcheson</mark>. There are two candidates"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "unexpired term by Judge <mark>Hutcheson</mark>. There are two candidates"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2278.77, 575.68, 2451.12, 1282.62], "bbox_id": "847963d35e", "file": "AppomattoxNewspapers_1943-1947a_0283.pdf", "page": 1, "text": "nesday, October 10, were announ ced today by R. B. Hudgins, coun ty agent, in the following state ment  The Appomattox Lions Club in cooperation with the Coble Dairy Products Company, cordial ly invites you to Appomattox Wed nesday, October 10.  We believe we have arranged a day you will enjoy and that you will profitt from it. It will be a Dairy Day in honor of you who have made a real contribution to dairy development in this area. To begin with, we have plan ned an Open House at the Coble Dairy Plant from j00 A. M. un til 1130 A. M. We want you to see how your milk is handled and to get acquainted with the folks at the plant. .  At 1130 we wilt all meet up at the court house grounds for a short program of value. Cash and merchandise prizes will be award ed to various patrons. Following the awarding of prizes there will be a program consisting of speech of welcome by Mayor Charles F. James, addresses by State Com missioner of Agriculture L. M. Walker, by Dr. T. B. Hutcheson, State Agronomist from V. P. 1., and George S. Coble of tne Coble Dairy Products Company. VEach family is requested to bring a basket lunch. Tables will be provided for this purpose. The Coble Dairy Products will furnish ice cream for your dinner, sobring your basket and mingle with your neighbors and get better acquaint ed with the farmers and business men who are interested in dairy development in this section.  At two oclock the big event will start, which 1 b a sale of Reg istered Guernsey bulls and heifers sponsored by the Virginia Agricul tural Service, Appomattox Lions Club, Appomattox County Agricul tural Board and the Coble Dairy Products Company. These animals have been select ed from the best Guernsey herds of the state and are from extreme ly high producing blood lines.This is a wonderful opportunity to get a real dairy sire or a heifer for foundation purposes.  We sincerely hope you will come and bring your family and enjoy a day getting better ac quainted with those interested in the dairy business, hear a real program from outstanding dairy leaders, and attend a sale where you would have an opportunity to purchase splendid registered Guern seys at youwown price."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "by Dr. T. B. <mark>Hutcheson</mark>, State Agronomist from V."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "by Dr. T. B. <mark>Hutcheson</mark>, State Agronomist from V."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1912.97, 776.76, 2070.02, 924.5], "bbox_id": "35cabe30a8", "file": "AppomattoxNewspapers_1971-1973a_0418.pdf", "page": 1, "text": "n ial Field Day on Piedmont Re search Station at Orange T hurs day, August 24. J . a . Smith advises that the field day pro ceeding will start at 100 p.m. George Jones, who is in charge of the station at Orange, will welcome guests. Dr. T B Hutcheson, J r., Head Agrono m y Department of VPI  SU w ill introduce Director of Cen tennial Program s, G. W. Lit ton, who will speak upon a A Century of Progress."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "guests. Dr. T B <mark>Hutcheson</mark>, J r., Head Agrono"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "guests. Dr. T B <mark>Hutcheson</mark>, J r., Head Agrono"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [224.89, 854.91, 610.88, 1204.81], "bbox_id": "d4541ca57b", "file": "AppomattoxNewspapers_1926-1933a_0184.pdf", "page": 1, "text": "mrse was served by hostess! Miss. Mattie Moss is spending I jsisted by Mrs. Ned Wagers. this week with her sister, Mrs. I Our commencement is going C. E. Abbitt. , M u this week. Last night was Miss Pearl Co eman and Mr. lusical night, to-night is Liter- Jack Preston visited Mrs. T. E. -v nicrht and to-morrow night I Owen Sunday evening, raduating exercises will be held Miss Carrie Martin spent last Sth address by Dr. J. P. Me- week-end with her parents here. onnell and the awarding of liplomas by Governor Byrd. here are twenty-seven candi- lates for graduation. Due to the illness of Judge! Rev, Hutchesons son, who was oper- pomat ated on for appendicitis in Farm-1 reate i ville Hospital Tuesday, Judge He is H.C.Leigh,of Danville, will take and hi his place here Friday and Sat- alargi urday. It is reported that he is Thurs getting along nicely and Judge given Hutcheson expects to be here class, next week for Court. Wl11 J Mra. Jennie Bonder, rf 9p near Lynchburg, had as her  R guest Sunday Mr. and Mrs. Tom  Mr Drinkard, Mr. and Mrs. Victor ,g imerman leu i Burnette, Messrs. Earl and Alton wjf M rs. C. F. Drinkard. Albert and Elmo"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "illness of Judge! Rev, <mark>Hutcheson</mark>s son, who was oper-"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "illness of Judge! Rev, <mark>Hutcheson</mark>s son, who was oper-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.89, 305.24, 1594.19, 1125.93], "bbox_id": "f9280fe756", "file": "AppomattoxNewspapers_1926-1933a_0272.pdf", "page": 1, "text": "Mrs. T. B. Pretlow is sick. Mr. and Mrs. R. C. Wagner ere recent visitors in Halifax Mite, Lindsay Orawley bs turned from a trip to Rich- nd. Miss Catherine Caldwell ent last week in Lynchburg .iting friends and relatives. liss Earle Patterson has n on a visit to Miss Allie rks, in Lynchburg. udge Hutcheson will open ,June term of his court on Monday. ur farmers are ready to jnt a good crop of tobacco, are being delayed by the ght. r. and Mrs. G. S. Caufman e been to Charlottesville tee their son Edward, who student at the University r. and Mrs. Frederick Da- iand children have returned peir former home in New City. and Mrs. E. H. Ham. jley and children, of Rich d, have been, on a visit to jives in the county. Mrs. Witt Coleman, Calvin Cogman, Mrs. Witt Agee and Miss Naomi Hancock were visi- torsfin Buckingham jlast week. Miss Florence Gregory has retspned home from the State Teachers College at Farmville for jher summer vacation. Ipss Mary Trent has been a patient this week atthe Vir ginia Baptist Hospital, where HSonsils were removed. Illir. and Mrs. C. D. Lewis  were Sunday visitors in  home of their parents, Mr Ipyirs. C. E. Lewis. Mr. Herbert  Plunkett, of West Virginia has been on a visit to his parents, Mr. and Mrsf J. S. Plunkett. ASss Ann Caldwell, who has gijE spending several months n Richmond has returned to tejrgiiome here. ilil-ssers John Heatwell and -rd Suter, of Harrison- were Sunday guests in ome of W. R. Reynolds. Jsses Frankie McKinney  Reynolds are guests of UrsfPenick in Lynchburg this veek. Mr and Mrs. C. N. Abbitt an- f"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "rks, in Lynchburg. udge <mark>Hutcheson</mark> will open ,June term"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "rks, in Lynchburg. udge <mark>Hutcheson</mark> will open ,June term"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1500.07, 931.7, 2404.55, 1261.65], "bbox_id": "fa274dcf24", "file": "AppomattoxNewspapers_1908-1909a_0379.pdf", "page": 1, "text": "Mrs. Martha A. Clark Mrs. M. A. Clark, a lifelong resident of Pamplin, died at her home there Monday after a lingering illhess. She is sur- many pleasant and helpful memories of my fellow-student of former years. G eo . B raxton T aylor . CHORUS GIRLS CAN EAT AGAIN is reported to be I one of two winners in the flag contest of the schools of that city., Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward County, has designate ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of- Frank -W. Gilliam, game warden, on Sun day, April 28_. Pegram will remain in th Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "achievement. Judge Robert F. <mark>Hutcheson</mark>, of the Circuit Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "achievement. Judge Robert F. <mark>Hutcheson</mark>, of the Circuit Court"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [447.61, 502.37, 614.76, 619.92], "bbox_id": "e58bf4d621", "file": "AppomattoxNewspapers_1955-1957a_0241.pdf", "page": 1, "text": "Mrs. F. E. Moore and Mrs. F. N. Bailey, and son,- Nelson, of Roa noke, Va., and Mrs. Broughton Hutcheson and two of- her children, from Kingsport, Tenn., visited in this community last Thursday. They visited Mr. and Mrs. Melvin Drink- ard, Mrs. E. B. Martin, Mr. and Mrs. Aubrey Moore, Mrs. Milton Moore, and Mr. and Mrs. H. R. Moore. Mrs. Milton Moore was on the sick list. We wish for her a speedy recovery."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Va., and Mrs. Broughton <mark>Hutcheson</mark> and two of- her"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Va., and Mrs. Broughton <mark>Hutcheson</mark> and two of- her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [467.31, 749.31, 789.95, 1104.44], "bbox_id": "25fe909f59", "file": "AppomattoxNewspapers_1908-1909a_0487.pdf", "page": 1, "text": "Mrs. C. A. Anderson, ofj near Vera, this week kindly brought to the Times-Vir- giniair office several very rare day old papers and booklets, eluded in the group was an manac published in 1803, now . ... ame 129 years old. The almanac ation was held in this same  had a number of notations still church en 1832 and ? sPec. legible. She also had a copy centennial program is being of the Lynchburg Republican, observed this year in connec published by the father of tion with the record of a Carter Glass, the present pub- even century of service. Due to the fact that the as sociation met with the same church two years ago ,and the return this year was in order to celebrate the centennial in the original church those at tending are requested to bring their own lunch or arrange- ments will be made fori same 1 to be on sale on the grounds. 1 . a splendid program is being arranged. J. .K. Megginson, clerk of the association, re- Judge Robert A. Hutcheson te that Dr. F. W. Boat- has just entered an order re- wijght, president of the Jni- appointing G. M. Rogers as versity 0f  Richmond, will trial justice f o r Buckingham 3peak Friday, and other prom county, for a term of four inent Baptists have been pe years. P. H. Moss, former cured to preSent the story o substitute trial justice, has re- pne.hundred years of Baptis signed and the judge has ap- history in this section and n"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "re- Judge Robert A. <mark>Hutcheson</mark> te that Dr. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "re- Judge Robert A. <mark>Hutcheson</mark> te that Dr. F."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1740.23, 208.8, 2089.73, 740.72], "bbox_id": "d74f2fc5b6", "file": "AppomattoxNewspapers_1905-1912a_0385.pdf", "page": 1, "text": "Mr. H. 0. Steele is in town. U his thf ae o darkness ,fVw d o y r fsk? you say Mrs. W. B Harvey is visiting BecaUl,r irt3 mattox county, Mrs. Janette Mann. which boasts of its High School Miss Lee Blankenship, who has I as one of the model institutions been eick, is out again. . I of the State, allows one, at Mr. T. O Davidson is advertising least o her 8chools to remain seed wheat for sate in this issue. Iyacan or kree yars and  I lows the young citizens, de Mr. and Mrs. Travis Marshall, f I pendent on this school for their Ohio, are visiting in the county. education, to grow up in ignor Mr. Whayland Sweeney is mov-1 ance. ing in town today from Lynchbnrg. I Now the question isth is Miss Marguerite Campbell, of j ln8 18 this state of af  Amherst, is visiting Miss Pauline I ars ty l8-1 we no Pay Clement. taxes as well as our neighbors? I And are we not entitled to this Mr. LeRoy Smith has returned advantHge at least? We have from a visit to his old home in few enough here in the back- Maryland. I WOKjg a8 perhaps you know. Mr A. W. Jones, of Lynchburg, I We have waited patiently for is spending bis vacation with his I two years as it is sometimes home people at Spont Springs. I impossible to make the requir- Mr. Jim Stanley has returned ed averae in both school8, from Martinsville, where le spent I where there are two within several days with his brother, Ray, I wo miles nch other as in w. . I this case but the Honorable Miss Lucy Singleton and Mrs. Board has decided in favor of Hutcheson, of _Lynchburg, were the neighborillg 8chool for the gnests of Miss Effi Rntledge last and we would like week I  I to know their reasons. Mr. and Mrs. 0. N. Hancock! The patrons of this school were in town Sunday. Nathan is I submitted a petition to the improving rapidly in health, we are I school board on the occasion of glad to see. I their appointment of teachers, Mies Mary Walker, who has been I Pfuaranteeing an average spending a part of her vacation which was ignored, with Miss Willie Smith, left this I want to be reasonable, week for Lynchburg, her home. j We only ask them to lighten our darkness or a t least to tell Good Prospect for O pening of I US th a t the oil is  gitting A gricultural School. I scarce. The prospects for the opening of I A WOULD B b P atron W ild way 8 chool ."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "decided in favor of <mark>Hutcheson</mark>, of _Lynchburg, were the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "decided in favor of <mark>Hutcheson</mark>, of _Lynchburg, were the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1361.74, 258.01, 1534.17, 787.4], "bbox_id": "7cba27e91d", "file": "AppomattoxNewspapers_1926-1933a_0088.pdf", "page": 1, "text": "Mr. and Mrs. John Churchill Anderson announce the marri age of their daughter, Rebecca Norman to Mr. William Patteson Coleman on Saturday. May 15th, 1927, in the city of Danville, Va. So far there appears to be no candidates for any of the many offices to be filled this year, although some petitions are being circulated asking candidates to come out. That there will be many hats in the ring no one doubts. Judge Hutcheson has appoint-  ed the followingJuryCommission- ers B. M. Ferguson, Don Moses, and J. P. Alvis for the year be ginning Feb. 15th. These gen tlemen will Irresponsible for the character of the Jurors who  shall try cases for this year in Appomattox county. Mrs. S. M. Thornton enter tained at progressive Bridge and  Rook last Monday night in the  parlors of the domitory in honor of Mrs. Harrell, of Suffolk, who has been on a visit to her sister, Mrs. Bioxton. Those playing Rook were Misses Elaine Mc- Dearmon, Elner Stratton, Kate Franklin, Gladys Van Valkin- burg, Pereza Coleman, Eddie Hardy, Mesdames John Scott, W. T. Steele, R. E. Caldwell, I Jr., Justin Burkey, Bioxton, S. M. Thornton, Messrs. Justin Burkey, W. T. Steele, Arthur Irby, Russell Irby, Harold Spen cer, and C. S. McDearmon. A delightful salad course was serv ed."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "no one doubts. Judge <mark>Hutcheson</mark> has appoint-  ed the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "no one doubts. Judge <mark>Hutcheson</mark> has appoint-  ed the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1355.73, 235.45, 1527.98, 765.29], "bbox_id": "907ffcb4ff", "file": "AppomattoxNewspapers_1908-1909a_0088.pdf", "page": 1, "text": "Mr. and Mrs. John Churchill Anderson announce the marri age of their daughter, Rebecca Norman to Mr. William Patteaon Coleman on Saturday. May 15th, 1927, In the city of Danville, Va. So far there appears to be no candidates for any of the many offices to be filled this year, although some petitions are being circulated asking candidates to come out That there will be many hats in the ring no one doubts, Judge Hutcheson has appoint ed the followingJuryCommission- ers B. M. Ferguson, Don Moses, and J. P. Alvis for the year be ginning Feb. 15th. These gen tlemen will beresponsible for the character of the Jurors who shall try cases for this year in Appomattox county. Mrs. S. M. Thornton enter tained at progressive Bridge and Rook last Monday night in the parlors of the domitory in honor of Mrs. Harrell, of Suffolk, who hL been on a visit to her sister, Mrs. Bloxton. Those playing Rook were Misses Elaine Mc- Dearmon, Elner Stratton, Kate Franklin, Gladys Van Valkin- burg, Pereza Coleman, Eddie Hardy, Mesdames John Seott, W. T. Steele, R. E. Caldwell, Jr., Justin Burkey, Bloxton, S. M. Thornton, Messrs. Justin Burkey, W. T. Steele, Arthur Irby, Russell Irby, Harold Spen cer, and C- S. McDearmon. A delightful salad course was serv- ! ed.   -"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "no one doubts, Judge <mark>Hutcheson</mark> has appoint ed the"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "no one doubts, Judge <mark>Hutcheson</mark> has appoint ed the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1357.24, 644.58, 1530.39, 1382.79], "bbox_id": "23c760c84b", "file": "AppomattoxNewspapers_1908-1909a_0207.pdf", "page": 1, "text": "More has been said during the past few years on the far mer relation to present econo mic conditions t h a n on any other one subject perhaps, and plan after plan has been made to give him the helping hand he needs, but talk and plinaa- like have gone the .way of th wind, and the farmer remains in straits which promise to be come more desperate each year Legislation and all suggest ed aids at this time ha e done little or nothing for the fanner. And perhaps this is partly at least, the fault of the farmer himself. He has becoitfe suspi cious of all sources of aid be cause so many bave failed him He has reached th point where he holds back when he shoUU push forward. !v , f One of the outstanding so lutions of the farm problems which has been offered is the co-operative- The value o  this solution is apparent. It is the one means of. bringing the farnief as a producer into a group It is the one means o stalilreing fgrm prices .and production, fpg mi YK. During the four years to tobacco marketing association operated in this state, Virginia owers averaged a higher a théir tobacco crops than they mre in sgry year period in the pâst half eentuP ey with the perception of war prices,-John Hutcheson, of to extension division,. has stated after studing the figure. Yet the farmers of this sec tion show little interest in the co-operative. The,, business men of the county have willing ly boosted the co-op and shown more, interest in it than the farmer himself. A local business man whose sympathy is with toe fermera mad the statement the other day that thf farmer does no, tant to., be helped,.. In expla nation he Said, that he had voluntarily given several days of his time to getting members for the co-operative, and that he had found, a general idea among the farmers he ap proached that he was doim, th work for the profit he could make out Kf it , Until the farmer shakes off his attitude of defense and be gins to , help himself to th which others dr tryjm j . to throjw his way, his positadr will remain much the same."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "perception of war prices,-John <mark>Hutcheson</mark>, of to extension division,."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "perception of war prices,-John <mark>Hutcheson</mark>, of to extension division,."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.5, 1035.97, 1528.47, 1265.57], "bbox_id": "151b9ec5e7", "file": "AppomattoxNewspapers_1908-1909a_0395.pdf", "page": 1, "text": "Misses Elaine McDearmon and Siva Stratton delightfully enter- lined a few of their  friends at he home of Miss McDearmon m Pamplin last evening. Prof. Crawley is working on bis shirt factories for Appomat ox and Pampiin and will proba bly have something definite to peport in our next issue. Guano Received I will takt orders for guano to be deliyere from car at Appomattox. T. W. O der . 8-21-2t Judge Hutcheson will hole Ihis spring term of the Circui. Court of Appomattox Count, beginning Monday."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "O der . 8-21-2t Judge <mark>Hutcheson</mark> will hole Ihis spring"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "O der . 8-21-2t Judge <mark>Hutcheson</mark> will hole Ihis spring"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1370.89, 1055.3, 1529.64, 1285.4], "bbox_id": "e73f0227f0", "file": "AppomattoxNewspapers_1926-1933a_0395.pdf", "page": 1, "text": "Misses Elaine McDearmon and lva Stratton delightfully enter- ined a few of their friends at he home of Miss McDearmon in amplin last evening. Prof. Crawley is working on is shirt factories for Appomat ox and Pamplin and will proba ply have something definite to eport in our next issue. Guano ReceivedI will tak orders for guano to be delivere from car at Appomattox. T. W. O der . S3-21-2t Judge Hutcheson will hok his spring term of the Circui Court of Appomattox Count, beginning Monday."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "O der . S3-21-2t Judge <mark>Hutcheson</mark> will hok his spring"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "O der . S3-21-2t Judge <mark>Hutcheson</mark> will hok his spring"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.89, 787.2, 1936.44, 869.05], "bbox_id": "66d4b61948", "file": "AppomattoxNewspapers_1908-1909a_0345.pdf", "page": 1, "text": "Miss Sara Bates has return- and visited V   ed home from an extended visit W   BeVeral to W . Va., Ohio, Kentucky,  Michigan and Canada.  Mr. and Mr. T. L. Chrltian Judge Hutcheson wttl Hold and P k  Jennings, of Ceving- t h e  t e r m of hi court  L"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "T. L. Chrltian Judge <mark>Hutcheson</mark> wttl Hold and P"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "T. L. Chrltian Judge <mark>Hutcheson</mark> wttl Hold and P"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1367.99, 411.43, 1684.02, 516.55], "bbox_id": "674c9a9d6d", "file": "AppomattoxNewspapers_1905-1912a_0314.pdf", "page": 1, "text": "Miss Clara Caldwell is visiting iMiahottcFirst Monday in January, March  her sister, Mrs. W. D. Browning in u.v July. Septembsr and November. ... , pnmberlaaoTuesday after the fourth I Richmond. Tann.rV _ Al,-iI SOIlM.mI .Br U nri I Holiday in January, April, September and  P t I dc Ì EdwardTueaday after _the third Mr. W. J. Hutcheson, who has aoBdayin January, Mr, September and I een tobnccO buyer on this market November. mmm I J 1 this seaeon, left yesterday for Rich mond. BUCK INOIJAM . BOR. BENNETT GOUDOH, JUDGE, Court meets Tuesday alter the 2nd Monday __ k. fPnarinir  rtn r fho Qnrl MntiHotr"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "third Mr. W. J. <mark>Hutcheson</mark>, who has aoBdayin January,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "third Mr. W. J. <mark>Hutcheson</mark>, who has aoBdayin January,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.64, 1023.31, 1669.79, 1282.95], "bbox_id": "96536c84bd", "file": "AppomattoxNewspapers_1926-1933a_0379.pdf", "page": 1, "text": "Miss Ann Abbitt, the young daughter of Dr. J. B. Abbitt, of Norfolk, Va., is reported to be one of two winners in the flag contest of the schools of that city. Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward COunty, has designat ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of. Frank -W. Gilliam, game warden, on Sun day, April 28. Pegram will remain in the Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "achievement. Judge Robert F. <mark>Hutcheson</mark>, of the Circuit Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "achievement. Judge Robert F. <mark>Hutcheson</mark>, of the Circuit Court"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [259.49, 1467.91, 549.3, 1835.49], "bbox_id": "2fd00647f8", "file": "AppomattoxNewspapers_1926-1933a_0167.pdf", "page": 1, "text": "MISCELLANEOUS Treasurer of Virginiacost auditing treasurers acct. etc ..............  B. N. Woolridgecleaning oft C. H. l o t ............................................ R. L. Burke, treasurerfiling cases, tax tickets and office ex penses ...................................................... .. ..................................... L. F. Caldwellsealer weights and measures ......................... .. Appox. Fair Associationappr. for premiums . ............................... H. W. McKinneysum. petit Juries . ................................................... L. E. Smithmem. lo. bd. equalization ........................................... J. P. Alvis, mem. lo. bd. equalization ............... .. ............................... F. A. OBrien, mem. lo. bd. equalization............................................ C. W. Smith, clerk lo. bd. equalization . ....................................... .. . E. G. Blackwell, repairing old C. H. and Jail . ............................... C. W. Smith, clerkexp. Conf. Veterans to reunion, epl. services on budget, etc...................................... ............................................... Tlmee-Vlrginlan, printing financial statement, public noticea, etc, Appomatox Hdw. Co., key for lock at old Jail ................... B. M. Ferguson, Jury com .................... .. ...................... - A , ...............  Don Moses, Jury com. . ....................................................... V ............. J. P. Alvis, Jury com................................... .. ........................ .................. Henry Troemsr-die tor sealer welghte and measures . . ............ Joel Guillcleaning off old C. H. l o t ................... .......... .................. Town of Pamplinbank stock erroneously col................ Ould-Lawson Hdw, Co.26 stool trape . ........................................... IfcieiUL. -i .I... at .  i . i i f f i l i i L     i I 4 i  ! .  OFFICERS SALARIES H. W. MqKlnney, sheriff and Jailer ..................................... .. H. W. McKinney, sheriff and probation o ffic e r ................. C. W. Smith, clerk of Board of Supervisors and Rd. Orders C. W. Smith, county d o r k ......... . ........... .................................... J J. W. Flood, commonwealth a tto rn e y ............. J. A. Burke, supt. schools ................................. N. R. Deatherson, eupt. schools ......................... J. O. OBrien, comr. rev. . ................................ Robt. F. Hutcheson, Judge . .. .. .................. D. N. Twyman, supervisor . ............ F. A. OBrien, supervisor ............................... . O. E. Anderson, supervisor ................... , .......... H. G. Harding, overseer of the poor . . . . . . . B. G. Harvey, overseer of the poor . ................ 3 - U , Ferguson, overseer of the p o o r ............."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "comr. rev. . ................................ Robt. F. <mark>Hutcheson</mark>, Judge . .. .. .................. D. N. Twyman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "comr. rev. . ................................ Robt. F. <mark>Hutcheson</mark>, Judge . .. .. .................. D. N. Twyman,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [751.18, 210.27, 914.07, 970.76], "bbox_id": "bd2f6f5247", "file": "AppomattoxNewspapers_1918-1922a_0235.pdf", "page": 1, "text": "Messrs. Clark and Richard Caldwel- left last Thursday for University of Richmond.  Miss Bloise Atwood leaves today for Hollins, vhere she will attend school. Mr, J. A. Burke left this morning for Greensboro, N. 0., where he will take special treatment. He will be absent some time, but his wife will look after his business here during his absence. Announcement is made in reductions on Ford motor ve hicles as follows Runabout, with starter 465, Touring car 510, Truck 545, Tractor 790. dee W. M. Hancock, Appomat tox, Va., The bright tobacco market opens in L ncbburg Thursday and we will not be able to say what the prices will be until after the sales. The indications are taat fair prices will be ob- tained for all grades of good tobacco. In this issue our readers will find the Financial Statement of Appomattox county, the first one to be published for years. The law requires that the state ment be published annually, but for some reason the proper officer has neglected to have it done. It is a valuable paper, one that every taxpayer should study and if found erroneous or excessive allowances and appropriations made of your money, steps should be taken to correct same. Keep the pa per for future reference. Quite a number of Appomat tox people attended Judge H un dleys court at Farmville yes terday the occasion being a habeas corpus proceeding by H. A. Odor to obtain possession of his 2 year old son, which is detained by his wife in Acco- . mac county. The Judge de- . cided that the baby was too i young to take from its mother. ! No other question was consid ered bv the Judge. Messrs. Hutcheson and Daughtery of Accomac, and S. L. Ferguson of Appomattox, appeared for defense and A. H. Clement for  plaintiff."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "bv the Judge. Messrs. <mark>Hutcheson</mark> and Daughtery of Accomac,"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "bv the Judge. Messrs. <mark>Hutcheson</mark> and Daughtery of Accomac,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.12, 576.19, 1520.49, 1265.23], "bbox_id": "e41ae5c26e", "file": "AppomattoxNewspapers_1926-1933a_0376.pdf", "page": 1, "text": "Memorial day was fittingly observed here on Monday, and owing to inclement weather services were held in Court housethe day being deferred in order to observe Jeff Davis Memorial. Dr. Franklin, of N. Y., an old citizen of Appomat tox made the address which was much enjoyed. The service was in charge oi the U. D. C. The graves at the cemetery were decorated and wreathed in flowers. Dinner was served and all enjoyed the service. A male quartetProf. G. O. Gordon. Don Moses, J. C. Caldwell and W. W. Scott furnished splendid music. Mrs. John W. Davis, ot Lynchburg, made an address Mrs. Virginia LeGrand gave the Unfurled Banner and Mrs. Susie Roberts, of Char lotte, C. H., gave several hum orous selections. The veterans of the e.ounty are as follows Chas. M. Cole man, George W. Cheatham. C. W. Caldwell, R. jE. Cald well, D. A. Christian,C. C. Ferguson, D. P. Ferguson, S. T. Marsh,F. B. Moore, S. N. Ransom, J. G. Whitaker, Mil- ton Isbel, and John A. O Brien. Most of these veter ans were absent some attend ing the reunion at Charlotte, N. C., and hence only three were present. Visitors attending from Charlotte Courthouse were Mr. and Mr. B. N. Hutcheson, Mrs. Frank Bedinger, Mrs. Lester, Mrs. S. W. Roberts. An annual roll call of veter ans should be held and a short memorial to each absentee should be read. The roster is getting thin and the Daugh ters are always glad to servo in glorifying and perpetuating deeds of our heroic soldiers."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "and Mr. B. N. <mark>Hutcheson</mark>, Mrs. Frank Bedinger, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "and Mr. B. N. <mark>Hutcheson</mark>, Mrs. Frank Bedinger, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
