{"document": {"bbox": [1813.9, 1329.41, 1973.85, 1528.74], "bbox_id": "c95789424f", "file": "AppomattoxNewspapers_1892-1898a_0294.pdf", "page": 1, "text": "V IRGINIA, Appomattox County. Before R. B. Poore 8pecial Commissioner of said county to restore lost records. R. M. Bristow,  PpLlt.iftn . against f reuw on  J. B. Bristow, J. R. Bristow, V. H. Bristow, E. L. Bristow, B. K. Bristow. F. A. Bristow, N. B. Bristow and G. T. Bristow the last five infants under the age of 21 years and L. C. Taylor and Manuing Taylor her husband. Affidavit having been made before me, R. B. Poore Special Commissioner as aforesaid by Samuel L. Ferguson Attorney for the said R. M I Jristow, that J. B. Bristow, J. R. Bris tow, V. H. Bristow, Mrs. L. C. Taylor and Manning Taylor her husband, being all the adult defendants are non residents of Vir ginia. it is ordered that said adult defendants appear before me at my office at West Ap pomattox on May 15th 1896 to defend their interest in this suit. R. B. POORE, Special Commissioner. M M E M O T he object of this proceeding is to restore to record the lost will and testa ment of J. B- Bristow decd which together with its record was destroyed by fire on Feb ruary 2nd 1893. R. B. POORE, Special Commissioner. H.D. FLOOD, n S. L. FERGUSON.  p q 4-9-4t."}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow", "J", "Bristow"], "snippet": "against f reuw on  <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. R. <mark>Bristow</mark>, V."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow", "J", "Bristow"], "snippet": "against f reuw on  <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. R. <mark>Bristow</mark>, V."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [133.66, 711.42, 282.18, 1164.24], "bbox_id": "063281faf0", "file": "TimesVirginian_1976_0394.pdf", "page": 1, "text": "The list of schools below was  found in a notebook kept by my j grandfather. Chapman H. Chil- f ton. He was the first j Superintendent of Appomattox County Schools, beginning in j 1870 and serving until 1897, j with the exception of the period I from 1881 until 1885, when the ! Rev. J. B. Bristow occupied j that post. He listed the schools by ! District, stating that these j schools were the ones establish- j ed by the first boundary. j There are twenty two schools ! listed in the Southside District, thirteen in Stonewall, and j twenty eight in Clover Hill. It is j interesting that the Districts j have remained the same until  the present day. Mr. Jerry A. Burke, Superin- j tendent from 1926 until 1962 stated that as far as he knew, j there is no other list of early schools in Appomattox County, as the records were burned in j fires at the School Board Office and at the Courthouse. In order to compile accurate 1 records about the early schools, ! it would be worthwhile to j determine the location of each of these schools if possible. It is suggested that any person with any knowledge of where these schools were held, either from personal recollec tion or from local hearsay, come into the School Board office and share that knowledge. Both"}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow", "j"], "snippet": "1885, when the ! Rev. <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark> occupied <mark>j</mark> that post."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow", "j"], "snippet": "1885, when the ! Rev. <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark> occupied <mark>j</mark> that post."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow", "J"], "snippet": "OF SCHOOLSC. H. Chilton, <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. K. Hannah, N."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow", "J"], "snippet": "OF SCHOOLSC. H. Chilton, <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. K. Hannah, N."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1817.04, 1342.16, 1977.76, 1541.41], "bbox_id": "3a98498fd9", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "IRG1NIA. Appomattox County. Before R. 11. Poore Special Commissioner of said county to restore lost records. - MLfifi?tow ! Petition against I J. B. Bristow, J. R. Bristow, V. H. Bristow, . L. Bristow, B. K. Bristow, F. A. Bristow, B. Bristow and G. T. Bristow the last live infants under the age of 21 years and L.  Taylor and Manning Taylor her husband. Affidavit having been made before me. R. . pooro Special Commissioner as aforesaid by Samuel L. Ferguson Attorney for the said R. M Bristow, that J. B. Bristow, J. R. Bris tow, V. H. Bristow. Mrs. L. C. Taylor and Manning Taylor her huBband, being all the adult defendants are non residents of Vir ginia. it isordered that said adult defendants appear before me at my office at Vest Ap pomattox on May 15th 1896 to defend their nterest in this suit. R. B. POORE, Special Commissioner. MF. MOThe object of this proceeding is to restore to record the lost will and testa ment of J. B Bristow decd which together 1th Its record was destroyed by fire on Feb- ruary 2nd 1892.  R. B. POORE. Special Commissioner. H. D. FLOOD, in a 4-9-4t S. L. FERGUfeON. f p- q  8"}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow", "J", "Bristow"], "snippet": "MLfifi?tow ! Petition against I <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. R. <mark>Bristow</mark>, V."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow", "J", "Bristow"], "snippet": "MLfifi?tow ! Petition against I <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, <mark>J</mark>. R. <mark>Bristow</mark>, V."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.02, 398.11, 1605.36, 1042.4], "bbox_id": "240ef6d393", "file": "AppomattoxNewspapers_1955-1957a_0014.pdf", "page": 1, "text": "from public taxes. In 1870, this in novation met with considerable op position. Good judgment finally prevaield and the County Public School System was begun on a very modest scale. The first public school in this county was located in a log cabin near the Old Court House. The first teacher in the public school system was J. H. Featherston. The first County Superintendent of Schools was C. H. Chilton, 1870- 1881. He was succeeded by J. B. Bristow, who continued in office un til 1885. Mr. Chilton returned to office in that year and served until 1897. Sucessors in office were J. K. Hannah, 1897-1913 N. R. Feather ston, 1913-1926 and J. A. Burke, 1926 to date, The first public school house built with county funds was erected at Hurtsville. Other school structures were added as fast as funds from school taxes made these accomoda tions possible. Mr. N. R. Featherston, in his his tory of Appomattox County, re ports that the school term in the early days of the system was five months. Teachers average monthly salary was 25.00. In 1908, Professor Lindsay Craw ley was apointed principal of the high school at Appomattox. The frame building housing the high school stood on the lot where the present T. W. Moses residence is located. There were three teachers and 160. students. Funds allocated by the legislature in this year, with matching donations by private citi zens, financed the building of a new high school at the present site. Appomattox High School open ed in September, 1909, with the im posing name of Tenth Congression al District High School. Our public school system has made great advances in the years since 1909. In the past ten years alone, we have seen the construc tion of a new and up-to-date agri cultural vocational building at the high school addition of a hew gym nasium construction of the Carver- Price High School and elementary school for Negroes, and the build ing of the new elementary school in the town of Appomattox. For the current session, total enrollment in county public schools is 2,300 pupils, with 93 teachers."}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow"], "snippet": "He was succeeded by <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, who continued in office"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow"], "snippet": "He was succeeded by <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, who continued in office"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.71, 1248.78, 1960.2, 1546.72], "bbox_id": "4a4b7dc6e6", "file": "AppomattoxNewspapers_1892-1898a_0292.pdf", "page": 1, "text": "Aggie Glover, 8aml. H, Wooldridge, Joel L. Wooldridge and David Shields are nc t resi dents of Virginia it is ordered that raid now residents do on tbe 16tb day of May 1896 appear before me at my office at West Appo mattox to defend their Interest in this suit. R. B. POORE. Special Commissioner, MEMO Tb object of this petition Is to restore to record the lost will and testament of David Dickerson which together with the record of the same was destroyed by fire on the 2nd day of February 1KB. R. B, POORE. Special Commissioner. K S t a j p .  4-9-41. V IRGINIA, Appomattox County. Before B. B. Poore Special Commissioner of raid county to restore lost records. B-?n tOW1   o n  J. D. Bristow, J. B. Bristow, V. H. Bristow, E. L. Bristow, B. K. Bristow, F. A. Bristow, N. B. Bristow and G. T. Bristow the last five Infants uuder the age of 21 yean and L. C. Taylor and Manning Taylor her husband. Affidavit having been made before me. R. B, Poore Special Commissioner as aforesaid by Samuel L. Ferguson Attorney for the raid R. M Bristow, that J. B. Bristow, J. R. Bris tow, V. H. Bristow. Mrs. L. C. Taylor and Manning Taylor her husband, being all the adult defendants are non residents of Vir ginia. it is ordered that raid adult defendants appear before me at my office at West Ap pomattox oh May 16th 1896 to defend their interest In this suit. B. B. POORE, Special Commissioner. MEMOThe object of this proceeding is to restore to record the lost will and testa ment of J. B Bristow decd which together with its record was destroyed by fire on Feb ruary 2nd 1S62. B. B. POORE, Special Commissioner."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J", "B", "Bristow", "Bristow"], "snippet": "o n  J. D. <mark>Bristow</mark>, <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, V. H. <mark>Bristow</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J", "B", "Bristow", "Bristow"], "snippet": "o n  J. D. <mark>Bristow</mark>, <mark>J</mark>. <mark>B</mark>. <mark>Bristow</mark>, V. H. <mark>Bristow</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.21, 977.04, 2075.06, 1082.59], "bbox_id": "7a84fce1d6", "file": "AppomattoxNewspapers_1915-1918a_0530.pdf", "page": 1, "text": "of her age. The deceased was  the widow of the late Rev. J. I W ar Stamp Meeting. B. Bristow, and was buried be-1 At a meeting of the citizens side her husband in the family  of the community and school burying ground at the old home of Evergreen, Rev, McElroy place on the 25th. Among themade an exceUem address on children present from a dis-jthe subject Off.tlpD purchasing tance were Mrs. Bessie T. O.jof W ar StampS dfter whibh an McClintic, of Monroe City, Mo., organization M a s  perfected,"}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow"], "snippet": "of the late Rev. <mark>J</mark>. I W ar Stamp Meeting. <mark>B</mark>. <mark>Bristow</mark>, and was buried be-1"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow"], "snippet": "of the late Rev. <mark>J</mark>. I W ar Stamp Meeting. <mark>B</mark>. <mark>Bristow</mark>, and was buried be-1"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1617.59, 444.2, 1906.8, 646.9], "bbox_id": "3bb05096ce", "file": "AppomattoxNewspapers_1962-1965a_0312.pdf", "page": 1, "text": "and Dr. Wm D. Christian, J. H. Springs Academy Marshall and W. T. Pankey No. 3 Clover Hilli District. From 1870 to around 1920 each Magistratial district of the ty had its own board which or less guided the schools in their district in following the direc tions of the entire county school board. Many were the problems of these men, not the least of which was securing money for the operation of the schools. In j every grade, degree and merit. 1872, the earliest record avail- But as time advanced, our schools able, the school board agree to in a hvely degree fell into the , ask the Board of Supervisors hne of progress on the book ques-1 to levy a tax of three fourth of tion and the most approved books one mill on the dollar or seven were introduced and are now and one-half cents on the one  1885 in use- said Rev. J. B. hundred dollars, for county school Bristow, Superintendent, purposes for the next scholastic ! In 1879 the question of the"}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow"], "snippet": "in use- said Rev. <mark>J</mark>. <mark>B</mark>. hundred dollars, for county school <mark>Bristow</mark>, Superintendent, purposes for the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow"], "snippet": "in use- said Rev. <mark>J</mark>. <mark>B</mark>. hundred dollars, for county school <mark>Bristow</mark>, Superintendent, purposes for the"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.98, 1059.24, 1914.1, 1160.14], "bbox_id": "9683a6257d", "file": "AppomattoxNewspapers_1912-1915a_0214.pdf", "page": 1, "text": "The Tidewater Telephone Com pany has elected the following offi cers A. W. Withers, president W. DeW. Dimmock, vice-president and general manager H. E. Hutcheson, secretary and -treasurer., Board of Di rectors, A. W. Withers, John L. Farin- holt, W. E. Corr, R. S. Bristow, J. Marshall Lewis, G. S. Marchant, I. B. and B. F. Weaver, W. DeW. Dimmock and J. W. Downs."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J", "B", "B"], "snippet": "E. Corr, R. S. <mark>Bristow</mark>, <mark>J</mark>. Marshall Lewis, G. S. Marchant, I. <mark>B</mark>. and <mark>B</mark>. F. Weaver,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J", "B", "B"], "snippet": "E. Corr, R. S. <mark>Bristow</mark>, <mark>J</mark>. Marshall Lewis, G. S. Marchant, I. <mark>B</mark>. and <mark>B</mark>. F. Weaver,"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1445.51, 535.03, 1560.6, 620.38], "bbox_id": "12c882d96b", "file": "AppomattoxNewspapers_1943-1947a_0324.pdf", "page": 1, "text": "M arshall and Mrs. E. on Sunday. Sears and B. W. Bristow vrs in the home of J-  Sunday P. M. , and Emily Featherston 1 guests of Mrs. Sam on Sunday."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow", "J"], "snippet": "on Sunday. Sears and <mark>B</mark>. W. <mark>Bristow</mark> vrs in the home of <mark>J</mark>-  Sunday P. M. , and"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow", "J"], "snippet": "on Sunday. Sears and <mark>B</mark>. W. <mark>Bristow</mark> vrs in the home of <mark>J</mark>-  Sunday P. M. , and"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [190.1, 1344.27, 517.79, 1536.47], "bbox_id": "9932dcc270", "file": "AppomattoxNewspapers_1892-1898a_0442.pdf", "page": 1, "text": "on the Carolina coast for filibusters. This sort of work must bo more or Beale E h csa disgusting to the ofljjcevs and    men in our revenue marine Bervice, hut they have no choice in the mat ter. They must obey the orders of Horsley, J . E. Chick, A. B. Thorn-1 the Secretary of the Treasury, even J k- J f ------- j ........... dictated by the vhill. M a j. J. W. Flood, Large, ALTERNATES. R. W. Bristow, J. W. Clark, 0. A. Trent, W. H. Lewis, B. N. Tanner, W. H. H. Walker, G. H. Coleman, J. W. Uarnefix. Dr. D. Mott Robertson, Alternate  at Large."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J", "B"], "snippet": "Large, ALTERNATES. R. W. <mark>Bristow</mark>, <mark>J</mark>. W. Clark, 0. A. Trent, W. H. Lewis, <mark>B</mark>. N. Tanner, W. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J", "B"], "snippet": "Large, ALTERNATES. R. W. <mark>Bristow</mark>, <mark>J</mark>. W. Clark, 0. A. Trent, W. H. Lewis, <mark>B</mark>. N. Tanner, W. H."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.91, 1572.38, 897.46, 2008.5], "bbox_id": "97f4fa7344", "file": "AppomattoxNewspapers_1898-1902a_0383.pdf", "page": 1, "text": "HIXBURG PRECINCT. W. H. Ligon, chairman J. W. Wright, J. F. Lee, E. P. Sears, F. W. Coleman, Joel Watkins, F. B. Forbes, W. B. Ford, B. W. Bristow, A. A. Baldwin, Jno. W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, Thomas Dickerson. CLOVER HILL PRECINCT. .W. J. Trent, Chairman, E. E. Chism, D. P. Ferguson, H. C. Fer guson, A. B. Franklm, M. E. Agee, E. H. Lucado, J. W. Flood, J. W. Cawthorn, Jr., B. A. OBrien, C. M. Drinkard.. J. B. Hamilton, H. B. Pitmau, E. B. Abbitt, P. J. Shep- perd. AGEE PRECINCT, A. B. Thornhill, Chairman, T. J. Gooding, N. B. Featherstone, 8 . P. Taylor, W. D. Woodson, A. E. Milt- imore, J. H. Wood, C. A. Horsley, T. J. Megginson, D. M. Anderson, J. B. Childress, M. F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Cole man. OAKVILLE PRECINCT W. C. Abbitt, Chairman, T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Field Smith. C. H. Coleman, C. E. Carson, T. M, Tay lor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, B. T, Moss, J. D. Haiftersley. STONEWALL PRECINCT. S. C. Stratton, Chairman, M. W. Carson, J. C. Shearer,.S. E. Ander, son, T. C. Stratton, T. W. Tnggle, W. D. Sandidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. 8 , Thornhill, T. A. Driukartl, MtlUj Isbell, W. 8 . Taylor."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow", "J"], "snippet": "Forbes, W. B. Ford, <mark>B</mark>. W. <mark>Bristow</mark>, A. A. Baldwin, Jno. W. Webb, W. <mark>J</mark>. Paulette, W. T. Marshall,"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow", "J"], "snippet": "Forbes, W. B. Ford, <mark>B</mark>. W. <mark>Bristow</mark>, A. A. Baldwin, Jno. W. Webb, W. <mark>J</mark>. Paulette, W. T. Marshall,"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [763.68, 1374.71, 1448.86, 1724.8], "bbox_id": "9d3fbdb30a", "file": "AppomattoxNewspapers_1915-1918a_0051.pdf", "page": 1, "text": "Sheriff F. W. McKinney. Commonwealths Attorney Franklin. DISTRICT OFFICIRS CLOVER HILL DISTRICT SupervisorW. H. Ligon. co m ty, signed by the chair-1 Road Comr.J.W . Trent, man of said board and counter-1 ConstableR. W. Bristow.  s 1 lined by the clerk thereof,  Justices of the Peace payable in not m ire than thirty  maciPf. C. Turns, P. iL __ y a r s from the date of issue  Overseer PoorD. P- Fergus f said bonds the said bonds  s o u t h s id b district to be in denom ina ions of one Suoervisor W. B. Harvey, hunderd dollars to one thou- ,3Upervisor sand dollars, as the said board Justice of the PeaceC. N. I l hi? lbe8tL w ith couPon 8  Eitt R W. Martin, R all, attached for the sem i-annual  P au W party affilia- m Merest, and the principal shall Overseer PoorJ L. Driskill  3  j g Cub Creek, Beckham , Spout I perately, without predudice re-1 dollars each year, 80 that all STONEWALL DISTRICT Springs and all other sections membermg that there still is abid- of the bonds shall become due SupervisorS. R. Martin of the county. ing in the county a brotherhood of and be paid off in sums of n o t!Road Comr.J. E. Martin- I rejoice th a t we have the mankind more precious and more than five hundred dollars I Constable  J. B- Whiteneau Appom attox A g r i c u 1 tural enduring than that of blood School and only w ish that ito r party, and this should be culti- w as better equipped for its great mission and I hope to see it divorced from politics that the instructors m ay be free to give their whole talent and time to the uplift of the children Y et w ith tile j of the county, t the tax4s The county- is now very much in ! debt for school purposes. I ap-"}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "hundred dollars I Constable  <mark>J</mark>. <mark>B</mark>- Whiteneau Appom attox A"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "hundred dollars I Constable  <mark>J</mark>. <mark>B</mark>- Whiteneau Appom attox A"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [497.29, 381.1, 663.23, 1786.16], "bbox_id": "66f12937d1", "file": "AppomattoxNewspapers_1902-1905a_0564.pdf", "page": 1, "text": "office in the State. On April 17th, 1902, Beavers made the following memorandum upon the papers in relation to this office Hon. C. A. Swanson, M. C. Fifth district, called and wants to be ad vised hen inspectors report ia re ceived. Again the following endorsement is found in the case Ask M. C. Swanson to call. Signed G. W. B. Again we find this endoisement Swanson endorse in favor ot Schmelz. Accept Schmelz. G. .V. B. Schmelz Brothers were the men whose property was alreauy leased for three hundrtd and sixty dollars per annum, and whose rental had been unjustifiably increased to four hundred and eighty dollars per an num while the government still h-d a valid lease on the premises good until September 1st, 1902. The proposition of Schmelz to rent the property to the government at seven hundred and twenty dollars per an num from September 1st, 1902, was accepted, notwithstanding the in spectors report showing that the proposed building at six hundred dollars per annum was deemed more desirable, and contained heat, light and equipment for an up-to date postoffice. After the report of Bristow,show ing the conduct of members of con gress in thur dealings with the offi cials of th postoffice department, a select committee was appointed by the House of Representatives to look into the matter. This committee made what is known as the McCall Whitewash Report, which was the butt of ridicule for tbe newspaper- of the country, and though this re port did everything to apologize for the conduct of members of cougrest it said that letters such as were written by Beavers to Swanson a 1 vising him what was done as a fa vor to the member might well have been resented. Shortly after the postoffice scan dal became known to the public the President appointed Hon. Holmes Conrad, ex-solicitor general and a distinguished Virginian, as an as sistant to the attorney general in the investigation. Associated with Holmes Conrad was Charles Bonaparte, now secre tary of the  avy, and a distinguish ed Maryland lawyer. In their report, which may b found on page 201 of House Docu ment No. 383, they state in refer dug to members ol congress who have received favors from Beaver , and who knew of Beavers acts, nc folio we He the congressman stood in a fiduciary relation to the government, and so far from being justified in taking advantage of any breach f trust on the part of the official with wtom he dealt, was bound, in oi r opinion, to expose this breach i f trust, both to the latters superio ind to the House of Representative Signed H o l m e s C on h a d , Signed C h a s . J. B o n a p a r t e Special Assistants to the Attorney General. On March 11th, 1904, the House of Representatives had under con sideration a resolution for ,he ap pointment of a committee to inves tigate the charges against memb rs of congress in relation to postoffic frauds perpetrated by Beavers. Postmaster General Bristow had reported nine hundred fraudulent allowances by Beavers, affecting members and senators. Representa ttve Robinson, a Democratic con gressman from Arkansaw, declared that t.he postoffice department had given to he government the great est scandal known to modern times, a scandal that is a stench in the nos trils of every law-abiding, self-re specting citizen, a scandal which shows conclusively that officers employed in that department had robbed and stolen and plundered from the government for years and years, and that every effoit to inves tigate their conduct save only by and through officers and employes of the department had been defeat ed, The Congressional Record for that day shows that a great number of members of the house rose to a question of personal privilege and attempted to explain their relations with Beavers and to exonerate them selves from the serious charges of the Bristow report. A motion was made by Mr. Overstreet, a Republi can member from Indiana, for unanimous consent that ten days general leave to print be given to members. John Sharp Williams, of Mississippi, the Democratic leader on the floor of the house, objected, and said I thiuk it would be well that whatever is to be said to the country about so delicate a subject as this should be said in open house. Applause. The friends of those congressmen who had been involved in Beavers frauds repeatedly renewed their mo tion for leave to print and each time the motion was defeated by tbe ob jection of Mr. Williams, the Demo cratic leader. On this same day"}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "C h a s . <mark>J</mark>. <mark>B</mark> o n a p"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "C h a s . <mark>J</mark>. <mark>B</mark> o n a p"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1055.27, 509.8, 1207.32, 1804.99], "bbox_id": "4d3279e3fc", "file": "AppomattoxNewspapers_1918-1922a_0365.pdf", "page": 1, "text": "Norfolk.Mrs. Ruth White was shot to death on the doorstep of her home ln -this city. The entire police force is searching for her husband, J. Weldon White. Lexington.Captain David E. Moore, aged 80, formerly for many years Commonwealths Attorney for Rock bridge and well-known Confederate veteran, died at the home of his sister, Mrs. Alexander L. Nelson, here. Manassa.Karl J. Austin, on trial tor the murder of J. R. B. Davis, shot and killed on the street here May 3 by Austin, was acquitted after Mrs. Austin had testified regarding her re lations with Davis. The jury was out only twenty-five minutes. Pulaski.There were 1,650 women in Pulaski county who paid their poll- taxes, registered, qualifying -to vote in the presidential election on November 2. One-half the number were in Pu laski City. In all 135 negro women registered. Danville.The . local aircraft cor poration has found that commercial Eying is not a financial success. The machine owned here, and which has been filling fair contracts, returned Saturday, and it was announced that the affairs of the concern, would be wound up-without further delay and the machine sold. Pulaski.A. J. Hailey was fatally In jured by a premature explosion of a dynamite hole at the Pulaski Stone Company quarries. He was manager ot the company and was tamping a loaded hole when, it is presumed, he struck a spark. He died soon after the accident. He leaves a widow and several small children. Lynchburg.  Senator Warren G. Harding has accepted an invitation to make an address at the Elks National Home, Bedford, Va., December 5, ac cording to a telegram received from Marion, Ohio, by Mayor Fred Harpor, ot this city. The occasion will be the annual memorial services to the dead members of-the order. Lynchburg.Exactly 1,642 women qualified themselves here to vote at the November election, 300 being reg istered the last day. Of the 1,765 who were assessed for capitation taxes only 125 failed -to register or were dis qualified by the registrars. The new registration placed 320 negro women on the books, ninety-one who were assessed failing to register. Winchester.Mystic Shriners be longing to Acca Temple, of Richmond, Will hold a ceremonial session at Staunton on October 15, when, it is expected, a large class of novices, drawn principally from towns in the Shenandoah Valley, will be initiated. Plans for entertaining the Shriners are under way, and it is proposed to have the city decorated. The ceremonies are to take place at the Staunton Mili tary Academy, and it will be virtually a twenty-four-hour jubilation, it .is stated. Richmond.Four division superin tendents were chosen to fill vacancies In Virginia schools at a meeting of the State Board of Education. These va cancies were caused by the resigna tions to accept other positions. W. W. Edwards was selected to fill the unexpired term of A. B. Bristow, re signed, from Prince George and Sus sex, who has accepted the position of principal at Maury High School in Norfolk city. Mr. Edwards was ap pointed with the understanding that he would give his whole time to the work. W. K. Barnett was chosen as acting superintendent of Bedford City, to succeed J. P. Whitt, who resigned that he might continue educational work. Charlottesville.Paul Goodloe Mc- Intlre, of this city, who recently gave the University of Virginia 60,000 for the erection of a Greek amphitheatre at that institution, has just contributed an additional 24,000 to be spent on the building itself, and in the installa tion of an immense pipe organ. The ampitheatre, now under course of con struction, will have a seating capacity of 3,600. The structure was designed by Professor Fiske Kimball, and the erection is being supervised by Pro fessor Makielski, of the school of architecture. It will he completed by the centennial next June, and will be the only one of its kind in the South and West. It will rank with the Bebeli Gardens, of Florence, Italy. . Petersburg.Stricken while attend ing the Parent-Teachers Association, of which she was vice-president, Mrs. John R. Rose, a prominent Petersburg woman, died. Mrs. Rose had just fin ished taking up the usual collection and was in the act of handing it to the president, when she staggered and fell. Medical aid was summoned, but death was declared to have been instantane ous. Heart disease was given as the reason for Mrs. Roses death. She was a native of Lunenburg county, hut had been in this city for a number of years. Danville.John C. Blair, of Witt, has been chosen chairman of the Chatham district unit of the Virginia Tobacco Growers Association, and he has called a meeting to be held there to perfect local organization."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "unexpired term of A. <mark>B</mark>. <mark>Bristow</mark>, re signed, from Prince"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "unexpired term of A. <mark>B</mark>. <mark>Bristow</mark>, re signed, from Prince"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1093.68, 548.91, 1254.58, 1795.79], "bbox_id": "4d7c803739", "file": "AppomattoxNewspapers_1918-1922a_0247.pdf", "page": 1, "text": "Lexington.Captain David E. Moore, aged 80, formerly for many years Commonwealths Attorney for Rock bridge and well-known Confederate veteran, died at the home of his sister, Mrs. Alexander L. Nelson, here. Manassa.Karl J. Austin, on trial for the murder of J. R. B. Davis, shot, and killed on the street here May by Austin, was acquitted after Mrs, Austin had testified regarding her re lations with Davis. The jury was out only twenty-dive minutes. Pulaski.There were 1,650 women in Pulaski county who paid their poll- taxes, registered, qualifying to vote in the presidential election on November 2. One-half the number whre in Pu laski City. In all 135 negro women registered. Danville.The local aircraft cor poration has found that commercial flying is not a financial success. The machine owned here, and which has been filling fair contracts, returned Saturday, and it was announced that the affairs of the concern would be wound up without further delay and the machine sold. Pulaski.A. J. Hailey was fatally in jured by a premature explosion of a dynamite hole at the Pulaski Stone Company quarries. He was manager of . the company and was tamping a loaded hole when, it is presumed, he struck a spark. He died soon after the accident. He leaves a widow and several small children. Lynchburg.  Senator Warren G. Harding has accepted an invitation to make an address at the Elks National Home, Bedford, Va., December 5, ac cording to a telegram received from Marion, Ohio, by Mayor Fred Harper, of this city. The occasion will be the annual memorial services to the dead members of the order. LynchburgExactly 1,642 women qualified themselves here to vote at the November election, 300 being reg istered the last day. Of the 1,765 who were assessed for capitation taxes only 125 failed to register or were dis qualified by the registrars. The new  registration placed 320 negro women on the books, ninety-one who were assessed failing to register. Winchester.Mystic Shriners be longing to Acca Temple, of Richmond, Will hold a ceremonial session at Staunton on October 15, when, it is expected, a large class of novices, drawn principally from towns in, the Shenandoah Valley, will be initiated. Plans for entertaining the Shriners are under way, and it is proposed to have the city decorated. The ceremonies are to take place at the Staunton Mili tary Academy, and It will bo virtually a twenty-four-hour jubilation, it is stated. Richmond.Four division superin tendents were chosen to fill vacancies 1n Virginia schools at a meeting of the State Board of. Education. These va cancies were caused by the resigna tions to accept other positions. AV. W. Edwards was selected to fill the unexpired term of A. B. Bristow, re signed, from Prince George and Sus sex, who has accepted the position of principal at Maury High School in Norfolk city. Mr. Edwards was ap pointed with the understanding that lie would give his whole time to the work. W. K. Barnett was chosen as acting superintendent of Bedford City, to succeed J. P. Whitt, who resigned that he might continue educational work. Charlottesville.Paul Goodloe Mc- Intire, of this city, who recently gave the University of Virginia 60,000 for the erection of a Greek amphitheatre at that institution, has just contributed an additional 24,000 to be spent on the building itself, and in the installa tion of an immense pipe organ. The ampitheatre, now under course of con struction, will have a seating capacity of 3,600. The structure was designed toy Professor Fiske Kimball, and the erection is being supervised by Pro fessor Makielski, of the school of architecture. It will be completed by the centennial next June, and will be the only one of its kind in the South and West. It will rank with the Bebeli Gardens, of Florence, Italy. Petersburg.Stricken while attend ing the Parent-Teachers Association, of which she was vice-president, Mrs. John R. Rose, a prominent Petersburg woman, died. Mrs. Rose had just fin ished taking up the usual collection and wasin the act of handing it to the president, when she staggered and fell. Medical aid was summoned, but death was declared to have been instantane ous. Heart disease was given as the reason for Mrs. Roses death. She was a native of Lunenburg county, but had been in this city for a number of years. Danville.John C. Blair, of Witt, has been chosen chairman of the Chatham district unit of the Virginia Tobacco Growers Association, and he has called a meeting to be held there to perfect local organization."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "unexpired term of A. <mark>B</mark>. <mark>Bristow</mark>, re signed, from Prince"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "unexpired term of A. <mark>B</mark>. <mark>Bristow</mark>, re signed, from Prince"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2117.46, 779.36, 2281.76, 1577.21], "bbox_id": "3adfc8374f", "file": "AppomattoxNewspapers_1915-1918a_0017.pdf", "page": 1, "text": "DISTRICT OFFICERS SonthsideW. B. Harve was nominated on the motion of S. P Coleman for SupervL sor. John T. Cole, on the motion of W. B. Marshall, was nomi nated for Road Commissioner Justice of the PeaceW. L Brown, R. W. Martin and iichard Paulette. Overseer PoorJ. L. Driskill ConstableOscar Cheatham. Clover HillW. H. Ligpn for upervisor R. W. Bristow for Constable W. J. Trent for load Commissioner W. A. Womack, H. C. Tomes and P. . Gilliam, for Justices of the Pace D. P. Ferguson for Overseer Poor. StonewaU-S. R Martin for inpervisor, J. E. Martin foi Hoad Commissioner J, B. Whitehead for Constable No nominations made lor Justices in this district. The organization of the party was completed by the eleotion of the following Ex ecutive Committee CourthouseS. P. Coleman. Cheat woodGeo. W. Cheat ham. ChapJoel T. Gawthon. Old CourthouseW. J. Trent. HixbnrgWilson Hix. PamplinW. C. Franklin. RocksB. D. Dickerson. 8tonewallA. F. Drinkard. OakvilleJ. A. Spiggle. AgeeKinckle Martin. Dr. Robertson was made Chairman of the Committee and eaoh preoinot Chairman is expected to appoint two assis tants. Hons. Gawthon and Franklin gave the parting exhortations and urged those present to go tome and go to work. Mr, franklin declared he was no office seeker and if liis feelings were oonsultod he would de cline the honor. He said this was not a movement of the He publican party, but a reform movement demanded by the people of the County. He de clared he had been elected to the office of Commonwealth Attorney three times and had served twice. The meeting was most har monious and enthusiastic and means work for the nominees ol the Democratic party."}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "Martin foi Hoad Commissioner <mark>J</mark>, <mark>B</mark>. Whitehead for Constable No"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "Martin foi Hoad Commissioner <mark>J</mark>, <mark>B</mark>. Whitehead for Constable No"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [802.32, 563.52, 959.17, 1275.27], "bbox_id": "1eb4d3c22e", "file": "AppomattoxNewspapers_1898-1902a_0580.pdf", "page": 1, "text": "CHEATWOOD PEECINCT. B. N. Tanner, chairman A. H. Howerton. J. W. Powell, C. F. Rob ertson, W. D. Doss, T. H. A. Cheat ham, C. A. Cardwell, L. T. Morris, Robert B. Poore, Hansford Card- well, W. G. Coleman, W. F. Johnson, J. D. Cheatham, A. C. Cheatham, Samuel Cheatham. CHAP PEECINCT. S. J. Lee, chai.inau S. G. Harvey, C. H. Godsey, W. H. Childress, C. H. Lee, J. C. Martin, J. T. Cawthorn, W. H. Lewis, R. W. Fleshman, E. C. Marshall, 0. S. Cawthorn, J. Baxter Marshall, W. P. Godsey, J. C. Wol- ridge, J. L. Woodson. PAMPLIN PEECINCT. J. W. Clark, chairmau, L. W. Thornton, P. M. Hannah, R. D. Baldwin, Geo. F. Farrar, John H. Davis, Dr. C. S. Morton, Dr. E. E. Walker, J. A. Oaks, L. W. Gilliam, R. li. Davis, E. F. Glover, E. F.Wil Hams, W. A. Womack, Jno. Warner. OAKVILLE PEECINCT. W. C. Abbitt, chairman T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Fields Smith, C. II. Coleman, C. E. Carsou, T. M. Taylor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, R. T. Moss, T. W. Trent. HIXBUEG PEECINCT. W. H. Ligon, chairman K. M. Garrett, C. B. Gilliam, E. P. Sears. P. W. Coleman, Joel Watkins, W. B. Forbes, W. B. Ford, R. W. Bristow, A. A. Baldwin, John W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, T. E. Paulette. CLOVEB HILL PEECINCT. W. P. Gills, chairman E. E. Chism, D. P. Ferguson, H. C. Ferguson, A. B Franklin, M. E. Agee, E. H.-Luc- ado, J. W. Flood, J. W. Tweedy, R A. OBrien, C. M. Drinkard, J. R. Hamilton, H. R. Pitman, E. R. Ab bitt, P. J. Sheppaid, R. H. Brown ing, II. C. Babcock, W. F. Wright, J. W. Wright. STONEWALL PEECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, 1. W. Tuggle, W. D. Sandidge, J. I. Martin, P. L Stratton, C. M. Stratton, J. S. Thorn hill, T. A. Drinkard, Milton Isbell, W. S. Taylor, Ur. J, B. Abbitt. AGEE PEECINCT. A. B. Thornhill, chairman T. J. Gooding. N. R. Featherston, S. P. Taylor, W. D. Woodson, A. E. Mil- timore, J. H. Wood, J. D. Hamers- ley, T, J. Megginson, D. M. Ander son. J. D. Childress, M, F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Coleman."}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "W. S. Taylor, Ur. <mark>J</mark>, <mark>B</mark>. Abbitt. AGEE PEECINCT. A."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "W. S. Taylor, Ur. <mark>J</mark>, <mark>B</mark>. Abbitt. AGEE PEECINCT. A."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [510.48, 1404.85, 670.03, 1718.31], "bbox_id": "050ca0c136", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "C itizens C andidates House of DelegatesJ. W. Caw- thon, Jr. Comr. of RevenueR. P. Bryant. TreasurerD. M. Robertson. SheriffF. W. McKinney. Commonwealths AttorneyW. C. Franklin. DISTRICT OFFICERS CLOVER HILL DISTRICT SupervisorW. H. Ligon. Road Comr.J. W. Trent. ConstableR. W. Bristow. J ustices of the PeaceW. A. Wo mack, H. C. Turns, P. H.Gilliam. Overseer PoorD. P. Ferguson. SOUTHSIDB DISTRICT SupervisorW. B. Harvey. Road Comr.J. T. Cole. Justice of the PeaceC. N. Ab- bitt, R. W. Martin, Richard Paulett. Overseer PoorJ. L. Driskill. ConstableOscar Cheatham. STONEWALL DISTRICT Supervisor S. R. Martin. Road Comr.J. E. Martin. ConstableJ. B. Whitehead. Justices of the PerceM. F. Kyle, adv"}, "highlight": {"text": {"matched_tokens": ["Bristow", "J"], "snippet": "W. Trent. ConstableR. W. <mark>Bristow</mark>. <mark>J</mark> ustices of the PeaceW."}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J"], "snippet": "W. Trent. ConstableR. W. <mark>Bristow</mark>. <mark>J</mark> ustices of the PeaceW."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [395.99, 1046.97, 561.07, 1383.19], "bbox_id": "91e20c4f99", "file": "AppomattoxNewspapers_1892-1898a_0514.pdf", "page": 1, "text": "Appomattox, Va., May 5 thThe Democra ts of Appomattox couuty met today at the courthouse at 12 oclock for the purpose of electing delegates to the Democratic conven tion to be held at Covington on June 22nd. The meeting was called to order by S. L. Ferguson. Dr. J. B. Abbitt was elected chairman, W. II. Burke and A. H.Clement, secretaries. The following delegates were elected  Southside DistrictDr. D. Mott Robertson, T. A Smith, S. L. Fer guson, J. W. Harvey, J. II. Robert son aud W. H. Burke. Clover Hill DistrictMajor J. W. Flood, W. H. Ligon, It. W. Beal, W. J. Trent, E. E. Chism and R. W. Bristow. Stonewall Distrist T. J.Stratton, I. A. Christian, Jesepli Button, M. F. Kyle, J. H. Featherstone, and J. R. Horsley. On the motion of Dr. Robertson, the following resolution was unani mously adopted  Resolved, by the Democrats of Appomattox couuty, in mass-meet ing assembled, tliat the delegates this day electe.i to the congn.ssional convention which meets in Coving ton, Va., on June 22, 1898, are hereby instructed to vote for her favorite son, Hon. H. D. Flood, so"}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "S. L. Ferguson. Dr. <mark>J</mark>. <mark>B</mark>. Abbitt was elected chairman,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "S. L. Ferguson. Dr. <mark>J</mark>. <mark>B</mark>. Abbitt was elected chairman,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [718.77, 493.86, 1672.59, 704.96], "bbox_id": "13ab17a64d", "file": "AppomattoxNewspapers_1898-1902a_0555.pdf", "page": 1, "text": "present.  . The protrao ed meeting at Bethel County Chairman fe. L. Ferguson  Church will begin on the third Sim- called the meeting to order. Dr. D. dav morning in September. Mott Robertson was elected chair- The meeting at Trinity will begin man of the meeting, and Mr. S. P  on ,fl Smik-y , . Miss 1 an me Owen, of Bedford, it. Coleman, eerefarv. ! visiting the home of Er. Ed. Carson. ! XTil T -, , T , .. Delegates.tb, seRntoriai Oon- Ti.i. lett,,  i,uie i.i. With an Elegant Line of CHAMBER, PARLOR, DINING-ROOM, LIBRARY, and vention were elected by districts, as j last week 1 follows f ------------- _  Vermilion. i rp . bonthaideSamuel L. Ferguson, Mr. W. S Hamilton, who has so! Dr. i. Mott Robertson ii. w. Me- hong been sick, is mpidiy improving I every one guaranteed. OUR PRICES ARE T H E L O W E S T Kinney, and R. C. Childress. under the treatment of Dr. D. Mott f J O  l i t  k v i I b O I  Clover-HillE. P. Sears, Joel W. j Robertson. Watkin, R. W. Bristow, and J. W. K We hav ,W orops in our . . not hood. Alvin Hamilton has ne  of the finest one-horse crops hit I __ ___ _____ _____ _ _ _ _ _ ____ ___ ___ _ _ ____ _____ 8 ton e w a 1 J. R. Chick, . W. I have ever seen. j  BB B WH b i 1rent. E. C. Lewis, T. E. Owen, and  Mr. C. A. Moore has begun saw-"}, "highlight": {"text": {"matched_tokens": ["Bristow", "J"], "snippet": "Robertson. Watkin, R. W. <mark>Bristow</mark>, and <mark>J</mark>. W. K We hav"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J"], "snippet": "Robertson. Watkin, R. W. <mark>Bristow</mark>, and <mark>J</mark>. W. K We hav"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2059.7, 746.08, 2213.71, 1006.68], "bbox_id": "6ce8697931", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "N the Clerks Office ot the Circuit Court ot the Count, ot Appomattox on the 18th d a, ot JUne, 19IT. Mettle M. Brie tow end her husband, B. W. Bristow .......................................... . . PlelntlCa aghH.it Wert Watkins, Berta Watkins, W H Farrar and his w lte Qlll Farrar, Alma White and her hueband Jesse White, Minute Cheadle and her hueband 8 H Cbeadle. Laura Meadows and her husband Walker Meadows, Lou Meadows and her hue- band J R Meadows, Mrs. W B Hubard and her husband W b Hubard, Jam es T Watkins. B L Childress, Frank t atkins and Snow Watkins, and the unknown heirs a t law ot Blfa W atkins Wallace, deceased ............... . ......... . Defendants The obleot of this suit Is to partition the tract o t 26 acres of land tn Appomattox county, Virginia, of whioh M B Watkins died seized and possessed. And an affidavit having been made and Sled that the defendant James Watkins and B L Childress are not residents of the State of Virginia and th at the whereabouts of the heirs at law of Blla Watkins Wallaoe, de ceased, are not known. It la ordered that th e , do appear here within fifteen days after due publication hereof ana do w hat may be neeesaar, to pro tect their Interests In this suit. Ana It I farther ordered that a oop, hereof be mbllshed once a week for four weeks tn the Imes-Vlrgtnlan, a newspaper published In the oounty of Appomattox, and th at a copy be posted at the front door of the court house of th is oount, on the 18th day of June, 1SIT, th at being the next suoeeedlng rule d a, after this order was entered. t A oopyTeste J U HOBBLEY, Clerk, b , C W Smith, D O A H Clement, p q 718 U"}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "tow end her husband, <mark>B</mark>. W. <mark>Bristow</mark> .......................................... . . PlelntlCa aghH.it Wert Watkins,"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "tow end her husband, <mark>B</mark>. W. <mark>Bristow</mark> .......................................... . . PlelntlCa aghH.it Wert Watkins,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2066.91, 751.99, 2221.49, 1013.5], "bbox_id": "b3b83b0a7f", "file": "AppomattoxNewspapers_1915-1918a_0412.pdf", "page": 1, "text": "N the Clark Office of ths Circuit Court of the Oountv ot Appomattox on ths 16th day of June, 1917. Mattie M. Bristow and her husband, B. W, Bristow, ...... . ........ .....................Plain tits against Wert Watkins, Berta Watkins, W H Farrar ana his wife dill Farrar, Alma White and her husband Jesse White, Minute Cheadle and her husband 8 B Cheadle. Laura Meadows and her husband Walker Meadow, Lou Meadow and her hus band J K Meadows, Mrs. W B Hubard and her husband W B Hubard, Jamas T Watkins, 1 L Cblldrots, Frank t atklns and Snow Watkins, and the unknown heirs at law ot Ills Watkins Wallaos. deoeased ..... . ......... .. ............ Defendants The object of this suit is to partition the tract of SI acres of land in Appomattox county. Virginia, of whleh M B Watkins died seized and possessed. And an affidavit having been, mads and filed that ths defendants Jams Watkins and L Childress are not residents of the State ot Virginia, and that the whereabouts of the heirs at law of Bits Watkins Wallaee, de ceased, are not known, it is ordered that they do appear here within fifteen days after dne publication hereof and do what may be neoessary to pro tect their interests in this suit. And it t further ordered tbat a copy hereof be ubliahed onoe a week for fonr weeks in the imes-Virginian, a newspaper published In the oounty of Appomattox, and that a oouy be posted atl thefront-door ot the court house of this county on the 18th day of Jun. 1917, that being the next suoeeedlng rule day after this order was entered. A oopyTeste 1 BHORHLBY, Clerk, H Clement, p q by C W Smith, D Ö 718 4t"}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "Bristow and her husband, <mark>B</mark>. W, <mark>Bristow</mark>, ...... . ........ .....................Plain tits against Wert"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "Bristow and her husband, <mark>B</mark>. W, <mark>Bristow</mark>, ...... . ........ .....................Plain tits against Wert"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2070.25, 1009.22, 2228.8, 1272.08], "bbox_id": "19f4e08582", "file": "AppomattoxNewspapers_1915-1918a_0429.pdf", "page": 1, "text": "I N thelClerka Office of the Circuit Court of tbe County of Appomattox on tbe 16th day of June, 1917. I Mattie M. Bristow and ber husband, B. W. Bristow ............................................. Plaintiffs against Wert Watkins. Berta W atklns. W H Farrar and bis wife ail Farrar, Alma White and her husband Jesse White, Minnie oheadle and her husband S H Cbeadle. D o ra Meadows and ber busband Walker Meadows, Lou Meadows and her hus band J H Meadows, Mrs. W U Hubard and ber husband W B Hubard, Jam es 1 Watkins. BLChildress, Frank Watkins and snow Watkins, and the unknown heirs a t law of Blla Watkins Wallace. deceased.................................. Defendants Tbe object of this suit Is to partition tbe ! tract of aores ot land In Appomattox county, Virginia, of wblob M B Watkins died seized and possessed. And an affidavit having been made and died that tbe defendants James Watkins and B L Childress are not residents of the State of Virginia, and that the whereabouts of tbe belrs at law of Slla Watkins Wallace, d e ceased, are not known. It Is oroeied that they do appear here within Ofteen days after due publication hereof and do wbat may be neoessary to pro tect their Interests in this suit. Ana It Is further ordered that a copy hereof be published onoe a ,week for four weeks in tbe Times-Virginian, a newspaper published in tbe county of Appomattox, and th at a copy be posted a t tbe front door of the court house of this county on the 16th day of June. .917, tbat being tbe next succeeding rule day  after this order was entered. A copyTeste J H HOBS LB Y, Clerk, by C W sm ith, DO IA H Clement, p q 7 18 It"}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "Bristow and ber husband, <mark>B</mark>. W. <mark>Bristow</mark> ............................................. Plaintiffs against Wert Watkins."}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "Bristow and ber husband, <mark>B</mark>. W. <mark>Bristow</mark> ............................................. Plaintiffs against Wert Watkins."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1755.29, 457.27, 1913.38, 776.1], "bbox_id": "e19146fbe1", "file": "AppomattoxNewspapers_1915-1918a_0530.pdf", "page": 1, "text": "H lx b u rg I saw in the last issue of the pnper that you bad gotten a reporter for the news from Hix- burg However, as ex-corre spondent I will contribute a few lines, and excuse myself as not pushing myself in any way on my successor and wish both the paper and the new corre spondent the greatest of suc cess. Mr. John H. McCue has re turned from a visit to relatives and old-time friends in Blue- field and Princeton, W. Va. Mr. J. W. Davis left on Mon day morning for Farmviile in response to a message annoifnc ing the serious illness of Mrs Baxter Davis of that plaoe- Messrs W. A. Swan, J,. R. Fore, R. W. Bristow and J Ttxomas Hix were among those from this place attending court at Appomattox on Monday of this week."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J"], "snippet": "R. Fore, R. W. <mark>Bristow</mark> and <mark>J</mark> Ttxomas Hix were among"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J"], "snippet": "R. Fore, R. W. <mark>Bristow</mark> and <mark>J</mark> Ttxomas Hix were among"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2037.6, 338.6, 2193.33, 613.05], "bbox_id": "ee34908f8c", "file": "AppomattoxNewspapers_1915-1918a_0408.pdf", "page": 1, "text": "N the Clerk Offlce ol the Ctroult Court of the Countv of Appomsttox on the 16th day of June, 1917. Mattie M. Bristow and her husband, R. W. B ristow , .............. . .......................... Plaintiffs against Mrs. W B Hubbard, W B Hubbard, Mra. J K Meadow. J K id endow, Mrs. Laura Meadow, J w Meadow, W irt watklna. Miss Berta Watklna, v H Karrar, Mary B Farrar, Al fred Farrar. Gilt Farrar. Alma White, Jer sey White, Minnie Cheaale, H 8 Cheadle, Frank Watklna, Snow Watkins, James W stkinsand K L Childress.... Defendants Tbe object of this suit Is to partition the tract of. 25 acres of land In Appomattox county, Virginia, of which M B Watkins died seised and possessed. And an affidavit having been made and died that tbe defendants James Watkins and 1 L Childress re not resident of the State of Virginia, it is orooted th at they do appear I here within fifteen days after due punflea- tion hereof and do what may be necessary to protect their Interests In this suit. Ana It is further ordered that a copy hereof be published once a week for fonr weeks in tbe rimes-Virginian, a newspaper published In the county of Appomattox, and that a copy be posted at the front door of theoourt- house of this county on the lttth day of June. 1917, that being the next succeeding rule day alter this order was entered.  oopyTeste J KHOUSLBT,Clerk, by C W sm ith, D G A H Clement.  q 27 LOOK"}, "highlight": {"text": {"matched_tokens": ["B", "J", "J"], "snippet": "W B Hubbard, W <mark>B</mark> Hubbard, Mra. <mark>J</mark> K Meadow. <mark>J</mark> K"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "J", "J"], "snippet": "W B Hubbard, W <mark>B</mark> Hubbard, Mra. <mark>J</mark> K Meadow. <mark>J</mark> K"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1913.75, 855.91, 2183.09, 1133.0], "bbox_id": "efbdf4201a", "file": "AppomattoxNewspapers_1915-1918a_0074.pdf", "page": 1, "text": ". . . , , __ , ___ n i i i t . m I VTU be at Appomattox tbe first two eon bo triod bofore Jusfcico jiiliftm Montive wontSi on next Saturday morning at H ix b u rg . Thanksgiving has oome and gone and the doings of the day has gone down in history and one thing we should be thank ful for is that we live in a land of peace and plenty. Rev. Mr. Sam Harwood and j wife of Jarrett Va. has been spending a few days with his mother Mrs. JohnW. Harwood. Mr. R. W. Bristow was . at j Drakes Branch Monday selling  tobacco.  Mr. W H. Swan was m Appomattox on Tuesday selling tobacco. Every one speaks as j being satisfied with the prices. Mr. John Harwood tis in Farmville this week selling tobacco."}, "highlight": {"text": {"matched_tokens": ["Bristow", "j"], "snippet": "Harwood. Mr. R. W. <mark>Bristow</mark> was . at <mark>j</mark> Drakes Branch Monday selling"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "j"], "snippet": "Harwood. Mr. R. W. <mark>Bristow</mark> was . at <mark>j</mark> Drakes Branch Monday selling"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [145.2, 234.53, 324.1, 1122.67], "bbox_id": "91a9660697", "file": "AppomattoxNewspapers_1912-1915a_0195.pdf", "page": 1, "text": "The legislative contest is the ab Berbing topic of coversation it Farmville. I have already written you that Mr.  a 1, satisfied that Dr. Winston was ineligible, entered tbe fig .fc, and at once carried it into the courts. He lost out in Prince Eiiwa-d Circuit Court, bnt has won oat before Judge Cardwell, of the Court of Appeals and having won, he is the one and only Democratic c-indiilste for .legislative honors in this county. Already an indepen dent  as annoui.c d his candidacy, bnt I endulge the comfortable hope that the thoughtful Democrats of Prince Edward will allow of no break in pai ty lines. Mr. Wall h is worthily won the laurel, and should be allowed to wear it.  . The further we set from the re- oent rtorm of hail and wind, assur anee is deepened, that the loss was not a heavy, as it was thought to hsve bei n. True some farmers suf fered severely, especially many in Buckingham, bnt with others, hurts are being healed, and with the generous rain, ah damage is being! done avay with. Bruised and! broken leaves ot tobacco, have been stripped Mtn the parent stem, and! others ate growing in their places I Speaking of tobacco, I am reminded of wl at a farmer told me only o  1 ,esterday. In this immediate sec- tion there are three fi Ids whih were cultivated in tobacco thi season, from the stubble that wer I left over from la-t season, aDd stood! out all win ei, This is something! new oi crop lands, and if our firm-J ers can in the to re grow the weed without the burning of plant beds or the transplanting of plans, then great gain will have l-eeu made. As I said, a farmer oil me this, a far-1 mer. by the way, of furty years ex-j perienee, and of course be told me! the troth. It would be interesting I to know if her farmers have seenj anything like it. Drs. Beckham and Hamlet, and! Messrs. B. M. Cox and Bristow went I to Newport News recently in a mo-1 tor car and had the trip of fceir lives. They skimmed along smooth- ly, pleasantly, making 21 to 40 miles an hoar, with but one accident, and that e punctured tire. They tell this good joke upon Farmville, h w- ever, the nearer they approached the Farmvi le dispensary, th j found the worst roads. From Nottow iy to Richmond, via Petersburg, the highways were excellent, and from Richmond to Newport News ideal. Mr. Walter Burton is the  Xpert! motor handler in town. He whirls his machine about on Main 8lreet with niarvelouu ease, and to the de light of lookers on. No accident, so far, though Farmville n w has more oars than Appomattox can boast of."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "and Hamlet, and! Messrs. <mark>B</mark>. M. Cox and <mark>Bristow</mark> went I to Newport"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "and Hamlet, and! Messrs. <mark>B</mark>. M. Cox and <mark>Bristow</mark> went I to Newport"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.69, 1091.24, 2168.64, 1211.34], "bbox_id": "fc62f37488", "file": "AppomattoxNewspapers_1943-1947a_0368.pdf", "page": 1, "text": "Mr. Ryland W itt Bristow died at the home of E. P. Sears, near Hixb.rg early this morning. He was born in Ohio December 12, 1871, and had been a resident of Appomattox County for about bO years. He was the son of the late James B. and Nannie Rawlings Bristow. He is survived .iy the fol lowing children, all of Chicago Ad- dison Bristow, Norris Bristow, Ry land W. Bristow, Jr. and Mrs. E. J. Dohrman also by four sistsrs."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "of the late James <mark>B</mark>. and Nannie Rawlings <mark>Bristow</mark>. He is survived .iy"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "of the late James <mark>B</mark>. and Nannie Rawlings <mark>Bristow</mark>. He is survived .iy"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [719.45, 912.09, 874.85, 991.85], "bbox_id": "3aee24933b", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "IIIXBURG PRECINCT. W. H. Ligon, chairman K. M. Garrett, G. B. Gilliam, E. P. Sears. P. W. Coleman, Joel Watkins, W. B. Forbes, W. B. Ford, li. W. Bristow, A. A. Baldwin, John W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, T. E. Paulette."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "W. B. Forbes, W. <mark>B</mark>. Ford, li. W. <mark>Bristow</mark>, A. A. Baldwin, John"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "W. B. Forbes, W. <mark>B</mark>. Ford, li. W. <mark>Bristow</mark>, A. A. Baldwin, John"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1572.95, 1616.08, 1844.76, 1995.44], "bbox_id": "7b36c08fd5", "file": "AppomattoxNewspapers_1898-1902a_0608.pdf", "page": 1, "text": ".South Carolina Interstate and West j P11  D. Moses, A. B Jndlan Exposition, Charleston, S.C., , V. Bristow, George O K . .st, . 90 ., to June .st . 902 . j y CadMreJ D u account of the above the ionuhero Jiailway annoujces very j 0 n  er  M rates from all points to Charles-j J. awthorn, John D.I be, H. V-, and return- From Rich- j Whitt Agee and John 111 Rond to Charleston and return, tickets on sale daily, with return  the f Mr .-lim it ten days, 13.60 round trip,  Fore, senior member of E Season tickets on sale daily, 18.55 j  which occurred i rotind trip, with return limit May ,r j.t pge, the citv I  3 lst, I m - Correspondingly low l f u .  ntites will apply from other bouthern J   LJIOIIltS. . i Jh e Southern offers Eceptionaliy Fore was widely known 1 -.fine facilities for reaching Charles-1 Campbell counties, and Jin , with through-car service from j friends, fte Nortb.Wcst and South. JJit.iug-1 ft u ,.r to gtate ,,l fear service on all ijirouh trains. 1  1 p _ ________________ - ________  of Mr. Fore will not n Sayed His Life. j interfere with the bonn I  7 wish to sty that I feeil owe my   fact Mr. F , life to Kodo! Dyspepsia Cure, wnies  ... . , . , IL C . Jiresterison of .lay field, Minn, i  W or three years I was troubled with i active part in the bu-i j8yspepsia so that I could bold noth-j number of jears prior to B g on my stomach. Many times I j yj r_ jfohertson, an old A ujd be unable to retain a morsel of   _ popuar energetic Jod, Finally I was confined to uy - r r ftdL Doctorssaid I could not live. I  ble-aidcd by the ve J pel one of your advertisements on  to be had, can get as muf, fLjol Dyspepsia Cure and thought it  tobacco as any house in I jin y case and commenced its use. 1 you can make no misfak K au to improve from the first botti.  . toi.iy00 t0 w. w I am cured and recommend it j    ,  fc ll. Digests your food. Cures all  J.ynenbiiig. Im ach troubles. J . JL Atwood. I Bead the T imes for co"}, "highlight": {"text": {"matched_tokens": ["j", "B"], "snippet": "Carolina Interstate and West <mark>j</mark> P11  D. Moses, A. <mark>B</mark> Jndlan Exposition, Charleston, S.C.,"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "B"], "snippet": "Carolina Interstate and West <mark>j</mark> P11  D. Moses, A. <mark>B</mark> Jndlan Exposition, Charleston, S.C.,"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [563.51, 1089.42, 727.3, 1458.46], "bbox_id": "3f2a9e76ab", "file": "AppomattoxNewspapers_1902-1905a_0121.pdf", "page": 1, "text": "On motion of A. B. Thornhill each candidate for county offices and General Assembly is assessed five dollars to defray the expenses of the primary, and that the same be paid over to the chairmau on or before July 1st. The following judges have been selected to conduct the primary ,uPmmpIil1 City H. Davis, Jr., W. r. Johnson and Scott Rice. Hix burgJoel Watkins, Witt Coleman and K. W. Bristow. ChapW. II. Lewis, E. J. Har vey and S. G. Harvey. CourthouseThos. A. Smith, E. J. Harvey, and one to be supplied. AgeesW. D. HurnPrsley, J01 H. Garrett, W. W. Thornton. StonewallM. W. Carson, J. I Alvis, and J. E. Chick. Clover HillE. E. Chism, F. 4 0 Brien and R. H. Browning. O a k v ille  R. H . W h e e le r, T . O w en a n d R . D . H u g h e s . CneatwoodTo be supplied. The committee endeavored to fol low tbe plan laid down and endorsed by the Norfolk Convention, especi ally in deciding on the viva voce plan of voting, and all Democrats are urged to participate in the pri mary. The meeting of the Committee was harmonious and all the candi dates seemed to be well pleased with the plan adopted."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J"], "snippet": "Coleman and K. W. <mark>Bristow</mark>. ChapW. II. Lewis, E. <mark>J</mark>. Har vey and S."}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J"], "snippet": "Coleman and K. W. <mark>Bristow</mark>. ChapW. II. Lewis, E. <mark>J</mark>. Har vey and S."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2058.25, 771.18, 2213.23, 1022.03], "bbox_id": "9dfd3c3c5a", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "N theiClerks Office of the Circuit Court of the County of Appomattox on the 18th day of June, 1917. Mattie M. Bristow and her husband, K. W. B ristow , ........................................... Plaintiffs against W ert Watkins, Berta Watkins, W U Farrar and his wife Jill Farrar, Alma White and her husband Jesse White, Minnie Cheadle and ber husband 8 H Obeadle. . Laura Meadows and ber husband Walker Meadows, Lou Meadows and ber hus band J it Meadows, Mrs. W B Hubard and her husband W B Hubard, James T Watkins. E L Childress, Frank W atktns and Snow Watkins, and tbe unknown belrs a t law of Ella Watkins Wallace, deceased .......... . ..................... Defendants Tbe object 08 this suit is to partition tbe tract of 95 acres ot land In Appomattox county, Virginia, of which M B Watkins died seized and possessed. And an affidavit baying been made and filed that the defendants James Watkins and E L Childress are not residents of the State of Virginia, and that the whereabouts of tbe belrs at law of Lila Watkins Wallace, de ceased, are not known, it Is oraered that they do appear hpre within fifteen days alter due publication hereof and do w hat may. be necessary to pro tect their Interests In ibis suit. AVa It I b further ordered that a copy hereof be published onoe a week for tour weeks In tbe Times-Virginian, a newspaper published in the oounty of Appomattox, and th at a copy bo posted at the trout door of the oonrt- house ol this county on the 16th day of June. 1917, that being the next succeeding rule day after this order was entered. A oopyTeste J K Hi"}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "and ber hus band <mark>J</mark> it Meadows, Mrs. W <mark>B</mark> Hubard and her husband"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "and ber hus band <mark>J</mark> it Meadows, Mrs. W <mark>B</mark> Hubard and her husband"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.88, 887.24, 2251.36, 1135.91], "bbox_id": "ba9b29f1c1", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "N theicierka Office ot tbe Circuit Court ot tbe Oounty ot Appomattox on tbe 14th day of June, 1017. Mettle M. Brlitow and her butand, R. w . Bristow ........ . .............................. .....P lain tiff atainat Wert Watkins, Berta Watkins, w h Ferrer end bis wife Gill Ferrer. Alma White end her husband Jerne White, Minute Cheadle end bar husband 8 H Cbeadle. Laura Meadows and her busband Walker Meadow, Lou Meadows end bar hus band J R Meadow, Mrs. W B Huberd end her husband W B Huberd, James T Watkins, B L Childress, Frank VI etktns end Snow Watkins, end the unknown heirs at law of Blla Watkins Wallace, deceased . ............... . Defendants Tbs object of this suit 1 to partition tbe tract of It sores of lend in Appomattox oounty, Virginia. 0f which M B Watkins died seised and possessed. And an affidavit bavin bean made and filed that tbe defendants James Watkins and K L Childress are not residents of the State of Virginia, and tbat tha whereabouts of the beirs at law of Blla Watkins Wallace, de ceased, are not known, it la ordered tbat they do appear here within fifteen days after due publloatlon hereof and do what may be neeesaary to pro- teot thalr interests in thia suit. And tt 1 further ordered that a copy hereof be ubiiahed onoe a week for four waeka in tbe Imas-Virginian, a newspaper published in tbe oounty of Appomattox, and that a copy be posted at tbs front door of tbeoourt- house of this oounty on tbe ltth day of June, 1817, tbat being tbe next suooeedlng rule day after this order wae entered. A copyTeste J R HORS"}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "end bar hus band <mark>J</mark> R Meadow, Mrs. W <mark>B</mark> Huberd end her husband"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "end bar hus band <mark>J</mark> R Meadow, Mrs. W <mark>B</mark> Huberd end her husband"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1732.55, 590.61, 1899.7, 956.56], "bbox_id": "bfabfa6210", "file": "AppomattoxNewspapers_1912-1915a_0519.pdf", "page": 1, "text": "Mrs. Mecca b. Childress, wife of Mr. Dallas Childress, died at tier home near Pamplin on Monday evening, March 8th, at 430 p. m. in the 69rh year of tier age. She has been a constant sufferer for 80 vearo or more and had been oon- flned to her bed for about four months. She was a member of Matthews Baptist Chnroh at H ix burg nd died trusting in her Savi our. Besides her husband she is survived by one son and five daugh ters, Mr. E. L. Ooijdreas, Mrs. W. B. Hubbard, Mrs. R. W. Bristow, Mrs. S. h . Cheadle, and Mrs. J . R. Meadows, of this County, and Mrs. J. W. Meadows, of Abingdon, Va. AJso one sister, Miss Ella Watkins, and two bro.hers, Messrs. James and Frank Watkins. - Interment was made in the old family burying ground on the old John Henry Marshall place near Hixbnrg on Tuesd-y evening at 330, servioe being conducted by her pastor. The deceased had many friends and relatives in this county as well as Charlotte, who will regret to hear of her death."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "L. Ooijdreas, Mrs. W. <mark>B</mark>. Hubbard, Mrs. R. W. <mark>Bristow</mark>, Mrs. S. h . Cheadle,"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "L. Ooijdreas, Mrs. W. <mark>B</mark>. Hubbard, Mrs. R. W. <mark>Bristow</mark>, Mrs. S. h . Cheadle,"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [547.44, 254.04, 709.86, 949.09], "bbox_id": "ee8054c2f9", "file": "AppomattoxNewspapers_1892-1898a_0302.pdf", "page": 1, "text": "Democrats of Appomattox Hold an Enthusiastic Mass-Meeting. A large and enthusiastic mass- meeting of the Democrats of Appo mattox was held at the Court House n Courtday to elect delegates to the Staunton convention. The meeting was called to order by Mr. Joseph Button, county chairman. Mr. W. II. Ligon, was elected chairman, and Mr. S. L. Ferguson, secretary of the meecing. The following delegates and alter nates were elected Delegates at large ton, It. B. Poore, H. D. Mott Robertson. Alternates at large ton, J. R. Atwood, T. J. and J. K. Hannah. Southside districtDelegates . John Overton, J. C. Jones. R. F. Burke and W. II. Lewis. Alter nates, S. P. Coleman, A. H. Abbitt, C. N. Abbitt and G. A. Walton Stonewall districtDelegates  I. M. Golliday, S. C. Stratton, Walter Forbes, and D. A. Christian. A1 ternates J. R. Horsley, J. W. Davidson, E. A. Walton and M. F. Kyle. Clover Hill districtDelegates  W. H. Ligon, W. B. Forbes, E. E, Chism, and S. L. Ferguson. Alter nates  R. W. Bristow, L. A. Bagby, W. J. Trent and F. W. McKinney. The following resolutions were introduced by Senator H. D. Flood and adopted with but one dissenting voice. Resolved, by the Democratic party of Appomattox county,in mass meet ing assembled First. That we reiterate and re affirm our allegiance to the Demo cratic party, and pledge our heatty support to the nominees of the Dem ocratic convention, national and dis trict. Second. That we favor the free and unlimited coinage of silver at the ratio of 10 to 1 , without reference to the position of any other nation on this questin, and hereby instruct our delegates to thcState convention not to vote for any oue as a delegate to the national convention who does not favor this policy."}, "highlight": {"text": {"matched_tokens": ["Bristow", "J"], "snippet": "Alter nates  R. W. <mark>Bristow</mark>, L. A. Bagby, W. <mark>J</mark>. Trent and F. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow", "J"], "snippet": "Alter nates  R. W. <mark>Bristow</mark>, L. A. Bagby, W. <mark>J</mark>. Trent and F. W."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [983.72, 459.27, 1155.81, 1028.96], "bbox_id": "40aa4cad8d", "file": "AppomattoxNewspapers_1939-1943a_0331.pdf", "page": 1, "text": "Visitors in the home of J. R. Marshall Sunday were Mr. and Mrs. J. D. Ford, E. M. Sears and Mrs. J. T. Hix and daughters. Witt Bristow, of Chicago spent last week in the home of E. P. Sears. Misses Lavalette Sears and Bar bara Hix jiaittended !he 4-H Club meeting at Pamplin Thursday morn ing. Mrs. Lillian Gilliam and son, Her bert, of Roanoke, spent several days last week with Mrs. Mollie Glenn. They spent Friday in the home of E. P. Sears. Rev. and Mrs. W. M. Black, Miss dary Rives Black and Miss Eurlean Josser and Miss Lillian Fauver, of ynehburg were supper guests in the iome of Mrs. N. S. Topping Wed- lesday. Revival services closed here Fri- lay night. Services were well at- ,ended and there were Beven addi- .ons to the church. Crote Carson spent several days ast week in Washington, D. C. Mrs. H. C. Wheeler is visiting in Crewe and Rirhmond this week. Mr. and Mrs. James Rosser visit ed Mrs. R. R. Young last week. J. S. Hix, of Thomasville, N. C. spent last week at his home here. J. E. Dinwiddie, of Sweet Briar, was in town last week on business. Mr. and Mrs. Wilson Hix and family called in the home of T. B. Hix, of Prospect, Sunday after noon. Mrs. Bessie Grinstead and Mrs. G. G. Reynolds, are spending this week at Massanetta Springs. Miss Carrie Hix is visiting rela tives in North Carolina. Mr. and Mrs. Nelson Hix, Miss Kitty Carson, C. B. Carson, and Eural Carson spent Sunday with their parents, Mr. and Mrs. E. H. Carson. Miss Jessie Carson Is spending t he week with her sisters in Lynchburg. Mr. and Mr. J. K. Marshall and son, Mrs. Pearl Marshall and Mary Elizabeth Brooks went to Holliday Lake Sunday afternoon. Mrs. J. T. Hix, Barbara and Fan Hix visited Mrs. E. W. ftUliim Sunday P. M. E. M. Sears was a visitor in the same home."}, "highlight": {"text": {"matched_tokens": ["J", "Bristow"], "snippet": "M. Sears and Mrs. <mark>J</mark>. T. Hix and daughters. Witt <mark>Bristow</mark>, of Chicago spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Bristow"], "snippet": "M. Sears and Mrs. <mark>J</mark>. T. Hix and daughters. Witt <mark>Bristow</mark>, of Chicago spent last"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [197.74, 1358.19, 2453.93, 1715.64], "bbox_id": "b9cdcf79a0", "file": "AppomattoxNewspapers_1915-1918a_0337.pdf", "page": 1, "text": "Thats the RutFree Samples to Any one Anywhere. American chair cane is in demand in Panama. I ri Yen q ! 0 hen ft wJ a ohi August Flower Charters were granted by the State Corporation Commission as follows Amendment to charter Galax Ice and Cold Storage Corporation, Galax, Va., changing limitations as to real estate holdings. Amendment to foreign charter Weaver Organ and Piano Company, of State of Pennsylvania, changing name to Weaver Organ Co., Inc., appointinj R. C. Bristow, Petersburg, statutory agent. Amendment to foreign charter At lantic Coast Lumber Corporation, s corporation of the State of South Caro lina. increasing its capital stock from 1.200.000 to 2,400.000. Twin City Boiler Works, Inc., Bris tol. Maximum, 15,000 minimum,  5 ,0 0 0  par value, 100. J. G. Tilley, president W. L. Griffin, secretary both of Bristol. Chehaw Land and Cattle Company Inc., Richmond. Maximum. SO,O0O minimum. 500 par value. 100. James Mullen, president Cyrus W. Beale, secretary and treasurerboth of Rich mond. Dixie Flip Syrup Corporation, Salem. Capital stock, 100,000. Purpose man ufacturing soft drinks, etc. L V. Yonce, Sr., president G. V. Yonce, sec retary and treasurerboth of Salem. Laurel Coal Corporation. Tazewell. Maximum, 20.000 minimum, 5.000 par value, 100. Purpose coal mining business. A P. Pertey, J r , president, Pctnam s C. B. Neel, secretary. Raven."}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "business. A P. Pertey, <mark>J</mark> r , president, Pctnam s C. <mark>B</mark>. Neel, secretary. Raven."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "business. A P. Pertey, <mark>J</mark> r , president, Pctnam s C. <mark>B</mark>. Neel, secretary. Raven."}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.21, 337.18, 1737.54, 1019.67], "bbox_id": "e62a53fced", "file": "AppomattoxNewspapers_1908-1909a_0025.pdf", "page": 1, "text": "Prof.J.TalmageDavis, and bride nee Miss Gordon, of W. Va., sister to Miss Gray, of Richmond, Mrs. JoJm Charlton, of Bon I Car, W. Va., are on a visit to her parents, Mr. and Mrs. J. R. Fore. Mr. Alfred Davis, Jr., is herel on a visit to his grandparents, Mr. and Mrs, J. W. Davis. Mrs. L. E. Meadows has re turned to her home in Richmond, after spending several weeks with her sisters, Mrs. W. B. Hubbard, and Mrs. R. W. Bristow. Mrs. L. A. Brooks, and daugh-1 ter, of Burlingame, Cal., is stop ping here for a short stay with ! her sister, Mrs. Jack Marshall. On her way here she travelled I through the most noted places of Mexieo, Texas, and Florida, and will return via w aw if New I York, Mountains of Vermont, Niagara Falls, and other scenic places in both Canada and the western states. Mrs. Grinstead, and daughter, j Ann, oj Greensville, Miss. , are I on a visit to her sister, Mrs. Jack Marshall, and other relatives in this section. We had a very good size con gregation out to hear Rev. Thorpe, a student of Richmondl University- preach, his text was from Hebrews 11-6, and only consisted of two words will some one tellme what the words were? He preached a good ser- mon. Mr. Editor, we have up a I question in our Sunday School class as to whether Moses was married more than once. Some contending t h a t Zipporah, daughter of Jethro, Median priest the only wife, but in Nos. 12-1, we find twice in the same verse he had married an Etheopeon Ionian, in Josephas we find that Moses was made Clifton. office in charge of all Pharos host and on one special battle Falling near  pursuing the enemy of Phato"}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "her sisters, Mrs. W. <mark>B</mark>. Hubbard, and Mrs. R. W. <mark>Bristow</mark>. Mrs. L. A. Brooks,"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "her sisters, Mrs. W. <mark>B</mark>. Hubbard, and Mrs. R. W. <mark>Bristow</mark>. Mrs. L. A. Brooks,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [784.84, 1617.19, 942.14, 1870.03], "bbox_id": "4218b3a4c8", "file": "AppomattoxNewspapers_1898-1902a_0238.pdf", "page": 1, "text": "Thirteen deeds were admitted to record since August term. Will of M. A. Wood W. B. Wood was admitted to probate Mrs. 0. B. Wheeler, admx E. P. Sears, R. W. Bristow, aud H. E. Gilliam were ap pointed appraisers of the estatp.   Sheriff S, P, Coleman was appoint ed guardian of Samuel L. Loomis aud Lucinda Loomis, infants. J. W. Wright was appoiuteU over seer of poor for Jlover-Hill district. S. J. Lee qualified as school-trus tee for Soutliside district, vice A. H. Howerton, resigned. S econd D a y  S a t  b  a  . N el sop Mapufaetui-idg C q J against Spott ijice judgment for plaintiffs, J. R, Atwood vs. J. W. Wright continued to 18th iusiant. Rosa Jones selected Saml L. Fer guson as her guardian. Viewers were appointed to report ou proposed change of road to pass through the land of Joseph Graves."}, "highlight": {"text": {"matched_tokens": ["B", "Bristow"], "snippet": "to probate Mrs. 0. <mark>B</mark>. Wheeler, admx E. P. Sears, R. W. <mark>Bristow</mark>, aud H. E. Gilliam"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Bristow"], "snippet": "to probate Mrs. 0. <mark>B</mark>. Wheeler, admx E. P. Sears, R. W. <mark>Bristow</mark>, aud H. E. Gilliam"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [917.77, 277.28, 1080.11, 1397.27], "bbox_id": "17f3c5c9f7", "file": "AppomattoxNewspapers_1898-1902a_0271.pdf", "page": 1, "text": "Chas. Mason19tb Ceninrv... 4 H. W. McKinneyAppoumtx.. 5 Doug. MasonHorseshoe........ 4 R. N. DawsonPamplin ........... 1 Geo. PurdumBlack Knight... 4 J. B. Abbitt-r Powhatan ........... 3 C. A. AllenSpring Creek ....... 2 Mr. GilliamHickory Grove... 2 Witt BristowHixburg ........... 3 A. W. JonesSpout Springs... 7 J. H. AllenTredway ............... 2 Walter PayneSilver Star...... 4 L. B. LeGrand having taken the greatest number of rings was awarded the crown. Messrs. Hunter Abbitt, Jonee, and Browning having each secured 7 rings, they rode for firet honor, and Browning lead iu the tie with 7 and Abbitt second with 6 rings. The first honor was awarded to Daniel Browning. At this point the judges allowed all Knights who had not secured honors to enter the tournament lor second and third honors with three rides each, which resulted in a tie between H. W. McKinney and Jas. Payne, each taking 7 rings. Mc- Kinuey and Payne decided which should have second honor by a sing le tilt, McKiuuey taking all three rings, and Payne took two, and was awarded the second honor aud the third was awarded to Payne. All agreed that there was too much riding, but under the rule it could uot be avoided. The boys are under obligations to Capt. Jno. R. Martin, of Faunville, for the use of his clamps, which held the ringsand uot a few of the boys claim the clamps held them so good the hole in the ring was hard to locate. In justice to many of the riders it is proper to say that their regular lauceswere tuled out, and they had to ride with uevr lances, without practice. Col. R. B. Berkeley took charge of those who bore off the much cf- eted honors when night came, aud whim Miss Ruby Harvey, of Dan ville, Va., gathered aiouuu her in the ball room at Atwouiis Hotel her maids of honor, the scene was one of grace mid beauu. Col. Berke leys address uus highly appropriate aud w-ll-received by tlie large audi ence pretence. A temporal stage was erected and upon ii. sat ibe Queen of Love and Beauty, .dies Harvey, surrounded by her maids and the gallant Knights who held honors iu their hand to bedeck the brow of his queen L. B. LeGrand crowned Mias Roby Harvey Queen of Love aud Beauty. Daniel Browning crowned Miss Bertha Caldwell First Maid of Honor. H. W. McKinney crowned Miss Lucy Smith, Second Haid ot Honor. Jas. Payne crowned Miss Mattie Berkeley, of Lynchburg, Third Maid of Houor. The royal set wao then danced, after which the dancing became general and lasted uulil 6 a. lit. The supper by Hostess Abbitt was iudeeu a special feature of the occasion, and but for lack of space we would give the bill of fare. Suffice to say it was served in royal style and was highly enjoyed. The young men maintained the reputatiou of the village for its known hospitality and this occasion sheds new lustre around the chiv alry of tpe good people of our com munity."}, "highlight": {"text": {"matched_tokens": ["J", "B"], "snippet": "Geo. PurdumBlack Knight... 4 <mark>J</mark>. <mark>B</mark>. Abbitt-r Powhatan ........... 3 C."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B"], "snippet": "Geo. PurdumBlack Knight... 4 <mark>J</mark>. <mark>B</mark>. Abbitt-r Powhatan ........... 3 C."}], "text_match": 1733920985477808249, "text_match_info": {"best_field_score": "2216176058368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985477808249", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [605.3, 149.88, 823.64, 404.62], "bbox_id": "f98e44a60e", "file": "AppomattoxNewspapers_1918-1922a_0356.pdf", "page": 1, "text": "Thomas GilbertLabor _ ........................... . ....................... J-A . and W. C. GanettL a b o r . .... .JJ . . The Good Roads Mchy. Co.Three Blades ...................... R.-0. AbbfttCutting Tree Out of R o a d .l.. . i.. t H  Jerry RansonWork on R o a d .... .............. ,r. Hanlson FranklinWork on F ord. ___ I A .. . J. A..FarrisFor M ule. .......... ................... . . . . Henry HaweyLabor ........  h ... Willie WalkerLabor ................ . !. John BerkleyL a b o r .......................................... r iv .l.!  ! Monroe MitchellL ab o r........................!!!!!!!!!!! Alex. PriceL ab o r ............................................... I.! Ill Carey BrownL a b o r ............................... 1 .. 1 . 1 111  11111 Edgar CovingtonL ab o r ...................................... ...H I .! ! Southside Rd. Bd.Supplies, Etc., Left fr. 1919......., Board of Sup.Com ................................................................ Joseph LucadoCutting Tree Out Roa8111111111111111 W. H. LigónFor Rent and Exp. for Rd. Comp .............. R. W. BristowLabor............................................................. John FergusonLabor . ............................. . . . W. H. LigónOne-half Expenses to Bjuy Rd. M ules!!.! Wm. Daniel Hlx Co.Supplies. ......... 1................... . J. W. Cawthon, Jr.Hay Barn, Etc. .............. . ............. .. Frank CawthonCutting Tree Out Rd............................... Robert WolrldgeLabor . ......................... .. .......................... Harry FergusonLabor ............................................. .. L. N. LigónStable Rent For Mules ................................. Rossie JenkinsLabor ......................................................... W. J. CovingtonL a b o r....................................................... Tip JenningsCom. ............................................................... R. S. WheelerLum ber.. .......... . ........................................"}, "highlight": {"text": {"matched_tokens": ["J", "b"], "snippet": "Mules ................................. Rossie JenkinsLabor ......................................................... W. <mark>J</mark>. CovingtonL a <mark>b</mark> o r....................................................... Tip JenningsCom."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "b"], "snippet": "Mules ................................. Rossie JenkinsLabor ......................................................... W. <mark>J</mark>. CovingtonL a <mark>b</mark> o r....................................................... Tip JenningsCom."}], "text_match": 1733920985209372793, "text_match_info": {"best_field_score": "2216175927296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985209372793", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [611.5, 276.03, 782.37, 872.52], "bbox_id": "511be30134", "file": "AppomattoxNewspapers_1905-1912a_0289.pdf", "page": 1, "text": "W ashington, D. C.  A fter m any i years of delay, the bill looking to 1 the creation of national forest re- 1 serves in the W hite M ountains and the Southern Appalachians, passed I the Senate, the vote standing 57 to 9. The negative vote was cast by Senators Bristow, Burton, Clark, of W yom ing Cullom, Grouna and Mc- Cum ber, Republicans, and Senators Davis, P aynter and Shively, Demo crats. The bill passed the house of R epresentatives last session, and as it was accepted by the Senate w ith out change, it lacks only the signa tu re of the President to elevate it into a statute. The entire day was given to the subject by the Senate. Senators Brandegee, of Connecticut, and Gal- linger, of New Ham pshire, stood as the special sponsors of the m easure. Mr. Brandegee made a brief speech in the interest of an early vote. Sen ators Simmons, of North Carolina, and Newlands, of Nevada, spoke in support of the bill, and Senators B ur ton, of Ohio, and Heyburn, of Idaho, in opposition. The supporters of the m easure resisted all efforts at am end m ent on the theory th at any change would im peril the bill in the House. W hile it is understood on all sides th at the purpose of the bill is the acquisition of lands In the W hite M ountains of New England and of the Appalachians, in the Southern States, for the creation of forest re serves, it contains no specific m en tion of such purpose. The author ity for this proceeding is found in the general powers conferred by the bill. The carrying into effect of the pro visions of thè bill is placed in the i hands of a commission, to he com- I posed of the Secretary of W ar, the j Secretary Of the Interior, the Secre tary of A griculture, two senators and two m em bers of the House of Rep- ! resentatives. The purchase of land is placed in the hands of the Secretary of Agri culture and is confined to such areas as may affect the head w aters of navigable stream s. No purchase is to be authorized until passed upon by the Geological Survey. The land once acquired, it is to be cut up into forest, reserves, as may seem best for adm inistrative purposes. A uthority for co-dperation with different states is given and 2,000,-  000 a year is appropriated until 1915."}, "highlight": {"text": {"matched_tokens": ["Bristow"], "snippet": "was cast by Senators <mark>Bristow</mark>, Burton, Clark, of W"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow"], "snippet": "was cast by Senators <mark>Bristow</mark>, Burton, Clark, of W"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [662.15, 348.95, 1001.02, 546.6], "bbox_id": "194ae2cf1b", "file": "AppomattoxNewspapers_1908-1909a_0336.pdf", "page": 1, "text": "Philanthrcfpitt Bflya Camp  for, Students Who Wrk  Sprtatttold v f t - t t  A  onto of  m feature of the sword In I Bristow, Okla., millionaire oil man and ! similar to those usual I .qdinnthroplst. ha purchased a W IU j a courtiers sword. I ttCro ttoct df land to he rtévoted ! ! of toll military length pith a j who work their throurit I blade of the finest ,8hefr, sch 0 ot. The trtttrt. piirchnsedxln tUr 1 __ - W f f  elaborately citi ozarks. will have a large admlittsW  a ____ .and guardthe jpjff of tottN j ,0,, biilldlpB. H XVI-It might bafe been tu iord òr 1 anj several cabli erected on It. A   an officer.  f ....... I large lake hud swimming pool are also 1 The .blade bears the. Inscription-  to be 6ullt.  B Sword which was cariijed 3y Bqp- I - -------------- -- In jamtn Franklin In the batflea fought 1 fr en ch . C ourt to R eform ! In America for the . cause of Liberty.  . _ J iu W ill, M sW Sase l ! HO gave it later to bis trieqd, TVJ.  B ap d ity W tta M ttr ta g e B Cabanls  r I Bourg. France.Will marriage re I The discovery to due to M, Gtoodtor 1 torto, B banditi Three bandits    W curator of the museum established In l it will and the Justice of peace of this 1"}, "highlight": {"text": {"matched_tokens": ["Bristow"], "snippet": "the sword In I <mark>Bristow</mark>, Okla., millionaire oil man"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow"], "snippet": "the sword In I <mark>Bristow</mark>, Okla., millionaire oil man"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.8, 1190.67, 1949.6, 1808.62], "bbox_id": "c29d5c39d4", "file": "AppomattoxNewspapers_1892-1898a_0081.pdf", "page": 1, "text": "P am plin City B udget. Misses Annie and Irene Marshall left for their schools in North Caro lina on the evening of the 8th instf Misses Bristow, of Hixburg, took the train here on Friday en route for the Worlds Fair. Mr. Eugene Locke, of Crewe, has been visiting his friends and college- mates, Mr. J. H. Franklin, of this place, and Mr. Leslie N. Liggon, of Hixburg, for the past week. Mr. Pusley M. Hannah came down on Saturday with a load of forty watermelons which averaged forty pounds. Mrs. E. B. Brady made a short visit to Prospect last week. Mr. N. A. Davis, operator at Roan oke, was in town on Sunday last. Dr. And Mrs. E. H. Grigg left on yesterday for Buckingham,where they will spend a few days visiting rela tives and friends. Miss Lizzie Pankey returned on the west bound train yesterday from Spout Springs, where she has been visiting the family of Dr. D. Mott Robertson. Mr. Christopher Atkinson passed through town this morning en route for his cousins, Mr. J. K. Hannah. Mr. A. is just returning from a trip to the Worlds Fair. Miss Sallie E. Rice returned a few days ago from a visit to her friends, Dr. and Mrs. Robert M. Davis, of Evergreen. Mr. Marshall Morton leaves to day for Hampden Sidney College where he matriculates for the ses sion. Mrs. Anderson M. Jennings, one of the oldest ladies of our town, died this morning in the 75th year of her age. She leaves a husband aud five children to mourn her loss. Mrs. S. E. J. Walker, of Peters burg, is in town with the view of purchasing a store-house and lot of Mr. John R. Franklin. P. H. E. Sept. 12, 1893."}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "P am plin City <mark>B</mark> udget. Misses Annie and"}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "P am plin City <mark>B</mark> udget. Misses Annie and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1388.14, 1169.31, 1685.58, 1445.26], "bbox_id": "f41668c734", "file": "AppomattoxNewspapers_1926-1933a_0065.pdf", "page": 1, "text": "LeGRANDS Mr. John Fore, of M t Hope, W. Va., is here on a visit to hs parents, Mr. and M rs. J. R Fore.. We continue to loose our young from this section, thiB tim e we note the departure of Adison Bristow, who left on last Thurs day for Huntington, Ind. Our enterprising young m er chants Messrs. Hix and M arshall are so interested in having our town on the map th at a petition may be sent to W ashington ask ing th at the Air Mail Service from New York, Richmond and A tlanta pass this town. Mrs. H. B. Swan, of Bluefield, W. Va., is on a visit to her brother, Mr. J. H. McCue. Our school promises to give quite an interesting entertain- tainm ent called"}, "highlight": {"text": {"matched_tokens": ["J"], "snippet": "Mr. and M rs. <mark>J</mark>. R Fore.. We continue"}}, "highlights": [{"field": "text", "matched_tokens": ["J"], "snippet": "Mr. and M rs. <mark>J</mark>. R Fore.. We continue"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [525.56, 869.59, 729.66, 1027.43], "bbox_id": "47a187369d", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "L . N. L ig o n , C a p t a i n . Joel P Fore, E P Sears, Witt Bristow, Boyd Ford, Wm L Ford, Walter Ford, A H Gilliam, W Reives Gilliam, Thornton Marshall,  troubles. Thomas Marshal, James E Mar shall, F W Harvey, J F Lee, Dal las Childress, A A Baldwin, John Nathan Dickerson, John W Gilliam, Ira Forbes, Walter B Forbes, P H Holycross, John R Inge, George Jennings. H C Kidd, John R T-ewis, Joel Watkins."}, "highlight": {"text": {"matched_tokens": ["Bristow"], "snippet": "E P Sears, Witt <mark>Bristow</mark>, Boyd Ford, Wm L"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow"], "snippet": "E P Sears, Witt <mark>Bristow</mark>, Boyd Ford, Wm L"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [560.43, 814.99, 713.3, 1161.0], "bbox_id": "f9d7d194f9", "file": "AppomattoxNewspapers_1918-1922a_0477.pdf", "page": 1, "text": "H ix b u rg Since giving any news from this place there have been many changes in one wayor a nother. Mr. F. H. lioliycross dropped dead while at work in the hay field of Mr. J. Baxter Marsh alls on July 4sh, and on the 5th Mr. Marshall was over come by the heat of the Bun, out has about regained his strength at this time Mrs. Herbert Gilliam, ol Charleston, W V , is here on a visit to friends. Mr. and Mrs E. W. Gilliam, of Lynchburg, spent the week ,nd with relatives here. Mr. Shelley Davie, of Mc Donald, W. Va , is here on a visit, to his parents, Mr. and Mrs J. W. Davis- , Misses Carrie Hix and Hattie Fore are home for the summer. Mr. R W. Bristow is euffer- .ng the  ffects of a boil which the writer cau say is constant company.  W A. Swan is -having the inside painting done to his muse and expectB to move in his week. We are having some dry weather right at this time aowever corn is looking fine."}, "highlight": {"text": {"matched_tokens": ["b"], "snippet": "H ix <mark>b</mark> u rg Since giving"}}, "highlights": [{"field": "text", "matched_tokens": ["b"], "snippet": "H ix <mark>b</mark> u rg Since giving"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1852.1, 778.09, 2010.1, 1692.87], "bbox_id": "1da780eef2", "file": "AppomattoxNewspapers_1915-1918a_0312.pdf", "page": 1, "text": "Answer to the prayers of the little chilcen of Mr. R. W. Bristow ettA H. 8 Gilliam that he should V io g them a big doll that could m y and sleep and, sure enough, a fine boy was left at bothinf those houses. Mrs. H  .. M arshall, who has been sq sick for the past three weeklies up again at this writing, , T Miss Annie Gilliam, of Pow hatan is in th e neighborhood On a visit Mrs J. H. Marshall Is quite sick w ith Kgrippe. There is right much sickness nround this w e e l f c    t V - , . A. Swan . w as a t Appo- mattox on la st Saturday a t tending, the m eeting of tbe Farm ers Loan B jn k and states th at there were quite a number of people at this meeting  Mr. and Mrs. 8am Hubbard, of near- Elam, were both bitten by a m ad dog on last Friday while w alking near their hefae, and we also hear th a t a man whs chased for a long wajrsby a mad dog near, Hurtsville on last Friday, and .that he reach ed the house of Mr. -Willie Whitehead, secured a gun, and killed the dog. Now there is no use of a man having his life and th a t of h isfa n rly jeopar dized by a worthless dog and the thing to do is kill out all stray dogs befoie they go mad. Mrs. W. D H ix got a painful fall last week, but is enjoying her usual good hehlth a t this time. The bachelor on tb e river who received a m ost interest ing letter from one of the fair sex signed  Miss Patience be lieves her to be true to her name, as she took occasion of leap year, waiting only to ad dress him on the last day but from the interest be has al ready shown in locating  Tip perary, one can n ot doubt tb at his heart is right there and we m ay not be surprised to hear th a t the services of the m inister is needed at any time. Our newcomers to tb e H ub bard place, Mr. J. H. Burrell and wife, are back on a visit to their old home in N. C., and it maybe th at they will go back there to live, as Mrs Burrell doe? not like here. Now is the tim e we should have our Federal road superin tendent to travel this section and the only question he would ask is,  Gentlemen how much do you w ant to top-dress with? It takes a clever sportsm an to catch a hog fish, b u t Pau lette  Co. prices on tobacco at Pamplin of L4 to 65, is a prize winner. I am ju st bpund to take him a load today. It is fashionable about here now"}, "highlight": {"text": {"matched_tokens": ["Bristow"], "snippet": "of Mr. R. W. <mark>Bristow</mark> ettA H. 8 Gilliam"}}, "highlights": [{"field": "text", "matched_tokens": ["Bristow"], "snippet": "of Mr. R. W. <mark>Bristow</mark> ettA H. 8 Gilliam"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [499.45, 149.84, 882.1, 408.45], "bbox_id": "12a3db58d3", "file": "AppomattoxNewspapers_1918-1922a_0232.pdf", "page": 1, "text": "Thomas GilbertL abor........................................................................ 3.50 J. A. and W. C. GanettLabor............................................................... 12.00 The Good Roads Mehy. Co.Three Blades.. . . . . . . . . . . .f l t . ___ _ .34-00- Ji. Q. Abbitt-r-Cutting Tree Out Of Road... .  V T . T . ......................... .50 Jerry KansonWork on. Road. .......... .. ......... 6.58 Manlson Franklin.Work on Ford. ...............  ___  8.00 J. A. FarrisFor Mule ............... .................... . .................... . ................. ..... 287.50 Henry HaweyL abor ................. ............. . .......................... 26 50 Willie WalkerL abor ................................. 136.54 John BerkleyL ab o r .................................................. . .................... .. 97.87 Monroe MitchellL abor......................... . .............. . ............. . .................... 172.37 Alex. PriceL ab o r........................................................................................ 3150 Carey BrownLabor ...................................... 172.74 Edgar CovingtonL abor........................................................................ 447.37 Soutbside Rd. Bd.Supplies, Etc., Left fr. 1919........................................ 41.32 Board of Sup.Com. ............. ................................................................... 75.00 Joseph LucadoCutting Tree Out Road..................................................... 3.00 W. H. LigonFor Rent and Exp. for Rd. Comp........................................ 26.67 R. W. BristowLabor................................................................................... 6.75 John FergusonL abor........................................................................... 88.87 W. H. LigonOne-half Expenses to Buy Rd. Mules .............................. . 4.00 Wm. Daniel Hlx Co.Supplies ..................................................................... 85.55 J. W. Cawthon, Jr.Hay Barn, Etc............................................. .. .............. 106.30 Frank CawthonCutting Tree Out Rd........................................................ 2.50 Robert WolridgeL a b o r.,.................................................................. 60.63 Harry FergusonLabor .............................................................................. 82.62 L. N. LigonStable Rent For Mules.......................................................... 15.00 Rossie JenkinsLabor ................................................................................. 6.62 W. J. CovingtonL abor............................................................................... 14.00 Tip JenningsCom............................ . ................................. . .................... . 35.00 R. S. WheelerLumber ......................................................... 37.72"}, "highlight": {"text": {"matched_tokens": ["J"], "snippet": "Thomas GilbertL abor........................................................................ 3.50 <mark>J</mark>. A. and W. C."}}, "highlights": [{"field": "text", "matched_tokens": ["J"], "snippet": "Thomas GilbertL abor........................................................................ 3.50 <mark>J</mark>. A. and W. C."}], "text_match": 1731669185798340729, "text_match_info": {"best_field_score": "1116664496128", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669185798340729", "tokens_matched": 3, "typo_prefix_score": 1}}
