{"document": {"bbox": [2428.08, 648.66, 2498.84, 658.7], "bbox_id": "7535957267", "file": "AppomattoxNewspapers_1974-1975a_0087.pdf", "page": 1, "text": "J. E. Richardson"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>"}], "text_match": 1736172819517538425, "text_match_info": {"best_field_score": "3315704398080", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517538425", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1527.81, 727.32, 1706.29, 1183.75], "bbox_id": "47546c7cb1", "file": "TimesVirginian_1980a_0254.pdf", "page": 1, "text": "vandalism, which occured Aug. 3-5 in the Spring Mill, Spout Spring, Stonewall and Oakville communities. Deputy Sheriff R. W. Baldwin and State Trooper Paul Kvasnicka made the arirests, according to the Sheriffs Office. Ayers and Kress are scheduled to appear in General District Court Aug. 27, and the juveniles will appear in Juvenile-Domestic Court Aug. 28, according to the Sheriffs Department. Police also arrested Groyer Lee Smith, age 19, of Concord and a juvenile last Thursday in connection with a separate vandalism incident in which a number of tombstones were overturned in the Concord Cemetary. Smith was scheduled to appear in court Wednesday, and the juveniles court date was set for Aug. 28. The investigation and arrests were made by C. H. Martin of the county Sheriffs Department. County police also made two arrests in connection with three break-ins, two of which occurred July 29, and one of -which happened Dec. 13 of last year. Valerie Louise Dixon and Brenda Leigh Coleman, both of Farmville, were arrested in connection with break-ins at the homes of Robert Gray two counts and James Frank Ranson, Jr. A break-in occurred at the Gray home on Dec. 13, 1979 and again on July 29 of this year. The Ranson home was broken into July 29 also. Sheriff J. E. Richardson, Deputy Sheriff B. P. S m and Deputy Sheriff C. A. Reynold! vest gated the cast add made the arrests. No court date had been set for the suspects as of press time."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "July 29 also. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Deputy Sheriff B. P."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "July 29 also. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Deputy Sheriff B. P."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.7, 1146.43, 1792.02, 1266.21], "bbox_id": "a1033a5f84", "file": "TimesVirginian_1978_0210.pdf", "page": 1, "text": "Tw Juveniles Arrested J. E. Richardson, Sheriff of Appomattox County, has made an arrest in a rash of break-ins that have occured in the Town of Appomattox far the past two or three weeks. To juveniles were arrested in the break-ins."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Tw Juveniles Arrested <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Tw Juveniles Arrested <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2166.46, 445.1, 2302.36, 668.19], "bbox_id": "920e7c2cf4", "file": "AppomattoxNewspapers_1974-1975a_0170.pdf", "page": 1, "text": "Through the efficiency of the Sheriffs Department of Appo mattox County, with the cooperation of W. S. Kerr, C o m m onwealth Attorney, Sheriff J. E. Richardson has announced that a theft ring that has plagued the county for the past year has been broken up. Subjects allegedly involved in 19 cases of Grand Larceny in Appomattox County have been arrested and are awaiting preliminary hearing in the Appomattox General District Court. Included in the 19 cases of Grand Larceny are the homes of Orie J. Millner, J. B. Drinkard, Jr., 2 cases in the home of Linwood E. Ewers,"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "m onwealth Attorney, Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> has announced that a"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "m onwealth Attorney, Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> has announced that a"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2254.25, 502.64, 2407.88, 1376.65], "bbox_id": "ecfb0e1a77", "file": "TimesVirginian_1976_0131.pdf", "page": 1, "text": "There will be no increase in the county tax levy this year according to the Board of Supervisors of Appom attox County meeting in regular session on Friday of last week. The present tax levy is 8.50 per 100.00 valuation on real estate and personal property 2.50 per 100.00 on livestock and farm machinery and 1.00 on Merchants Capital. The last increase came from the baord in a May meeting held in 1974. Lloyd G. Walton, Division Superintendent of Appomattox County Schools, presented the 1976-77 school budget to the board for approval The board gave tentative approval to the 2,925,393 budget as presented and expressed pleasure fat tbe fact that the increase over last year was only about 1 per cent. In other action, the board adopted a dog ordinance requiring the confinement of all county dogs from May 15 until June 15. This will be a standing ordinance and will not have to crate before tbe board each year for approval C. W. Gibbs, state jails superintendent, told the Appo mattox supervisors Friday that they idpst either build i new jail or make other arrange ments for the prisefferi.1 county has the second Wors t jag in the state, ucohB Q to the D epartm ent o f C orrections official. Gibbs estimatOf Jfait  new jail would cost mately 480,000 Re inforined the board that there is no way to comphr with federal and state regulations for treatm ent of prisoners at tbe Appomattox Counkp jafl. The board of supervuors was first told in 1968 that tjfey must make positive plans for a new jail or make arrangeuients that would be agreeable to state and federal laws but , the board turped down plans to build neW jail then when the facility woidd have cost only 200,000. J . E. Richardson, Sheriff, told the board that the current jail has a six-prisoner capacity but usually houses nine or ten prisoners. During crowded weekends some prisoners sleep on the floor. Dr. S. R. Lawson, board chairman, asked Gibbs what action the state could take if the county deferred action on the jail for another year. Gibbs answer was that the state board of corrections probably would order the jai closed within six months of any county njove defer action adding that the state pays 90 per cent of the local jafll operating expenses and cook order these withheld. The Department of Corrections can"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "have cost only 200,000. <mark>J</mark> . <mark>E</mark>. <mark>Richardson</mark>, Sheriff, told the board"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "have cost only 200,000. <mark>J</mark> . <mark>E</mark>. <mark>Richardson</mark>, Sheriff, told the board"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.23, 1119.98, 1838.84, 1498.86], "bbox_id": "cffa04037f", "file": "TimesVirginian_1976_0396.pdf", "page": 1, "text": "There wifi be shoplifting prevention clinic Wednesday, November 10th from 7-10 p.m. The clinic wifi be held in the Distributive Education Class room 305  a t Appomattox County High .School. Cost for the seminar is 2.00 per person. Appomattox County Adult Distributive Education in coop eration with the Sheriffs office and the Commonwealths At torney are sponsoring the workshop. Content is aimed at persons in management level positions. J . E . Richardson, Sheriff of Appomattox County, will show t a movie designated to help businessmen recognize and deal with shoplifters. Sam Kerr, Commonwealths Attorney, will speak to the group on legal aspects concern ing Virginias new shoplifting laws. There wifi be a question and answer period at the  conclusion of the clinic. To register or obtain further inform ation,- contact R- B. Carter at 352-8251 or Jack Hutcheson at 352-7146. Dont miss out on this workshop - shoplifting costs amount to 3.5 billion a year!"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "in management level positions. <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "in management level positions. <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2357.99, 1114.87, 2500.16, 1411.39], "bbox_id": "88514f37dd", "file": "AppomattoxNewspapers_1971-1973a_0156.pdf", "page": 1, "text": "The Health Department does not have anyone doing this type of work for them. If you are con tacted by such a person, ask for proper identification, obtain the license number of the vehi cle, and contact the Appomat tox County Sheriffs Department immediately. Telephone 352- 8241. If you have already been con tacted by such a person and have not reported it, please contact Sheriffs Department immedi ately. The Appomattox County Sher if fs Department has always en joyed the wholehearted support of the people of this county. It is always our desire to serve the people to the best of our abili ties. Your continued support and confidence is appreciated. Sheriff J. E. Richardson and his entire staff would like to wish each of you a very Merry Christmas and a safe, proper- ous and Happy New Year!"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "confidence is appreciated. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and his entire staff"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "confidence is appreciated. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and his entire staff"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [453.36, 582.13, 595.69, 699.18], "bbox_id": "9e54a936d1", "file": "TimesVirginian_1978_0472.pdf", "page": 1, "text": "The following vehicle will be offered for sale at public auc tion behind the Courthouse of Appomattox County at 1000 A.M., October 20,1978 1960 Dodge 2-Door Serial No. 4106169494 Terms of Sale shall be cash, as is. J. E. Richardson, Sheriff Appomattox County 10-19-lt"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 10-19-lt"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 10-19-lt"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2121.08, 1456.61, 2263.98, 1662.94], "bbox_id": "a74c9aa1b9", "file": "TimesVirginian_1976_0064.pdf", "page": 1, "text": "The Appomattox County Farm Bureau Womens Com mittee will conduct a posses sions identification marking demonstration in conjunction with the Appomattox County Sheriffs Department. Sheriff J. E. Richardson recommends the marking of possessions with individual Social Security num bers and State. Sheriff Richard son relates that the marking of possessions will deter crime and help recover stolen items. The demonstration will be held from 10 a.m. until 2 p.m. Feb. 28, 1976 in the Vocation Department at the Appomattox County High School."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "County Sheriffs Department. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> recommends the marking of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "County Sheriffs Department. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> recommends the marking of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2422.29, 423.67, 2575.5, 1190.38], "bbox_id": "6a552eceb6", "file": "AppomattoxNewspapers_1974-1975a_0218.pdf", "page": 1, "text": "The Appomattox County Board of Supervisors meeting Friday accepted a 2,735,068 school budget for 1975-76. Superintendent of Schools, Lloyd Walton, informed the local supervisors that the budget was planned to meet the requirements established by the State Legislature and the State Board of Education and to provide a balanced and adequate program with the minimum required State ex penditure of 730 per pupil in Average Daily Membership. In other business, the Board waived three sections of the countys rock festival ordinance in order to permit the Appomattox County Jaycees to sponsor a Bluegrass Country Music show at Paradise Lake. The supervisors waived a 5,000 bond, 1,000 per day fee,. and the section requiring that a physician be present at all times during said shows. The Jaycee representatives stated that local rescue squads would be on stand-by for the event. Appomattox County Sheriff, J. E. Richardson, said that he expected no problems from the Jaycee sponsored show, noting that the location was more isolated than the site of the last festival. Although no date has been set for the festival, Jaycee representative Danny Simpson stated that permisiion had been obtained from tHe owner of Paradise Lake, Cliyton C. Bryant, to use the property. He also added tin t all funds over the cost of presenting the show would go to county projects. J I,  , . . , , v buitosps. SbertffJ.  E. Lfchardson brought to Use attention of tito Board of SupeiTKkors that the Appomat tox County Treasurer had received a check in the amount of 10,886.14 from the Virginia StSte Compensation Board,  reim bursement for use of County Sheriff Departments vehicles for 1974. In other action the board declined to accept an agree ment with the Farm Home Administration for the in spection of FHA housing in this county. Building Inspector Steve Bowling pointed out that the FHArequiremenis are more rigid than the state budding code. This would entail extensive bookkeeping by county officials with no reimbursement by the Admin istration."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "event. Appomattox County Sheriff, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, said that he expected"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "event. Appomattox County Sheriff, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, said that he expected"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.04, 784.23, 2371.11, 805.58], "bbox_id": "7e21f9cbd0", "file": "AppomattoxNewspapers_1926-1933a_0575.pdf", "page": 1, "text": "T pson MiS. REV. E. J. RICHARDSON"}, "highlight": {"text": {"matched_tokens": ["E", "J", "RICHARDSON"], "snippet": "T pson MiS. REV. <mark>E</mark>. <mark>J</mark>. <mark>RICHARDSON</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "RICHARDSON"], "snippet": "T pson MiS. REV. <mark>E</mark>. <mark>J</mark>. <mark>RICHARDSON</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [379.22, 1700.3, 1266.83, 1767.76], "bbox_id": "9590cafa4d", "file": "AppomattoxNewspapers_1971-1973a_0093.pdf", "page": 1, "text": "Studs Are Illegal In Some States FANCY CREST CAKES PKG SH ERIFF J. E. RICHARDSON WOULD L IK E TO REMIND A LL C IT IZ E N S OF APPO M ATTO X CO. TO E X E R C ISE TH EIR P R IV IL E G E OF VOTING ON NO VEM BER 2, 1971. COME TO THE PO LLS AND CAST YOUR BALLOTS."}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON", "E"], "snippet": "CAKES PKG SH ERIFF <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark> WOULD L IK <mark>E</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON", "E"], "snippet": "CAKES PKG SH ERIFF <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark> WOULD L IK <mark>E</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1911.84, 751.26, 2228.99, 875.95], "bbox_id": "c62a36a81f", "file": "AppomattoxNewspapers_1926-1933a_0577.pdf", "page": 1, "text": "State Anti-Saloon League Head r 1 T W it iif l ir Uses Cartoon Method in Pre- J -DOCfll 1 1 1111111  senting Interesting Address At Union Service School Scores Well In Group The Rev. E. J. Richardson, _____ superintendent of the Virginia j The Carver chapter of N.p. Anti-Saloon1 eague, spoke here A8 of the Appomattox Train- at he high school a.i-Ytorium j gcbooj an active part last Sunday mght and boosted n the gtate rally of N.F.As, the cause of temperance a n d bejd Virginia. State College, prohibition in an interesting ad- Peter8burg. Va.. on April 27-"}, "highlight": {"text": {"matched_tokens": ["E", "J", "Richardson"], "snippet": "In Group The Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark>, _____ superintendent of the Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "Richardson"], "snippet": "In Group The Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark>, _____ superintendent of the Virginia"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1057.89, 271.25, 1203.16, 406.24], "bbox_id": "4d3ae0f108", "file": "AppomattoxNewspapers_1971-1973a_0227.pdf", "page": 1, "text": "Sieriff J. E. Richardson has announced that Appomattox County Deputy Sheriffs C. B. Rickmond and M. Dallas Moore have recently completed the ba sic training course, as set up by the Law Enforcement Officers Training Standard Commiss- I ion. r This training course was held j at the Marine Army, Lynch-  burg, Va., from 8 a.m. until 5 I p.m. each day, beginning Jan."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Sieriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> has announced that Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Sieriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> has announced that Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2129.74, 322.85, 2257.54, 485.7], "bbox_id": "9a4a5d0014", "file": "TimesVirginian_1980a_0440.pdf", "page": 1, "text": "SHERIFFS SALE On January 9, IM1, at 1090 A.M. the following items will be offered for sale at public auction   1958 Chevrolet Pickup Trdck Identification No. 3A58B118044 Stihl Power Saw 028-AV Terms of sale shall be cash, as .is. Contact Appomattox County Sheriffs Department for details of sale. J. E. RICHARDSON, Sheriff APPOMATTOX COUNTY 8012-23-2tC"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff APPOMATTOX COUNTY 8012-23-2tC"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff APPOMATTOX COUNTY 8012-23-2tC"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [948.5, 655.4, 1080.92, 818.49], "bbox_id": "915d135654", "file": "TimesVirginian_1980a_0431.pdf", "page": 1, "text": "SHERIFFS SALE On January 9. 1981, at 1900 , ...l. the fallowing items will be offered for sale at pubiie auction 1958 Chevrolet Pickup Thick Identification No. 3A58B118044 Stihl Power Saw 028-A V Terms of sale shall be cash, as is. Contact Appomattox County Sheriffs Department tor details of sale. J E. RICHARDSON, Sheriff APPOMATTOX COUNTY 80 12-23-2tc."}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "tor details of sale. <mark>J</mark> <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff APPOMATTOX COUNTY 80"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "tor details of sale. <mark>J</mark> <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff APPOMATTOX COUNTY 80"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1046.89, 748.48, 1191.29, 893.32], "bbox_id": "ae3f907a47", "file": "TimesVirginian_1981a_0051.pdf", "page": 1, "text": "SHERIFFS SALE ON- FEBRUARY 27, 1981, at 1000 A.M. the following vehicle will be offered for sale at public auction . 1968 Ford Serial No. 8X22T109658 Terms of Sale shall be cash, as is. Contact Appomattox County Sheriffs Department for details of sale. J. E. RICHARDSON, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1048.29, 588.63, 1191.55, 733.78], "bbox_id": "c0e9c6c5bb", "file": "TimesVirginian_1981a_0051.pdf", "page": 1, "text": "SHERIFFS SALE On FEBRUARY 27, 1981, at 1000 a.m. the following tractor will be offered for sale at public auction International Harvester Super A-Tractor Terms of sale shall be cash, as is, Contact Appomattox County Sheriffs Department for details of sale. J. E. RICHARDSON, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.93, 444.42, 2313.11, 881.35], "bbox_id": "57cc40a6f8", "file": "AppomattoxNewspapers_1974-1975a_0087.pdf", "page": 1, "text": "Sheriff J. E. Richardson today re-emphasized the need for every citizen to take a more active role in crime prevention. He stated that with FBI figures showing an overall fifteen percent increase in crime thoughout the nation and a marked increase in crime within Appomattox County, it obvious the police cannot alone cope with the problem. He quoted Ferris E. Lucas, Executive Director of the National Sheriffs Association, as saying that much crime is victim-assisted. He a s k e d  How many times have each of been guilty of leaving an unattended car or truck un locked, or not checking to make sure all doors and windows are secured before leaving our home or business! Sheriff Richardson continued saying that with children now back in school, many with mothers who work during the school year, there are fewer persons in any neighborhood who might notice a thief or burglar at work. This increases the possibility of successful daytime intrusions, and, coupl ed with the longer hours of darkness, intensifies the prob lem of preventing or controlling crime. Sheriff Richardson described a program being conducted locally which is designed to decrease criminal opportunity"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> today re-emphasized the need"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> today re-emphasized the need"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.65, 1056.69, 1661.79, 1175.43], "bbox_id": "9e9a6407c1", "file": "TimesVirginian_1976_0122.pdf", "page": 1, "text": "Sheriff J. E. Richardson, of the Appomattox County Sher iffs Department, has announc ed that his Deputies wfll be holding checking details thro ughout the county- during the next month.  The purpose is O check for any out-of-date dtickers on those vehicles thatshould have county stickers and. the owners"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, of the Appomattox County"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, of the Appomattox County"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1993.18, 1542.36, 2139.21, 1801.71], "bbox_id": "17f85f656f", "file": "TimesVirginian_1976_0254.pdf", "page": 1, "text": "Sheriff J. E. Richardson fos selected Brian Eugene Tuggle of Appomattox, shown above, to attend the Virginia Sheriffs Boys Ranch Camp from July 18 to July 23. The Virginia Sheriffs Boys Ranch officially opened July 11, 1976 on the Bauseman farm in Stuarts Draft, Virginia. The Camp will operate fdr one month with approximately 126 deserving youngsters from all over the state attending the four six-day sessions. Mr. Walter Akers, Assistant D irector of the Virginia Sheriffs Association, will serve as Camp Director and the staff will be primarily composed of volunteer Deputy Sheriffs who h iv e special training in recreation and youth work. The Camp will provide an adven"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> fos selected Brian Eugene"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> fos selected Brian Eugene"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.84, 866.42, 1575.0, 875.92], "bbox_id": "f16e7fc09d", "file": "AppomattoxNewspapers_1971-1973a_0109.pdf", "page": 1, "text": "Sheriff J. E. Richardson"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2240.35, 774.64, 2368.87, 785.14], "bbox_id": "7372d58de7", "file": "AppomattoxNewspapers_1908-1909a_0575.pdf", "page": 1, "text": "REV. E. J. RICHARDSON"}, "highlight": {"text": {"matched_tokens": ["E", "J", "RICHARDSON"], "snippet": "REV. <mark>E</mark>. <mark>J</mark>. <mark>RICHARDSON</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "RICHARDSON"], "snippet": "REV. <mark>E</mark>. <mark>J</mark>. <mark>RICHARDSON</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2189.99, 1249.59, 2336.42, 1394.82], "bbox_id": "235570b409", "file": "TimesVirginian_1981a_0229.pdf", "page": 1, "text": "PUBUC NOTICE The following vehicle will be sold at public auction at 1000 a.m., July 12, 1961 to satisfy lien 1975 Mercury 2 Dr. Sedan Ser. No. 5K31L537351 Virginia License NXP-119 Can be seen at Appomattox Sheriffs Department. Terms ot sale shall h i cash, aa is. J. E. Richardson, Sheriff Appomattox, County ____________ 807-15-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "i cash, aa is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox, County ____________ 807-15-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "i cash, aa is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox, County ____________ 807-15-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1214.13, 655.52, 1361.08, 789.86], "bbox_id": "60c0c48e68", "file": "TimesVirginian_1981a_0199.pdf", "page": 1, "text": "PUBLIC NOTICE The following vehicle will be sold at public auction at 1000- a.m ., June 26,1981 satisfy lien 1974 Caprice. 4-Dr. Chevrolet Serial No.lN69R4T191859 Can be seen at the Appomattox Sheriffs Department. Terms of sell shall be cash, as is. J . E . Richardson, Sheriff, Appomattox County 806-17-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff, Appomattox County 806-17-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff, Appomattox County 806-17-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1112.17, 277.07, 1242.77, 468.57], "bbox_id": "4be0f46e97", "file": "TimesVirginian_1980a_0390.pdf", "page": 1, "text": "PUBLIC NOTICE Sheriffs Sale On November 25,1980, at 1000 a.m., the fdlowing diesel tractor Will be offered for sale at pubUc auction by Sheriff of Appomattox Co unty under tne authority of a fieri facias in debt 1969 Mack Tractor Diesel Identification F786ST5006 Terms of sale shall be cash, as is. Contact Appomattox County S heriffs D epart ment if you wish to see this vehicle. ÉËsa J. E. Richardson, Sheriff Appomattox County 8011-20-ltc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "see this vehicle. ÉËsa <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 8011-20-ltc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "see this vehicle. ÉËsa <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 8011-20-ltc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1100.15, 1375.58, 1227.58, 1611.67], "bbox_id": "871cf41885", "file": "TimesVirginian_1980a_0227.pdf", "page": 1, "text": "PUBLIC NOTICE Sheriffs Sale On July 19, 1980, at 1000 AM. the following mobile home and some household furnishings will be offered for sale at public auction  1-Imperial Mansion MobileHome 65 x 12 -1970 Model VR-FK-EVCT Serial No. 6062 Some Household Fur nishings Terms of Sale shall be cash, as is. Contact Appomattox County Sheriffs Department or Ronnie Spiggle, Auc tioneer if you wish to see this mobile home. J. E. Richardson, Sheriff Appomattox County 807-10-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "see this mobile home. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 807-10-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "see this mobile home. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County 807-10-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1111.68, 1714.9, 1245.8, 1821.19], "bbox_id": "41c8bbd5d3", "file": "TimesVirginian_1980a_0234.pdf", "page": 1, "text": "PUBLIC NOTICE BherifTsSale , The Imperial Marion Mobile Home advertised for sale last week will not be sold July 19. Another date will ha set for the sale. J. E. Richardson, Sheriff Appomattox Couaty 807-lT-lte"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "set for the sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox Couaty 807-lT-lte"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "set for the sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox Couaty 807-lT-lte"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1001.73, 392.06, 1131.12, 535.12], "bbox_id": "029e8df219", "file": "TimesVirginian_1980a_0113.pdf", "page": 1, "text": "PUBLIC AUCTION SHERVF8 SALE 1971 Dodge 2-Door, Serial No. WH28GtA18R243 will be sold at. pufaUe auction under Appomattox County Circuit Court,-, order  behind Appomattox County Court Heuae  April 28,1980 at 10 a.m.- Terms shall be cash, as is. J. E. Richardson, Sheriff Appomattox _______ 804-3-ltc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox _______ 804-3-ltc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox _______ 804-3-ltc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [984.0, 605.69, 1113.56, 749.14], "bbox_id": "cff0f1c035", "file": "TimesVirginian_1980a_0121.pdf", "page": 1, "text": "PUBLIC AUCTION SHERIFFS SALE 1968 Dodge Station Wagon, Ser ial No. 2L45F8A254818 will be sold at public auction under Appomattox County Circuit Court order - behind Appomattox County Court House - April 25, 1980 at 1000 a.m.. Terms shall be cash, as is. J. E. Richardson, Sheriff Appomattox 804-3-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox 804-3-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox 804-3-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2056.12, 409.84, 2222.92, 537.18], "bbox_id": "6c38b09b78", "file": "AppomattoxNewspapers_1955-1957a_0112.pdf", "page": 1, "text": "Pamplin Vicinity, Feb. 28.- Mr. and Mrs. J. E. Richardson and two children, Henry and Gene Mrs. S. R. Hublbard, Mrs. W. C. Wooldridge, Mrs. Scott Garrison, Mrs. Walter Rmhardson and Mrs. Dean Roberts attended a surprise birthday dinner given to Mr. L. R. Richardson, of Roanoke, by his children Sunday. There were about 82 guests pre sent. Mr. Richardson received many nice and useful gifts. A delicious dinner was served to all."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "28.- Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and two children, Henry"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "28.- Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and two children, Henry"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.61, 723.91, 1825.29, 1082.1], "bbox_id": "db2a79ebcd", "file": "AppomattoxNewspapers_1912-1915a_0367.pdf", "page": 1, "text": "P roh ib ition ist in Appom attox. On last Sunday morning and afternoon Rev. E. J. Richardson preached two splendid Temperance sermons at the Alt. Comfort and Trinity churches to two enthnsias tic audiences. The sermons made floe impressions and the people oon tributed nearly ope hundred dollars to the Anti-Saloon League to carry on the Tempesance work. We hogfe to have Rev. Richmond with us again soon. In the evening we had  with us at the M. E. Church in Appomattox the Hon. Richard P Hobson, author of the tioual Amendment for Prohibition and Rev. E. J. Rich ardson, whose stirring opening re marks put the large audienoe as- I sembled in the proper frame of mind for the scholarly address-of Mr. Hobson. No one who listened to the facts he presented in regard tu the debilitating effects of alcohol  Sir. Holcolm McCue, of Blue- drinks upou the human organism, field, was the guest of his brot- not mentioning the degrading of I her, Mr. John McCue, on Sat- the moral and spiritual natures, I urday night, could continue to use the deadly!"}, "highlight": {"text": {"matched_tokens": ["E", "J", "Richardson"], "snippet": "morning and afternoon Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark> preached two splendid Temperance"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "Richardson"], "snippet": "morning and afternoon Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark> preached two splendid Temperance"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2372.89, 1356.04, 2518.69, 1710.63], "bbox_id": "4fcb64cfc9", "file": "AppomattoxNewspapers_1974-1975a_0307.pdf", "page": 1, "text": "On May 30, 1975, 18 case, involving 48 separate charges of Breaking and Entering, were heard by the Circuit Court of Appomattox County. On evi dence presented by Sheriff J. E. Richardson, five Appomat tox men were convicted of these crimes. The men convict ed were George Edward Patterson, 9 Counts of Burgl ary Raymond Randolph Kelso, 16 Counts of Burglary Frank Thomas Jones, 5 Counts of Burglary Joseph Alfred Dill ard, 12 Counts of Burglary Leo Bernard Kelso, 6 Counts of Burglary. Commonwealth Attorney Sam Kerr said that the 18 burglaries included 1  private homes in the county and seven business places. The Court sentenced George Edward Patterson, Raymond Randolph Kelso and Joseph Alfred Dillard to serve 12 years in the Virginia State Penitentiary and j suspended two years of the 12 years on condition of their good behavior. The Court sentenced Leo Bernard Kelso and Frank Thomas Jones to serve ten years in the Virignia State"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "dence presented by Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, five Appomat tox men"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "dence presented by Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, five Appomat tox men"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.05, 994.7, 1667.8, 1254.99], "bbox_id": "b1744c0f5b", "file": "TimesVirginian_1976_0327.pdf", "page": 1, "text": "of federal funds, the supervisors plan to meet next week with Gay, Sheriff J . E . Richardson and offfcials from the State Department of Corrections to update the plans. The county has been under pressure from the corrections department to improve its jail facilities. Recently corrections depart ment officials told the supervis ors Appomattox County has the second worse local jail in the state. Only the Pittsylvania County jail is considered worse. Dr. S . R. Lawson, board chairman, said W. S. Kerr, commonwealths attorney, al- rady has notified federal ofWrUlw the county is planning to apply for funding. The public works program"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "week with Gay, Sheriff <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark> and offfcials from the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "week with Gay, Sheriff <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark> and offfcials from the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1203.87, 297.72, 1352.12, 808.84], "bbox_id": "9de3f8716b", "file": "TimesVirginian_1981a_0060.pdf", "page": 1, "text": "Notice To Citisens of Appo mattox County, secondary roads budget hearing fiscal year 1981-1982 Notice is hereby given that in accordance with the provisions of Section 33.1-70.01 of the Code of Virginia, as amended, the Board of Supervisors of Appomattox County will meet - with representatives of the Virginia Department of High ways and Transportation in public session in the Court Room, Appomattox County Courthouse, Appomattox, Vir ginia on Friday, March 13,1981 at 900 a.m. Said meeting shall be for the purpose of considering secon dary road budget for fiscal year 1981-1982, said plan Being based on the best estimate of funds to be available to the county for expenditure in the nex-t fiscal year on the secondary roads. Views of county citizens will be received and considered at this hearing. gS.R. Lawson Chairman, Appomattox County Board of Supervisors Teste Barbara R Williams, Clerk 802-25-2tc SHERIFFS SALE - ON FEBRUARY 27, 1981, at 1000 A.M. the following vehicle will be offered for sale at public auction 1968 Ford Serial No, 8X22T109658 Terms of Sale shall be cash, as is. Contact Appomattox County Sheriffs Department for details of sale. J. E. RICHARDSON, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tC"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2501.04, 528.14, 2645.72, 672.78], "bbox_id": "ef095e6ea3", "file": "TimesVirginian_1981a_0214.pdf", "page": 1, "text": "NOTICE PUBLIC AUCTION The following vehicle will be sold at public auction at 1000 a.m., July 17, 1981, to satisfy lien , 1973 Oldsmobile Can be seen at the Appomattox Sheriffs Depart ment. Terms of sale shall be cash, as is. J. E. Richardson Sheriff, Appomattox County 807-l-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> Sheriff, Appomattox County 807-l-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> Sheriff, Appomattox County 807-l-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [709.21, 1190.0, 849.4, 1743.19], "bbox_id": "66823e9648", "file": "TimesVirginian_1980a_0424.pdf", "page": 1, "text": "NOTICE OF PUBLIC HEARING There will be a public hearing held by the Appomattox County Board of Supervisors on Friday, December 12, 1980, for local citizens and the owners of Arco,. Inc., the company which currently holds the Appomattox County Cable Television Franchise, to ask and answer questions con cerning the Countys .propo sal to discontinue the Arco Cablevision Franchise. The hearing will be held in the Clerks Office starting at 200 p.m., and is required by Section 18 of the Appomat- tox County Cable Television Franchise. Barbara R. Williams, Clerk. 8012-4-2tc FRANKS MILITARY SER VICE _ _ Frank  Rosie Lawson wish everyone a Happy Holiday. We will be closed December 25, 26, 27 ft 28. Reopen December 29, 1980 regular time, Rt. 460, Lynchburg, Va. Phone 993- 9260. ________ 8012-18-2tc LEGAL NOTICE SHERIFFS SALE ON JANUARY 9,1861, at 10 a.m. the following vehicle will be offered for sale at public auction BaB 1968 Chevrolet 2-Door Sed. Serial No. 31111B230428 Terms ef Sale shall be cash, as is. Contact Appomattox County Sheriffs D epart ment for details of sale. J. E. Richardson, Sheriff Appomattox County _______ 8012-18-2tc VIRGINIA IN THE CIR CUIT COURT OF APPO MATTOX COUNTY Brsixtea Christian Garrett, Sr., ETALS,"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County _______ 8012-18-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County _______ 8012-18-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1051.22, 467.63, 1199.44, 938.72], "bbox_id": "55a063d6b2", "file": "TimesVirginian_1981a_0060.pdf", "page": 1, "text": "NO W ATER-NO PAY P H O N E 352-7872 APPOMATTOX, VA. 781-3-tfc C 80. Notices  Farm For Sale I will receive closed bids on the property of Frank W. Fleshman on the 11th day of March, 1981 at 400 p.m. This property is located in Madison District Charlotte County and contains approximately 94 Vz acres, with a dark tobacco - allotment pf 2.18 acres. 10 deposit required on acceptance of bid balance in cash by April 3, 1981. Bids may be njade by Registered Mail to Ida H. Campbell, P.  O. Box 747, Appomattox, Va. 24522 I reserve the right to reject any and all bids. Ida H. Campbell, Executrix Tele. No. 352-7486  802-25-2tc SHERIFFS SALE On FEBRUARY 27, 1981, at 1000 a.m. the following tractor will be offered for sale at public- auction International Harvester Super A-Tractor Terms of sale shall be cash, as is. Contact Appomattox County Sheriffs Department for details of sale. J. E. RICHARDSON, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "for details of sale. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY 802-18-2tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [581.27, 540.23, 746.72, 578.83], "bbox_id": "d5b8a752c5", "file": "AppomattoxNewspapers_1955-1957a_0135.pdf", "page": 1, "text": "Mrs. S. R. Hubbard and Mr. and Mrs. J. E. Richardson visited Mr. and Mrs. C. M. Gallaher, of Lynch burg Sunday."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Mrs. S. R. Hubbard and Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> visited Mr. and Mrs. C. M. Gallaher, of Lynch burg Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Mrs. S. R. Hubbard and Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> visited Mr. and Mrs. C. M. Gallaher, of Lynch burg Sunday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1110.72, 795.85, 1278.05, 854.85], "bbox_id": "6744139523", "file": "AppomattoxNewspapers_1955-1957a_0238.pdf", "page": 1, "text": "Mr. Walter Hubbard, of Richmond and Miss Naomi Schmitz, of Black- stone were visitors Sunday of Mr. and Mrs. S. R. Hubbard. Mr. and Mrs. J. E. Richardson called in the same home Sunday."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Hubbard. Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> called in the same"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Hubbard. Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> called in the same"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1595.06, 646.31, 1861.06, 739.36], "bbox_id": "abc3a218f8", "file": "AppomattoxNewspapers_1971-1973a_0178.pdf", "page": 1, "text": "Mr. and Mrs. J. E. Richardson of Pamplin announce the Engagement of their daughter Margaret Lou to Mr. James Davis, Jr., son of Mr. James R. Davis of Elkton, Va. Ind Mrs. Arlene Hamlett of Pamplin. Margaret is a graduate of Prince Edward Academy and is Employed at Stackpole Company of Farmville. James is a graduate of Appomattox County High School and Is employed with General Electric of Lynchburg. A February wedding is planned."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> of Pamplin announce the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> of Pamplin announce the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2216.66, 617.9, 2491.26, 712.1], "bbox_id": "89822bb971", "file": "AppomattoxNewspapers_1974-1975a_0475.pdf", "page": 1, "text": "Mr. and Mrs. Basil Bryant of Cullen have announced the engagement of their daughter, Betty Jean, to David Lee Richardson, son of Mr. and Mrs. J . E. Richardson of Pamplin. Miss Bryant is a 1973 graduate of Randolph-Henry High School and is employed by Amelia Dress Company in Pamplin. Mr. Richardson is a 1972 graduate of Prince Edward Academy and is employed by Babcock-Wilcox in Lynchburg. The wedding will be an event of January 24,1976. All friends and relatives are invited to attend."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "of Mr. and Mrs. <mark>J</mark> . <mark>E</mark>. <mark>Richardson</mark> of Pamplin. Miss Bryant"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "of Mr. and Mrs. <mark>J</mark> . <mark>E</mark>. <mark>Richardson</mark> of Pamplin. Miss Bryant"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1237.23, 948.63, 1360.93, 1084.23], "bbox_id": "16d876c35d", "file": "AppomattoxNewspapers_1960-1962b_0209.pdf", "page": 1, "text": "Mathis Fred Mrs McCall C H Mrs Nash Luther Rand Curtis G Mrs Richardson J E Scott William Shelton W H Pete Tolley Robert L"}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "E"], "snippet": "Mathis Fred Mrs McCall C H Mrs Nash Luther Rand Curtis G Mrs <mark>Richardson</mark> <mark>J</mark> <mark>E</mark> Scott William Shelton W H Pete Tolley Robert L"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "E"], "snippet": "Mathis Fred Mrs McCall C H Mrs Nash Luther Rand Curtis G Mrs <mark>Richardson</mark> <mark>J</mark> <mark>E</mark> Scott William Shelton W H Pete Tolley Robert L"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [813.6, 515.66, 945.56, 734.95], "bbox_id": "8d7ec0d8b7", "file": "TimesVirginian_1980a_0431.pdf", "page": 1, "text": "LEGAL NOTICE SHERIFFS SALE ON JANUARY 9,1981, at 10 a.m. the following vehicle will be offered for sale at public auction 1963 Chevrolet 2-Door Sed. Serial No. 31111B230428 Terms of Sale shall be cash! as is. Contact Appomattox County Sheriffs Depart-  ment foAdetails of sale. J. E. Richardson, Sheriff Appomattox County .  80124-2 VIRGINIA IN THE CIR CUIT COURT OF APPO MATTOX COUNTY Braxton Christian Garrett, Sr., ETALS,"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "ment foAdetails of sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County .  80124-2"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "ment foAdetails of sale. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox County .  80124-2"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2499.61, 1003.46, 2645.73, 1065.3], "bbox_id": "b527451dc3", "file": "TimesVirginian_1981a_0214.pdf", "page": 1, "text": "k f the Appomattox Sheriffs Department. Terms of sale shall be cash, as is. J. E. Richardson, .. .   . Sheriff, Appomattox County"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "k f the Appomattox Sheriffs Department. Terms of sale shall be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, .. .   . Sheriff, Appomattox County"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "k f the Appomattox Sheriffs Department. Terms of sale shall be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, .. .   . Sheriff, Appomattox County"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.1, 513.91, 1844.67, 547.63], "bbox_id": "8278cee636", "file": "TimesVirginian_1980a_0074.pdf", "page": 1, "text": "J. E. Richardson ,t Celebrates 10th birthday"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> ,t Celebrates 10th birthday"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> ,t Celebrates 10th birthday"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1580.6, 1124.47, 1725.55, 1263.61], "bbox_id": "7a578b8a8d", "file": "TimesVirginian_1978_0115.pdf", "page": 1, "text": "J. E. Richardson, Sheriff of Appomattox County, wants to milk, all citizens aware that the deadline to purchase county decals is March 31st. - The Appomattox Cunty Sheriffs Department will be holding checking details in all parts of the .county on April 1, 1978. Anyone who does not have a county sticker, or does not have it displayed will be lued a summons for not"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2452.07, 1406.16, 2598.22, 1623.81], "bbox_id": "c15bd4948c", "file": "TimesVirginian_1978_0125.pdf", "page": 1, "text": "J. E. Richardson, Sheriff of Appomattox County, wants to make all citizen aware that the deadline to purchase county decals la March 31st. The Appomattox Chanty Sheriffs Department will be bidding checking details in all parts of the county on April 1, 1978. Anyone who does not have a county sticker, or does not have it displayed will be issued a summons for not having one. The decals are purchased at the Office of the Treasurer of Appomattox County. You must taka your registration eard with you in order to get your decal."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1097.1, 1764.4, 1320.34, 1792.35], "bbox_id": "02194589fc", "file": "TimesVirginian_1978_0059.pdf", "page": 1, "text": "J. E. RICHARDSON, SHERIFF APPOMATTOX COUNTY"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "<mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, SHERIFF APPOMATTOX COUNTY"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1691.99, 801.99, 1829.44, 976.63], "bbox_id": "8f2560099b", "file": "AppomattoxNewspapers_1974-1975a_0209.pdf", "page": 1, "text": "J . E . Richardson, Sheriff of Appomattox County, announc ed Tuesday that he will be a candidate for. re-election to this office subject to the upcoming election. Sheriff Richardson in making his announcement stated that he will continue to do all in his power to help make Appomat tox County a safe place to live, a place free of so many violent crimes that have plagued our state ahd our natioii and tk it he will appreciate the contiitfted support of the citizens of this county,   fc   i"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "<mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2376.91, 1125.23, 2522.71, 1272.27], "bbox_id": "4c3b045f4f", "file": "AppomattoxNewspapers_1974-1975a_0497.pdf", "page": 1, "text": "In other county offices, J. E. Richardson, Sheriff of Appo mattox County, led the ticket with an unofficial count of 2294 votes. Mrs. Ida H. Campbell, Treasurer, received 2252 votes Commissioner of the Revenue John C. Caldwell got a total of  2199 votes and W. S. Sam Kerr, Commonwealths Attor- I ney, had a total of 1,998 votes. These candidates were all  incum bents, and w ere all  unopposed."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "In other county offices, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appo mattox"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "In other county offices, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appo mattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2411.04, 497.46, 2567.02, 1132.13], "bbox_id": "043a995f83", "file": "TimesVirginian_1976_0221.pdf", "page": 1, "text": "However, the county exper ienced an unexpected enroll ment increase which offset the cut by about 32,000. The 34,000 due to be received apparently will offset the remainder of the five per cent cut. Walton said the funds would be used to purchase two school bus chassis at a cost of 12,000. The remainder of the funds will go for paint and summer maintenance materials, and to pay utility, oil and gas bills. The federally-funded school lunch program in the county has been allocated an unexpect ed 10,000, also, so informed Supt. Walton. In other business, the supervisors approved a hospi talization plan for county employees through Blue Cross- Blue Shield. The board voted to pay the entire annual premium of the insurance for the employees but not for their families. The annudl premium was set at 4,563. The board authorized Wil liam Slagle, special projects secretary to the board, to solicit bids for a new county garbage truck. Slagle estimated the truck cost would be approxi mately 60,000. J. E. Richardson, Sheriff of Appom attox County, asked board members to change the ordinance regulating county auto stickers. He requested that the ordinance be amended Nfew the sheriffs depart ment to issue tickets to owners of any automobiles lacking a county sticker. The current law only allows ticketing of vehicles being operated on highways. Richard son said some nersons in the county were failing to buy stickers, and then they were driving at nights. No action was taken on this request as the board felt it should consult with William S. Kerr, Appomattox Countys Commonwealth Attorney."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be approxi mately 60,000. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appom attox"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be approxi mately 60,000. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appom attox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [962.15, 198.11, 1109.98, 734.93], "bbox_id": "29238a0f37", "file": "AppomattoxNewspapers_1971-1973a_0155.pdf", "page": 1, "text": "Hea trat zee, of tal treatment young people. Dr. Kinlaw said that at least half of the students in the coun ty high school have dental dif ficulties, and that many times such dental needs are neglected. He said that with cooperation from local dentists arrange ments could be made for care for indigent patients with state reinbursement for part of the expense. It was suggested by the sup ervisors that anyone accepted for dental treatment under such a plan be screened, and board chairman O. W. Martin, Jr. used the term heavy screening by the Welfare Dept, before such treatment is rendered. The board is sympathetic to dental needs by our youth, he said but recognizes that individ ual need to accept a certain amount of responsibility. The board requested Dr. Kinlaw to get in touch with Mrs. Hazel Mann, Welfare Dept. supt. be fore the board takes any action on the plan. Tax Exemption The Appomattox School Foun dation Robert E. Lee Academy has been granted tax exemption for county taxes during 1971 and thereafter as a non-profit organization in action given fi nal approval on Friday. Jail Supplies The board approved the pur chase of eight new mattresses and twelve pillows following a jail inspection report and re commendation from the Dept, of Welfare and Institutions. Sheriff J. E. Richardson also"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Welfare and Institutions. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> also"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Welfare and Institutions. Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> also"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2405.04, 1221.57, 2550.06, 1406.35], "bbox_id": "5800d0aef7", "file": "TimesVirginian_1976_0088.pdf", "page": 1, "text": "from Jacksonville, Florida last Friday by Sheriff J. E. Richardson and State Police Investigator Cliff Rhodenizer. He is being held in lieu of a 5,000.00 bond. Wayne Dale Harmon also of Roanoke was arrested on November 17,1975 in connect ion with this same offense. The third suspect, Robert Edward Hannabass, age 31, was arrested Saturday, March 6, 1976 in Midland, Texas and will be extradited back to Virginia where he will be charged in the burglary."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "last Friday by Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and State Police Investigator"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "last Friday by Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> and State Police Investigator"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [591.1, 829.27, 746.47, 1723.22], "bbox_id": "464cf0e62f", "file": "TimesVirginian_1978_0487.pdf", "page": 1, "text": "Debbie Litchford Martha Guill Merle Reynolds J. B. Terry, Jr. Delores Terry John R. Boone Jannie Franklin J. L. St.John H. W. Ranson Paul S. Drinkard William E. Chernault Richard B. Carter Dons Conners auaoms e.-ig Ç. E. Conner..  James Hal?  h  Joe Ferrell John E. Archer Wallace Clair Leon Edmonds J. A. Conner, Jr. James W. Franklin, Sr. Kenneth R. Goin Emmett Harris Floyd Guill James N. Berryman Frances Reynolds James Wilson Franklin, Jr. J. E. Richardson Neville T. Franklin Joan Berryman Alfred Bryant Ruby Bryant Charlie Jamerson Margie Jamerson Robert Murden Thelma Franklin Alice Faye Franklin Kenneth Franklin Geneva Franklin T. E. Woodson Thomas S. Conner Lloyd Ferguson O. B. Garriss Mary C. Garriss Kathie G. Pierce J. A. Conner Thelma Conner H. Elliott Torrence Lorraine Torrence Russell C. Conner John W. Torrence Betty Torrence R. Allen Conner S. B. Robertson Catherine Robertson Mary Casey Mickey L. Martin Robert B. Coffey Florence Coffey Lewis C. Tweedy Junior Puckett Robert Winston James Ayers Charlie Mayberry George Ronald Ayers J. P. Harvey, Jr. Bobby Roach Wayne Ferguson Louis Smith, Jr. Todd Roach Thomas Pinnix C. W,. Guthrie, Jr. Karen W. Blankenship Cecil C. Nash Claude Martin, Jr. Paul M. Gunter, Jr. E. T. H arris. Donny R. Martin James C. Ragland Carl L. Hodges , t H. J.St. John Dale Jennings Carol Richardson"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "James Wilson Franklin, Jr. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> Neville T. Franklin Joan"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "James Wilson Franklin, Jr. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark> Neville T. Franklin Joan"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.94, 537.47, 1946.94, 996.45], "bbox_id": "28b81d456a", "file": "TimesVirginian_1983a_0379.pdf", "page": 1, "text": "Commerce and Rules Committees. Mayberry, a resident of Appomattox County, has worked in local industry, agriculture and the insurance business. He is a member of the Virginia Taxpayers Association, Independent Virginians for Political Action, and ia the Central Virginia Coordinator for the American Agricultural Movement ofVirginia. In the second statewide election rotative to Appom attox County, incumbent Howard P . Anderson, A Halifax County attorney, is running unopposed for re-election to the 18th District senatorial seat. There are also five uncontested elections for county offices on this years ballot. Jf. Franklin Vaughan, the incumbent County Supervisor representing the Stonewall District, is running un opposed for the Board of Supervisors seat. Monte W . Mays, incumbent Comm issioner of the Revenue for Appoma ttox County, is also running unopposed for re-election this year. Barbara R . Williams, clerk of the circuit court, will run unopposed this year for another eight-year term as county dark. And,Sheriff J . E . Richardson, who has served the past four years as the countys chief law-enforcement officer, will not be opposed on. the ballot in Tuesdays election. For the Commonwealths Attorney office fo Appomattox County, Thomas W . Lawson is running unopposed for this first term in that office. Lawson, an Appomattox attorney, filed earlier tnfa year follow ing ineefohtetjw . Kite Ketr anhtetoto-"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "as county dark. And,Sheriff <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, who has served the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "as county dark. And,Sheriff <mark>J</mark> . <mark>E</mark> . <mark>Richardson</mark>, who has served the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [130.31, 629.17, 406.56, 747.66], "bbox_id": "077953e3ea", "file": "TimesVirginian_1976_0337.pdf", "page": 1, "text": "CENTRAL VIRGINIA REACT TEAM 3007 p -ted a CB Radio to the Appomattox County Sheriffs Department, shown above being held by J. E. Richardson, county sheriff. React hopes that by providing the Sheriffs D ept with a CB Radio, they will be able to establish aéd maintain a monitoring program on the official CB emergency Channel 9 on a 24-hour ffluia It is hoped that this constant state of readiness can provide the community with a CB communications team capable of responding to every type of emergency situation or assistance in regular scheduled events. Anyone interested in Joining REACT can do so by contacting a member."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "above being held by <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, county sheriff. React hopes"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "above being held by <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, county sheriff. React hopes"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.68, 1162.86, 2298.28, 1368.7], "bbox_id": "eb9befba7a", "file": "AppomattoxNewspapers_1974-1975a_0170.pdf", "page": 1, "text": "C. A. Reynolds, Deputy Sheriff of Appomattox County, has been attending and success fully completed the Minimum Standard Training School on January 31,1975 as required by the Law Enforcement Officers Training Standards Commis sion. Deputy Reynolds was em ployed by the county Novem ber 1, 1968 and was appointed by J. E. Richardson, Sheriff of Appomattox County, as Chief Deputy on May 5,1972. Since that time he has attended numerous seminars relating to scientific investiga tion of crime, homicide, and police administration problems."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "and was appointed by <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "and was appointed by <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff of Appomattox County,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1668.26, 261.86, 1811.98, 606.9], "bbox_id": "757a564f33", "file": "TimesVirginian_1976_0183.pdf", "page": 1, "text": "By the power invested in me as sheriff of Appomattox County, and under the authori ty of a Court OrdMr, issued by the General District Court of the County of Appomsittox, will I offer for sale at public auction to satisfy a judgment in the m atter of    ,  NEVILLE P. MOORE ...î. VERSUS ii-.- ALLEN WRliHT, JR. The following vehicle 1954 One-HaH Ton Track Chevrolet Virginia License HHL-515, Serial No. H54B025- 186, Fair Condition. The auction sale Will take place .behind the courthouse of Appomattox County at 1000 a.m. on May 21,1976. Terms of sale shall be cash. This vehicle can presently be seen at the Appomattox County Sheriffs Department. Anyone desiring further information in regard to this sale may contract Appomattox County Sheriffs Department. J. E. RICHARDSON, Sheriff Appomattox County Ï   5-20 It"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "Appomattox County Sheriffs Department. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff Appomattox County Ï"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "Appomattox County Sheriffs Department. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff Appomattox County Ï"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1707.1, 625.95, 1853.15, 1023.29], "bbox_id": "7a445d6436", "file": "TimesVirginian_1978_0386.pdf", "page": 1, "text": "By the power invested in me as Sheriff of Appomattox Coun ty, and under the authority of a Court Order, issued by the General District Court of the County of Appomattox, wiU I of fer for sale at PUBLIC AUC TION to satisfy a judgment. Docket C78-322, in the matter of Ayers Building  Supply Co. Inc. vs. D. R. Maxwell The following items I - Fox Go-Cart 1 - J. C. Penny Push Mower I Briggs  Stratton Simplicity Riding Mower 1 - Magna vox Color Television,  Ser.9005436  1- Frigidaire Refrigerator. Green in color 1 - Frigidaire Dryer Green in color 1 Westinghouse Television 19 1 - 1967 Chevrolet, 4-Dr. Sedan, Ser 164697Y110118 License LCF-514 78 9 - Sheets of Plywood 4 x 8 This AUCTION SALE will take place behind the cour thouse of Appomattox County at 1000 a.m. on September 1,1978. Terms.of this sale shall be,pash. These items may be een by contacting the Appomattox County Sheriffs Department. J. E. RICHARDSON, Sheriff Appomattox County 8-31-ltc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "Appomattox County Sheriffs Department. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff Appomattox County 8-31-ltc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "RICHARDSON"], "snippet": "Appomattox County Sheriffs Department. <mark>J</mark>. <mark>E</mark>. <mark>RICHARDSON</mark>, Sheriff Appomattox County 8-31-ltc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2029.2, 786.69, 2177.84, 1105.02], "bbox_id": "dc4007ada1", "file": "TimesVirginian_1981a_0091.pdf", "page": 1, "text": "bride-to-be Miss Angela Denise Richard son . of Pamplin has been honored recently with several showers of bridal appointment prior to her marriage to Boyce Phillip Seay Miss Richardson was honor- ed on Sunday, March 15 with a miscellaneous shower at the Piney Ridge United Methodist Church in Pamplin. Guests at the shower included friends and relatives of Miss Richardson. Mrs. Darryl Hudson of .Concord and Miss Debbie Baldwin of Pa.mptin were hostess on Saturday, March 28, honoring Miss Richardson with a lingerie shower. Guests at the floating shower included Mrs. J. E. Richardson, the brides mother, Mrs. Patsy Thomas, sister of the bridegroom,, and friends of Miss Richardson. The Richardson-Seay wed ding will take place Saturday, April 4 at 730 p.m. in Piney Ridge United Methodist Chur ch in Pamplin"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "floating shower included Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, the brides mother, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "floating shower included Mrs. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, the brides mother, Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.94, 388.71, 2000.33, 471.21], "bbox_id": "c0c05d8dac", "file": "TimesVirginian_1981a_0115.pdf", "page": 1, "text": "At the McDonalds located on Wards Road,.  VIP from Appomattox who will be visiting during the day include Ronald Spiggle, mayor of Appomattox J. E. Richardson, sheriff of Appomattox County Margaret Harris, manager of"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Spiggle, mayor of Appomattox <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, sheriff of Appomattox County"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Spiggle, mayor of Appomattox <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, sheriff of Appomattox County"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [101.51, 683.99, 248.77, 1044.87], "bbox_id": "92471226b2", "file": "TimesVirginian_1981a_0360.pdf", "page": 1, "text": "Appomattox Sheriff J. E. Richardson, Buckingham She riff Gariiett Shumaker, Jr., and Cumberland Sheriff Hénry A. Blanton, m are among 75 of Virginias 125 sheriffs who have endorsed Lt. Gov. Charles Robb in his bul for the Governors seat. Sheriff Andrew Winston of the city of Richmond, Sheriff Marshall Honaker of Bristol, and Sheriff Carl Wells of Bedford County are co-chair man of the Sheriffs for Robb. In making the announcement for Robb this week. Sheriff Winston said, We áre particu larly impressed with the Robb Planfor Law Enforcement. The plan is probably the most comprehensive ever proposed by a candidate for governor. It is! certainly more substantive thfen anything thus far offered by Mr. Robbs opponent. We bfove that Chuck Robbs priposal will go a long way in curbing the menace of crime in the Commonwealth. We believe tlfot his plan for tougher sentences for repeat offenders, staffer bail criteria, and a crackdown on drug dealers will Sable Virginians once more to"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Appomattox Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Buckingham She riff Gariiett"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Appomattox Sheriff <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Buckingham She riff Gariiett"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [362.2, 946.48, 505.73, 1207.75], "bbox_id": "e4366d880b", "file": "AppomattoxNewspapers_1971-1973a_0130.pdf", "page": 1, "text": "All Garden Club members, will participate in the  Pre paration of H o l i da y Hous e Tour, with three Appomattox Homes being open to the public on Sunday, Dec. 12th, from 3 to 5 and 7 to 9 p.m. Tickets are now on sale at 1,50, which will include the viewing of all three homes. Mrs. David Nash is Chairman of the ticket sales with each garden club member having on hand t i c k e t s for sale. Mrs. June Chenault at Fidelity Branch Of fice, will also have tickets for sale. The following c o m m i t t e e s have been set up by Mrs. Perry Davis, Vice-President and Pro gram Chairman. The home of Mr. and Mrs. Jesse Guill will be decorated by Mesdames Evelyn Hubbard, Carolyn Davis, Mild red Richardson, J e s s i e Car-"}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "e", "e"], "snippet": "Carolyn Davis, Mild red <mark>Richardson</mark>, <mark>J</mark> <mark>e</mark> s s i <mark>e</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "e", "e"], "snippet": "Carolyn Davis, Mild red <mark>Richardson</mark>, <mark>J</mark> <mark>e</mark> s s i <mark>e</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2425.58, 507.66, 2579.11, 963.34], "bbox_id": "85ed806285", "file": "TimesVirginian_1976_0293.pdf", "page": 1, "text": "Additional revenue for the County of Appomattox at the Friday meeting of the Board of Supervisors came in the form of a 22,483 check from the Virginia Division of Forestry, the countys share of timber sales from the Appomattox - Buckingham State Forest. Carter Taylor, state forester, presented the check and W. C. Stanley, superintendent of state forests, told the board this was almost three times the  amount the county would have collected in taxes from the forest. In other business, J. E. Richardson, Appomattox Coun ty Sheriff, informed the board of the parking problem in the Fire Lane at Triangle Plaza Shopping Center and asked to have an ordinance passed allowing parking violators to pay a 4.00 fee to the treasurer within 48 hours and avoid court costs. He suggested the local law because the state law is too expensive. A parking violation under state law must be tried in General District Court and carries a fine of 18.00 in court costs. Under the local law, if approved, the violator would be allowed to pay only a 4.00 fine if paid within the time limit. The Board advised Richard son to discuss the proposal with W. S. Kerr, commonwealths Attorney, and to present it at a"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "forest. In other business, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Appomattox Coun ty Sheriff,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "forest. In other business, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Appomattox Coun ty Sheriff,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.74, 1561.41, 2281.69, 1806.45], "bbox_id": "b967f7ad30", "file": "TimesVirginian_1980a_0176.pdf", "page": 1, "text": "A Spout Spring man was arrested Sunday after the body of  26-yearold woman was found near the mobile home in which she lived. Jackie Lewis Robinson, 26, of Route 1. Spout Sprijig, was charged with murder in connection with the apparent homicide of Casaadra Daphne Berry. According to Appomattox County Sheriff, J. E. Richardson, neighbors of Ms. Berry called the Sheriffs office on Sunday at approximately 3 p.m. to report that they were unable to locate the woman. About 45 minutes later, the same neighbors called the Sheriffs office again and reported that she had been found in a wooded area not for from her mobile home in the Sleepy Hollow Trailer Park. Officers from the Sheriffs depart ment responded to the call, where they found the victim. y"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "to Appomattox County Sheriff, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, neighbors of Ms. Berry"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "to Appomattox County Sheriff, <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, neighbors of Ms. Berry"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1907.04, 774.7, 2225.38, 991.9], "bbox_id": "fccc474fa4", "file": "AppomattoxNewspapers_1908-1909a_0577.pdf", "page": 1, "text": ", The Rev. E. J. Richardson,  superintendent of the Virginia j Anti-Saloon I esgue, spoke here at the high school aubtorium -n gCh00j t0ok an active part last Sunday right and boosted - the state rall of N.F.As, the causé of tempérance, a n d held at virginia state College, prohibition in an interesting ad- Peter8burg Va. on April 27- dress. The meeting spon- gg Twenty-six training schools sored by all churches m town were represented, with a total and was largely attendea.  enrollment of 200 boys. tirial method of presenting his1 The local school 8ot ei8fht subject matter and his illustra- by8 Theffollowing boys took tions were most effective. He  Part_in. th tiirtties proved himself to be quite a J 08B Coleman, ipseph West, cartoonist graphically depicted delegates, Carsey Abbot , the effect of intemperance Charles Marshall, Oratorical With a few strokes of the cray- contest Luther Hicks Pans on he allowed intoxicants to ? ar y and Van Patteson, change a beautiful boy irito a  dging 11 TheJ e T rî ?ix repugnant tramp. He ahowed      J J !  !"}, "highlight": {"text": {"matched_tokens": ["E", "J", "Richardson"], "snippet": "The Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark>,  superintendent of the Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "Richardson"], "snippet": "The Rev. <mark>E</mark>. <mark>J</mark>. <mark>Richardson</mark>,  superintendent of the Virginia"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [979.7, 375.04, 1113.86, 518.79], "bbox_id": "ba9482acbd", "file": "TimesVirginian_1980a_0121.pdf", "page": 1, "text": ", PUBLIC AUCTION SHERIFFS SALE 1971 Dodge 2-Door, Serial No. WH23G1AL89243 will be sold at public auction under Appomattox County Circuit Court order - behind Appomattox County Court House - April 25, 1980 at 10 a.m. Terms shall be cash, as is. J. E. Richardson, Sheriff Appomattox _ __________ 804-3-ltc"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox _ __________ 804-3-ltc"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "be cash, as is. <mark>J</mark>. <mark>E</mark>. <mark>Richardson</mark>, Sheriff Appomattox _ __________ 804-3-ltc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.96, 454.39, 1938.44, 754.78], "bbox_id": "f74a3d4ece", "file": "AppomattoxNewspapers_1971-1973a_0005.pdf", "page": 1, "text": "Six delegates and six alter nates from Appomattox County have been elected to attend the Democratic State Convention to be held in Hampton on Sat., Aug. 14, for the purpose of selecting a Democratic nominee for the office of Lieutenant- Governor of the Commonwealth of Vir ginia, to fill the vacancy creat ed by the death of J. Sergeant Reynolds. The six delegates elected are Robert G. Stewart, W. M. Ab- bitt, Mrs. Calvin H. Robinson, Harry G. Lawson, C. T.Moses, Jr. and Harry T. Ferguson,Jr. Six alternates were also elect ed at the same time. They are Mrs. Crawford Davidson, Wat kins M. Abbitt, Jr., Blaine Car ter, W i l f r e d Rogers, J. E.  Gene Richardson and Rich ard Williams, Jr. The number of delegates to the convention was based on the number of Democratic votes cast in the General Election in 1969."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "r e d Rogers, <mark>J</mark>. <mark>E</mark>.  Gene <mark>Richardson</mark> and Rich ard Williams,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "r e d Rogers, <mark>J</mark>. <mark>E</mark>.  Gene <mark>Richardson</mark> and Rich ard Williams,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [281.73, 387.84, 562.18, 495.08], "bbox_id": "8f85801282", "file": "TimesVirginian_1976_0117.pdf", "page": 1, "text": "Mrs. Sadie Brightwell, teacher at Pamplin Elementary School and Chairman for the Boy Scout Fund Drive in Pamplin, is shown above receiving certificate from Tom Morgan, Central District Executive, Boy Scouts of America, in recognition of going over the 250.00 goal set for Pamplin. As of Tuesday of this week, Mrs. Brightwell had turned in 252.75. Mrs. Brightwell was congratuled on a job well done. Helping her with the fund drive were Richard Fore, Mrs. E. N. Harvey, Mrs. E. N. Cunningham, Mrs. Raymond Kress, Mrs. L. R. Richardson, Mrs. E. J. Smith, and Mrs. 8. B, Waddell."}, "highlight": {"text": {"matched_tokens": ["Richardson", "E", "J"], "snippet": "Kress, Mrs. L. R. <mark>Richardson</mark>, Mrs. <mark>E</mark>. <mark>J</mark>. Smith, and Mrs. 8."}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "E", "J"], "snippet": "Kress, Mrs. L. R. <mark>Richardson</mark>, Mrs. <mark>E</mark>. <mark>J</mark>. Smith, and Mrs. 8."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2041.17, 491.48, 2232.9, 1508.97], "bbox_id": "890debd98e", "file": "AppomattoxNewspapers_1905-1912a_0369.pdf", "page": 1, "text": "Evergreen. The rain th a t fell here day night and Saturday was greatly needed. T hrashing w heat seems to be the order of the day in this com m unity The w heat crop was cut short by the dr? w ea ther. Misses M attie LoujBaker and Pearl Thom as, of Lower Appo m attox Miss R uth Roberson and Messrs. I. E. Richardson and J. O scar Baker, of Lynch burg, were the guests of Mr. and Mrs. L uther Southall Sun day. Miss Lucy Bonnet, .of Dan ville, is the guest of Mr. and Mrs. C. A. W arren, o f1 this place. Prof. nd Mrs. J. R. Tucker eft Saturday for A m herst county, w here they w ill spend some tim e w ith friends and relatives. Mrs. R. C. Glover, of Crewe, was in our tow n last week. Misses Jessie May and Lu- cile W alker, of Pam plin Oity, are the guests of Miss R uth la rv e y near here. Mr. Southerland is relieving our agent, Mr. C. S. MoDear- mon, who is off on his vacation Mrs. S. M. Thornton and Mr.i and Mrs- B. F. G unter are in ynchburg to-day. Mrs. C. S. M cDearmon, Mrs. J . R. H am ilton and Miss Mat- tie H arvey are sick.  Long Creek. The drouth has at last been broken by tw o good rains last week. The people as well as the crops are refreshed. The tobacco crop in this neighborhood will be short. Several have heir land bedded but there are no plants left to plant w ith. Rev- H. C Ruffin preached a splendid sermon at Red House Sunday. He is very m uch liked in this com m unity. Revival services w ill begin a t Concord C hurch next Sun day, the pastor, Rev. A. J. Pon ton, w ill be assisted by Rev. J . C- Lepps. Miss Sallie H unter, who has been visiting her sisters in Bluefield, returned to her home last week. Miss P earl Roach and M asters H unter and C har les H ancock accompanied her home. Mrs. Alice F arrar and little grand-daughter, of Lynchburg, visited her brother, Mr. C. H. Rush, last week. Mrs. R. W . P aulett is visit ing her son, Revs. L. F. P au lett, in Richm ond, this week L ittle C harlie Scott Rush, 3 u f- who w as thought to be para- lized, is im proving. W e hope this bright little fellow will soon be well. Mr. W illie Ferguson is w ear ing a broad sm ilea little gentlem an has come to board at his home."}, "highlight": {"text": {"matched_tokens": ["E", "Richardson", "J"], "snippet": "Roberson and Messrs. I. <mark>E</mark>. <mark>Richardson</mark> and <mark>J</mark>. O scar Baker, of"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Richardson", "J"], "snippet": "Roberson and Messrs. I. <mark>E</mark>. <mark>Richardson</mark> and <mark>J</mark>. O scar Baker, of"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1176.7, 1034.54, 1324.82, 1549.79], "bbox_id": "5216700361", "file": "TimesVirginian_1980a_0005.pdf", "page": 1, "text": "Cobb and Martin chose not to seek, reelection. All four county officers were unopposed in this election. W. Sam Kerr is Comjnonwealths Attorney, J. E. Gene Richardson is Appomattox County Sheriff, Commissioner of Revenue is Monte W. Mays, and Treasurer is Ida H. Campbell. On June 9, Appomattox County High School awarded diplomas to 221 graduating seniors. The Class of M79 was the largest ever to graduate from the local high school. Scene of triple slaying July 23 in nearby Evergreen where three men were killed and one wounded in a shootout. Circle indicates one bullet hole that came through wall of house. Dead were Bruce Steven Draper, 26, of Pottstown, Pa. Steven P. Philgreén, 23, Stone Mountain, Ga. and Robert E. Deutsch, 30, of Atlanta, Ga. The lone survivor -was James Michael Hardy, 24 of Stone Mountain, Ga. The four men, living in a form house in Evergreen, were surveyors employed by American Engi neers and Surveyors of Atlanta, working for Colonial Pipeline Company in Appomat tox police said. The man surviving was not the person who . started the shootout. Starting the shooting was ope of the three men who was killed, A police spokesman said having severe police he had been having emotional problems for some time. Approximately 100 county citizens came out to the public hearing Aug. 15 to discuss thé propose by-pass of Appomat tox on 0. S. 460, a project that will cost in excess of 13, million. Hie first contract,for ContdonPage5"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Kerr is Comjnonwealths Attorney, <mark>J</mark>. <mark>E</mark>. Gene <mark>Richardson</mark> is Appomattox County Sheriff,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Kerr is Comjnonwealths Attorney, <mark>J</mark>. <mark>E</mark>. Gene <mark>Richardson</mark> is Appomattox County Sheriff,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [810.66, 1319.92, 969.29, 1764.81], "bbox_id": "16477047c8", "file": "AppomattoxNewspapers_1912-1915a_0091.pdf", "page": 1, "text": "Amendments to charter Baylor-Yar- borough Company Inc., Richmond, Va., increasing its capital from 15,000 to 30,000. Ferguson  Co. Inc., Sandy Level, Va., 2,500 to 10,000. Mercantile business. R. E. Ferguson, president M. E. Mease, vice-president Orelle Davis, secretary and treasurerall of Sandy Level, Va. Chesapeake Pulp and Paper Com pany Inc., West Point, Va., 250,000 to 300,000. H. W. Nicholas, presi dent M. T. Nicholas, secretary and treasurer, Boston, Mass Richard P. Ernst, Cincinnati, Ohio. Roanoke Ice Corporation, Roanoke, Va., 5,000 to 35,000. W. K. Andrews, president O. S. Groggs, secretary L. A. Scholz, vice-presidentall of Roa noke, Va. The Farmers Union Telephone Com pany, Mangohick, Va., 500 to 5,000. W. T. Mookar, president Mangohick, Va. J. O. Hutchinson, vice-president, Hanover, Va. E. W. Fox, secretary and treasurer, Luther, Va. Interstate Electric Corporation, Richmond, Va., 500 to 1,000,000. John G. Jackson, president, New York Thomas B. Gray and H. H. Chalkley, Richmond, Va. The Richardson-Wayland Electrical Corporation, Roanoke, Va 4,000 to 10,000. J. M. Richardson, president J. E. Wayland, secretary and treas urer Fora E. Woodsall of Roanoke, Va. W. A. Brown Tobacco Company Inc. Martinsville, Va., 65,000 to 75,000. G. B. Dudley, president J. E. Howard, vice-president G. B. Dudley, Jr., secretary and treasurerall of Martinsville, Va. Glen Allen Corporation, Richmond, Va, 25,000 to 260,000. W. H. Adams, president H. R. Pollard, Jr., treas urer, and Jesse F, Wood, secretary _ all of Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "E"], "snippet": "to 10,000. J. M. <mark>Richardson</mark>, president <mark>J</mark>. <mark>E</mark>. Wayland, secretary and treas"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "E"], "snippet": "to 10,000. J. M. <mark>Richardson</mark>, president <mark>J</mark>. <mark>E</mark>. Wayland, secretary and treas"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.48, 1143.66, 1605.64, 1177.82], "bbox_id": "9395412c2e", "file": "AppomattoxNewspapers_1892-1898a_0265.pdf", "page": 1, "text": "m o r e t h a n - j T A L F i t s R E A L V A L U E . l j Ilf RICHARDSON  CO. Sole Agent Farmville, Va."}, "highlight": {"text": {"matched_tokens": ["E", "j", "RICHARDSON"], "snippet": "V A L U <mark>E</mark> . l <mark>j</mark> Ilf <mark>RICHARDSON</mark>  CO. Sole Agent Farmville,"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "j", "RICHARDSON"], "snippet": "V A L U <mark>E</mark> . l <mark>j</mark> Ilf <mark>RICHARDSON</mark>  CO. Sole Agent Farmville,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [365.52, 870.79, 510.12, 1282.22], "bbox_id": "c1f92a02e4", "file": "AppomattoxNewspapers_1971-1973a_0369.pdf", "page": 1, "text": "Mr. and M rs. H erbert Mc Call of Largo, Fla., and M rs. Jessie P. Smith of Axton are visiting Dr. and M rs. C. H. McCall. Dr. and M rs. Lorie Moore and daughter, Monica of Smith- field, N. C. returned home last week after a visit with her p ar ents, Mr. and M rs. J a m e s Richardson. Mr. Frank Lee E d ler, son of Rev. and M rs. W. H. Elder graduated June 5 from the Uni versity of Richmond with a B.S degree in chem istry. He receiv ed three chem istry aw ards, the American Institute of Chem ists, and the American Chemical So ciety award. M rs. Pete Baldwin and two children of Warrenton and M r. Jack Davis of San A n t o n i o , Texas are visiting Mr. and M rs. Charlie Baldwin. M rs. Ruth Sanderson, M rs. Roy Lucado and M rs. Malcoln Inge are visiting Mr. and M rs. Gordon Squire in Winchester. They plan a tour of Pennsy lvania before returning home. M r. Billy Webber is improv ing after undergoing surgery at Duke Hospital. Dr. John C. Hinchcliff and family will be leaving July 1 to make their home at Hamp- den-Sydney. He has served as pastor of Beale Memorial P re"}, "highlight": {"text": {"matched_tokens": ["J", "e", "Richardson", "E"], "snippet": "Mr. and M rs. <mark>J</mark> a m <mark>e</mark> s <mark>Richardson</mark>. Mr. Frank Lee <mark>E</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "e", "Richardson", "E"], "snippet": "Mr. and M rs. <mark>J</mark> a m <mark>e</mark> s <mark>Richardson</mark>. Mr. Frank Lee <mark>E</mark>"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [170.65, 1886.77, 302.66, 1929.2], "bbox_id": "3794072a3d", "file": "AppomattoxNewspapers_1898-1902a_0219.pdf", "page": 1, "text": "m o t e l NATIONAL, J - M. RICHARDSON 1 , 9M Main Street, Lynchburg, Va Ol cr Lynchburg Rational hank."}, "highlight": {"text": {"matched_tokens": ["e", "J", "RICHARDSON"], "snippet": "m o t <mark>e</mark> l NATIONAL, <mark>J</mark> - M. <mark>RICHARDSON</mark> 1 , 9M Main Street, Lynchburg, Va Ol cr Lynchburg Rational hank."}}, "highlights": [{"field": "text", "matched_tokens": ["e", "J", "RICHARDSON"], "snippet": "m o t <mark>e</mark> l NATIONAL, <mark>J</mark> - M. <mark>RICHARDSON</mark> 1 , 9M Main Street, Lynchburg, Va Ol cr Lynchburg Rational hank."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1813.45, 1340.43, 1983.45, 1460.33], "bbox_id": "66ab5513c6", "file": "AppomattoxNewspapers_1955-1957a_0035.pdf", "page": 1, "text": "Funeral services were conducted Dec 4 at 2 P. M. from the Midway Baptist Church, by the Rev. W. E. Donald. Special music was provided by Mrs. Donald. Pallbearers were J H. Ranson, C. E. Richardson, D. C OBrien, S. E. Ranson, C. E. Leffel and L. E. Dickerson. Honor ary pallbeaerrs were members of the Mens Bible Glass of Rocks Baptist Church. Interment was in the Rocks Baptist Church Cemetery."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Mrs. Donald. Pallbearers were <mark>J</mark> H. Ranson, C. <mark>E</mark>. <mark>Richardson</mark>, D. C OBrien, S."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Mrs. Donald. Pallbearers were <mark>J</mark> H. Ranson, C. <mark>E</mark>. <mark>Richardson</mark>, D. C OBrien, S."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1950.68, 687.93, 2126.07, 947.32], "bbox_id": "a66ad10cea", "file": "AppomattoxNewspapers_1960-1962b_0196.pdf", "page": 1, "text": "Mrs. Nellie Carson Richardson Kress, 49, of Pamplin, died in Vir ginia Baptist Hospital at 4 A. M Tuesday after  an illness of one day. A former employee of the Pamolin Dress Co., she was bom in Appomattox County, June 13 1911, daughter of Hehnan and Frances Ferguson Richardson. She was a member qf Piney Ridge Methodist Church. She iii survived by her husband, .Greorge W. Kress two sonSj Ralph Kress and Raymond Kress bf J Pamplin one brother, C E. Richardson of Pamplin three sisters, Miss Alvah Richardson Mrs. Herbert Burrell and Mrs, Frank Ouimby, all of Pamplin. Fun eral services were held- Wednedav 26 th at Piney Ridge Methodist Church. Services were conducted by Rev. C. P. Price. Active paDbeagers were Lloyd R,?ichardrion, Haumam Richardson, Otis Richardson, Mark Hipps, Tommy Mays, Jim Lee."}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "and Raymond Kress bf <mark>J</mark> Pamplin one brother, C <mark>E</mark>. <mark>Richardson</mark> of Pamplin three sisters,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "and Raymond Kress bf <mark>J</mark> Pamplin one brother, C <mark>E</mark>. <mark>Richardson</mark> of Pamplin three sisters,"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1094.66, 545.68, 1237.62, 686.73], "bbox_id": "127786c7e2", "file": "AppomattoxNewspapers_1962-1965a_0105.pdf", "page": 1, "text": ", control as well as forest manage ment practice are Appomattox j High   Charles Doss, Kenneth  Richardson, E d w i n Stanley, Acery Dalton, G. H. Jamerson, Jr., Henry C. Moore, Kenneth Goin, James Garrett, Lonnie Rey nolds, Jr., Lewis Cheatham, Cecil Deaner, Ashby A. Wright, Glenn Martin, Jr., Wendell E. Maddox, Harold Carter, Marshall, Wayde Cheatham, Herbert Shirey, James Millner, Larry Doss, Edgar Cov ington, Raymond Mullins, Sam- mie Stanley, Bruce Paulette,"}, "highlight": {"text": {"matched_tokens": ["j", "Richardson", "E"], "snippet": "ment practice are Appomattox <mark>j</mark> High   Charles Doss, Kenneth  <mark>Richardson</mark>, <mark>E</mark> d w i n"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Richardson", "E"], "snippet": "ment practice are Appomattox <mark>j</mark> High   Charles Doss, Kenneth  <mark>Richardson</mark>, <mark>E</mark> d w i n"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1481.25, 1055.27, 1588.45, 1190.16], "bbox_id": "c1c1cdf890", "file": "AppomattoxNewspapers_1971-1973a_0223.pdf", "page": 1, "text": "le wedding of Miss Margar- lou Richardson to James R. Is will be an event of Satur- J evening at 8 oclock at V Ridge Methodist Church. Is s Richardson is the liter of Mr. J. E. Richard- f Pamplin. Mr. Davis is the lof Mrs. Wesley Hamlett of Jilin, and James R. Davis, Ikton, Va. iends and relatives arein- No invitations have been"}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "E"], "snippet": "Methodist Church. Is s <mark>Richardson</mark> is the liter of Mr. <mark>J</mark>. <mark>E</mark>. Richard- f Pamplin. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "E"], "snippet": "Methodist Church. Is s <mark>Richardson</mark> is the liter of Mr. <mark>J</mark>. <mark>E</mark>. Richard- f Pamplin. Mr."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1818.94, 1258.0, 2007.11, 1495.29], "bbox_id": "0a2b9661f7", "file": "AppomattoxNewspapers_1955-1957a_0590.pdf", "page": 1, "text": "According to toe Appomattox County ASiC Office, nominations for Community Committeemen and delegates to the County ASC Con vention have been made by the Community Election Boards for the forthcoming committee elections on October 8. Nominations for each community E. are as follows  Clover Hill Community Jack Cawthorn, Edward McPihil- lips, A. W. Covington, Tip Paulette Billy Ferguson, J. F. Ranson, R. E. Fore, Jim Richardson, R. S. Frank lin, Monroe Webb. Southside Community Edward Cheatham, Fred II. Jones, E. R. Ferguson, W. V. Jones, Floyd Flesh man, E.   . Marshall Jr., C. C. Harvey. Carter Martin, E. W. Jones, C. S. Rush. Stonewall Community A nhrev Moorcv"}, "highlight": {"text": {"matched_tokens": ["J", "E", "Richardson"], "snippet": "Tip Paulette Billy Ferguson, <mark>J</mark>. F. Ranson, R. <mark>E</mark>. Fore, Jim <mark>Richardson</mark>, R. S. Frank lin,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E", "Richardson"], "snippet": "Tip Paulette Billy Ferguson, <mark>J</mark>. F. Ranson, R. <mark>E</mark>. Fore, Jim <mark>Richardson</mark>, R. S. Frank lin,"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1971.85, 1228.79, 2133.66, 1537.88], "bbox_id": "32ba1b2447", "file": "AppomattoxNewspapers_1902-1905a_0368.pdf", "page": 1, "text": "PRECINCT WORKERS FOR MAY 8 - VILLE PRECINCT. C. I. Taylor, Allens Level. ! A. J. Bondurant, Greyburn. C. D. McCraw, Enonville. Jas. L. Baird, Garretts. W. H. Spencer, Malone. CURDSVILLE. W. E. Bailey, Curdsville. W. E. Garnett,  Joe Cox,  M. C. Richardson, Rival. J. N. Crute, Curdsville. WRIGHTS. I W. R. Moore.  J. E. Carter. A. C. Wood, Jr. Chas. Carter. T. J. E. Robinson. s p e n c e r  s s t o r e . Jno. A. Twyman, Wily. Henry Moorman, Brierhoox Clifford C. Wright, Ashley Spencer, Willie Watson, Toga. GLENMORE. E. N. Miles. George R. Patteson. Douglass OMahundro. P. P. Glover. H. M. Harris."}, "highlight": {"text": {"matched_tokens": ["E", "Richardson", "J"], "snippet": "E. Bailey, Curdsville. W. <mark>E</mark>. Garnett,  Joe Cox,  M. C. <mark>Richardson</mark>, Rival. <mark>J</mark>. N. Crute, Curdsville. WRIGHTS."}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Richardson", "J"], "snippet": "E. Bailey, Curdsville. W. <mark>E</mark>. Garnett,  Joe Cox,  M. C. <mark>Richardson</mark>, Rival. <mark>J</mark>. N. Crute, Curdsville. WRIGHTS."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1513.45, 604.7, 1779.99, 886.89], "bbox_id": "4f08f83b4e", "file": "AppomattoxNewspapers_1947-1949a_0487.pdf", "page": 1, "text": "Mrs. L. M. Southall was hostess to the W. M. S. of Elon Baptist Church last Wednesday. I Black, of Rich-  ev. and  rs Sam Harwood  her vacation with Victoria spent last week-end with lev. and Mrs. W. aild Mrs- E W. Harwood. j Mr. and Mrs. Herbert Richardson s in the home of and Appomattox were re- H. McCah we?e cu!lt 8uests of the formers par- . Ponton, of Rich- euU Mr. a,ld Mrs. Wiley Richard- Irs. A, J. Ponton, j S011, Mr. and Mrs. A. Newport News Liberty Chapel P. Lucado, Mr. jado, Mr. and Mrs.! ______ family, Mr. and nby and daugh-1 Liberty Chapel, June 14.- Mrs. J. fcbby Lucado were P. Leitner and Mrs. Percy Garrett le of Mr. and Mrs.1 spent several days last week at- lichmond last Sun-1 tending the annual house warming i o-f the W. M. U., which was held  at Fork Union. in the home of Ar were Mr. and  of Roanoke. Mrs. ! g this week with"}, "highlight": {"text": {"matched_tokens": ["E", "j", "Richardson"], "snippet": "Mrs. W. aild Mrs- <mark>E</mark> W. Harwood. <mark>j</mark> Mr. and Mrs. Herbert <mark>Richardson</mark> s in the home"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "j", "Richardson"], "snippet": "Mrs. W. aild Mrs- <mark>E</mark> W. Harwood. <mark>j</mark> Mr. and Mrs. Herbert <mark>Richardson</mark> s in the home"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1755.85, 450.23, 1928.25, 598.98], "bbox_id": "3ccc604875", "file": "AppomattoxNewspapers_1960-1962b_0166.pdf", "page": 1, "text": "Miss Ruby J. Richardson daughter of Mr. and Mis. Clarence E. Rich ardson of Pamplin and Joseph L. Almond of Pamplin were married Friday September 2nd at 8 Oclock, at Rocks Baptist Church. The Rev. Winfred Eider . per formed th e . ceremony. Miss Christine Dickerson and Otis K. Richardson were the attendants. The bride wore a light blue, suit with matching accessories. After a short trip Mr. and Mrs. Almond will make their home in Pamplin."}, "highlight": {"text": {"matched_tokens": ["J", "Richardson", "E"], "snippet": "Miss Ruby <mark>J</mark>. <mark>Richardson</mark> daughter of Mr. and Mis. Clarence <mark>E</mark>. Rich ardson of Pamplin"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Richardson", "E"], "snippet": "Miss Ruby <mark>J</mark>. <mark>Richardson</mark> daughter of Mr. and Mis. Clarence <mark>E</mark>. Rich ardson of Pamplin"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [452.4, 1431.13, 2538.1, 1727.51], "bbox_id": "a1d91db849", "file": "AppomattoxNewspapers_1915-1918a_0238.pdf", "page": 1, "text": "Kit sample hoe House contemplate. Death Of Mrs. Nannie E. Layne Mrs. Nannie E. Layne, wid ow of the late William H. Lay ne, died last night at 730 oclock at the home of her daughter, Mrs D. N. Williams, in West Lynchburg, following a lingering Hness. Mrs. Layne was born in Ap pomattox county and was in her seven ty-seventh year. She is survived by one broth er, J. W. Richardson, of Pamp lin and t !e following sons and daughters Mrs. W. 8 . Sholes, Mrs. C. P. Williams, and Mr. M A. Layne, of this city Rob ert D. Laynj, of Blackstone, and E. L. Layne, of Appomat tox also an adopted daughter, Mrs. Sterling Day, of this city. She is survived by twenty- one grandchildreu and seven g r e a t grandchildren.Thurs day Lynchburg New,"}, "highlight": {"text": {"matched_tokens": ["J", "Richardson", "e"], "snippet": "by one broth er, <mark>J</mark>. W. <mark>Richardson</mark>, of Pamp lin and t !<mark>e</mark> following sons and daughters"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Richardson", "e"], "snippet": "by one broth er, <mark>J</mark>. W. <mark>Richardson</mark>, of Pamp lin and t !<mark>e</mark> following sons and daughters"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2188.3, 604.49, 2349.9, 675.34], "bbox_id": "cf8c5f492e", "file": "AppomattoxNewspapers_1933-1936a_0111.pdf", "page": 1, "text": "J e f f r y , ---- . erfee, Ella Richardson, Lucy trpoiij  Gdnovievd Mdselfeirl  . , Buckingham John Sphcefr, Mtos es Emm G. Glover, Frahoes Bar bell, i Carrie Fitzgerald, Louise Gal vih, Minnie Wdod, Maiy E. Gloirdr, Mable Swope Gertrude Sadler."}, "highlight": {"text": {"matched_tokens": ["J", "e", "Richardson"], "snippet": "<mark>J</mark> <mark>e</mark> f f r y , ---- . erfee, Ella <mark>Richardson</mark>, Lucy trpoiij  Gdnovievd Mdselfeirl"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "e", "Richardson"], "snippet": "<mark>J</mark> <mark>e</mark> f f r y , ---- . erfee, Ella <mark>Richardson</mark>, Lucy trpoiij  Gdnovievd Mdselfeirl"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [560.17, 635.07, 852.59, 693.34], "bbox_id": "2b821a2cbf", "file": "AppomattoxNewspapers_1962-1965a_0012.pdf", "page": 1, "text": "ii  viiuu  e t  I v   Mrs. Herbert Richardson and j were baptized. After the baptiz family, from Oakville, Mr. and ing service a special sernton was Mrs. L. L. Dickerson. -  delivered by the pastor and the Sunday visitors in the home of ! right hand of fellowship was given and the Lords supper was"}, "highlight": {"text": {"matched_tokens": ["e", "Richardson", "j"], "snippet": "ii  viiuu  <mark>e</mark> t  I v   Mrs. Herbert <mark>Richardson</mark> and <mark>j</mark> were baptized. After the"}}, "highlights": [{"field": "text", "matched_tokens": ["e", "Richardson", "j"], "snippet": "ii  viiuu  <mark>e</mark> t  I v   Mrs. Herbert <mark>Richardson</mark> and <mark>j</mark> were baptized. After the"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [560.9, 950.77, 2256.74, 1057.99], "bbox_id": "a8c6651cdd", "file": "AppomattoxNewspapers_1949-1952a_0132.pdf", "page": 1, "text": "omattox and 60 degrees i Hodges, of Winchester, ind Matron of the Grand Virginia, O. E. S., was  night of the Appomat- Member Federal Deposit Insurance Corporation Idred Richardson, Mrs. tnd Mrs. J. H. Lucado at- ! O. E. S. meeting Tues- at Pamplin."}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "E"], "snippet": "Deposit Insurance Corporation Idred <mark>Richardson</mark>, Mrs. tnd Mrs. <mark>J</mark>. H. Lucado at- ! O. <mark>E</mark>. S. meeting Tues- at"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "E"], "snippet": "Deposit Insurance Corporation Idred <mark>Richardson</mark>, Mrs. tnd Mrs. <mark>J</mark>. H. Lucado at- ! O. <mark>E</mark>. S. meeting Tues- at"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.43, 261.51, 2177.49, 1013.82], "bbox_id": "f3c48b4b45", "file": "AppomattoxNewspapers_1971-1973a_0178.pdf", "page": 1, "text": "Mr. and Mrs. Robert Carter Harris attended the Christmas Festival of Music at William and Mary College, Williams burg, Virginia.    Christmas guest of Mr. and Mrs. Robert S. Harris were Miss Mary Moore of Asheville, North Carolina, Mr. and Mrs. James G. Redford of Lynchburg, Misses Nancye and Caroline Moore of Richmond and Mr. and Mrs. John R. Doyle of the Citadel, Charleston, South Car olina.    Mr. and Mrs. Robert S. Har ris entertained with a Christ mas dinner, Sunday evening, December 26th. Those present were Mr. and Mrs. C. W. Har ris of Farmville, M isses Nan cye and Caroline Moore of Richmond, Mr. and Mrs. Ro bert Carter Harris, Mr. Leslie Harris and Miss Ruth Harris. Mrs. Elizabeth Harris of Rich mond, Miss Mary Moore of Ash eville, N. C., Mr. and Mrs. James G. Redford of Lynchburg, Mr. and Mrs. Robert E. Floyd, and Bobby and Betsy Floyd of Charlotte, North Carolina.     Mrs. Irvin C. Moses and ne phew, Barksdale Spiggle visited her brother-in-law and sister, Mr. and Mrs. C. B. Page and Rose one day last week. We are glad to know Mrs. Page is get ting on nicely since her return from the hospital on December 23.    - Mr. and Mrs. R. B. Spiggle, Mrs. Irvin C. Moses, Mrs. Ed die L. Thomas and Mrs. Maxine Bryant visited M isses Lula and Clara Moses one evening re cently.    Mr. and Mrs. Francis Tyler have had as guests for dinner during Christmas week Mrs. C. L. Burgess, Miss Mildred Bur gess, Mr. and Mrs. C. L. Bur gess, Jr., Miss Leah Bright- well, Miss Jean Daniel, Mr. J. O. Richardson, Jr., of Lynch burg Mrs. William E. Williams of Snowden, Mrs. Lee Tucker of Alexandria, and Mrs. Catherine Virnston of Silver Spring, Md.    Mrs. Johnny Harris, of Rich mond, spent a few da vs last week with her grandfather and moth er, Mr. Wesley Stanley and Alice. She also visited with her mother-in-law, Mrs. Lucy Har ris, of Farmville."}, "highlight": {"text": {"matched_tokens": ["J", "Richardson", "E"], "snippet": "Miss Jean Daniel, Mr. <mark>J</mark>. O. <mark>Richardson</mark>, Jr., of Lynch burg Mrs. William <mark>E</mark>. Williams of Snowden, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Richardson", "E"], "snippet": "Miss Jean Daniel, Mr. <mark>J</mark>. O. <mark>Richardson</mark>, Jr., of Lynch burg Mrs. William <mark>E</mark>. Williams of Snowden, Mrs."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [528.93, 194.09, 677.03, 556.88], "bbox_id": "3fa431d849", "file": "AppomattoxNewspapers_1962-1965a_0368.pdf", "page": 1, "text": "j below Chief Forest Wardfen. David Smith, 352-5355. Patrol- p . B. Garrett, 352-5850 Lookout Watchman, L, C. Garrett, 352- 2249 tower Local Wardens Evans Ferguson, Floyd Martin, Pamplin 248-2158, J. Lyle Moore Concord WY 3-2521 and 8276, I Herbert Shirey, Spout Springs, 1 3-2543, Malcolm Coleman, Pamp lin 248-4212, Russell Conner, Ap jpomattox 352-6153, Shelton Rou- ton, Concord WY 3-2384, Floyd jFtesftman. Pamplin 248-1543 Carl Ferguson, Pamplin 248-4158, ! Courtney Harvey, Berkley Garx- I ett. 332-5850. Everett Ferguson, 352-5088 Bonnie Reynolds, GTad- I Stone 933-6734, James Phelps, J. G. Franklin, 332-6822, W F. Burge, Jr., Concord W Y3-2620, Harold Jones, Spout Springs 352 6479, Jack S. Caldwell, Spout Springs w rr 3-2332, E . W. Mar shall, Spout Springs, 35255813  G. L. Jennings, Prospect, John A. Martin, Gladstone, Va. W. A. Woodson, 352-5178, W. H. Carter, James Richardson, Pamplin 248- 2352, H. B. Pack, 352-3654, J. E . Handy, Harry St. John, Pamp lin- 2482271, Hi E. Torrence, 352- 6150, Henry Mann 352-5064, W. H. Cheatham, 352-6288, W. H. Haneoek, 352-5391, Thomas C. Jamerson, Pamplin 248-4843, and 248-4304, Jack Cawthome, 352- 8318 Herbert Ferguson, 352 2427 1 mile"}, "highlight": {"text": {"matched_tokens": ["Richardson", "J", "E"], "snippet": "W. H. Carter, James <mark>Richardson</mark>, Pamplin 248- 2352, H. B. Pack, 352-3654, <mark>J</mark>. <mark>E</mark> . Handy, Harry St. John,"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "J", "E"], "snippet": "W. H. Carter, James <mark>Richardson</mark>, Pamplin 248- 2352, H. B. Pack, 352-3654, <mark>J</mark>. <mark>E</mark> . Handy, Harry St. John,"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1852.81, 1125.98, 2019.55, 1480.88], "bbox_id": "594ddfe26d", "file": "AppomattoxNewspapers_1922-1923a_0290.pdf", "page": 1, "text": "Buckingham Couple M arried A pretty home weeding took place at the residence of Mr. and Mrs. J. V, Inge, 607 Gnm street the bride Hiss Larkie Fuqna Wright, daugh ter of Mr. W. H. Wright, of Buck ingham county, has been a visitor at Mr. Inges for some time past, and in the presence of a number of Iriends she was married to Mr. Charles Stewart Spencer, who is I!rom the same county, bnt is now mployed as a conductor on the ! Norfolk and Western between Roa noke and Binefleld. The ceremony was preformed by Rev. J. K. Sevier, las tor of the Third Presbyterian Cbnrofa, and the attendants were Hisses Lucy Richardson and Myrtle Coffee and Messrs. E, 8. and J. W. Inge. The bride was charmingly attired in a gray silk prinoess, with hat and gloves to mated. After receiving the congratulation of friends Mr., and Mi s. Spencer took the afternoon train for Binefleld, where they will molsp their home. Lynchburg News."}, "highlight": {"text": {"matched_tokens": ["Richardson", "E", "J"], "snippet": "attendants were Hisses Lucy <mark>Richardson</mark> and Myrtle Coffee and Messrs. <mark>E</mark>, 8. and <mark>J</mark>. W. Inge. The bride"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "E", "J"], "snippet": "attendants were Hisses Lucy <mark>Richardson</mark> and Myrtle Coffee and Messrs. <mark>E</mark>, 8. and <mark>J</mark>. W. Inge. The bride"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.45, 1389.31, 2453.88, 1749.2], "bbox_id": "b023054f18", "file": "TimesVirginian_1981a_0368.pdf", "page": 1, "text": "PoalO. Doss Anderson Scraggs Richard Loo Martin Virghdn L. Woody Herman Woody Essie Emmon Jhn Roach Junior Puckett Cocfl J. Rome R. F. Berko, III Dobra S, FlCyd Allen Mayberry Robert I. Scon, Jr. Virginia E. Rrarnmn J. R. Davidson  Norman F. Watson EKjoh Major Richardson Robert A. Ayers Wilson A. Gowia Lassie H. Gowia Horace W. Shiny Hugh Tipton Johnson Mario S. Shiny Florence M. Reason S. E. Ransoa Sand n Elder W .Estea Harvey lacMo A. Harvey Warren E. Baldwin Viola R. Franklin"}, "highlight": {"text": {"matched_tokens": ["E", "J", "Richardson"], "snippet": "I. Scon, Jr. Virginia <mark>E</mark>. Rrarnmn <mark>J</mark>. R. Davidson  Norman F. Watson EKjoh Major <mark>Richardson</mark> Robert A. Ayers Wilson"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "Richardson"], "snippet": "I. Scon, Jr. Virginia <mark>E</mark>. Rrarnmn <mark>J</mark>. R. Davidson  Norman F. Watson EKjoh Major <mark>Richardson</mark> Robert A. Ayers Wilson"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2088.01, 263.01, 2371.39, 557.85], "bbox_id": "7250035682", "file": "AppomattoxNewspapers_1962-1965a_0318.pdf", "page": 1, "text": "Mary Libby and Joyce were guests in the home of Mr. and arrived at the home of Mr. and Mrs. Jim Richardson during the Mrs. E. A. Covington Christmas Christmas holiday. j day. On Thursday they and the ---------------------- Covingtons motored to Pompana WT  Beach, Fla. to visit Mrs. Cov- I l l X D l i r S tegtons siser, Mrs. Virginia 3  Luppy and her brother and sis- 1 ter-in-law, Mr. and Mrs. Rufus Seaman 1st Class Michael Lair cawthorn. of Norfolk, returned Saturday after spending seven days with  Do J his parents. Cmdr. and Mrs. P. to and Mrs. -Joyce Patterson jl and daughter, Jane, of Altavista, Mr. Joe Wright, of New York, Mr and Mrs N. Y spent from Christmas Dav until Saturday with Cmdr. and Dinner guests of Mr. and Mrs. Mrs. P. H. Lair. On Dec. 26h. J A- Carson Thursday evening Pat Lair flew to Miami for a were Mr- and Mr8- Walter Car- weeks vacation son and family, of Appomattox, Mr. and Mrs. Edwin Alley, of 8111 Mrs- Carsons parents, Mr. Norfolk, spent the holidays with and Mrs. J. R. Barnett, of Blue- his parents, Mr. and Mrs. F. M. fiRL W. Va., and Dr. and Mrs. Alley. Joe Alsop and family, of Corpus Private Henry Earl Covington, Chrlsti, Texas. The Alsops also of Fort Gordon, Ga arrived spent Thursday and Friday nights home Dec. 20th and will be on Correction Mr. and Mrs. Joe leave until Jan. 2. Goins new daughter Is named Mrs. Henry Covington is still P8gy Jane instead of Patsy confined to her room. Kary as was periously stated. Mr. and Mrs. William Hix and T16 correspondent regrets the fam ilv. Ja n e t Hix and Mrs. Ru- error."}, "highlight": {"text": {"matched_tokens": ["Richardson", "E", "j"], "snippet": "Mr. and Mrs. Jim <mark>Richardson</mark> during the Mrs. <mark>E</mark>. A. Covington Christmas Christmas holiday. <mark>j</mark> day. On Thursday they"}}, "highlights": [{"field": "text", "matched_tokens": ["Richardson", "E", "j"], "snippet": "Mr. and Mrs. Jim <mark>Richardson</mark> during the Mrs. <mark>E</mark>. A. Covington Christmas Christmas holiday. <mark>j</mark> day. On Thursday they"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1001.29, 617.57, 1167.69, 656.62], "bbox_id": "c56e74dc05", "file": "AppomattoxNewspapers_1949-1952a_0501.pdf", "page": 1, "text": "j and Mrs. R. E. McClenny. Mr. and Mrs. Herbert Richardson I and daughter, Betty Jane, of Appo-  mattox were recent guests in the"}, "highlight": {"text": {"matched_tokens": ["j", "E", "Richardson"], "snippet": "<mark>j</mark> and Mrs. R. <mark>E</mark>. McClenny. Mr. and Mrs. Herbert <mark>Richardson</mark> I and daughter, Betty Jane, of Appo-  mattox were recent guests in the"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "E", "Richardson"], "snippet": "<mark>j</mark> and Mrs. R. <mark>E</mark>. McClenny. Mr. and Mrs. Herbert <mark>Richardson</mark> I and daughter, Betty Jane, of Appo-  mattox were recent guests in the"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1782.96, 981.27, 1960.96, 1734.31], "bbox_id": "73c0f3dc59", "file": "AppomattoxNewspapers_1943-1947a_0383.pdf", "page": 1, "text": "Ghe following have been re leased from ths service Harry D. Baldwin James W. Wheeler Daniel- A. Tanner John R. Lawson, Jr. Clovis I S. Anderson William W. Ford Jr. Archie C. McCann Alfred S. Puckett Claudy J. Ryan Char es ,T.-Moses Jr. James E. Maxwell Nathaniel L. Ferguson James E. Tweedy George R Hughes William h. Richardson Walter If. Routon Will iam Di. - Oarrico Roy W. Warriner Robert D. Hunter William S. Moses Eugene H. Franklin John W. Routt Don Moses Jr. Charlie L. Kidd LeRoy P. Smith Hubert L. .Price Oscar L. West Carl A. Hash Embra T. Davis Clarence F. Perdue Richard N. Jones Maynard G. OBrien Elwyn E. Megginson John W. Harris Paul E. Gilbert Maurice E. Gordon Edward L. Jones George W. Stevens Eugene E. Turner Randolph P. Marsh Peter C. Flood Floyd E. McFadden Herman W. .Harvey Monroe J. Kelso James J. Richardson John J. Ligon  Herbert B. Lucado Robert L. Lea Jr. Malcolm A. Booker John C. Stanley Willie B. Hlarvey Robert D. Watkins Douglas S. MacKetizie Paul S. Childers Hubert C. Wilkes James Wilson Franklin Floyd James Trent David Clement Coleman Lloyd Banks Robertson Willie M. Thornton Ra.-mon i A. Coleman Byron B. Cole James C. Puckett George W. Evans Clarence W. Redding Stratton H. Franklin Aubrey L. Doss Jr. Earl H. Dickenson    Robert I.  Scott Jr. Johnnie W, Pillow Paul W, McCoy William Ci Hubbard, ffhe following white registrants were recently inducted Ster i !.. Vaughan Charles C. Patterson Walter H. Elmer Wilmer."}, "highlight": {"text": {"matched_tokens": ["E", "J", "J", "J"], "snippet": "Peter C. Flood Floyd <mark>E</mark>. McFadden Herman W. .Harvey Monroe <mark>J</mark>. Kelso James <mark>J</mark>. Richardson John <mark>J</mark>. Ligon  Herbert"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "J", "J", "J"], "snippet": "Peter C. Flood Floyd <mark>E</mark>. McFadden Herman W. .Harvey Monroe <mark>J</mark>. Kelso James <mark>J</mark>. Richardson John <mark>J</mark>. Ligon  Herbert"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2249.31, 1405.03, 2409.97, 1618.53], "bbox_id": "5cb25f1036", "file": "AppomattoxNewspapers_1892-1898a_0040.pdf", "page": 1, "text": "B r i s t o l , V a ., Maroh 15.The Auroral services of Dr. E. E. Wiley were at tended by many people at Emory and Henry College today. Dr. W. G. E. Cunningham, of Nashville, Dr. Frank Richardson, of Knoxville, Dr. J. S. Ken nedy, of Marion, and Prof. E. Longley, of Emory made short talks. Judge Cassell of Radford, today banded down hto decision In the cate of EUyson vs. H. J. Simon. The object of the suit was to have the assignment and homestead deeds of Simon set aside on the grounds that they were fraudulent. The complainant claimed that Simon was living on the Tennessee side and conducting hto business on the Virginia side, and that he moved into Virginia jnst before making his assign ment, In order to receive the benefit of the Homestead tow, JndgeCaasell heard the argument in the caae laat term of the Hustings court, Jndge Rhea being in competent on account of consanqninity."}, "highlight": {"text": {"matched_tokens": ["E", "Richardson", "J"], "snippet": "today. Dr. W. G. <mark>E</mark>. Cunningham, of Nashville, Dr. Frank <mark>Richardson</mark>, of Knoxville, Dr. <mark>J</mark>. S. Ken nedy, of"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Richardson", "J"], "snippet": "today. Dr. W. G. <mark>E</mark>. Cunningham, of Nashville, Dr. Frank <mark>Richardson</mark>, of Knoxville, Dr. <mark>J</mark>. S. Ken nedy, of"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.27, 938.92, 1783.97, 1082.32], "bbox_id": "4d5c00a3eb", "file": "AppomattoxNewspapers_1971-1973a_0282.pdf", "page": 1, "text": "25tli Anni v e r i a r  J- and Mrs. W. Herbert Richardson, of Oakville, were red Sunday, April 9, 1972, with an Open House to cele- f their twenty-fifth wedding anniversary. Hostesses for fcvent were their children, William H. Richardson, Jr. and  Clarence E. Smith. isisting the hostesses were Mrs. J. M. Cobb, Mrs. R. C. IsMrs 0- w- Martin, Jr., Mrs. J. D. Marshall, Miss T Marshall, and Mrs. L. E. Moore. and Mrs. Richardson, who were married on April 5, I, in Appomattox, received many attractive gifts of silver L t?r  ds and neiShbrs who called at their home g the afternoon."}, "highlight": {"text": {"matched_tokens": ["e", "J", "Richardson"], "snippet": "25tli Anni v <mark>e</mark> r i a r  <mark>J</mark>- and Mrs. W. Herbert <mark>Richardson</mark>, of Oakville, were red"}}, "highlights": [{"field": "text", "matched_tokens": ["e", "J", "Richardson"], "snippet": "25tli Anni v <mark>e</mark> r i a r  <mark>J</mark>- and Mrs. W. Herbert <mark>Richardson</mark>, of Oakville, were red"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [168.46, 220.69, 441.84, 813.17], "bbox_id": "28434a8a37", "file": "TimesVirginian_1980a_0417.pdf", "page": 1, "text": "? By CASSIE BALDWIN The budget fdr 1U81 year H eres wishing the wiH be presented. You of the Times-Virgin- should be nere. Ian and his staff and all the Mr. and Mrs. R. E. Roach readers a very M erry were dinner guest of Mrs.  Christmas and a Happy New Cole Arrington last Sunday. - - Rachel Richardson is back W f welcome Susan Me home from the hospital. Fadden into, our fellowship Several more from here and church family last went to Norfolk last Monday came for for the funeral of Carl babtism. . Ranson that same day. ReV, A. M. Taylor left for Congratulations to. Rev. Tenn. for the funeral of Mr. A. M. Taylor who killed a .Clyde Tweed on Thursday, turkey Saturday morning. Sympathy is extended the Six Deacons were elected family in their  foes. A on the Deacon Board Sunday mdnbeir from here also went, night. Three of them will- be The Deacons and Wives ordaihed On Jan 21 at 2 p.m. .attended their Christmas t Rocks Church. Juppe t- in Farmville on The. Mildred Collins Sun- fTjday night. day School Class will have , The Christmas supper for their Christmas supper at me Lewis Dickerson Sunday the church this Saturday vSchool. . Class was in1 night at 6 p.m. Richmond on Saturday The Week .of prayer for night. . Foreign Missions goal of The Rocks Homemakers 1200.00 was reached Sun- had their Christmas Party day night. Bold Goal is with Mary Edith Morris on 2000.00 on towards .that Thursday night. All ex- now. Changed gifts. Delicious - refreshments were served. Laura Lee Stewart Circle pch one received a door will go to Bednars Home for knob Christmas decoration. Adults in Keysville for their A good time was reported. Christmas Party on Tues- 4 Hog killing time again, day. Anyone wishing to go M .T T ,. T i wh them be at church by Tobacco Market last week.  515 p.m. J If Kress entered Kathrine Dickerson spent Lynchburg General Hospital Sunday night with Margaret Sunday afternoon and is in Tolley who is not so well, intensive care. Mr. and Mrs. Toby Inge V A Came out wiU 8 t0 Southwest. Va. for the Sunday services, today for a funeral of a y,slto out also- cousin there. Sympathy is The Christmas Cantata at extended them in the death Rocks wdl be on Dec. 14 at 7 f a lovejd one. ihe Star  tl,e Mr- and Mrs. C. E. Cradle by the Ad wit Choir. Richardson will havetheir j  The cbwdren s Christmas daughter, Nancy of Connect- program and party at Rocks cut to spend Christmas with  D e e . 17 at 7 p.m.  them. v The Refugee committee of It was good to see Mrs. Group I had a meeting at Margaret Marshall back at Rocks on Sunday afternoon, church on Sunday.  Business meeting at 7 Farmers have started p.in. on Wednesday night, their fall plowing."}, "highlight": {"text": {"matched_tokens": ["E", "Richardson", "j"], "snippet": "Mr- and Mrs. C. <mark>E</mark>. Cradle by the Ad wit Choir. <mark>Richardson</mark> will havetheir <mark>j</mark>  The cbwdren s Christmas"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Richardson", "j"], "snippet": "Mr- and Mrs. C. <mark>E</mark>. Cradle by the Ad wit Choir. <mark>Richardson</mark> will havetheir <mark>j</mark>  The cbwdren s Christmas"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2169.4, 942.04, 2490.0, 1077.23], "bbox_id": "d9e3404bd1", "file": "AppomattoxNewspapers_1892-1898a_0388.pdf", "page": 1, "text": "Write for a book of Testimonials or call ou HcKINNEY  MOSES, West Appomattox, Va. J RICHARDSON  D A V ID SO N ,-Fanfll, Va. J Y. PHILIP, Rice Depot, Va. Wmm E. F. DANIEL  SONS, S i  to, Va.   1 COLUMBIA PUM lOe,, M l k , Vai"}, "highlight": {"text": {"matched_tokens": ["J", "RICHARDSON"], "snippet": "MOSES, West Appomattox, Va. <mark>J</mark> <mark>RICHARDSON</mark>  D A V ID"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "RICHARDSON"], "snippet": "MOSES, West Appomattox, Va. <mark>J</mark> <mark>RICHARDSON</mark>  D A V ID"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [193.71, 316.76, 981.27, 814.54], "bbox_id": "61d264ccee", "file": "AppomattoxNewspapers_1908-1909a_0351.pdf", "page": 1, "text": "WOODLAND PAMPLIN GIANT STRIDES A D E IN AIR TRANSPORT Improved Uniform International There were quite a number baptised at Elott Baptist Church Sunday a. m., as a re sult of the Carey Barker meet ing. Rev. and Mrs. J. E. White have returned home after a pleasant vacation.  Mrs. J. S. Dorsey and daugh ters, Virginia and Bettie, have returned home after  a long visit to Oxford, Monroe and other places of interest in N. C. Mrs. Wiley Richardson had as her guests, her mother, Mrs, J. J. Fore, and daughter, Mrs. Joe Cobbs, of Darlington Hgts. The Womans Missionary So ciety! of Baptipt Church met Wednesday. Subject for dis cussion was the The Respons ibility of Women an interest ing program was rendered. Messrs. Henry and Will Booker and sister, Mrs, Buck Binford, attended the funeral of Mrs. Richard Booker in Lynchburg last Saturday. Mrs. Booker was spared many years having reached the age of 88 years.. She was the wife oi the deceased Rev. Richard E. Booker, who was a faithful minister of the gospel for many years having spent a.great pari of his life as pastor of a group of churches in Campbell Coun ty. Mrs. Booker leaves to"}, "highlight": {"text": {"matched_tokens": ["J", "E"], "snippet": "ing. Rev. and Mrs. <mark>J</mark>. <mark>E</mark>. White have returned home"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "E"], "snippet": "ing. Rev. and Mrs. <mark>J</mark>. <mark>E</mark>. White have returned home"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
