{"document": {"bbox": [2394.25, 1190.68, 2559.45, 1688.12], "bbox_id": "45cb8dd959", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "wm broughttwfore themeetina and broughtbefore the meeting and accepted the nomination. He a m that he wm Democrat, and would do his utmost to scour a victory for the Democratic patty in this oontest and if elected would render the beat service in his power to the people of the Bounty, Speeches were then made by H. D. Flood, T. J. Stratton, J. W. Flood, W, J. Trent, J. H. Abbitt, and Dr. Morton. All of these gen tlemen regretted the attitude of Mr. Peers in this contest and urged Upon all Democrats the duty of support ing the nominees oi the meeting. Dr. Morton said that he wm a Peers man before the nomination, butneup he was lo t the namiaeek AbbHt H. D. Flood gave a history of the consideration shown Mr. Peers, by the Democratic committee before they decided to have  nomiaatim deferring action in defacenoe to lb wishes until our opponents hud pot a ticket in the field, and of the num ber of proposition made h ty Mr. Abbitt, by which Peers ooulu have become the Demoorotie nomi nee all of which he declined, life. - Flood said if the party desmed fo  maintain its organisation and ft self-respect and n tein the resptetef jrave and true men, there was but one course and that wm the course pursued by the party. the full ticKet put in the field by the meeting would be elected, but if it went down in defeat it would have the respect alike of M end ipd fori The meeting then adjourned amid .great enthusiasm. a"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "W", "J"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Flood, <mark>W</mark>, <mark>J</mark>. Trent,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "W", "J"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Flood, <mark>W</mark>, <mark>J</mark>. Trent,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2393.48, 1194.26, 2565.18, 1667.71], "bbox_id": "55fc084361", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "tbat he was a Democrat, and would do his utmost to secure a victory for the Democratic party in this contest and if elected wonld render the best service in his power to the people of the eonnty. Speeches were then made by H. D. Flood, T. J. Stratton,. J. W. Flood, W. J . Trent, J. H. Abbitt, and Dr. Morton, All of these gen tlemen regretted the attitude of Mr. Peers in this contest, and urged upon  all Democrats the duty of support ing the nominees of the meeting. Dr. Morton said that he Was a Peers man before the nomination, bnt now he was for the nominee Abbitt. H. D. Flood gave a history of the consideration shown Mr. Peers by the Democratic committee before they decided to harp a nomination, deferring action in deference to his wishes nntil our opponents had pnt a ticket in the field, and of the num ber of propositions made him tty Mr. Abbitt, by which Peers coufT have become the Democratic nisirt nee, all of whioh he declined. Mi, Flood said if the party desired to ! maintain its organization and its self-respect and retain the respect of brave and trne men, there WUShuf r one course and that was the coarse pursued by the party. He believed the full ticxet put in the field by the meeting wonld he elected, hut if  it went down in defeat it wonld hays i the respect alike of friend and fri The meeting then adjouKiMM Mnim. great enthusiasm."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "W", "J"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>,. <mark>J</mark>. <mark>W</mark>. Flood, <mark>W</mark>. <mark>J</mark> . Trent,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "W", "J"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>,. <mark>J</mark>. <mark>W</mark>. Flood, <mark>W</mark>. <mark>J</mark> . Trent,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "B. Thornhill, T. J. <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Cawthorn and R. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "B. Thornhill, T. J. <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Cawthorn and R. L."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [753.07, 819.76, 910.62, 1206.35], "bbox_id": "cc9a05867e", "file": "AppomattoxNewspapers_1898-1902a_0503.pdf", "page": 1, "text": "owing to the late prilli Wheat crops are looking well. 1 said once this spring that all of the fruit was killed, but I find that 1 spoke too fast, as there is fruit on every tree that 1 see. As a peach orchard is a thing of the past, all who are fortunate enough to have some trees are blessed, with the deli cious fxuit. We had a flood in Wreck-Island Greek, causing much damage to land aud crops. It is said to have been the biggest flood that we have had for twenty years. It washed away the bridge over Wreck-Island Creek, near here, on Carsons millpond. It did much damage to Mr. C. H. Cole mans tobacco crop, taking hill, to bacco, and all. It washed away the entire crop of- corn belonging to th iol lowing persons J. W. Stratton, Cliff. Martiu, and E. W. Moore. It did some damage to J. J. Carsons mill, washing out the underpinning. We hear of a good deal of damage all along the creek. . Mr. W. W. Wright is out again, and is able to do some work. Madam liumor says there will be a marriage in this neighborhood at at au early date. We wish the pair much happiness. We hear that a doctor is about to locate near this place We bid him welcome. This letter reached us last week, but too late for prompt pubiicaton"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "th iol lowing persons <mark>J</mark>. <mark>W</mark>. <mark>Stratton</mark>, Cliff. Martiu, and E."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "th iol lowing persons <mark>J</mark>. <mark>W</mark>. <mark>Stratton</mark>, Cliff. Martiu, and E."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [759.83, 216.25, 833.83, 412.04], "bbox_id": "ec025cb1f1", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "J W Carson, J W Stratton, J D Carson, C E Carson, E B Chick, J D llamersly, Thos W Trent, C C Hamersly, N Wr Owen, J N Turner, A D Kyle, Chas Smith, F Smith, E J Marsh, R W Doss, C M Powel, D T Wooldride, T B Carson, W A Paners, Geo T Doss,"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton", "J"], "snippet": "J W Carson, <mark>J</mark> <mark>W</mark> <mark>Stratton</mark>, <mark>J</mark> D Carson, C"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton", "J"], "snippet": "J W Carson, <mark>J</mark> <mark>W</mark> <mark>Stratton</mark>, <mark>J</mark> D Carson, C"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [913.86, 425.1, 1072.86, 812.72], "bbox_id": "3dedcf1cbc", "file": "AppomattoxNewspapers_1898-1902a_0466.pdf", "page": 1, "text": "Howlett. D ear T imes I have been think ing of writing to you for some time but have been otherwise engaged. Now, as Uncle Sam has given us a post, office at this place, I must write and tell you how pioud we are of it it has been a long felt want. We dont have daily mail yet but hope to soon. Mr. Harry Blanks aud his best girl took a flying trip to Amhurst. Miss Emily Thornhills school has closed. Miss Elizabeth Martin is visiting her aunt, Mrs. J. W. Stratton near this place. Air. Wilbur StrattOD does not improve fast. Mr. J. J. Carson is out again and weighs 173. Mr. W. W. Wright has been very sick for the past week wih neural- Alrs. G. Zeigler, who has been at the Virginia Hospital in Richmond for several months, returned to her home in Cumberland county much improved. We hope she will be en tirely wtll soon. We are sorry to learn that Mr. Bunk Page, of Gleufall, has a very sick child. He was for many years a resident of this place. busy preparing their land for crops hope tlieyniay have a bountiful harvest. With every good wish for you, dear T imes , I will close, piomising to gall again."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "visiting her aunt, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Stratton</mark> near this place. Air."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "visiting her aunt, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Stratton</mark> near this place. Air."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [263.29, 474.95, 427.81, 750.9], "bbox_id": "1c7866af4f", "file": "AppomattoxNewspapers_1908-1909a_0187.pdf", "page": 1, "text": "GrandjuryG. D. Wilkerson, J. W. Durrum, R- Cor. Harvey, J. T. Rogers, C. E. Carson, C. M. Stratton Sr., J.N . Woolridge, E. H. Smith, W. H. Morgan, G. A. Scheffler, R. W. Johnson, Jno- C. Moore, Jr. Civil JuryC. T. Cawthorn, James W. Caldwell, HalF. Clark, Wm. D. Hix Jr., J. Robert Doss, G. 0, Gordon, J. L. Burkey, E. T. Mitchell, S. P. Coleman Jr. For Criminal trials  E. J. Marsh, E. C. Scruggs, Ernest Ferguson, J o e W. Davis, J. Baxter Marshall, H. H. Harvey, 0. R. Tames, M. A. Stratton, W. J. Kidd. J . C. Davidson, Luther E. Martin, W. W. OBrien W. Ti Mayberry, W. S. Bryant, T. A. King, W. Thos. Caldwell, H. G. Harding, Wm. J. Walton, B. L. Wheeler, dLO. Davidson."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "R. Tames, M. A. <mark>Stratton</mark>, <mark>W</mark>. <mark>J</mark>. Kidd. <mark>J</mark> . C. Davidson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "R. Tames, M. A. <mark>Stratton</mark>, <mark>W</mark>. <mark>J</mark>. Kidd. <mark>J</mark> . C. Davidson,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [299.5, 524.67, 464.04, 801.32], "bbox_id": "ace7212052", "file": "AppomattoxNewspapers_1926-1933a_0187.pdf", "page": 1, "text": "GrandjuryG. D. Wilkerson, J. W. Durrum, R- Cor. Harvey, J. T. Rogers, C. E. Carson, C. M. Stratton Sr., J.N . Wooiridge, E. H. Smith, W. H. Morgan, G. A. Scheffler, R. W. Johnson, Jno. C. Moore, Jr. Civil JuryC. T. Cawthorn, James W. Caldwell, Hal F. Clark, Wm. D. Hix Jr., J. Robert Doss, G. 0. Gordon, J. L. Burkey, E, T. Mitchell, S. P. Coleman Jr. For Criminal trials  E. J Marsh, E. C. Scruggs, Ernest Ferguson, J o e W. Davis, J Baxter Marshall, H. H. Harvey O. R. Turnes, M. A. Stratton W. J. Kidd, J. C. Davidson Luther E. Martin, W. W. OBrien W. T. Mayberry, W. S. Bryant T. A. King, W. Thos. Caldwell i. G. Harding, Wm. J. Walton, B. L. Wheeler, J. 0. Davidson."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "R. Turnes, M. A. <mark>Stratton</mark> <mark>W</mark>. <mark>J</mark>. Kidd, <mark>J</mark>. C. Davidson"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "R. Turnes, M. A. <mark>Stratton</mark> <mark>W</mark>. <mark>J</mark>. Kidd, <mark>J</mark>. C. Davidson"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [153.35, 1156.49, 315.12, 1323.69], "bbox_id": "ec775850b3", "file": "AppomattoxNewspapers_1905-1912a_0350.pdf", "page": 1, "text": "E. R. Abbitt and N. R. Feather tone. For Honse of DelegateT Stratton, J. W. Oawthorn. DISTBI0T OFFICERSOLOTER HILL For Board of SupervisorsO. M Drinkard, W. H. Ligon. For ConstableE. M. Drinkard, O. R. Turnes. For Precinct Committeemen P. M. Hannah, W. T. M arshall, J. W. Coleman, Jr., E. E. Chism, W J. Paulett, Claude W. Smith, Geo. D. Coleman."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "For Honse of DelegateT <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Oawthorn. DISTBI0T OFFICERSOLOTER HILL"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "For Honse of DelegateT <mark>Stratton</mark>, <mark>J</mark>. <mark>W</mark>. Oawthorn. DISTBI0T OFFICERSOLOTER HILL"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1575.34, 958.49, 1744.89, 1344.78], "bbox_id": "ee696362fa", "file": "AppomattoxNewspapers_1902-1905a_0245.pdf", "page": 1, "text": "Sears and R. C. Mann. H . W. M cKinney Notary Public for county. Usual allowance made officers of court and jurors. The Judge selected for the trial of all civil cases and misdemeanors the jury list for the ensuiug 12 months, numbering 125 men. The following venire was sum moned for the trial of felony cases Chas. M. Drinkard, W. J . Trent, A . E . Turnes, Thos. F . Covington R. S. Jenkins, Richard W. Smith James T . Cheatham, J . R. Caldwell Wi B. Harvey, B. L. Staples, O. S, Caw thorn, Jas. L . Clark, T . Burge MooreRobt. N . Morris, Thos. O Davidson, W. C. Abbitt. The following were summoned for the trial of civil cases E . R. Abbitt, W. T . Marshall, P H. yVooldridge, Jno. W. Overton Saml T . Mcgginson, T. C. Stratton E . F . Glover, Richard T . Phelps Chas. H . Smith, Jno. H . Davis, W M. Stratton, J . D. Hamersley. Much of the chancery business of the court was continued on account of the indisposition of the clerk The time for the holding of another term will soon be bee-1st Monday"}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "Smith, Jno. H . Davis, <mark>W</mark> M. <mark>Stratton</mark>, <mark>J</mark> . D. Hamersley. Much of"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "Smith, Jno. H . Davis, <mark>W</mark> M. <mark>Stratton</mark>, <mark>J</mark> . D. Hamersley. Much of"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.64, 404.67, 1630.17, 759.12], "bbox_id": "2f95833b37", "file": "AppomattoxNewspapers_1926-1933a_0091.pdf", "page": 1, "text": "Rev. A. L Caudle, wife and baby, left Monday a. m. for several days visit with relatives in N. C. Misses I-eGrands,. Frances Stratton, Mr. and Mrs. Van Drinkard, and Van, Jr., of Lynchburg, were Sunday guests of Mr. and Mrs. J. A. Stratton. Mrs. J. W. Neighbors has con-  eluded a visit of several weeks I in Lpnchburg with her son, J, W. Neighbors, Jr., and Mrs. Neighbors- Mrs. Irene Whitten Price, Mrs. Ruth Whitten Polland and children, of High Point. N. Ci, Forrest Whitten, of Columbus, Ohio Mr. and Mrs. Daniel, of Philadelphia, are visiting their parents, Mr. and Mrs. J. T. I Whitten. They were called home on account of the death of their sister, Florence. Mr. and Mrs. Dunkley Gunter and son, Bobbie, came home Monday from Lynchburg, where Mr.. Gunter had flu. He is im proving."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. J. A. <mark>Stratton</mark>. Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors has con-  eluded"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. J. A. <mark>Stratton</mark>. Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors has con-  eluded"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [720.45, 828.09, 875.3, 907.4], "bbox_id": "f4584abecb", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "OAKVILLE PRECINCT. W. G. Abbitt, chairman T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Fields Smith, C. 1!. Coleman, C. E. Carson, T. M. Taylor, 11. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, R. T. Moss, T. W. Trent."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "chairman T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "chairman T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1994.96, 547.88, 2155.04, 1116.83], "bbox_id": "fc057166d2", "file": "AppomattoxNewspapers_1922-1923a_0532.pdf", "page": 1, "text": "N ews o f Concord. This week in Concord will be a most rare one. Mr. Polk Miller will be there at Staples Hall, Saturday night, September 28th. The hall is being arranged to ac commodate 500, and the extensive advertising assures us that we will not be disappointed. In addition to this, the Udies of the Ladies Aid Society are 4rrating in unique style a lawn party, begiucugat 4 p. m. th it day and to continue un til after the entertainmeut. Polk Millers fame is universally known, we accord ingly honor Lis presence. Mrs. W. B. Jett, after visiting relatives in Eastern Virginia return ed last week with her sister. Miss Beatrice Bryant, who will spend a brief visit in the village. Mr. W. C. Akers after spendiug a week with his family, returned to his duties on S. A. L. Railroad last Friday. Miss Emily Thornhill, of Lynch burg, is the guest of Mrs. K. W. Stratton. Mr. J. H. Steele, after facing ab sent from lailroad duties since last March with a serious spell of ill ness is again resuming dnty as fore man carpenter. Mrs. Dr. W. F. Fisher, of Alex andria, Va., the guest of Miss An nie Fisher, returned home a few days ago. Under the supervision of Mr. J. H. Steele, the Baptist church was begun last week and is soon expect ed to be under roof. We gladly en tertain this new work. Mise Jonnie Martin ie suffering severely from the eting of an in sect on her hand. Mrs. Emma Martin, after some weeks illness, is better now."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "guest of Mrs. K. <mark>W</mark>. <mark>Stratton</mark>. Mr. <mark>J</mark>. H. Steele, after facing"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "guest of Mrs. K. <mark>W</mark>. <mark>Stratton</mark>. Mr. <mark>J</mark>. H. Steele, after facing"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [606.0, 1227.67, 679.55, 1407.56], "bbox_id": "8fa6cf34b8", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "J L Bondurant, E M Taylor, W B Taylor, J B Drinkard, P L Stratton, J A Stratton, T H Lewis, W O Shearer, T M Taylor, G D Routou, M W Carson, T J Stratton, F W Stratton, N H Shearer, J E Chick, C M Stiatton, T A Drinkard, J P Alvis,"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W", "Stratton"], "snippet": "M W Carson, T <mark>J</mark> <mark>Stratton</mark>, F <mark>W</mark> <mark>Stratton</mark>, N H Shearer,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W", "Stratton"], "snippet": "M W Carson, T <mark>J</mark> <mark>Stratton</mark>, F <mark>W</mark> <mark>Stratton</mark>, N H Shearer,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.91, 1572.38, 897.46, 2008.5], "bbox_id": "97f4fa7344", "file": "AppomattoxNewspapers_1898-1902a_0383.pdf", "page": 1, "text": "HIXBURG PRECINCT. W. H. Ligon, chairman J. W. Wright, J. F. Lee, E. P. Sears, F. W. Coleman, Joel Watkins, F. B. Forbes, W. B. Ford, B. W. Bristow, A. A. Baldwin, Jno. W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, Thomas Dickerson. CLOVER HILL PRECINCT. .W. J. Trent, Chairman, E. E. Chism, D. P. Ferguson, H. C. Fer guson, A. B. Franklm, M. E. Agee, E. H. Lucado, J. W. Flood, J. W. Cawthorn, Jr., B. A. OBrien, C. M. Drinkard.. J. B. Hamilton, H. B. Pitmau, E. B. Abbitt, P. J. Shep- perd. AGEE PRECINCT, A. B. Thornhill, Chairman, T. J. Gooding, N. B. Featherstone, 8 . P. Taylor, W. D. Woodson, A. E. Milt- imore, J. H. Wood, C. A. Horsley, T. J. Megginson, D. M. Anderson, J. B. Childress, M. F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Cole man. OAKVILLE PRECINCT W. C. Abbitt, Chairman, T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Field Smith. C. H. Coleman, C. E. Carson, T. M, Tay lor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, B. T, Moss, J. D. Haiftersley. STONEWALL PRECINCT. S. C. Stratton, Chairman, M. W. Carson, J. C. Shearer,.S. E. Ander, son, T. C. Stratton, T. W. Tnggle, W. D. Sandidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. 8 , Thornhill, T. A. Driukartl, MtlUj Isbell, W. 8 . Taylor."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "Chairman, T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "Chairman, T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [332.4, 1172.77, 488.25, 1347.82], "bbox_id": "b66f46195c", "file": "AppomattoxNewspapers_1902-1905a_0233.pdf", "page": 1, "text": "F arm ers In stitu te. On last County Court day at twelve oclook the Appomattox farmers held a meeting of the Farmers Institute and received the report of the committee appointed at the previous oonrt to draft a constitution for the Institute. There was a good attendance of the farmers of the county and the meeting was called to order by Mr. T. J. Stratton. Major J. W. Flood, as chairman of the committee re ported the following constitution which was unanimously adopted."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "by Mr. T. J. <mark>Stratton</mark>. Major <mark>J</mark>. <mark>W</mark>. Flood, as chairman of"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "by Mr. T. J. <mark>Stratton</mark>. Major <mark>J</mark>. <mark>W</mark>. Flood, as chairman of"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [802.32, 563.52, 959.17, 1275.27], "bbox_id": "1eb4d3c22e", "file": "AppomattoxNewspapers_1898-1902a_0580.pdf", "page": 1, "text": "CHEATWOOD PEECINCT. B. N. Tanner, chairman A. H. Howerton. J. W. Powell, C. F. Rob ertson, W. D. Doss, T. H. A. Cheat ham, C. A. Cardwell, L. T. Morris, Robert B. Poore, Hansford Card- well, W. G. Coleman, W. F. Johnson, J. D. Cheatham, A. C. Cheatham, Samuel Cheatham. CHAP PEECINCT. S. J. Lee, chai.inau S. G. Harvey, C. H. Godsey, W. H. Childress, C. H. Lee, J. C. Martin, J. T. Cawthorn, W. H. Lewis, R. W. Fleshman, E. C. Marshall, 0. S. Cawthorn, J. Baxter Marshall, W. P. Godsey, J. C. Wol- ridge, J. L. Woodson. PAMPLIN PEECINCT. J. W. Clark, chairmau, L. W. Thornton, P. M. Hannah, R. D. Baldwin, Geo. F. Farrar, John H. Davis, Dr. C. S. Morton, Dr. E. E. Walker, J. A. Oaks, L. W. Gilliam, R. li. Davis, E. F. Glover, E. F.Wil Hams, W. A. Womack, Jno. Warner. OAKVILLE PEECINCT. W. C. Abbitt, chairman T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Fields Smith, C. II. Coleman, C. E. Carsou, T. M. Taylor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, R. T. Moss, T. W. Trent. HIXBUEG PEECINCT. W. H. Ligon, chairman K. M. Garrett, C. B. Gilliam, E. P. Sears. P. W. Coleman, Joel Watkins, W. B. Forbes, W. B. Ford, R. W. Bristow, A. A. Baldwin, John W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, T. E. Paulette. CLOVEB HILL PEECINCT. W. P. Gills, chairman E. E. Chism, D. P. Ferguson, H. C. Ferguson, A. B Franklin, M. E. Agee, E. H.-Luc- ado, J. W. Flood, J. W. Tweedy, R A. OBrien, C. M. Drinkard, J. R. Hamilton, H. R. Pitman, E. R. Ab bitt, P. J. Sheppaid, R. H. Brown ing, II. C. Babcock, W. F. Wright, J. W. Wright. STONEWALL PEECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, 1. W. Tuggle, W. D. Sandidge, J. I. Martin, P. L Stratton, C. M. Stratton, J. S. Thorn hill, T. A. Drinkard, Milton Isbell, W. S. Taylor, Ur. J, B. Abbitt. AGEE PEECINCT. A. B. Thornhill, chairman T. J. Gooding. N. R. Featherston, S. P. Taylor, W. D. Woodson, A. E. Mil- timore, J. H. Wood, J. D. Hamers- ley, T, J. Megginson, D. M. Ander son. J. D. Childress, M, F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Coleman."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "chairman T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "chairman T. E. Owen, <mark>W</mark>. M. <mark>Stratton</mark>, <mark>J</mark>. E. Chick, E. B."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [973.22, 1269.63, 1131.08, 1581.16], "bbox_id": "f4213c9f4e", "file": "AppomattoxNewspapers_1898-1902a_0223.pdf", "page": 1, "text": "C on cord . Rev. Dr. Geo. B. Taylor, assisted by Rev. Dr. Hale, of Roanoke, is conducting a senes of meetings at Hebron Church. Mr. Jos. Galloway, wife and chil dren, of Manchester, Va., are on a visit to his brother, Rev. C. H. Gal loway, of this place. Aliss Porter, of Danville, and Aliss Beckham, of Richmond, are guests of Miss Abbott at Edgewood. Rev. Dr. W. F. Fisher, of Ports mouth, Va., is visiting his sister and brother at their home here. Aliss Lee Steele returned on Fri day last from a visit to friends it Lynchburg. Mrs. Dr. Lyle Ould is visiting re latives in Halifax county. Airs. Rev. Joslfua Thornhill, of Flat Creek, is the guest of her bro ther, R. W. Stratton. Mr. J . C. liildrup is iu town. The Cornerstone Colored Baptist Association convenes at Promised- Land Church on Wednesday of this week, the 16th instant. Aliss Sallie Abbott, who ha been recently ill with fever, is convales cent. Q uid N un c ."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "her bro ther, R. <mark>W</mark>. <mark>Stratton</mark>. Mr. <mark>J</mark> . C. liildrup is iu"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "her bro ther, R. <mark>W</mark>. <mark>Stratton</mark>. Mr. <mark>J</mark> . C. liildrup is iu"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [341.72, 404.53, 666.49, 1556.63], "bbox_id": "71ce6fb992", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "1, .Urs. li. C. Babcock 2, Mrs. E. M S tratton grape preserves, 1, Mrs. IS, T. Brice 2, Mrs. W. P. Gills peach preserves, 1, Mrs. J. A. Stratton 2 Mrs. W. G. Brow n Bear, 1, Mrs. H U. Babcock 2, Mrs. J. A. S tratton plum, 1, Mrs. W. G. Brown 2, Mrs, Joel H ubbard quince, 1, Mrs. J. A S tratton straw berry, 1, Mrs. J. A, S tratton 2, Mrs. W, B. Gills rasp berry, X, Mrs. i M. Shirey 2, Mrs. J A. Stratton w aterm elon, 1, Mrs. Gttie Davidson 2, N. B. H arris. Canned Goods Tomatoes, 1, Mrs. H. C. Babcock 2, Mrs. M. G. Sm ith cherries, 1, Mrs M. C. Sm ith 2, Mrs, M. C. Sm ith peas, 1, Mrs. W. H. Brown 2, Miss H. G. Bab on the 11th. It w a s conserva- L,u-y sm ith  beets, 1 , Mrs. h . g , cock 2, D. B. Moon apple, 1, Mrs. J tive to a degree nd yet he scored the Republican party for its inconsistent ea and he showed up the two factors  Ttii Lilly While and  The Lib Black just i a the colors in which they stand before the people. Alluding to Col. Her y Anderson being ashamed of V ginians he said that on the 8uh day of November Vir pc ,ns would show the Colonel tba. they are ashamed of him. ht. Robert Hundley followed Mr. Flood in a timely address that was listeded to with close attention. In the circuit court a negro man pleaded guilty to the charge of rape and he got 20 years in the penitentiary. The Supreme court refused to set aside the verdict in the Pendle ton case, and be will have to serve his time and also an ad ditional year for having broken jail. There were quite a num bar of indictments against persons charged with violating the revenue laws. A trader told me he did not know of anyone who made sale of one single horse on court day, but there was a lot of swopping done. I sold two fat steers to a dealer at about 4 c nts a pound and a veal calf about the same time at 12 cents Beef dressed was sold here as low as six cents a pound during the warm spell last week. Ripe tobacco has cured up a good color and with the coming of a season for handling it, the market is apt to be glutted at first as money is scarce. It ie nothing unusual for the banks to write to prospective custom ers asking for their patronage but 3 is what most banks offer though some of the local banks qre offering 4 interest. Mr. Willie Green is building a pretty bungalo at Mt. Vinco. Sheriff W. T. Snoddy has moved his family to the place be bought from Mr. Haskins. The Rogers Coston marriage took place here on the 126b. Rev. John L. Rogers, a brother of the bride, assisted by Rev. C. M. Barrell performed the ceremony. Those from a dis tance who attended the wed- ding were Mr. Byro Rogers, of Oklahoma Miss jCoston, of North Carolina and Miss Sab- iston, of N. G. In the case of Tucker vs. Boatwright Dr. Tucker has concluded to drop the matter of contest and will support Mr. John B. Boatwright in the comihg election. A pedler traveling on foot playing his trade in the county the past week. Cold storage apples are to be had at a price of 6 c a dozen and they look much better than they taste. 1 am on the market for a small farm near a city."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "w"], "snippet": "M. Shirey 2, Mrs. <mark>J</mark> A. <mark>Stratton</mark> <mark>w</mark> aterm elon, 1, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "w"], "snippet": "M. Shirey 2, Mrs. <mark>J</mark> A. <mark>Stratton</mark> <mark>w</mark> aterm elon, 1, Mrs."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1917.84, 827.95, 2394.6, 1180.99], "bbox_id": "c0623b72ad", "file": "AppomattoxNewspapers_1926-1933a_0563.pdf", "page": 1, "text": "VERA, March 15.Mr. and Mrs. Russell Roop spent Sun day in the home of Mr. and Mrs. S. A. Gilbert, near Appo mattox. Mrs. Walker Garrette is quite sick at this writing. Mr. and Mrs. M. L. Garrette, Mr. and Mrs. J. W. Scruggs at tended the funeral of Mr. Har dy Hamersley in Richmond, last week. New has been received here that Mr. and Mrs. Lewis Chil ders, of Roanoke are the proud parents of a fine baby boy. Mr. and Mrs. C. H. Garrette i Appomattox, and Miss Mattie and son, Mr. F. W. Burks, of Moss visited Mrs. J. A. Strat- Bedford, Mr. and Mrs. M. L. I tn .Sunday. . . . . Garrette, Joseph, Alice an d Mrs. E. Z. King is visiting re- j Garland Garrette, Mrs. A. J. Ilatives in Christiansburg. Bagby, Mr. and Mrs. J. W . Miss Louise Stratton, of Scruggs and sons, Wilson and Lynchburg, spent the week-end Charles and Mrs. P. A. Gar- with her parents, Mr. and Mrs rette and three children were C. M. Stratton, visitors in the homes of t h e Mrs. J. A. Stratton has re- Hatcher Brothers, at Wildway turned, home after spending. . Sunday some time with her sisters, the 1 treatment, has returned home Mrs.ida Beale, of Lynch- hisses LeGrande, of Lynch burg, spent the week-end with Dur8- relatives in the neighborhood.1 0 J. N. Megginson of Norfolk, TcflCUCTS AttGUCl spent Friday night and Satur-1"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "Bagby, Mr. and Mrs. <mark>J</mark>. <mark>W</mark> . Miss Louise <mark>Stratton</mark>, of Scruggs and sons,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "Bagby, Mr. and Mrs. <mark>J</mark>. <mark>W</mark> . Miss Louise <mark>Stratton</mark>, of Scruggs and sons,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [414.48, 254.11, 576.6, 898.12], "bbox_id": "4e7495cc3b", "file": "AppomattoxNewspapers_1898-1902a_0260.pdf", "page": 1, "text": "To th e V oters of Campbell. Whereas a card purporting to le signed by a number of citizens of Appomattox in reply to the address of the Executive Committee of said county appeared in the News-Herald which reflects upon this committee and each member of it, in insinua ting that the ten gentlemen wln constitute it are the tools of and con trolled by two of its members, who happeu to be the Chairman and Secretary, and in saying, that every thing also is a pure nd simple system of studied fabrication manufactured solely for electioneering purposes i misrepresent, to mislead and to de ceive and whereas we do not be lieve that the parties who signed i did so knowing what its con tent.- was or intending to reflect upon this committee or any member of it by signing a paper so utterly without regard to the truth of th, case, therefore, Be it resolved, That this com mittee reaffirms every statemeni contained in said address and vouches the truth thereof that in a meeting held this the 1st day ot November, 1899, iu which every member is present, we state that tin publication of said address was au thorized by us and we today unani mously ratify it and endorse its publication and that we do not, be lieve that the parties whose names appear on said card authorized their names to be signed thereto, but that their names were placed there without their authority. S. L. Ferguson, Chairman Jas. B. Abbitt, Secy. W. H. Ligon, J. C. Jones, A. H. Howerton, W. J. Trent, S. C. Stratton, W. C. Abbitt, J. W. Clark, A. B. Thornhill, S. J. Lee."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J", "W"], "snippet": "J. Trent, S. C. <mark>Stratton</mark>, <mark>W</mark>. C. Abbitt, <mark>J</mark>. <mark>W</mark>. Clark, A. B."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J", "W"], "snippet": "J. Trent, S. C. <mark>Stratton</mark>, <mark>W</mark>. C. Abbitt, <mark>J</mark>. <mark>W</mark>. Clark, A. B."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.49, 237.87, 2088.14, 708.95], "bbox_id": "ac470cec01", "file": "AppomattoxNewspapers_1926-1933a_0248.pdf", "page": 1, "text": "They spent Sunday at Natural Bridge. Miss Frances Stratton, of North Carolina, is spending her vacation at home. Mr. and Mrs. Wood Burks, of Chicago, are the guests of Mr. and Mrs. B. H. Hamilton for several weeks. Norman Carson, of Penn., Mrs. Buck Morgan, Miss Vir ginia Carson, of Appomattox, and Wilton Carson, of Roan- were Sunday guests of Mr. and Mrs. Clyde Carson. Miss Margaret Caudle, of Dillwyn, and Miss Dot Wat son, of Lynchburg, visited Miss Margaret Neighbors last week. Miss Dinwiddie, of V. P. I., and Miss Sallie Guy Davis, of Lynchburg, gave a demonstra tion on how to beautify the home at Stonewall grange Hall Friday afternoon. Miss Myrtle Smith has con cluded a two weeks visit with Mrs. E. H. Carson and Mrs. C. M. Stratton, Jr. Mrs. J. W. Neighbors had as her guests last week, Miss Willie Neighbors and Mr. and Mrs. Owen Rosser and child ren, of Hudson, Ohio, Mr. and Mrs. Jim Neighbors and child ren, of Greensboro, N. C., Mr. md Mrs. Tom Neighbors and .amily, of Concord, visited in his home Sunday. Dunkley Gunter was hurt Sunday afternoon at Crystal Lake when he m a d e a high dive and injured his spine. He and Mrs. Gunter are in Crewe."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>, Jr. Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors had as her"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>, Jr. Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors had as her"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [526.54, 1215.38, 651.29, 1318.26], "bbox_id": "e34e9b4a81", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "STONEWALL PRECINCT. S C Stratton, J R Horsley, W Drinkard, J D Martin, G E Drinkard, E M Stratton, II H Stratton, W S Taylor, J S Thornhill,"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "J", "Stratton", "Stratton", "W", "J"], "snippet": "STONEWALL PRECINCT. S C <mark>Stratton</mark>, <mark>J</mark> R Horsley, <mark>W</mark> Drinkard, <mark>J</mark> D Martin, G E Drinkard, E M <mark>Stratton</mark>, II H <mark>Stratton</mark>, <mark>W</mark> S Taylor, <mark>J</mark> S Thornhill,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "J", "Stratton", "Stratton", "W", "J"], "snippet": "STONEWALL PRECINCT. S C <mark>Stratton</mark>, <mark>J</mark> R Horsley, <mark>W</mark> Drinkard, <mark>J</mark> D Martin, G E Drinkard, E M <mark>Stratton</mark>, II H <mark>Stratton</mark>, <mark>W</mark> S Taylor, <mark>J</mark> S Thornhill,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1798.11, 528.84, 1959.01, 875.41], "bbox_id": "2a5fe9a4e5", "file": "AppomattoxNewspapers_1892-1898a_0339.pdf", "page": 1, "text": "Stonewall Democrats Organize. An enthusiastic crowd of Demo crats met at Shearers store, Stone wall precinct, yesterday evening and organized a Stonewall, Bryan. Sewall and Flood, Free Silver Club with 39 members and elected the following officers J. S. Thornhill, President H. S. Anderson, first Vice-President S. C. Stratton, J. D. Alvis, W. S. Tay lor, H. C. Babcock, H. D. LeGrand, vice Presidents J. R. Horsley, Sec retary and C. M. Stratton, Treas urer. After perfecting the organization, the club adjourned to meet Saturday Sept. 26th, at 7 p. m. The following committees were appointed On arrangement S. E. Anderson, W. O. Shearer and Ced. E. Drinkard. To Secure Speakers S. C. Strat ton, T. H. Lewis and J. R. Horsley. There is a good deal of enthus iasm and we hope to double our members at the next meeting, as many were prevented from being present that would have joined."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "first Vice-President S. C. <mark>Stratton</mark>, <mark>J</mark>. D. Alvis, <mark>W</mark>. S. Tay lor, H."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "first Vice-President S. C. <mark>Stratton</mark>, <mark>J</mark>. D. Alvis, <mark>W</mark>. S. Tay lor, H."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1000.8, 827.48, 1147.29, 1746.43], "bbox_id": "3cda455347", "file": "TimesVirginian_1978_0487.pdf", "page": 1, "text": "Sonny Harwood Calvin Robinson Earle P. Robinson Grover E. Smith Carrington H. Martin J. A. Martin, Sr. Mrs. J. A. Martin C. R. McCormick Frank H. Carwile Joel W. Martin Maude S. Martin MollieS. Rogers JE, HoM ifMrcirtHftess- Ronald Andrews Georgia Matthews Grover P. Beasley, Jr. George P. Wooten DanW. Thornhill Freddie C. Kraatz Pauline Oxford Edith W illiams Mabel Marsh Serena Mosley June M. Coleman Mattie Franklin Ann Ferguson Donald Ferguson LaFaye Martin Beverly Martin Jack A. Martin Herman R. Woody Virginia L. Woody Alton W. McCormick Sammy L. Gunter John W. Childress Ethel L. McCormick Charlie D. McCormick Frances O G ill Harry L. Ledbetter Shirley F. Childress Jereniah Pie Childress Jessie Bryant Floyd Lee McCormick Ivy W. Burks Lena Childress Ellen Martin Mammie Ella Gunter Thomas Gunter Mary S. Hudson Pat Davis Bill Davis Carrie Smith C. Roland Smith W. C. Moore Mary C. Moore Blanche Day Emmitt Day Vera Moore T. K. Moore Ruby Lewis Clark Lewis Charlie Lewis Rick Lewis Eddie Stratton A. J. Moore W. A. Garrett Claudie Moore Grace Lucado Lawson Lucado H. L. Wilkerson Mrs. M. W. Drinkard Tommy S. Drinkard Berkley D. Garrett, Jr. Teresa Garrett Berkley D. Garrett Lois K. Garrett Lloyd Doss Virginia Doss Dennis W. Drinkard E. T. Richardson A. T. Elder _  Norman M. Van Der Veer George Kress H. H. Richardson"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "Lewis Rick Lewis Eddie <mark>Stratton</mark> A. <mark>J</mark>. Moore <mark>W</mark>. A. Garrett Claudie Moore"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "Lewis Rick Lewis Eddie <mark>Stratton</mark> A. <mark>J</mark>. Moore <mark>W</mark>. A. Garrett Claudie Moore"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [561.59, 1161.87, 735.09, 1274.87], "bbox_id": "b0056c8314", "file": "AppomattoxNewspapers_1939-1943a_0125.pdf", "page": 1, "text": "Si newall, July! p .- Commence ment cx.rc ses for the Hebron Daily1 Vacation Bible School were held on  Sunday mortrng. A most interestin program was given, including pupils of e ch deprim int. Mrs. G. P. Ji nn ngs served as principal of the school and the following as teach ers M ss Elva Stratton, beginners Mrs. J . W. Simmons, primary Mrs. P. B. Stratton, juniors and Miss Neile Turnes. intermediates."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "ers M ss Elva <mark>Stratton</mark>, beginners Mrs. <mark>J</mark> . <mark>W</mark>. Simmons, primary Mrs. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "ers M ss Elva <mark>Stratton</mark>, beginners Mrs. <mark>J</mark> . <mark>W</mark>. Simmons, primary Mrs. P."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [157.45, 317.51, 322.44, 1079.7], "bbox_id": "10180900a4", "file": "AppomattoxNewspapers_1926-1933a_0175.pdf", "page": 1, "text": "On a tie yote b efo reth  ard of supervisors in Charlotte county as to locating a new rpralmileage in that county, Hejy Marshall was called in toPast deciding vote, which he did in favor of route from Madisonville to C. H. via Drakes Branch. R. L. phamberlyne, Jr., advocated that aHottment be made on Red House, Phenix and Madisonville, Cunen, C. H. road. This latter iroute would tap the State road at r Red House, thence through Ap pomattox to Nelqgti County across steel bridge at Bent Creek and James River, thence on to valley and north. STONEWALL Farmers are busy threshing wheat. Miss Annie Alvis left Thurs day for Columbia University, New York, going to Norfolk by rail from there by steamer. Little Emma Woodson and -brother, Tom, who expected to spend the summer with their aunt, Mrs. J. P. Alvis, were called home Monday by the sud den illness of their mother. Mr. and Mrs. Sam LeGrand and children, of Seattle, Wash.,, spent last week with the form ers sister, Mrs- J. A. Stratton. Mr.-T. W. Cobb and daughter, Florence, and grandson, Harry, of Franklin, visited the formers daughter, Mrs. Clayton Drink- ard, this week. Mr. and Mrs. T. A. Drinkard, Earl Drinkard, Mr. and Mrs. Victor Burnett and Mr, Albert Stone, of Lynchburg, Mr. F. E. Jennings and family, Mrs. A. I. Caudle, little daughter, Cather ine, and son, Harold, were Sun day guests of Mr. W. H. Drink ard. Miss Margaret Caudle is visit ing relatives in Durham, N. C. Misses Elva and Frances Strat ton, of Charlottesville, spent the week-end at home recently. Miss Hazel Taylor is visiting relatives in Appomattox. The lawn party at Stonewall July 4th was quite a success. A nice sum was realized The committee wishes to  express their gratitude to all that con- . tributed in any way for the party."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "form ers sister, Mrs- <mark>J</mark>. A. <mark>Stratton</mark>. Mr.-T. <mark>W</mark>. Cobb and daughter, Florence,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "form ers sister, Mrs- <mark>J</mark>. A. <mark>Stratton</mark>. Mr.-T. <mark>W</mark>. Cobb and daughter, Florence,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [852.25, 1672.7, 1007.29, 1878.71], "bbox_id": "cab18ec945", "file": "AppomattoxNewspapers_1922-1923a_0041.pdf", "page": 1, "text": "neers Corps. Robertson, A. A. Robertson! L. W., died at P t Lookout Rush, J. S., transforred. Rodgers, D. C. Stratton, R. C. Stratton, J. Taylor. Scruggs, W. M. Scruggs, F. C. Staples, Jas. B. Staples, W. H. Staples, Reubin. Staples, Jaa-  Simms, E. A. Simms, S. M. Steele, G. W. Stepp, Nathan. Stepp, J. D. Snell, J- W. Smith, Elijah. Taylor, E. M. Taylor, W. B. ___ Tyree, J. R  transferred, i Turner, T. M."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "C. Stratton, R. C. <mark>Stratton</mark>, <mark>J</mark>. Taylor. Scruggs, <mark>W</mark>. M. Scruggs, F. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "C. Stratton, R. C. <mark>Stratton</mark>, <mark>J</mark>. Taylor. Scruggs, <mark>W</mark>. M. Scruggs, F. C."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1752.25, 474.01, 1911.27, 1177.4], "bbox_id": "f09da16093", "file": "AppomattoxNewspapers_1915-1918a_0464.pdf", "page": 1, "text": "Mrs. T hom as J . S tra tto n . The death of Mrs. Thomas J. Stratton occurred at her home ia Appomattox county on Tues day evening, October 9th. Mrs. Stratton had been in failing health for some months, and her death was not unexpected. The burial took place on Thursday from Hebron ohureh, of which she was a member. The servioes were conduoted by the pastor, Rev. J. M. Street. The services were simple and appropriate, consisting of a few favorite hymns of the de ceased sung by the congrega tion, and a few well chosen re marks by the pastor, oonclud ed by a prayer at the grave in Hebron cemetery. Mrs. Stratton leaves surviv ing her husband, Hon. Thomas Stratton and six children, as follows J. Ernest Stratton and Frank W. Stratton, of Lynchburg J. Albon Stratton, of Kelson T. Corbin Stratton, of Appomattox Walter Strat ton, of Washington, D. C. and Mrs. Lizzie Soott, of Bedford besides a number of grandchil dren. The deceased was about sev enty-five years of age, and had spent all of her married life in the Hebron community of Ap pomattox county. She was a conscientious Christian wo man, and left many comforting testimonials of her Christian faith, the be.st of which was reflected in her daily life in her home and among her neigh bore and friends. Her cheer ful disposition and kind spirit will not soon be forgottenv,by those who had the good for tune to know her. The death of Mrs. Stratton will be genuinely mourned. Mr. Thomas J. Stratton, who is held in honor and esteem by the people of Appomattox, and the members of his family have our sympathy in their die tress, which was evidenced by the great number present at the burial service, and their beautiful floral tributes."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J", "Stratton"], "snippet": "Ernest Stratton and Frank <mark>W</mark>. <mark>Stratton</mark>, of Lynchburg <mark>J</mark>. Albon <mark>Stratton</mark>, of Kelson"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J", "Stratton"], "snippet": "Ernest Stratton and Frank <mark>W</mark>. <mark>Stratton</mark>, of Lynchburg <mark>J</mark>. Albon <mark>Stratton</mark>, of Kelson"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1298.38, 1420.26, 1613.57, 1465.06], "bbox_id": "8e2cc64789", "file": "TimesVirginian_1983a_0027.pdf", "page": 1, "text": "Make gardening chores a breeze! This 5-hp ni-R-Pkw features a j w gad Briggs  Stratton engine with simple spring recoil starting. Tills  26 swatnup to 6 deep. Outer tin are removable for narrow cultlva- up lion. Safety remote clutch control. Drag bar and attachment assembly handle a variety of optional ground handling attachments, w eao"}, "highlight": {"text": {"matched_tokens": ["j", "w", "Stratton"], "snippet": "5-hp ni-R-Pkw features a <mark>j</mark> <mark>w</mark> gad Briggs  <mark>Stratton</mark> engine with simple spring"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "w", "Stratton"], "snippet": "5-hp ni-R-Pkw features a <mark>j</mark> <mark>w</mark> gad Briggs  <mark>Stratton</mark> engine with simple spring"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1920.51, 215.61, 2082.35, 686.93], "bbox_id": "b00a3ed673", "file": "AppomattoxNewspapers_1908-1909a_0248.pdf", "page": 1, "text": "jfhey afient Sunday at Natural Bridge. Miss Frances Stratton of North Carolina, is spending her vacation at home Mr. and Mm Wood Bitrks, of Chicago, are the guests ol Mr. find Mm B. H. Hamilton Ior several weeks. Norman Carson, of Penn., i n . Buck Morgan, Miss Vir ginia Carson, of Appomattox, and Wilton Carson, of Roan- were Sunday guest of Mr. and n . Clyde Carson. Miss Margaret Caudle of Jillwyn, and Miss Dot Wat son, of Lynchburg, visited Mite Margaret Neighbors last week. Miss Dinwiddie, of V. P. I., and Miss Sallie Guy Davis, of 4ynchburg, gave a demofistra- ion on how to beautify the lome at Stonewall ange Jail Friday afternoton. Miss Myrtle Smith has con- laded a two weeks visit with Mrs. E. H. Carson and Mrs. C. . Stratton, Jr. Mm J. W. Neighbors had is her guests last week, Miss Willie Neighbors and Mr. and Mm Owen Rosser and child- en, of Hudson, Ohio, Mr. and Mrs. Jim Neighbors and child ren, of Greensboro, N. C., Mr. ind Mrs. Tom Neighbors and amily, of Coficord, -visited in his home Sunday. Dunkley Gunter was hurt unday afternoon at Crystal Lake when he m a d e a high dive and injured his spine. He and Mrs. Gunter are in Crewe."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "Carson and Mrs. C. . <mark>Stratton</mark>, Jr. Mm <mark>J</mark>. <mark>W</mark>. Neighbors had is her"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "Carson and Mrs. C. . <mark>Stratton</mark>, Jr. Mm <mark>J</mark>. <mark>W</mark>. Neighbors had is her"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [672.48, 218.2, 754.38, 414.65], "bbox_id": "d8ede92212", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "J S T Bondurant, T O Davidson, Willie Stratton, W W Carson, C H Coleman, J E Chick, T E Owen, T W Jolihs, VV O Carson, T II Davidson, W A Turner, G L Ferguson, C W Phelps, W Thomas, 0 W Doss, W J Abbitt, W M Stratton, A 0 Abbitt, W D Doss, 0 H.Doss,"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton", "W"], "snippet": "0 W Doss, W <mark>J</mark> Abbitt, <mark>W</mark> M <mark>Stratton</mark>, A 0 Abbitt, <mark>W</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton", "W"], "snippet": "0 W Doss, W <mark>J</mark> Abbitt, <mark>W</mark> M <mark>Stratton</mark>, A 0 Abbitt, <mark>W</mark>"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [531.09, 1495.97, 691.54, 1713.32], "bbox_id": "8742ce64c7", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "J. E. C h ic k , C a p t a in . W C Abbitt, Wm J Abbitt, E A Chick, C H Colemau, C E Car- son, T B Carson, E B Chick, B C Chenanlt, W D Doss, C W Doss, Jas M Doss, Chas R Dowell, G L Ferguson, R T Ferguson, H G Harding, S W Harvey, W E Jones, A D Kyle, R T Moss, W C Nowlin, N W Owen, T E Owen, C W Phelps, T H Pansh, J J Rutledge, W M Stratton, Field Smith, C H Smitli, C M Powell, J N Turner, T M Taylor, T W Trent, Augusta Viar, Daniel Viar, D T Wooldridge, E A Walton, A A White, W O Carson. STONEWALL PRECINCT."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "T H Pansh, J <mark>J</mark> Rutledge, <mark>W</mark> M <mark>Stratton</mark>, Field Smith, C H"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "T H Pansh, J <mark>J</mark> Rutledge, <mark>W</mark> M <mark>Stratton</mark>, Field Smith, C H"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.43, 251.29, 1810.57, 1761.2], "bbox_id": "fed85ccf8c", "file": "AppomattoxNewspapers_1922-1923a_0360.pdf", "page": 1, "text": "A. H . C lem ent Is fined 10O . Circuit Court adjourned Thurs day evening after a busy term. The following grand jury attend ed Milton Isbell, J. R. Atwood, VV. H. Childress, J. W. Durrum, J. A. Stratton, N. R. Feathgrstone, H. G. Harding. J. D. Bondurant, C. H. Coleman, E. E. Cbisiii and T. Q, Davidson. The following indict ments were returned A. H. Clement, felony true bill. James McCoy, felonious shooting true bill. Alex. Sammons, felonious assault true bill. . Alex. Semmons, felonious cutting true bill. All of the cases were contmhed except that of A. H. Clement, who asked for an immediate trial. The following cases were also continued Wilbur, James and Dave McCoy, James Hancock and Hornsey Lewis. Com. vs Douglas Mason, appeal from Mayors decision of,. Pamplin Cityj dismissed bn groundsbfun constitutionality of charter of said town. Chas. Hindley took out noterali- zation papers.    Court refused to grant petition of Mrs. Lula Hunter for reduction of tbe assessment of her land in the village. Later the order was set aside and the application con tinued to next court. The court appoints Dr. J. B Abbitt a member of tbe county medical board. Com. vs A. H. Clement? first in dictment with drawn. Grand jury resumed session and reported true bill for felonious shooting with in tent to kill. Also indicted J. C. Beckham on nine indictments for selling liquor, and Wiflie White, one indictment for selling liquor. Joseph R. Case was relieved from the payment of taxes erroneously assessed against him. Haden vs Cardwell, appeal from Justice Moses Attachment quash ed and Cardwell given possession of mule. Muster Roll of Company H. 22nd Va. Cavalry ordered recorded. Walter Payne and W. J. Paris were appointed special policemen the former for Pamplins and tbe latter for Appomattox. The following jury was empan elled to-try tbe case against A. H. Clement W. T. Caldwell, L, R-. Richard son, J. R. Lee, Otis M. Gilliam, G. E. Drinkavd, T. A. Caldwell, Wm. E. Dickerson. J. N. Woolridge, R. E. Whitaker, Geo. D. Wiikerson. E M. Drinkard and Walker Harvey. Mr. A. E. Strode, who appeared for Mf, -0lement took- the grouqd that hejiad been tried and fined for the offe tree Cob nt over ruled and exceptions noted.--Judge Wqfee Smith, of Cumbriftnd and Co gressman H. D. Flood prosecute the acoused vigorously. The Con gressman1appearing as a witness on ihe stand,.adviser, and finally closT ing,the - argument. Mr. Hubbard, wfio prosecuted at the  Magistrates court was detained. at home by the illness of ills wife. . ,  The witnesses for the Common wealth appeared to be as follows R. E Hags, T. B. Carson, J. R Horsleyi T, J. Stratton, 3 . P. Alvis, S. L, Ferguson,-VI?..  Wright, O. fj. Haga, J. J  Durrum, W. A. Moses, R. Ci Mann,. J. C .Jones and Tom Ferguson. . 5 .    Witnesses for, the defence were Ellis Simms, Robt. Furbush, Raleigh. CKiltop and Ffank Jones. The accused has never denied the shooting and stated.then, and does Isb.jjow that if ever a man had a right-to shpot another he- Clement had the. right to shoot Ferguson. 8-. Ii. Ferguson testified substantially as follows. W ejU C. has been living in house 1 purchased. Moses,., Flood . and myself bought house. I ktterWardS- bought it. 1 de cjdqd to movedown this fall to-village. Cs time was out - by -contract on last day of September. 1 let-him Know that I intended to move down and wanted to make repairs. 1 asked privilege of looking through house Mr. and. Mrs. C. did not respond very gracious ly. About i p.-m. Hagacame aud we went over to bouse. Went through front office to back room and were talking about putting in bay window. C. came down stairs and said he had a box of glass on hand which would fit the windows and if you will take it you will save me trouble.of seud-ng it back. -Ill take it, tbere is one out I have had to put iu several times saiu C. Haga remarks there are two others broken. I asked Haga if it was not a stiff proposition for him to offer to sell pe glass that .lie C. had broken out. I was in good humor, yy-hen C. returns from.up stairs wbere.be went to getbill of glass. 1 said, Buck dont you think it a stiff proposition to want to sell me glass you have broken out? He threw his head back and said, np Im leaving bouse in a better condition than I found it. 1 said I think I could make you by law replace this glass you have broken. C, replied be-would line-to see me make, him do something. Tbe glass was sitting by me well, I think 1 will make you do it this way. Ill takethis box of glass and let Mr. Haga put ip tbose you have broken out. I know -I was deliberate, not fretted, or serious, took glass m my hand and Was talking. 0. followed me up anu took hold of my coat or sleeve and said, let that glass alone aqd get out of here I turned and took hold of his lapel and said, suppose you get out of here your time is out. I pressed him along towards tbe front door."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "VV. H. Childress, J. <mark>W</mark>. Durrum, <mark>J</mark>. A. <mark>Stratton</mark>, N. R. Feathgrstone, H."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "VV. H. Childress, J. <mark>W</mark>. Durrum, <mark>J</mark>. A. <mark>Stratton</mark>, N. R. Feathgrstone, H."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1809.84, 1450.75, 2058.33, 1607.65], "bbox_id": "5a963b2b51", "file": "AppomattoxNewspapers_1926-1933a_0415.pdf", "page": 1, "text": "1  __STOCK AND FOWLS KILLED Mrs.-Wilbur Stratton 1 chicken W. J. Smith 1 turkey J. J. Harvey 1 turkey F. S. Stratton and M. Anna Jones 8 pigs and 1 hog G- u Fore 13 chickens E. LeRoy Smith 5 capons Jane Walker 1 turkey Nannie Wilkerson 1 duck killed 2 injured W. A. Swan 1 turkey gobbler r . Phelps 1 turkey gobbler J. A. Garrett 1 shoat T. E. Owen 14 chickens Mrs. J. B. Wilson 1 turkey hen S. A. Ferguson 1 turkey gobbler W. A. Mays 8 chickens"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "AND FOWLS KILLED Mrs.-Wilbur <mark>Stratton</mark> 1 chicken <mark>W</mark>. <mark>J</mark>. Smith 1 turkey <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J", "J"], "snippet": "AND FOWLS KILLED Mrs.-Wilbur <mark>Stratton</mark> 1 chicken <mark>W</mark>. <mark>J</mark>. Smith 1 turkey <mark>J</mark>."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [718.05, 1102.43, 872.9, 1181.2], "bbox_id": "d9f7439026", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "STONEWALL PRECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, T. W. Tuggle, W. D. Saudidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. S. Thorn hill, T. A.. Drinkard, Milton Isbell, VV. S. Taylor, itr. J. B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "STONEWALL PRECINCT. S. C. <mark>Stratton</mark>, chairman M. <mark>W</mark>. Carson, <mark>J</mark>. C. Shearer, S. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "STONEWALL PRECINCT. S. C. <mark>Stratton</mark>, chairman M. <mark>W</mark>. Carson, <mark>J</mark>. C. Shearer, S. E."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2177.05, 1078.53, 2343.36, 1466.44], "bbox_id": "dcd8418a92", "file": "AppomattoxNewspapers_1922-1923a_0512.pdf", "page": 1, "text": "society. Mr. Chat le3 Williamson and two children and Miss Abbey Price are he guests of Mrs. J. E. Price this week. Mr. and Mrs. R. E. Tyler and daughter, Miss Vio.a, of Staunton, Va., arc the guests of Mrs. J-. II. Steele. Miss Annie Steele, after a brief visit to relatives in Roatioke and Staunton, returned borne lust week. Mr. J. E. Price is visiting rela tives in Pamplin City this week. Mr. J. 11 Steele, who has been on an extended visit to Roanoke and Franklin county, has returned home, much improved in health. Mr. and Mrs. Crute, of Lunen burg and Mr. John W. Hilldrup, of lackstone are guests of Mrs. R. W. Stratton this week. Mrs. J. W. Hilldrup, who has been visiting relatives in Eastern Virginia, returned home with her daughter, Mrs. Crute, last week. Miss Johnnie Martin, after quite a prolonged illness, is somewhat improving. Miss Helen Hilldrup, who been visiting in Lynchburg, turned Monday."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J", "W"], "snippet": "guests of Mrs. R. <mark>W</mark>. <mark>Stratton</mark> this week. Mrs. <mark>J</mark>. <mark>W</mark>. Hilldrup, who has"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J", "W"], "snippet": "guests of Mrs. R. <mark>W</mark>. <mark>Stratton</mark> this week. Mrs. <mark>J</mark>. <mark>W</mark>. Hilldrup, who has"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [562.38, 1570.32, 721.23, 1663.72], "bbox_id": "362b31b442", "file": "AppomattoxNewspapers_1898-1902a_0121.pdf", "page": 1, "text": "On Tuesday alternoon at 2 ocloek Mr. Frank w. Stratton, son of T. J . Stratton Esq., and Miss Pearl Brent Taylor, daughter of Jas. B. Taylor, Esq, were married at He hron Baptist church. Miss Bettie W alker Routten acted as maid of honor and Mr. Cor bin Stratton as best man. The ceremony was performed by Dr. Taylor. Mr. and Mr. Stratton left on the east bound N. A W. train to visit friends In Nottoway Co."}, "highlight": {"text": {"matched_tokens": ["w", "Stratton", "J", "Stratton"], "snippet": "2 ocloek Mr. Frank <mark>w</mark>. <mark>Stratton</mark>, son of T. <mark>J</mark> . <mark>Stratton</mark> Esq., and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["w", "Stratton", "J", "Stratton"], "snippet": "2 ocloek Mr. Frank <mark>w</mark>. <mark>Stratton</mark>, son of T. <mark>J</mark> . <mark>Stratton</mark> Esq., and Miss"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2154.21, 156.68, 2328.01, 821.91], "bbox_id": "170b039ec9", "file": "AppomattoxNewspapers_1908-1909a_0333.pdf", "page": 1, "text": "Mrs. J. A. Stratton 75c 2nd, Mrs. J. W. Cawtbon 60c. Qt. tomato catsup, 1 stMra. J. -A. Stratton 76c 2nd, Mra. Della Stratton 50c. Qt. Dixie rèlish, 1stMrs. L. W. .Carter 75c 2nd, Mra. Jack Caldwell 50c. 51b home made soap, 1 st- Mrs. Hv C. Babcock 76c 2nd, Mrs. F. L. Mtirphy 50c. Qt. Cider vinegar, Ini-Ftumré M Smith 76c 2nd, Mrs. Jack Caldwell 60c. Qt. sorghum sy rup, 1 stMrs. E. Mv Stratton 75 c 2nd, T. R. Carter 50c. Qt. grape juicé,  lfit Mrs. Jack Caldwell 75c 2 nd, Jesse J. Anderson 60c. Class 4ButterBest lib. utter, 1 stMrs. R. F Jam- erson 1  2nd, Mrs. J. D. Moses 76c 3rd, Mrs. J. O. Carson 50c. Dept. IFancy Work Dresser set, 1 stMrs. J. E Dinwiddie 1 2 nd, Mrs. C. E. Carson 50c. Bed set, 1 st Mrs. R. W. Jamerson 1 2nd, Mra. R. W. Jamerson 60c. Luncheon set, 1st  Nellie Bates 1  2nd, Helen Dicker- son 50c. Embroidered center piece, 1st Mrs. Jack Cald well f l  2nd, Hilda Moore 50c. Table runner, 1 stMra. R, W. Jamerson g l 2nd, Mra C. E. Carson 60. Childs hand made dress, 1 stMrs. Harry Johnson g l 2 nd, Mrs. G. L Doss 50c. Buffet set, 1st  Mrs. C. E. Carson g l 2nd, Susie Bates 60c. Hand made center  piece, 1st Josephine LeGrand gl. Hand decorated pillow case, 1 st Susie Bates g l 2nd, Mrs Jack Caldwell 60c. Hand made handkerchief 1 stMrs. E. T. Moran gl  2- nd, Miss Lucy Rice 50c. Dept. JSchools Whole school exhibit- one"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "Mrs. J. A. <mark>Stratton</mark> 75c 2nd, Mrs. <mark>J</mark>. <mark>W</mark>. Cawtbon 60c. Qt. tomato"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "Mrs. J. A. <mark>Stratton</mark> 75c 2nd, Mrs. <mark>J</mark>. <mark>W</mark>. Cawtbon 60c. Qt. tomato"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1723.2, 1013.49, 1890.12, 1254.47], "bbox_id": "bb2e51170f", "file": "AppomattoxNewspapers_1908-1909a_0197.pdf", "page": 1, "text": "Mr. and Mrs. Brent Stratton and little daughter,- Margaret Bruce, of Greensboro and Bobj Stratton, of S. C., were Veek- end guests of Mr. and Mrs. E. M. Stratton.  Mr. and Mrs, J. W. Neighbors, Jr., of Lynchburg spent Sqpday with the formers parents, Mr. anjj Mrs. J. W. Neighbors. Mr. J. T. Whitten visited rela tives in Amherst County last week-end. Mrs. Laura McDaniels and lit tle daughter, Margaret, of Wash ington, are the guests of Mr. and Mrs. J. T. Whitten. Mrs. Laura Isabel!, of Lynch burg, is spending some time in the nome of J. A. Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. E. M. <mark>Stratton</mark>.  Mr. and Mrs, <mark>J</mark>. <mark>W</mark>. Neighbors, Jr., of Lynchburg"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. E. M. <mark>Stratton</mark>.  Mr. and Mrs, <mark>J</mark>. <mark>W</mark>. Neighbors, Jr., of Lynchburg"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1732.31, 1033.43, 1896.95, 1274.83], "bbox_id": "f04b252181", "file": "AppomattoxNewspapers_1926-1933a_0197.pdf", "page": 1, "text": "Mr. and Mrs. Brent Stratton and little daughter, Margaret Bruce, of Greensboro and Bob Stratton, of S. C., were week end guests of Mr. and Mrs. E. M. Stratton. Mr. and Mrs. J. W. Neighbors, Jr., of Lynchburg, spent Sqnday with the formers parents, Mr. and Mrs. J. W. Neighbors. Mr. J. T. Whitten visited rela tives in Amherst County last week-end. Mrs. Laura McDaniels and lit tle daughter, Margaret, of Wash ington, are the guests of Mr. and Mrs. J. T. Whitten. Mrs. Laura Isabell, of Lynch burg, is spending some time in the nome of J. A. Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. E. M. <mark>Stratton</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors, Jr., of Lynchburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. E. M. <mark>Stratton</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors, Jr., of Lynchburg,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.75, 176.13, 2333.16, 842.3], "bbox_id": "88e2aec77a", "file": "AppomattoxNewspapers_1926-1933a_0333.pdf", "page": 1, "text": "Mm J. A. Stratton 75c 2nd, Mrs. J. W. Cawthon 50c. Qt. tomato catsup, 1stMrs. J. A. Stratton 75c 2nd, Mm Dela Stratton 50c. Qt. Dixie relish, 1stMrs. L. W. .Carter 75c 2nd, Mrs. Jack Caldwell 50c. 51b home made soap, lstr-- Mrs. H. C. Babcock 75c 2nd, Mrs. F. L. Murphy 50c. Qt. cider vinegar, 1stFannie M. Smith 75c 2nd, Mm Jack Caldwell 50c. Qt. sorghum sy rup, 1stMrs. E. M. Stratton 75c 2nd, T. R. Carter 50c. Qt grape juice, 1st Mm Jack Caldwell 75c 2nd, Jesse J. Anderson 50c. Class 4ButterBent lib. utter, 1stMrs. R. F. Jam- erson 1 2nd, Mrs. J. D. Moses 75c 3rd, Mm J.- O. Carson 50c. Dept. IFancy Work Dresser set, 1stMrs. J. E- Dinwiddie 1 2nd, Mrs. C. E. Carson 50c. Bed set, 1st Mrs. R. W. Jamerson 1 2nd, Mm R. W. Jamerson 50c. Luncheon set, 1st  Nellie Bates 1 2nd, Helen Dicker- son 50c. Embroidered center- piece, 1st Mrs. Jack Cald well 1 2nd, Hilda Moore 50c. Tablé runner, 1stMrs. R. W. Jamerson 1 2nd, Mm C. E. Carson 50. Childs hand made dress, 1stMm Harry Johnson 1 2nd, Mrs. G. L. Does 50c. Buffet set, 1st  Mm C. E. Carson 1 2nd, Susie Bates 50c. Hand made center  piece, let Josephine LeGrand 1. Hand decorated pillow case, 1st Susie Bates 1 2nd, Mm Jack Caldwell 50c. Hand made handkerchief 1stMrs. E. T. Moran 1 2 nd, Miss Lucy Rice 50c. Dept. JSchools Whole school exhibit one"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "Mm J. A. <mark>Stratton</mark> 75c 2nd, Mrs. <mark>J</mark>. <mark>W</mark>. Cawthon 50c. Qt. tomato"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "Mm J. A. <mark>Stratton</mark> 75c 2nd, Mrs. <mark>J</mark>. <mark>W</mark>. Cawthon 50c. Qt. tomato"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1947.34, 151.91, 2116.46, 1433.25], "bbox_id": "c0603861d2", "file": "AppomattoxNewspapers_1908-1909a_0334.pdf", "page": 1, "text": "L. Brown,4 2nd Mrs. John D. Johnston, 2. White Leghorn Cock 1st, Horace Shirey, 2 2nd Horace Shirey, 1. Cockrel 1st, Miss Emma Ransom, 2 2nd Shirey Bros., 1. Hen 1st Mrs. Dud ley Johnston, 2 2nd, Horace Shirey, 1. Pullet 1st, Emma Ransom, 2 2nd Shirey Bros., 1. Pen 1st, Emma Ransom, I 2nd Shlrêÿ Bros., 2. Brown Leghorn Cock 1st, E. K. Martin, 2. Cockrel 1st, , B. G. Anderson, 2 2nd, Al bert OBrien, 1. Hen 1st, R. L. OBrien, 2 2nd, E. K. Mar tin, 1. Pullet 1st, H. A. Turnes, 2  2nd, Albert O Brien, 1. Pen 1st, E. K. Mar tin, 4  2nd, R. L. OBrien, 2. Plymouth Rock--Cock 1st, Mrs. John Turnes, 2 2nd, William Moon, 1 - ___ Cockrel 1st, William Moon, 2  2nd, Mrs. Johin Turnes, 1. Hen 1st, Shirey Bros., 2  2nd Mrs. Jqhn Turnes, 1. Pullet 1st, William Moon, 2  2nd, Shirey Bros., 1. Pen list, Mrs. John Turnes, 4 2nd B. G. Ander son, 2.  Buff Orpingtons, Best pair 1st A. R. Harwood, Jr., 2. Brahmas Best pair 1st, Grace Caldwell, 2. Indian GamesBest pair 1st R. W. Babcock, 2 2nd, Mrs. W. P. Gills, 1.  AnconasBeat pair 1st, Mrs. Maude Lucado, 2. Bronze Turkey Best pair 1st W. J. Smith, 2 2nd Mrs. W. T. Childers,  t GeeseBest pair 1st W. J. Smith, 1. DucksBeat pair 1st, Lenn Smith, Jr., 1 2nd James Dor- ton, .50.v  BantansBeat pair, 1st Jer ry Burke, Jr., 1. PigeonsBest pair, 1st Len Smith, Jr., 1. Department E Agricultural Products Class 1 Individual Farm Exhibit 1st, Mrs. Li. P. Mo?n, 25  2nd Mrs. W. A. Moon, 15. Best Garden Collection - 1st Mrs. O. L. Scheffler, 4 2nd, Mrs. Elizabeth Ford, 2. TobaccoBest 5 lbs. ship- p in g 7 let.T .m n d era 4  2nd, Stratton. Bros. 2 3rd, Arthur Booker, ribbon. Best 5 lbs Filler, 1stStratton Bros. 4 2nd, W. J. Wilkerson 2 3rd, Arthur Booker, ribbon. Best 51bs. Black wrappers, 1st Stratton Bros. 4  2nd,. W J. Wilkerson 2 3rd, Robert son Neighbors, ribbon. Best 51bs. Mahogany wrappers, 1st Stratton Bros. 4  2nd, W J. Wilkerson 2 3rd, Stratton Bros, ribbon. Best 51bs Bright Tobafcco, 1stC. R. Ferguson 4 2nd, E. R. Ferguson 2 3rd, Obie Myers ribbon. Class 2Corn Best ten gars Boone County White, 1st- H. Ç. Babcock 3 2nd, J, R Horsley 2 3rd, J. R. Horsley 1. Best ten ears Colliers Ex celsior 8rd, W. L. Coleman I 1. Best ten ears Caseys Pure red 1st J. R. Webb 4 2nd, ! Byron Cole 2  3rd, John Turnes 1. Best ten ears Yel- ow Corn, 1st H. C. Babcock 4 2nd, J. O. Davidson 2 3rd, B. G. Anderson 1. Long-  ear corn shown, 1st ---- J Loyd Lewis 1. F am and Garden  Best gollon wheat, 1st W. C. Har vey 2 2nd, M. m . V7. J. Cov-"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "51bs. Black wrappers, 1st <mark>Stratton</mark> Bros. 4  2nd,. <mark>W</mark> <mark>J</mark>. Wilkerson 2 3rd, Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "51bs. Black wrappers, 1st <mark>Stratton</mark> Bros. 4  2nd,. <mark>W</mark> <mark>J</mark>. Wilkerson 2 3rd, Robert"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.33, 170.84, 2126.05, 1727.45], "bbox_id": "d324641deb", "file": "AppomattoxNewspapers_1926-1933a_0334.pdf", "page": 1, "text": "L. Brown,4 2nd Mrs, D. Johnston, 2. White Leghorn Cock 1st, Horace Shirey, 2 2nd Horace Shirey, 1. Cockrel 1st, Miss Emma Ransom, 2 2nd Shirey Bros., 1. Hen 1st Mrs. Dud ley Johnston, 2 2nd, Horace Shirey, 1. Pullet 1st, Emma Ransom, 2 2nd Shirey Bros., 1. Pen 1st, Emma Ransom, 4 2nd Shirey Bros., 2. Brown Leghorn Cock 1st, E. K. Martin, 2. Cockrel 1st,, B. C. Anderson, 2 2nd, Al bert OBrien, 1. Hen 1st, R. L. OBriefi, 2 2nd, E. K. Mar tin, 1. Pullet 1st, H. A. Turnes, 2 2nd, Albert O Brien, 1. Pen 1st, E. K. Mar tin, 4 2nd, R. L. OBrien, 2. Plymouth RockCock 1st, Mrs. John Turnes, 2 2nd, William Moon, 1. Cockrel 1st, William Moon, 2 2nd, Mrs. Johjn Turnes, 1. Hen 1st, Shirey Bros., 2 2nd Mrs. Jqhn Turnes, 1. Pullet 1st, William Moon, 2 2nd, Shirey Bros., 1. Pen 1st, Mrs. John Turnes, 4 2nd B. G. Ander son, 2.  Buff Orpingtons, Best pair 1st A. R. Harwood, Jr., 2. Brahmas Best pair 1st, Grace Caldwell, 2. Indian GamesBest pair 1st, R. W. Babcock, 2 2nd, Mrs. W. P. Gills, 1. . AnconasBest pair 1st, Mrs. Maude Lucado, 2. Bronze Turkey Best pair 1st W. J. Smith, 2 2nd Mrs. W. T. Childers, 1. GeeseBest pair 1st W. J. Smith, 1. DucksBest pair 1st, Lenn Smith, Jr., 1 2nd James Dor- ton, .50. . BantansBest pair, 1st Jer ry Burke, Jr., 1. PigeonsBest pair, 1st Len Smith, Jr., 1. Department EAgricultural Products Class 1 Individual Farm Exhibit 1st, Mrs. D. P. Moon, 25 2nd Mrs. W. A. Moon, 15. Best Garden Collection  1st Mrs. O. L. Scheffler, 4 2nd, Mrs. Elizabeth Ford, 2. TobaccoBest 5 lbs. ship ping, 1stW. T. Childers 4, 2nd, Stratton Bros. 2 3rd, Arthur Booker, ribbon. Best 5 lbs Filler, 1stStratton Bros. 4 2nd, W. J. Wilkerson 2 3rd, Arthur Booker, ribbon. Best 51bs. Black wrappers, 1st Stratton Bros. 4 2nd, W. J. Wilkerson 2 3rd, Robert son Neighbors, ribbon. Best 51bs. Mahogany wrappers, 1st Stratton Bros. 4 2nd, W. J. Wilkerson 2 3rd, Stratton Bros, ribbon. Best 51bs Bright Tobafcco, 1stC. R. Ferguson 4 2nd, E. R. Ferguson 2 3rd, Obie Myers ribbon Class 2Corn Best ten ears Boone County White, 1st- H. C. Babcock 3 2nd, J. R Horsley 2 3rd, J. R. Horsley 1. Best ten ears Colliers E celsior 3rd, W. L. Coleman  1. Best ten ears Caseys Pure bred 1st J. R. Webb 4 2nd Byron Cole 2 3rd, John Turnes 1. Best ten ears Yel low Com, 1st H. C. Babcock 4 2nd, J. O. Davidson 2 3rd, B. C. Anderson 1. Long est ear com shown, 1st J Loyd Lewis 1. Farm and Gnaden  Best gollon wheat, 1st W. C. Har vey 2 2nd, M m . W. J. Cov ington 1. Best gallon Rye 1stJohn Turnes 1 2nd, T R. Carter 5Qc. Best peck tur nips, 1st R. W. Babcock 1 2nd, Lytton Harvey 50c. Best 3 heads cabbage, 1st C. M Stratton, Jr., 1 2nd, L. M Moses 50c. Best gallon onions 1st Willie Morris 1 2nd W. J. Wilkerson 50c. Best gallon sweet potatoes, yellow 1st Mrs. John D. Johnston 1 2nd. Mrs. Maude Lurado 50c. Best gallon swet pota toes, red, 1st W. L. Colemar. 1 2nd L. M. Moses 50c. Best gallon sweet potatoes, white 1st J. R. Webb 1 2nd, Mrs. S. Guy Smith 50c. Best gallon blackeye peas, 1st  Mrs. J. A. Stratton 1 2nd"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "51bs. Black wrappers, 1st <mark>Stratton</mark> Bros. 4 2nd, <mark>W</mark>. <mark>J</mark>. Wilkerson 2 3rd, Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "51bs. Black wrappers, 1st <mark>Stratton</mark> Bros. 4 2nd, <mark>W</mark>. <mark>J</mark>. Wilkerson 2 3rd, Robert"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.7, 1257.9, 1920.46, 1436.76], "bbox_id": "0de18383be", "file": "AppomattoxNewspapers_1908-1909a_0258.pdf", "page": 1, "text": "j Appomattox County Tuesday. She was the daughter of the late William D. Stratton lane  Mrs. Frances Stratton, an made her home in Appomat- jtox Coftnty all her life. Mrs. Carson is survived by one sister, Mrs. G. E- Drink- ard, of Appomattox, and a brother, J. Wesley Stratton, of Lynchburg. , W S W   Funeral,services were held from Bethel Methodist Church in Appomattox yesterday and burial was iri the church ceme tery  , . _ _____   0  -  - ,-i --- - --"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W", "W"], "snippet": "Appomattox, and a brother, <mark>J</mark>. Wesley <mark>Stratton</mark>, of Lynchburg. , <mark>W</mark> S <mark>W</mark>   Funeral,services were"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W", "W"], "snippet": "Appomattox, and a brother, <mark>J</mark>. Wesley <mark>Stratton</mark>, of Lynchburg. , <mark>W</mark> S <mark>W</mark>   Funeral,services were"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [187.0, 889.44, 387.05, 1760.35], "bbox_id": "83e76b10ad", "file": "AppomattoxNewspapers_1902-1905a_0217.pdf", "page": 1, "text": "F a n u e n  Club and Roads D is cussed by Mass-Meet luff. At a largely attended mass-meet iufc  here Thrsday, T. J. Stratton was mado-ohairputg rod W. j. Trent secretary. Major J. W. Flood made the openin speech in favor of a reg ular monthly Meeting day for Un people of the Qopnty, and suggested that a bill be drawn fixing regular monthly- meeting days for the su pervisors Wad school board. This propQeftton was voted down, bnt a committee was raised for the pur- po e of devising a plan and some scheme for getting the soverigns to gether monthly. This committte is expected to report to a mass-meeting which will be bold next month. There are many advantages to be , derived from . a monthly conference of our farmers, and we would be glad to have them assemble here in the capacity of an institute or club. There will be but one more term of the old county court and some kind of permanent institution should be organized to take its plaoe. The same organization took up the road question and after much discussion it was practically decided to rpfer the whole matter to a com mittee composed of the present and new board of supervisors, the newly elected road commissioners and per haps the aid of the magistrates will pointed be sought in getting up a plan to be submitted to a mass-meeting whiob is to be called for January or Feb ruary court. The sense Of  meeting was evidently in favor of retaining the road machine, and the discussion developed the fact that the road machine had, greatly im proved the roads. There are many of otit- citizens, however, who claim that the present system does not pay enough attention to the roughplaces and it would be well for the com mittee to consider carefully this fea ture of the plan they will provide or the meeting will almost certainly amend it. It is said there are sev eral roads in Stonewall which have been neglected for years. Mr. How erton who spoke for the contract system said that  a chain is no stronger than its weakest link, nor a road no better than its worse mud- hole. Mr. Bristow in offering his motion to repeal the road law enact ed last spring Bpoke with earnestnsss to his resolution and spoke of the great advantages of the machine over the labor and contract system. Major Flood, Hon. W, H. Ligon and Dr, Bobertson addressed the meeting No vote was taken which fairly pre sented the issue between the machine and the contract system, and it looks now like the whole matter will be np again for decision at the next mass-meeting, with the chances in favor of the machine. The roadi"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W", "j"], "snippet": "iufc  here Thrsday, T. <mark>J</mark>. <mark>Stratton</mark> was mado-ohairputg rod <mark>W</mark>. <mark>j</mark>. Trent secretary. Major"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W", "j"], "snippet": "iufc  here Thrsday, T. <mark>J</mark>. <mark>Stratton</mark> was mado-ohairputg rod <mark>W</mark>. <mark>j</mark>. Trent secretary. Major"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [729.79, 485.97, 1045.53, 799.41], "bbox_id": "6ad8e35292", "file": "AppomattoxNewspapers_1908-1909a_0062.pdf", "page": 1, "text": "and family    arm while cransing ms ruiu Miss Elva Stoatton, of Appo-lweek iforeJaat. , j mattox visited home people fori Mrl Russell Paulette, of Rich the holidays  Imond, visited home people here i Miss Annie Alvis, of Farm- Sunday.  ville. Miss Louise Woodson, News reaches us from Lynch- Lynchburg, Miss Alice Street, burg of the condition of Mr, Jeff of Lowesviile, and El wood Alvis Paulett he is improving after an attended the hall game in Roa- operation, we are glad to say.- noke Thanksgiving Day. Ken-1 Mr. and Mrs. Eugene Hamil- neth Alvis, of V. T . I , accom-lton, and children, spent the panied them home for the holi- week-end m Lynchburg at the days. Other guests in the Alvis I home, of Mr. and Mrs. Jim Fans home during the holidays includ- Isome weeks ago. ed Mr. and Mrs. Elwood Alvis, I MisS Jessie Pans, of Lynch- and baby, Misses Lucille and  burg whs has been quite sick for Kate OBrien, and Verna Hard-1 quite a while is improving we ng lare glad to report- Mr. and Mrs. G. A. Jacobs, Miss Ella Epperly spent of Richmond, visited Mrs. Jacobs 1 Thanksgiving in Roanoke with parents, Mr. and Mrs. C. M Iher relatiyes and friends. Stratton Saturday night and I Mr. Hubert Martin spent the S u n d a y . __ _ I week-end in this community. RaytRtwtttnn, nf Alexandria. I Dont forget the box supper visited hotne people a few days I Saturday night Dec. 4, at Rocks last week. I School House. Miss Mary Stratton, of Lynch-1 Mrs. W. J. Almond who fe has been visiting Mrs. Dunkley lsome time ago and hurt her arm Gunter. I which was paralized a few years Mrs. J. E. Carson is, spending!ago is getting on just-fine we are a few days in Lynchburg. Iglad -to report."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "School House. Miss Mary <mark>Stratton</mark>, of Lynch-1 Mrs. <mark>W</mark>. <mark>J</mark>. Almond who fe has"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "School House. Miss Mary <mark>Stratton</mark>, of Lynch-1 Mrs. <mark>W</mark>. <mark>J</mark>. Almond who fe has"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [577.5, 1794.28, 727.09, 2003.08], "bbox_id": "fdb5e56d12", "file": "AppomattoxNewspapers_1898-1902a_0190.pdf", "page": 1, "text": "_ C O U N T Y O FFICER S, treasurer- D. Mott Robertson, 733.  AttocV. for the CommonwealthH. e A y P. Coleman, 761. Jgk of County and Circuit Courts EPeers. 42 J . K. Horsley. 13. JBpmmissioner o f the RevenueL , E. , 47Y H . C. Babcock, 404. D IST R ICT O F FIC E R S. S o u t h s id b D is t r ic t . PJr SupervisorJ . O. Jones. 229. For ConstableA . H . Abbitt, 232. For justicesJ . T .A ee, 187 Lantech Jones,-  j . R. H ill, 82 S. E . Howorton, 74 E. G. vey, 180, C 1 .OVKR--H 11 .L D is t r ic t . Ir SupervisorW . H . logon. 233. Er Constable-C. W. Inge, 126 for W. B. EfjustlcesP. M. Hannah. 167 William J. it 188 J- H. Forbes, 69 P. H. Fore, 184. overseerof PoorJ. W. Wright, 224. S t o h b w a ia , D is t r ic t . SupervisorS. c. Stratton, 234. fonstableH. C. Doss, 127 J. E. Chick, JusticesA. B. Thornhill, 141 J. C. 1 160- W C. Abbitt, 170 N. W. Owen, Vi! Stratton, 39 J. H. Thornhill, 38 kidson, 23."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "C. Abbitt, 170 N. <mark>W</mark>. Owen, Vi! <mark>Stratton</mark>, 39 <mark>J</mark>. H. Thornhill, 38 kidson,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "C. Abbitt, 170 N. <mark>W</mark>. Owen, Vi! <mark>Stratton</mark>, 39 <mark>J</mark>. H. Thornhill, 38 kidson,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.66, 353.26, 1606.41, 472.52], "bbox_id": "d76892cc85", "file": "AppomattoxNewspapers_1892-1898a_0119.pdf", "page": 1, "text": "Tobacco Q uotations. The following are a few of the prices received by the farmers of Ap pomattox at Moormans, the Alliance Warehouse R. T. Moss, 14.00 T. B. Moore, 15.00 C. M. Stratton, 13.00 J. B. Drinkard, 13.00 W. N. Shearer, 13.25 W. C. Harvey, 13.00, and W. F. Wood, 1240 pounds, 15.00."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "Moore, 15.00 C. M. <mark>Stratton</mark>, 13.00 <mark>J</mark>. B. Drinkard, 13.00 <mark>W</mark>. N. Shearer, 13.25 <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "Moore, 15.00 C. M. <mark>Stratton</mark>, 13.00 <mark>J</mark>. B. Drinkard, 13.00 <mark>W</mark>. N. Shearer, 13.25 <mark>W</mark>."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [380.17, 249.16, 545.25, 647.26], "bbox_id": "88ef28739a", "file": "AppomattoxNewspapers_1902-1905a_0108.pdf", "page": 1, "text": "Tlte 1i iliiiny Ilian. riffyO uia0o Eleddtile Com mittee held a lengthy meeting in tin- court-house here Saturday, and adopted the following plan for hold ing the primary election on August 1st next, and transacted other busi ness. Resignation of Chairman S. L ergusou was offered and accepted in the following letter To the D em ocratic E xecutive Commltte A ppom attox County G entiem euOn acco u n t of my candidacy for the D em ocratic uom ination ior the office of A ttorney for th e Com m onwealth for Ap pom attox county, which I now have the honor to hold, 1 deem it lib to resign the Chairman snip of your com m ittee, and therefore do Hereby ten d er my resignation as yo u r chair man, to take effect on the convening of your com m ittee on May both a t Appom attox Court house, which m eeting i, as your chairm an, have called. Jn severing my official relation w ith your com m ittee, 1 am rem inded of the harm ony and u n ity with whicn we have worked for the past eight years, during which tim e 1 have hud the honor to oe yout chairm an, and d u r ing w hich we ha o won every single battle we have fought, b u t for these vac to n es i claim no special cred it, as the resu lt of the work of the D em ocratic party organization in this county has not been due to the worK of atiy individual, b u t to the united efforts ot a harm onious organization and th e hearty co jpciation of a splendid D em ocratic people. A ssuring you and each oi you th a t as a pri vate in the ranks my services are a t you, command, and to follow where you lead win always be my pleasure 1 am Very sincerely yours, 6. L. F khgusok , , Chairmam Dem. Ex. Com m ittee A ppoinuttox County. On motion of li. T. Thornhill T. J. Stratton was eketed temporary chairman. W. 11. Ligon offered the foilowing resolution"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "li. T. Thornhill T. <mark>J</mark>. <mark>Stratton</mark> was eketed temporary chairman. <mark>W</mark>. 11. Ligon offered the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "li. T. Thornhill T. <mark>J</mark>. <mark>Stratton</mark> was eketed temporary chairman. <mark>W</mark>. 11. Ligon offered the"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1314.96, 770.92, 1459.04, 869.71], "bbox_id": "f8a50a8d33", "file": "AppomattoxNewspapers_1892-1898a_0286.pdf", "page": 1, "text": "T. A. Smith  Co., will present heir patrons with a handsome por- rait, free, for very 5 spent with hem. Capt. J. W. Carson and Miss Ida Stratton, of Spanish Oaks, were arried last Wednesday, March 11, y Dr. ilea 3 . Taylpr, of this place."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "spent with hem. Capt. <mark>J</mark>. <mark>W</mark>. Carson and Miss Ida <mark>Stratton</mark>, of Spanish Oaks, were"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "spent with hem. Capt. <mark>J</mark>. <mark>W</mark>. Carson and Miss Ida <mark>Stratton</mark>, of Spanish Oaks, were"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1919.27, 375.5, 2088.11, 474.35], "bbox_id": "9665f1189c", "file": "AppomattoxNewspapers_1939-1943a_0078.pdf", "page": 1, "text": "Stonewall, April 10.- Rev. J .W- Simmons, Mrs. P . B. Stratton, Miss Edna Adcock and Mrs. G . P . Jen nings attended the Appomattox As sociations! W.M.U. meeting at the Falling River ch,ii Wednesday. Mr and Mrs. Calvin H . Robin son, of Appomattox were Sunday dinner guests of Mr. and Mrs. O. R. Tumes."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "Stonewall, April 10.- Rev. <mark>J</mark> .<mark>W</mark>- Simmons, Mrs. P . B. <mark>Stratton</mark>, Miss Edna Adcock and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "Stonewall, April 10.- Rev. <mark>J</mark> .<mark>W</mark>- Simmons, Mrs. P . B. <mark>Stratton</mark>, Miss Edna Adcock and"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [827.49, 176.04, 992.13, 1083.68], "bbox_id": "7676fbd715", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "Special driving classL. E. Sm ith 1 C. Y. R and 2 F. L. Browning. Class 5 Three year old percheron, 1, J. W. C arter 2, L. E. Sm ith 3, W. T. Nash. One year old, 1, S. G. Smith.  CGASS 6 Mule colt, w eanling 1st C. W. C arter CGASS 7 D raft team s 1st, C. W. C arter. CGASS 9 Ponies 1st, Bolling, Flood 2nd. Gen Smith. CGASS 10 H ackney, 2-year-old  1st. H. D. Flood 2nd, C. Y. R and 3rd, S. G. Smith. CLASS 11 Percheron stallion  1st, W. E. Smith. C attle Jersey bull 1st, L. E. Sm ith 2nd, C. N. Abbitt. Registered heifer 1st, L. E. Smith 2nd, Cabell C arter 3rd, R. C. W agner. G rade Jersey cow 1st, L. E. Smith 2nd, IR. C. W agner. R egistered cow 1st, L. E. Smith 2nd, R. C. W agner. H olstein bull, 2-year-old  1st, Holmsey Smith. H erford, registered  1st, H. D. Flood. Two-year-old bull  1st, H. D. Flood 2nd, D. Flood. Guernsey bull, 1-year-old  C. G. Rand. G rade Guernsey heifer 1st, H. D. Flood 2nd, R. G. R ogers 3rd, H. D, Flood. R egistered G uernsey cow 1st, H. D. Flood 2nd, H. D. Flood. R egistered Guernsey bull  1st, Holmsey Smith 2nd, H. D. Flood. Shorthorn bull 1st, M. C. Sm ith 2nd, J. H. Turner. G rade shorthorn heifer 1st, M. C. Sm ith 2nd, M. C. Smith. Hogs D uroc boar-1st, R andolph OBrien 2nd, M. C. Sm ith 3rd, H. Smith. Poland china sow  1st, F rank H anenkrat. Poland china boar  1st, F rank H anenkrat. B erkshire boar 1st, H. A. Turns 2nd, C. N. Abbitt.  1 Sow and six pigs  1st. Holmsey Smith. i Duroc sow-1st, Albert Lee 2nd, 1 M. C. Smith. F at hog 1st, A lbert Gee. Pure bred gilts 1st, G. A. SKirey 2nd, H. H. Shirey 3rd, Albert Lee. Sweepstake boar  1st, R andolph OBrien 2nd, M. C. Sm ith. Sweepstake sow 1st, F rank H anen k rat 2nd, A lbert Lee. Sweepstake gilts 1st, G. A. Shirey 2nd, H. H. Shirey. Poultry Cookeral W yndotte  1st, W. C. Chilton. Belgian hares 1st, R. C. W agner 2nd, Chas. Crawley. i R. I. cockered 1st, J. H. P ulliam  2nd, Mrs. W. M. Hancock. R. I. pullet 1st, J. D. Johnson 2nd, Mrs. W. L. Brown. R. I. pen 1st, J. D. Johnson 2nd, Mrs. W. L. Brown. H en 1st, Mrs. W. G. Brown 2nd, Mrs. J. A. Stratton. Cock 1st, Mrs. W. L. Brown 2nd, Mrs. J. A. Stratton. R. C. R. I. pen 1st, Mrs. T. H. Inge. R. C. R. I. hen 1st, Mrs. T. H. Inge. B. R. pen 2nd, Airs. S. G. Smith. B. R. cock 1st, Mrs. S. G. Smith 2nd, C. G. Rand. B. R. pullet 1st, E. G. Sm ith 2nd, E. L. Smith. P air B. Rock  1st, Mrs. J. H. Turnes 2nd,Mrs. J. H. Turnes. Best pair buff Orpingtons 1st, Mrs. W. P. Gills. Best pen buff Orpingtons 1st, Mrs. W. P. Gills 2nd, Mrs. W. P. Gills. W hite orphington cock 2nd, Eddie Babcock. W hite orpington hen 2nd, Eddie Babcock. W hite leghorn pen 1st, D. B. D e laney 2nd, D. B. Delaney. W hite leghorn cock 1st, D. B. D e laney. P air guinaes 1st, V irginia Smith. P air ducks 1st, D. B. Dulaney. B antam s 1st, Miss N. W. Jennings 2nd, D. B. Dulaney. Brown leghorn 1st, J. P. M arshall. Turkeys 1st, Cabell C arter. Piegeons 1st, Chas. F. Jam es. Schools E xhibits High School 1, Appomattox high school. Ju n io r high school, 1, V era,h ig h school 2, Stonewall. One room, 1, W oodland school 2, Falling Rive r . _____ , __"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "G. Brown 2nd, Mrs. <mark>J</mark>. A. <mark>Stratton</mark>. Cock 1st, Mrs. <mark>W</mark>. L. Brown 2nd, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "G. Brown 2nd, Mrs. <mark>J</mark>. A. <mark>Stratton</mark>. Cock 1st, Mrs. <mark>W</mark>. L. Brown 2nd, Mrs."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.53, 230.34, 2160.2, 374.53], "bbox_id": "c6ee45f51f", "file": "AppomattoxNewspapers_1892-1898a_0433.pdf", "page": 1, "text": "Protracted meetings áre now go-1 R pv . Jud Davidson of Baltimore, ! ing on in onr .county at Hebron this has be. n visiting his old home in week and will commence at Hennnn I this coufitv. next Sunday. J Rev. Mr. Dow ley who was expected Mr. and Mrs. E. W. Taylor re-! to assist I r. Taylor in his meeting al turned Monday from an extended j Hebron is detained bv sickness, trip east, where they visited Niagara, j Mr. Walker. LeG rand of Lynch Atlantic city and other interesting j burg is visiting Mr. W. B. TVylor points. . and is ill with a relapse of fever. The season for squirrel stews is j He- and Mrs. I. J. Stratton cann on. Mr. S. W. Harvey and the bonie frm Richmond last week, Mj j nJonths nt lliees Va., with her sister good people of the Red.House neigh- Stratton will spend a short vacation j  HamiUon"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "He- and Mrs. I. <mark>J</mark>. <mark>Stratton</mark> cann on. Mr. S. <mark>W</mark>. Harvey and the bonie"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "He- and Mrs. I. <mark>J</mark>. <mark>Stratton</mark> cann on. Mr. S. <mark>W</mark>. Harvey and the bonie"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1753.19, 506.89, 1848.85, 802.49], "bbox_id": "f75647084f", "file": "AppomattoxNewspapers_1922-1923a_0055.pdf", "page": 1, "text": "On last Sunday the pastor of Stonev terian clurch mad to the congregation the magisty of the posed to anarchy legging. At the address the folio openly pledged th band together for tl aud comp ete dost moonshining in C to wn J. P. Alvis, son, W. D. Paris, C. E. H. Carson, T. I. A. Drinkard, J. N. H. Tanner, W. Li H. Stratton, Sterl aud J. T. Whitte were present other eojoy the protection but who failed to a ic as their duty to law."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "J. N. H. Tanner, <mark>W</mark>. Li H. <mark>Stratton</mark>, Sterl aud <mark>J</mark>. T. Whitte were present"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "J. N. H. Tanner, <mark>W</mark>. Li H. <mark>Stratton</mark>, Sterl aud <mark>J</mark>. T. Whitte were present"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [556.84, 475.42, 712.44, 760.72], "bbox_id": "c049962694", "file": "AppomattoxNewspapers_1922-1923a_0056.pdf", "page": 1, "text": "On last Sunday morning the pastor of Stonewall Preoby terian caurch made an appeal to the congregation to uphold the m agisty of the law as op posed to anarchy and  boot legging . At the close of the address the following men openly pledged them selves to band together for the absolute and comp ete destruction of moonBhining in th a t vicinity to wit J. P. Alvis, S E. Ander son, W. D. Paris, C. M. Stratton, . H. Jarson, T. H. Wright, f . A. D rinkard, J. A. Stratton, N. H. Tanner, W. M. Jones, H. H. StrattOD, SterlingScruggt and J. T. W hitten. Then were present other men who enjoy the protection of the law but who failed to acknowledgt it as their duty to protect th taw."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "f . A. D rinkard, <mark>J</mark>. A. <mark>Stratton</mark>, N. H. Tanner, <mark>W</mark>. M. Jones, H. H."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "f . A. D rinkard, <mark>J</mark>. A. <mark>Stratton</mark>, N. H. Tanner, <mark>W</mark>. M. Jones, H. H."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [194.64, 1071.6, 365.85, 1756.69], "bbox_id": "b2cd8204c6", "file": "AppomattoxNewspapers_1908-1909a_0037.pdf", "page": 1, "text": "Miss Frances Stratton is visit . ing relatives in Lynchburg Miss Delia Stratton visitec Miss LeGrande in Lynchburg for the week-end and accom pained- them to Monticello Sun day. Misses Anna and Fannie Le Grande, Miss Frances Stratton and Mr. and Mrs. Fitzgerald, pf New York , were supper guests of Mr. and Mr. J. A. Stratton Monday evening. Mrs. W. H. Drinkard spent last week in Lynchburg with her daughter, Mrs. F. C. Drinkard and son, Buck Drinkard Miss Hazel Taylor expects to leave Sunday for Richmond High School where she will at tend school this winter. Mr. and Mrsiilf., Chick, and daughter, Grace, of Norfolk, are visiting relatives in the county this week. Mrs. H. S.. Jennings and daughters, Virginia, and Mary, of Cheran, S. C., have concluded a visit with Mr and Mrs. T. A. Drinkard. ----  Alton Drinkard, who is spend ing several weeks with his parents, is visiting his sister, Mrs. H. S. Jennings in Cheran, Sre - Mrs. U. M. Stratton, Jr. ,- and daughters, Louise and Fay, left last week for Atlanta, Ga., where they will make their home, after spending the summer with Mr. and Mrs. E. H. Carson. Charlie Stratton, of Atlanta, visited his parents for a few days last week. Mrs J P. Alvis. and daughter, Miss Annis, spent Wednesday in Farm ville and Cumberland. A beautiful young deei was captured by the tenants on Mr. W. S. Taylors farm last Satur day He is being kept in a safe  lace until they have a sale for j. A rattle snake was seen by Sears Taylor on the same farm last week. Mrs. Clayton T. Drinkard and son, Clayton, Jr., expect to leave Friday for Franklin for a visit with relatives.  Scott and George Street, of Richmond visited C. J. Harding and family last week. Miss Elizabeth Rice has con cludedan extended visit with Mrs. S El. Anderson, and other friends. LiiJ"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "of Mr. and Mr. <mark>J</mark>. A. <mark>Stratton</mark> Monday evening. Mrs. <mark>W</mark>. H. Drinkard spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "of Mr. and Mr. <mark>J</mark>. A. <mark>Stratton</mark> Monday evening. Mrs. <mark>W</mark>. H. Drinkard spent last"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [194.36, 1096.07, 365.59, 1781.49], "bbox_id": "cda4db33ac", "file": "AppomattoxNewspapers_1926-1933a_0037.pdf", "page": 1, "text": "Miss Frances Stratton is visit . ing relatives in Lynchburg Miss Delia Stratton visitec Miss LeGrande in Lynchburg for the week-end and accom- pained them to Monticello Sun day. Misses Anna and Fannie Le Grande, Miss Frances Stratton and Mr. and Mrs. Fitzgerald, of New York , were supper guests of Mr. and Mr. J. A. Stratton Monday evening. Mrs. W. H. Drinkard spent last week in Lynchburg with her daughter, Mrs. F. C. Drinkard and son, Buck Drinkard. Miss Hazel Taylor expects to leave Sunday for Richmond High School where she will at tend school this winter. Mr. and Mrs. iiaf. Chick, and daughter, Grace, of Norfolk, are visiting relatives in the county this week. Mrs. H. S. Jennings and daughters, Virginia, and Mary, of Cheran, S. C., have concluded a visit with Mr and Mrs. T. A. Drinkard. Alton Drinkard, who is spend ing several weeks with his parents, is visiting his sister, Mrs. H. S. Jennings in Cheran, S. C. Mrs. C. M. Stratton, Jr., and daughters, Louise and Fay. left last week for Atlanta, Ga., where they will make their home, after spending the summer with Mr. and Mrs. E. H. Carson. Charlie Stratton, of Atlanta, visited his parents for a few days last week. Mrs J P. Alvis. and daughter, Miss Annie, spent Wednesday in Farmville and Cumberland. A beautiful young deer was captured by the tenants on Mr. W. S. Taylors farm last Satur day. He is being kept in a safe place until they have a sale for him. A rattle snake was seen by Sears Taylor on the same farm last week. Mrs. Clayton T. Drinkard and son, Clayton, Jr., expect to leave Friday for Franklin for a visit with relatives. Scott and George Street, of Richmond visited C. J- Harding and family last week. Miss Elizabeth Rice has con cluded an extended visit with Mrs. S. E. Anderson, and other friends."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "of Mr. and Mr. <mark>J</mark>. A. <mark>Stratton</mark> Monday evening. Mrs. <mark>W</mark>. H. Drinkard spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "of Mr. and Mr. <mark>J</mark>. A. <mark>Stratton</mark> Monday evening. Mrs. <mark>W</mark>. H. Drinkard spent last"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1140.01, 186.56, 1302.38, 952.14], "bbox_id": "f9f29344f7", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j Serial No. Name j 416, Floyd Custis Gordon  617, George Wiley Harding  526, Lewis L Doss  613, Cleveland Eagle 609, Harry S. Drinkard 316, Russel Jenkins 274, James Burton 546, Hunter Milton Moore 511, Thomas Vawter 206, Shelton Herry Hudson 342, Sam Henry Goin 293, Charles Willie Orange 460, Charlie W. Soruggs 427, Joel Thomas Morris 666, Geo. Washington Green 241, Ed Reed 40, Kenneth W Furbush 100 , Samuel Arlington Per dieu 572, Harry Tucker Woodson 167, Benjamin Patterson 214, Lawrence Mann 236, Floyd Wyatt Harvey 647, Willie A. Weakley 629, Oolonel Thomas Mays 29, Walter Emerson Durham 533, Robert Thomas Kyle 61, Eugene Watson Harris 114, Easel LeRoy Smith 151, James Leonard Moss 618, Wm. Edward Harris 603, Joseph Owen Carson 33, Arthur Fleshman 209, Walter Clifton Lee 32, Ernest Ferguson  63, Odell Howerton I 362, William Lee Goode I 371, William Henry Marshall j 529, John Samuel Guill j 64, O. Kendall Hunter 382, Robert Odie Abbitt  224, Ernest Reid 449, Geokge Wesley Wright 41, Lawrence E. Furbush 38, Marshall Hubert Franklin j 48, Wiley W Godsey 640, Stratton Marvin Ander- son  668, Luther Johtr-Hubbard 88, David P Moon 127, Samuel D Whitaker j 287, Herbert H u d s o n Jen- niugs  260, Joseph P Panlett ! 473, Freeman Thomas Tinsley 586, Samuel Johnson 527, William Herman Guill 254, Daniel W Dinkins 446, Alfred Berkley Turnes 89, Wm. Archer Moon 358, Wiley Young 573, George Washington Aus tin 451, R Childress Wright"}, "highlight": {"text": {"matched_tokens": ["j", "W", "Stratton"], "snippet": "38, Marshall Hubert Franklin <mark>j</mark> 48, Wiley <mark>W</mark> Godsey 640, <mark>Stratton</mark> Marvin Ander- son  668,"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Stratton"], "snippet": "38, Marshall Hubert Franklin <mark>j</mark> 48, Wiley <mark>W</mark> Godsey 640, <mark>Stratton</mark> Marvin Ander- son  668,"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [610.53, 572.66, 768.96, 1808.57], "bbox_id": "18f078c1bc", "file": "AppomattoxNewspapers_1954-1955a_0095.pdf", "page": 1, "text": "Hughes, Mrs. Frances Isbell, Donald Irvin, Mrs. Ethel S. Irvin, Willard A. Jennings, Mrs. Mary N. Jennings, Alma V. Jones, Geo. L. Johnson, D. B. Jennings, Minnie May Johnson, Mrs. V. L. Johnson, James H. Johnson, Eppes . Johnson, Annie Cardwell King, Floyd R. King, E. Z. King, T. A. King, Jackson F. Lee, Mrs. Anna L. Laughon, Theodore Laughon, J. D. Laughon, K. O. Laughon, R. S. Laughon, Landis L. Moore, R. L. Moore, F. E. Moore, J. I. Moore, Miss Alva Moore, Miss Lois  Moore, Miss Elizabeth Martin, Tom H. Martin, T. M. Martin, Ural McHargue, J. C. Mays, B. W. Mays, R. L. Marshall, Wm. B. Mayberry, Newton D. Mayberry, W. W. McCormick, Lewis Jr. Mayberry, J. H. Neighbors, J. W. Jr. Patterson, IS. H. Perdue, Geo. E. Powell, Mrs. Lillie Perdieu, E. A. Perdieu, E. Mott Powell, N. D. Pankey, Leslie I. Routon, R. H. Rosser, Geo. W. Rogers, John H. Routon, Mrs. Delilah F. Roberts, Eugene C. Routon, Mrs. L. A. Robertson, D. T. Stratton, E. M. Stratton, J. A. Stratton, Mrs. Bessie L. Stratton, Miss Delia Spencer, R. S. Stern, W. H. Simmons, J. W. Simmons, Mrs. Frances B. Stratton, Miss Elva Stanley, Kemper W. Stanley, Mrs. Lettie H. Scruggs, Mrs. Rosa B. Smith, S. P. Smith, H. A. Stratton, W. R. Shirey, Louise B. Shirey, Betty Shirey, H. W. Shirey, R. P. Shirey, Mrs. Edythe H. Shirey, Mrs. Marie S. Spain, C. E. Smith, E. F. Smith, Mabel E. Stratton, Margaret B. Smith, Guy E. Smith, Harvey A. Jr. Turnes, T. E. Thornhill, R. H. Tanner, Mattie J. Tanner, Sue B. Tanner, Etna P. Tyree, R. M. Tyree, Mrs. Lily B. Tyree, H. S. Tinnell, F. A. Tinnell, Sidney Tinnell, G. W. Thompson, T. J. Turnes, Nellie Moore Thomas, Faye S. Tweedy, Robert W.  Thornhill, Martha Watkins Trent, C. F. Taylor, Hazel Ann Weakley, R. A. Thomas, Dan T. Thomas, Mrs. Pauline Wharton Wright, T. H. Wright, J. E. Whitehead, J. B. Woodson, C. N. Whitten, J. T. Whitten, F. D. Wharton, Mrs. F. L. Wharton, Dick Wooten, E. P. Wright, Mrs. Susie Wright, W. Harlow Wheeler, Ben D. Wheeler, Robert Irby Wheeler, Max L. Wilkerson, Hubert L. Colored Abbitt, Joe M. Ferguson, J. P. Ferguson, Hudson Ferguson, W. J. Hix, Leman ,c"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "Stern, W. H. Simmons, <mark>J</mark>. <mark>W</mark>. Simmons, Mrs. Frances B. <mark>Stratton</mark>, Miss Elva Stanley, Kemper"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "Stern, W. H. Simmons, <mark>J</mark>. <mark>W</mark>. Simmons, Mrs. Frances B. <mark>Stratton</mark>, Miss Elva Stanley, Kemper"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.33, 455.32, 1742.01, 576.21], "bbox_id": "9b0ea435b3", "file": "AppomattoxNewspapers_1908-1909a_0113.pdf", "page": 1, "text": "Guy, and mother, Mrs. Herring, of Washington,D. C., were week end guests of Mr. and Mrs.  A. F. Drinkard.. Mrs. G. A Jacobs, and daugh ter Betty, of Harrisonburg, are spending some time with the formers parents, Mr. and Mri 0. M. Stratton, Sr. Mr. and Mrs. J. W. Neighbors"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mri 0. M. <mark>Stratton</mark>, Sr. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mri 0. M. <mark>Stratton</mark>, Sr. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1779.09, 767.07, 1938.79, 893.96], "bbox_id": "7df34ada36", "file": "AppomattoxNewspapers_1933-1936a_0463.pdf", "page": 1, "text": "Gladstone, May 20.- Mrs. Horace yior visi.ed t.er daughter, Mrs. , rfuil Hughes, at Allens Creek Liaday. , , Mabel Doyle, of Richmond, m Mrs. E.D. fost, of Midlothian t..e weeic end guests of Mrs. brey Map or and Mrs. W. L. i atts. Mildred Murray spent the veek end with Miss Faye Stratton , Stonewall. Mr. add Mrs. J. W. Wright pent the week end in Lovingston."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "end with Miss Faye <mark>Stratton</mark> , Stonewall. Mr. add Mrs. <mark>J</mark>. <mark>W</mark>. Wright pent the week"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "end with Miss Faye <mark>Stratton</mark> , Stonewall. Mr. add Mrs. <mark>J</mark>. <mark>W</mark>. Wright pent the week"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.3, 498.26, 1787.17, 1280.11], "bbox_id": "e169f9d4cb", "file": "AppomattoxNewspapers_1926-1933a_0113.pdf", "page": 1, "text": "end guests of Mr. and Mrs. A- F. Drinkard. Mrs. C. A. Jacobs, and daugh ter Betty, of Harrisonburg, are spending some time with the formers parents, Mr. and Mrs. C. M. Stratton, Sr. Mr. and Mrs. J. W. Neighbors Jr., of Lynchburg, were week end guests of the formers pa rents, Mr. and Mrs. J. W. Neigh bors. Mrs. H- tsS. Jennings, and children, Virginia and Bobbie, of Cheran, S. C., are expected Saturday, to spend some time with Mrs. Jennings parents, Mr. and Mrs, T. A. Drinkard. Sears Taylor, a senior at V. P. I., is home for this week. He will return Friday for the finals. Mrs. J P. Aiyis, and daugh ter, Miss Annie, returned from her school Tuesday from Cum berland county, afid Mrs. j. M. Street, of Lowesyille, are ex pecting to leave Saturday for V. P. I to attend the finals. Ken neth Alvis is a member of the Senior Class. Mrs. C. M- Stratton, Jr., and daughters Louise and Fay, of Atlanta, Ga., arrived Monday night to spend the summer with the formers parents, Mr. and Mrs. E. H. Carson, Stonewall school closed Mon day evening with graduating ex ercises. There were 4 members of the class, John Alvfe, Jr., Marshall Stratton, Jr., Frances Hamilton and Miss Landis Laughon. The address was de livered by Treasurer R. L. Burke, of Appomattox. Rev. A. I. Caudle preached the sermon in Stonewall Church Sunday evening to a large audi ence. Saturday nght the pri mary and grammar grades gave very good program. Miss Lucille Dudley left Tues day for her home in Rocky Mount, Va. Misses Earl Patte son and Myrtle Smith left for their home at Appomattox and MissVirginia Harvey to her home at Oakville. Miss Elva Stratton, a member of A. A. H. S. faculty, came lome Tuesday to spend her va cation. Mrs. T. A. Wright, of near Stonewall is ill with pneumonia"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>, Sr. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors Jr., of Lynchburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>, Sr. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Neighbors Jr., of Lynchburg,"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [824.89, 1432.38, 983.07, 1536.67], "bbox_id": "2a2fdccf49", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "COMMITTEE ON MUSIC. 0. A. Abbitt, Clinton Cawthorn, C. W. Hancock, J. R. Caldwell, Peter Stratton. Other membes of the committee are Maj. J. W. Flood, J. K. Hannah, Judge D. A. Christian, J. R. Horsley, Dr. T. W. Evans, J. H Robertson."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "Abbitt, Clinton Cawthorn, C. <mark>W</mark>. Hancock, <mark>J</mark>. R. Caldwell, Peter <mark>Stratton</mark>. Other membes of the"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "Abbitt, Clinton Cawthorn, C. <mark>W</mark>. Hancock, <mark>J</mark>. R. Caldwell, Peter <mark>Stratton</mark>. Other membes of the"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [333.06, 1152.42, 490.33, 1466.46], "bbox_id": "3a36d13f86", "file": "AppomattoxNewspapers_1902-1905a_0317.pdf", "page": 1, "text": "A t a convention of delegates from the several precincts of this coun ty hold here Saturday afternoon, the following delegates and alternate were elected to the State Democratic convention Deleg ttes-H. D. Flood, F . W. Mc Kinney, W. H . I.igon, W. D. Hix, Dr. D. Mot Robertson, Dr. J . II.- Abbitt, S. L. Ferguson, J . O. Jones T . W. Moses. Joe Button, T. J . Stratton, Alternates-W. F . Wright, 8. R. Dickerson, E . I. Seurs, W. J . laulet e, A . II. Howerton, J . N. Wooldridge, J . R. Atwood, R. C. Mann, W. H. Lewis, J . O Shearer, J . R. IIorsleF. The unit rule was adopted and resolutions passed endorsing Con gressman Flood iu the highest terms as his own successor. The prim-try plan was not discussed, but it is beleived that the plan is generally approved by he Democrats of tbe county. We wish tbe delegation a pleasant and harmonious convention."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "J . O. Jones T . <mark>W</mark>. Moses. Joe Button, T. <mark>J</mark> . <mark>Stratton</mark>, Alternates-W. F . Wright, 8."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "J . O. Jones T . <mark>W</mark>. Moses. Joe Button, T. <mark>J</mark> . <mark>Stratton</mark>, Alternates-W. F . Wright, 8."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1076.65, 814.54, 1241.15, 1668.17], "bbox_id": "b3ede67a55", "file": "AppomattoxNewspapers_1952-1954a_0022.pdf", "page": 1, "text": "W. M. Abbitt George Abbitt, Jr. J. W. Conner D. A. Conner G. B. Buchanan Mrs. Calvin Robinson P. Brent Stratton Chas. T. Moses C. W. Smith J. H. OBrien Caroline M. Smith David T. Robertson H. Y. Spencer Spencers Drug Store Fred C. Smith Moses Motor Co., T. W. Moses A. G. Gaines B. C. Rogers S. C. Arrington Bobs Cash Store, R. B. Haley, Jr. C. Lewis McDearmon, Appomattox Oil Co. W ootton Milling Co., A. W. Wootton C. S. Jenkins J. A. Burke R. L. Burke Wm. W. Burke F, J. Smith A. R. Harwood, Jr. C. V. Mitchell I- T. Almond Chas. F. James J. R. Hamilton W. R. Brightwell J. E. Tolley J T. Guill Jessalyn Drinkard T. Hunter Dickerson William A. Hunter R- B. Boney Thomas T. M artin G. Dudley w. C. Ould Charles D. McCorimck M r. E tM l . McCormick Charlie H. Goff Mrs. Elizabeth W heeler Malcolm A. Booker Mrs. Malcolm Booker Mrs. Curry Moore I N. Phelps Hunter Lumber Co., C. K. Hunter T. M. Trent C. C. Poe J. C. Caldwell Jacob Lew Grover E. Smith W ilkes Jewlers John S. G rinds"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "Calvin Robinson P. Brent <mark>Stratton</mark> Chas. T. Moses C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Caroline M."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "Calvin Robinson P. Brent <mark>Stratton</mark> Chas. T. Moses C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Caroline M."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1112.17, 694.48, 1275.96, 1640.99], "bbox_id": "76db1bfbae", "file": "AppomattoxNewspapers_1952-1954a_0030.pdf", "page": 1, "text": "W. M. Abbitt George Abbitt, Jr. J. W. Conner D. A. Conner G. B. Buchanan Mrs. Calvin Robinson P. Brent Stratton Chas. T. Moses C. W. Smith J. H. OBrien Caroline M. Smith David T. Robertson H. Y. Spencer Spencers Drug Store Fred C. Smith loses motor Co., T. W. Moses A. G. Gaines B. C. Rogers S. C. Arrington R a L. p ..L s v-caoi. store, R. B. Haley, Jr. C. Lewis McDearmon, Appomattox Oil Co. Wootton Milling Co., A. W. Wootton C. S. Jenkins J. A. Burke R. L. Burke Wm. W. Burke F. J. Smith A. R. Harwood, Jr. C V. Mitchell J. T. Almond Chas. F. James J. R. Hamilton W. R. Brightwell J. E. Tolley J. T. Guill Jessalyn Drinkard T. Hunter Dickerson William A. Hunter R. B. Boney Thomas T. Martin C. Dudley W. C. Ould Charles D. McCorimck Mrs. Ethel L. McCormick Charlie H. Goff Mrs. Elizabeth Wheeler Malcolm A. Booker Mrs. Malcolm Booker Mrs. Curry Moore J N. Phelps Hunter Lumber Co., C. K. Hunter T. M. Trent C. C. Poe L C. Caldwell Jacob Lewis Grover E. Smith Wilkes Jewlers John S. Grinels Charles R. Thomas Appomattox Garment Co., Inc. Englander, Pres. A. Herncall R Rutledge R. E. Wilbun C. Dresser"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "Calvin Robinson P. Brent <mark>Stratton</mark> Chas. T. Moses C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Caroline M."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "Calvin Robinson P. Brent <mark>Stratton</mark> Chas. T. Moses C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Caroline M."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.95, 347.65, 1883.19, 990.75], "bbox_id": "0c37e62dbf", "file": "AppomattoxNewspapers_1908-1909a_0273.pdf", "page": 1, "text": "The following jurors have been drawn for the June term. Criminal JUry2ndCourt ney C. HaiVey, Joel T. Morris, J. W. Coleman, Jr., W. Thos. Caldwell, Frank E. Jennings, Clayton T. Drinkard, John B. Chilton, H. M. Marshall, Thos. A. Guill, Rev. R. E. Redding, Harry W. Jenkins, A. T. Inge, Eldridge G. Cheatham, E- F. Pettinger, E. H. Carson, H. C. Wheeler, J. O, Davidson, Jas. W_ Childers, J. E. Burnette, R. E. Caldwell, Jr., W. J. Le- Grand, J. A. Garrett, Robt. M. Mitchell, S. W. Alvis. Petite Jury 3rd J, B. Wil son, S. T. Megginson, Jr., R. Curtis Haryey, Thos. H. Wright J. O. Robertson, L. J. Hatcher, R. S. Wheeler, Irby B. Wheeler. Grand Jurors 1stSam A. Ferguson, H. C. Babcock, R. F. Jamerson, J. Dillard Morris, T._ W. Odor, L. E. Smith, C. E. Car- son, T. A. King, C. E. Lewis, J. E. Martin, H. H. Stratton, R. W. Abbitt. o ------  Memorial Day Confederate Memorial Ex ercises at Appomatox Con federate Cemetery June 3rd, 330 p.m. Confederate Vete rans, Honary members, and speakers escorted to the dais by the daughters. U. D. C. ritual lead by jthe president of Appomattox chap ter, Mrs. N. A. Wagers. Decoratapn of soldiers, by the daughters. Decoration of graves by children of the confederacy. Salute the Flags, daughters, children, W. W. Veterans. SongBonny Blue Flag. AddressMrs. William Ca bell Flournoy, past president  historian Va. Div. Song, Dixie. Introduction o f oratorJ. A. Burke. Address P r o f . Fitzhugh Flournoy, Washington  Lee University, winner of U. D. C. scholarship Oxford, England 1928. Song, Old Folks at Home. America."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "King, C. E. Lewis, <mark>J</mark>. E. Martin, H. H. <mark>Stratton</mark>, R. <mark>W</mark>. Abbitt. o ------  Memorial Day"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "King, C. E. Lewis, <mark>J</mark>. E. Martin, H. H. <mark>Stratton</mark>, R. <mark>W</mark>. Abbitt. o ------  Memorial Day"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1725.64, 368.02, 1888.25, 674.26], "bbox_id": "c6364c2eb7", "file": "AppomattoxNewspapers_1926-1933a_0273.pdf", "page": 1, "text": "The following jurors have been drawn for the June term. Criminal Jtiry 2ndCourt ney C. Harvey, Joel T. Morris, J. W. Coleman, Jr., W. Thos. Caldwell, Frank E. Jennings, Clayton T. Drinkard, John B. Chilton, H. M. Marshall, Thos. A. Guill, Rev. R. E. Redding, Harry W. Jenkins, A. T. Inge, Eldridge G. Cheatham, E. F. Pettinger, E. H. Carson, H. C, Wheeler, J. O. Davidson, Jas, W. Childers, J. E. Burnette, R E. Caldwell, Jr., W. J. Le Grand, J. A. Garrett, Robt. M Mitchell, S. W. Alvis. Petite Jury 3rd J, B. Wil son, S. T. Megginson, Jr., R. Curtis Haryey, Thos. H. Wright J. O. Robertson, L. J. Hatcher, R. S. Wheeler, Irby B. Wheeler, Grand Jurors 1stSam A Ferguson, H. C. Babcock, R. F Jamerson, J. Dillard Morris, T W. Odor, L. E- Smith, C. E. Car son, T. A. King, C. E. Lewis, J E. Martin, H. H. Stratton, R W. Abbitt."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "King, C. E. Lewis, <mark>J</mark> E. Martin, H. H. <mark>Stratton</mark>, R <mark>W</mark>. Abbitt."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "King, C. E. Lewis, <mark>J</mark> E. Martin, H. H. <mark>Stratton</mark>, R <mark>W</mark>. Abbitt."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.3, 1031.41, 1561.8, 1778.08], "bbox_id": "d413194fb7", "file": "AppomattoxNewspapers_1908-1909a_0028.pdf", "page": 1, "text": "STONEWALL Mr. arid Mrs- Deb Babcock, of Gladstone, were Sunday guests of Mrs. Babcocks parents, Mr. and Mrs. S. L. Scruggs. Miss Frances Martin, of Phila delphia, is visiting Miss Helen Scruggs. My. and Mrs. Elwood Alvis, and little daughter,  of Clifton Forge and Mr. Allen OBrien, of Appomattox, were Sunday after noon guests of Mr. and Mrs. J. P. Alvis. Miss Anna LeGptnd, of Lynch burg, arrived Sunday to spend sometime in the home of J. A. Stratton. Aubrey Stratton, of Beckley, W- Va., is expected home Thurs day for a brief stay w ith, his parents, Mr. and Mrs. C. M. Stratton. Mrs. G- A. Jacobs, of Lynch burg, is spending some time with,her parents, Mr. and Mrs. C. M. Stratton and attending Hebron revival. Mrs. Norman Lee and sons, Jack and Bob, of Lynchburg, are visiting her parents, Mr. and Mrs. W. Sandidge this weelr. Mr. and Mrs. Thornhill Garter, of Roanoke visited Mrs. Car- ters parente. Mr. and Mw T. Ri Cargon, Sunday .  Mrs.-r-Car- ter remained over for a weeks visit. Mesdames A. F. Drinkard and M. M. Drinkard, of near Staple- ton, were dinner guests of Mrs. C. M. Stratton last Tuesday and visited Mesdames W. H. and Clayton Drinkard in tiie after noon. a Mr. and Mrs. Bill Seay and Albert.Scruggs, of Lynchburg, were Tuesday evening guests of Mr. and Mrs. S. E. Anderson. Mrs. Adolphus Perrow .and children, of Sherwill are visiting Mrs. Perrows father and luster, Mr. Robert Moore and Miss Alpha Moore. Little Miss Nellie Turnas whb haa heen spending a month - with her aunt, Mrs. Perrow, returned home Sunday- Mr . and M rs.. Bass, of Rich mond, are the guests of Mr. and Mrs. Nathan Tanner. Mr, and Mrs. Stun Taylor,"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "Stratton"], "snippet": "in the home of <mark>J</mark>. A. <mark>Stratton</mark>. Aubrey <mark>Stratton</mark>, of Beckley, W- Va., is expected home"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "Stratton"], "snippet": "in the home of <mark>J</mark>. A. <mark>Stratton</mark>. Aubrey <mark>Stratton</mark>, of Beckley, W- Va., is expected home"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [569.76, 1155.37, 730.06, 1214.36], "bbox_id": "f5a933ad98", "file": "AppomattoxNewspapers_1892-1898a_0406.pdf", "page": 1, "text": "STONE WALL DISTRICT. SupervisorS. C. Stratton. Con stableH. C. Babcock. Justices J. W. Davidson, N. W. Owen, .T. S. Thornhill OverseerG. L. Fer-"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "STONE WALL DISTRICT. SupervisorS. C. <mark>Stratton</mark>. Con stableH. C. Babcock. Justices <mark>J</mark>. <mark>W</mark>. Davidson, N. <mark>W</mark>. Owen, .T. S. Thornhill OverseerG. L. Fer-"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "STONE WALL DISTRICT. SupervisorS. C. <mark>Stratton</mark>. Con stableH. C. Babcock. Justices <mark>J</mark>. <mark>W</mark>. Davidson, N. <mark>W</mark>. Owen, .T. S. Thornhill OverseerG. L. Fer-"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1575.35, 334.96, 1744.92, 1778.06], "bbox_id": "e782e624a6", "file": "AppomattoxNewspapers_1926-1933a_0051.pdf", "page": 1, "text": "PICKLES AND PRESERVES  Tomatoes, first, Mrs. E. L. Smith, second, Mrs. Bessie Fos ter.       Cherry, first, Mrs W M Han cock, second, Mrs J S Caldwell. Apple preserves, first, Mrs E M Stratton, second, Mrs. H. G. Babcock. Grape preserves, first, Mrs E M Stratton, second,0 MrS J A Stratton. Peach preserves, first, Mrs E M Stratton, second, Mrs Bessie Foster. Pear preserves, first, Mrs E M Stratton, seeondrMistf Ddlttf Stratton. Plum preserves, first, Miss Dela Stratton, second, Mrs H C Babcock. Quince, first, Mrs. W B Cald well, second, Mrs Bessie Foster. Strawberry, first, Mrs H C Babcock, second, Mrs R E Cald well. Watermelon preserves, first, Mrs E M Stratton, second, Mrs J A Stratton. Citron, first M F Moon, seeond Mrs Grover Beasley Canned tomatoes, first, Mrs H Baboock, second, Miss Virginia Smith. Cherries, first, Mrs. W J Trent, second Virginia Smith. Canned beets, first, Mrs E M Stratton, second, M F Moon. Apple marmalade, first, Mrs M Station, second, Dela Strat ton. Canned peaches, first, Miss Dela Stratton, second, Mrs M C Stratton. Canned plums, first Virginia Smith, second, Mrs. W A Moon. Canned pears, fisrt, Mrs J A Stratton, second, Miss Virginia Smith. Canned quinces, first, Miss V irginia Smith, second, Mrs O L Sheffler. Snap beans, first, Mrs. H C Babcock, second, George Carson. Canned oorn, first, Mrs E M Stratton, second, Mrs. J A Strat ton. Apple jelly, first, Mrs W W Ford, second, Mrs W P Gillsl Currant jelly, first, Mrs T H Inge second, Mrs T H Inge Grape jelly first, Mrs W A Moon, second, Virginia Smith. Plum jelly, first, Mrs J D Childers, second, Mrs W C Ould Quince jelly, first, Mrs. J .A Burke, second, Mrs. Li Crawley, Mixed pickles, first, M F Moon, second, Mrs Glover Beas ley. Pickled pears, first, Miss Dela Stratton, second, Mrs J S Cald well.  Peach pickle, first, Mrs. L Crawley, second, Miss Elizabeth Abbitt. Chow chow, first, Mrs J A Stratton, second, M ibb V irginia Smith. Soup mixture, first, Mrs Bessie Foster, second, Mrs Cabell Fos ter. Catsup, first, Mrs W J Trent, second, Mrs. E M Stratton. Tomato pickle, first, Mrs E M Stratton, second, Miss Mary Swartz. Watermelon pickle, first, Mrs J A Stratton, second, Miss Mary Rose Swartz. Dixie relish, first, Mrs Cabell Smith, second, Mrs. Bassie F ob ter. Dried fruits, first, Mrs M C Smith, second, Mrs. 0. L. Shef fler. Raspberry jelly, first, Mrs Grover Beasley, second, Mrs H C Inge. Cider vinegar, first, Myrtle Dinkins, second, Mrs J R Cald well. Sorghum, molasses, first C L Carter, second, Mrs. Glover Beasley. Grape juice, first, H W Kinney, second, Mrs Bessie Fos ter. Sauerkraut, Mrs. F W Hanen krat, second, Mrs. O. L Shef fler. Butter, one pound, first, E H Marshall, second, Mrs R F Jam erson, third, Mrs E M Stratton. POULTRY Barred Rocks, cock, first, Shirey Bros, cockerel, first, Mrs. John Tumes, second, Mrs John Turnes, hen, first, Mrs Tumes, second, Shirey Bros,"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "ter. Catsup, first, Mrs <mark>W</mark> <mark>J</mark> Trent, second, Mrs. E M <mark>Stratton</mark>. Tomato pickle, first, Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "ter. Catsup, first, Mrs <mark>W</mark> <mark>J</mark> Trent, second, Mrs. E M <mark>Stratton</mark>. Tomato pickle, first, Mrs"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [609.85, 1830.46, 768.67, 1963.8], "bbox_id": "b2056fc176", "file": "AppomattoxNewspapers_1898-1902a_0226.pdf", "page": 1, "text": "Mr. J. R.Horgley has appointed the following delegatee to the De- mofiratic convention which meets at Campbell Courthouse on the 30th inataut Messrs. S. P. Coleman, S. L. Ferguson, J B. Abbitt, D. Mott Robertson, A. H. Howerton, H. D. Flood, W, H- Digon, J. W. Wright, R. P, Sears, A. B, Thornhill, S. C, Stratton, M. W. Carson, W. D, Doss, J. S. Phornbill, R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "W"], "snippet": "B, Thornhill, S. C, <mark>Stratton</mark>, M. <mark>W</mark>. Carson, <mark>W</mark>. D, Doss, J. S. Phornbill, R. B."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "W"], "snippet": "B, Thornhill, S. C, <mark>Stratton</mark>, M. <mark>W</mark>. Carson, <mark>W</mark>. D, Doss, J. S. Phornbill, R. B."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2369.72, 413.36, 2541.34, 763.24], "bbox_id": "88968b6a05", "file": "AppomattoxNewspapers_1939-1943a_0255.pdf", "page": 1, "text": "Misses Byrd Vaughan, of Brook neal, Nellie Turnes and Virginia Boyd, of Gladys spent toe past week end in the home of Mr. and Mrjf. 0. R Turnes. The Womans Society of ChiislL ian Service of Bethel church m with Mrs. L. B. Thomas Tuesday afternoon. ? Miss Faye Stirtton, a student wt Randolph -Macon Womans College, is spending her spring vacation In the home of her parents, Mr. aiiq Mrs. C M. Stratton. Mr. and Mrs. John D. Ripley Jr., of Lynchburg spent the week end in the home of the latters pa?- ents, Mr. and Mrs. S. E, Ander son. Mis Maude Burnette, of Natural , Brie ve was guest of her parents, Mr. and Mrs. J . E . Burnette last week. Mr. and Mrs Dewitt Evans, of Sretwill visited her pa-onts, Mr. 1. n.d Mrs. J. P. AMs Sunday. ! Those from here attending tbf second quarterly conference of the Appomattox Circuit at the Me. Com fort church Tuesday were Mrs. 0, R. Turnes, Mrs. C. M. Strattoq, Mrs. J. A, Stratton, Mrs. Mott Perdieu, Mrs.W. W. Mayberry ana J P. Alvis."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W", "J"], "snippet": "C. M. Strattoq, Mrs. <mark>J</mark>. A, <mark>Stratton</mark>, Mrs. Mott Perdieu, Mrs.W. <mark>W</mark>. Mayberry ana <mark>J</mark> P."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W", "J"], "snippet": "C. M. Strattoq, Mrs. <mark>J</mark>. A, <mark>Stratton</mark>, Mrs. Mott Perdieu, Mrs.W. <mark>W</mark>. Mayberry ana <mark>J</mark> P."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [684.29, 202.33, 843.49, 308.83], "bbox_id": "51e57a9076", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "K C Babcock, C F Button, Dr Thos Rucker, R G Worley, R O Alvis, W B Caldwell, M W Carson, J E Rou- on, P L Stratton, A B Scruggs, T C Stratton, C M Stratton, T A Drinkard, W H Drinkard, J K Hors ley, S C Stratton, Dr A A Rice, Sampson Moore, T H Lewis. MEGGINSONS MILL PRECINCT"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "C Stratton, C M <mark>Stratton</mark>, T A Drinkard, <mark>W</mark> H Drinkard, <mark>J</mark> K Hors ley, S"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "C Stratton, C M <mark>Stratton</mark>, T A Drinkard, <mark>W</mark> H Drinkard, <mark>J</mark> K Hors ley, S"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2006.44, 377.35, 2177.17, 598.0], "bbox_id": "0af8da69e4", "file": "AppomattoxNewspapers_1933-1936a_0161.pdf", "page": 1, "text": "Henderson has returned to his home at Nassawaddox a fte r visiting his parents, Rev. and Mrs. W. T. Hen derson.  Mr. and Mrs. Tom Neighbors, of Sherwill, visited Mrs. J. W. Neigh bors last week. Miss Nellie Turnes, of S. T. C., Farmville, spent the week -end with her parents, Mr. and Mrs. O. R. Turnes. Mrs. S. E. Anderson, who has been sick for the, past several weeks is improving at her home here. Miss Louise Stratton, of Richmond spent the week end with her par ents, Mr. and Mrs. C. M. Stratton.  Rev. W. T. Henderson spent a j few days last week with his daugh-  ter, Mrs. D. H. Libseomb, in Geo rgia. E. II. Carson, who has been ill it his home here for several weeks it improving."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "j"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>.  Rev. <mark>W</mark>. T. Henderson spent a <mark>j</mark> few days last week"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "j"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>.  Rev. <mark>W</mark>. T. Henderson spent a <mark>j</mark> few days last week"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [349.21, 234.04, 512.76, 459.08], "bbox_id": "e00c9c5bd6", "file": "AppomattoxNewspapers_1902-1905a_0161.pdf", "page": 1, "text": "FOR DISTRICT OFFICERS. Southside District. SupervisorJno. H. Robertson. Hoad CommissionerS. J. Lee. ConstableR. 0. Mann. Justices of Qie PeaceLamech Jones, J. T. Lee, W. A. Moses. Stonewall District. SupervisorT. J. Stratton. Road OommissnerJ. C. Shearer. ConstableRichard Moss. Justices of the PeaceCharles F Button, N. W. Owen, J. D. Hamers ley. Clover-Hill District. SupervisorW. H. Ligon. Hoad CommissionerHenry R. ! Pitman. I ConstableE, P. Sears, j J ustices of Peace Joel T. Wat kins, P. H. Gilliam, W. A. Womack. Overseer of PoorA. E. Turnes."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "Jones, J. T. Lee, <mark>W</mark>. A. Moses. Stonewall District. SupervisorT. <mark>J</mark>. <mark>Stratton</mark>. Road OommissnerJ. C. Shearer."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "Jones, J. T. Lee, <mark>W</mark>. A. Moses. Stonewall District. SupervisorT. <mark>J</mark>. <mark>Stratton</mark>. Road OommissnerJ. C. Shearer."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [558.01, 898.26, 723.33, 1404.84], "bbox_id": "8309361ae8", "file": "AppomattoxNewspapers_1892-1898a_0407.pdf", "page": 1, "text": "Democratic Mass-Meeting. At a meeting held iu the Court House on Thursday last for the pur pose of nominating District officers to be voted for at the coming elect ion, May 27th, it wus moved that Dr. D. Mott Robertson be made chair mau and F. W. McKinney, secretary The county then divided up in districts and repaired to the ante-rooms, aud after some de liberation reported the foRowing nominations to the mass-meeting. OLOVE.I HILL DISTRICT. SupervisorW. H. Ligon. Con stableF. W. McKinney. . Justices W. J. Treut, W. D. Hix, U. H. Beale. Overseer poorE. E. Chism. STONE WALL DISTRICT. SupervisorS. C. Stratton. Con stableH. C. Babcock. Justices- J. W. Davidson, N. W. Owen, J. S. Thornhill OverseerG. L. Fer guson. SOUTH SIDE DISTRICT. SupervisorJ. C. Jones. Con stableA. H. Abbitt. Justices- Juo. T. Lee, Simeon Harvey, Lamech Jones. Overseer poorS. E. How erton. Themassmeeting was well-attended aud the tiominees are all good strong meu. They pledged themselves to the service of the party by accepting the nominations and will all makej an effort to get out the full vote of the party on Thursday May 27tb. The offices have been well distributed over the county and good true men selected to fill them. Now, je sore that you do your duty and each of them will be elected."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "WALL DISTRICT. SupervisorS. C. <mark>Stratton</mark>. Con stableH. C. Babcock. Justices- <mark>J</mark>. <mark>W</mark>. Davidson, N. <mark>W</mark>. Owen,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W", "W"], "snippet": "WALL DISTRICT. SupervisorS. C. <mark>Stratton</mark>. Con stableH. C. Babcock. Justices- <mark>J</mark>. <mark>W</mark>. Davidson, N. <mark>W</mark>. Owen,"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.5, 1633.2, 1755.45, 1770.6], "bbox_id": "5f765b1d5d", "file": "AppomattoxNewspapers_1892-1898a_0055.pdf", "page": 1, "text": "C. L. Coleman, M. W. Carson, J. T. Moses, S. C. Stratton, J. R.Horsley, T. J. Stratton, T. B. Moore. W.J3. Crouch, W. C. Franklin, E. B. Chick. BUCKINGHAM COUNTY. J. T. Rogers, G. W. Collins,"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton", "J", "J"], "snippet": "C. L. Coleman, M. <mark>W</mark>. Carson, <mark>J</mark>. T. Moses, S. C. <mark>Stratton</mark>, <mark>J</mark>. R.Horsley, T. <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton", "J", "J"], "snippet": "C. L. Coleman, M. <mark>W</mark>. Carson, <mark>J</mark>. T. Moses, S. C. <mark>Stratton</mark>, <mark>J</mark>. R.Horsley, T. <mark>J</mark>."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1561.4, 1014.23, 1730.24, 1434.01], "bbox_id": "19a71904b2", "file": "AppomattoxNewspapers_1908-1909a_0051.pdf", "page": 1, "text": "Apple jelly, first, Mw W W iord, second, lira W P Gillri  Currant jelly, firat, Mrs t H nge second, Mrs T H Inge I i - Grape jefiy first, Mrs W A Moon, second, Virginia Smith Plum jdly. first, Mrs J D Childers, second, Mrs W C Ould, Quince jelly, tin t, Mrs. J .A ! Jurke, second, Mrs. L. CravdV. Mixed ieklra, - first, M F Moon, second, Mrs Glover Beas- ey. I Pickled pears, tin t, Miss Dela Stratton, second, Mrs J S Cald well. .  Peach pickle, firat, Mrs. L Crawley, second,Miss Elizabeth Abbitt 7 Chow chow, first, Mrs J A Stratton, second, Miss Virghrinf Smith Soup mixture, first, Mrs Bessie Foster, second, MraCabell Fos ter. Catsup, if irst, Mrs W J Trent, second, Mrs. E M Stratton. Tomato pickle, first, Mrs EM Stratton,  second, Miss Mary  v a rtitr Watermelon pickle, first, Mrs A Stratton, second, Miss Mary Ro s e ? !  ________ Dixit relish, first, Mrs Cabaff - tfraith, sind, Mrs. Baggie"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "Catsup, if irst, Mrs <mark>W</mark> <mark>J</mark> Trent, second, Mrs. E M <mark>Stratton</mark>. Tomato pickle, first, Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "Catsup, if irst, Mrs <mark>W</mark> <mark>J</mark> Trent, second, Mrs. E M <mark>Stratton</mark>. Tomato pickle, first, Mrs"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [866.88, 888.29, 1021.6, 939.94], "bbox_id": "e9bf5399d5", "file": "AppomattoxNewspapers_1892-1898a_0207.pdf", "page": 1, "text": "AND M O W E R S ! The farmers of this and adjoining countir wUl find It to their in 8  hing else Stratton for prices,Defore purchasing eise w here. J"}, "highlight": {"text": {"matched_tokens": ["Stratton", "w", "J"], "snippet": "in 8  hing else <mark>Stratton</mark> for prices,Defore purchasing eise <mark>w</mark> here. <mark>J</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "w", "J"], "snippet": "in 8  hing else <mark>Stratton</mark> for prices,Defore purchasing eise <mark>w</mark> here. <mark>J</mark>"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [503.77, 556.42, 665.32, 1415.22], "bbox_id": "b1df1656a9", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "A. iratto n  2, Mrs. T. H. Inge peach eg, 1, .Mrs. M. G. Sm ith 2, Mrs. G. G. Scheiller plume, 1, D. B. Moon qumuee, 1, Meg. M. C. Sm ith pears, 1. Mis. M. C. Sm ith 2, Mrs. J. G. Sm ith grapes, 1, Mrs. O. G. kJchofiler beans, 1, Mrs. H. G. Babcock 2, JL. B. Moon corn, 1, Mrs. G. M. S tratton 2, Mrs, W. J. T rent. JcUics Apple, 1, Mrs. A. H. Gregory cur rant, 1, Mrs. AX. C. Sm ith quince, 1 Mis. J. A. Stratton 2, Mrs. M. C Sm ith grape, 1, Mrs. J. A. S tratton 2, Airs. Bottle B ledsoe pear, 1, U. I n AobiLt 2, Mrs. AX. G. Sm ith plum, 1, Airs. G. ri. Stanley 2, Mrs. G. G. Scneltler sour pickle, 1, Airs. T. H, inge sweet pickle, 1, Mrs. W. A, Muon 2, M rs. T. H. Inge corn salad, i, xiuby Caldwell 2, Airs. K. V. B ar low, pickled onions, 1, Mrs. A. H, Gregory 2, Mrs. T. XI. Inge pickled peppers, X, Mrs. VV. X. Gills 2, Maggie Hix cucum ber pickle, 1, Mrs. H. G, Babcock 2, Mrs. T. H . Inge corn pickle, 1, Mrs. O. 1 m Scheffler 2, Mrs, M. O. Snm h peach pickle, 1, Mrs Bessie F oster 2, Mrs. A. H. Gregory chow chow, X, Mrs. M. C. Sm ith 2 Mrs. G. AX. Stratton soup m ixture, X Mis. M. G. Sm ith 2 , Mrs. Bessie Fo ter catsup, X, Airs. G. AX. Stratton 2 M rs., J. A. Stratton tom ato pickle, 1, Mrs. W. J. T rent 2, Mrs. W. A, Moon w aterm elon, 1, Mrs. W innie B ucaett 2, Mrs. J. A. S tratton Dixie rensh, 2, Mrs. Bessie F oster dried iruits, X, Ih o m as Babcock 2, Mrs, VV. J. T rent soap, X, Mrs. H. G. Bab cool, 2, Mrs. T. H. Inge cider, X, E m m a Goleman 2, Mrs. o . G. Scheif ler grape juice, X, Mrs. A. H. Greg ory 2, Alias Gucy Sm ith sau r k raut, X, F la n k H anenkrat 2, Mrs. it. G. Cald well plum butter, 1, Mrs. W. T. Steele 2, Mrs. W. T. Steele apple butter, I Mrs. K. G. Caldwell. Cooking Cake  F ruit, 1, Mrs. W. G. Brown 2, Airs. H. C. Babcock pound, X, Mrs, H. c . Babcock 2 , Ju lia H ancock sponge, 1, Onarlsey Upton 2, Mrs. J A S tratton angle lood, 2, Mrs. XG C. Babcock carom el, X, Miss Gizzie Irby devil lood, X, Mrs. G. T. Moses 2, Ciijirlsey Upton jelly roll, 1, A lyrtle Sm ith 2 , Mrs. J. A S tratton m arble I, Gizzie H arris 2, F rances Sm ith, chocolate naugate, X, Miss Gizzie Xroy golden, X, F rances Sm ith decorated, X, Mrs. H. C. Babcock ribbon, X, Mrs, G. AX. Stratton. Ides  apple, X, Mrs. G. G. Sm ith 2, Mrs. W. J. T rent peach, 2, Mrs, Bessie F oster chess, I, Mrs. W innie Buckett 2, Mrs. H. B. M arshall po- toia, 1, F rances Sm ith 2, D, B. Moon lemon, X, Mrs. W. G. D ickerson 2, v. Shirey caram el, X, Mrs. W. B. Caldwell chocolate, 1, Frances Sm ith 2, Miss E th ra M orris cocoanut, 1, Mrs. Sam Ferguson 2, Mrs. W . B. Caldwell dougnnuts, X, Gydia .Rog ers 2, Mrs. W. B. Caldwell cream puifs, 1 , liu th Caldwell cookies, 1 rra n e e s Gordon 2, J. K. Pulliam  candy, 1, Gongenia Patterson. Sally Gunn ist, Mrs. Bessie Foster. Breads. Soda Biscuit 1st, Mrs. Bessie F os ter 2nd Sallie Craig, B u tter Biscuit 1st, Mrs. Y. A Sclieffler 2nd, Mrs. W. J. Trent. l-real 1st, Mrs. G. O. Gordon 2nd, W. C. Chilton. Rolls 1st, Evelyn Brow n 2nd, Mrs. Winnie Puckett. Salt B read1st, Mrs. H. C. Babcock 2nd, Mrs. W innie Buckett. B. Biscuit 2nd, Mrs. W. P. Gills. G. Biscuit 1st, Mrs. H. B. M arshall 2nd, Airs. B. Foster. Fancy W ork. D resser set 1st, F rancis W agner 2nd, Mrs. J .S . Plunkett. Bed set 1st, Mrs. N. A W agner 2nd, Mrs. J. S. Plunkett. Gunch set 1st, Mrs. W alter Scott 2nd, Mrs. J. S. Plunkett. Cuff set 1st, Mrs. Joel H ubbard. Side B oard Cover 1st, Mrs. W innie P uckett 2nd Mrs. Jack Caldwell. Centerpiece1st, F rancis W agner 2nd, Mrs. J. B. Chilton. Centerpiece 1st, Mrs. David P lunk ett 2nd, Mrs. G. O. Gordon. Centerpiece 1st, Mrs. Jack Cald well 2nd, Mrs. M. C. Smith. Centerpiece 1st, Mrs. F ran k H an enkrat 2nd, R u th Caldwell. Cover 1st, Mrs. W innie Puckett 2nd, R uby H arris. A pron 1st, F rancis W agner 2nd,"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "M rs., J. A. <mark>Stratton</mark> tom ato pickle, 1, Mrs. <mark>W</mark>. <mark>J</mark>. T rent 2, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "M rs., J. A. <mark>Stratton</mark> tom ato pickle, 1, Mrs. <mark>W</mark>. <mark>J</mark>. T rent 2, Mrs."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2107.21, 198.65, 2265.01, 377.46], "bbox_id": "89bb964d3a", "file": "AppomattoxNewspapers_1915-1918a_0556.pdf", "page": 1, "text": "1 0 0 0 W ar Stam p Club The following names have been added to the 1000 olub since last week T. Burge Moore and family, T. E Owen and family. C. W. Hanoook and wife. M. O. Smith and family, yr. P. Inge. R. W. Burkey. E. T. Prioe. J. Albert Stratton. H H. StrattOn. W.O. Harvey, jr. Milton Isbell."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton", "StrattOn"], "snippet": "yr. P. Inge. R. <mark>W</mark>. Burkey. E. T. Prioe. <mark>J</mark>. Albert <mark>Stratton</mark>. H H. <mark>StrattOn</mark>. W.O."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton", "StrattOn"], "snippet": "yr. P. Inge. R. <mark>W</mark>. Burkey. E. T. Prioe. <mark>J</mark>. Albert <mark>Stratton</mark>. H H. <mark>StrattOn</mark>. W.O."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "C. W. Smith, W. <mark>Stratton</mark> Taylor, Jennings Ferguson. T. Ed Owen, <mark>W</mark>. <mark>J</mark>. LeGrand, Dr. D. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "C. W. Smith, W. <mark>Stratton</mark> Taylor, Jennings Ferguson. T. Ed Owen, <mark>W</mark>. <mark>J</mark>. LeGrand, Dr. D. A."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1382.88, 1058.34, 1712.29, 1254.18], "bbox_id": "2142ca4938", "file": "AppomattoxNewspapers_1933-1936a_0009.pdf", "page": 1, "text": "tors in the neighborhood. Jers parents, Rev. and   r .bd Mrs. T. H. Ford had T. Henderson. They were ac- with them Sunday their d a u g h -U o m p a m e d home by the tfers Mrs Evie Ewers, Mrs.  and Mrs. A. R. Crabtree ana Lawrence Laughlin and little children, who will spend some daughter, Hellas, of Lynch-time there, burg, Mrs. Dick Pankey, of  Little Mary Frances Jen- Pamplin, Mr. and Mrs. Walter nings is spending some time lardan and children, of Spring with relatives in Covington. Mill. -  Mr. and Mrs. Jake Jacobs 1 Messers. Sims and Griff and J and children, of Richmond, Bthel Sims, of Lynchburg spent  Spent several days here last last Sunday in the home o fweek wh Mr. and Mrs. C. M. Mrs. Willie Martin. Mrs. Sims  Stratton. accompanied them home. Ethel J and Mrs. W. A. Per- remained. . row and children, of Sherville Mr. and Mrs. Frank Wool- _ - drige, of Richmond, spent the"}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "Willie Martin. Mrs. Sims  <mark>Stratton</mark>. accompanied them home. Ethel <mark>J</mark> and Mrs. <mark>W</mark>. A. Per- remained. . row"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "Willie Martin. Mrs. Sims  <mark>Stratton</mark>. accompanied them home. Ethel <mark>J</mark> and Mrs. <mark>W</mark>. A. Per- remained. . row"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [534.95, 1549.5, 701.75, 1695.15], "bbox_id": "30ebe87a92", "file": "AppomattoxNewspapers_1898-1902a_0257.pdf", "page": 1, "text": "ton JEaylor, Geo. T.   J B Cal 11, J 0. Jones, L.  Smith J. R. Atwood, T. A. Caldwt- F Burk J- T Cheatham, The Hanc Ik, and J. T. Cawthorn. x delega toe from Hebron are Dr. A. A. Ricii, Stratton Taylor, Hartwell Stratton E . M. Taylor, Street T h o rn h ill T . J . Stratton, T. O. Da vidson, and R. W. Worley. The Red Oak delegates are F. G. Thorp, and Ban Puryear."}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "W"], "snippet": "rn h ill T . <mark>J</mark> . <mark>Stratton</mark>, T. O. Da vidson, and R. <mark>W</mark>. Worley. The Red Oak"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "W"], "snippet": "rn h ill T . <mark>J</mark> . <mark>Stratton</mark>, T. O. Da vidson, and R. <mark>W</mark>. Worley. The Red Oak"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.5, 357.18, 1788.17, 473.63], "bbox_id": "baed9f9dcf", "file": "AppomattoxNewspapers_1898-1902a_0310.pdf", "page": 1, "text": "OUR OFFICERS, of Circuit CourtGeo. J. HuruU-r. first day of April and October, of County CourtD. A. Christian Thursday after first Monday, of Circuit and oounty CourtsGeo. rt. aey for CommonwealthH. D. Flood, iff8. P. Coleman, airer D. Mott Rvbertson. Of Supervisors W. H. I.lgon, chair- 8. C. Stratton and J. C. Jones. Board its on Wednesday after first Monday ii June, September, and December."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J"], "snippet": "Mott Rvbertson. Of Supervisors <mark>W</mark>. H. I.lgon, chair- 8. C. <mark>Stratton</mark> and <mark>J</mark>. C. Jones. Board its"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J"], "snippet": "Mott Rvbertson. Of Supervisors <mark>W</mark>. H. I.lgon, chair- 8. C. <mark>Stratton</mark> and <mark>J</mark>. C. Jones. Board its"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2396.84, 414.7, 2576.22, 815.16], "bbox_id": "9b70905597", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "n The DpHtoutlo Mass The Democratic amaittate oountyand and to re-organize the party coming year, assembled pUM the call of the Executive  In tteCliNrilvRwtofflto of April There was a turnout., to large as Whave tour Been on an occasion Of toe kind ! the county, - 11 The meeting  wm died to order by Chairman W. J. Trent, who nom inated T. J, Stratton for cl man of the meeting, wm elected and 8. L. Ifargueto . chosen M secretary. The following committee to rit j elected Chairman, W. J. Trent. Court House PrtoinrirW. A. Moses. Spout Storings Prsnlnnift- Whorleyi 5 Z Chap FreciimtJ. F. Me Clover HQ Precinct-T. Bj Grand Fores Store PrecinctJ. T. Ws kins. Walker! Chnrch PreoinotI Ltgon.    Pamplin City  PrecinctW  Thornton."}, "highlight": {"text": {"matched_tokens": ["W", "J", "J"], "snippet": "to order by Chairman <mark>W</mark>. <mark>J</mark>. Trent, who nom inated T. <mark>J</mark>, Stratton for cl man of"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "J"], "snippet": "to order by Chairman <mark>W</mark>. <mark>J</mark>. Trent, who nom inated T. <mark>J</mark>, Stratton for cl man of"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [646.52, 674.91, 816.47, 725.25], "bbox_id": "3dc7065372", "file": "AppomattoxNewspapers_1952-1954a_0387.pdf", "page": 1, "text": "Mrs. W. R. Stratton, Mrs. C. L. Carson, Mrs. J. R. Burnette and Miss j Verna Harding visited Miss Dela tratton at Evergreen on last Tuesday."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J", "j"], "snippet": "Mrs. <mark>W</mark>. R. <mark>Stratton</mark>, Mrs. C. L. Carson, Mrs. <mark>J</mark>. R. Burnette and Miss <mark>j</mark> Verna Harding visited Miss Dela tratton at Evergreen on last Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J", "j"], "snippet": "Mrs. <mark>W</mark>. R. <mark>Stratton</mark>, Mrs. C. L. Carson, Mrs. <mark>J</mark>. R. Burnette and Miss <mark>j</mark> Verna Harding visited Miss Dela tratton at Evergreen on last Tuesday."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1996.3, 452.83, 2164.18, 842.57], "bbox_id": "6043d1b91f", "file": "AppomattoxNewspapers_1926-1933a_0333.pdf", "page": 1, "text": "Mm W. A. Moon 75c 2nd, Mrs. W. P. Gills 50 q . Best glass black raspberry jelly, 1st Fannie M. Smith 75c 2nd, Mrs. W. A. Moon 50c. Best glass quince jelly, 1stMm E. M. Stratton 75c 2nd, Fan nie M. Smith 50c. Qt. mixed pickles, 1stMrs. O. L. Schef fler 75c 2nd, Mm W. A.Moon 5Qc. Qt. pickled onions, 1st Mm O. L. Scheffller 75c 2nd, Mrs. Bessie Foster 50c. Qt. cucumber pickle pickle, 1st Mrs. H. C. Babcock 75c 2nd, Nellie Bates 50c. Qt pear pick le, 1stMrs. L. W. Cárter 75c 2nd, Mm E. M. Stratton 50c. Qt. Peach pickle, 1st Mm W. J. Wilkerson 75c 2nd, Mrs. L. W. Carter 50c. Qt. green tomato pickle, 1st Mm Dela Stratton 75c 2nd, Mm L. W. Carter 50c. Qt. watermellon pickle, 1stMrs. E- M. Stratton 75c 2nd, Mrs W. A. Moon 50c. Qt. chow chow, 1st Mm W. P. Gills 75c 2nd, Mrs. E. M. Stratton 50c. Qt. soup mixture, 1st"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "2nd, Mm E. M. <mark>Stratton</mark> 50c. Qt. Peach pickle, 1st Mm <mark>W</mark>. <mark>J</mark>. Wilkerson 75c 2nd, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "2nd, Mm E. M. <mark>Stratton</mark> 50c. Qt. Peach pickle, 1st Mm <mark>W</mark>. <mark>J</mark>. Wilkerson 75c 2nd, Mrs."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1076.85, 1097.07, 1239.65, 1273.17], "bbox_id": "bfd924a79a", "file": "AppomattoxNewspapers_1936-1939a_0022.pdf", "page": 1, "text": "Miss Nelli Turnes entertained .Mendsy evening at a surprise hand kerchief i shower in hou r of her sister, Miss Louse Turnes, who left this week for Blackstone. Games and contests were enjoyed during the evening. The honoree was pre sented many beautiful handkerchiefs by the guests. Tjie hostess, assisted by her mother, served refreshments. Those present besides the Misses Turnes, were Mis es D ris and Chri.tine CaldweJ, Edna Adcock, Margaret Stratton, Alma Simmons, Mary, Helen and June Johnstone, Mary Owen Carson, and Agnes Jen nings, and Mesdames J. W. Sim mons, A.M. Johnstone and P.B Stratton."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Stratton"], "snippet": "Jen nings, and Mesdames <mark>J</mark>. <mark>W</mark>. Sim mons, A.M. Johnstone and P.B <mark>Stratton</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Stratton"], "snippet": "Jen nings, and Mesdames <mark>J</mark>. <mark>W</mark>. Sim mons, A.M. Johnstone and P.B <mark>Stratton</mark>."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1491.32, 586.56, 2136.85, 823.02], "bbox_id": "be5ab4d7c9", "file": "AppomattoxNewspapers_1908-1909a_0459.pdf", "page": 1, "text": "Last report from I  ulveau 01 Vital Statistics. I secration 720, to unite with the I   i verp ill. Mrs. Caldwell doneT ? This should be various churches by letter 17,1, This old gentlemen died at his ynchburg for several davs Toi?fre .schoo,j0lpens. inversions 88. AU expenses of home Jf in the 82nd G. N. Price has c S T e d a b r i e f  . PPerJ the revival, indudingthe s a l a r y bisage.  .................. a two weeks visit to her parents v i S ofti S! Jhe  wn Pro ?f the song leader, were prompt-  de,il?i.n J Mr. and Mrs. C-M Stratton Sr  S w  f State ComPulsory ly met and a free-will offering and h,B death was expected at Miss Louise Adams of Brwk- UW WU bf pubIi8h- mounting to 411.55 was giyen  any time by his friends. neal, visited Miss Frances Strat-lthe  J   to readto Dr Thacker. The spiritual I P eceasedJ was a Confederate ve- last week. the provisions 0f this law. I unity and oneness of our people  teran nd rarely ever failed to Stratton, Jr spent last 68 ,  d haf 8t the  seen not only by the fact that atnd ? ? re-union of his corn- week iri Atlanta, Ga. on binri L a 8 regulations in regard they pull together without fric-1rade8,  His remains were interr- ness. Ito age limits for pupils entering tion but by the fact that a lll at the Wright cemetery here  Rev. L. F. Paulett of Smith  thW  F?r the 8ehol8 beard and were wonderfully edi- where frtnds gathered to ! field, will begin a revival at He ,and Pamplin or fied by the m e Gospel. toy respect to an honorable and  bron Baptist cTnireh 18 y.. ?!?r 8!h.??,s m the county A great Maas Meeting will be h,h,y esteemed old soldier. August 19th, at 11 a.  i  e m e - held in Liberty Baptist Church  7  ------- - ----------- services at 8 p. m The public I Jr uu,i!must be near- next Sunday afternoon at 3 B e r k l e y T . G o d S fiV is invited to h 6 .r M , onde ber l . h lf L S 35  7 7  When theK WU  h s _ 7 J s  t o  . f i"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "w"], "snippet": "leader, were prompt-  de,il?i.n <mark>J</mark> Mr. and Mrs. C-M <mark>Stratton</mark> Sr  S <mark>w</mark>  f State ComPulsory ly"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "w"], "snippet": "leader, were prompt-  de,il?i.n <mark>J</mark> Mr. and Mrs. C-M <mark>Stratton</mark> Sr  S <mark>w</mark>  f State ComPulsory ly"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [851.3, 195.68, 1008.79, 526.08], "bbox_id": "f87ca9bfe4", "file": "AppomattoxNewspapers_1915-1918a_0470.pdf", "page": 1, "text": "Individual Farm Exhibit, 1st M G Sm ith, 2nd G A Scheffler, 3rd E P Williams Mahogany W rappen, 1st R J Coleman, 2nd J H Page, 3rd R E Bell Black W rappen, 1st R W Bab cock, 2nd E M Stratton Sc Bro, 3rd H H Stratton 6 lb Ship ping, 1st E M Stratton dt B io., 2nd H H Stratton, 3rd 0 B Godsey 5 lb P illen , 1st E M Stratton Sc Bro , 2nd J T Cheat ham , 3rd H H Stratton Air- Cured Tobacco, 1st and 2nd J W Uawthorn, 3rd M P D avid son White Amber Cane, 1st R E RellBest 10 ears W hite Corn, 1st C N 8cheffler, 2nd O L Scheffler, 3rd A A H School Best 10 earn Yellow Corn, 1st Elm er Sm ith, 2nd J W Caw thorn, 3rd Eugene D rinkard Beet single ear Yellow Corn, 1st S G uy Sm ith, 2nd Elm er 8m ith 10 e a n Caseys P ure bred, 1st C W Sm ith, 2nd and 3rd W A Moon 10 e a n Boone County, 1st and 3rd J C Moore, jr, 2nd J R Horsley 10 e a n C ollien Excelsior, 1st T O D a vidson, 2nd J C Davidson . Sin gle E ar White Corn, 1st J R H o n ley , 2nd C W Sm ith, 3rd J T Cole."}, "highlight": {"text": {"matched_tokens": ["Stratton", "J", "W"], "snippet": "ham , 3rd H H <mark>Stratton</mark> Air- Cured Tobacco, 1st and 2nd <mark>J</mark> <mark>W</mark> Uawthorn, 3rd M P"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "J", "W"], "snippet": "ham , 3rd H H <mark>Stratton</mark> Air- Cured Tobacco, 1st and 2nd <mark>J</mark> <mark>W</mark> Uawthorn, 3rd M P"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1991.49, 457.62, 2159.03, 822.43], "bbox_id": "375a2ed737", "file": "AppomattoxNewspapers_1908-1909a_0333.pdf", "page": 1, "text": "black raspberry jelly, 1 st Fannie M. Smith 75c 2nd, Mrs. W. A. Moon 50c. Best glass quince jelly, 1 stMra. E. M. Stratton 75c 2nd, Fan nie M. Smith 50c. Qt. mixed pickles, 1stMra. O. L. Schef fler 75c 2nd, Mra. W. A.Moon 50c. Qt. pickled onions, 1 st Mrs. O. L. Scheffller 75c 2nd, Mrs. Bessie Foster 50c. Qt cucumber pickle pickle, 1 st Mrs. H. C. Babcock 75c 2nd, Nellie Bates 50c. Qt pear pick le, 1stMrs. L. W. Carter 75c 2nd, Mrs. E. M. Stratton 50c. Qt. Peach pickle, 1st Mra W. J. Wilkerson 75c 2nd, Mrs. L. W. Carter 50c. Qt. green tomato pickle, 1 st Mrs. Dela Stratton 75c 2nd, Mrs. L. W. Carter 50c. Qt watermellon pickle, 1stMrs E- M. Stratton 75c 2 nd, Mrs. W. A. Moon 50c. Qt. chow chow, 1st Mra. W. P. Gills 75c 2nd, Mrs. E. M. Stratton 50c. Qt. soup mixture, 1st"}, "highlight": {"text": {"matched_tokens": ["Stratton", "W", "J"], "snippet": "2nd, Mrs. E. M. <mark>Stratton</mark> 50c. Qt. Peach pickle, 1st Mra <mark>W</mark>. <mark>J</mark>. Wilkerson 75c 2nd, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "W", "J"], "snippet": "2nd, Mrs. E. M. <mark>Stratton</mark> 50c. Qt. Peach pickle, 1st Mra <mark>W</mark>. <mark>J</mark>. Wilkerson 75c 2nd, Mrs."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1839.34, 311.79, 1989.94, 821.22], "bbox_id": "2beb4c83bf", "file": "AppomattoxNewspapers_1974-1975a_0220.pdf", "page": 1, "text": "All thing work together for good to them that love God. Romans 828. Mr. John Ewers came home from hospital Saturday. Mrs. W. E. Bondurant, J r and Mr. Bert Stratton are in the hospital now. Do hope they get on well and will soon be home. Mrs. Vara Robertson, Mr. and Mrs. R. W. Webb visited Mrs. Elsie Caldwell and Mr. and Mrs. I. B. Wheeler Friday. What a pleasant surprise. Mr. and Mrs. I. B. Wheeler visited Mrs. Hazel Gillaspie last week. Mrs. Hazel Gillaspie went to Big Island to visit her sister-in- law Friday. Sunday Mr. and Mrs. I. B Wheeler had a birthday dinner for their grandson, Tommy Wheeler. Those present were Mr. and Mrs. Ben Wheeler and David. Mr. and Mrs. H. B. Gordon, of Richmond. All wished him many more happy days. Mrs. C. Ti Roach spent Saturday night with her father Mr. J. 0 . Davidson and Mr. Crawford Davidson. Mrs. Annie Horsley is still improving at The Guggenheim er Nursing Home Lynchburg Va! after having a cold first of week. Mrs. Elsie Thornhill came home Thursday after spending the winter with her daughter, Mrs. Elsie Weidman in Con necticut. Mrs. Tom Davidson And Judson and Mrs. Crawford Davidson went to see Mrs. Horsley Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "from hospital Saturday. Mrs. <mark>W</mark>. E. Bondurant, <mark>J</mark> r and Mr. Bert <mark>Stratton</mark> are in the hospital"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "from hospital Saturday. Mrs. <mark>W</mark>. E. Bondurant, <mark>J</mark> r and Mr. Bert <mark>Stratton</mark> are in the hospital"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.54, 1635.36, 1756.88, 1803.56], "bbox_id": "41e0322df8", "file": "AppomattoxNewspapers_1908-1909a_0192.pdf", "page": 1, "text": "A few farmers have been planting corn, others are wait ing, for warmer weather. To bacco plants are reported small mid late this season. The play Always In Trouble Was quite a success given at Stonewall Friday night Quito a nice sum was realized for the benefit of the school. Mr. J. A Stratton is confined to his bed w ith gripp. Mrs. Stratton, who was visiting in Lynchburg, was called home last"}, "highlight": {"text": {"matched_tokens": ["J", "Stratton", "w", "Stratton"], "snippet": "of the school. Mr. <mark>J</mark>. A <mark>Stratton</mark> is confined to his bed <mark>w</mark> ith gripp. Mrs. <mark>Stratton</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Stratton", "w", "Stratton"], "snippet": "of the school. Mr. <mark>J</mark>. A <mark>Stratton</mark> is confined to his bed <mark>w</mark> ith gripp. Mrs. <mark>Stratton</mark>,"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [206.15, 1068.29, 534.2, 1318.73], "bbox_id": "d188f5de53", "file": "AppomattoxNewspapers_1892-1898a_0427.pdf", "page": 1, "text": "A. Caldwell. Committee on Publication-L B Smith, S. L. Ferguson and A . H . Clement. Committee on OrderS. P . Cole man, Herbert Coleman, A . H . Ab bitt, F . W. McKinney and H . C Babcock. Committee on DinnerD. Mott DistrictWilliam I Robertson, T . A . Smith, Joel T Williams, Thos. Tindall and Frank jCawthorn, J . F . Purdum and W. H Ligon Committee on MusicC. A . Ab D. Omohuudro, and j bitt, Clinton Cawthorn, C. W. Han cock, J . R. Caldwell and Peter Stratton. The chairman of the committees constitute the Financial Committee, A resolution was adopted asking with maliciously 1 the farmers to bring baskets to help L . Tinley another feed the immense crowd which is ex-"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Stratton"], "snippet": "bitt, Clinton Cawthorn, C. <mark>W</mark>. Han cock, <mark>J</mark> . R. Caldwell and Peter <mark>Stratton</mark>. The chairman of the"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Stratton"], "snippet": "bitt, Clinton Cawthorn, C. <mark>W</mark>. Han cock, <mark>J</mark> . R. Caldwell and Peter <mark>Stratton</mark>. The chairman of the"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2395.67, 418.61, 2562.6, 622.68], "bbox_id": "551bf42510", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "_ _ _ _ _ nominate oounty and district! and to re-organise the party coming year, assembled pursuant fr  the call of tiM SxecmtlroOerintel in the Courthouse on Friday,the 14th of A pril There w m - a splendid turnout, as huge as w fave w fi semi on an occasion of tip i kind in the oounty. The meeting waa called to by Chairman W. J . Trent, who nc mated T. J . Stratton fty bbiil man of the meeting. Mr, Strattolt  was elected - a n d 8. L. Fergnion chosen as secretory, 1 The following co m n d tteev w lh iill n lo A la r i  ."}, "highlight": {"text": {"matched_tokens": ["W", "J", "J"], "snippet": "called to by Chairman <mark>W</mark>. <mark>J</mark> . Trent, who nc mated T. <mark>J</mark> . Stratton fty bbiil man of"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "J"], "snippet": "called to by Chairman <mark>W</mark>. <mark>J</mark> . Trent, who nc mated T. <mark>J</mark> . Stratton fty bbiil man of"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.7, 360.45, 1839.69, 504.94], "bbox_id": "a93aad0ce4", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "XR OFFICERS. APPOMATTOX, OOUNTT OrriOIRS. Judge of Circuit CoimOeo. J, Hundley Courts, tin t day of April itnd October. Judge of County CourtD. A. Christian Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Iter. - a tto rn e y for CommonwealthH. D. Flood r-benffS- P. Coleman. TreasurerD. Mott Bvbertson. C om m issioner of Revenue-L. K. Smith. B oard of Supervisors W. h . Ligón, chair- man 8. C. Stratton and J. C. Jones. Board j m eats on Wednesday after first Monday In March, June, September, end December."}, "highlight": {"text": {"matched_tokens": ["W", "Stratton", "J", "j"], "snippet": "B oard of Supervisors <mark>W</mark>. h . Ligón, chair- man 8. C. <mark>Stratton</mark> and <mark>J</mark>. C. Jones. Board <mark>j</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Stratton", "J", "j"], "snippet": "B oard of Supervisors <mark>W</mark>. h . Ligón, chair- man 8. C. <mark>Stratton</mark> and <mark>J</mark>. C. Jones. Board <mark>j</mark>"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [469.7, 1102.7, 636.16, 1530.2], "bbox_id": "a10b7f87ee", "file": "AppomattoxNewspapers_1905-1912a_0185.pdf", "page": 1, "text": "W E Moore, supplies ........  J A Hesson,  ...........  T J Stratton, making road _ drag ................................... 2 60  J H Thornhill, supplies.. 7 53 J R Marks A Co,  27  It W Harvey  15 31  Chas Halrslip. laborer ...... 5 00  8 Jamison, mach. foreman 20 00  Clay Peraue, labor ........ 17 00  A Ferguson,  10 00  L Jamersou,  8 25 July 28, T P Scruggs A Co, supplies 78 96 11 J R Marks A Co, am t ad vanced for labor. . ............ JnlySl, HQ Harding, freight and medicine ............................  E E Rowen, surgical atten tion to mule............... ... 10 00  So Eq A Machn Co, machine blade .................................. 8 00  H C Doss, supplies ................. o oi  B L Wheeler, work on road 2 75  R H Woodson, blacksmith acot..................................... 3 30  C E Carson A Bro, supplies. 1 50 i J W Harvey,  g 11  S Jamersou, labor .............. 3 85  S Jamersou,  .............. - 3 84  A Ferguson,  4 02  H G Harding, salary ............ 75 00 Dec 1, E A Walton, work on Cove road ........................ ......... 1500 R A Hamilton, lumber and work on b rid g e ............... 3 50  CM Gregory, blacksmith acct 8 50  c E Lewis, lumber................ 0 40 Jas Bondurant.tced for mules 24 00  J J Carson, working Sand Hill road ............................ 11 00  R A Godsle, work on road.. 12 00  C J Harding, work on road. 11 00  Chas Button, salary ............ 25 00  H G Harding, salary as comr 75 00  M W Carson, salary ............... 1500  H G Harding, service with road force .......................... 90 00  Buck Nowlin, cutting tree out of road........................  A A BeU, cutting tree oat of road....................................  P L Wheeler, Oiling up mud holes ................................... 1910 Jan 21, Clarence Drinkard, work on road ....................................... 21 50 May 10, ------ No 17, .............. 3 50 Jno Patterson, cutting tree out of road......................... 1 oe S K Martin, repairing road machine.................................. 3 00 W C Nowlin, fixing bridge.. 2 00 ------ No a . ......... .................. 14 60 ------ No 22, .......... 2 jo RH Woodson,blacksmith acct 3 80 A Cousins, putting log ac ross creek ............................... 6 25 J W Neighbors, medicine for m u le ............................ J J scruggs, spring for mach"}, "highlight": {"text": {"matched_tokens": ["W", "J", "J"], "snippet": "<mark>W</mark> E Moore, supplies ........  <mark>J</mark> A Hesson,  ...........  T <mark>J</mark> Stratton, making road _ drag ................................... 2"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "J"], "snippet": "<mark>W</mark> E Moore, supplies ........  <mark>J</mark> A Hesson,  ...........  T <mark>J</mark> Stratton, making road _ drag ................................... 2"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
