{"document": {"bbox": [264.5, 298.75, 427.56, 1130.84], "bbox_id": "102268bd38", "file": "AppomattoxNewspapers_1915-1918a_0540.pdf", "page": 1, "text": "with friends and doing some spring shopping. Mr. E. W. Gilliam, of Lynch burg, was a visitor here Sun day. Mrs. J. H. McCue returned from Bluefield, W. Va., on last Friday from a weeks visit to Mrs. O. 0. Jenkins, who has been quite ill for the past two weeks. Mr. J. W. Davis returned last week from Staunton, having spent several days with his son Prof. J. Talmage Davis, of the 8taunton Military Institute. Mrs. James Glenn, of Olive Branch, was called to the home of her father, Mr. Ben Rosser, who was reported as being quite siok on last Friday, and the many friends of Mr. Rosser are made more sad to learn of the serious accident to one of his sons,Mr. Bob Rosser, of Lynchburg, who, while rid ing a motorcycle, collided with an automobile, causing the loss of one leg, one broken arm and a severe cut on the head. Our citizens in this part of the county, on both north and south side of Appomattox river, are worked up to a point that our officials can not bring up the same old chestnut that is always politely handed to the farmer You havnot ask ed for anything, so why do you kick? And from what I have seen and heard, the citizens of this part of Clover Hill Dis trict will not be satisfied with nothing less than a good bridge across Appomattox riv er near the poi-t known as the John Marshall ford, and a com  mittee of 15 of the old straight liners has been appointed to meet with the Board of Super visors at their regular meeting and investigate further into the matter. And since your correspondent has somewhat the resemblance of Foxy Grandpa, I will say nothing as to finances. Mr. and Mrs. J. W. Harden, Miss Alice Harden and Mr Turner, of Fife, are on a visit to Mrs. Hardens mother, Mrs J. W. Harwood. Rev. Mr. Sam Harwood and wife and Mrs. Laokford, of! Jarretts, are also on a visit to Mrs. Harwood. Miss Ruth Harwood, of Hope well, spent the week-end with home people. Mr. J. R. Fore was down to Gamp Lee on Thursday."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "Harwood"], "snippet": "Mrs. Hardens mother, Mrs <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Rev. Mr. Sam <mark>Harwood</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "Harwood"], "snippet": "Mrs. Hardens mother, Mrs <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Rev. Mr. Sam <mark>Harwood</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1473.56, 553.0, 1609.51, 587.04], "bbox_id": "7463046e6a", "file": "AppomattoxNewspapers_1915-1918a_0445.pdf", "page": 1, "text": "Ur j. W. Harwood resumes  bis studies at Washington and Lee University to-day."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Harwood"], "snippet": "Ur <mark>j</mark>. <mark>W</mark>. <mark>Harwood</mark> resumes  bis studies at Washington and Lee University to-day."}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Harwood"], "snippet": "Ur <mark>j</mark>. <mark>W</mark>. <mark>Harwood</mark> resumes  bis studies at Washington and Lee University to-day."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [920.66, 365.0, 1082.0, 763.09], "bbox_id": "0053ebd13d", "file": "AppomattoxNewspapers_1898-1902a_0571.pdf", "page": 1, "text": "ttos place this seasons, far exceeds j that of any previous year. The loss of tobacco barns by fire I has been unusually great this year. Messrs. YValker Bros. Win. C. Car-1I wiles, and others lost barns full of fiuejj tobacco. Messrs. Morton Elam  Brother, of Darlington Heights neighborhood, lost a barn of good tobacco on Sep tember 23. Mr. J. W. Harwood had the mis fortune to have a barn of good to bacco burned on September 30. Mrs. L. O. Booker aud daughter, of Lynchburg, who have been visit ing relatives here, have returned to their home. Miss Lizzie Shorter and her sister have left for Blaekstoue, where they will attend school. The days will seem longer- this winter to some of the Darlington Heights. Mr. J. D. Terry, who won the State scholarship at the Medical College of Virginia, has left for Richmond. Mrs. Lyle aud daughter, of Lex ington, recently passed through the village, en route to Hainpden-Siduey to spend the winter. Mr. .John Morton has gone to at tend the Peabody Normal at Nash ville. We will miss Johns familiar voice on our streets. Mrs. T. M. Booker, of this place, left ou So Jember 30 for Meherfin, to visit her sister. Mrs. W. H. Ewing."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Sep tember 23. Mr. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> had the mis fortune"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Sep tember 23. Mr. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> had the mis fortune"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [498.0, 1244.47, 659.59, 1805.46], "bbox_id": "0723d4da24", "file": "AppomattoxNewspapers_1902-1905a_0507.pdf", "page": 1, "text": "so thoroughly covered the ground that he was compelled to say that he had not bad the opportunity to give the sueject the proper thought and attention, but that he was deep ly interested in the matter of better schools and teachers with more pay for the children of Virginia. The common school was his hobby, if it may be said he had one He would not minimize the importance of the universities and high schools, bu he declared a hoy. with a common school education, who attend chuich and public speaking and read his county paper, was an edu cated mau at 35 years or a fool The Senator did not. avree with the program iu advocating a nine months session. A five mouths es sion is too shoit, but the 1 cui au thorities know better about the taxes. If school trustees dont d their duty make it so hot for them that they will be turned out. He urged the people to spend their money in educating the children At the conclusion of the Sena tors speech Hon. J. W. Harwood arose and said he was compelled to take issue with the Senator. The audience showed its uneasiness, but Mr. Harwood soon relieved hi saying that the Senator had made a splendid address that showed prep oration and thought. Rev. W. E. Warren then intro duced Supt. J. D. Eggleston, of Prince Edward couuty, who made a fine impression, and was declared to be the best speaker of the day. He said that whenever the school offi cers show to the people that every cent paid into the treasury is paid out properly, there is no trouble in getting sufficient funds to run the schools. The people want to know"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Sena tors speech Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> arose and said he"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Sena tors speech Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> arose and said he"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Franklin, H. D. Flood, <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, Ster ling C. Stratton,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Franklin, H. D. Flood, <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, Ster ling C. Stratton,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1829.47, 1189.5, 1991.62, 1714.05], "bbox_id": "24db4b3bfd", "file": "AppomattoxNewspapers_1892-1898a_0071.pdf", "page": 1, "text": "Pam plin City Budget. There was much excitement caused in town on yesterday by a fight be tween the postmaster and a mad dog, but it only lasted for a few moments, as the postmaster soon succeeded in killing his assailant. Mr. Joseph Harwood, who is now employed by the Norfolk and West ern Railroad Company in the freight depot at llluefield, W. Va., spent last week with his father, Hon. J. W. Harwood. Messrs. Charles T. Hamlet and J. M. Couch, left last week for West Virginia, where they expect to en gage in business. Mrs. Woodson and daughter, of Danville, Va., are visiting their rela tives Mr. R. P. Meadows and fam- Hy- Mr. aud Mrs. J. M. Durphey and their sons, Josie qnd Willie, of Lynchhurg, are now in town on a visit to Mr. Durpheys mother. Mrs. J. J. Jones, of Florida, is visiting at Mr. W. D. Thorntons. Mr. Chap Jones, of yotir town, is on a visit to friends in the city. There will be a match game of ball tomorrow evening at 4.30 oclock between Hampden Sidney and Pamp lin City teams on the latters ground. The ladies of the place will give a grand entertainment tomorrow night for the benefit of the Baptist Church parsonage. - Miss Sallie Marshall, of Hixbnrg, Va., left last week to attend the Worlds Fair. Mr. Couch, assisted by Rev. Dr. Bagby, of Farmville, closed one df the largest revivals that has ever"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "with his father, Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Messrs. Charles T. Hamlet"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "with his father, Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Messrs. Charles T. Hamlet"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1513.45, 604.7, 1779.99, 886.89], "bbox_id": "4f08f83b4e", "file": "AppomattoxNewspapers_1947-1949a_0487.pdf", "page": 1, "text": "Mrs. L. M. Southall was hostess to the W. M. S. of Elon Baptist Church last Wednesday. I Black, of Rich-  ev. and  rs Sam Harwood  her vacation with Victoria spent last week-end with lev. and Mrs. W. aild Mrs- E W. Harwood. j Mr. and Mrs. Herbert Richardson s in the home of and Appomattox were re- H. McCah we?e cu!lt 8uests of the formers par- . Ponton, of Rich- euU Mr. a,ld Mrs. Wiley Richard- Irs. A, J. Ponton, j S011, Mr. and Mrs. A. Newport News Liberty Chapel P. Lucado, Mr. jado, Mr. and Mrs.! ______ family, Mr. and nby and daugh-1 Liberty Chapel, June 14.- Mrs. J. fcbby Lucado were P. Leitner and Mrs. Percy Garrett le of Mr. and Mrs.1 spent several days last week at- lichmond last Sun-1 tending the annual house warming i o-f the W. M. U., which was held  at Fork Union. in the home of Ar were Mr. and  of Roanoke. Mrs. ! g this week with"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "j"], "snippet": "W. aild Mrs- E <mark>W</mark>. <mark>Harwood</mark>. <mark>j</mark> Mr. and Mrs. Herbert"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "j"], "snippet": "W. aild Mrs- E <mark>W</mark>. <mark>Harwood</mark>. <mark>j</mark> Mr. and Mrs. Herbert"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1283.55, 508.41, 1443.17, 544.11], "bbox_id": "8d4aaea73a", "file": "AppomattoxNewspapers_1905-1912a_0100.pdf", "page": 1, "text": "Mrs J. W. Harwood, of Pamplin Ljity, visited her son, Mr. Alfred Harwood, last Thursday."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "Harwood"], "snippet": "Mrs <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, of Pamplin Ljity, visited her son, Mr. Alfred <mark>Harwood</mark>, last Thursday."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "Harwood"], "snippet": "Mrs <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, of Pamplin Ljity, visited her son, Mr. Alfred <mark>Harwood</mark>, last Thursday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.3, 1292.78, 1789.16, 1351.03], "bbox_id": "e963004d8a", "file": "AppomattoxNewspapers_1915-1918a_0019.pdf", "page": 1, "text": "Mrs. J. W Harwood is a guest at the home of her son, Mr. Alfred Harwood, in town. Mrs. Alfred Harwood, who has been sick for some time, is much improved,"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark> <mark>Harwood</mark> is a guest at"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark> <mark>Harwood</mark> is a guest at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1781.49, 1179.57, 1936.65, 1271.67], "bbox_id": "f603c8af21", "file": "AppomattoxNewspapers_1915-1918a_0238.pdf", "page": 1, "text": "Misses Bessie V. and Alice Harwood, of Appomattox, were given a birthday party at their grandmothers, Mrs. J. W. Harwood, of near Pamplin, last Saturday afternoon. The guests arrived about 2 oclock and enjoyed games in"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "at their grandmothers, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, of near Pamplin, last"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "at their grandmothers, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, of near Pamplin, last"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [609.34, 525.61, 767.85, 998.6], "bbox_id": "f12dc23c86", "file": "AppomattoxNewspapers_1918-1922a_0190.pdf", "page": 1, "text": "Miss Kate Franklins music pupils gave a recital in her par lor Friday morning to their parents and a few friends. The performance was a creditable one and was thoroughly enjoy ed. Miss Franklin served re freshments. Mrs. Jackson Haden and her four little boys, of Fife, who have been visiting Mrs Hadens mother, Mrs. J. W. Harwood, have returned to their home by automobile, being accompanied by Misses Ruth and Edith Har wood. The beautiful wedding of Miss Adeline Cunningham Wednesday afternoon at histo ric old Buffalo Presbyterian church, several miles from Pamplin, was an event of in terest, many of the village people attending. Mrs. R D. Baldwin is in Richmond receiving medical attention. Mrs. H. E. Pearson and baby, im Rice, of Washington, b. C., are the guests of Misses Lucy and Ruth Rice. Mary Page Hobbs entertain ed Thursday afternoon in honor of two of her little friends,Mary and Helen Brown, of Big Island. Mrs. O. E. Peterson is in Liu coin meeting in both a business and social way with other state"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Mrs Hadens mother, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, have returned to their"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Mrs Hadens mother, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, have returned to their"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [530.41, 1426.89, 609.8, 1546.78], "bbox_id": "cb282b5651", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "Jesse T Harvey, George Gallier, W P Meadow8, P H Holycross, M T Agee, J H Marshall, Sr. J W Harwood, H T Williams, Stephen C Fore, H M Marshall, H B Swan, George Lewis,"}, "highlight": {"text": {"matched_tokens": ["J", "J", "W", "Harwood"], "snippet": "<mark>J</mark> H Marshall, Sr. <mark>J</mark> <mark>W</mark> <mark>Harwood</mark>, H T Williams, Stephen"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "W", "Harwood"], "snippet": "<mark>J</mark> H Marshall, Sr. <mark>J</mark> <mark>W</mark> <mark>Harwood</mark>, H T Williams, Stephen"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1997.73, 1140.05, 2159.17, 1259.0], "bbox_id": "e858331db4", "file": "AppomattoxNewspapers_1892-1898a_0438.pdf", "page": 1, "text": "in the discussion we noticed Dr. T. W. Evans, of Campbell Hon. Jno. W. Harwood, J . K . Pnrdum and Majoj J . W. Flood, o f this county. On Saturday Major Koiner and Mr. Bellwood spoke on cattle rais ing and good roads, but the princi pal address was that of Col. White- head on tobacco and Mr. T. J . Stratton on commercial fertilizers."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "of Campbell Hon. Jno. <mark>W</mark>. <mark>Harwood</mark>, <mark>J</mark> . K . Pnrdum and Majoj"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "of Campbell Hon. Jno. <mark>W</mark>. <mark>Harwood</mark>, <mark>J</mark> . K . Pnrdum and Majoj"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [458.39, 819.59, 630.24, 1206.64], "bbox_id": "430a94ace2", "file": "AppomattoxNewspapers_1939-1943a_0577.pdf", "page": 1, "text": "H-rry Ledbetter ................ Mrs. C. W. Carter ............ Beulah Ferrell ................ ..  Mrs. Tom Collins .............. Grace Winters .................... Alice Harwood .................... J. W. Painter ........  ......... Faye Lawson .................... Mary A. R ipley ................ J. P. Alvis  J. P. Al vis J M. W. Caldwell .............. C. M Caldwell . ............ . L. S. McCormick Jr. ...  Lester Wingfield ................ Annie Hancock .................. R. W. Burkey .................. Stratton Bros .................... H. W. McKinney . .............. Elmo H. Franklin ............ Arthur Wheeler ................ Roy- Myers . .... ................... Helen Inge . ........................ L. H. Wajson .................. E. L. Hrrvey .................. Billy Martin ......... 1-00 R. MCore . . - .................... 100 David Franklin .............. 2.00 Corley Gray.............. 1-00 Willie Ferguson ..................   1-00 Geo. H. White ...................... 2.00 Mos D avis ...................................... 25 Henry Ragland ....................... 1.00 Bennie Johnson . . . .  ........ 2.00 Willie Mitchell ...................... 1-00 Algie Almond ................................ 75 Curtis Ferguson .................. 100 St. Moss .................... 1-00 J. S. Kinney ............... 2.00 Mrs. J. R. Lawson .......... .  5.00 W. D. Ferguson .................. 2.00 E. L. Smith .......................... 5.00 R. W. Stanley ...................... 5.00 W. E. Hancock ...................... 5.00"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Collins .............. Grace Winters .................... Alice <mark>Harwood</mark> .................... <mark>J</mark>. <mark>W</mark>. Painter ........  ......... Faye Lawson .................... Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Collins .............. Grace Winters .................... Alice <mark>Harwood</mark> .................... <mark>J</mark>. <mark>W</mark>. Painter ........  ......... Faye Lawson .................... Mary"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1736.64, 656.43, 1839.94, 702.88], "bbox_id": "dcffc9410a", "file": "AppomattoxNewspapers_1898-1902a_0110.pdf", "page": 1, "text": "Hon. J. W. Harwood ,ice-house with ice 3 by measurement. Wl this?"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> ,ice-house with ice 3 by measurement. Wl this?"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> ,ice-house with ice 3 by measurement. Wl this?"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [411.61, 626.59, 570.23, 672.58], "bbox_id": "4ea1b7a067", "file": "AppomattoxNewspapers_1898-1902a_0111.pdf", "page": 1, "text": "Hon. J. W. Harwood has filled hit ice-house with ice 31 inches thick by measurement. Who can beat this ?"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> has filled hit ice-house with ice 31 inches thick by measurement. Who can beat this ?"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> has filled hit ice-house with ice 31 inches thick by measurement. Who can beat this ?"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.2, 263.74, 556.49, 537.54], "bbox_id": "698b7f8efb", "file": "AppomattoxNewspapers_1926-1933a_0082.pdf", "page": 1, "text": "Hon. J. R. Horseley was nomi nated by H. C. Babcock as chairman. Senator Ferguson, R. L. Burke, J. A. Burke, J. W. Coleman, A. R. Harwood, J. W. Flood, and A. H. Clement en gaged in the discussion urging the adoption of the resolution. Mr Clement urged a further re duction, if possible of 10 cents from each of the road levies Dr, Hutcheson made a splendid address to the farmers on eco nomic conditions and gave time ly advice on diversifying the enterprise of farming. The county budget appears in this paper, which wiil be dis cussed later, and on March 2, 1927, the Board will hear those who desire to be heard on the proposed expenditures andthe as sessment."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "W. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. Flood, and A. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "W. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. Flood, and A. H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [387.34, 247.46, 546.87, 521.51], "bbox_id": "9c24652203", "file": "AppomattoxNewspapers_1908-1909a_0082.pdf", "page": 1, "text": "Hon. J. R. Horaeley was nomi nated by H. C. Babcock as dilairman. Senator Ferguson, R. L. Burke, J. A. Burke, J. W. Coleman, A. R. Harwood, J. W. Flood, and A. H. Clement en gaged in the discussion urging the adoption of the resolution. Mr Clement urged a further re duction, if possible of 10 cents from each of the road levies Dr, Hutcheson made a splendid address to the farmers on eco nomic conditions and gave time ly advice on diversifying the enterprise of farming. , The county budget appears in this paper, which will be dis cussed later, and on March 2, 1927, the Board will hear those who desire to be heard on the proposed expenditures andthe as sessment."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "W. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. Flood, and A. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "W. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. Flood, and A. H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1475.49, 874.74, 1638.44, 1633.51], "bbox_id": "faa149bbee", "file": "AppomattoxNewspapers_1892-1898a_0326.pdf", "page": 1, "text": "Hixburg Items. The many frieuds of the Hon. H. D. Flood about here are of course in high feather, as he coutinues to step upward on the ladder of fame, and as he has so ably filled the many positions of trust to which he has been called, wemey with confi dence expect him to bring success to party, honor to himself and his native county and good to all of the people of the Tenth Congressional District. We all love Harry Tucker, and an able true man he is but unfortunately for him, he appears this time to he the representative of the crown of thorns and cross of gold policy, so let us all hurrah tor Bryan and Sewall, Hall Flood and Free Silver Not only hurrah but use all honor able means to bring about their elec tion. Crops are fairly good in this section, but just now are much in need of a copious shower. Society people here have been having a good time indeed for some weeks back. In addition to our own bevy of beauties, we have been vis ited by Misses Mary and Eva Morton and Sallie Rice, of Pamplin, Misses Annie McCraw, Virginia, Lizzie and Lelia Gilliam, of Buckingham, Miss Bessie Perrow, of Lynchburg, and last by no means least by Miss Sallie Burke and Cousin Mary Taylor cf your own town. This influx of beauty and facination has so be wildered our young men, that they have been earnestly striving to find out just which was which and  where they are at, anyway correspondent is not a prophet, so we will have to await results. When the leaves fall again. Mrs. Annie Earle, nee Hix, of Texas, is again iu the Old State, with her children, visiting her father.  Mrs. Sherman, of Lynchbnrg, is visiting this week at the hospitable home of W. L. Ford, Esq. Miss Carrie Hix died here at the home of her brother W. D. Hix,Esq., on last Wednesday of heai t disease and was buried on Thursday morn ing in the church-yard, by a host of sorrowing friends and relatives. Bnrial service was conducted ty Rev, J. C. Leps assisted by Mr. J. W. Harwood. P e t e r R u f u s ."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Leps assisted by Mr. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. P e t e"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Leps assisted by Mr. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. P e t e"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2099.48, 309.61, 2265.66, 656.87], "bbox_id": "8539dd4072", "file": "AppomattoxNewspapers_1905-1912a_0179.pdf", "page": 1, "text": "his work in Lynchburg after short visit to hip home people. Misses Elisabeth and Mary Drinkard, of Bristol, Tenn., and Rev. and Mrs. 8. G. Harwood, of New York, are viaiting their aunt and mother reapeotfnlly, Mrs. J. W. Harwood. Mrs. Marguerite Watkins, of Farmville, is the gneat of Miss Car rie Hix this week. We feel like congratulating oar friend and oomrade, Mr Herhet Gilliam, upon the faot that be ex pects soon to give np the bachelor ship job whioh he has held so ad mirably for some years and go into partnership business with one now known se Miaa Leslie. Hill, Of near Charleston, W. Va., as bis cherished and most beloved better half. M m cm crip"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "and mother reapeotfnlly, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Mrs. Marguerite Watkins, of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "and mother reapeotfnlly, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>. Mrs. Marguerite Watkins, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1446.0, 892.11, 1608.6, 998.61], "bbox_id": "c49fa50a26", "file": "AppomattoxNewspapers_1892-1898a_0463.pdf", "page": 1, "text": "Cards huve been issued for the marriage of Miss Ellen Holmden, the attractive daughter of Hon. J. W. Harwood of this county to Rev. Benj. C. James, of King William county. The interesting event will be cele brated .at A .3.0. p,. m,,. in the Baptist Church at Pamplin City November 24th."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "attractive daughter of Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> of this county to"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "attractive daughter of Hon. <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> of this county to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [267.85, 1039.91, 432.36, 1307.76], "bbox_id": "18aec606e3", "file": "AppomattoxNewspapers_1926-1933a_0154.pdf", "page": 1, "text": "At a meeting of the Chamber of Commerce here Tuesday reso lutions were passed urging the Highway.Commission to push the construction of Route 10, the most important highway of the state, to completion and make hard surface between Petersburg and Appomattox. The following committee was appointed to meet with citizens all along the road from Appomattox to Petersburg, at Burkeville, todry, to further urge the commission to complete the road S. L. Furgeson, Arthur Irby, A. R. Harwood, J. W, Flood and A. H, Clement The condition of the road is very bad, so bad that the Farmville buss has been discontinued and auto travel between here and Farm ville is dangerous in wet weather."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Arthur Irby, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>, Flood and A. H,"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Arthur Irby, A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>, Flood and A. H,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [666.26, 1323.65, 825.71, 1509.3], "bbox_id": "0f56127a7b", "file": "AppomattoxNewspapers_1892-1898a_0333.pdf", "page": 1, "text": "After two very pleasant hours of intermission the body reassembled in the church and was called to order by Rev. Win. Fisher. After prayer by Rev. R. E. Booker, the iollowiugofficers were elected J. W. Harwood, Moderator J. II. Hankins,Treasurer L. N. Ligou, lerk.  After the usual custom, visiting brethem were recognized, among whom were. Dr. Battle, of peterg. burg, Dr. Eisher, of th Association, Dr. mond South Cu"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "J"], "snippet": "the iollowiugofficers were elected <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, Moderator <mark>J</mark>. II. Hankins,Treasurer"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "J"], "snippet": "the iollowiugofficers were elected <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark>, Moderator <mark>J</mark>. II. Hankins,Treasurer"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [248.88, 1022.89, 412.93, 1290.19], "bbox_id": "2cffa3567f", "file": "AppomattoxNewspapers_1908-1909a_0154.pdf", "page": 1, "text": "A t A meeting of the Chamber of Commerce here Tuesday reso lutions were passed urging the Highway.Commission to push the construction of Route 10, the most im portant highway of the state, to completion and make hard surface between Petersburg and Appomattox. The following committee was appointed to meet with citizens all along the road from Appomattox to Petersburg, at Burkeville, todry, to further urge th e commission to complete the road S. L. Furgeson, A rthur L A. R. Harwood, J. W. A iw d and A. H. Clement The condition of the road is very bad, so bad that the Farmville buss has been discontinued and auto travel between here and Farm ville is dangerous in wet weather."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "rthur L A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. A iw d and"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "rthur L A. R. <mark>Harwood</mark>, <mark>J</mark>. <mark>W</mark>. A iw d and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [474.96, 718.36, 640.66, 901.16], "bbox_id": "d124ff4b7c", "file": "AppomattoxNewspapers_1933-1936a_0101.pdf", "page": 1, "text": "A reunion of the Harwood family was held last week, July 2 to 9. at the old Harwood home, Where J. W. Harwood settled 60 odd years ago when he first came from Eng land. Those present during the week were Mr. and Mrs. A. R Harwood, of Appomattox Mrs. J B. Abraham, of Alexandria Mr. and Mrs. S. G. Harwood, of Victoria Mr and Mrs. J. W. Haden and family, of Fife Mr and Mrs. J P Harwood, of Rich mond Mr. and Mrs. F S Harwood and son, Kieth, of Keyport N- J-J Mr. and Mrs. Wilson Hix and fam ily and Mrs. J. T Hix and daugh ter, of Hixburg Mrs. W. K Graves, of Bluefield. E. W Harwood, of New York was the only who could not be present. . . ............................"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "old Harwood home, Where <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> settled 60 odd years"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "old Harwood home, Where <mark>J</mark>. <mark>W</mark>. <mark>Harwood</mark> settled 60 odd years"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.9, 270.0, 2084.6, 1001.01], "bbox_id": "9450e49208", "file": "AppomattoxNewspapers_1912-1915a_0153.pdf", "page": 1, "text": "Special Sermon to Graduates Eight P. M., Sunday, June 1, 1913 Opening Hymn - 435All H ail.the Power of Jesus Name Prayer  -  - -  Rev. R. L, Wingfield Sermon - - - - Rev. J. H. Light of Lynchbury, Va. Hymns at Disposal of Pastor 472 O, Come, loud anthems let Us sing 635Now The Day is Over Musical Program Monday, June 2,1913 Opening Chorus - - -  June is Here New Woman March - - - - - Webb First PianoRussell Ferguson A lice Cheatham Second PianoPearl Caldwell, Susie Caldwell Waltz - - - - - - .    Holet Sammie Ferguson, Verta Smith Bohool Flag March - - -  ,.  Mildred Trent, Uine Smih M March - - - - Estelle Paris, Susie Purdum Song  , -    Wedding M a r c h ................................. Nettie Moses, Elaine McDearmon Edelweiss Glide -  -  Pauline Clement Fruhlings March - - - M argaret Agee, Lucile Caldwell, Ellen Rogers Grande Valse de Concert - - - - First PianoMyrta Fuqua, Lucile Guthrie Second PianoNeta Marshall, Mary Beale Ju st a Teeny-Tiny Bit - -  Seventh Grade Mill is the Black Forest - Pearl Caldwell, Susie Caldwell Over Hill and Dale - - - -  Engelman First PianoFrances McDearmwn, Mildred McDearman Second PianoBessie Fraklin, Cornelia Gills Invitation to the Dance t Weber First PianoNeta Marshall Second PianoMyrtie Fuqua . - - - - - . American Eagle Program For The Lee Literary Society Tuesday, June 3,1913 . . - - - My Own United States _ j - - - - - President RecitationThe Fashionable School Girl Miss Mary Beale Oration - - .............................................Alfred Tweedy Recitation W atching the Sparking Miss Pauline Clement Sextette - - - - -   Sleep Kentucky Babe  D. Mpses  E. W. Harwood Base  J. W. Flood, Jr. Tenor  C. K. Hunter I L. A. Harrison . A. 0. Clement Debate Resolved that Capital Punishment Should be Abolished Judges A. T. Inge, Claude Smith, Sam Inge Affirmative    - - - Frank Blackwell, 1st year .  - . - Havilh Babcock, 1st year .. . . - - . Miss Neta Marshall . - -  - Charlie Moses, 1st year . . -  - Fonnie Woolfolk, 3rd year Parting Song Graduation Exercises of Class of 1913 W ednesday Night, June 4,1913, 815 Oclock Praver - - - - RevR.,0. Hubb rd No. 105a 120 Acres 22001 _ Number 383 - -  -  Audience This tract of land is located Salutatory Address . . . . Don Moses within four miles of splendid I Graduating Song - -  -  , i_ Class railroad town. The land lays j Class History - -  - - -  Susie Hancock w ell for general farm ing 40 RecitationTwo Gray Wolves - -  Ola Sears acres fenced 20 acres in hog Class Prophecy - - - - Alice Drmkard pasture 20 acres under plow instrum ental Selection - - 8oldiers MarchGounod 100,000 feet saw timber. Four- j First PianoFrance McDearmon, Alice Cheatham room frame dwelling house and  Second PianoLuqile Guthrie, Russell Ferguson"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "Babe  D. Mpses  E. <mark>W</mark>. <mark>Harwood</mark> Base  <mark>J</mark>. <mark>W</mark>. Flood, Jr. Tenor"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "Babe  D. Mpses  E. <mark>W</mark>. <mark>Harwood</mark> Base  <mark>J</mark>. <mark>W</mark>. Flood, Jr. Tenor"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1517.47, 507.09, 1692.72, 1120.49], "bbox_id": "88d6bc2bf4", "file": "AppomattoxNewspapers_1908-1909a_0066.pdf", "page": 1, "text": "A,fter a painful illness of. end rnpnths di whifeb im e shii eihibited fortitude and courage, Mrs W .l A. Durham, who before her mar-1 riae was -Mies,Eliora Fuqual passed to her final reward onT Friday, December IRh, 1925, ail p. m. The funeral which! was largely attended, was con-1 ducted from lxurty Baptist! Church, Sunday afternoon, Dec.1 12th, and interment was made! in the family cemetery just out-j side of the village. Rev. Wi M .I Thompson, her pastor, assisted! by Reverends D. Q. B t e i wd R. E. Redding conducted thej fuftnd service. - The active bearers were L. El Smith, A. R. Harwood, W. O . j Mos, Dr.. C F . Jwnes, C. S McDearmon, Ned Wagers, J- E. Steele, and Col. Joel Flood. The honorary bearers were bailie Moore, H. C. Babcock, J . D. Morris, J . E . Sears, Dr. D . I A- Christian, Senator S. L. Fer guson, Dr. L. L. Gale. Mayor Jf. W- Cawthorn. Tom Moses, C . T .l  Moses, Robt. Irby, Ben Caldwell, J C . W.  Hancock, Walter Han-J cock, Tom Wtflton and A. H .l Clement. Rtert Caldwell, Jr ., j served as ushers. Mrs. Durham was born and reared in Appomattox Connty and had lived in this community I f.about. 88 years. She was- a pious and consecrated Chriatfan, l a devoted mother and death, a faithful m em ltef wh- erty Baptist Church. She is sur vived by three efiildren a t Wm lows Dr. Terty Durham, of j London, Eng., Walter. E - Dut ham, of Richmond   5 a n d Mrs. Alpha Durham Higgenbot- ham, of this village. All of her children .were with her - during her last illness arid death,"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "j"], "snippet": "El Smith, A. R. <mark>Harwood</mark>, <mark>W</mark>. O . <mark>j</mark> Mos, Dr.. C F"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "j"], "snippet": "El Smith, A. R. <mark>Harwood</mark>, <mark>W</mark>. O . <mark>j</mark> Mos, Dr.. C F"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1245.08, 425.2, 1381.13, 937.75], "bbox_id": "4532e35145", "file": "AppomattoxNewspapers_1918-1922a_0012.pdf", "page": 1, "text": "81 a ton, free on board J loading point or port. Farmel to pay in addition freight tol shippng points. Applications for a part of J trate bought by the GoverJ will be received only fron farmers or owners or holdel farms for use on their land may be made though Qoantj. B. G. Anderson or throng! member of a local cornet! aUting of A. R. Harwood Hamilton, J. W. Franklin ail T. Steele. I No money will be reqaired the application, but upoa from the authorized reppseoi of the Department of Ag -cui farmers who have signed PJ lions must deposit with a 1 bank, association, or individual lgnated by the Secretary of culture to act as the fanners for that parpose, money to the cost of the fertilizer excepl freight charge. In practically ery case tbe money wil1 be pai3 County Nitrate Distributor J nated by the Department of culture. Nitrate will be shippl distributors on sight draft with cf lading attached. Distribl will pay drafts, take up the bil lading, collect money from far! and distribute nitrate to fanj Ar.angemeats have been maa secure a large quantity of nil and it is believed tbat all real ble requirements can be met. Applications must be in by Jl ary 25,1919"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "aUting of A. R. <mark>Harwood</mark> Hamilton, <mark>J</mark>. <mark>W</mark>. Franklin ail T. Steele."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "aUting of A. R. <mark>Harwood</mark> Hamilton, <mark>J</mark>. <mark>W</mark>. Franklin ail T. Steele."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.07, 896.16, 1543.82, 1153.65], "bbox_id": "59e35cc4a9", "file": "AppomattoxNewspapers_1908-1909a_0068.pdf", "page": 1, "text": "W. 0. Moss Appomattox Va. IC lement . I rule com rade is not wjÊÊÊÊQÊ,, . .. I With low N otice to Car Owners ur money I  The law requires all car owners apointmente to have their headslighte offi- feiaily adjusted to comply, with j sections 50-59, Chapter 474, of toe part you  toe Motor Vehicle Laws of Va. access dur  This must be done by .Jan. .1 bu a merry 1927. After that time toe cers lappy new will have to eiiilice thé law J . A . B in g h a m S hoppe   Auto Inspector. gner, Bessie  ,  i I Harwood, j N e w M a y o r H 8- At a meeting of the Town Kirs, leduu Council Monday evening the re- i and . Fred I signation of J. W. Cawthon was Ing the holi acjepted and the council pro- A fdlk w e J ceeded to appoint W. L. Brown f for toe unexpired term. y that Mr. There is much regret that Mr."}, "highlight": {"text": {"matched_tokens": ["Harwood", "j", "w"], "snippet": "gner, Bessie  ,  i I <mark>Harwood</mark>, <mark>j</mark> N e <mark>w</mark> M a y o"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "j", "w"], "snippet": "gner, Bessie  ,  i I <mark>Harwood</mark>, <mark>j</mark> N e <mark>w</mark> M a y o"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [340.1, 246.43, 502.45, 987.08], "bbox_id": "3b3bf38eb4", "file": "AppomattoxNewspapers_1922-1923a_0010.pdf", "page": 1, "text": "Tobacco M en in C onference The tobacco interests of Ap pomattox will be ably repre sented at South Boston to-day, where the question of market ing facilities at Appomattox will be considered. A ppomat- tox is to make every provision for the proper handling of all grades of tobacco, which will be a great convenience to the members x of Co - operative marketing in this section of Virginia. Among those attending from this county we note W. 0 Moss, R. L. Burke, H C. Bab cock, A. R. Harwood, J. E. Sears, W. U. Byrne, Jno. C. Moore, Jr., and M. C. Smith. Mr. S. V. Panlett, of Pamplin, was in town yesterday and said that Pamplin would be represented at the meeting. Our director, W. C. Wingfield, is scheduled to be here before a meeting on the 15th instant to enlighten the members of the association. Beginning the conference with the warehousemen of four states at South Boston, Va , on Wednesday, April 5th, continu ing conferences at Greensboro and Raleigh, N. C , on April 6th and 7tb, and ending the meetings at Florence, S. O., on Saturday, April 8tb, Warehouse Manager T. C. Watkins and the committee on warehouses will report to a full meeting of the directors of the association in Raleigh on Tuesday, April lltb. The recent selection of Oliver J. Sands, of Richmond, presi dent of the American National Bank of that city, as manager of the Marketing Association, and the choice of Frank D. Williams, the skillful leader of the sun cured pool of Virginia, and well-known leaf dealer, as manager cf the Dark Leaf De partment will further insure the success of the association in three states. Growers in both the Carolina and Virginia are urged to sup port the many meetings being held this week and to win new signers to the contract."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Bab cock, A. R. <mark>Harwood</mark>, <mark>J</mark>. E. Sears, <mark>W</mark>. U. Byrne, Jno. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Bab cock, A. R. <mark>Harwood</mark>, <mark>J</mark>. E. Sears, <mark>W</mark>. U. Byrne, Jno. C."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [900.5, 235.01, 1052.0, 1150.47], "bbox_id": "4998768d82", "file": "AppomattoxNewspapers_1971-1973a_0048.pdf", "page": 1, "text": "Mrs. R. C. Moore and dau ghter, Margaret of F a i r f a x spent a part of last week with Mrs. T. N. Saul. Mr. and Mrs. Harwood Cary, Mrs. J. W. Jennings, all of Bethelem were Sunday visitors of Mr. and Mrs. Russell L. Harris. Mr. and Mrs. W. T. Cook spent a part of last week with Mr. and Mrs. Fred S. Barton in Richmond. They also visit ed Mr. and Mrs. Herman R. OBrien and Mrs. Elsie Martin and family all of Richmond. Mrs. Berkley N. OBrien re turned home Sunday from the Southside Community Hospital where she underwent surgery last week, she is improving nicely. Visitors during last week in the home of Mr. and Mrs. C.H. Morris were Mr. and Mrs. E r nest Cook, Particia, Ernest and Edward all of Afr ica but now will be making their home in Louis- ana Mr. and Mrs. Bernard Cook of Farmville Mr. Jack Morris and Mrs. Herbert Stanley, both of Richmond Mr. and M rs . Marvin Glover of Hixburg. Vernard Proffitt is a patient in the University Hospital at Charlottesville. He isdoingfine after having surgery last week. Mr. and Mrs. Robert E. Met calfe and family were Labor Day week end visitors of Mr. and Mrs. W. T. Cook, they were from Virginia Beach Mr. and Mrs. Edward Cook, Kenneth and Randy of Prospect were visit ors in the same home. Mr. and Mrs. Bill Senger ac- compained by Mr. and M r s . Clarence Hicks ofRichmondare spending some time in Chicago, HI. with relatives. Sunday visitors in the home of Mr. and Mrs. Raymond G. Barr were Mr. and Mrs. Ray L. Duty and family of Andersonville. Mr. and Mrs. Roger Morris and family were Sunday supper guest of Mr. and Mrs. Rice Seay at Andersonville. Mr. and Mrs. A. N. Morris visited Mr. and Mrs. Claude Morris of Dillwyn Sunday. Paul and Glen Manis of Sey mour, Tenn. were visitors in the J. L. Harris home over the week end. The regular W. M. S. Meet ing will be held at the Church Friday Sept. 17 at 800 p.m. Sunday visitors of Mr. and Mrs. Edward Senger were Mr. and Mrs. Clyde Senger and family of Crewe. Mr. and Mrs. K. M. Beasley, Jr. and Katherine Ellen visit ed in the home of Mr. and Mrs. Ralph Repass of Appomattox Sunday. The Reb. Robert E. Johnson was Sunday dinner guest of Mr. and Mrs. Roger Morris. Mrs. Mrs. Don Morris was host ess to the Home Demonstration Club Monday in her home. Saturday supper guest of Mr. and Mrs. K.M. Beasley, Jr. were Mrs. Katherine Carson and Clifton of Spout Spring."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Saul. Mr. and Mrs. <mark>Harwood</mark> Cary, Mrs. <mark>J</mark>. <mark>W</mark>. Jennings, all of Bethelem"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Saul. Mr. and Mrs. <mark>Harwood</mark> Cary, Mrs. <mark>J</mark>. <mark>W</mark>. Jennings, all of Bethelem"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1963.45, 259.03, 2133.59, 492.28], "bbox_id": "69122eb112", "file": "AppomattoxNewspapers_1939-1943a_0329.pdf", "page": 1, "text": "K. IT. Crawley, and Mrs. Fennell Harwood, of Richmond, J. W. Craw ley, of Hampden-Sydney and Mrs. Marguerite Downing, of Nashville, Tenn., were recent guests of Mr. and Mrs. L. Crawley. Miss Dorothy Ferguson has re turned home after spending a week with her grandmother, Mrs. J. A. Smith. , - .  Miss Thelma Smith has returned HonrC after visiting her sister for a week. Mrs. S. S. Shouse and mother, Mrs. Minna Bigoney, of New York, are spending some time at their country home, Eldon Farm, near here. Mr. and Mrs. Alfred Doss and family, Mr. and Mrs. aim Gunter, of Concord, Mr. and Mrs. Harvey Perdue, of Spout Spring, called in the home of Mr. and Mrs. J. A. Smith last week."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Crawley, and Mrs. Fennell <mark>Harwood</mark>, of Richmond, <mark>J</mark>. <mark>W</mark>. Craw ley, of Hampden-Sydney"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Crawley, and Mrs. Fennell <mark>Harwood</mark>, of Richmond, <mark>J</mark>. <mark>W</mark>. Craw ley, of Hampden-Sydney"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.27, 915.33, 1853.11, 1677.53], "bbox_id": "6c3de3edef", "file": "AppomattoxNewspapers_1926-1933a_0412.pdf", "page": 1, "text": "Joseph 0- OBrien, 49 years of age, died Monday morning in a Lynchburg hospital, where he had been ill for three weeks. Mr. OBrien was a native of Lynchburg, being a son of the late William A. OBrien. He is survived by his widow, two song, Otway and Randolph, of Lynch burg four daughters, Mrs. Ellis Brame, of Chase City Misses Elizabeth, Virginia and Adeline OBrien, of Appomattox three brothers, William OBrien Jr., of Kyle, W. Va. and E. H. and Gray L. OBrien of Lynchburg and three sisters, Mrs. C. B Johnson, Lynchburg Mrs. C. P. Hardaway, Bluefield, W. Va. and Miss Marion OBrien, of Takoma, Md. Deceased was a steward in Appomattox Memorial church and lay evangelist, and at the time of his death had charge of the fresh meat department of H. M. Burge Co., here. He was perhaps the best judge of live stock in the county and was  frequently , called uppn by our farmers in judging and administ ing to ill stock. He was popular and had many warm friends who sorrow with his family in his death. Funeral services were conduct ed from the Methodist church here by Rev. George Reamy, his pastor, assisted by Revs. Red ding, Clark and Caudil before a large crowd of friends of the ramily and burrial was made in the Caldwell cemetery at East I Ridge Farm. Honorary pall-bearers Drs. D. A. Christian, D. N. Twyman, W. G. Ould, L. E. Smith, H. C, Babcock, J. H, Cheatham, L. Orawley, C. S. McDearmon, R. Irby, J. D. Morris, W. R. Rey lolds, George R. Purdum and G. O. Gordon. Active pall-bearers J. E. Din- widdie, J. W. CawthornA R. Harwood, H. W. McKinney, A. H. Clement, B. G. Anderson M. C. Smith, R. C. Wagner, W. L. Brown, T. W, Odor, Joel V. Flood and Chfudeg F James. Flower-bearers Wm. W. Burke Jas. L. Caldwell, John Curtis Caldwell, W. Dotridge Martin, leorge Wiley Woolridge, R. W. Stanley and H. M. Chandler."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "J. E. Din- widdie, <mark>J</mark>. <mark>W</mark>. CawthornA R. <mark>Harwood</mark>, H. <mark>W</mark>. McKinney, A."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "J. E. Din- widdie, <mark>J</mark>. <mark>W</mark>. CawthornA R. <mark>Harwood</mark>, H. <mark>W</mark>. McKinney, A."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1707.27, 1692.56, 2027.48, 1752.76], "bbox_id": "7ab149fb96", "file": "AppomattoxNewspapers_1918-1922a_0022.pdf", "page": 1, "text": "C W Hancock M C Smith C A Hancock D M Robertson A T Inge H W McKinney A R Harwood S J Lee W C Harvey, Sr. A H Clement C S McDearmon"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "<mark>W</mark> McKinney A R <mark>Harwood</mark> S <mark>J</mark> Lee <mark>W</mark> C Harvey, Sr. A"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "<mark>W</mark> McKinney A R <mark>Harwood</mark> S <mark>J</mark> Lee <mark>W</mark> C Harvey, Sr. A"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [947.73, 1018.33, 1266.88, 1079.78], "bbox_id": "51640e1c3f", "file": "AppomattoxNewspapers_1918-1922a_0020.pdf", "page": 1, "text": "C W Hancock M C Smith C A Hancock D M Robertson A T Inge H W McKinney A R Harwood S J Lee W C Harvey, Sr. A H Clement C S McDearmon"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "<mark>W</mark> McKinney A R <mark>Harwood</mark> S <mark>J</mark> Lee <mark>W</mark> C Harvey, Sr. A"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J", "W"], "snippet": "<mark>W</mark> McKinney A R <mark>Harwood</mark> S <mark>J</mark> Lee <mark>W</mark> C Harvey, Sr. A"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1267.4, 1474.81, 1389.54, 1729.56], "bbox_id": "80a68ba05b", "file": "AppomattoxNewspapers_1915-1918a_0381.pdf", "page": 1, "text": "The State Corporation is8nd following charters  Chattarcy Coal Co., Inc., J n Q W. F. Harwood, president, Vaughan, secretaryo 0 burg. Capital, 300,000. Cost ness. yfli Tyree Coal Land Co J. fi. burg. E. T. Tyree, I Vaughan, secretary  tr burg. Capital, 100,000- Co ness. paljj Amendment to charter  Estate, lnc Houston mere tal stock, 50,000 to  80 , 000 .  Amendment to char Cities Stores Corp0y WuinerS changing name to S.   Corporation. of it Supplemental .cert aner CM 0 poration to Virginia B .ncrea l poration. Big Stone GP.fl ?500000. capital stock, 1 , . s Amendment to cha l0Itkn Syrup and Stores v j mond, changing name Stores Corporation."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Chattarcy Coal Co., Inc., <mark>J</mark> n Q <mark>W</mark>. F. <mark>Harwood</mark>, president, Vaughan, secretaryo 0"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Chattarcy Coal Co., Inc., <mark>J</mark> n Q <mark>W</mark>. F. <mark>Harwood</mark>, president, Vaughan, secretaryo 0"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1693.68, 1400.9, 1852.02, 1423.85], "bbox_id": "b85e9899d2", "file": "AppomattoxNewspapers_1892-1898a_0427.pdf", "page": 1, "text": "Nottoway. J . W. moderator and L. Harwood is the N . Ligón, clerk."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Nottoway. <mark>J</mark> . <mark>W</mark>. moderator and L. <mark>Harwood</mark> is the N . Ligón, clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Nottoway. <mark>J</mark> . <mark>W</mark>. moderator and L. <mark>Harwood</mark> is the N . Ligón, clerk."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2026.55, 884.29, 2372.6, 1249.29], "bbox_id": "46f6f31eef", "file": "AppomattoxNewspapers_1939-1943a_0169.pdf", "page": 1, "text": "nolds, of Appomattox, Miss Sadie Reynolds, of Richmond and Mrs. Harry N. Hunt, of Raleigh, N. C. one feister, Mrs. Leila Lovp, of Gretna and two brothers, J. h. Reynolds, of Danville, and C. V . Reynolds, of Gretna. As a mark of respect, local stores uwi v.. a..-...-..  ---- were closed during the funeral hour fact that cross traffic lines .will be yesterday. Great quantities of love- painted on the street in front of ly flowers were banked in the par-, the school, and ask cooperation from lors of the home. During ithe ser- the public in safety observance, vices a quartet sang Abide With Me. Active pallbearers were C. W . Smith, F. L. Murphy, R.L Burke, Chaa. T Moses, J A Burke, H _W. McKinney, R. A. Glenn and B G Anderson. Honorary pallbearers were Leslie Ferguson, C .H . Rob inson, J. D. Morris, H. M Bulge. C F James, JFleücher Garrette L. C  Hatcher, J. K Megginson, R W Burkey, Eddie Blackwell, Ar thur BlSätaell, C . C. Cralle, T W . Moses, Duval Conner, L. Crawley, J. W. Cawthon, A R. Harwood, George Abbitt, Watkns Abbitt, C. S McDearmon, Joe LeGrand, Don Moses, Will Smith, L.E. Smth, Lu ther Morris, Wiley Moms, A T . Inge, Dr. D. A Christian, Dr W L Ould, Dr C G OBrien, Leroy Smth, Dr L L Gayle, Sam Ferguson, E. T Mitchell, Joel W. Flood, H. C. Pulliam, S S . Coffman, J HO Bnen, David Carter and J B Ford. At the burial services, the Rev. H D. Coffey assisted Rev. Red ding and Rev. Shearer."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Duval Conner, L. Crawley, <mark>J</mark>. <mark>W</mark>. Cawthon, A R. <mark>Harwood</mark>, George Abbitt, Watkns Abbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Duval Conner, L. Crawley, <mark>J</mark>. <mark>W</mark>. Cawthon, A R. <mark>Harwood</mark>, George Abbitt, Watkns Abbitt,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [253.43, 327.34, 416.06, 1224.9], "bbox_id": "ee8a14a089", "file": "AppomattoxNewspapers_1908-1909a_0492.pdf", "page": 1, "text": "Mr. and Mrs. Duval Caw- thorne, of Princeton, W. Va., visited this week in the home of C- S. McDearmon. Mrs. R. A. Steffans and three children, of Meanie, Florida, are visiting Mr. and Mrs. J. S. Kenney. . BL W. E. Abbitt, of Roanoke, and J. R. Abbitt, of Sweet Briar, spent Wednesday .in the home of A. R. Harwood. Mr. and Mrs. J. W. Scott, of New York have returned home after visiting Mr. and Mrs. W. W. Scott and Mrs. Tad Sears. Eddie, Betty and Jim Stan- of Virginia Beach are visiting their grandmother, Mrs. J. H. Stanley. Mrs. Helen Hicks, of Lynch burg, spent the week-end with her mother, Mrs. Cora John son.Thomas N. and H. J. Cam- efix and children, of Richmond Client the Fourth of July holi days with relatives near Vera. Little Miss Pauline Jamer- son has beensp ending some time visiting her grandparents Mr. and Mrs. R. L. Godsey. Mr. and Mrs. D. J. Frank lin visited his sister, Mrs. W. P. Gunter, in Petersburg, Sun day. Mr. and Mrs. Finley Doss and son, - Junior,spent the week-end with his parents Mr. and Mrs. Samuel H. Doss. Mr and Mrs. C. A. Hancock and grand-daughter, Jeanette, have returned to Huntington, W. Va., after visiting here. Mr. and Mrs. W. A. Walton have returned to Disputania after visiting Mr. and Mrs. T A. Walton here. Prof. Fitzgerald Flournoy and Mrs William Cabell Flour noy, Of Lexingtoh, were guests last week of Mrs. E. E. Gills. A party of local boys and girls spent Monday, July 4, at Lake Tonawanda, ending With a picnic supper at 6 oclock. The Rev. W. M. Thompson, Miss Virginia Lee Thompson and Jack Scott left this week to attend the Baptist encamp ment at Virginia Beach. Mr. and Mrs. Jay Packard, of Antigo, Wis., leftIor Rich mond and Washington after visiting Mr. ahd Mrs. H. C. Babcock here. . Mrs. Bezryl Burgardner, of Stoney Bottom, W. Va., and children, have returned home after visiting her aunt, Mrs. H. C. Babcock and others here. Miss Frankie Godsey, Of Lynchburg, .returned .home after a pleasant visit in the home of Mr. ahd Mrs. R. L. Godsey. i  Jones Caldwell, Of Lynch burg, Mr. and Mrs. C. D. Lew- jis and sons, Clark and Dan, visited their parents, Mr. and i Mrs. M. C. Caldwell, during the week-end."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "home of A. R. <mark>Harwood</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Scott, of New York"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "home of A. R. <mark>Harwood</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Scott, of New York"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [255.6, 349.38, 413.22, 597.77], "bbox_id": "e64f47e42a", "file": "AppomattoxNewspapers_1926-1933a_0492.pdf", "page": 1, "text": "Mr. and Mrs. Duval Caw- thorne, of Princeton, W. Va., visited this week in the home of C. S. McDearmon. Mrs. R. A. Steffans and three children, of Meanie, Florida, are visiting Mr. and Mrs. J. S. Kenney.  , W E. Abbitt, of Roanoke, and J. R. Abbitt, of Sweet Briar, spent Wednesday in the home of A. R. Harwood. Mr. and Mrs. J. W. Scott, of New York have returned home after visiting Mr. and Mrs. W. W. Scott and Mrs. Tad Sears. Eddie, Betty and Jim Stan ley, of Virginia Beach are visiting their gt andmother, Mrs. J. H. Stanley. Mrs. Helen Hicks, of Lynch burg, spent the week-end with her mother, Mrs. Cora John-"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "home of A. R. <mark>Harwood</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Scott, of New York"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "home of A. R. <mark>Harwood</mark>. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Scott, of New York"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "L. Burke, A. R. <mark>Harwood</mark>, <mark>J</mark>. A. Burke, H. <mark>W</mark>. McKinney, Geo. Ab bitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "L. Burke, A. R. <mark>Harwood</mark>, <mark>J</mark>. A. Burke, H. <mark>W</mark>. McKinney, Geo. Ab bitt,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1997.48, 343.62, 2158.65, 599.87], "bbox_id": "0fe6352fed", "file": "AppomattoxNewspapers_1915-1918a_0362.pdf", "page": 1, "text": "levy, to extend over a period of thiee years , 7 That we reoommend three executives from each district to ioo-operate with the Board of Supervisors in the expenditure of this road fund, and the su pervision of these improved rogds. These exeoutives to be I nominated at the next general meeting, to be held at Appo mattox Courthouse on Satur- day, April 28, at 1 ooloek p. no. j Board of Directors W. J. Covington, A. R.I Harwood, E. P. Sears, J. T. Coleman, Laoy B. Martin, H.B. Marshall, G. O. Thornhill, A. P. White, Howard Hard ing, noting R. P. Bry ant, absent."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood", "J"], "snippet": "j Board of Directors <mark>W</mark>. <mark>J</mark>. Covington, A. R.I <mark>Harwood</mark>, E. P. Sears, <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood", "J"], "snippet": "j Board of Directors <mark>W</mark>. <mark>J</mark>. Covington, A. R.I <mark>Harwood</mark>, E. P. Sears, <mark>J</mark>."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2130.95, 1728.47, 2349.05, 1818.61], "bbox_id": "22c4b4dd8c", "file": "TimesVirginian_1983a_0274.pdf", "page": 1, "text": "L Mary 8. Hudson, Assistant Cashier, of the above-named bank da hereby declare that this Report of Condition it true and correct totte teat of my knowledge and belief. MaryS Hudson July .10 Wo, the aniteelgniiit directors attest the correctness of this slslimmt sf rsssiurta snl lsr1ltliTT   bo sisal hurt by w , and to the best of our knowledge and belief is E ton Bud oofNCt, A. R. Harwood, Jr., J. E. Jamerson W. M Abbitt. DIRECTORS"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Bud oofNCt, A. R. <mark>Harwood</mark>, Jr., <mark>J</mark>. E. Jamerson <mark>W</mark>. M Abbitt. DIRECTORS"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Bud oofNCt, A. R. <mark>Harwood</mark>, Jr., <mark>J</mark>. E. Jamerson <mark>W</mark>. M Abbitt. DIRECTORS"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [134.92, 1672.49, 392.36, 1797.19], "bbox_id": "816d4847e0", "file": "TimesVirginian_1980a_0141.pdf", "page": 1, "text": "I, Douglas M. Webb, Assistant Vice-President of the above-named bank jo hereby declare that this Report of Condition is true and correct to the best of my knowledge and belief DOUGLAS M. WEBB, M A ,v . April 23, I960 We, the undersigned directors attest the correctness of this statement of resources and liabilities. We declare that it has been examined by us, and to the beat ,of our knowledge and belief is true and correct. A. R. HARWOOD, JR., J. A. MATHEWS, W. E. JAMERSON, Directors"}, "highlight": {"text": {"matched_tokens": ["HARWOOD", "J", "W"], "snippet": "and correct. A. R. <mark>HARWOOD</mark>, JR., <mark>J</mark>. A. MATHEWS, <mark>W</mark>. E. JAMERSON, Directors"}}, "highlights": [{"field": "text", "matched_tokens": ["HARWOOD", "J", "W"], "snippet": "and correct. A. R. <mark>HARWOOD</mark>, JR., <mark>J</mark>. A. MATHEWS, <mark>W</mark>. E. JAMERSON, Directors"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1439.76, 1109.08, 1607.61, 1241.48], "bbox_id": "9dc7fbeb7e", "file": "AppomattoxNewspapers_1908-1909a_0123.pdf", "page": 1, "text": "bread, biscuits and cakes werei served. Those present were A. j R. Harwood and family, W. M. rhompson and family, D. N. rw ym an and fam ily, W. B. Cald well and family, Mrs- E. E. Gills, j Mary Louise Gills, and Robert! GUIs, K enneth Moore, Erin  T rent, W ilay Morris, Mrs. Ed ward Dinwiddie, M rs.. Bessie  lam es. Miss Catherine Gills, Mr."}, "highlight": {"text": {"matched_tokens": ["j", "Harwood", "W"], "snippet": "Those present were A. <mark>j</mark> R. <mark>Harwood</mark> and family, <mark>W</mark>. M. rhompson and family,"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Harwood", "W"], "snippet": "Those present were A. <mark>j</mark> R. <mark>Harwood</mark> and family, <mark>W</mark>. M. rhompson and family,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [626.39, 383.88, 801.59, 649.27], "bbox_id": "0a3098e9b7", "file": "AppomattoxNewspapers_1939-1943a_0346.pdf", "page": 1, "text": "and is teaching at Oakville. Mr. and Mra. W. P. Ferrell and family will spend Sunday is Roan oke. Mr. and Mra. E. W. Harwood, of Gloversville, N. J., are visiting re- atives here and at Hixourg. Mrs. F. E. Graef is spending to day and Friday in Charlottesville. Miss Alice Harwood is spending today in Farmville. Mr. and Mrs. Don Moses accom panted their son, Billy, to Blacks burg Friday, where he enrolled at V. P. I. W. M. Abbitt, president of the Lions Club, and J. H. Lucado, vice- president, will attend a Lions Club one meeting and banquet of tha Farmville Lions Club tomorrow at arm villa. Mist Hilda Carter apent last week a Ocean View, and visited the Nor folk Naval Base."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "Mr. and Mra. E. <mark>W</mark>. <mark>Harwood</mark>, of Gloversville, N. <mark>J</mark>., are visiting re- atives"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "Mr. and Mra. E. <mark>W</mark>. <mark>Harwood</mark>, of Gloversville, N. <mark>J</mark>., are visiting re- atives"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [946.1, 1058.26, 1264.7, 1068.71], "bbox_id": "a0c1ef54d8", "file": "AppomattoxNewspapers_1918-1922a_0018.pdf", "page": 1, "text": "A R Harwood S J L ee W C H arvey, Sr."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "A R <mark>Harwood</mark> S <mark>J</mark> L ee <mark>W</mark> C H arvey, Sr."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "A R <mark>Harwood</mark> S <mark>J</mark> L ee <mark>W</mark> C H arvey, Sr."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1677.61, 1477.47, 1837.56, 1654.77], "bbox_id": "b9d92367f2", "file": "AppomattoxNewspapers_1908-1909a_0412.pdf", "page": 1, "text": "trby, J. D. Morris, W. R. Rey nolds, George R. Purdum and G. O- Gordon. Active pall-bearers J. E. Din widdie, J. W. Caw thorn, A R.  Harwood, H. W. McKinney, A. H. Clement B. G. Anderson M. C. Smith, R.- C- Wagner, W. L. Brown, T. W Odor, Joel V. Flood and Charles F- James Flower-bearers Win. W. Burke Jas. L. Caldwell, John Curtis Caldwell, W. Dotridge Martin, George Wiley Woolridge, R, W. Stanley and H. M Chandler."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "J. E. Din widdie, <mark>J</mark>. <mark>W</mark>. Caw thorn, A R.  <mark>Harwood</mark>, H. <mark>W</mark>. McKinney, A."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "J. E. Din widdie, <mark>J</mark>. <mark>W</mark>. Caw thorn, A R.  <mark>Harwood</mark>, H. <mark>W</mark>. McKinney, A."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1593.85, 566.93, 1759.55, 1015.64], "bbox_id": "f5b2b01961", "file": "AppomattoxNewspapers_1912-1915a_0260.pdf", "page": 1, "text": "Thank striving Dinner to the Veterans The Appomattox Chapter U. D. C., ever thoughtful of the Confede rate veterans, served a bountiful Thanksgiving dinner after they lad listened to a most excellent ser mon by Rev. R. W, Norris, of Pam plin, to the Gamp and the Chapter in Liberty Baptist Ohnroh. The adies and friends of the Chapter donated the.edibles and never were people more liberal. Special men tion should be made and thanks given to Messrs. L. E. Smith, S. L. Ferguson, T. B. Pretlow, Alfred Harwood, W. M. Hancock, LeBoy Smith, J. R. Horsley, Inge . Mor ris, A. H. Clement, Olaud Smith, Mrs. Bessie James, Miss Myrtle Inge, Mrs. L. E. Smith, Mrs. T. A. Walton, Mrs. Emmett Abbitt. Those receiving were, Mrs. 0. W. Hunter, President Mrs. J. B. Ab bitt, Mrs. T. B. Pretlow, Misses Nina Jones, Mary Caldwell, Clara Caldwell and Russell Ferguson. Those in charge of the dinner were Mr. and Mrs. T. B. Pretlow, Mrs. 0. W. Hunter, Miss Clara Caldwell and Miss Nina Jones as sistants were Miss Myrtle Inge and drs J B Abbitt. i Thanks and bles sing by Rev R C Hubbard The veterans seemed to enjoy everything done for them on this oooasion"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "T. B. Pretlow, Alfred <mark>Harwood</mark>, <mark>W</mark>. M. Hancock, LeBoy Smith, <mark>J</mark>. R. Horsley, Inge . Mor"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "T. B. Pretlow, Alfred <mark>Harwood</mark>, <mark>W</mark>. M. Hancock, LeBoy Smith, <mark>J</mark>. R. Horsley, Inge . Mor"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [663.1, 220.42, 827.9, 1417.65], "bbox_id": "4f3b65f1cc", "file": "AppomattoxNewspapers_1918-1922a_0521.pdf", "page": 1, "text": "Mrs. F ran k H anenkrat. ko k e 1st, Mrs. J. S. P lu n k ett 2nd, F rancis Sm ith. Cover 1st, Mrs. R. E. Glght 2nd, Mrs. M. C. Smith. Collar 1st, Mrs. C. E. Carson 2nd, E dith Harwood. Collar 1st, Mrs. H. J. W illiam s 2nd, Mrs. G. O. Gordon. koke 1st, Mrs. H. J. W illiam s 2nd, Mrs. S. G. Smith. W aist 1st, Airs. Joel H ubbard. Baby cap 1st, Zelia Jones 2nd, Miss Odell W oolridge. k a rd lace 1st, Mrs. W. T. Cole m an 2nd, Mrs. Jack Caldwell. Baby dress 1st, Geroy M arks 2nd, Mrs. W innie P uckett. B. Gayette 1st, W. C. T. U. Scarf 1st, Mrs. B. E. Caldwell, sw eater 1st, Mrs. W. S. W oolridge. Gace 1st, Mrs. H. J. W illiam s 2nd, Mrs. E. A. H arvey. Cro. Gace 1st, Alrs. B. E. Caldwell 2nd, Airs. B. E. Caldwell. Drawn W ork 1st, Airs. H. J. W il- liams 2nd, Miss Gucyi Smith. . H at 1st, Mrs. G. P. Jennings 2nd, Mrs. B. E. Caldwell. Quilt 1st, Mrs. F ran k H anenkrat ,nd, Mr. B. E. Eight. Sofa Pillow 1st, Mrs. G. O. Gordon 2nd, Mrs. B. E. Eight. H andkerchief 1st, Mrs. G. P. Je n  nings 2nd, Airs. C. E. Carson. Art 1st, Mrs. F ran k H anenkrat. R ag Rug 1st, Mrs. F ran k H anen krat 2nd, Mrs. G. S. Turns. Tobacco. M ahogany- w rapper 1st, S tratton tiros. 2nd, Stratton Bros. Black w rapper 1st, Milton Isabel 2nd and 2rd, J . K. Moore. Filler 1st, S tratton Bros. 2nd S tratto n Bros, 3rd, J. W. C arter. Shipping 1st, T. K. M oors 2nd S tra tto n Bros. 3rd, S tratton Bros. B right 1st, J. N. W oolridge. Flow ers. Cut rose1st, Mrs. S. J. Jennings 2nd, Mrs. W. G. Brown. 6 G eranium s 1st, Airs. G. E. Sm ith 2nd, Mrs. Gottie Bledsoe. Ferns1st, Airs. J. H. Stanley 2nd, Airs. C. A. Hancock. Cosmos 1st, Mrs. T. B. Pretlow  2nd, Mrs. W innie Puckett. Begonias 1st. Mrs. S. G. Ferguson 2nd, Mrs. J. H. Stanley. Wild, 1st, Airs. W. A. Moon. Vase 1st, Mrs. S. J. Jennings 2nd, Mrs. W. P. Gills. Design 1st, Marion W agner 2nd, Francis W agner. Individual farm exhibit, 1, F ran k H anenkrat 2, Al. C. Sm ith 3 E. G. Upton. F arm Products W heat, T, E lm er Sm ith 2, W. A. Moon 3, O. G. Scheffler. Spring oats, 1, F ran k H anenkrat 2, O. G. Scheffler. W inter oats,  1, Birge Moore 2, H erbert Upton 3, AI. C. Caldwell. Rye, 1, M. CJ Caldwell 2, J. H. T ur ner 3, G. Carter. Butterbeans, 1, Miss E. V. Coleman 2, Airs. T. H. Inge 3. Mrs. S. G. Smith. Gima beans, 1, Frances Sm ith 2, F rank H anenkrat 3, Airs. G. E. Smith. Black eye peas, 1, O. G. Scheffler 2, J. A. Steppe. Alixed peas, 1, J. W . Scruggs 2, W ilson Hix 3, W ilson Hix. Soy beans, 1, O. G. Scheffler 2, R. C. W agner 3, A. C. W agner. Navy beans, 1, Mrs. J. A. S tratton O. G. Scheffler 3, Berge Moore. Turnips, 1, Clyde OB rien 2, Mrs. A. D. C hristian 3, H. C. W heeler. Beets, 1, R. C. W agner 2, Wl D. Hix. Irish potatoes, 1, S tratton Bros. 2, Jim Page 3, W illie Morris. Sweet potatoes, 1, S. G. Sm ith 2, W. A. Moore 3, C. W. Smith. Onions, 1, Pleas Patterson 2, Francis Gordon 3, E. C arter. Corn Booner-county, 1, Thom as Babcock 2, B. G. Anderson 3, T. Babcock. Single ear, 1, Dr. D. N. Twym an 2, E lm er Sm ith 3, J. C. Moore. Any variety, 1, Berge Moore 2, W illie Gilliam  3, W. W. H arris. Yellow, 1, J. A. Steppe 2, S. G. Smith 3, R. C. W agner. Caseys, 1, ----------  2, W . A. Moon 3, G. Carter. W aterm elon, 1, I. E. Smith, Jr. 2, Mrs. G. E. Sm ith 3, J. W. Childers. Pum pkin, 1, G. E. Smith, Jr. 2, Holmsey Sm ith 3, Airs. S. G. Smith. Peanuts, 1, W. C. Barlow 2, E. G, Smith. Clover hay, 1 , ----------  2, G. P. Je n  nings. Bean hay, 1, R. C. Wlagner 2, R. C, W agner. Oats, 1, Jam es Stevenson 2, L. E, Smith, Jr. Stalk cane, 1, Joel Guills 2, J. H. W alker. Broom, 1, J. W . Caldwell 2, S. G. Smith. Stalk corn, 1, F ran k H anenkrat 2, Corn Clüb 3, Stratton Bros. G arden collection, 1. R. C. W agner Mrs. L. S. Smith 3, F ran k H anen k rat 4, E lm er Smith. HORSES Class 1 Thoroughbred, brood m are, 1, H. D. Flood 2, H. D. Flood. F our year old thoroughbred, 1, M. Guill 2, C. T. Moses. Three year old thoroughbred, 1, H. D. Flood 2, R. H. Browning. Two year old thoroughbred, 1. C. B. W right 2, H. D. Flood. Class a Standard bred three year old, 1, W. B. Caldwell 2, H. D. Flood 3, S. G. Smith. Standard bred two year old, 1, W. Caldwell. W eanling colt, 1, R. R. Davis. Class 3 Coachers, 1, H. D. Flood 2, H. D. Flood. Class 4 Saddle horses, 1, Dr. A. N. Twy m an 2, C. A H ancock 3, E. F. Cov ington. Special riding classMiss M argaret H ancock 1 Miss Repass 2 Aliss Van V olkenburg 3."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Carson 2nd, E dith <mark>Harwood</mark>. Collar 1st, Mrs. H. <mark>J</mark>. <mark>W</mark> illiam s 2nd, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Carson 2nd, E dith <mark>Harwood</mark>. Collar 1st, Mrs. H. <mark>J</mark>. <mark>W</mark> illiam s 2nd, Mrs."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.5, 350.54, 1972.09, 957.18], "bbox_id": "ab45209842", "file": "AppomattoxNewspapers_1939-1943a_0509.pdf", "page": 1, "text": "Frank Dresser Jr. and Edward Scott Cates spent several days this week in the home of Dr and Mrs. Foscue, of Lawrence ville. Miss Henreitta Roberts, of Nor folk, arrived Wednesday in Appo mattox and she will re nine her place on the local school faculty next week. Mrs. R. F. B. Steele and child ren have returned to their home in Petersburg after visiting in tie Burke home several days. John .T. Hunter suffered the loss of a barn full of tobacco, by fire Sunday.  Mr. and Mrs. Franklin Marshall and family will move to South Bos ton September 8, where Mr. Mar shall is stationed with the Standard Oil Co. Mr. and Mrs. T. B. Collins will occupy their home. Mrs. H. P. Davis is spending this week in Richmond. Mr. and Mrs. A. R. Harwood, Miss Louise Gills and J. W. Caw- f.iorn attended the Appomattox As sociation Sunday School convention at the Spring Creek Baptist church on Sunday. This old church was founded in 1823. Misses Virginia Christian and Josephine Jenkins left Monday for Charlottesville, where they will teach this session. Mrs. Helene Welch is spending this week at Roanoke and Bedford. Mr. and Mrs. Ted Gills and daugh ter have returned to their home in Bluefield after a visit with relatives ,n Appomaattox. Mrs. Louella Morris is visiting .ier sister, Mrs. Ida Morris at her aome near Vera. Mr. and Mrs. Johq L. Harrison .ill leave Saturday for Tifton Ga., .here Hr. Harrison will be staton- id with the Soil Conservation Ser vice. Mr. Harrison has done valuable work with the Soil Conservation Service in Appomattox County for the past several years and has been active in civic affairs. Mrs. Harri son has been a popular employee at the Baifk of Appomattox. Mrs. G. F. Abbitt Jr. and daugh ter, Peyton, will return tonight from New York."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "and Mrs. A. R. <mark>Harwood</mark>, Miss Louise Gills and <mark>J</mark>. <mark>W</mark>. Caw- f.iorn attended the"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "and Mrs. A. R. <mark>Harwood</mark>, Miss Louise Gills and <mark>J</mark>. <mark>W</mark>. Caw- f.iorn attended the"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [981.51, 686.62, 1129.17, 959.86], "bbox_id": "e40062360d", "file": "AppomattoxNewspapers_1971-1973a_0167.pdf", "page": 1, "text": "family of Appomattox M r. and M rs. Johnnie Harris of Dillwyn. Sunday supper guests were M r. and M rs. Harwood Cary and M rs. J . W. Jennings of Bethle hem. M r. and M rs. T . C . Beasley of Roanoke spent the holidays with his parents M r. and M rs. K . M . Beasley, Sr. and her parents, M r. and M rs. Kellly Branch at Buckingham. Saturday supper guests of M r. and M rs. R . L . Harris were M r. and M rs. Flood Harris of Green Bay. Saturday visitors in the home of M r. and M rs. Kemper Beas ley, Sr. were M r. and M rs. Kelly Branch and family of Buckingham M rs. Gil Price and David Ray of K e y s v i l l e  M rs. Ralph Repass of Appoma ttox, Va. M r. and M rs. K . M. Beasley, J r . and Katherine Ellen visited"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "r. and M rs. <mark>Harwood</mark> Cary and M rs. <mark>J</mark> . <mark>W</mark>. Jennings of Bethle hem."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "r. and M rs. <mark>Harwood</mark> Cary and M rs. <mark>J</mark> . <mark>W</mark>. Jennings of Bethle hem."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.07, 1017.98, 2090.89, 1131.18], "bbox_id": "4bbf84feaf", "file": "AppomattoxNewspapers_1943-1947a_0462.pdf", "page": 1, "text": "At the same meeting the follow ing were elected as delegates to attend the Department of Virginia Convention to be held in Richmond August J.8, 19, 20 and 21 David T. Robertson, C. K. Hunter, W. W. Scott, Joel W. Flood, E. D. Tegethoff, C. A. Agee and George Wooldridge. Also as alternates- Hugh Brown, Paul S. Drinkard, W. A. Coleman, A. R. Harwood, J r , and James -Otis Carter."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "Brown, Paul S. Drinkard, <mark>W</mark>. A. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark> r , and James -Otis"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "Brown, Paul S. Drinkard, <mark>W</mark>. A. Coleman, A. R. <mark>Harwood</mark>, <mark>J</mark> r , and James -Otis"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1770.9, 1033.92, 1939.95, 1084.45], "bbox_id": "434a9cba92", "file": "AppomattoxNewspapers_1960-1962b_0056.pdf", "page": 1, "text": "A. R. Harwood, Jr., chairman W .W . Burke, J. iS. Grinels, T. D, Evans. Photography - J. R. Redding, chairman.."}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "W", "J", "J"], "snippet": "A. R. <mark>Harwood</mark>, Jr., chairman <mark>W</mark> .<mark>W</mark> . Burke, <mark>J</mark>. iS. Grinels, T. D, Evans. Photography - <mark>J</mark>. R. Redding, chairman.."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "W", "J", "J"], "snippet": "A. R. <mark>Harwood</mark>, Jr., chairman <mark>W</mark> .<mark>W</mark> . Burke, <mark>J</mark>. iS. Grinels, T. D, Evans. Photography - <mark>J</mark>. R. Redding, chairman.."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1381.45, 1643.32, 1532.65, 1663.96], "bbox_id": "5b4b5a13df", "file": "AppomattoxNewspapers_1918-1922a_0064.pdf", "page": 1, "text": ". F abmeks T ob . W. H. Co j A. fl, Harwood, Sea-Tress. 9 31"}, "highlight": {"text": {"matched_tokens": ["W", "j", "Harwood"], "snippet": ". F abmeks T ob . <mark>W</mark>. H. Co <mark>j</mark> A. fl, <mark>Harwood</mark>, Sea-Tress. 9 31"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "j", "Harwood"], "snippet": ". F abmeks T ob . <mark>W</mark>. H. Co <mark>j</mark> A. fl, <mark>Harwood</mark>, Sea-Tress. 9 31"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1076.65, 814.54, 1241.15, 1668.17], "bbox_id": "b3ede67a55", "file": "AppomattoxNewspapers_1952-1954a_0022.pdf", "page": 1, "text": "W. M. Abbitt George Abbitt, Jr. J. W. Conner D. A. Conner G. B. Buchanan Mrs. Calvin Robinson P. Brent Stratton Chas. T. Moses C. W. Smith J. H. OBrien Caroline M. Smith David T. Robertson H. Y. Spencer Spencers Drug Store Fred C. Smith Moses Motor Co., T. W. Moses A. G. Gaines B. C. Rogers S. C. Arrington Bobs Cash Store, R. B. Haley, Jr. C. Lewis McDearmon, Appomattox Oil Co. W ootton Milling Co., A. W. Wootton C. S. Jenkins J. A. Burke R. L. Burke Wm. W. Burke F, J. Smith A. R. Harwood, Jr. C. V. Mitchell I- T. Almond Chas. F. James J. R. Hamilton W. R. Brightwell J. E. Tolley J T. Guill Jessalyn Drinkard T. Hunter Dickerson William A. Hunter R- B. Boney Thomas T. M artin G. Dudley w. C. Ould Charles D. McCorimck M r. E tM l . McCormick Charlie H. Goff Mrs. Elizabeth W heeler Malcolm A. Booker Mrs. Malcolm Booker Mrs. Curry Moore I N. Phelps Hunter Lumber Co., C. K. Hunter T. M. Trent C. C. Poe J. C. Caldwell Jacob Lew Grover E. Smith W ilkes Jewlers John S. G rinds"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "R. L. Burke Wm. <mark>W</mark>. Burke F, <mark>J</mark>. Smith A. R. <mark>Harwood</mark>, Jr. C. V. Mitchell"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "R. L. Burke Wm. <mark>W</mark>. Burke F, <mark>J</mark>. Smith A. R. <mark>Harwood</mark>, Jr. C. V. Mitchell"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1112.17, 694.48, 1275.96, 1640.99], "bbox_id": "76db1bfbae", "file": "AppomattoxNewspapers_1952-1954a_0030.pdf", "page": 1, "text": "W. M. Abbitt George Abbitt, Jr. J. W. Conner D. A. Conner G. B. Buchanan Mrs. Calvin Robinson P. Brent Stratton Chas. T. Moses C. W. Smith J. H. OBrien Caroline M. Smith David T. Robertson H. Y. Spencer Spencers Drug Store Fred C. Smith loses motor Co., T. W. Moses A. G. Gaines B. C. Rogers S. C. Arrington R a L. p ..L s v-caoi. store, R. B. Haley, Jr. C. Lewis McDearmon, Appomattox Oil Co. Wootton Milling Co., A. W. Wootton C. S. Jenkins J. A. Burke R. L. Burke Wm. W. Burke F. J. Smith A. R. Harwood, Jr. C V. Mitchell J. T. Almond Chas. F. James J. R. Hamilton W. R. Brightwell J. E. Tolley J. T. Guill Jessalyn Drinkard T. Hunter Dickerson William A. Hunter R. B. Boney Thomas T. Martin C. Dudley W. C. Ould Charles D. McCorimck Mrs. Ethel L. McCormick Charlie H. Goff Mrs. Elizabeth Wheeler Malcolm A. Booker Mrs. Malcolm Booker Mrs. Curry Moore J N. Phelps Hunter Lumber Co., C. K. Hunter T. M. Trent C. C. Poe L C. Caldwell Jacob Lewis Grover E. Smith Wilkes Jewlers John S. Grinels Charles R. Thomas Appomattox Garment Co., Inc. Englander, Pres. A. Herncall R Rutledge R. E. Wilbun C. Dresser"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "R. L. Burke Wm. <mark>W</mark>. Burke F. <mark>J</mark>. Smith A. R. <mark>Harwood</mark>, Jr. C V. Mitchell"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "R. L. Burke Wm. <mark>W</mark>. Burke F. <mark>J</mark>. Smith A. R. <mark>Harwood</mark>, Jr. C V. Mitchell"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.28, 1366.64, 1797.82, 1606.83], "bbox_id": "3ea153b88c", "file": "AppomattoxNewspapers_1918-1922a_0164.pdf", "page": 1, "text": "Violation of Liquor Law udge Frank Obristian held I irt here for Judge ilundly  iterday, Judge Hundley be  engaged in tbe trial of a 11 case at Farmville. The following grand jurors re sent to their room W.  Brown, JoelT. Cawthorn, J. Ferguson, B L Wheeler, A . ! Harwood, M. C. Hmitb, C. j Drinkard, W. A Narh and i W. Beale, and renrned five lictments for violations of   prohibition laws. The indicted express them- ves as being greatly sur- eed, that any evidence  jula be presented which j uld make them even appear j violators of the law, aud i U show tbe court and countv June lltb whether they are ilty or not."}, "highlight": {"text": {"matched_tokens": ["Harwood", "j", "W"], "snippet": "B L Wheeler, A . ! <mark>Harwood</mark>, M. C. Hmitb, C. <mark>j</mark> Drinkard, <mark>W</mark>. A Narh and i"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "j", "W"], "snippet": "B L Wheeler, A . ! <mark>Harwood</mark>, M. C. Hmitb, C. <mark>j</mark> Drinkard, <mark>W</mark>. A Narh and i"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.08, 745.71, 2078.2, 1072.51], "bbox_id": "c4f16a171e", "file": "AppomattoxNewspapers_1915-1918a_0078.pdf", "page": 1, "text": "tt  i tiKiavTd 8 Òn?pptÌ-1 hunting trip to Buckingham. Mr. Bryant Ferguson, who e sides near Vei million, died this __ uiorning. He was about 65 yrs Cornelia Gils, Annie Purdum, of age and had been ill for some jflb BaLcock, Lucile OBrien, t me. -  Gladys Agee, Kathleen Morgan ________ Little- Edward Galliab, while I Nettie Moses, Mary Tayor I 0rganiztiou until 1891, when playing on a pile of lumber last ! dilla, Jamsie Ferguson. the resigned and retired from Friday, caught hiB foot and broke I Six grade Clemmie Gun er,  acjye business. Lee Giles, Angus Feen, Regi ma 1 Stanley. Fifth gradeWilliam Burke, Elmer Smith. Boscoe Burkey, Avis Brow n,. Evelyn Brown, Noia Burkey j Vera Morris, Ruby Walton. Fourth gradeGeòrgie Inge, Jude Hundley held bis regolar I John C aroli Stanly, Charles rm of the Circuit Court here last Robinson, Orote D rinkard... . gerved bu . . sheriff d . m . worn, po.oaice J week. Very little court work was j anet Austin, Julia F e r g u s o n , ! .   that  pacit   sheriff-jotmG.Mtuer, poBwutoej disposed of. A few chancery r-1 Mary Rucker. Bessie Harwood, I tbirty-seven years  He w couuty-w. J. Hutorn. poBtomeejders and decrees were entered. Nannie Carter, Esther 8cheff0 iginally amemberof Marshall m -G . M. Bosera, posfoinee His Honor, George J. Hundley Her. Myrtle Smith. lodge o f,Masons, leaving that ey for tae commonwealth-. w .hHg been de8lgnated by the Gover Third grade-L yle M c D e a r - 1 at tbR time of tbèo ani. noi to nold Court for Judge West. I man, Arthur Robertson, Oto Our Judge will have a t at of thelGodsey, Luther Godsey, Lewis real Hopewell side of the docket. I McDearmon, Nettie Harvey,"}, "highlight": {"text": {"matched_tokens": ["Harwood", "w", "J"], "snippet": "r-1 Mary Rucker. Bessie <mark>Harwood</mark>, I tbirty-seven years  He <mark>w</mark> couuty-w. <mark>J</mark>. Hutorn. poBtomeejders and decrees"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "w", "J"], "snippet": "r-1 Mary Rucker. Bessie <mark>Harwood</mark>, I tbirty-seven years  He <mark>w</mark> couuty-w. <mark>J</mark>. Hutorn. poBtomeejders and decrees"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1638.94, 1117.71, 1804.45, 1520.23], "bbox_id": "2f0690d40b", "file": "AppomattoxNewspapers_1926-1933a_0145.pdf", "page": 1, "text": "The funeral of Mrs. Fannie Willie Caldwell took place here from Memorial Methodist Church of which she was an active mem ber Friday. The services were conducted by her pastor. Rev. D. G. Trent, assisted by Rev. W. M. Thompson, and Rev. R. E. Redding. The active pallbearers were J. E. Dinwiddie, A. R Harwood, R. W. Burkey, C. T. Moses, H. W. McKinney, John E. Sears, H. M. Burge and Dr D. N. Twy- man. Honorary pallbearers were C. S. McDearmon, L- Crawley, C. F. James, W. W. Scott, Dr. D. A. Christian, J. W. Cawthon, Jr., Dr. L. L. Gayle and Ken neth Moore.  There were many floral -de signs and a large number of flower bearers. The interment took place in the private lot in Liberty cemetery. Professional Cards l.USLIE F. FERGUSON Attorney et Lw Fl i and Life Insurance Azent Appomattox, Va. CLASSIFIED ADS"}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "The active pallbearers were <mark>J</mark>. E. Dinwiddie, A. R <mark>Harwood</mark>, R. <mark>W</mark>. Burkey, C. T. Moses,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "The active pallbearers were <mark>J</mark>. E. Dinwiddie, A. R <mark>Harwood</mark>, R. <mark>W</mark>. Burkey, C. T. Moses,"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.05, 730.75, 1871.85, 1438.29], "bbox_id": "32b15557a8", "file": "AppomattoxNewspapers_1908-1909a_0305.pdf", "page": 1, "text": "Sunday Service 930 a. m Sunday School, asses for all ages, il a. m. Morning Worship, istalation of Sunday School officers and teachers. Ordi nation of Deacons. Observ ance of The Lords Supper. 7 p. m. The B. Y. P, U. will meet, These are the training services of the chlurch. There s room for more. 8 p. m. Evening Worship of Miss Mary Woodson Sunday I with sermon by the pastor, afternoon. - Subject The. Plan of Salva- The remains of Mr. Mose Jtion in a Nut Shell. An evange- Hunter were laid to rest in the  Mstic, soul-saving message. Reedy Springs church ceme tery Tuesday afternoon. Mr. Liberty I welcome. jon alHsit in Richmond re- Huntor was reared in tins Fas on a visit m ivichhwuu lumed hurriedly to his bed side. Miss Lucy Evans, of Char lottesville and Gallie Smith bid Thelbert Trent, of North Jarden, spent Sunday at the lome of C. W. Smith. Mesdames A. R. Harwood and J. E. Dinwiddie will bt joint hostesses at the Harwooo lome, of W. G. T. U. monthly  meeting fiday afternoon , ai oclock. The White Front chain store jis in operation at Appomattox jwith Kennayd Gills in charge Iso when yen comb to town Idont fail to visit southside of Irailroad. Dr. Christian prepared for Jthe mud roads by adding high Lvheels to his Chevrolet, which Stakes him -to all parts of the fcounty over all sorts of mud roads. The Wagers Desk Factory aas leased the two-story brick building of E. T. Price, South- jaide of railroad and the build- ng w hAing conditioned, and xachinery being brought in etivity will he"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "the lome of C. <mark>W</mark>. Smith. Mesdames A. R. <mark>Harwood</mark> and <mark>J</mark>. E. Dinwiddie will bt"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "the lome of C. <mark>W</mark>. Smith. Mesdames A. R. <mark>Harwood</mark> and <mark>J</mark>. E. Dinwiddie will bt"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2048.38, 1172.88, 2215.17, 1281.03], "bbox_id": "021959e3b3", "file": "AppomattoxNewspapers_1947-1949a_0244.pdf", "page": 1, "text": "Reinterment services for Pfc Thomas Roy H a ncock, United States Marine Corps, were conduct ed at the grave side in the Drink ard family cemetery, Tuesday at 3 P. M. The Rev. John Leighner, pas tor of New Hope Baptist Church, officiated. Pallbeaarers were R. . Burke, Sr., C. T. Moses, Sr., A. R. Harwood, Billie Ferguson, Edwin Moore and J. W. Cawthon."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "Moses, Sr., A. R. <mark>Harwood</mark>, Billie Ferguson, Edwin Moore and <mark>J</mark>. <mark>W</mark>. Cawthon."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "Moses, Sr., A. R. <mark>Harwood</mark>, Billie Ferguson, Edwin Moore and <mark>J</mark>. <mark>W</mark>. Cawthon."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1369.85, 895.1, 1551.93, 1434.16], "bbox_id": "76df7be0f9", "file": "AppomattoxNewspapers_1926-1933a_0305.pdf", "page": 1, "text": "Mrs. T. H. Hancock has re burned to Lynchburg, after jSipending several days with relatives here. Robert Gills had a fall on the Ice Thursday and broke his houlder. His mother who was on a visit in Richmond re turned hurriedly to his bed side. Miss Lucy Evans, of Ghar lottesville, and Gallie Smith fend Thelbert Trent, of North Garden, spent Sunday at the lome of C. W. Smith. Mesdames A. R. Harwood fend J. E. Dinwiddie will be point hostesses at the Harwooa liome, of W. C. T. U. monthly meeting Friday afternoon . ai 3 oclock. The White Front chain store is in operation at Appomattox with Kennard Gills in charge. So when you come to town dont fail to visit southside of railroad. Dr. Christian prepared for the mud roads by adding high wheels to his Chevrolet, which takes him to all parts of the S"}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "the lome of C. <mark>W</mark>. Smith. Mesdames A. R. <mark>Harwood</mark> fend <mark>J</mark>. E. Dinwiddie will be"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "the lome of C. <mark>W</mark>. Smith. Mesdames A. R. <mark>Harwood</mark> fend <mark>J</mark>. E. Dinwiddie will be"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1700.35, 1559.18, 1868.09, 1791.17], "bbox_id": "7205504510", "file": "AppomattoxNewspapers_1954-1955a_0238.pdf", "page": 1, "text": "Mr. and Mrs. K. E. Coleman en tertained with a party in honor of the sixth birthday of their son, Ken neth Howell last evening at their home. A green and whie color scheme was used attractively throughout the occasion. A birthday cake with six lighted candles was used as a centerpiece on the dining room table, where the guests were served. Among those present in addition to the honoree and his parents were Mr. and Mrs. Rlph Coleman, Mr. and Mrs. Martin Coleman, Brenda and Bruce Mr. and Mrs. Willie Ray Martin, and Alice Rae Mr. and Mrs. P. J. Reynolds, Leon and Law rence Mrs. C. H. Robinson, Mrs. G. L. Doss, Mrs. H. G. Johnson, Mrs. R. J. Coleman, Harwood Cole man, Mrs. S. W. Inge, Sandra Kay and Dwight."}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "G. Johnson, Mrs. R. <mark>J</mark>. Coleman, <mark>Harwood</mark> Cole man, Mrs. S. <mark>W</mark>. Inge, Sandra Kay and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "G. Johnson, Mrs. R. <mark>J</mark>. Coleman, <mark>Harwood</mark> Cole man, Mrs. S. <mark>W</mark>. Inge, Sandra Kay and"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.36, 1152.28, 1742.27, 1388.67], "bbox_id": "31a2e4627a", "file": "AppomattoxNewspapers_1908-1909a_0145.pdf", "page": 1, "text": "M. Thompson, Redding. The active pallbearers were J. E. Dinwiddie, A. R- Harwood, R. W. Burkey, C. T. Moses, H. W. McKinney, John E. -Sears, I H. M. Burge and Dr D. N. Twy- man. Honorary pallbearers were! C. S. McDearmon, L Crawley,  C. F. James, W. W Scett, Dr. D. A, Christian, J. W. Cawthon, Jr., Dr. L. L. Gayle and Ken- neth Moore.  There were many floral -ae-1 signs and a large number of, flower bearers. The interment  took place in the private lot m  Liberty cemetery.  -P rofession al Cardfl--"}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "The active pallbearers were <mark>J</mark>. E. Dinwiddie, A. R- <mark>Harwood</mark>, R. <mark>W</mark>. Burkey, C. T. Moses,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "The active pallbearers were <mark>J</mark>. E. Dinwiddie, A. R- <mark>Harwood</mark>, R. <mark>W</mark>. Burkey, C. T. Moses,"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1160.38, 1273.97, 1318.14, 1675.71], "bbox_id": "c771aa7c87", "file": "AppomattoxNewspapers_1908-1909a_0511.pdf", "page": 1, "text": "FARMERS NATIONAL-BANK JOEL W. FLOOD L. E. SMITH W. H. LIGONSON _ WILLIAMS BROS. BANK OF APPOMATTOX APPOMATTOX HDW. CO. H. M. BURGE CO., INC. STAPLES BROS. -A. -H. CLEMENT MOSES MOTOR CO. FRANKLIN BROS. CHAS. F. JAMES DR. C. H. McCALL J. E. DINWIDDIE C. W. SMITH J. A. BURKE A. R. HARWOOD R. L. BURKE R. B. HUDGINS J. MORTON ROSSER  H. C. BABCOCK .1 W. R. REYNOLDS X _ A . T. INGE CHANDLERS BARBER SHOP"}, "highlight": {"text": {"matched_tokens": ["W", "J", "HARWOOD"], "snippet": "J. E. DINWIDDIE C. <mark>W</mark>. SMITH <mark>J</mark>. A. BURKE A. R. <mark>HARWOOD</mark> R. L. BURKE R."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "HARWOOD"], "snippet": "J. E. DINWIDDIE C. <mark>W</mark>. SMITH <mark>J</mark>. A. BURKE A. R. <mark>HARWOOD</mark> R. L. BURKE R."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1159.67, 1298.89, 1317.43, 1701.38], "bbox_id": "05c4531a92", "file": "AppomattoxNewspapers_1926-1933a_0511.pdf", "page": 1, "text": "FARMERS NATIONAL BANK JOEL W. FLOOD L. E. SMITH W. H. LIGONSON WILLIAMS BROS. BANK OF APPOMATTOX APPOMATTOX HDW. CO. H. M. BURGE CO., INC. STAPLES BROS. A. H. CLEMENT MOSES MOTOR CO. FRANKLIN BROS. CHAS. F. JAMES DR. C. H. McCALL J. E. DINWIDDIE C. W. SMITH J. A. BURKE A. R. HARWOOD R. L. BURKE R. B. HUDGINS J. MORTON ROSSER H. C. BABCQCK W. R. REYNOLDS A. T. INGE CHANDLERS BARBER SHOP"}, "highlight": {"text": {"matched_tokens": ["W", "J", "HARWOOD"], "snippet": "J. E. DINWIDDIE C. <mark>W</mark>. SMITH <mark>J</mark>. A. BURKE A. R. <mark>HARWOOD</mark> R. L. BURKE R."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "HARWOOD"], "snippet": "J. E. DINWIDDIE C. <mark>W</mark>. SMITH <mark>J</mark>. A. BURKE A. R. <mark>HARWOOD</mark> R. L. BURKE R."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1913.75, 855.91, 2183.09, 1133.0], "bbox_id": "efbdf4201a", "file": "AppomattoxNewspapers_1915-1918a_0074.pdf", "page": 1, "text": ". . . , , __ , ___ n i i i t . m I VTU be at Appomattox tbe first two eon bo triod bofore Jusfcico jiiliftm Montive wontSi on next Saturday morning at H ix b u rg . Thanksgiving has oome and gone and the doings of the day has gone down in history and one thing we should be thank ful for is that we live in a land of peace and plenty. Rev. Mr. Sam Harwood and j wife of Jarrett Va. has been spending a few days with his mother Mrs. JohnW. Harwood. Mr. R. W. Bristow was . at j Drakes Branch Monday selling  tobacco.  Mr. W H. Swan was m Appomattox on Tuesday selling tobacco. Every one speaks as j being satisfied with the prices. Mr. John Harwood tis in Farmville this week selling tobacco."}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "j"], "snippet": "his mother Mrs. JohnW. <mark>Harwood</mark>. Mr. R. <mark>W</mark>. Bristow was . at <mark>j</mark> Drakes Branch Monday selling"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "j"], "snippet": "his mother Mrs. JohnW. <mark>Harwood</mark>. Mr. R. <mark>W</mark>. Bristow was . at <mark>j</mark> Drakes Branch Monday selling"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.1, 956.39, 1821.96, 1175.08], "bbox_id": "8eef2a8003", "file": "AppomattoxNewspapers_1926-1933a_0332.pdf", "page": 1, "text": "well, Earle Patteson, Helen Dickerson, Ocie Jones, Elaine McDearmon, and Bessie V. Harwood Mesdames. C. W. Potts, C. F. James, J. L. Bur- key, S. W. Sears and N. A. Wagers, Messrs. Paul Drink- ard, Ned Hancock, Reggie Stanley, John C. Stanley, W. T. Steele, Harold Spencer, J. W. Flood, John C. Caldwell, Burke Steele, R. K. Lawson, N. A. Wagers, C. F. James, C. W. Potts, S. W. Sears, J. L. Burkey and C. S. McDearmon.  ------------- o --------------- B. F . C olem an"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "McDearmon, and Bessie V. <mark>Harwood</mark> Mesdames. C. <mark>W</mark>. Potts, C. F. James, <mark>J</mark>. L. Bur- key, S."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "McDearmon, and Bessie V. <mark>Harwood</mark> Mesdames. C. <mark>W</mark>. Potts, C. F. James, <mark>J</mark>. L. Bur- key, S."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.83, 1202.61, 2288.57, 1500.64], "bbox_id": "6b6d6d06a1", "file": "AppomattoxNewspapers_1908-1909a_0557.pdf", "page": 1, "text": "well Discussioon Leader J. G. Bruce.  . _ Round Table Discussion on County Problems and Work for the Coming Year. The members oi the county advisory board ares L C. Abbitt, S. E. Anderson, B. G. Anderson, R. L. Burke, John E. Burnett, Owen Oarion, Cary Carey Jr., W. T. Chil dress, J. O. Davidson, D. W Dinkins, B. C. Drinkard, M. I Garrett, R. B. Hudgins, A, R. Harwood, Tom Harvey W. C, Harvey, Layton Hatcher, J. R. Horsley, Wilson Hix, L. N. Lig .n, W, A.- Moon, Emmett- Mar tin, Clarence Moore, R. W. Morris, Herman Moore. A. D. Marshall, W. T. Nash, R. E. OBrien, Welter OBrien, j. P. Paulett, Frank Raneon, d P ley Ranson, Jim R   P P n, Calvin R o b in  aig iiil, eZ nolds, B l a  p P   , E. P. S e a ra  afH  C o tt, .John Tay W  f iP f h Wright, R. W. WH-"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "B. Hudgins, A, R. <mark>Harwood</mark>, Tom Harvey <mark>W</mark>. C, Harvey, Layton Hatcher, <mark>J</mark>. R. Horsley, Wilson Hix,"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "B. Hudgins, A, R. <mark>Harwood</mark>, Tom Harvey <mark>W</mark>. C, Harvey, Layton Hatcher, <mark>J</mark>. R. Horsley, Wilson Hix,"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [497.05, 655.66, 814.13, 809.92], "bbox_id": "f6db20e5cd", "file": "AppomattoxNewspapers_1918-1922a_0616.pdf", "page": 1, "text": "Total ------------------------------------------------------------------------- .599.00 Scalps C. W. Smith, Clerk, with which to pay for bounties on scalps _____ .200.00 Stock and Fowls Killed by Dogs and Game Warden Jas. T. Dinkins, one sheep ____________________________________ p 10.00 E. M. Drinkard, executing warrants and killing dogs ____________ 8.00 T. W. Moss, issuing and trying warrants for violating dog laws _____ 27.00 R. H. Browning, executing warrants dismissed __________________ 7.00 Brown-Morrison Co., dog license receipt cards ___________________ .92 E. R. Abbitt, listing dogs __________________ _ __________________ 152.55 Mrs. J. H. Robertson, two turkeys killed ________________________ 12.00 Lytton Harvey, two turkeys killed ______________ _ ______________ 8.00 Jno. R. Webb, one sheep killed _______________________________ 6.00 W. J. Trent, lamb killed_____________________________________ 7.50 A. R. Harwood, one cow bitten by mad dog___________1 __________ 25.00 R. M. Martin, one turkey ________ _____________________________ 4.00 J. L. Lewis, one tu rk ey ______________ _____________ _________ 4.00"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "one sheep killed _______________________________ 6.00 <mark>W</mark>. <mark>J</mark>. Trent, lamb killed_____________________________________ 7.50 A. R. <mark>Harwood</mark>, one cow bitten by"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "one sheep killed _______________________________ 6.00 <mark>W</mark>. <mark>J</mark>. Trent, lamb killed_____________________________________ 7.50 A. R. <mark>Harwood</mark>, one cow bitten by"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.88, 1550.4, 2178.89, 1797.04], "bbox_id": "179f0864a9", "file": "TimesVirginian_1978_0080.pdf", "page": 1, "text": "The Annual M eeting of Sharehqktora of the Farmers N ation Bank was held Tuesday. February 21,1978 at 230 p.m. This number oi Directors to be elected was set at 14 members to serve for a one y e term. Elected as Directora were W. -M. Abbit, E, W. Corson, John C. Cole, J. B. D rinkard, Jr., T. DeW itt Evans, John 8. Grinels, Alfred R. Harwood. Jr. Willi A Hunter. J. E. Jamerson, W. E. 1 Jamerson, J. A. Mathews, C.T, Moses, Jr James Í. Pugh, Jr.  and James A. Smith.  Officers elected for  on y e term at the Farmers National Bank w ire Alfred R. Harwood, Jr., Chairman of the Board J. E. Jam erson,"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W", "J"], "snippet": "8. Grinels, Alfred R. <mark>Harwood</mark>. Jr. Willi A Hunter. <mark>J</mark>. E. Jamerson, <mark>W</mark>. E. 1 Jamerson, <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W", "J"], "snippet": "8. Grinels, Alfred R. <mark>Harwood</mark>. Jr. Willi A Hunter. <mark>J</mark>. E. Jamerson, <mark>W</mark>. E. 1 Jamerson, <mark>J</mark>."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.9, 1133.88, 564.49, 1192.63], "bbox_id": "48ffd0d46e", "file": "AppomattoxNewspapers_1943-1947a_0271.pdf", "page": 1, "text": "Sydney Brockwell, of Newport News spent the week-end in the home of W. A. Swan. Mr. and Mrs. J. P. Harwood, of Richmond spent Tuesday after noon in the home of Mrs. J.T.Hix."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "in the home of <mark>W</mark>. A. Swan. Mr. and Mrs. <mark>J</mark>. P. <mark>Harwood</mark>, of Richmond spent Tuesday"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "in the home of <mark>W</mark>. A. Swan. Mr. and Mrs. <mark>J</mark>. P. <mark>Harwood</mark>, of Richmond spent Tuesday"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.25, 765.5, 2520.06, 1285.99], "bbox_id": "71e8b50a6a", "file": "AppomattoxNewspapers_1939-1943a_0593.pdf", "page": 1, "text": "plo. Various articles will be put up at auction, and you get the article by buying a W ar Bond of the amount of your bid. Thus, if you are willing to buy a 500 War Bond you bid that much for any article put up at the. auction. In Lynch burg at a xecent W ar Bond Auction the first item auctioned brought a bid of 25,000. A War Bond booth will be available on the court house -lawn for the sale of bonds. Residences and business places on the line of parade between the high school ground to the court house by way of Main Street, are asked to display American flags Saturday morning. Many business places will probably close during the auction, although it is not insisted that all stores do so. Among the committees working on details of the program, are. Traffic committee, W. M.. Aboitt Booth committee, C. K... Hunter Decorations committee, JV. H. Lu cado, Grover Smith, Mra. S, jL Fer guson, Mrs. G. D. Akers, My. W. T. Steele, Miss Anna Jneu, and C. L. McDearmon Publicity C. H. Robi.isop Committee to solicit articles for the auction G- B. Buchanan, C. T. Moses, J. W. Flood, J. C. Hudgins and A. R. Harwood Minute Men Captains G. F. Ab- bitt, Jr. and C. G. OBrien A committee of ladies from local banks and the post olce will assist at the bond booth. R. L. Burke will preside at the proceedings at the cqurt house and i Governor Darden will be introduced by Judge J. W. Flood. The public is requested to be present promptly for the parade and auction, as Governor Darden must journey from here To Peters burg for another meeting Saturday afternoon. In event vf rain, the present plan is to hold the program Twenty million Victory Gardens j in the court house, although it , may . . . . two million more than the goal  be shifted to the school auditoriuni. set last spring. . . . were grown this qpring. Secretary of 1 Agriculture,"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "C. T. Moses, J. <mark>W</mark>. Flood, <mark>J</mark>. C. Hudgins and A. R. <mark>Harwood</mark> Minute Men Captains G."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "C. T. Moses, J. <mark>W</mark>. Flood, <mark>J</mark>. C. Hudgins and A. R. <mark>Harwood</mark> Minute Men Captains G."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2218.82, 752.49, 2394.12, 1554.69], "bbox_id": "40fc2c06af", "file": "AppomattoxNewspapers_1936-1939a_0050.pdf", "page": 1, "text": "Next Tuesday night hat been da- signated aa the time for the Wat Banquet in Appomattox. Tuesday afternoon the Appomat box Ruritan Club will sound a church bell signal for property owaera Ut pdt out the RED. SQUILL poltpa to war on the rats.. Every, property owner is urged to cooperate, apd Pat at the poison the came night. Red Squill is not harmful to ha- mans or to household, pots,. so there need be -no fear of using .it. Complete directions for its use accompany leach package, . Tbe Bad Squill will be distributed by .ifieana of a house-to-house caa Jafoi the town by members of tho Ruritan Club. Tb.. following BurttaW. .members will call on property owners in tho area listed after their h , n n i . C. Lewis M cD earm on, Baptist church west -aidé street td B . W. Burkeys residence. Watt Abbitt, W. B.1 Reynolds residence sooth side street to Dr. D. A. Christians residence.!? Charles TM oaes, BaptSf church west to Franklins residence. J. A. Burke, B. E. Reddfhge re, idence to ErH .C aw feetoat resi dence.      - B. G. Anderson, Mrs. - Helsns Welchs both aides streetto B. O, Andersons including W.B-.Gtkylevs residence. J A. R. Harwood Jr., -from Mrs.. S . W . Sears both sides of. street to G. O. Gordon4. - -  John B Yeoman Harwoods res idence both sides o f noadjihp ceme tery to Dr. D, A . Christian. Ivy Holland, From Dr. D.N. TWy mans to E . H . .awthorns. ipcluding houses on both sides of street, Mm es Motor Co., Germent Factory aafi J. M. Rq-sere. Chas. Swing, Babcockfa! store to R. C. Moores filling stàtioq p a east side of street. Travis R. Lee, from R C Moores residence to Mrs. MoUi Moores in cluding homea around battery fac tory. i, , V. H. GiU, from Mrs. Mollis Moores to Ramseys including d homes south of Route 460 W. S. Mathews, Chat. Hanemkret to J . K . Pulliams east side road. E. L. Smith, Curtis Blackwells to Doug Watkins including David son and Robert Craig.  A R. Harwood Sr. Cleaners to Lucy Forbes, including tw ffi north of Route 400 around Mad Street. R. B. Hudgins, Lucy- Forbes down Route 24 to Burges residues as both sides of highway. J . E . Seats, from Shell filling sta tion thence to Bwgss No. 2, both sides of highway. C. S. McDearmon, from depot t Hudgins O. west side of street. Geo. 7. Abbitt Jr., dreg store via Texaco service  ta tn to Pulliam Motor Co. Dr. M. A . MacLean,. Hotel block, Fergusons, Lawsons, in d u in g all houses south of rogd to bridge this side of R.E.Reddings.. Lewis Winters, from Fankle Mc Kinneys to GuiUs on both.sides Of concrete highway. Joel Flood, from Dr. Janies to Murphys new residence on bath sides street,including homes around to Lee theatre. J. F. Blair, all homes in HUicreet."}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "Andersons including W.B-.Gtkylevs residence. <mark>J</mark> A. R. <mark>Harwood</mark> Jr., -from Mrs.. S . <mark>W</mark> . Sears both sides of."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "Andersons including W.B-.Gtkylevs residence. <mark>J</mark> A. R. <mark>Harwood</mark> Jr., -from Mrs.. S . <mark>W</mark> . Sears both sides of."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [660.65, 1339.6, 828.19, 1392.79], "bbox_id": "e7e2f86264", "file": "AppomattoxNewspapers_1939-1943a_0405.pdf", "page": 1, "text": "Mrs. Wilson Hix, M rs.J.T.H ix and families spent Tuesday in Vic toria with the Rev.and Mrs S.G. Harwood, and Thursday with Mr. and Mrs. J .W , Haden and family at Fife, Virginia."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "the Rev.and Mrs S.G. <mark>Harwood</mark>, and Thursday with Mr. and Mrs. <mark>J</mark> .<mark>W</mark> , Haden and family at"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "the Rev.and Mrs S.G. <mark>Harwood</mark>, and Thursday with Mr. and Mrs. <mark>J</mark> .<mark>W</mark> , Haden and family at"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [288.95, 625.96, 420.25, 1082.73], "bbox_id": "65e17006e6", "file": "AppomattoxNewspapers_1915-1918a_0592.pdf", "page": 1, "text": "Mrs W T Coleman... ---- ... . ... 1 00 Mrs T R Hichtirdjoo ... . ......... ... to  H Clement .......... . ............    5 00 B R A bbitt ................... . ...........  00 c w Smith ............ ....................... __ 1 00 8 L Ferguson........................... .  too H W McKinney ----- ------------ to L F Ferguson... . . .. . ._ ..... 2 09 Harold Spencer.......................... ._ 1 00 L B Smith .......... . ........................ zoo J W Ham let............................... ... 1 00 A R Harwood...................... ....... __ 1 00 W C Hubbard ........................... ... 1 00 J O OBrien ................................ ... 1 00 Jam es Meredith- ...................... ... so M C Caldwell...................... . ... 1 00 J A B u rk e .................................. ... 50 B row n Smith.......................... .... 1 00 26 Mr Bessie Jam es.......................... I 00 Rev L F Callaham .....  .......... ... i on Tunstall Morgan ...................... ... 1 00 A T In g e ................  .............. ... 2 00 Eddie Moore- ........ . ................... 60 Richard Smith- .............. - ,,r- r 60 W alter Woolridge- .....  ........... to Miss Mary Babcock- ........ _..... ... 60 Miss Ruth Moore  to Douglas Puckett... ........... 60 Deb. Babcock .......... . ........ . ... to Chas F Jam es ............................. ... to Reggie Stanley .......................... a R L Burke. ................................ ... 1 00 R FBurke ...... . . ........................ 1 00 T W Moses- ................................ ... 100 Henry Doherty ..................... . ... 25 Robert Irby .......... .. ........... ... ... 1 0 Miss Oretcben B ell.... ... to Milton Hayden .............. . 60 Mrs L A Melver....................... . ... 1 00 M P Wool folk ............. .. ........... 60 C B Davis ........... . ................ . w Lougenla P atteso n ...........  . ..... to Ruth Clement. .... . ............. . . . . be Mr  C Bledsoe ..... . ................ .... 1 00 Lieutenant A dam C Clement. .... 100 H 8 Wheeler- ............................. ... 100 J K Pulliam .......  .......... . 26 W F W right _______ __ _____ ... 26 B B Prlmm ............. ... 26 L J Morris ..... . ............................  to B W Babcock ............................. __ to Mrs. C T Moses. ....... ..... ........... 60 Mrs. D H Marshall ... ................ to J P L Fleshm an........................ 60 Elan tha D rinkard ................... ..... 1 00 Marye D rinkard ...................... ... 1 00 CL Tolley ................................... to"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "L B Smith .......... . ........................ zoo <mark>J</mark> <mark>W</mark> Ham let............................... ... 1 00 A R <mark>Harwood</mark>...................... ....... __ 1 00 <mark>W</mark> C"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "L B Smith .......... . ........................ zoo <mark>J</mark> <mark>W</mark> Ham let............................... ... 1 00 A R <mark>Harwood</mark>...................... ....... __ 1 00 <mark>W</mark> C"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [658.08, 379.97, 799.98, 601.86], "bbox_id": "921dd561eb", "file": "AppomattoxNewspapers_1971-1973a_0407.pdf", "page": 1, "text": "Mrs. Edward T. Cook, Kenneth and Randy of Prospect. Mr. and Mrs. Paul Manisand Osborn, of Powhatan, attended the wedding of Alvin Thomas and Ann Fisher in Roanoke Sat urday. Mr. and Mrs. R. L. Harris visited Mrs. J. W. Jennings in the home of Mrs. Harwood Cary at Bethelhem Monday. The Rev. and Mrs. William H. Voorhes, of Wake Forest, N.C. were callers in several homes in the community Saturday. Mr. and Mrs. Kemper Beas ley, Sr. were Saturday visitors in the home of Mr. and Mrs. Dave Amos, of Farmville. Mr. Amos is entering a Charlottes ville Hospital Wednesday for"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "L. Harris visited Mrs. <mark>J</mark>. <mark>W</mark>. Jennings in the home of Mrs. <mark>Harwood</mark> Cary at Bethelhem Monday."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "L. Harris visited Mrs. <mark>J</mark>. <mark>W</mark>. Jennings in the home of Mrs. <mark>Harwood</mark> Cary at Bethelhem Monday."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1960.06, 1235.72, 2128.91, 1266.17], "bbox_id": "35496a239e", "file": "AppomattoxNewspapers_1947-1949a_0358.pdf", "page": 1, "text": "Monday, 730 P. M.- Y. W. A. girls leading, Mrs A. R. Harwood, J?., sponsor."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "Monday, 730 P. M.- Y. <mark>W</mark>. A. girls leading, Mrs A. R. <mark>Harwood</mark>, <mark>J</mark>?., sponsor."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "Monday, 730 P. M.- Y. <mark>W</mark>. A. girls leading, Mrs A. R. <mark>Harwood</mark>, <mark>J</mark>?., sponsor."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.76, 973.6, 1815.58, 1102.7], "bbox_id": "92d2d0aa65", "file": "AppomattoxNewspapers_1908-1909a_0332.pdf", "page": 1, "text": "McDearmon, and Bessie- V. Harwood Mesdames. C. W. Potts, C. F. James, J. L. Bur- key, S. W. Sears and N. A. Wagers, Messrs. Paul Drink- ard, Ned Hancock, Reggie Stanley, John C. Stanley, W. T. Steele, Harold Spéncer, J. W. Flood, John C. Caldwell, Burke Steele,"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "McDearmon, and Bessie- V. <mark>Harwood</mark> Mesdames. C. <mark>W</mark>. Potts, C. F. James, <mark>J</mark>. L. Bur- key, S."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "McDearmon, and Bessie- V. <mark>Harwood</mark> Mesdames. C. <mark>W</mark>. Potts, C. F. James, <mark>J</mark>. L. Bur- key, S."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [274.81, 876.27, 416.65, 1417.28], "bbox_id": "64b56f609d", "file": "AppomattoxNewspapers_1915-1918a_0594.pdf", "page": 1, "text": "M lu Bula M Bui ke ....................... 1 0 Braztoo H ancock ......... . .......... . 1 00 J H Robertson . .............................. 1 00 C B Canon . ........................... .  SO W J T rent ........... .... ..................... BO C W Hancock............... ...... ... ...... 6 00 H O S m ith ........ .. ..................... ...... 1 00 S G H arvey .......... ........................... 60 L Crewley. . ................................. 100 Titos w Beasley. .... ... ...... ............ 1 00 Mrs Toney Fergoson ..................... 76 M n W T Coleman ......... ............... 1 00 Mrs T B Kicbsrdson ..................... SO A H Clement ...................................... 5 00 B B A bbitt..................... 2 00 C W Sm ith ............ 1 00 8 L Ferguson ......................... S 00 H w McKinney ...... .. B0 L P Ferguson ........ ........... ......... 2 00 Harold Spencer ........................... ... 1 00 LB Sm ith......................................... 2 00 J w H a m le t...- .......................... .. 1 00 A R Harwood .................. . .............. 1 CO W C Hubbard ................................. 1 00 J O OBrien. .... ................ 100 Jam es Meredith-............................ B0 M C Caldwell ..... . ........................... 1 00 J A B u rk e ....................................... 60 Brown A Sm ith ............................... 1 00 K C Mann ..... - .................................. 26 Mrs Bessie Jam es ........................... 100 Bev L F Callaham...... ............... 1 00 Tunstall Morgan ........................... 1 00 A T Inge .................. 2 00 Bddie Moore- ............. 60 Richard Sm ith. ............ ...... - .......... 60 Walter Woolrldge- ........................ 60 Miss Mary Babcock. ..................... 60 M ss Butb Moore ............................ 60 Douglas Puckett... ................. 60 Deb. Babcock .................................. 60 Chas F Jam es .................................. 60 Reggie Stanley ............................... 26 B L Burke-.........................................1 00 B FBurke ...... . ....... - ................. 100 T W Moses. ..................................... 1 00 Henry Doherty............................... 25 Robert Irby ..................................... 1 no Miss Gretchen Bell ........................ 60 Milton Hayden ............................... 60 Mrs L A M clver.. . .................. 100 B F Wool folk. ................................. 50 C B Davis ............................. ........... bo Lougenla Pattesou ....................... 60 Huth Clement ............................... to M n A C Bledsoe ................... 1 00 Lieutenant Adam C Clement ..... 1 00 K 8 W heeler................................... 1 00 J K Pulliam .................................... 25 W e W rig h t . ....... .......................... 26 B B Prlm m ......................... 25 L J Morris ..... . .................................. 60 B W Babcock................................... 60 Mrs. C T Moses. . ............... 60 Sirs. D H Marshall ......................... 60 J P L Fleshm an ............................. to Blantba D rinkard .............................. 1 00 Marye D rinkard .................................  00 C L Tolley......................................... 60"}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "1 00 A R <mark>Harwood</mark> .................. . .............. 1 CO <mark>W</mark> C Hubbard ................................. 1 00 <mark>J</mark> O OBrien. .... ................ 100 Jam"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "1 00 A R <mark>Harwood</mark> .................. . .............. 1 CO <mark>W</mark> C Hubbard ................................. 1 00 <mark>J</mark> O OBrien. .... ................ 100 Jam"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1608.95, 1047.87, 1775.66, 1208.36], "bbox_id": "a9b7a8cd01", "file": "AppomattoxNewspapers_1933-1936a_0516.pdf", "page": 1, "text": "L  N . Ligon, J . P. Paulett, J.B. Drinkard, S. C. Drinkard, B. G. Anderson. J . O . Carson, F O . es W. T. Nash, J . E. D.fckerson, e ! Nash, Rev. R. E. Redding, B. C. Cole, Robert Thornhill, J . R Horseley, J . C. Cole, A . G. Birds all, Mrs. J . R. Horseley, Mrs. R. H. Thornhill, Miss Eleanor Dav idson, Miss Ethel Alvis, Mrs. J. S. Hvbc, Mrs. A.R. Harwood, Mrs.. D W Dinkins, Miss Kate David- sont Mrs-l S.C . Onnkard, Mrs Owen Carson, Mrs. A.G. Birdsall. Stonewall"}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "Miss Ethel Alvis, Mrs. <mark>J</mark>. S. Hvbc, Mrs. A.R. <mark>Harwood</mark>, Mrs.. D <mark>W</mark> Dinkins, Miss Kate David-"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "Miss Ethel Alvis, Mrs. <mark>J</mark>. S. Hvbc, Mrs. A.R. <mark>Harwood</mark>, Mrs.. D <mark>W</mark> Dinkins, Miss Kate David-"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [695.5, 341.68, 862.54, 547.32], "bbox_id": "4daa1519e2", "file": "AppomattoxNewspapers_1955-1957a_0206.pdf", "page": 1, "text": "John C. Cole, Appomattox Lions Club president - elect today an nounced the appointment of 16 persons to serve on committees dur ing the 1956-57 club year. Those named are Agriculture  J. A. Smith. Attendance J. H. Lucado. Boys and Girls Work Charles R. Thomas. Chamber of Commerce W. .S Gills. Community Betterment Joel W. Flood. Convention A. R. Harwood, Jr. Finance J. A. Burke. Fund Raising D. T. Robertson. Greeter G. F. Abbitt, Jr. Health and Welfare C. T. Moses Sr. Lions Information J. S. Grinels."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "Gills. Community Betterment Joel <mark>W</mark>. Flood. Convention A. R. <mark>Harwood</mark>, Jr. Finance <mark>J</mark>. A. Burke. Fund Raising"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "Gills. Community Betterment Joel <mark>W</mark>. Flood. Convention A. R. <mark>Harwood</mark>, Jr. Finance <mark>J</mark>. A. Burke. Fund Raising"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1762.51, 938.04, 1893.08, 1132.59], "bbox_id": "3231037ff7", "file": "AppomattoxNewspapers_1943-1947a_0194.pdf", "page": 1, "text": "J. E. Sears and Co. Inc. Henry M. Beard Luther Franklin Carl Pippin T. W. Ferguson  Lawrence Almond Whitney L. Godsey Sam Almond Walter Ranson Harrjy Johnson Carl Hollingsworth Sidney A. White J-. E. Jamerson F. W Hanenkrat Alice S. Harwood L. P. Brown New Mrs. Mattie Traylor Mr.- Mrs. G F Abbitt v irginia C. Koos Liberty Chapel Ch adltl. Hixburg Community"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Hollingsworth Sidney A. White <mark>J</mark>-. E. Jamerson F. <mark>W</mark> Hanenkrat Alice S. <mark>Harwood</mark> L. P. Brown New"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Hollingsworth Sidney A. White <mark>J</mark>-. E. Jamerson F. <mark>W</mark> Hanenkrat Alice S. <mark>Harwood</mark> L. P. Brown New"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.9, 362.52, 914.57, 864.76], "bbox_id": "dde6caa528", "file": "AppomattoxNewspapers_1954-1955a_0213.pdf", "page": 1, "text": "Hixburg, Feb. 15.- Mrs. Colyer Parks is convalescing in the Lynch burg General Hospital. Mr. Witt Goins condition is a- bout the same. His visitors over the week-end were Mr. and Mrs. Harris of Lynchburg Mr. and Mrs. Jim Franklin and children, Dr. Twyman Williams, Rbert Walker Covington, and Robert Earl Pankey. Mr. and Mrs. H. E. Gilliam, of Lynchburg Mesdames H. M. Mar shall, J. K. Marshall and Alfred Harwood were recent guests in the home of Miss Maggie Hix. Mrs. W. M. Erwin was the lunch eon and dinner guest of Mesdames Alfred Harwood and J. K. Marshall on Tuesday. Major W. M. Erwin, Jr., xf Scott Air Force Base, has been notified that his tour there will be complet ed in May and that he will be re assigned, probably to a foreign country. Mr. and Mrs. S. E. Webb are the proud parents of a young son Micheál Edward. Mrs. D. T. Goin visited Mrs. Webb at the Southside Hospital on Monday evening. On Feb. 1, the house at Scot land, the ancestral home of the Joel Watkins family, of Appomat tox, burned. The plantation is now owned by Mr. E. H. Carson, but it had been in the Watkins family for at least 150 years. The home was built in 1824 by Joel Watkins, an architect, the grandfather of the Joel Watkins, Sr., of Farmville. It was an eight-room house, built of heart pine, with pine paneling chair- boards around the walls. On the plantation is a natural lake around which the foundations of Indian huts were unearthed not long aft- the War Between the States,"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "guest of Mesdames Alfred <mark>Harwood</mark> and <mark>J</mark>. K. Marshall on Tuesday. Major <mark>W</mark>. M. Erwin, Jr., xf"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "guest of Mesdames Alfred <mark>Harwood</mark> and <mark>J</mark>. K. Marshall on Tuesday. Major <mark>W</mark>. M. Erwin, Jr., xf"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [130.31, 442.18, 564.03, 604.66], "bbox_id": "1db3b6515d", "file": "TimesVirginian_1976_0076.pdf", "page": 1, "text": "Farmers National Bank Holds Annual Shareholders Meeting . . I .. , l , . i The regular annual meeting of shareholders of the Farmers National Bank was held Tuesday, Feb. 17,1976 at 230 p.m. for the purpose of electing officers and directors. Shown in the photo above are some of the members of the Board of Directors and some of the shareholders who attended the annual meeting. j Directors elected to serve until the 1977 annual meeting are W. M. Abbitt, E. W. Carson,-John C. Cole, J. B. Drinkard, Jr., T. DeWitt Evans, John S. Grinels, Alfred R. Harwood, Jr., William A. Hunter, J. E. Jamerson, W. E. Jamerson, J. A. Mathews, C. T. Moses, Jr., James J. Pugh, Jr., Roger S. Redman, and James A. Smith. Officers elected at the annual meeting were Alfred A. Harwood, Jr., Chairman of the Board J. E. Jamerson, Vice Chairman of the Board T. DeWitt Evans, President William A. Hunter, Vice President and Cashier James J. Pugh, Jr., Vice President and Branch Manager Eleanor C. Conner, Assistant Cashier Patsy S. Harvey, Assistant Cashier Loretta D. Layne, Assistant Cashier and Ellen R. Martin, Assistant Cashier."}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W", "J"], "snippet": "S. Grinels, Alfred R. <mark>Harwood</mark>, Jr., William A. Hunter, <mark>J</mark>. E. Jamerson, <mark>W</mark>. E. Jamerson, <mark>J</mark>. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W", "J"], "snippet": "S. Grinels, Alfred R. <mark>Harwood</mark>, Jr., William A. Hunter, <mark>J</mark>. E. Jamerson, <mark>W</mark>. E. Jamerson, <mark>J</mark>. A."}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [620.64, 313.41, 759.94, 1794.56], "bbox_id": "55c6b738b3", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "A. T. Coleman T. J. Conner D. W. Cawthorn James J. Case Jannie B. Caldwell Mrs. Bessie S. Christian Mrs. Nultie Cawthorn Mrs. Sallie B. Conner Helen F. Coleman Helen A. Coleman Florence W. Carson Mrs. W. L. Coleman Mildred Collier Christian Virginia Christian Mrs. Catherine C. Christian Mrs. Verna F. Conner Mrs. Cha8. F. P. Crawley Mrs. Harry Clark Mrs. Richard E. Clapp Catherine C. Carter Mrs. Madge Dudley Clark Harriett A. Chilton Mrs. Elizabeth G. Covington Mrs. E. G. Cheatham Mrs. Jemima Sue Chilton Mary C. Coleman Mrs. Mary T. Childress Mrs. M. E. Cheatham Mrs. Mary E. Cawthorne Mrs. Etta Carter Frances Mae Cralle Leonard F. Doss Walter C. Doss James R. Davis R. N. Dawson Twyman Dinkins G. M. Dixon Nevel Dinkins Chas. D. Doss W. T. Davidson F. C. Dresser Terry C. Durham W. E. Dickerson, Jr. Walter E. Durham Gilbert Dinkins Otis P. Dewberry Mrs. Grace B. Dawson Mrs. Otis P. Dewberry Miss Evelyn Dickerson Mrs. W. W. Driskill Nannie Lucille Doss Mrs. Margaret Emrick M. L. Earman C. T. Evans Lewis T. Evans Warren Emerick Meredith Evans Christine Eddins C. M. Evans N. R. Featherston G. T. Farrar Edward Ferguson W. W. Fleshman George W. Farrar James H. Ferguson Willie W. Farrar W. L. Farmer J. D. Ferrell George E. Frasier Harry D. Ferguson Lester C. Furney Sam S. Ferguson G. D. Farrar Morris Ferguson W. P. Ferrell Harpson S. Fleshman Horace Price Ferrell E. H. Ferris James M. Fulcher Mrs. Oreanna D. Farmer Mrs. Sarah T. Ferguson Mrs. Mamie Flowers Mrs. Lucy L. Furney Mrs. M. L. Ferguson Elizabeth Smith Ford Mrs. W. W. Ford, Jr. W W.. Ford, Jr. Lizzie Maude Godsey Ida L. Guill Clyde B. Godsey G. D. Gordon A. M. Goodman Robert Gills Erie R. Glenn A. Z. Gunter A. R, Gobble Chap R. Garrett Clarence H. Gobble D. H. Goin C. F. Gilley A. F. Godsey J. G. Gentry Harry B. Giles James H. Garrett Raymond Godsey James M. Garrett Raymond C. Garrett W. W. Godsey John E. Guthrie J. R. Gunter C. T. Gunter John S. Guill H. W. Guill Otha Godsey Clifford L. Godsey John D. Guill Havilah L. Guill S. L. Gobble H. W. Gallier Joe C. Gallier Herbert L. Godsey Theodore Gilbert James B. Goin Charles N. Gregory Wallace B. Gordon Richard Godsey Mrs. Jennie James Gordon Mrs. Lily C. Gilliam Miss Frances Gordon Margaret Goble Mrs. Carrie G. Gobble Mrs. Clara F. Garrett L. C. Godsey W. L. Godsey Warren Guill R. T. Holycross C. A. Hancock A. R. Harwood L. B. Harvey J. R. Hamilton E. W. Harris Jessie H. Hamlett W. C. Hamlet Frank Hanenkrat, Jr. John T. Hunter L. N. Herncall R. P. Harvey William R. Herndon"}, "highlight": {"text": {"matched_tokens": ["Harwood", "J", "W"], "snippet": "A. Hancock A. R. <mark>Harwood</mark> L. B. Harvey <mark>J</mark>. R. Hamilton E. <mark>W</mark>. Harris Jessie H. Hamlett"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "J", "W"], "snippet": "A. Hancock A. R. <mark>Harwood</mark> L. B. Harvey <mark>J</mark>. R. Hamilton E. <mark>W</mark>. Harris Jessie H. Hamlett"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [477.85, 532.96, 612.24, 975.77], "bbox_id": "40a3757574", "file": "AppomattoxNewspapers_1915-1918a_0590.pdf", "page": 1, "text": "A H Clement ............... .........  5 00 B B Abbitt ....................  - ------- 2 00 CW Smith ........ .......... ............... ....... 100 8 L Ferguson ...................... . 6 00 H W McKinney....... ................ 50 L F Ferguson ......... ......... ..........  2 00 Harold Spencer ............................  1 00 LB Smith................................. ........ 2 00 J W Hem let .................................. . 1 00 A R Harwood... ................. ...... ...... 1 00 W c Hubbard .................... ...... .... 1 00 J O OBrien...................................... 100 Jamei Meredith............................. 50 M C Caldwell ......... ......... ................ 1 00 J A B urke ....................................... 50 Brown A Smith .................... .. I 00 BC Mann  ........... .  . 26 Mrs Bessie James............ . .............. 100 Bev L F Cell ahem ......... ............... 1 00 Tunstall Morgan...................... . 1 00 A T In g e ................  ................... 2 00 Bddie Moore. .................... 50 Blcbard Smith. ........  , ---------- - 50 Walter Woolridge ........... ............... 60 Miss Mar Baboock- ..........  .... to Mas Ruth Moore .............. .. 50 Douglas Puckett --------- - --------- 50 Deb. Babcock .................... 50 Chas F James .................................. 50 Baggie Stanley ............................... 26 B L Burke ................. ................ .... 1 00 R F Burke ........ ............... 100 T W M oms . ...................................... 1 00 Henry Doherty .......................... 25 Robert Irby .......... . ............. 150 Mlu Gretchen Bell .........  . ......... 60 Milton Harden ..... .............. 60 Mrs L A Mclver.............................. 1 00 R F Woolf oik. ____ ___ _ _ ____ _ 50 C B Davis ......... . .................. 60 Lougenia Phtteaon........... .. ......... 50 Buth Clement ................................ 50 Mrs A C Bledsoe ...... ................... 1 00 Lieutenant Adam ti Clement ..... 1 00 B 8 Wheeler- ....................... ........... 1 00 J K Pulliam .......  ...................... 26 W t W right... .......... 25 B R P r l m m 26 L J Morris ..... ......................... 50 B w Babcock............................. to Mrs. CT Moses. . ......................... 60 Mrs. D H Marshall . ....................... 50 J P L Fleshm ao ............. ........... 50 Blantha Drinkard ....... . ................ 1 05 Marye Drinkard ............................ 1 00 C L T oley ............. _ ........................ 50"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "LB Smith................................. ........ 2 00 <mark>J</mark> <mark>W</mark> Hem let .................................. . 1 00 A R <mark>Harwood</mark>... ................. ...... ...... 1 00 <mark>W</mark> c"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood", "W"], "snippet": "LB Smith................................. ........ 2 00 <mark>J</mark> <mark>W</mark> Hem let .................................. . 1 00 A R <mark>Harwood</mark>... ................. ...... ...... 1 00 <mark>W</mark> c"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2234.89, 393.49, 2403.56, 595.28], "bbox_id": "755781077d", "file": "AppomattoxNewspapers_1939-1943a_0028.pdf", "page": 1, "text": "The Farmers National, Bank, Ap pomattox, has announced a supper meeting off its shareholders to be hald at Hotel Appomattox Tuesday evening, January 9th, at 630. In ifii letter of invitation to the shareholders toe bank . -said, This meeting will give a chance, -for fell owship and a period of social con-, i-ac which is entirely wtorthwhile in these days of hustle and, rush off business. You will also have a chance to know better the condition cf yaur bank and wsfjth of your strek. The bank has enjoyed a splendid year and its officials should hi com mended for its administration. Officers are F.L.Murphy, pres- dent L .J. Morris, vice-president H. W. McKiniiiey, vicc-prc?dcr.V, A. R. Harwood, cashier."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "F.L.Murphy, pres- dent L .<mark>J</mark>. Morris, vice-president H. <mark>W</mark>. McKiniiiey, vicc-prc?dcr.V, A. R. <mark>Harwood</mark>, cashier."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "F.L.Murphy, pres- dent L .<mark>J</mark>. Morris, vice-president H. <mark>W</mark>. McKiniiiey, vicc-prc?dcr.V, A. R. <mark>Harwood</mark>, cashier."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2168.13, 532.92, 2335.93, 722.97], "bbox_id": "b23848541b", "file": "AppomattoxNewspapers_1939-1943a_0293.pdf", "page": 1, "text": "The Appomattox Ruritan Club met Tuesday night of this week. At a business session, Ned Han cock, vice-president, was named to succed A. R. Har.wood, Jr., as pres ident of the club. Mr. Harwood found it necessary to relinguish his office as president due to his ap- 1 roaching induction in the armed service of the United States. The club voted to retain Mr. Harwoods name on the membershFp roll as an honorary member. Edwin Fore, of Pamplin, was elevated to the vice-presidency. Rev. L. C. Shearer conducted a program, around the topic, What Appomattox Needs. Among those speaking on this topic were George F. Abbitt, Judge J. W. Flood, R. B. Hudgins and A. R. Harwood."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "George F. Abbitt, Judge <mark>J</mark>. <mark>W</mark>. Flood, R. B. Hudgins and A. R. <mark>Harwood</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "George F. Abbitt, Judge <mark>J</mark>. <mark>W</mark>. Flood, R. B. Hudgins and A. R. <mark>Harwood</mark>."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1793.0, 696.76, 1958.82, 744.95], "bbox_id": "89a4def7f7", "file": "AppomattoxNewspapers_1949-1952a_0365.pdf", "page": 1, "text": "Mrs. V. W. Sears, Mis. A. R. Harwood, Jr. and Mrs. J C. Cald well will attend a W M. II. house party at Fork Union on Thuisday and Friday of this week."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "Mrs. V. <mark>W</mark>. Sears, Mis. A. R. <mark>Harwood</mark>, Jr. and Mrs. <mark>J</mark> C. Cald well will"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "Mrs. V. <mark>W</mark>. Sears, Mis. A. R. <mark>Harwood</mark>, Jr. and Mrs. <mark>J</mark> C. Cald well will"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1816.24, 1202.85, 1982.94, 1262.3], "bbox_id": "af18ff361a", "file": "AppomattoxNewspapers_1947-1949a_0371.pdf", "page": 1, "text": "Finance Committee C. S. Jenkins, G. F. Abbitt, Jr. Tom Ferguson, F. L. Murphy, J. D. Plunkett, A. R. Harwood, R. L Burke, W. S. Taylor, L. B. Harvey, W. W. Burke, L. J. Morris, A. T. Inge,"}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "Ferguson, F. L. Murphy, <mark>J</mark>. D. Plunkett, A. R. <mark>Harwood</mark>, R. L Burke, <mark>W</mark>. S. Taylor, L. B."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "Ferguson, F. L. Murphy, <mark>J</mark>. D. Plunkett, A. R. <mark>Harwood</mark>, R. L Burke, <mark>W</mark>. S. Taylor, L. B."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1360.56, 1054.77, 1513.31, 1335.32], "bbox_id": "e8a720f32a", "file": "AppomattoxNewspapers_1926-1933a_0143.pdf", "page": 1, "text": "e Federal Land Bank  has need the rate of interest to twwers to 51-4 per cent. Make i applications for any amount  a . H. Clement, Sec.-Treas. lisses Frances and Elizabeth Brien have returned home  r visiting Miss Martha wnsend and Mrs. J. W. Og- m, of Chase City. Misses Alice Harwood and rrine Hancock left Sunday i William  Mary. Miss Bessie I . Harwood also for Richmond II here she will teach. Mrs. W. B. Caldwell and Mrs. j l  E. Dmwiddie, Misses Fl orence 11 Tidwell, Bessie V. , Harwood II  J. C. Caldwell have returned 11 ! after a most delightfuljl isit to Mrs. A. J. Bush and 11 w. W. P. Cook, of Norfolk. J"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Martha wnsend and Mrs. <mark>J</mark>. <mark>W</mark>. Og- m, of Chase City. Misses Alice <mark>Harwood</mark> and rrine Hancock left"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Martha wnsend and Mrs. <mark>J</mark>. <mark>W</mark>. Og- m, of Chase City. Misses Alice <mark>Harwood</mark> and rrine Hancock left"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [529.9, 367.17, 687.29, 559.37], "bbox_id": "93682cd656", "file": "AppomattoxNewspapers_1918-1922a_0593.pdf", "page": 1, "text": "At the annual meeting of the stockholders of the Farmers National Bank held yesterday the old officers were re elected as follows C. W. Hancock, president, M. C. Smith, Vice- president, A. R. Hardwood, cashier, J. E. Dinwiddie asst, cashier. The following Board of Directors were elected. H. Vi. McKinney. D N. Twyman, S. J. Lee, A. R. Harwood, M. C Smith, O. W. Hancock, C. A. Hancock, W. B. Caldwell, L. J Morris, A. H. Clement and C. S. McDerman."}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "D N. Twyman, S. <mark>J</mark>. Lee, A. R. <mark>Harwood</mark>, M. C Smith, O. <mark>W</mark>. Hancock, C. A. Hancock,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "D N. Twyman, S. <mark>J</mark>. Lee, A. R. <mark>Harwood</mark>, M. C Smith, O. <mark>W</mark>. Hancock, C. A. Hancock,"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1633.2, 1166.67, 1807.09, 1454.62], "bbox_id": "0c54ce2c88", "file": "AppomattoxNewspapers_1933-1936a_0055.pdf", "page": 1, "text": "The following is a list of the K - antora of the choir  R. L. Burke K. Cunningham, Mary Louise Gills, Florence Trent, ,G. O. Gordon, W. M. Thompson, Phoebe OB nen, I Moses, Avis . Brown, R. E. Reddi g, T. A. Walton, Mrs. R. W Jamerson, ichas. F. James, S S. Coffman, S. W. Sears, E. LeRoy Smith, J. L- OBrien, F. C. Dresser, J. A. Burke, C W. Smith, F C Murphy, A. Harwood, R.F. Ramsey, HM Burge j. D. Morris, J. E. Dinwiddle, W I Russell Jamerson, F. T. Cawthorn, 1 G. F. Abbitt Jr. R E OBnen. Eula May Burke, R B Hudgins. C S Mc- Dearmon, C. T. Moses, B. G. Ander son, Joel W. Flood, L. Crawley,  B. Harvey, H.-W. McKinney, J. W. Cawthom, Mi. S L. Ferguson, Lizzie A. White. F. A. OBnen, W. M. Abbite, J E Jamerson, G. W. Woolridge, C. H. Swing, Shafts Drinkard. Herbert Pulliam and R. S. Wheeler."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "OBrien, F. C. Dresser, <mark>J</mark>. A. Burke, C <mark>W</mark>. Smith, F C Murphy, A. <mark>Harwood</mark>, R.F. Ramsey, HM Burge"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "OBrien, F. C. Dresser, <mark>J</mark>. A. Burke, C <mark>W</mark>. Smith, F C Murphy, A. <mark>Harwood</mark>, R.F. Ramsey, HM Burge"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [894.71, 438.63, 1061.61, 576.08], "bbox_id": "b6905bb24f", "file": "AppomattoxNewspapers_1943-1947a_0093.pdf", "page": 1, "text": "Recent visitors of Mrs. Wilson Hix were Rev. and Mrs. W. M. Black, Misses Bessie Gunter, Mary Rives Black, Lucile Dickerson, Mrs. Martin Coleman, Mr. and Mrs. E. H. Carson and family, Mrs. J. R. Marshall, Mrs. E. W. Gi nan, S. G. Harwood, Mr. and Mrs. H. J. Covington, Mrs. B. G. Anderson, Mrs. E. P. Sears, Mrs. N. S. Top ping, Mrs. Puckett, Mr. and Mrs. P. H. McPhillips, Ed McPhillips,A. R. Harwood, Mr3. Barry Dahl, and Dr. D. A. Christian. Mrs. Hix con tinues ill."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Harwood"], "snippet": "Carson and family, Mrs. <mark>J</mark>. R. Marshall, Mrs. E. <mark>W</mark>. Gi nan, S. G. <mark>Harwood</mark>, Mr. and Mrs. H."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Harwood"], "snippet": "Carson and family, Mrs. <mark>J</mark>. R. Marshall, Mrs. E. <mark>W</mark>. Gi nan, S. G. <mark>Harwood</mark>, Mr. and Mrs. H."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1974.93, 681.28, 2138.32, 1431.58], "bbox_id": "d52d8e0e38", "file": "AppomattoxNewspapers_1926-1933a_0532.pdf", "page": 1, "text": "Over 600 members and visi tors attended home-coming services at Liberty Baptist church here last Sunday. At Sunday school services recognition of members of long service was given T- A. Walton and R. E. Caldwell, Sr., w ho lave each been members of the Sunday School for approxi mately 70 years, while L. E. Smith has served 42 years as a neacher. A packed church auditorium istened Sunday morning to an inspiring sermon by the pastor, the Rev.W.- M. Thompson, upon the text Upon Thi ! lock I Will Build My Church, following the morning service a bounteous dinner was served on the church grounds. During the afternoon a por trayal of scenes from the early listory of Liberty church was depicted and recognition ex pended-to friends arid former members. Among the visiting Ministers were E. F. Burnette, W. T- Henderson, R. E. Red ding, and Joe Lynch. Mr. and Mrs. A. S. Wdolridge were pre sented a bouquet as oldest liv ing members of the church and Garland Jackson Morris recog nized as youngest member Many messages of greetings were read. T h e Rev. E. J. Wright preached at the Sunday night service. The following people served on Home-Coming committees On invitations, T. A Walton, A. iT. Inge and Miss Louise Gills. On tables, W- M. Hancock, L. E. Smith, Joe LeGrand, J. D. Morris, Miss Grace Caldwell, Mesdames A. R. Harwood, L Crawley, Pitzer Gills, and J. D- Moses. On music, Mrs. L. E. Smith, Don Moses, W. W. Scott, and Miss Cornelia Gills. On ushers C. F. James The following people took part in the pageant T. A, Walton, Mrs. Elizabeth Tord, R. L. Burke, Don Moses, L. E Smith, Mrs. L. E. Smith, W. M Hancock, Mrs W. M- Hancock, Lucille Cralle, R L. Murphy, Mrs. J. D. Plunkett, Mrs. A R. Harwood, R- A. Glenn, W P. Gills, Msr. E- E. Gills, Billy Hubbard, R. F. Ramsey, Mrs R. F. Ramsey, Miss, Louise Gills, Jack Scott a n d Naomi Hancock. ------------ o ----- - -----"}, "highlight": {"text": {"matched_tokens": ["J", "Harwood", "W"], "snippet": "R L. Murphy, Mrs. <mark>J</mark>. D. Plunkett, Mrs. A R. <mark>Harwood</mark>, R- A. Glenn, <mark>W</mark> P. Gills, Msr. E-"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Harwood", "W"], "snippet": "R L. Murphy, Mrs. <mark>J</mark>. D. Plunkett, Mrs. A R. <mark>Harwood</mark>, R- A. Glenn, <mark>W</mark> P. Gills, Msr. E-"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2403.37, 574.37, 2576.78, 786.92], "bbox_id": "63999945fa", "file": "AppomattoxNewspapers_1939-1943a_0220.pdf", "page": 1, "text": "-Officers and dir acton- of the bank were le-elected for another term by uner-mous action of . the ahatehoW- etr at a businera meo avg the larquet and  GiP.?e  m F . L. Munby, Preaident, H W . McKinney and L. J nrrm, vice presidents A. K. Harwood, cashier Miss Jeasalyn Hancock an-j Don Moses, assistant cashier. . Following a bountitui and ae- lghtfully served banquet, president l Murphy welcomed the gueste i d shareholde.- A H- Harwood actd as toastmastei. He read  resume of the veer activities of the bank. He then 5ntroducf.e1 . eral guests for brief remarks, in cluding R. L. Burke, of tha jtenf of Appomattox, George F. Abbitt Jr., Calvin H . Robinson, Rv. H. ,F Jones and Senator C.IT.Moseft, !. r.c.  L at I E"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Harwood"], "snippet": "L. Munby, Preaident, H <mark>W</mark> . McKinney and L. <mark>J</mark> nrrm, vice presidents A. K. <mark>Harwood</mark>, cashier Miss Jeasalyn Hancock"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Harwood"], "snippet": "L. Munby, Preaident, H <mark>W</mark> . McKinney and L. <mark>J</mark> nrrm, vice presidents A. K. <mark>Harwood</mark>, cashier Miss Jeasalyn Hancock"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.9, 485.56, 1827.0, 566.11], "bbox_id": "cf14c46386", "file": "AppomattoxNewspapers_1939-1943a_0179.pdf", "page": 1, "text": "Miss Alice Harwood, Mis. W .M . Abbitt and M r. and Mrs J . C. Caldwell spent the week-enl m Williamsburg and attended the Wil liam and Mary and University 1 Virginia football game. John Taylor spent the week-end in j Its an excit- jychmond."}, "highlight": {"text": {"matched_tokens": ["Harwood", "W", "J"], "snippet": "Miss Alice <mark>Harwood</mark>, Mis. <mark>W</mark> .M . Abbitt and M r. and Mrs <mark>J</mark> . C. Caldwell spent the"}}, "highlights": [{"field": "text", "matched_tokens": ["Harwood", "W", "J"], "snippet": "Miss Alice <mark>Harwood</mark>, Mis. <mark>W</mark> .M . Abbitt and M r. and Mrs <mark>J</mark> . C. Caldwell spent the"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1693.44, 746.16, 1895.83, 838.95], "bbox_id": "fd9f89e740", "file": "AppomattoxNewspapers_1962-1965a_0531.pdf", "page": 1, "text": "memorate peace made a t Appomattox, an Indian princess in honor of the Appomattox Indians, dogwood blossom, the state flower, and tobacco leaves. The seal is lettered Ap pom attox County 1845  the H eart of V ir ginia. Committee members include Mrs. Jerry A. Burke, Mrs. R. G. Janatka, Dr. W. Twyman Williams, Mrs. A. R. Harwood, Jr., and Dr. J. A. Mathews."}, "highlight": {"text": {"matched_tokens": ["W", "Harwood", "J"], "snippet": "R. G. Janatka, Dr. <mark>W</mark>. Twyman Williams, Mrs. A. R. <mark>Harwood</mark>, Jr., and Dr. <mark>J</mark>. A. Mathews."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Harwood", "J"], "snippet": "R. G. Janatka, Dr. <mark>W</mark>. Twyman Williams, Mrs. A. R. <mark>Harwood</mark>, Jr., and Dr. <mark>J</mark>. A. Mathews."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
