{"document": {"bbox": [1475.92, 673.75, 1618.06, 929.73], "bbox_id": "f4f8b56a9b", "file": "AppomattoxNewspapers_1962-1965a_0306.pdf", "page": 1, "text": "were Mrs. Martin Coleman, Jr., J. H. Reynolds and Mr. and Mrs. Marvin Reynolds. Dinner guest Sunday of Mr. and Mrs! J. W. Thornhill were the Rev. and Mrs. G. M. Proffitt and Dale and Mrs. Mildred Mann. Visiting in the afternoon were Mrs. Walker Garrett and son, of Appomattox and Mrs. Lewis Harris. Mrs. J. W. Thornhill is im proving after several weeks ill ness. We do hope for her a spee dy recovery. Mrs. Clyde Childer and daugh ters visited her parents, Mr. and Mrs. Marvin Reynolds Sunday. The Week of Prayer for the Lottie Moon Christmas offering of Liberty Chapel were held last week in the homes of Mrs. Sam Thornhill, Mrs. Percy Garrette, Mrs. Allen Carter, Mrs. Lonnie Reynolds and Mrs. Preston Cole man."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs! <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> were the Rev. and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs! <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> were the Rev. and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.63, 356.11, 1631.26, 549.19], "bbox_id": "e6874f7e5e", "file": "AppomattoxNewspapers_1952-1954a_0246.pdf", "page": 1, "text": "ttr ATY CHAPEL, April 22.- u. Of the Liberty Chape BMtbtlhurch will have a social at X m e of Mr. and Mrs. Joe Meg- ginson faturday evening. Mrs. Wilson Scruggs and Mrs. BeroarJ Childers were the dinner J S B r id a y of Mrs. Lorraine Reynolds. Mr !d Mrs. J. W. Thornhill, of Abtogdi spent last week with W. -s W S f nhi11 and ther relatlVeS Suooér guests Friday of Mr. and I"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Reynolds. Mr !d Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abtogdi spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Reynolds. Mr !d Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abtogdi spent last"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1967.49, 874.49, 2138.37, 955.29], "bbox_id": "e69dfe93d5", "file": "AppomattoxNewspapers_1960-1962b_0620.pdf", "page": 1, "text": "Those visiting Mr. and M r s . Charles Carter recently were Mr. and Mrs. Charles Morgan, Mr. and Mrs. Ben Thornhill, Mrs. Mildred Mann, Mrs. Billy Mills, Mrs. Bill Sperry, Wendy and Johnnie, Mrs. Don Thornhill and Donnie, J. W. Thornhill and Mrs. Paul Thornhill."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "Thornhill"], "snippet": "Don Thornhill and Donnie, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mrs. Paul <mark>Thornhill</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "Thornhill"], "snippet": "Don Thornhill and Donnie, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mrs. Paul <mark>Thornhill</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1926.69, 954.85, 2069.26, 1106.2], "bbox_id": "04c4e2efc2", "file": "AppomattoxNewspapers_1962-1965a_0448.pdf", "page": 1, "text": "Those that met at the home of J. H. Reynolds Sunday to cele brate his birthday were his chil dren and grandchildren, also his brothers from Danville and Big Island. Mr. and Mrs. J. W. Thornhill Mrs. Harry White, Mrs. Mild red Mann and Dennis Williams visited with Mr. and Mrs. Fred Jones on Thursday evening. Mrs. Billy Coleman and chil dren and Mrs. Lillian Hatcher were dinner guests of Mr. and Mrs. Preston Coleman last Wed nesday."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Island. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Mrs. Harry White, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Island. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Mrs. Harry White, Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [400.83, 419.44, 553.2, 870.53], "bbox_id": "3524d24347", "file": "AppomattoxNewspapers_1962-1965a_0430.pdf", "page": 1, "text": "Those attending the 25th anni-1 versary of Mr. and Mrs. Carl Martin at Trinity Church Sunday from here were Mr. and Mrs. Lonnie Reynolds and family and ! J. H. Reynolds and Marvin Rey-! nolds. Mr. and Mrs. Sam Coleman, Jr. and daughter, Mr. and Mrs. Sonny Smith and family and John Mann enjoyed a ccok-out dinner Monday at the home of. Mr. and Mrs. Billy Coleman. Mr. and Mrs Sam Thornhill,, j Mr. and Mrs. Henry Stanley and I sons attended the Lawhome re-1 union in Lynchburg on Sunday I There were around eight attend ing this happy occasion. We extend our sympathy to the I Inge family. Sorry to hear of this death. Mr. and Mrs. J. w. Thornhill,  Mrs. Mildred Mann, Mr. and Mrs Haul Thornhill and M. H. Cartel! attended the funeral service  Monday of Mrs. Cole at Bethel Church at Andersonville. Miss Virginia Coleman has re -! turned home after a weeks visit in Lynchburg with relatives. Mr and Mrs. Lewis Harris and son, Ray Mr. and Mrs. Doc Harris and sons, Lawrence Har ris and Miss Cattie Harris en joyed a cook-out dinner at the heme of Mr. and Mrs. Joe Megg- inson Saturday evening. Mr. and Mrs. John W. Gunter visited with Mr. and Mrs. J. W. Tho nhill Saturday evening. Mrs. Florence Phelps spent ! several days this week with her daughter, Mrs. Marvin Reynolds. Mrs. Lewis Harris and daugh-  ter, Mrs. Bill Allen, spent last"}, "highlight": {"text": {"matched_tokens": ["J", "w", "Thornhill"], "snippet": "death. Mr. and Mrs. <mark>J</mark>. <mark>w</mark>. <mark>Thornhill</mark>,  Mrs. Mildred Mann, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "w", "Thornhill"], "snippet": "death. Mr. and Mrs. <mark>J</mark>. <mark>w</mark>. <mark>Thornhill</mark>,  Mrs. Mildred Mann, Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [694.77, 293.13, 861.84, 2004.83], "bbox_id": "02ae436ebd", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "The Senatorial Convention Nominates H. D. Flood by AcclamationThe Buckingham and Cumberland Dem ocrats Nominate E. W. Hubard for the House of DelegatesSenator Martin Endorsed. Promptly at the appointed hour, Chairman V. E. Pratt, of the Buck ingham Democracy, called to order the convention of the Eighteenth senatorial district Iu the courthouse ou Monday. The convention organ ized by electing Dr. Pratt chairman and W. W. Haskins secretary. This organization was made permanent. The chair appointed the follow ing committee on credentials Frank Moon, of Buckingham Paul Pettit, f Fluvanna Joel Watkins, of Ap pomattox. The committee reported!he fol lowing delegates present and end- lied to stats in the convention BuckinghamFailed to get the names of these delegates. AppomattoxJoel Watkins, A. II. Clement, James B. Abbitt, II. 8. Coleman, A. B. Thornhill, J. W. Davidson, W. F. Wright. FluvannaA. A. Gray, Paul Pet- dt, C. B. Wood, W. C. White, W. F. Snead. Mr. A. A. Gray, of Fluvanna, then nominated Hon. H. D. Flood to suc ceed himself as Senator from this district, iu a speech which was well received, by the audience, and which elicited much applause, showing plainly that the audience endorsed his eulogistic remarks on Mr. Flood and his record as a representative. Mr. Gray is a pleasant speaker, aud his remarks were timely and highly appreciative. Mr, A. B. Thornhill, of Appomat tox, in a beautiful speech, seconded the nomination of Mr. Flood. He referred to the magnanimity with which Mr. Flood refused the certifi cate of election to Congress in 1896, and presented figures showing that iie received 4,000 more votes than diu Mr. Tucker in 1894, and 6,000 more than did Mr. Quarles in 1898. Mr. Thornhills remarks made a good impressiou, and he was the re cipient of congratulations upon his peech. Messrs. F. C. Moon and Ednt. W. Hubard, ou the part of Bucking ham, made short speeches seconding the nomination. At the conclusion of these speech es Mr. Paul Pettit moved that the nomination be made by acclamation, which was adopted, and the chair appointed Messrs. Gray, Thornhill, and Hubard to iuform Mr. Flood of his nomination, and to present him to the convention. Mr. Flood accepted the nomina tion in a speech of twenty minutes, which aroused much enthusiasm. He assured the peopie of his appie- fiaaou of the honor conferred, and of their endorsement and loyalty, to him and his public acts. He spoke earnestly of the faithful service to the laboring people of Virginia ren dered by Senator Martin, aud of the light he made for him in the Demo cratic caucus six years ago, assuring the Democracy of Virginia that, if- they would lay the mantle of the seuatorship upon Mr. Martin at that time, the Democracy of the Old Do minion would approve their action. Mr. Flood referred to the large ma jority of counties having gone for Senator Martin as proving the truth of his prediction, and said that Mr. Martin would be renominated by a four-fifths majority. At the con clusion of his speech he was pre sented wit-h a bouquet of beautiful flowers. Mr. F. 0. Moon offered the follow ing resolutions, which weie unani mously adopted Resolved, That the course of Hon. T. S. Martin, United States Senator, is fully endorsed and approved and the nomiuee of this convention is in structed to vote for and support Him for re-election to that position. . 2d, That the tiominee of this con vention is instructed to vote for and support Hon. George J. Hundley for re-electiou as Judge of this judicial circuit. Mr. W. W. Haskins said that he was instructed by the Maysville-dis- trict meeting to bring up the ques tion of moving the courthouse aud the nominee was instructed to op pose any movement looking to the removal of the courthouse. The senatorial convention then adjourned, and the house conven tion, composed of delegates from Buckingham and Cumberland, as sembled for the purpose of nomi nating a candidate for the House of Delegates. Dr. Pratt and Mr. Haskins were retained as chairman and secretary, respectively, of the convention.  W. M. Smith, of Cumberland, and F. C. Moon, of Buckingham, were appotiled a committee on creden tials, who reported the following delegates present and entitled to scats in the cony.epjbj.Qn t CumberlandW. if. South, H. D. Woodson. H. K. Adams, E. B. Davis, A. B. Armstrong, and J. W. Adams. BuckinghamWe are nnable to give the names of these delegates. F. C. Moon uommated Hon. E. W. Ilubar.t for delegate to the General Assembly from tjiis district, com posed of Buckingham an,d Cumber land counties, Mr. W. M. Smith, of Cumberland, in a few well chosen remarks, sec onded the nomination. Mr. John W. Adams moved that it be made by acclamation, which was done with a whoop. Sfr. Hubard was informed of his nonuuatiQQ, and was presented to the convention for a speech. Mr. Hubard made onj ?fp t his h.ap-i py speeches, full of logic and rea-! sou. He was severe on independ ents, and promised that the flag of Democracy should not trail in the dust, aud predicted a great victory fojt tjie party at the general election. He appealed ty his hearers with much force io si an cl by fthe nomi nees, saying it was not now afight, of Flood and Hubard, but a fight for the supremacy of Democratic"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "W"], "snippet": "8. Coleman, A. B. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Davidson, <mark>W</mark>. F. Wright."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "W"], "snippet": "8. Coleman, A. B. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Davidson, <mark>W</mark>. F. Wright."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.05, 478.7, 2400.0, 668.74], "bbox_id": "d1f7d1705f", "file": "AppomattoxNewspapers_1960-1962b_0280.pdf", "page": 1, "text": "The courteous, automobile dlriver rarely becomes involved in an acci dent. sically inclined home in Virginia  rotted compost, or sawdust, 30 it could be the best nomination is days before planting. Be sure the the J. W. Thornhill home, but in soil, especially clay soil, is not too Abingdon. wet for plowing. And so, Appomattox today sa- Plan the garden now for the year, lutes an outstanding native son, Keep in mind a balanced diet for the who has made a success in life, and family when planning the garden, on top of. that has created a special Refer to your 1960 gardening hoblby of museum relics and treas- notesif you kept some, ure items which will delight the mu- Select varieties carefully. v Some sac world for many years to come. diseases can be controlled only by -------- - ------------ using resistant varieties.. Use cab- Wealth, in itself, is not wrong, bage varieties which are resistant to but there are differences of opinion L6 vtarieti.eS l , , tant to blight, watermelons resis- ahout how far a man can go in get- tant t0 fU8a,rium wilt and anthra- ting it. nose, etc."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Be sure the the <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> home, but in soil,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Be sure the the <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> home, but in soil,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1154.4, 229.85, 1295.71, 352.15], "bbox_id": "b018ac67c4", "file": "AppomattoxNewspapers_1962-1965a_0263.pdf", "page": 1, "text": "sent were Mr. and Mrs. J. W, Thornhill, Mr. and Mrs. Charles Morgan, Mr. and Mrs. Omah Moore and family, Mr. and Mrs. William Childers and family, Mr. and Mrs. Sam Thornhill, Mrs. Harry White and Wayne and Ralph Stanley. Birthday cake and home made ice cream was served. Dinner guests Tuesday of Mr. and Mrs. Paul Thornhill were"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "were Mr. and Mrs. <mark>J</mark>. <mark>W</mark>, <mark>Thornhill</mark>, Mr. and Mrs. Charles"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "were Mr. and Mrs. <mark>J</mark>. <mark>W</mark>, <mark>Thornhill</mark>, Mr. and Mrs. Charles"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [674.65, 777.17, 835.05, 1041.07], "bbox_id": "2fd07bb687", "file": "AppomattoxNewspapers_1892-1898a_0306.pdf", "page": 1, "text": "Petticrew, M. A. Plunkett, Chas. T. Pnryear, J. B. Porter, B. D. Porter, J. A. Powell, J. D. Powell, Major Reveley, Geo. Reynolds, W. H. Rey nolds, A. L. Robertson, A. A. Robertson, C. T. Robertson, L. W. Routen, P. H. Routen, G. D. Simms, E. A. Simms, S. M. Steele, G. W Stepp, Nathan Stepp, Jno. D. Strat ton, J. T. Stratton, R. C. Smith, E. F. Scruggs, W. M. SnelJ, John W. Tauner, J. N. Tauner, W. A. Taylor E. M. Taylor, W. B. Thomas, J. W. Thornhill, R. H. Walker, W. H. H. Walker, J. A. Walton, T. E. Wat kins, J. A. Webb, T. F. West, Alex. Whitehead, A. P. Whitehead, H. A. Whitaker, J. W. Whitaker, J. C. Woodson, J. 0. Woodson, B. E. Wooldridge, T. E. Wilson, J. Wheeler, j!k. S. Wheeler, A, Wright, D. L."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "W"], "snippet": "Taylor, W. B. Thomas, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, R. H. Walker, <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "W"], "snippet": "Taylor, W. B. Thomas, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, R. H. Walker, <mark>W</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1299.32, 813.46, 1402.56, 1678.28], "bbox_id": "92fd7ab7d3", "file": "AppomattoxNewspapers_1954-1955a_0075.pdf", "page": 1, "text": "PBW, Ch,,. P. Clover Hill. Powell, J. M. Dead Purdieu, W. D. Transferred House. Perdieu, H. C. Transfer! wood. Robertson, T. P. Dead. Reynolds, Milton R. Ded Robertson, Geo. W. Deal Robertson, Thos. H. Dead. Ragland, S. P. Dead. Reynolds, W. R. Deid. Reynolds, Mrs. Lizzie I red to Court Home. Robertson, Herman E. to Nelson Co. Robertson, Elizabeth. Court House. Spiggle, C. B. Dead. Spiggle, J. W. Transferred stone. Smith, Napoleon. Out of Ce Scruggs, J. W. Transferred 1 er Hill. Spiggle, Robert. Transferredl ville. Scruggs, E. R. Out of Coal Spradlin, R. F. Transferredl pomattox. Spradlin, S. H. Transferred well. Stephens, Geo. T. Transfer Oakville. Smith, C. Rolling. Transient Clover Hill. Scruggs, Louise. Dead. Spiggle, Geo. W. Transfer Walkers Ch. Spiggle, J. H. Transferred M ville. Spiggle, Mrs. Estelle. Trim to Walkers Ch. Thornhill, A. B. Dead. Thornhill, J. H. Dead. Thornhill, C. W. Dead. Turner, C. E. Dead. Turner, G. E. Dead. Turner, E. C. Dead. Thornhill, L M. Transferred land. j Thornhill, Lee. Transferred tel er Hill. Thornhill, 0. W. Transffl Lynchburg. Toddey, H. B. Dead. Trent, T. H. Transferred W ville. Trent, Mrs. Bessie. TransW Oakville. Thornhill, J. W. Transferredl Abingdon. ,  Thornhill, J. W. Transfer Court House. Thornhill, H. C. Transferred Lynchburg. Totty, Leslie. Transferred  ville. Wells, Alonza. Dead. J Wingfield, B. F. Transfe j Lynchburg. Woodson, J. 0. Dead. Woodson, Thos. S. Dead. J Watson, J. F. Transferred! House. Webb, 0. J. Dead. Woodson, Mis. Nora  j Wootton,. W. J. Dead. Watson, Bettie L. Dead. J Woodson, Jacob S. D! prince Edward Watson, Susie L. Court House. , J Wells, Roy W. Transferred Ville. fnjM Woodson, Mrs. NanW  to Prince Edwari."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "Thornhill", "J"], "snippet": "Mrs. Bessie. TransW Oakville. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Transferredl Abingdon. ,  <mark>Thornhill</mark>, <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "Thornhill", "J"], "snippet": "Mrs. Bessie. TransW Oakville. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Transferredl Abingdon. ,  <mark>Thornhill</mark>, <mark>J</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2323.87, 374.87, 2472.82, 627.22], "bbox_id": "46a95650dc", "file": "AppomattoxNewspapers_1962-1965a_0367.pdf", "page": 1, "text": "Mrs. Malcolm Booker attend ed an antique show at the Jef ferson H o t e l , Richmond, last Thursday. Mr. and Mrs. Henry Stanley, visited with Mrs. . Margrette Owen ,of Richmond, Saturday? Those visiting in the home tit Mr. and Mrs. John R. Thornhill of Roanoke, Sunday were M e . .and Mrs. J. w. Thornhill, Mrsr Mildred Mann and Mr. and Mrq S.- N. Thornhill. Mr. and Mrs. Boyce BumisK of South Carolina, visited with the Joe Megglnsons and Mr. anti Mrs. Doc Harris over the week end. Those visiting Mr. and Mra Lewis Harris last Sunday were Mrs. Bill Alien and Mrs. Pearl Harris, of Lynchburg. Mr. and Mrs. Bill McGraU and daughter, of Newport New spent the week end with heo- parents, Mr. and Mrs. Malcolm Booker."}, "highlight": {"text": {"matched_tokens": ["J", "w", "Thornhill"], "snippet": "M e . .and Mrs. <mark>J</mark>. <mark>w</mark>. <mark>Thornhill</mark>, Mrsr Mildred Mann and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "w", "Thornhill"], "snippet": "M e . .and Mrs. <mark>J</mark>. <mark>w</mark>. <mark>Thornhill</mark>, Mrsr Mildred Mann and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [860.88, 479.0, 1002.86, 732.8], "bbox_id": "daddaa6173", "file": "AppomattoxNewspapers_1962-1965a_0258.pdf", "page": 1, "text": "Mrs. John W. Gunter enter tained her Intermediate Sunday School pupils and their parents at National Bridge Saturday eve ning beginning with a picnic supper and attending a religious film later. Mrs. J. H. Reynolds had sur gery at Virginia Baptist Hospital Saturday for a broken hip. Mr. Reynolds is improving at Vir ginia Baptist Hospital. We do hope for them both a speedy re covery. Visiting in the home of Mr. and Mrs. Paul Thornhill Sunday were Mr. and Mrs. Kern Mays, Mr. and Mrs. J. W. Thornhill. Mrs. Mildred Mann, Mr. and Mrs. Sam Thornhill, Mr. and Mrs. Billy Mills and Michael, Mr. and Mrs. Don Thornhill and Don nie, Mr. and Mrs. Bill Sperry, Wendy and Johnnie and Mr. and Mrs. Charles Morgan. Mrs. Bessie Ferguson spent"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mays, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. Mrs. Mildred Mann, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mays, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. Mrs. Mildred Mann, Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1916.1, 1008.6, 2022.73, 1524.34], "bbox_id": "50f37dd05e", "file": "TimesVirginian_1980a_0346.pdf", "page": 1, "text": "Mrs. J. W. Thornhill Hermon R. Woody Virginia L. Woody L. C. Reynolds, Sr. LaFaye W. Martin Cindy Mclnteer Fred Smith Lisa M. Bald in Frank Wooldridge Dawn Warner Donna Woods  Jane Carwile Kevin OBrien Pamela 0Rrien Gary Woods Ann Woods Irene Woods Dewey Woods C. E. Isaacs Erna Isaacs Mrs. Bobby Ferguson Bobby Ferguson Walter L. Day Emmitt Knight, Jr. Robert A. Layne J. H. Kirkland Emery S. Waldorph Linda P. Cheatham Cecil J. Rowe Jim Bitner J. Michael Gibbs J. W. Walter David L. Covington K. Richardson Pat Johnson John T. Hunter Frank E. Hunter"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Hermon R. Woody Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Hermon R. Woody Virginia"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.08, 977.13, 2025.83, 1494.06], "bbox_id": "44faa49106", "file": "TimesVirginian_1980a_0359.pdf", "page": 1, "text": "Mrs. J. W. Thornhill Hermon R. Woody Virginia L. Woody . L. C. Reynolds, Sr. LaFaye W. Martin Cindy Mdnteer Fred Smith Lisa M. Baldwin Frank Wooldridge Dawn Warner Donna Woods Jane Carwile Kevin OBrien Pamela OBrien Gary Weeds Ann Woods Irene Woods Dewey Woods C. E. Isaacs Ema Isaacs Mrs. Bobby Ferguson Bobby Ferguson Walter L. Day immitt Knight, Jr. Robert A. Layne J.H. Kirkland Emery S. Waldorph Linda P. Cheatham Cecl J. Rewe JimBitner J. Michael Gibbs J. W.Waler DavM L. Covington K. Richardson Pat Johnson JohoTrHunttr Frank E. Hunter"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Hermon R. Woody Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Hermon R. Woody Virginia"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [771.12, 1070.21, 939.87, 1417.7], "bbox_id": "94cfd067cf", "file": "AppomattoxNewspapers_1952-1954a_0300.pdf", "page": 1, "text": "Mrs. Florene Phelps, who has-been visiting her, daughter, Mrs. Marvin Reynolds has recently returned to her home. Visitors in this home were Mr. and Mrs. Hunter Jamerson, Mr. George Jamerson, Miss Cotelle Phelps and Miss Avis Holt. Mrs. Sallie Jamerson, Alice Faye and Don Thornhill spent several days last week with Mr. and Mrs. J. W. Thornhill, of Abingdon. Miss Gloria Ann Lewis is spend ing this week with Mildred Ann Thornhill. Week-end visitors of Mr. and Mrs. Percy Garrette were Mr. and Mrs. David Garrette, of Washington, D. C. Mr. and Mrs. Volney Garrette and children, of Blackstone, and Mr. and Mrs. R. S. Guill and chil dren, of Norfolk. Mrs. Guill and children remained for a longer visit. Those visiting in the home of Mr. and Mrs. L. C. Reynolds Sunday were Mrs. Mosby Payne, of New York Mr. and Mrs. J. H. Reynolds, Mr. and Mrs. Paul Thornhill and Mildred Ann, Becky Reynolds, Mr. and Mrs. Russell Martin and Meryln, Carl Martin and Gaynelle. Mr. and Mrs. Jessie Harvey, Jr., of Lynchburg, visited in the homes of Mr. and Mrs. Percy Garrette and Mr. and Mrs. Paul Thornhill Monday evening."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "with Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon. Miss Gloria"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "with Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon. Miss Gloria"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [579.62, 393.21, 729.85, 629.75], "bbox_id": "984d3939b0", "file": "TimesVirginian_1980a_0036.pdf", "page": 1, "text": "Mrs. F. E. Rosa Williams of Gladstone and Mrs. J. R. Jackie Bishop of Myrtle Beach AFB, S.C. 11 grandchildren two great-grandchildren two brothers, O. W. Thornhill of Lynchburg and J. W. Thornhill of Gladstone and two sisters, Mrs. Joe Mildred Coleman of Dillwyn and Mrs. J. A. Sallie McFadden of Lynchburg. Funeral services were con ducted at 130 p.m. Monday from Tim berfake B aptist Church by the Rev. James N. Williams and Dr. Paul A. Hatmacher. Interment was in Fort Hill Memorial Park. Robinson Funeral Home, Appomattox, was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Thornhill of Lynchburg and <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone and two"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Thornhill of Lynchburg and <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone and two"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2315.44, 1008.56, 2427.64, 1677.14], "bbox_id": "6f219eafe6", "file": "TimesVirginian_1980a_0346.pdf", "page": 1, "text": "Mrs. Edwin Anderson J.W. Walter Richard S. Thompson Gary R. Huskey William C. Gaines H. J. Wright M ary6rove Paul W. Harris Ronnie GuiN William À. Stratton Edward T. Richardson Jerry L. Burke Joan Grishaw Roger 6rishaw Etta B. OBrien Hugh Bugg Mary Grey Holland Mrs. Faye Bugg Mr. Paul Bugg Dillard Franklin  Charles J. Sprinkle Leslie Webber E. C. Moore C. T. Bates, Jr. B. R. Coleman Harold Wyatt L.p. Fleshman James E. McClary Anne C. McClary Gary G. Youngblood 6erald B. Foltz Paige T. Harvey David Coffman Martha Bosiger Douglas M. Webb Sheila F. Webb Eleanor Ç. Connor Wdliam Â. Hunter Patsy S. Harvey fihetey Cutshai! Edna Anderson Grace Cunningham Bobby OBrien 0. W. Martin, Jr. Mrs. 0. W. Martin, Jr. Mason E. Benton MacArthur Harris J. W. Thornhill"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "E. Benton MacArthur Harris <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "E. Benton MacArthur Harris <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1756.68, 262.19, 1898.0, 609.64], "bbox_id": "9256acada1", "file": "AppomattoxNewspapers_1962-1965a_0141.pdf", "page": 1, "text": "Mrs. Charles Morgan and Mrs. Paul Thornhill were guests Sat urday of Mr. and Mrs. Billy Mills, of Farmville. Mr. and Mrs. J. R. Thornhill, of Roanoke, and Mrs. Harry White, of Lynchburg, are visiting several days this week in the home of Mrs. Mildred Mann. Other visitors Sunday evening were Mr. and Mrs. Charles Mor gan, Mr. and Mrs. Henry Stan ley, Wayne and Ralph, Mr. and Mrs. J. W. Thornhill, Mr. and Mrs. Sam Thornhill, Mr. and Mr. and Mrs. Paul Thornhill and Donnie Thornhill. Recent visitors in the home of Mr. and Mrs. Preston Coleman were Mr. and Mrs. Percy Garr- dtte, Mr. and Mrs. Tom Moore and Mr. and Mrs. Ed Eubank. Those attending the Sunday School convention from Liberty Chapel that was held Suday at Fitzgerald Baptist Church in Cumberland were Mr. and Mrs. Joe Megginson and family, Mr. and Mrs. Sam Thornhill, Mrs. Bertha Booker and Mrs. Lillian Hatcher. Mrs. Lonnie Reynolds spent last Thursday in Lynchburg as guest of Mr. and Mrs. Martin Coleman and Mr. and Mrs. J. H. Reynolds."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Ralph, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Mr. and Mrs. Sam"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Ralph, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Mr. and Mrs. Sam"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1974.67, 1735.23, 2148.18, 1785.58], "bbox_id": "916445e353", "file": "AppomattoxNewspapers_1947-1949a_0510.pdf", "page": 1, "text": "Mrs. Carl Martin visited Mrs.1 Hun er Jamerson last week. J. W. Thornhill, of Abington, spent last week in the home of his father, W. W. Thornhill."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "W", "W", "Thornhill"], "snippet": "Mrs. Carl Martin visited Mrs.1 Hun er Jamerson last week. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abington, spent last week in the home of his father, <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "W", "W", "Thornhill"], "snippet": "Mrs. Carl Martin visited Mrs.1 Hun er Jamerson last week. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abington, spent last week in the home of his father, <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1905.87, 442.81, 2168.88, 527.46], "bbox_id": "d837951cf6", "file": "AppomattoxNewspapers_1971-1973a_0482.pdf", "page": 1, "text": "Mr. J. W. Thornhill of Gladstone, can boast of an ex cellent driving record and has reason to be proud of this record. Mr. Thornhill has been driving for 50 years, has owned 21 automobiles, and has driven over one million miles with out a single ticket of any kind and without an accident Con gratulations. Drivers like this make for better and safer highway conditions.for other drivers."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone, can boast"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone, can boast"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1510.86, 596.22, 1672.11, 1145.56], "bbox_id": "099453f080", "file": "AppomattoxNewspapers_1908-1909a_0405.pdf", "page": 1, "text": "Mr. George W. Turner, 80 years o f age, died Saturday morning after a long illness or heart trouble. He was born in this county, where he spent bis life. H e was a member of Maple Grove Bapttot Church and as long as able be attended his church and after he became disabled he ask for prayer services to be held at his home.  He was tfr last surviving1 member of the Turner family. Deceased is survived by his wife one daughter, Miss Suse three sons Hubert, Jim arid John all of this county. Funeral services were held at his home Sunday at 3 oclock, conducted by Rev. E. F. Burnett and he was laid to rest in the family cemetery. Flowers were carried by eight girls. Pall-bearers were Raymond and Warren Jamerson, Clifert Burks, Ben Thornhill, W A Wells, Leonard Thornhill. Hon orary pall-bearers were Charlie and Daniel Jamerson, W. W. Thornhill, J. W. Dixon, Baxter Robertson and R. L. Childress. Mr. Turner was a devoted husband, a kind father and a good friend. Dear father now that youve passed away -  Youre catling from Heaven above, Hoping again to embrace us some  .day la th e folds of Fatherly lové While whispering low, we daily hear The voice of father lingerihg near T Only a voice, no form we see. Tis Fathers voicehes guid ing me."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "and Daniel Jamerson, W. <mark>W</mark>. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Dixon, Baxter Robertson"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "and Daniel Jamerson, W. <mark>W</mark>. <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Dixon, Baxter Robertson"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [840.71, 527.89, 1008.47, 567.94], "bbox_id": "e46915122c", "file": "AppomattoxNewspapers_1949-1952a_0483.pdf", "page": 1, "text": "Mr. and Mrs. Sam Thornhill and daughter visited J. W. Thornhill and Mr. and Mrs. Walker Thornhill, of Lynchburg Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "Thornhill", "Thornhill"], "snippet": "Mr. and Mrs. Sam <mark>Thornhill</mark> and daughter visited <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mr. and Mrs. Walker <mark>Thornhill</mark>, of Lynchburg Sunday afternoon."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "Thornhill", "Thornhill"], "snippet": "Mr. and Mrs. Sam <mark>Thornhill</mark> and daughter visited <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mr. and Mrs. Walker <mark>Thornhill</mark>, of Lynchburg Sunday afternoon."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1321.46, 546.44, 1425.71, 585.74], "bbox_id": "a7c97fcddb", "file": "AppomattoxNewspapers_1952-1954a_0565.pdf", "page": 1, "text": "Mr. and Mrs. Paul i J Thornhill, J. w. Thorjf Laura Thornhill spent! in Richmond."}, "highlight": {"text": {"matched_tokens": ["J", "Thornhill", "J", "w", "Thornhill"], "snippet": "Mr. and Mrs. Paul i <mark>J</mark> <mark>Thornhill</mark>, <mark>J</mark>. <mark>w</mark>. Thorjf Laura <mark>Thornhill</mark> spent! in Richmond."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Thornhill", "J", "w", "Thornhill"], "snippet": "Mr. and Mrs. Paul i <mark>J</mark> <mark>Thornhill</mark>, <mark>J</mark>. <mark>w</mark>. Thorjf Laura <mark>Thornhill</mark> spent! in Richmond."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.89, 402.46, 1610.37, 814.4], "bbox_id": "7fddde453a", "file": "AppomattoxNewspapers_1962-1965a_0232.pdf", "page": 1, "text": "Mr. and Mrs. John W. Gunter attended home coming at Spout Spring Baptist Church Sunday. Mr. and Mrs. Clayton Martin and Mr. and Mrs. Henry Stan ley, Jr. spent Saturday in Rich mond. Dinner guests Sunday of Mr. and Mrs. Lonnie Reynolds were the Rev. and Mrs. G. M. Prof fitt, A1 and Dale and J. H. Rey nolds. Mrs. Clyde Childer, of Rich mond, and Mrs. Bernard Okild- er, of Appomattox visited Mr. and Mrs. Marvin Reynolds Sat urday afternoon. Mr. and Mrs. Sam Thornhill and Mr. and Mrs. Henry Stan ley, Jr., Wayne and Ralph visit ed Mr. and Mrs. Charlie Lw- horne, of Lynchburg Sunday afternoon. Mr. and Mrs. J. W. Thornhill, Mrs. Hary White and Mrs. Mildred Mann attended home coming at Pleasant Grove Church Sunday. Mrs. James Beale and chil dren, of Appomattox, were din ner guests of Mr. and Mrs. Lon nie Reynolds Thursday. Visiting in the home of Mrs. Mildred Mann Sunday were Mr. and Mrs. Fred Jones and family and Miss Sarah McFadden. Mr. and Mrs. Russell Leftwich of Lynchburg, visited over the week end in the home of Mr. and Mrs. Joe Megginson. Mr. and Mrs. Paul Thornhill visited in the home of Mr. and Mrs. Kern Mays Friday night."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "afternoon. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Mrs. Hary White and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "afternoon. Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Mrs. Hary White and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1645.7, 867.65, 1797.13, 877.65], "bbox_id": "841d2c31d6", "file": "AppomattoxNewspapers_1949-1952a_0060.pdf", "page": 1, "text": "Mr. and Mrs. J. W. Thornhill, of"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1950.51, 448.1, 2120.51, 488.1], "bbox_id": "30d5cdafeb", "file": "AppomattoxNewspapers_1960-1962b_0511.pdf", "page": 1, "text": "Mr. and Mrs. J. W. Thornhill have returned to their home in A- bingdon after a visit here and Ap pomattox with relatives."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> have returned to their home in A- bingdon after a visit here and Ap pomattox with relatives."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> have returned to their home in A- bingdon after a visit here and Ap pomattox with relatives."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [754.56, 579.54, 922.81, 647.84], "bbox_id": "22c64c4be9", "file": "AppomattoxNewspapers_1952-1954a_0126.pdf", "page": 1, "text": "Miss Laura Thornhill, Mrs. Sallie Jamerson and Paul Thornhill spent several days last week in Abingdon as guests of Mr. and Mrs. J. W. Thornhill. They were dinner guests Sunday of Mr. and Mrs. J. R. Thorn hill, of Roanoke."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. They were dinner guests"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. They were dinner guests"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [514.78, 599.05, 672.37, 790.98], "bbox_id": "6210978b28", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "MEGCINSON S MILL IRECINCT. D A Christian, Ellis Wooldridge Wm D Woodson, L S Woodson, A E Miltimore, It G Wright J J McFaddiu, J W Gariett, J T Nowlin, C W Thornhill, J H Thornhill, J W Davidson, S T Megginson, T J Megginson, T J Gooding, W J Gooding, A Wells, Geo W Turner, Jamerson,"}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J", "Thornhill", "J", "W"], "snippet": "J T Nowlin, C <mark>W</mark> <mark>Thornhill</mark>, <mark>J</mark> H <mark>Thornhill</mark>, <mark>J</mark> <mark>W</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J", "Thornhill", "J", "W"], "snippet": "J T Nowlin, C <mark>W</mark> <mark>Thornhill</mark>, <mark>J</mark> H <mark>Thornhill</mark>, <mark>J</mark> <mark>W</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [424.12, 839.3, 761.63, 991.85], "bbox_id": "8b0300b9be", "file": "AppomattoxNewspapers_1955-1957a_0404.pdf", "page": 1, "text": "M r. and .Mrs. J. W. Thornhill, of Abingdon Mr. and Mrs. -H. C. Thornhill and daughter, of Nor folk Mr. and Mrs. W. O. Thornhill and family, Mr. and Mrs. Sonny Mrs. W. E. Hancock was hostess Williams and family, Mr. and Mrs. to the Tuesday bridge club this! Bill Sperry ar.d Wendy, of Lynoh- week. Top score prize went to Mrs. burg J. L. Thornhill and Mr. and Rachel F. Lawson, and consolation Mrs. Don Thornhill, of Appomat- prize went to Mrs. D. E. Caldwell, tox Mrs. Kern Mays, Oscar Cumes, Jr. of Concord Mr. and Mrs. Paul Thornhill and Fave, Mr. and Mrs. Mr. and Mrs. Stuart Farrar en-j Sam Thornhill, Mr. and Mrs. Henry tentamed at a dinner party at Ton-. Stanley, Jr.- Mrs. Branch Harris, uwanna Lake Tuesday evening com- ,Ir. and Mrs. c.vlar!.s Roberts Mrs. plimenting Mr. and Mrs. C. Lewis Lewis Mann, and Mr and Mrs Fred"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "M r. and .Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "M r. and .Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon Mr. and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [504.92, 737.92, 823.54, 844.52], "bbox_id": "60b7739ba5", "file": "AppomattoxNewspapers_1926-1933a_0502.pdf", "page": 1, "text": "lots of woWy for the inmates, I Mrs. J. H. Thornhills health but such is lifeand it all is about the same, comes out right in the end if j  w. Thornhill was in the we have the faith and the right Hill City Montiay. Looks like kind of faith in God.  hes wearing new glasses Mr. and Mrs. Herncall and Uncle Paul Goff Aunt daughter, of Lynchburg, and _ ,J1IlcI1e. Jra.ai V011 anil , Mrs. W. H. S. Barlow and son, D.uck hl,s wlfe,,  aged of Appomattox, were the guestsled PcPle walked two miles to erf Mrs. C. W Phelps Sunday. Isee -,ust what dat highway don"}, "highlight": {"text": {"matched_tokens": ["j", "w", "Thornhill"], "snippet": "in the end if <mark>j</mark>  <mark>w</mark>. <mark>Thornhill</mark> was in the we"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "w", "Thornhill"], "snippet": "in the end if <mark>j</mark>  <mark>w</mark>. <mark>Thornhill</mark> was in the we"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1212.24, 274.38, 1382.49, 355.17], "bbox_id": "0256c8c605", "file": "AppomattoxNewspapers_1960-1962b_0209.pdf", "page": 1, "text": "Liberty Ctsapel, Nov. 8 .- Mr. and Mrs. J. W. Thornhill, of Abingdon Mr. and Mrs. J. B. Thornhill 0f Roanoke a.tì Mr. and Mrs H c Thornhill, of Norfolk have return! ed to their homes after being can d here due to the illness and df Mir. W, W. Thornhill."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "8 .- Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "8 .- Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon Mr. and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1242.52, 530.76, 1349.99, 552.48], "bbox_id": "414992d9c2", "file": "AppomattoxNewspapers_1955-1957a_0169.pdf", "page": 1, "text": "Liberty Chapel, May Ll Mrs. J. W. Thornhill, J"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "Liberty Chapel, May Ll Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, <mark>J</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "Liberty Chapel, May Ll Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, <mark>J</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1648.75, 353.61, 1825.39, 703.96], "bbox_id": "72135640f4", "file": "AppomattoxNewspapers_1960-1962b_0452.pdf", "page": 1, "text": "Liberty Chapel Liberty Chapel, Oct. 18.- Mrs. El sie Cardwell was the week-end guest of Mr. and Mrs. John W. Gunter. Mr. and Mrs. Joe Megginson, J. R. and Josia and Mrs Elsie Meggin son visited relatives in Richmond on Sunday. Mr. and Mrs. Percy Garrette spent the .week-end with their son-in-law and daughter, Mr. and Mrs. R. S. Guill, of Norfolk. Mr. and Mrs. J. W Thornhill, of Abingdon will visit with relatives here and at Appomattox this week. Mrs. J. R. Boojker left last week to visit with her daughter in Nor folk.Mrs. Wilson Scruggs and Nancy visited Mrs. Osia Ferguson in Rich mond Sunday. Mrs. Lonnie Reynolds entertained her two daughters, Delores and Deb bie last Wednesday evening with a birthday party. Those present with the hostess and honOrees were Mr. and Mrs. J. H. Reynolds, L. C., and Michael, Lonnie Reynolds, Ray mond Martin, Mr. and Mrs. Carl Martin, Mr. and Mrs. Russell Mar tin and Penny, Miss Gaynell Martin, Miss Jacqueline Cobbs, Miss Merelyn Martin, Valeria Booker, Josia Meg- I ginson, Lisa Crafton, Barbara Bryant and Miss Virginia Coleman."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Norfolk. Mr. and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Thornhill</mark>, of Abingdon will visit"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Norfolk. Mr. and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Thornhill</mark>, of Abingdon will visit"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [468.25, 790.0, 607.97, 1061.1], "bbox_id": "5ca28ec07f", "file": "AppomattoxNewspapers_1962-1965a_0635.pdf", "page": 1, "text": "Liberty Chapel John Mann spent the week end with his son and daughter-in-law, Mr. and Mrs. Kenneth Mann, of Lynchburg. Mr. and Mrs. J . W. Thornhill visited with relatives in Roanoke several days last week. The W.M.S. meet Monday eve ning in the home of Mrs. J . R. Booker. Mrs. Dorthy Carter and fami ly visited with Mr. and Mrs. Billy Coleman Sunday. Mrs. Lillie Dunaway is a visi tor in the home of Mr. and Mrs. Lonnie Reynolds. Mr. and Mrs. Paul Thornhill Mr. and Mrs. Lewis Morgan, Miss Nancy Morgan and Mrs. Billy Mills and Michael visited with Mr. and Mrs. Charles Mor gan and Mr. and Mrs. Don Thornhill Saturday evening. Visiting with Mrs. M i l d r e d Mann over the week end were Mr. and Mrs. O. W. Thornhill, of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Lynchburg. Mr. and Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Thornhill</mark> visited with relatives in"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Lynchburg. Mr. and Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Thornhill</mark> visited with relatives in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1012.8, 340.36, 1186.4, 875.7], "bbox_id": "8c7d30f66e", "file": "AppomattoxNewspapers_1949-1952a_0514.pdf", "page": 1, "text": "Liberty Chapel, Jan. 22.- Dinner guests last Sunday of Mr. and Mrs. Sam Thornhill were Mr. and Mrs. J. H. Reynolds, Mr. and Mrs. Martin Coleman and daughter, and W. W Thornhill. Mr. and Mrs. Paul Thornhill made a business trip to Abingdon last week. While there they visited Mr. and Mrs. J. W. Thornhill. On their return they visited Dr. and Mrs. E. C. James, of Salem, and Mr. and Mrs. J. R. Thornhill, of Roanoke. Mr. and Mrs. Jessie Harvey, Jr and daughter were visitors of Mr and Mrs. Marvin Reynolds and Mr and Mrs. Percy Garrett on Thursday night. Others visiting Mr. and Mrs. Garrett were Mr. and Mrs. C. D Lewis. Dinner guests Sunday of Mr.- and Mrs. John W. Gunter were Mr. and Mrs. Lawrence Hatcher. Mr. and Mrs. Marvin Reynolds and daughter and Miss Anna Harris vis ited Mr. and Mrs. Fred Davidson Sunday afternoon. Dinner guests Sunday in the home of W. W. Thornhill were the Rev. and Mrs. J. P. Leitner, Mr. and Mrs. J. H. Reynolds, Mr. and Mrs. Mar tin Coleman, Mr. and Mrs. Sam Thornhill and daughter, Mr. and Mrs. Sonny William and son, Jackie Thornhill and Virginia Thornhill. The Home Demonstration Club meeting was held in the home of Mr. and Mrs. Percy Garrett last Thursday. Special guest at the meet ing was Eric Lund, who made a tape recording to be broadcast this Thursday. Dinner guests Sunday of Mr. and Mrs. Lonnie Reynolds were Mr. and Mrs. Carl Martin and daughter, Mr. and Mrs. and Mrs. Russell Martin and daughter, Mr. and Mrs. Ray mond Martin and Becky Reynolds We are glad to know that David Garrett, son of Mr. and Mrs. Percy Garrett, is improving. He underwent an operation at a hospital in Wash ington."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "visited Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. On their return they"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "visited Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. On their return they"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.41, 717.84, 1764.44, 824.59], "bbox_id": "4481b540cd", "file": "AppomattoxNewspapers_1955-1957a_0055.pdf", "page": 1, "text": "Liberty Chapel, Dec. 19.- The erty Chapel Christmas program be held at the church on ,Satu evening at 730. Paul Thornhill and daug Mildred Ann spent several days week in Abingdon as guests of and Mrs. J. W. Thornhill. On way home they visited Mrs. I James, of Salem and Mr. and"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "guests of and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. On way home they"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "guests of and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>. On way home they"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2490.23, 266.36, 2631.67, 535.5], "bbox_id": "86939f14b1", "file": "AppomattoxNewspapers_1962-1965a_0093.pdf", "page": 1, "text": "Jan. l  Mr. and Mrs. John W. Gunter were Sunday utter- noon guests of Mr. and Mrs. J W. Thornhill. Dinner guests Sunday of M!r, and Mrs. Marvin Reynolds were Mr. and Mrs. Clyde Childers and daughter, of fUcbmond, Mr. and Mrs. Bernard phlldera of Appo1 mattox, and J. n . Reynolds. Mr. and Mrs. Lewis Spencer, of Arrington, visited in the horre of Mr. and Mis. Ram Thornhill, Sunday. Dinner guests Saturday of Mr. and Mre. Lonnie Reynolds were Mr. end Mrs. Bennie Beale and Mr. and Mrs. Walker Beale. M rs. Fred Inge, of Lynchburg, le spending sometime in the home of her daughter and son- in-law, Mr. and Mrs. Preston Coleman. Mr. and Mrs. Bill McGrath, at Newport News, were week end guests of her parents, Mr. and Mrs. Malcolm Booker."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Thornhill</mark>. Dinner guests Sunday of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "of Mr. and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Thornhill</mark>. Dinner guests Sunday of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2059.92, 547.71, 2213.87, 557.71], "bbox_id": "90c91319bf", "file": "AppomattoxNewspapers_1952-1954a_0102.pdf", "page": 1, "text": "J. W. Thornhill, of Abingdon"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "<mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "<mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.63, 542.1, 1631.68, 632.75], "bbox_id": "837bb15b89", "file": "AppomattoxNewspapers_1952-1954a_0246.pdf", "page": 1, "text": "j W Thornhill, Miss Mildred in I Thornhill and Paul Thornhill spent tEfh u  jF in Richmond. Dinnír guests of Mr. and Mrs. Perev ferrett Sunday were the Rev. Jfj snd MX J. P. Leitner. The Lome demonstration club mc Mrs. Bernard Childers"}, "highlight": {"text": {"matched_tokens": ["j", "W", "Thornhill"], "snippet": "<mark>j</mark> <mark>W</mark> <mark>Thornhill</mark>, Miss Mildred in I"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Thornhill"], "snippet": "<mark>j</mark> <mark>W</mark> <mark>Thornhill</mark>, Miss Mildred in I"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2270.87, 511.68, 2453.99, 622.88], "bbox_id": "c0f65d0be0", "file": "AppomattoxNewspapers_1955-1957a_0402.pdf", "page": 1, "text": "J. L. and Paul Thornhill motored to Greenville, Tennessee, Monday. On their trip they expect to visit Mr. and Mirsa. J. W. Thornhill, of Abingdon and Mr. and Mm. J, R. Thornhill, of Roanoke. GREAT NEWS .11"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "visit Mr. and Mirsa. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "visit Mr. and Mirsa. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon and Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1605.32, 205.46, 1745.82, 539.2], "bbox_id": "e865a9ad07", "file": "AppomattoxNewspapers_1974-1975a_0092.pdf", "page": 1, "text": "GLADSTONE - Paul Alexan der Thornhill, 68, of Rt. 2, Gladstone, died Saturday at his residence. His wife was the late Pauline Owen Thornhill. Born in Appomattox County, he was a son of Wilson Walker Thornhill and Lillian Spiggle Thornhill. He was a member of Liberty Chapel Baptist Church and a retired farmer. He is survived by a son, Don W. Thornhill of Appomattox three daughter, Mrs. Charles Morgan and Mrs. Bill Sperry of Appomattox and Mrs. William Mills of Farmville five broth ers, S. N. Thornhill and J. W. Thornhill of Gladstone, H. C. Thornhill of Norfolk, J. R. Thornhill of Roanoke and O. W. Thornhill of Lvnchburir two sisters, Mildred Rush of Buck ingham and Sallie McFaden of Lynchburg, and eight grand children. Funeral services were con ducted at 2 p.m. Monday at Robinson Funeral Home of Appomattox. Burial was in Liberty Baptist Church ceme tery."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "S. N. Thornhill and <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone, H. C."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "S. N. Thornhill and <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> of Gladstone, H. C."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1676.62, 880.61, 1842.77, 910.26], "bbox_id": "e8b0a5460c", "file": "AppomattoxNewspapers_1955-1957a_0137.pdf", "page": 1, "text": "Don Thornhill visited Mr. and Mrs. J. W. Thornhill, of Abingdon last week."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "Thornhill"], "snippet": "Don <mark>Thornhill</mark> visited Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon last week."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "Thornhill"], "snippet": "Don <mark>Thornhill</mark> visited Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon last week."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1514.75, 827.41, 1835.11, 987.29], "bbox_id": "715dcb5630", "file": "AppomattoxNewspapers_1926-1933a_0405.pdf", "page": 1, "text": "conducted by Rev. E. F. Burnett and he was laid to rest in the family cemetery. Flowers were carried by eight girls. Pall-bearers were Raymond  The marriage of Miss Ruth and Warren Jamerson, Clifert I Harris of Gladstone and Dallas Burks, Ben Thornhill, W A. I Eugene Walton of Appomattox Wells, Leonard Thornhill. Hon-1 took place at Lovingston Wed orary pall-bearers were Charlie nesdav. Rev. J. S. Robertson and Daniel Jamerson, W. W. I officiating. These are well-known Thornhill, J. W. Dixon, Baxtor Appomattox parties. Robertson and R. L. Childress. Liberty Church Services"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "officiating. These are well-known <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Dixon, Baxtor Appomattox parties."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "officiating. These are well-known <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Dixon, Baxtor Appomattox parties."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1576.28, 1202.21, 1674.07, 1775.37], "bbox_id": "c1d13ee5cc", "file": "TimesVirginian_1976_0393.pdf", "page": 1, "text": "Beverley K. Martin John A. Martin LaFaye W. Martin S. N. Thornhill Lois Thornhill J. W. Thornhill Mrs. J. W. Thornhill Lewis M. Harris Mrs. Lewis M. Harris Mrs. Alice W. Bayes Terry L. Bayes Raymond J. Woody Harry G. Woody Thomas Gunter Mamie Gunter Ivy W. Burks Carl E. Bryant Herman Woody Virginia Woody Joel W. Childress Joyce McCormick Floyd McCormick Hubert R. Watts Sammy Gunter Judy Gunter Billy Gunter Helen Gunter John W. Childress Rachel Childress Lena Childress Dr. S. R. Lawson Pat D. Johnson Dorothy N. Davidson J. M. Rosser R. Donald Robinson J. K. Marshall G. K. Bosiger Mary F. Terry"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "Thornhill", "J", "W"], "snippet": "S. N. Thornhill Lois <mark>Thornhill</mark> <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Mrs. <mark>J</mark>. <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "Thornhill", "J", "W"], "snippet": "S. N. Thornhill Lois <mark>Thornhill</mark> <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> Mrs. <mark>J</mark>. <mark>W</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.52, 794.68, 2315.58, 1223.57], "bbox_id": "dfe9df4f85", "file": "AppomattoxNewspapers_1933-1936a_0319.pdf", "page": 1, "text": "Bent Creek Oct 23. Rain is badly needed in this section. Only a few light showers since the down pour that raised the streams and did so much damage to the crops. Mr. and Mrs. Walker Thornhill, of Lynchburg, visited home people here last week. Mr. Milton and Marshall Hunter Richard Coleman and Charlie Dixon who are now with the force at Eagle Rock, speni the week end at their several homes here. Ben, Hunter, of Richmond, is spending several days with Garland Hunter and while here the sly fox had better take to his den and not wander around from the looks of the dogs Mr. Hunter has with him. He certainly enjoys a hunt Mr. and Mrs. J. W, Thornhill of Abbington spent Several days with their home people last week. J. R. Thornhill was here for a few days also. Mr. and Mrs. H. !C.  Thornhill spent the week end with her parents Mr. and Mrs. M. H Marks, near Lynchburg. Several of our boys expect to go to camp this week. Its good they can have something to do, but such a pity its not a job that has a future. That is what our country needs, is someplace where our young men can work and know that they will be rewarded for faithful service. That would encourage them to press on to the mark of the high calling. As it ft is they just work enough to _ get by and that is all there is to it. Miss Fannie Dirons condition con tinues about the same. Produce Prices"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "hunt Mr. and Mrs. <mark>J</mark>. <mark>W</mark>, <mark>Thornhill</mark> of Abbington spent Several"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "hunt Mr. and Mrs. <mark>J</mark>. <mark>W</mark>, <mark>Thornhill</mark> of Abbington spent Several"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.9, 518.6, 820.3, 824.14], "bbox_id": "5f9cfd30be", "file": "AppomattoxNewspapers_1926-1933a_0491.pdf", "page": 1, "text": "BENT CREEK, July 6.-J. D. Mick spent the Fourth with his family in Orange. He re ports a heavy downfall of rain there through the day. J. E. Martin and Dick Chil dress of Richmond spent Mon day in the home of T. P. Chil dress. Miss Oliver Harris and John Branch Harris, who have been visiting Mr. and Mrs. J. W. Thornhill at Abington, have returned home. Mr. and Mrs. Thornhill were visiting home people Saturday and Sunday. They returned home Monday accompanied by Mrs. O. W .Thornhill. Mr. John Bailey, of Rust- burg, was here Tuesday. He is the same contractor who1 moved the Marks store and building. He will move the residence of Mr. Leighton Mc Cormick next week. ----------------- o------------ O---------------------------------O"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "visiting Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> at Abington, have returned"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "visiting Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark> at Abington, have returned"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.67, 363.5, 1922.89, 424.34], "bbox_id": "9b66c9117c", "file": "AppomattoxNewspapers_1960-1962b_0226.pdf", "page": 1, "text": "Baul Thornhill old Burley to-  ibacco last week in Ahingdon, with an average of .63. .While on the trip he visited Mr. and Mis. J . W. Thornhill, of Abingdon, and Mr. and Mrs. J . R. Thornhill, of Roanoke."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "visited Mr. and Mis. <mark>J</mark> . <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon, and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "visited Mr. and Mis. <mark>J</mark> . <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon, and Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [477.61, 474.4, 1401.77, 560.0], "bbox_id": "73e48ed3d1", "file": "AppomattoxNewspapers_1949-1952a_0432.pdf", "page": 1, "text": "Appomattox W. W. Thornhill returned home Wednesday from a visit with his son, J. W. Thornhill, of Abingdon. Supper guests Sunday night of Mr. and Mrs. Paul Thornhill- were Mr. and Mrs. Jessie Harvey, Jr. and Miss Gloria Ann Lewis, of Lynch burg."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "visit with his son, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon. Supper guests"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "visit with his son, <mark>J</mark>. <mark>W</mark>. <mark>Thornhill</mark>, of Abingdon. Supper guests"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2096.15, 1253.89, 2258.02, 1431.84], "bbox_id": "8edcb979be", "file": "AppomattoxNewspapers_1892-1898a_0016.pdf", "page": 1, "text": "Appomattox Demooratlo Committee. Tbe Demooratlo Committee of Appo mattox oounly met at Appomattox C.H., on Wednesday, November 2, and per fected a general organization. Tbe fol lowing gentlemen were preseut Messrs. H. D. Flood, G. W. Abbitt, A. H. Abbitt, Joe Button, J. A. Owen? C. W. Phelps, J. W. Canon, N. W. Owen, E. A. Walton, J. B. Abbitt, J. O. Abbitt. J, H. Abbitt. J. T. Cheatham, M. J. Cheatham, R. L. Chilton, 8, P. Coleman, W. H. Jones, 8 D. Sear, Robt. W. Warier, T. J. Strat ton. D. A. Christian. S. T. Megglnaon, R. B. Kyle, M. F. Kyle. Btehrd Pheloy. B. O. Cbinault, John H, Wood, W, D. Kyle, Stephen Thornhill, J. W. Clark, J, K Hannah, J. L. Cralle, s. L. Ferguson, W J, Trent- T. E. Legrand, L E. Smith, Field 8mtth, Geo. Steele, R. B, Poore, Holoombe Mitohell, B. W. Beasley and Rjohard Brown."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "J"], "snippet": "W, D. Kyle, Stephen <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Clark, <mark>J</mark>, K Hannah,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "J"], "snippet": "W, D. Kyle, Stephen <mark>Thornhill</mark>, <mark>J</mark>. <mark>W</mark>. Clark, <mark>J</mark>, K Hannah,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [869.75, 453.38, 1037.58, 742.27], "bbox_id": "c79190588f", "file": "AppomattoxNewspapers_1933-1936a_0410.pdf", "page": 1, "text": "very ------- -PS-- farmer has to go on making it from year to year. C.M.Dixon, who has been spend ing the last year wi h his sister. Mrs. C . W.. Phelps has returned to his home in Summerville, Ala. He had thought ij was not possible for him to spend a winter in Virgin ia after living in Alabama for the Iasi 40 years but the illness of his sister, Miss. Fannie Dixon, who pas sed to her reward on February 5, kept him here. He left apparantly in good heal h His friends miss him here. Mrs. W. W . Thornhill received j word that her sister, Mrs. Annie i Ragland was ill in Lynchburg.  Mrs. Thornhill has been sick for several weeks but she went a once. Mrs. J . R . Marks is at the Lyn chburg hospital where she will be treated for a complication of di seases . Dr. W.L. Watts, who has been j sick for he past two weeks, is  some better. We regret to hear of the illness of your townsman, A . R . Harwood"}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "j"], "snippet": "him here. Mrs. W. <mark>W</mark> . <mark>Thornhill</mark> received <mark>j</mark> word that her sister,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "j"], "snippet": "him here. Mrs. W. <mark>W</mark> . <mark>Thornhill</mark> received <mark>j</mark> word that her sister,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [199.7, 713.49, 822.98, 852.45], "bbox_id": "0f115940c3", "file": "AppomattoxNewspapers_1908-1909a_0502.pdf", "page": 1, "text": "ots of wOrry for the inmates,  Mrs. J. H. Thornhills health ut such is life-and it all is about the same, comes out right in the end if j w w. Thornhill was in the we have the faitt and the right Hill City Monday. Looks like kind of faith in God. hes wearing new glasses Mr. and Mrs. Herncall and Gills and H. C. Babcock were the honored members in a tri ple birthday celebration dinner given by Mrs. W. P. Gills Sat- __ w tco n urday, May 21, in her home. A MiM Liirife U Tnnp f h J mammouth birthday cake roses Miss Lucile Jones spent the and candleg on the table gave"}, "highlight": {"text": {"matched_tokens": ["j", "w", "w"], "snippet": "in the end if <mark>j</mark> <mark>w</mark> <mark>w</mark>. Thornhill was in the we"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "w", "w"], "snippet": "in the end if <mark>j</mark> <mark>w</mark> <mark>w</mark>. Thornhill was in the we"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.71, 505.86, 1902.89, 632.26], "bbox_id": "ed6caee06f", "file": "AppomattoxNewspapers_1962-1965a_0137.pdf", "page": 1, "text": "enship, forgery. Commonwealth annua eace Service scheduled vs Steve Justus, unauthorized use or Sunday at the Surrender of a motor vehicle. Grounds. The service begins with   the Appomattox High School Grand Jury Band concert at 2 p.m., followed The Grand Jury was composed j py a worship service at 230. of Duvall Conner, R. B. Hudgins J. L. Thornhill, W. A. Jones, J. H. OBrien, G. F. Langran, and H. C. Blackwell. They were in structed by the court that they will be called to hear other cases before the current term of court is completed."}, "highlight": {"text": {"matched_tokens": ["J", "Thornhill", "W", "J"], "snippet": "Conner, R. B. Hudgins <mark>J</mark>. L. <mark>Thornhill</mark>, <mark>W</mark>. A. Jones, <mark>J</mark>. H."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Thornhill", "W", "J"], "snippet": "Conner, R. B. Hudgins <mark>J</mark>. L. <mark>Thornhill</mark>, <mark>W</mark>. A. Jones, <mark>J</mark>. H."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [162.25, 1040.4, 739.89, 1122.18], "bbox_id": "d7d1bc148e", "file": "TimesVirginian_1980a_0007.pdf", "page": 1, "text": "Want to  keep children in Oakville area, call 352-5923. J ____________ 1-3-ltc DONALD W. THORNHILL, JR. Swrawtiig CONNER, SMITH A THURMOND, INC."}, "highlight": {"text": {"matched_tokens": ["J", "W", "THORNHILL"], "snippet": "Want to  keep children in Oakville area, call 352-5923. <mark>J</mark> ____________ 1-3-ltc DONALD <mark>W</mark>. <mark>THORNHILL</mark>, JR. Swrawtiig CONNER, SMITH A THURMOND, INC."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "THORNHILL"], "snippet": "Want to  keep children in Oakville area, call 352-5923. <mark>J</mark> ____________ 1-3-ltc DONALD <mark>W</mark>. <mark>THORNHILL</mark>, JR. Swrawtiig CONNER, SMITH A THURMOND, INC."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1411.71, 563.58, 1531.91, 665.98], "bbox_id": "cd3aba9ec4", "file": "AppomattoxNewspapers_1947-1949a_0314.pdf", "page": 1, "text": "Those visiting W. W. jv over the week-end were 1 Mrs. J. R. Thornhill and w by, of Roanoke Mr. and !i Thornhill and daughter, j Mr. and Mrs. Frank Smith Alma Spiggle, Mrs. Lonniel nolds and son, Mr., and  Thornhill and family, and  Emily Chernault."}, "highlight": {"text": {"matched_tokens": ["J", "Thornhill", "w"], "snippet": "week-end were 1 Mrs. <mark>J</mark>. R. <mark>Thornhill</mark> and <mark>w</mark> by, of Roanoke Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Thornhill", "w"], "snippet": "week-end were 1 Mrs. <mark>J</mark>. R. <mark>Thornhill</mark> and <mark>w</mark> by, of Roanoke Mr."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.92, 260.78, 1836.94, 743.41], "bbox_id": "8304482ddf", "file": "AppomattoxNewspapers_1908-1909a_0391.pdf", "page": 1, "text": "Thomas Edwin Coleman Funeral services of Mr. Thomas Edwin Coleman, born March ,5, 1859, died March 24. 1929, son of the late Jane Lewis and Charles H. Coleman of Appomattox County, were held at the home, of his daugh ter, Mrs. John R. Booker on Monday, March 25, by Rev. E. F. Burnett. He was married twice, his first wife was Miss Ida B. Megginson and his sec ond wife was Miss Minnie L. Proffitt. The following children sur vive himMrs. Mark Cash, of Amherst Co. Mrs. J. R. Booker L. W., H. C. and Chas. A. Cole man and Mrs. P. H. Hicks, of Newport News, V a. Mr. G. E Coleman, Jr., and Mrs. 3. C. Head, of New York Mks. George Kirby, of Baltimore Mr. R. Jj Coleman, of Fort Bragg, N. G 7 and two sisters, Mrs. Robert Morgan, of Buck ingham, and Mrs. John Cole- man, of Richmond, and one brother, Mr. C. L. Coleman, of Appomattox Co. Pall-bearers were J. K. Megginson, R. E. Megginson, L. W. Garrett, J. C. Harris, W. A. Wells and P. W. Thornhill. Flower-bearers Mrs. J. K. Megginson, Mrs. Martin Cov ington and Miss Cecil Morgan."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "A. Wells and P. <mark>W</mark>. <mark>Thornhill</mark>. Flower-bearers Mrs. <mark>J</mark>. K. Megginson, Mrs. Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "A. Wells and P. <mark>W</mark>. <mark>Thornhill</mark>. Flower-bearers Mrs. <mark>J</mark>. K. Megginson, Mrs. Martin"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.94, 279.35, 1842.19, 763.57], "bbox_id": "7b3ac5d567", "file": "AppomattoxNewspapers_1926-1933a_0391.pdf", "page": 1, "text": "Thomas Edwin Coleman Funeral services of Mr. Thomas Edwin Coleman, born March 5, 1859, died March 24. 1929, son of the late Jane  Lewis and Charles H. Coleman of Appomattox County, were leld at the home of his daugh ter, Mrs. John R. Booker on Monday, March 25, by Rev. E. Burnett. He was married Twice, his first wife was Miss da B. Megginson and his sec ond wife was Miss Minnie L. Proffitt. The following children sur vive himMrs. Mark Cash, of Amherst Co. Mrs. J. R. Booker W., H. C. and Chas. A. Cole man and Mrs. P. H. Hicks, of Newport News, V a. Mr. G. E. Coleman, Jr., and Mrs. C. C. Head, of New York Mrs. George Kirby, of Baltimore Mr. R. J Coleman, of Fort Bragg, N. C., and two sisters, Mrs. Robert Morgan, of Buck ingham, and Mrs. John Cole man, of Richmond, and one brother, Mr. C. L. Coleman, of Appomattox Co. Pall-bearers were J. K. Megginson, R. E. Megginson, L. W. Garrett, J. C. Harris, W. A. Wells and P. W. Thornhill. Flower-bearers Mrs. J. K. Megginson, Mrs. Martin Cov- ngton and Miss Cecil Morgan."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "A. Wells and P. <mark>W</mark>. <mark>Thornhill</mark>. Flower-bearers Mrs. <mark>J</mark>. K. Megginson, Mrs. Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "A. Wells and P. <mark>W</mark>. <mark>Thornhill</mark>. Flower-bearers Mrs. <mark>J</mark>. K. Megginson, Mrs. Martin"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [628.54, 515.04, 791.72, 907.08], "bbox_id": "02494cfe2c", "file": "AppomattoxNewspapers_1892-1898a_0069.pdf", "page": 1, "text": "The moderator called the Associa tion to order at 1.40. Prayer by Dr. G. F. Bagby. A resolution on foreign missions was offered by F. R. Underwood. Discussed by D. A. Christian, J. M. Pilcher, R W. Cridlin, C. F. James, and adopted. Report on family worship was read bv J. J. Spencer, and it was discussed by L. R Thornhill, W. C. Foster, J. W. Reams, F. R Under wood, J. M. Pilcher, W. J. Sadler, and adopted. Committee on order of business completed their report as follows  1. At 9.30 tomorrowDevotional exercises. 2. Education. 3. Report on orphanage. 4. Report on condition of the ohurches. 5. Miscellaneous. A resolution was offered to do away with dinner on the ground,but was voted down. A resolution was offered by W. J. Sadler that the clerk have six hun dred copies of the minutes of this session printed, and that said clerk be paid 20.00 for his services. Adopted. Association adjourned."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "W", "J", "W"], "snippet": "discussed by L. R <mark>Thornhill</mark>, <mark>W</mark>. C. Foster, <mark>J</mark>. <mark>W</mark>. Reams, F. R"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "W", "J", "W"], "snippet": "discussed by L. R <mark>Thornhill</mark>, <mark>W</mark>. C. Foster, <mark>J</mark>. <mark>W</mark>. Reams, F. R"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.1, 656.81, 1801.7, 784.11], "bbox_id": "3caa163c28", "file": "AppomattoxNewspapers_1926-1933a_0449.pdf", "page": 1, "text": "The following brothers and sisters survive Rev. L. R. Thornhill, o f W ashington Thomas J. Thornhill, of K ansas City, Mo. C. W. Thornhill, of Bent Creek Mrs. E. C. Jam es, of Roanoke, and Mrs. D. A. Christian, of Appomottox. Funeral services w ere held from his home a t Tow er Hill yesterday."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill"], "snippet": "R. Thornhill, o f <mark>W</mark> ashington Thomas <mark>J</mark>. <mark>Thornhill</mark>, of K ansas City,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill"], "snippet": "R. Thornhill, o f <mark>W</mark> ashington Thomas <mark>J</mark>. <mark>Thornhill</mark>, of K ansas City,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [420.69, 1424.66, 579.01, 1486.51], "bbox_id": "9569bc8158", "file": "AppomattoxNewspapers_1926-1933a_0393.pdf", "page": 1, "text": "Mr. W. W. Thornhill and Mr. J. W. Dixon were visitors of Rev. E. F. Burnett Sunday at Vera. Mr. and Mrs. W. A. Wells"}, "highlight": {"text": {"matched_tokens": ["W", "W", "Thornhill", "J", "W", "W"], "snippet": "Mr. <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mr. <mark>J</mark>. <mark>W</mark>. Dixon were visitors of Rev. E. F. Burnett Sunday at Vera. Mr. and Mrs. <mark>W</mark>. A. Wells"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "W", "Thornhill", "J", "W", "W"], "snippet": "Mr. <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark> and Mr. <mark>J</mark>. <mark>W</mark>. Dixon were visitors of Rev. E. F. Burnett Sunday at Vera. Mr. and Mrs. <mark>W</mark>. A. Wells"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [401.05, 1272.51, 566.5, 1771.66], "bbox_id": "59a62e7951", "file": "AppomattoxNewspapers_1926-1933a_0446.pdf", "page": 1, "text": "Mr. Elwood O. Harris, young est son of Mr. John Harris died October 4th, 1928, at Staunton, Va. Remains were brought lome and hurried i n family cemetery, Saturday evening in the presence of a host of friends and relatives. Rev. Burnett conducted burial services. Songs were led by Mr. K. Megginson. Pall bearers were Messrs. E. A. Baldwin, L. M. Thornhill, J. K. Megginson, W- A. Jamer- son, H. C. Thornhill, Robert Booker, L. R. Marks, J. W. Gun ter, F. T. Thornhill and S. A. Thornhill. Flower girls Misses Bessie and Thelma Gunter, Florence Grove, Vivian Thorn hill, Daisy Robertson, Cardie Childress, Della Robertson, Elsie Jamerson. He leaves his father and fol lowing sisters and brothers Mrs. Lilia Thornhill, Mrs. Edgar Bald win, Miss Callie Harris and Messrs. Branch Pinkil, Lewis and Lawrence Harris all of this county. Elwood was a member of Lib erty Chapel Baptist church and his young life was spent in Christian attitude, as he loved his church and Sunday School and as long as able he was pres ent Just before he was taken to the hospital he was heard to sing several o f his favorite hymns and pleading with love I ones to meet him on the other  shore. Friends and school mates"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "A. Baldwin, L. M. <mark>Thornhill</mark>, <mark>J</mark>. K. Megginson, <mark>W</mark>- A. Jamer- son, H."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "A. Baldwin, L. M. <mark>Thornhill</mark>, <mark>J</mark>. K. Megginson, <mark>W</mark>- A. Jamer- son, H."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [400.1, 1253.75, 559.81, 1431.55], "bbox_id": "ed8a79e0dd", "file": "AppomattoxNewspapers_1908-1909a_0446.pdf", "page": 1, "text": "Mr- Elwood O- Harris, young est son of Mr. John Harris died October 4th, 1928, at Staunton, Va. Remains were brought home and burned i n family cemetery, Saturday evening in the presence of a host of friends and relatives. Rev. Burnett conducted burial services. Songs were led by Mr. J. K. Megginson. -  - - Pall bearers were Messrs. E- A. Baldwin, L. M. Thornhill, J. K. Megginson, W- A. Jamer- son, H. C. Thornhill, Robert"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "A. Baldwin, L. M. <mark>Thornhill</mark>, <mark>J</mark>. K. Megginson, <mark>W</mark>- A. Jamer- son, H."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "A. Baldwin, L. M. <mark>Thornhill</mark>, <mark>J</mark>. K. Megginson, <mark>W</mark>- A. Jamer- son, H."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [396.5, 645.35, 557.35, 1204.5], "bbox_id": "d63e3ae864", "file": "AppomattoxNewspapers_1908-1909a_0446.pdf", "page": 1, "text": "Most ofus love fall of year, but this seems to be a sad fall  so many deaths. Mr. Elwood Harris died at ! taunton, Va., Wednesday. Oh Sunday Mr. J. H. Thorn- lills grandson, Mr. Reed Spig- gle, died at his home near Glad stone and was hurried near here Sunday P. M. Tuesday Mr. Tyree died near lent Creek and was hurried Wednesday near his home. News was brought to Mrs. W. A. Wells that her cousin, Mrs. lettie Phelps, died , a t her daughters, Mrs. Janey Burks, today. Burrial was at Maple Grove church Wednesday. Mr. W. W. Thornhills Sunday guests were Mr, and Mrs. Tom dorris, Mrs. Jim Spiggle, Mr. W. 0. Thornhill, Mr. J. R- hornhill and wife and Mr. and drs. Ragland, all of Lynchburg. Mr. John Spiggle and his six grown sons spent Sunday night with his sister, Mrs. W. W. hornhill  Farmers are all busy saving their feed  a little frost hut nothing bitten yet some are ready to seed wheat, others get ting ready. Oposum hunting seems to- be the night game now, horns and lounds are heard in all direc tions, and right many have been caught Chatman Carroll, a respect able and honorable colored man, who died at Petersburg Ofctber 3rd in the 63 year of his age and was brought home and hurried the 6th. He was an employee of the C  O R. R. near Green way for more than 30 years."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mrs. Jim Spiggle, Mr. <mark>W</mark>. 0. <mark>Thornhill</mark>, Mr. <mark>J</mark>. R- hornhill and wife"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mrs. Jim Spiggle, Mr. <mark>W</mark>. 0. <mark>Thornhill</mark>, Mr. <mark>J</mark>. R- hornhill and wife"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [398.42, 663.37, 560.3, 1254.53], "bbox_id": "fe1a796842", "file": "AppomattoxNewspapers_1926-1933a_0446.pdf", "page": 1, "text": "Most of us love fall of year, but this seems to be a sad fall  so many deaths. Mr. Elwood Harris died at Staunton, Va.. Wednesday. On Sunday Mr. J. H. Thorn- lills grandson, Mr. Reed Spig- gle, died at his home near Glad stone and was hurried near here Sunday P. M. Tuesday Mr. Tyree died near lent Creek and was hurried Wednesday near his home. News was brought to Mrs. W. A. Wells that her cousin, Mrs. Jettie Phelps, died a t her daughters, Mrs. Janey Burks, today. Burrial was at Maple Grove church Wednesday. Mr. W. W. Thornhills Sunday guests were Mr. and Mrs. Tom dorris, Mrs. Jim Spiggle, Mr. W. 0. Thornhill, Mr. J. R homhill and wife and Mr. and drs. Ragland, all of Lynchburg. Mr. John Spiggle and his six grown sons spent Sunday night with his sister, Mrs. W. W. homhill. Farmers are all busy saving their feed  a little frost but nothing bitten yet some are ready to seed wheat, others get ting ready. Oposum hunting seems to be the night game now, horns and lounds are heard in all direc tions, and right many have been caught Chatman Carroll, a respect able and honorable colored man, who died at Petersburg Octber 3rd in the 53 year of his age and was brought home and burned the 5th. He was an employee of the C  O R. R. near Green way for more than 30 years.   - o  ------ Elwood O. Harris"}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mrs. Jim Spiggle, Mr. <mark>W</mark>. 0. <mark>Thornhill</mark>, Mr. <mark>J</mark>. R homhill and wife"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mrs. Jim Spiggle, Mr. <mark>W</mark>. 0. <mark>Thornhill</mark>, Mr. <mark>J</mark>. R homhill and wife"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 842.21, 1837.31, 924.66], "bbox_id": "b00876b323", "file": "AppomattoxNewspapers_1892-1898a_0427.pdf", "page": 1, "text": "Drs. Dew and J . H . Abbitt. as sisted by Drs. Thornhill, W. II., and J . B. Abbitt performed a te dious operation upon Mr. Joseph OConnor last week, and we are pleased to announce that the patient will soon be out again."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "W", "J"], "snippet": "as sisted by Drs. <mark>Thornhill</mark>, <mark>W</mark>. II., and <mark>J</mark> . B. Abbitt performed a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "W", "J"], "snippet": "as sisted by Drs. <mark>Thornhill</mark>, <mark>W</mark>. II., and <mark>J</mark> . B. Abbitt performed a"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [558.01, 898.26, 723.33, 1404.84], "bbox_id": "8309361ae8", "file": "AppomattoxNewspapers_1892-1898a_0407.pdf", "page": 1, "text": "Democratic Mass-Meeting. At a meeting held iu the Court House on Thursday last for the pur pose of nominating District officers to be voted for at the coming elect ion, May 27th, it wus moved that Dr. D. Mott Robertson be made chair mau and F. W. McKinney, secretary The county then divided up in districts and repaired to the ante-rooms, aud after some de liberation reported the foRowing nominations to the mass-meeting. OLOVE.I HILL DISTRICT. SupervisorW. H. Ligon. Con stableF. W. McKinney. . Justices W. J. Treut, W. D. Hix, U. H. Beale. Overseer poorE. E. Chism. STONE WALL DISTRICT. SupervisorS. C. Stratton. Con stableH. C. Babcock. Justices- J. W. Davidson, N. W. Owen, J. S. Thornhill OverseerG. L. Fer guson. SOUTH SIDE DISTRICT. SupervisorJ. C. Jones. Con stableA. H. Abbitt. Justices- Juo. T. Lee, Simeon Harvey, Lamech Jones. Overseer poorS. E. How erton. Themassmeeting was well-attended aud the tiominees are all good strong meu. They pledged themselves to the service of the party by accepting the nominations and will all makej an effort to get out the full vote of the party on Thursday May 27tb. The offices have been well distributed over the county and good true men selected to fill them. Now, je sore that you do your duty and each of them will be elected."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill"], "snippet": "J. W. Davidson, N. <mark>W</mark>. Owen, <mark>J</mark>. S. <mark>Thornhill</mark> OverseerG. L. Fer guson."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill"], "snippet": "J. W. Davidson, N. <mark>W</mark>. Owen, <mark>J</mark>. S. <mark>Thornhill</mark> OverseerG. L. Fer guson."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [420.7, 1320.97, 902.82, 1465.4], "bbox_id": "346eed736c", "file": "AppomattoxNewspapers_1908-1909a_0393.pdf", "page": 1, "text": "ANNOUNCEMENT The Stratton Mill after hav mg been out of commission fo r _ BBi pacn usnnuivu some time is now prepared to 1 prominent sportswomen from ms grind corn and can make first-1 hunters have notified class meal. Satisfaction guar-1 captain Gasklll that theijr expect I . . -s_ - ---- hare narf ifiMM. If Mr. W. W. Thornhill and Mr. J. W. Dixon were visitors of Rev. E. F. Burnett Sunday at Vera. ______  _ Mr- nnii M ps . -W. -A. -Wfillft"}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "ifiMM. If Mr. W. <mark>W</mark>. <mark>Thornhill</mark> and Mr. <mark>J</mark>. <mark>W</mark>. Dixon were visitors"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "ifiMM. If Mr. W. <mark>W</mark>. <mark>Thornhill</mark> and Mr. <mark>J</mark>. <mark>W</mark>. Dixon were visitors"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2076.49, 515.05, 2241.08, 1154.09], "bbox_id": "4bc804f6c8", "file": "AppomattoxNewspapers_1912-1915a_0108.pdf", "page": 1, "text": "Tower, Hill. After a long silence I onoe more endeavor to you a few items. We have had each a pretty January and February the farmers have been doing a lot of plowing. There is a great deal of sick ness in our neighborhood and the dootors are kept busy. Mr. Tom Beal has been quite sick w ith lagrippe, bat is now able to be around. Mrs. John Harris, who was confined to her bed for some weeks, is able to walk around Mr. and Mrs. Alonza Wells1 are on the sick list again. There has been consiOerable moving in our neighborhood efore and since Xmas. Mr. Willie Beal has moved to Mr Sam Meggensons, Mr H. C. Doss has moved near Liberty- Chapel Oburoh, Mr. Branch la m s and Mr. Lee Thornhill lave moved to J . W. Dixons !arm, Mrs. Kate Carter has moved to Roanoke, and Mr. Mnk Harris has moved in Mrs. Carters house. Miss Fannie Dixon spent last Saturday and Sunday with !riends at Norwood, in Nel son County. Mr. Leonard Thornhill has been quite siok for about a week. He was attended by Dri Christian and is now some what better, Mr. Robert Thornhill, of Lynchburg, paid his home peo pie a short visit last week. Miss Effie J. Wells, of Appo mattox, and Mr. Howard Cash, of Lynchburg, were married in Lynchburg the 25th of Febru ary. Messrs. J. W. Dixon and Leonard Thornhill are in Lynchburg this week."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "s and Mr. Lee <mark>Thornhill</mark> lave moved to <mark>J</mark> . <mark>W</mark>. Dixons !arm, Mrs. Kate"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "s and Mr. Lee <mark>Thornhill</mark> lave moved to <mark>J</mark> . <mark>W</mark>. Dixons !arm, Mrs. Kate"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [414.48, 254.11, 576.6, 898.12], "bbox_id": "4e7495cc3b", "file": "AppomattoxNewspapers_1898-1902a_0260.pdf", "page": 1, "text": "To th e V oters of Campbell. Whereas a card purporting to le signed by a number of citizens of Appomattox in reply to the address of the Executive Committee of said county appeared in the News-Herald which reflects upon this committee and each member of it, in insinua ting that the ten gentlemen wln constitute it are the tools of and con trolled by two of its members, who happeu to be the Chairman and Secretary, and in saying, that every thing also is a pure nd simple system of studied fabrication manufactured solely for electioneering purposes i misrepresent, to mislead and to de ceive and whereas we do not be lieve that the parties who signed i did so knowing what its con tent.- was or intending to reflect upon this committee or any member of it by signing a paper so utterly without regard to the truth of th, case, therefore, Be it resolved, That this com mittee reaffirms every statemeni contained in said address and vouches the truth thereof that in a meeting held this the 1st day ot November, 1899, iu which every member is present, we state that tin publication of said address was au thorized by us and we today unani mously ratify it and endorse its publication and that we do not, be lieve that the parties whose names appear on said card authorized their names to be signed thereto, but that their names were placed there without their authority. S. L. Ferguson, Chairman Jas. B. Abbitt, Secy. W. H. Ligon, J. C. Jones, A. H. Howerton, W. J. Trent, S. C. Stratton, W. C. Abbitt, J. W. Clark, A. B. Thornhill, S. J. Lee."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "Stratton, W. C. Abbitt, <mark>J</mark>. <mark>W</mark>. Clark, A. B. <mark>Thornhill</mark>, S. <mark>J</mark>. Lee."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "Stratton, W. C. Abbitt, <mark>J</mark>. <mark>W</mark>. Clark, A. B. <mark>Thornhill</mark>, S. <mark>J</mark>. Lee."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [894.2, 249.98, 1051.75, 378.08], "bbox_id": "0232a2a999", "file": "AppomattoxNewspapers_1898-1902a_0346.pdf", "page": 1, "text": "There will be a meeting of the County Democntin Executive Com mittee at 4 oclock p . if-, on Thurs day, September 6th, 1900, Court Day, at Appomattox Court House. The following gentlemen compose said Committee J. C. Jones, A. H. Howerton, S. J. Lee, J. W. Clark, W. H. Ligon, W. J. Trent, A. B. Thornhill, VV. C. Abbitt and S. 0. Stratton. 8. L. Ferguson, Chairman. J. B. Abbitt, Secretary."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill"], "snippet": "Clark, W. H. Ligon, <mark>W</mark>. <mark>J</mark>. Trent, A. B. <mark>Thornhill</mark>, VV. C. Abbitt and"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill"], "snippet": "Clark, W. H. Ligon, <mark>W</mark>. <mark>J</mark>. Trent, A. B. <mark>Thornhill</mark>, VV. C. Abbitt and"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.25, 1181.07, 1883.14, 1299.61], "bbox_id": "84f7e47c85", "file": "AppomattoxNewspapers_1905-1912a_0367.pdf", "page": 1, "text": "The Farmers Union held largely attended picnic at Rose Bower school boose on the 4th of July. Fine speeches were made by J. IT. Cawthorn, Jr., Major J. W. Flood, A. B. Thornhill and A. L. Male he tt. Table 40 feet long was filled with fine prov sions and the farmers, wives and babies had ! glorious 4th."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "IT. Cawthorn, Jr., Major <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark> and A. L. Male"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "IT. Cawthorn, Jr., Major <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark> and A. L. Male"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.53, 1188.49, 1881.17, 1306.78], "bbox_id": "a02b91f7b8", "file": "AppomattoxNewspapers_1905-1912a_0366.pdf", "page": 1, "text": "The Farmers Union held a largely attended picnic at Rose Bower school house on the 4th of July. Fine speeches were made by J. W. Cawthorn, Jr., Major J. W. Flood, A. B. Thornhill and A. L. Matcbett. Table 40 feet long w filled with fine prov sions and the farmers, wives and babies had f glorious 4th."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "W. Cawthorn, Jr., Major <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark> and A. L. Matcbett."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "W. Cawthorn, Jr., Major <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark> and A. L. Matcbett."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.81, 554.77, 1786.69, 784.11], "bbox_id": "27f3e72a79", "file": "AppomattoxNewspapers_1922-1923a_0355.pdf", "page": 1, "text": "The big closing out sale at l. W Myers is still in progress. You cant afford to miss it.. His new fall stock is being opened up daily looking np Bob White and i amity L nd 18 BQjd a, B08t The reason foi but few have had any succes. Messrs. tlji8 8 Myers is going to D. J. Walker and ,W. D. Thornhill, retjrP fom ti,e ci0thing busine with the help of their fire and I aaj 8 making prices to move the faithful dog succeeded in kllln8 Ltock. They will not last long at 44 birds, 18 rabbitts 4 squirrells I prceB jje j3 putting oo h8 en- and a fat fox. Why birds so scarce tjre 8tJCjc phe time to buy is now is something of a mystery as great rpe pjace j8 u, Myers, 828 numbers were seen after hatching Main g.reet, Lynchburg, Va. The time. I reaBon is nrices are at and below Mr. and Mrs. W. D. Thornhill of Bluefield, W. Va., and M r.. D. J. Walker of Bnffslo Forge, Rock- bridg.- Co, Va. are visiting relatives n the neighborhood."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "is going to D. <mark>J</mark>. Walker and ,<mark>W</mark>. D. <mark>Thornhill</mark>, retjrP fom ti,e ci0thing"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "is going to D. <mark>J</mark>. Walker and ,<mark>W</mark>. D. <mark>Thornhill</mark>, retjrP fom ti,e ci0thing"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [526.54, 1215.38, 651.29, 1318.26], "bbox_id": "e34e9b4a81", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "STONEWALL PRECINCT. S C Stratton, J R Horsley, W Drinkard, J D Martin, G E Drinkard, E M Stratton, II H Stratton, W S Taylor, J S Thornhill,"}, "highlight": {"text": {"matched_tokens": ["J", "W", "J", "W", "J", "Thornhill"], "snippet": "STONEWALL PRECINCT. S C Stratton, <mark>J</mark> R Horsley, <mark>W</mark> Drinkard, <mark>J</mark> D Martin, G E Drinkard, E M Stratton, II H Stratton, <mark>W</mark> S Taylor, <mark>J</mark> S <mark>Thornhill</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "J", "W", "J", "Thornhill"], "snippet": "STONEWALL PRECINCT. S C Stratton, <mark>J</mark> R Horsley, <mark>W</mark> Drinkard, <mark>J</mark> D Martin, G E Drinkard, E M Stratton, II H Stratton, <mark>W</mark> S Taylor, <mark>J</mark> S <mark>Thornhill</mark>,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["J", "Thornhill", "W"], "snippet": "Jones, Edward Woodson, T. <mark>J</mark>. <mark>Thornhill</mark>, David A. Christian, <mark>W</mark>. C. Franklin, H. D."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Thornhill", "W"], "snippet": "Jones, Edward Woodson, T. <mark>J</mark>. <mark>Thornhill</mark>, David A. Christian, <mark>W</mark>. C. Franklin, H. D."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2203.06, 256.08, 2344.38, 316.11], "bbox_id": "a12b3da495", "file": "AppomattoxNewspapers_1962-1965a_0386.pdf", "page": 1, "text": "Members of the Grand Jury are W. S. Jones, Forem an D. A. Conner, E . Irving Bingham, Curtis Blackwell, J . L. Thornhill R. J . Franklin, and W. C. Dud ley."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill", "J", "W"], "snippet": "Members of the Grand Jury are <mark>W</mark>. S. Jones, Forem an D. A. Conner, E . Irving Bingham, Curtis Blackwell, <mark>J</mark> . L. <mark>Thornhill</mark> R. <mark>J</mark> . Franklin, and <mark>W</mark>. C. Dud ley."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill", "J", "W"], "snippet": "Members of the Grand Jury are <mark>W</mark>. S. Jones, Forem an D. A. Conner, E . Irving Bingham, Curtis Blackwell, <mark>J</mark> . L. <mark>Thornhill</mark> R. <mark>J</mark> . Franklin, and <mark>W</mark>. C. Dud ley."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.65, 552.34, 2081.73, 1226.99], "bbox_id": "f6f2dd65ec", "file": "AppomattoxNewspapers_1912-1915a_0119.pdf", "page": 1, "text": "KNOW PAINT Theres a paint-education In thla advertise ment Buy by the job, not gallon. Bny by the paint put-on that the job . . . The pr cenf painting Is so much a ration to com pare With tbe g reat that cant Be helped, but amount to nothing. floods in Ohio. W e ought to so thankful we still have our th_e .togel.hSr H?w Gan you do it? our homes tmd -loved ones spared us. Q uite a crowd from W ing fields Mill spent E aster Moo- day on Cub Creek fishing some for minnovgfl, some for whales, but the gi.eatest success seemed accomplished on dry land. All spent a very pleasant . Easter. Mr. C ourtney,, from .Lynch burg, visited .his hom e peope Saturday and Sunday. Mr. A. W . Childress spent a few days in th is neighborhood last week visiting relatives. Miss X ate W atkins, from the State Norm al in Farm ville Mr. Clifton Potts, of Petersburg Mr. Stanley Potts, Miss God- sey and Miss Maud L. W at kins, of C hurch Roads, were the guest of Miss M. Louise W ingfield E aster. M iss M aud W atkins expects to spend a few weeks with her B. F. I. school-mate, Miss M. L Wingfield. There have been several card parties in the neighborhood in honor of Miss W atkins. Mrs. J. L. Thornhill, Mr- V in cent Thornhill, Mr. Courtney and Miss Elizabeth W ingfield, all of Lynchbugg, w ill spend the week end w ith homepeople. Mr. Oscar Coles, of A ppom at tox, visited friends in Charlotte Sunda and M onday. Mrs. G. T. F arrar has been very sick, b u t is rig h t much better. Miss M attie is improv ing slowly. H er m any friends hqpe to see her up again soon. Mrs. Gertrude P aulette from Lynchburg was the guest of her brother, Mr. A. C. W heeler, lapt week. T he wedding bplls w ill soon ring ia this vicinity."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill"], "snippet": "in honor of Miss <mark>W</mark> atkins. Mrs. <mark>J</mark>. L. <mark>Thornhill</mark>, Mr- V in cent"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill"], "snippet": "in honor of Miss <mark>W</mark> atkins. Mrs. <mark>J</mark>. L. <mark>Thornhill</mark>, Mr- V in cent"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2038.3, 1367.19, 2206.43, 1546.64], "bbox_id": "490aac117d", "file": "AppomattoxNewspapers_1943-1947a_0003.pdf", "page": 1, "text": "Honorary pallbearers were Will Chick, C. J. Harding, J. D. David son, G. O. Thornhill, W. T. Cald well, J O. Davidson, P. H. Moore, R, B. Hudgins, Dr. D. A. Christian! B. W. Hamilton, R. W. Stanley, R. L. Burke, A. R. Harwood and H. M. Burge. Active paTlbearers were Allen Chick, Marvin Drinkard.Cly.le Carson, Elliott Carson, Parks Jen nings and Tom Davidson. Mrs. Carson is survived by the following children Mrs. Thomas L. Christian, of Covington Mrs. Lyle F. Caldwell and Mrs. David W. Cawthorne, of Newark, N. J. Mrs. Robert H. Thornhill and Carey E. Carson, of Appomattox and Eu gene W. Carson, of Rocky Mount."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "W", "J"], "snippet": "David son, G. O. <mark>Thornhill</mark>, <mark>W</mark>. T. Cald well, <mark>J</mark> O. Davidson, P. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "W", "J"], "snippet": "David son, G. O. <mark>Thornhill</mark>, <mark>W</mark>. T. Cald well, <mark>J</mark> O. Davidson, P. H."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2142.45, 1051.39, 2312.7, 1215.24], "bbox_id": "a3fb68ee26", "file": "AppomattoxNewspapers_1939-1943a_0350.pdf", "page": 1, "text": "Honorary pallbearers were W. W. Thornhill, S. N. Thornhill, J. H. Rey nolds, J. P. Coleman, C. A. Carter and F. J. Smith, deacons of Liberty Chapel Baptist church and Lewis Morgan, John Morgan, Ernest Mor gan, A. T. Pearson, Rev. W. A. Haw ley, Rev. E. R. Ferguson, Rev. J. S. Rushing, Rev. J. S Cbb, Rev. T. P. Reynolds, Rev. W. M. Black, Judge Jo-1 Flood, R L. Burke, Jerry Burke, Dr. D. A. Christian, Dr. C. G. OBrien, T. H. Roberson, C. W. Smith, Dr. Chas. F. James, H. M. Burge, W. M. Morris, L. J. Morris, J. C. Lee, F. A. OBrien, C. L. Cole man, N. R. Featherston, Chas. T. Moses and E. LeRoy Smith."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "Thornhill"], "snippet": "Honorary pallbearers were W. <mark>W</mark>. <mark>Thornhill</mark>, S. N. <mark>Thornhill</mark>, J. H. Rey nolds, J."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "Thornhill"], "snippet": "Honorary pallbearers were W. <mark>W</mark>. <mark>Thornhill</mark>, S. N. <mark>Thornhill</mark>, J. H. Rey nolds, J."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [564.02, 395.73, 728.53, 906.17], "bbox_id": "1a40a9898e", "file": "AppomattoxNewspapers_1926-1933a_0437.pdf", "page": 1, "text": "Funeral services for Thomas Harvey, Confederate veteran, who had lived his entire life of 94 years in Appomattox county, were held at his home at Rose Bower, Monday, with interment in the family burying ground. Rev. T. E. Goad of Hollywood Baptist church, assisted by Revs. W. M. Thompson of Appomat tox, A. I. Caudle of Spout Spring, G. A. Chocklett of Dillwyn, and E. F. Burnett of New Hope Bap tist churches conducted services. A quartet sang hymns at the home and at the grave. Five Confederate Veterans from Carland-Rodes Camp, of which he was a member, attend ed. They were Commander W. C. Wood, Captain A. E. Wood, S. P. Rucker, T. H. Lakes and H. F. Sly. Honorary pall-bearers were A. R. Harwood, T. F Coleman, Charles Lewis, Walt McKinney, B. P. Thornhill, J. C. Woodson, H. W. McKinney, A. H. Clement Jesse Franklin, James Morris, James Covington and Dr. D. A. Christian. Active pall-bearers wereJohn, Joel, Thomas and Lewis Harvey, Harvey Morris a n d Norvell Woody. Flower bearers were Misses Ada, Mary, Davis, Mildred and Alma Harvey Betty Jane Hay den, Margie Woodson and Mar garet Gilliam and Mesdames Eva Hayden, Helen Welch, Joel Harvey, Lewis Harvey and Har vey Morris and Jimmie Harvey."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "Walt McKinney, B. P. <mark>Thornhill</mark>, <mark>J</mark>. C. Woodson, H. <mark>W</mark>. McKinney, A. H. Clement"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "Walt McKinney, B. P. <mark>Thornhill</mark>, <mark>J</mark>. C. Woodson, H. <mark>W</mark>. McKinney, A. H. Clement"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [405.57, 375.17, 725.15, 883.91], "bbox_id": "90fd86d92b", "file": "AppomattoxNewspapers_1908-1909a_0437.pdf", "page": 1, "text": "Funeral services for Thomas Harvey, Confederate veteran who had lived his entire life o 94 years in Appomattox county, were held at his home at Rose Bower, Monday, with interment in the fam ily burying ground Rev. T. E. Goad  of Hollywoo Baptist church, assisted by Revs W. M. Thompson of Appomat tox, A. I. Caudle of Spout Spring. G. A. Chocklett of Dillwyn, anc E. F. Burnett of New Hope Bap tist churches conducted services A quartet sang hymns at the home and at the grave. Five Confederate Veterans from Garland-Rodes Camp, o! which he was a member, attend ed. They were Commander W. G. Wood, Captain A. E Wood, S. P. Rucker, T. H. Lakes and H. F. Sly. Honorary pall-bearers were A. R. Harwood, T. F Coleman, Charles Lewis, Walt McKinney, B, P. Thornhill, J. C. Woodson, H. W. McKinney, A. H. Clement Jesse Franklin, James Morris Jam es Covington and Dr. D. A Christian.  Active pall-bearers wereJohn, Joel, Thomas and Lewis Harvey, Harvey Morris a n d Norvell Woody. Flower bearers were M isses Ada, Mary, Davis, Mildred and Alma Harvey Betty Jane Hay- Paulett and son of den, Margie Woodson and Mar- ynchburg, are visiting relatives garet Gilliam and Mesdames Eva Hayden, Helen Welch, Joel Harvey, Lewis Harvey and Har vey Morris and Jimmie Harvey."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "Walt McKinney, B, P. <mark>Thornhill</mark>, <mark>J</mark>. C. Woodson, H. <mark>W</mark>. McKinney, A. H. Clement"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "Walt McKinney, B, P. <mark>Thornhill</mark>, <mark>J</mark>. C. Woodson, H. <mark>W</mark>. McKinney, A. H. Clement"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1927.18, 388.0, 2086.32, 845.08], "bbox_id": "ee53e0dc0a", "file": "AppomattoxNewspapers_1915-1918a_0484.pdf", "page": 1, "text": "F ffie ra l o f F ra n k L eG rand The funeral services of Frank Howard LeGrand, who died last Thursday the home of his sister, Mrs. J. S. Cooper, on the Boonsboro r ad, were held at the home of his parents on Clay street and conducted by Dr. Hamilton, pastor of the First Baptist church, assisted by Dr. Georgtf E. Booker, of Court Street.  The interm ent took place in Spring Hill cemetery. The pallbearer were Messrs John 8 . Moon, A. S. Nowlin, 8 N. Overton, J. Tr Barnes, Lu ther B LeGrand ami J. T. Thornhill. The floral designs were nu merous and beautiful and were borne to the g ra te - by, the fol lowing friends Messrs W. H. Nowlin, R.C. Peters, A. H. Jen nings, J. W. LeGrand, C. O. Thornhill, J. M. Loving. Mr. LeGrand .was born in Appomattox county forty-four years ago, aud was the son of Mr. and Mrs. whmes D. Le Grand, of this nty, both of whom survive hiffi. He is also sutvived by two Ittle girts, be sides the following sisters and brothers Mrs. W . 8 . Taylor, Wilson, N. C. Ms. J. S. Coop er, Miss Reva LeGrand and Mr W. D. LeGrand, all of this city. Lynchburg Newls, 14th."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "A. H. Jen nings, <mark>J</mark>. <mark>W</mark>. LeGrand, C. O. <mark>Thornhill</mark>, <mark>J</mark>. M. Loving. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill", "J"], "snippet": "A. H. Jen nings, <mark>J</mark>. <mark>W</mark>. LeGrand, C. O. <mark>Thornhill</mark>, <mark>J</mark>. M. Loving. Mr."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.65, 1736.05, 2551.21, 1774.15], "bbox_id": "dbe2a56df5", "file": "AppomattoxNewspapers_1943-1947a_0057.pdf", "page": 1, "text": "Active pallbearers were Sam  hornhill, O. W. Thornhill, Ben Thornhill, H. C. Thornhill, W B. Jamerson and J. R. Thornhill."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "Thornhill", "Thornhill", "W", "J", "Thornhill"], "snippet": "Active pallbearers were Sam  hornhill, O. <mark>W</mark>. <mark>Thornhill</mark>, Ben <mark>Thornhill</mark>, H. C. <mark>Thornhill</mark>, <mark>W</mark> B. Jamerson and <mark>J</mark>. R. <mark>Thornhill</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "Thornhill", "Thornhill", "W", "J", "Thornhill"], "snippet": "Active pallbearers were Sam  hornhill, O. <mark>W</mark>. <mark>Thornhill</mark>, Ben <mark>Thornhill</mark>, H. C. <mark>Thornhill</mark>, <mark>W</mark> B. Jamerson and <mark>J</mark>. R. <mark>Thornhill</mark>."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1807.18, 342.77, 1979.13, 381.57], "bbox_id": "f571c6f76e", "file": "AppomattoxNewspapers_1949-1952a_0060.pdf", "page": 1, "text": "Abingdon spent several days last j week with W. W. Thornhill. Mrs.  -hoinhill remained to visit her sis-  ter, Mrs. Walker Garrett."}, "highlight": {"text": {"matched_tokens": ["j", "W", "W", "Thornhill"], "snippet": "Abingdon spent several days last <mark>j</mark> week with <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>. Mrs.  -hoinhill remained to visit her sis-  ter, Mrs. Walker Garrett."}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "W", "Thornhill"], "snippet": "Abingdon spent several days last <mark>j</mark> week with <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>. Mrs.  -hoinhill remained to visit her sis-  ter, Mrs. Walker Garrett."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [580.28, 1328.35, 738.14, 1360.9], "bbox_id": "9a3d3d1fd1", "file": "AppomattoxNewspapers_1892-1898a_0469.pdf", "page": 1, "text": "a v e rte d . Passed unanimously. J. W. Flood, A. B. Thornhill, Chairman. Secretary."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "a v e rte d . Passed unanimously. <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark>, Chairman. Secretary."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "a v e rte d . Passed unanimously. <mark>J</mark>. <mark>W</mark>. Flood, A. B. <mark>Thornhill</mark>, Chairman. Secretary."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1767.55, 426.53, 1934.95, 535.18], "bbox_id": "0fab87b120", "file": "AppomattoxNewspapers_1952-1954a_0540.pdf", "page": 1, "text": "Week-end visitors of Mr. and Mrs. W. W. Thornhill were Mr. and Mrs. J. R. Thornnill and Bob by Thornhill, of Roanoke Mr. and Mrs. H. C. Thornhill and Mrs. Sallie Jamerson, of Lynchburg Mr. and Mrs. Sam Thornhill, Mr. and Mrs. Paul Thornhill, Don, Mildred Ann and Alice Faye Lewis Mann, Miss Laura Thornhill and Miss Shelby Jean Harris."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mr. and Mrs. W. <mark>W</mark>. <mark>Thornhill</mark> were Mr. and Mrs. <mark>J</mark>. R. Thornnill and Bob"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "Mr. and Mrs. W. <mark>W</mark>. <mark>Thornhill</mark> were Mr. and Mrs. <mark>J</mark>. R. Thornnill and Bob"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.58, 835.16, 2297.06, 1154.99], "bbox_id": "92508f55fc", "file": "AppomattoxNewspapers_1933-1936a_0412.pdf", "page": 1, "text": "Thomas Megginson, 65 died at his home -near Liberty Ohapel,  tms county on Sunday night, March 15, He was the son of the late Jos eph C. and Sarah Spencer Meg ginson and was born September 6 1870. He spent his lifetime in Ap- oomattox ana was widely known as one of our most highly esteemed citizens.  , Funeral services were held on Monday at 3 P .M ., conducted by the Rev O. G. Burnett. Interment was in the family burying round. Active pallbearers were Walker Carnefix, Julian Grow North Rob ertson Terrel Megginson R- K. Leftwich and Thomas A.Garrette. Flow,er bearers were Jo-e, Eliza beth, and Jacqueline Megginson Mesdames Florence Mustain Annie Megginson Roth Robertson Bettie Leftwich and J . R . Booker. Honor ary pallbearers N.R.Featherston W W Thornhill T.E. Owen L. C.Hatcher J.- H.Reynolds? J.D. OBrien W. T. Childers M. R. Reynolds J  H- Carnefix Jeff Kinney R .W . Ab bitt R L. Burke C. W.Smith J.W.Flood T. P. Robertson W. R Reynolds D. A, Christian D. N.Twyman B.E. Megginson? J. W Scruggs C. E. Lewis T. J. Smith and H . W .McKinaiey."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "ary pallbearers N.R.Featherston W <mark>W</mark> <mark>Thornhill</mark> T.E. Owen L. C.Hatcher <mark>J</mark>.- H.Reynolds? J.D. OBrien <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J", "W"], "snippet": "ary pallbearers N.R.Featherston W <mark>W</mark> <mark>Thornhill</mark> T.E. Owen L. C.Hatcher <mark>J</mark>.- H.Reynolds? J.D. OBrien <mark>W</mark>."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [623.72, 256.1, 786.88, 492.85], "bbox_id": "e1f23b8321", "file": "AppomattoxNewspapers_1892-1898a_0069.pdf", "page": 1, "text": "SharonNo delegate. Mt. TaborNo delegate. MaysvilleJ. J. Spenper, B. A. Pearson, T. R Shaw, P. A. Grigg. Report on State missions was read by F. R Underwood and discussed by W. C. Foster, Wm. Ellyson, W. 13. Loving, and adopted. No report on Sunday School and Bible Board being presented, a reso lution was offered by W. C. Foster, which was adopted after being dis cussed by J. M. Pilcher, W J. Sad ler, L. R Thornhill and R. W. Crid lin. The moderator recognized Dr. Jones, of Danville, and invited him to a seat in the body. Committee on order of business made a further report"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Thornhill", "W"], "snippet": "by J. M. Pilcher, <mark>W</mark> <mark>J</mark>. Sad ler, L. R <mark>Thornhill</mark> and R. <mark>W</mark>. Crid"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Thornhill", "W"], "snippet": "by J. M. Pilcher, <mark>W</mark> <mark>J</mark>. Sad ler, L. R <mark>Thornhill</mark> and R. <mark>W</mark>. Crid"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [616.56, 519.04, 943.42, 669.44], "bbox_id": "f96bf4b133", "file": "AppomattoxNewspapers_1952-1954a_0153.pdf", "page": 1, "text": "Mr. and Mrs. P. B. Wright and daughter, Lynda, were visitors Sun day of Mr. and Mrs. Paul Thorn hill. The Hazel Moon Missionary Socie ty had a party at the home of Mr. A wise buy U. S. Savings Bonds, and Mrs. Percy Garrette Thursday night. A large crowd was present. Games were played, and gifts were exchanged. Those visiting in the home Satur day of W. W. Thornhill were Mr. and Mrs. J. R. Thornhill, of Roan oke. and Mr. and Mrs. H. C. Thorn-"}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J", "Thornhill"], "snippet": "Satur day of W. <mark>W</mark>. <mark>Thornhill</mark> were Mr. and Mrs. <mark>J</mark>. R. <mark>Thornhill</mark>, of Roan"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J", "Thornhill"], "snippet": "Satur day of W. <mark>W</mark>. <mark>Thornhill</mark> were Mr. and Mrs. <mark>J</mark>. R. <mark>Thornhill</mark>, of Roan"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1639.91, 353.71, 1831.58, 985.54], "bbox_id": "717ed4e233", "file": "AppomattoxNewspapers_1954-1955a_0177.pdf", "page": 1, "text": "Liberty Chapel, Jan. ..- Those vis iting recently in the home of Mr. and Mrs. Marvin Reynolds were Mr. and Mrs. Harry Phelps, Mr. and Mrs. Martin Ernst and family. Miss Cotelle Phelps, Gilbert Trujilla, Mrs. Florene Phelps, Bobby Phelps, and Miss Bettie Dale Robinson. Mrs. W. W. Thornhill is a patient at the Virginia Baptist Hospital. Others on the sick list are Mrs. Per cy Garrette, Mrs. J. H. Reynolds and p. W. Thornhill and Mrs. Richard Smith. We hope a speedy recovery to alL Supper guests Saturday of Mr. and Mrs. Paul Thornhill were Mr. and Mrs. Jessie Harvey Jr., and Miss Gloria Ann Lewis, of Lynchburg, Miss June Carol Conner, Mr. ana Mrs. Sam Thornhill, and Miss Laura Thornhill. Mr. and Mrs. Volney Garrotte and family, of Williamsburg were visit ing hie parents, Mr. and Mrs. Percy Garrette over the week-end Mr. and Mrs. Hunter Jamerson and Lyle Davidson visited Mr. ana Mrs. Marvin Reynolds .Sunday. Mr. and Mrs. Paul Thornhill, Don Mildred Ann, and Alice Faye, and Miss June Carol Conner visited Mr. and Mrs. Acree Devers, of Char lotte C. H. Sunday. Mr. and Mrs. Lyle Davidson and family and Garland Reynolds, of Columbus, Ohio visaed Mr nd Mrs- J. H. Reynolds several days of las week. 1 Mrs. Preston Coleman entertain ed her B. T. U. class Friday even ing in the home of Mr. and Mrs Paul Thornhill. They enjoyed game and fire works. Mr. and Mrs. B. C. Childers Clyde and Carolyn Mr. and Mrs. Sam Thornhill, d   Tue3day Thornhill were visitors on  f 3 y evening of Mr. and Mrs. John W. Gunter. Mr. and Mrs. Lawrence Hatcher entertained the Missiona Society Wednesday evening at their annual Christmas party. Mrs. B C. Chiiaer. and Mrs. Sam  f   H a t c h e r T P Leitner assisted Mrs. Hatcner games and sem ag feral.- Mr and Mrs. Marvin Reynolds"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "Per cy Garrette, Mrs. <mark>J</mark>. H. Reynolds and p. <mark>W</mark>. <mark>Thornhill</mark> and Mrs. Richard Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "Per cy Garrette, Mrs. <mark>J</mark>. H. Reynolds and p. <mark>W</mark>. <mark>Thornhill</mark> and Mrs. Richard Smith."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.71, 1456.19, 1835.07, 1483.98], "bbox_id": "324972bdb0", "file": "AppomattoxNewspapers_1943-1947a_0001.pdf", "page": 1, "text": "j Mr. and Mrs. W. A. Thornhill, of Bluefield have.been visiting Miss Patty Feai.horston."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Thornhill"], "snippet": "<mark>j</mark> Mr. and Mrs. <mark>W</mark>. A. <mark>Thornhill</mark>, of Bluefield have.been visiting Miss Patty Feai.horston."}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Thornhill"], "snippet": "<mark>j</mark> Mr. and Mrs. <mark>W</mark>. A. <mark>Thornhill</mark>, of Bluefield have.been visiting Miss Patty Feai.horston."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2150.62, 375.71, 2317.47, 415.76], "bbox_id": "7d3e19b7b7", "file": "AppomattoxNewspapers_1949-1952a_0554.pdf", "page": 1, "text": "Dinner guests Sunday of Mr. and Mrs. J. H. Reynolds were W. W. Thornhill, Miss Mildred Thornhill, and Mr. and Mrs. Frank Nuckol 3 ."}, "highlight": {"text": {"matched_tokens": ["J", "W", "W", "Thornhill", "Thornhill"], "snippet": "Dinner guests Sunday of Mr. and Mrs. <mark>J</mark>. H. Reynolds were <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Miss Mildred <mark>Thornhill</mark>, and Mr. and Mrs. Frank Nuckol 3 ."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "W", "Thornhill", "Thornhill"], "snippet": "Dinner guests Sunday of Mr. and Mrs. <mark>J</mark>. H. Reynolds were <mark>W</mark>. <mark>W</mark>. <mark>Thornhill</mark>, Miss Mildred <mark>Thornhill</mark>, and Mr. and Mrs. Frank Nuckol 3 ."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1407.1, 1108.06, 1567.2, 1202.01], "bbox_id": "c3fc150c1c", "file": "AppomattoxNewspapers_1912-1915a_0090.pdf", "page": 1, "text": "Among those attending the 4th Annual Convention of the Virginia Farmers Educational and Oo-opera tive Union, which is being held in Lynchburg this week, are A. B Thornhill, R. B. Bryant, and J . W Caw thorn, of this County, and Dr, G. L. Morris, of Buckingham."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "week, are A. B <mark>Thornhill</mark>, R. B. Bryant, and <mark>J</mark> . <mark>W</mark> Caw thorn, of this"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "week, are A. B <mark>Thornhill</mark>, R. B. Bryant, and <mark>J</mark> . <mark>W</mark> Caw thorn, of this"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [577.5, 1794.28, 727.09, 2003.08], "bbox_id": "fdb5e56d12", "file": "AppomattoxNewspapers_1898-1902a_0190.pdf", "page": 1, "text": "_ C O U N T Y O FFICER S, treasurer- D. Mott Robertson, 733.  AttocV. for the CommonwealthH. e A y P. Coleman, 761. Jgk of County and Circuit Courts EPeers. 42 J . K. Horsley. 13. JBpmmissioner o f the RevenueL , E. , 47Y H . C. Babcock, 404. D IST R ICT O F FIC E R S. S o u t h s id b D is t r ic t . PJr SupervisorJ . O. Jones. 229. For ConstableA . H . Abbitt, 232. For justicesJ . T .A ee, 187 Lantech Jones,-  j . R. H ill, 82 S. E . Howorton, 74 E. G. vey, 180, C 1 .OVKR--H 11 .L D is t r ic t . Ir SupervisorW . H . logon. 233. Er Constable-C. W. Inge, 126 for W. B. EfjustlcesP. M. Hannah. 167 William J. it 188 J- H. Forbes, 69 P. H. Fore, 184. overseerof PoorJ. W. Wright, 224. S t o h b w a ia , D is t r ic t . SupervisorS. c. Stratton, 234. fonstableH. C. Doss, 127 J. E. Chick, JusticesA. B. Thornhill, 141 J. C. 1 160- W C. Abbitt, 170 N. W. Owen, Vi! Stratton, 39 J. H. Thornhill, 38 kidson, 23."}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "E. Chick, JusticesA. B. <mark>Thornhill</mark>, 141 <mark>J</mark>. C. 1 160- <mark>W</mark> C. Abbitt, 170 N."}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "E. Chick, JusticesA. B. <mark>Thornhill</mark>, 141 <mark>J</mark>. C. 1 160- <mark>W</mark> C. Abbitt, 170 N."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2046.26, 780.92, 2218.21, 1521.3], "bbox_id": "1d28b3ae1d", "file": "AppomattoxNewspapers_1898-1902a_0709.pdf", "page": 1, "text": "Tower Hill. There have been so many nice, complimentary things said about the T imes sinoe it became an eight- page paper, that I have begun to think you will have to ohange cor respondents, so as to have things to match the paper. But I was only jesting. I think I know the A. aud B. Editor too well to believe that he would forsake old friends for new ones. We are quite satisfied with our present correspondents, end only wish that we had more like them. We are having lovely weather at present. Oar farmers are now done seediug wheat, and are gathering corn. The yield is somewhat .better ban was ones expected. Several have sold tobacco this fall, and have received satisfactory prices. Mr. L. M. Wright, of this place, and Mr. Barton, of Bedfordi have located at Rosebower for the pur pose of selling goods. Miss Alpha Featherston, who has charge of the Tower-Hill school, ia I making a good average and progress ing nicely, notwithstanding there arc several private schools within strik ing distance of this school. r. and Mrs. T. S. Beal spent the j last Saturday and Sunday of October with bis sister, Mrs. Jim Whitakei, who lives near Spout Spring. Mr. J. W. Dixon and his sister, Mies Ida, took their little niece Flor ence to visit her parents, Mr. and Mr. W. A. Dixon, and her grand mother, Mrs. Sallie Pankey, who live near Pamplin City, on the fourth Saturday, and returned on Monday. Mrs. T. R. Turner, of Lynchburg, returned on Friday last to her home  after a visit to friends and relatives in Appomattox.  Mr. W. P. Wells and sisters were visiting friends in Buckingham on Saturday and Sunday last  A oolored boyBernard Jones employed by Mr. Thomas Robertson,  was kicked in the face by a mule on Thursday last His jawbone was broken, and he was otherwise pain fully injured. Dr. Thornhill is at tending him.  Messrs. J. W. Dixon and Thomas Robertson expect to visit relatives Ad friends near Oak Ridge and Eimiugton, Nelson county, on Sat urday and Sunday next"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W"], "snippet": "pain fully injured. Dr. <mark>Thornhill</mark> is at tending him.  Messrs. <mark>J</mark>. <mark>W</mark>. Dixon and Thomas Robertson"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W"], "snippet": "pain fully injured. Dr. <mark>Thornhill</mark> is at tending him.  Messrs. <mark>J</mark>. <mark>W</mark>. Dixon and Thomas Robertson"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1794.25, 833.7, 1954.77, 1106.25], "bbox_id": "cafdff9106", "file": "AppomattoxNewspapers_1902-1905a_0552.pdf", "page": 1, "text": "this week visiting tbe home of Mr, T. J. Goodwin. Mrs.George Coleman, of Lynch burg, returned to her home on Sat urday. She had rendered invalua ble assistance in nursing her Bister, Mrs, Jessie Goodwin, the beloved wife of T. J. Goodwin, who died at her home ou Thursday, July 27th, in tbe 38th year of her age. Her disease was consumption. She had suffered for several years, but she bore her sufferings with patience and fortitude. Her remains were interred at her home on Friday, the 28th. She was borne to the grave by the following  pall bearers Messrs. J. C. Harris, Charley Carter, Charley Thornhill, Willie Gunter, H. C. Doss, J . W. Dixon, W. P. Weils, A. B. Thornhill, Tom Robin sou, W. D. Marks, Sam Megginson and Lee Thornhill. The burial"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "J", "W", "W"], "snippet": "Harris, Charley Carter, Charley <mark>Thornhill</mark>, Willie Gunter, H. C. Doss, <mark>J</mark> . <mark>W</mark>. Dixon, <mark>W</mark>. P. Weils,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "J", "W", "W"], "snippet": "Harris, Charley Carter, Charley <mark>Thornhill</mark>, Willie Gunter, H. C. Doss, <mark>J</mark> . <mark>W</mark>. Dixon, <mark>W</mark>. P. Weils,"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1559.06, 668.03, 1731.58, 1674.28], "bbox_id": "551cae8740", "file": "AppomattoxNewspapers_1912-1915a_0012.pdf", "page": 1, "text": "Sheriff McKinney, E. R. A b- bitt and Reuben B ryant had  been busy for several days ar-1 ranging a Farm ers Union picnic for Friday, A ugust 23rd, I at this place. I Early Friday morning the teams with trunks and baskets I began to arrive and by ton oclock about the time of the parade at least 1500 people were I thronging the streets. The town was turned over to the farm ers and they enjoyed the day in every way.  . The Farm ville Silver Band furnished splendid music for the occasion and our boys girls joined in the parade and the festivities of the occasion. President of the County Union, J. W . Cawthorn, Jr., introduced A. B. Thornhill, who spoke on the objects of the Union and welcomed the far mers, their wives and daugh ters and the visitors to the ele g an t dinner w hich was spread on the Court Green, Mr. F. A. LaBaume, Indus trial A gent of the N.  W . Ry., who had been invited to ad dress the farm ers, was intro duced by Mr. Thornhill, and made a very practical speech, interspersed by many am using jokes. He paid Appomattox a high com plim ent on her splen did enterprise, progress and commended especially the I great Work being done by Prof. Crawley in our fine Agricul tural College. He told the farm ers how to beautify their  homes and keep the boys on the farm. Mr. LaBaume is a good speaker and the large audience enjoyed his rem arks very much and no doubt w ill gather some inspiration there from fpr greater effort tow ards real progress. . President Ganaway, pf Cum berland, w ae present and made an address w hich was much enjoyed.  Btate Secretary D. M. Blank- inship, of Campbell County, was also present and m ade a good business talk to the far mers. The day was strictly a far m ers day and they are to be congratulated on the big suc cess of their picnic, and now we w ant to move that they m ake thefourth Friday in Au gust every year the annual picnic day of the Farm ers Union at Appomattox. The interest and attendance shows th at the Union is here to stay and th at the substantial saving which is being made to the farm ers in their respective Unions is worth the considera tion of those who are not mem bers. There were several m atch games of base ball played, and the entire day was given over to one of pleasure and social intercourse. Come again farm ers, and long live the Union."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Thornhill"], "snippet": "of the County Union, <mark>J</mark>. <mark>W</mark> . Cawthorn, Jr., introduced A. B. <mark>Thornhill</mark>, who spoke on the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Thornhill"], "snippet": "of the County Union, <mark>J</mark>. <mark>W</mark> . Cawthorn, Jr., introduced A. B. <mark>Thornhill</mark>, who spoke on the"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1576.81, 510.8, 1737.7, 1010.85], "bbox_id": "a02a5051bb", "file": "AppomattoxNewspapers_1892-1898a_0092.pdf", "page": 1, "text": "O akville L etter. On Friday night, the 15th inst., the hospitable home of Mr. B. H. Wheeler, near Oakville, was visited by a storm party, which proved to be a very enjoyable occasion. The next plearing and entertaining fea ture of the evening was the theatri cal performance, in which Mr. Boat- ler, of Norfolk, was principal actor. He entertained the crowd for several hours with many entertaining, come dies. He is a whole team and a jovial good fellow. We are glad to welcome him in our midst. Below I. give the names of some present Misses Fannie and Octe Barge, Mat- tie L. Scruggs, Mary A Atkinson, Julia and Mary Nowlin, Fannie and Lula Moore, Mattie S., Anna Belle, Mary F. and Viola Moss, Alice Har vey, Ellen V. Hubbard and Jennie Moss. The names of the gentlemen were Messrs. J. P. and Herbert Wal ker, of Gladstone W arren A. and Edwin 0. Thornhill, J. P. and R. D. Hughes, James L. Scruggs, W. T. Ubank, B, S.. Thorp, W. J. Abbitt, Jessie J. Harvey, E. D. Moore, James and W. F. Burge, W. C. Harvey, T. B. Moore, Messrs. Hesson and Moore, of Walkers Ford1and Mr. B. T Moss and wife. The whole affair was a grand success, and one of Hie most enjoyable occasions of the season. Wheat in this section is looking badly. Vriry little tobacco has beqp sold, as the seasons have been so light. Husking corn is about over and 1 believe the yield is fairly good. Dec. 18,1893. H."}, "highlight": {"text": {"matched_tokens": ["W", "Thornhill", "J"], "snippet": "Wal ker, of Gladstone <mark>W</mark> arren A. and Edwin 0. <mark>Thornhill</mark>, <mark>J</mark>. P. and R. D."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Thornhill", "J"], "snippet": "Wal ker, of Gladstone <mark>W</mark> arren A. and Edwin 0. <mark>Thornhill</mark>, <mark>J</mark>. P. and R. D."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [952.77, 299.97, 1115.79, 732.82], "bbox_id": "c0178cb24f", "file": "AppomattoxNewspapers_1898-1902a_0035.pdf", "page": 1, "text": "Mr, J. S. Rush spent part of last, week iti Buckingham with his father Mr. Geo Rush. Miss T j . hi Rohprtson from Buck ingham will spend a month or two on Tow. r Hill with Mr. T. P. Rob ertson. Mrs. Joseph Megginson is visaing her dangld-i Mrs. Berta Robertson this week. Whooping cough i-. now raging in this sectimi. The many friends of Mr. W. N. Dixon will regret very mnch lo learn that he is stil sick and nnable to leave his home pur most earnest praver is that he may soon recover.! Mr. Calvin Garrett f -nm Spout! Spring, visited Tower H d 1 L at week, j Messrs. John ThornhPI mi l Jos- eoh Garre  will visit Lynchburg, j Mr. Joe H olm e from Lyn hburg,  is visiting his sister Mr . j ary Thornhill this week. Mr. L. W. Wright wife visit Lynchburg this week. Will sav gomt bye to the many readers of vonr interesting paper. V esta . In this corresponder.ee a few weeks ego wc inadvertantly sated that Prof. Warren was conducting a meeting at Liberty Chappel. The Revs. Garland and Warren con ducted the meeting and Prof. War ren was nu-rel v an Hftendant.E d ."}, "highlight": {"text": {"matched_tokens": ["j", "Thornhill", "W"], "snippet": "visiting his sister Mr . <mark>j</mark> ary <mark>Thornhill</mark> this week. Mr. L. <mark>W</mark>. Wright wife visit Lynchburg"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Thornhill", "W"], "snippet": "visiting his sister Mr . <mark>j</mark> ary <mark>Thornhill</mark> this week. Mr. L. <mark>W</mark>. Wright wife visit Lynchburg"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [232.78, 1347.85, 404.48, 1609.4], "bbox_id": "d9743d3ade", "file": "AppomattoxNewspapers_1908-1909a_0470.pdf", "page": 1, "text": "Miss Mary v Thornhill known as Nancy, died December 25,1927. She had been in declining health for a long time, but never was confined to her bed. Her death was a shock. She died at her aisters, airs. NaramorS, whom1 ahe lived with She was 73 years _ old and waa buried Tuesday at, the family burying ground. Burial was conducted by Rev. Burnett assisted by Rev. Goad. Mr. Bob Megginson conducted singing. Pall-bearers were Messrs. Charlie .Jamerson, W.A. Wells, Preston Coleman, Lee Thornhill, E. V. Thornhill and  R. D. Thornhill, She was sur vised by one sister, Mrs. Sarah Naramora, and two brothers, J. H. Thornhill, of this county, and W. H. Thornhill, of Roanoke."}, "highlight": {"text": {"matched_tokens": ["J", "Thornhill", "W", "Thornhill"], "snippet": "Naramora, and two brothers, <mark>J</mark>. H. <mark>Thornhill</mark>, of this county, and <mark>W</mark>. H. <mark>Thornhill</mark>, of Roanoke."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Thornhill", "W", "Thornhill"], "snippet": "Naramora, and two brothers, <mark>J</mark>. H. <mark>Thornhill</mark>, of this county, and <mark>W</mark>. H. <mark>Thornhill</mark>, of Roanoke."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2145.1, 1635.55, 2468.32, 1716.7], "bbox_id": "2ae6c23455", "file": "AppomattoxNewspapers_1926-1933a_0532.pdf", "page": 1, "text": "Miss Mary Ann Thompson, j daughter, of L. T and Emma McFadden Thompson, Vera, and Joseph Wilson Thornhill, son of W. W. and Lillie May 0.ftn r  c . Thornhill, Bent Creek, w e r l j  !  W T . P ____ . ____ a . with sermon by the pastor Subject Rpst, What is It?"}, "highlight": {"text": {"matched_tokens": ["Thornhill", "w", "j", "W"], "snippet": "May 0.ftn r  c . <mark>Thornhill</mark>, Bent Creek, <mark>w</mark> e r l <mark>j</mark>  !  <mark>W</mark> T . P ____ . ____ a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thornhill", "w", "j", "W"], "snippet": "May 0.ftn r  c . <mark>Thornhill</mark>, Bent Creek, <mark>w</mark> e r l <mark>j</mark>  !  <mark>W</mark> T . P ____ . ____ a"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
