{"document": {"bbox": [445.9, 1144.98, 501.7, 1152.98], "bbox_id": "c634a1d40f", "file": "AppomattoxNewspapers_1905-1912a_0375.pdf", "page": 1, "text": "Cawthorn, j W"}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "j", "W"], "snippet": "<mark>Cawthorn</mark>, <mark>j</mark> <mark>W</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "j", "W"], "snippet": "<mark>Cawthorn</mark>, <mark>j</mark> <mark>W</mark>"}], "text_match": 1736172819517538425, "text_match_info": {"best_field_score": "3315704398080", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517538425", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.92, 298.08, 1736.77, 864.17], "bbox_id": "7eed589d78", "file": "AppomattoxNewspapers_1926-1933a_0044.pdf", "page": 1, "text": "which was drawn in for her by ittle Miss Frances Caldwell. The first gift was a lovely cor sage of Sweetheart roses from the groom-elect and miniature clothes pins and line. Many landsome gifts of linen were received numbering about 100. The guests enjoyed a contest How to Manage a Husband which was arranged on post cards with the picture of Jiggs attached. The answers to this caused much merriment, Mrs. H. M. Burge winning the prize. Then followed a Jungle Wed ding, prizes being won by Mrs. W. M. Thompson and Mrs. R.W. Jamerson. Delightful refreshments were trved by the hostesses. The following guests were present Mesdames. A. R. larwood, u. H. Lawson, Lottie Bledsoe, M. F. McKinney. Ned Wagers, Harrison Burge, Jerry Burke, Richard Burke, Joe OBrien, Chas. T. M ses. T. W. Moses, Nettie Mann, Arthur Irby, Tom Christian, G. 0. Gor- ion, W. B. Caldwell, J. W. Cawthorn, James Caldwell Jr , Pelham Cook, T. J. Harvey, J. E. Dinwiddie, Oscar Scheffler, T. W. Odor, W. L. Ould, LeRoy Smith, W. M. Thompson, Walter Jamerson, Walter Scott, Justin Burkey, Robert Wagner, Charles Caldwell, Robert Caldwell, Misses Eddie Hardy Nina and Anna Jones, Grace and Florence Cald well, Gladys Smith, Nola Burkey Elaine McDearmon, Jessalyn Hancock, Louise Gills, Elizabeth and Frances OBrien, Emma Hancock, Flora Lawson and Lucille Caldwell."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "ion, W. B. Caldwell, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, James Caldwell Jr , Pelham"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "ion, W. B. Caldwell, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, James Caldwell Jr , Pelham"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.14, 281.43, 1736.25, 846.82], "bbox_id": "e1d07ea760", "file": "AppomattoxNewspapers_1908-1909a_0044.pdf", "page": 1, "text": "which was drawn in for her by  little Miss Frances Caldwell. The first gift was a lovely cor-1 sage of Sweetheart roses from the groom-elect and miniature clothes pins and. line. Many handsome gifts of linen werei received numbering about 100. The guests enjoyed a contest How to Manage a Husband which was arranged on postj cards with the picture of Jiggs attached. The answers to this I caused much merriment, Mrs. H. M. Burge winning the prize. Then followed a Jungle Wed- ding, prizes being won by Mrs. W. M. Thompson and Mrs. R.W. Jamerson. Delightful refreshments were served by the hostesses. The following guests were present Mesdames. A. R. Garwood, !. FI. Lawson, Lottie j Bledsoe, M. F. McKinney, Ned Wagers, Harrison Burge, Jerry Burke, Richard Burke, Joe I OBrien, Chas. T. M ses. T. W. Moses, Nettie Mann, -ArthurI Irby, Tom Christian, G. 0 . Gpr- don, W. B.- Caldwell, J. W. Cawthorn, James Caldwell J r , Pelham Cook, T. J. Harvey, J. E. Dinwiddie, Oscar Scheffler, T. W. Odor, W, L. Ould, LeRoy Smith, W. M- Thompann, Walter I Jamerson, Walter Scott, Justin Burkev. Robert Wagner, Charles Caldwell, Robert Caldwell, Misses Eddie Hardy Nina and Anna Jones, Grace and Florence Cald well, Gladys Smith, Nola Burkey Elaine McDearmon, . Jessalyn Hancock, Louise Gills, Elizabeth and Frances OBrien, Emma Hancock, Flora Lawson And Lucille. Caldwell."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "don, W. B.- Caldwell, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, James Caldwell <mark>J</mark> r"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "don, W. B.- Caldwell, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, James Caldwell <mark>J</mark> r"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.87, 535.09, 2486.98, 945.68], "bbox_id": "65b1216912", "file": "AppomattoxNewspapers_1949-1952a_0580.pdf", "page": 1, "text": "weeks now Slates of delegates to district and state conventions were elected at a Democratic mass meeting last Fri day night at the court house. The meeting adopted two resolutions one endorsing Watkins M. Abbitt for renomination and re-election to Congress from the Fourth District, introduced by Calvin Robinson and one endorsing the record of United States Senator Harry F. Byrd, in troduced by C. W. Smith. Congressman W. M. Abbitt was present and addressed the meeting. Charles F. P. Crawley served as the presiding officer of the meeting and C. W. Smith served as secretary. The following delegates, instruct ed to vote as a unit, were named to the Fourth District Convention in Petersburg, May 24 J. A. Bingham, George Abbitt, Jr. G. T. Moses, Sr. G. B. Buchanan, J. H. OBrien, Wal lace E. Bondurant, John E. Burnett, Mrs. N. A. Wagers, N. E. Farrar, C. C. Harvey, Mrs. J. W. Flood, Mrs. Hazel R. Mann, Grover E. Smith, E. T. Guill, C. T. Moses, Jr. H. C. Pulliam, Mrs. Margaret Calcott, R. C. Hubbard, P. B. Stratton, Calvin H. Robinson, J. A. Burke, D. A. Conner, J. W. Cawthorn, F. J. Smith, Irby B. Wheeler, David T. Robertson, Chas. F. P. Crawley, T. C. Ligon, W. W. OBrien, Mrs! C. H. Robinson, Mrs. F. C. Dresser, J. W. Conner, Tobey E. Inge, Eula M. Burke, R. D. Robinson, W. D. Fer guson, H. A. Williams and John P."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "Burke, D. A. Conner, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, F. <mark>J</mark>. Smith, Irby"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "Burke, D. A. Conner, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, F. <mark>J</mark>. Smith, Irby"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [518.6, 1220.82, 2422.85, 1656.84], "bbox_id": "2d9240cdcf", "file": "AppomattoxNewspapers_1952-1954a_0463.pdf", "page": 1, "text": "WATCH NIGHT SERVICE SUPERB FLAVORING March 5.- Curry Harvey named to head local Red Gross drive. Goal is set at 2,337,  j j , V March 6.-FVed Caw to represent county in public speakihg.contest. March 6.C AmericaV Legion spon sors oratorical contest.  s March 13.- Pamplifi.-H. S, plays in district basketball tournaifient finals. March 16.- Mrs. Louise T. Brown elected head of local Eastern Star. March 19.- Highway Dept, states 4193,000 allocated for new fiscal year for Appomattox secondary roads. March 26.- Bloodmobile visits Ap pomattox. March 26.- Crawford Davidson at tending Cardinal baseball training camp at Albany, Ga. March 26.- Proposed Appomattox County budget publisbed. March 27.- Spelling Bee finals are held at A. H. S. April 1.- Service station property here on Route 460 purchased by new church group for house of worship. April 2.- James Richard Redding, Jr. hit by train here, dies following Sunday. April 2.- A. H. S. senior play pre sented. April 4.- Dr. S. S. Shouse appoint ed Norfolk Health Director. April 8.- J. W. Cawthorn, former town manager, dies. April 9.- Appomattox observes the 88th anniversary of the peace made at Old Court House in 1865. April 10.- Trial Justice C. F. P. Crawley named to serve as town judge for Appomattox. April 13.- Appomattox starts an-"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Health Director. April 8.- <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, former town manager, dies."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Health Director. April 8.- <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, former town manager, dies."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [852.49, 384.47, 1033.01, 1157.77], "bbox_id": "a8e9eb5f44", "file": "AppomattoxNewspapers_1915-1918a_0502.pdf", "page": 1, "text": "War Stamp Campaign Corn mitt Chairm an, L. Crawlay. Each m inister in county. Row. L. F. Gallaham, Appo m attox. Rev C. W. McElroy, Appo m attox. Rev. J . C. Lops, Appomattox. Rev. O. W. Taylor, Pamplin Rev. A. K. Lambdiu, Pam  plin. Rev. A. J . Ponton, Pamplin Rev. G.A. Chocolate, Phenix Rev. J . H. Gordon, Vera. Rev. O. R. James, Concord. Hon. 8. L. Ferguson, Appo m attox. Claude 8m ith, Appomattox. A. T. Inge, Appomattox. Don Moses, Appomattox. Prof. Bigley, Pamplin. Misa Jennie Godwin, Appo m attox. Hon. J . W. Cawthorn, Appo m attox.  P itser Gills, Appomattox. Hon. R. L. Burke, Appomat tox. 8. Pieree Loving, Pamplin. L.N. Ligon, postmaster,Pam plin. Hon. Willia Ligon, Pamplin. B. G. Anderson, Appomattox. Fenton Harvey, Pamplin. Boy ScoutsJ C. Leps, Ap pom attox. A. H. Clement, Appomattox Dr. D. A. Christian, Vera. Dr. H. 8. H art, Pamplin. Dr. Chap Jonee, Appomattox Dr. D. N. Twyman, Appo m attox. N. R. Feathereton, Vera. E. LeRoy Smith, Appomat tox. Robert Irby, Appomattox. Publicity CommitteeMinis ters of oonnty, A H. Clement L. Crawley. Committee On SchoolsEach teacher in county, and Super intendent of Schools N. R Feathereton. Personal Canvass  To be done by Scouts and sohool ohil dren. Womans OrganizationMrs R. O. W agner, Mrs. Pitzer Gills Mrs. 8. L. Ferguson, Miss Anna Jones, Miss Kate Franklin,Mrs. S. D. Cheatham, Miss Jacque line Atwood, Miss Enla May Burke, Miss M attie Sears, Mrs. John Sears. Mrs. W. T. Steele, 8pout"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Appo m attox. Hon. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, Appo m attox.  P"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Appo m attox. Hon. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, Appo m attox.  P"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1688.4, 595.11, 1848.93, 652.61], "bbox_id": "17321b46d0", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "W. J. Trent, J. F. Dickerson, and J. W. Cawthorn were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}, "highlight": {"text": {"matched_tokens": ["W", "J", "J", "J", "W", "Cawthorn"], "snippet": "<mark>W</mark>. <mark>J</mark>. Trent, <mark>J</mark>. F. Dickerson, and <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "J", "J", "W", "Cawthorn"], "snippet": "<mark>W</mark>. <mark>J</mark>. Trent, <mark>J</mark>. F. Dickerson, and <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> were appointed at last court commissioners to view for a proposed change of the public road through the Groff place."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1488.01, 834.38, 1783.69, 894.24], "bbox_id": "8f44a9649d", "file": "AppomattoxNewspapers_1949-1952a_0416.pdf", "page": 1, "text": "uve Mrs. Calvin Robinson take 3 the oath of office as the first lo serve on the Appomattox Town Council. Mayor George B. nan and Town Judge J. W. Cawthorn participate in the cere- held in the Times- Virginian office. Othe members of the town ling body are Chas. F. James, J. E. Jamerson, J. C. Caldwell, C. Uses, Jr. and J. Thos. Almond. ____________ ________ _ ________"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "nan and Town Judge <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> participate in the cere-"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "nan and Town Judge <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> participate in the cere-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1544.13, 416.56, 1876.63, 1117.8], "bbox_id": "e92bfa106d", "file": "AppomattoxNewspapers_1926-1933a_0066.pdf", "page": 1, "text": "understand and was bought byself to his church and community by the Bank of Appomattox, Jin which he resided. Ry his Mr. and Mrs. P. B. Carter Anddeath, his church has sustained family, of Lynchburg, w eregreat loss, while a Baptist and visitors near Vera Sunday.. 1 faithful member of Spring Creek, he loved and helped all denominations. We trust that! his life will be reproduced in the lives of those with whom he as- After a painful illness of sev-Jsociated and to a beckoning! eral months duration, duringhand leading .us on to al which time she exhibited raref a higher and pdble Ufe.r fortitude and courage, Mrs. W. A. Durham who before her mar riage was Miss Elnora Fuqua passed to her final reward on Friday, December 10th, 1925, at 540 p. m. The funeral which was largely attended, was con ducted from Liberty Baptist Church, Sunday afternoon, Dec 12th, and interment was made in the family cemetery just out side of the village. Rev. W. M. Thompson, her pastor, assisted by Reverends D. G. Trent and R. E. Redding conducted the funeral service. The active bearers were Lb E. Smith, A. R. Harwood, W. O. Moss, Dr. C. F. James, C. S. McDearmon, Ned Wagers, J. E. Steele, and Col. Joel Flood. The honorary bearers were Callie Moore, H. C. Babcock, J. D. Morris, J. E. Sears, Dr. D. A. Christian, Senator S. L. Fer guson, Dr. L. L. Gale. Mayor J. W. Cawthorn, Tom Moses, C. T. Moses, Robt. Irby, Ben Caldwell, C. W. Hancock, Walter Han cock, Tom Wrflton and A. H. Clement. Robert Caldwell, Jr., served as ushers. Mrs. Durham was born and reared in Appomattox Connty and had lived in this community for about 38 years. She was a pious and consecrated Christian devoted mother and untilHer death, a faithfulmemberof erty Baptist Church. She is sur vived by three children as fol- ows Dr. Terry Durham, of xmdon, Eng., Walter E Dur lam, of Richmond, Va-. and dre. Alpha Durham lam, of this village"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "L. L. Gale. Mayor <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Tom Moses, C. T."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "L. L. Gale. Mayor <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Tom Moses, C. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.63, 1113.32, 2188.35, 1317.96], "bbox_id": "88722462cc", "file": "AppomattoxNewspapers_1908-1909a_0294.pdf", "page": 1, "text": "tra c ts, t0  w itd t o t  d c s 2 S if t a cSpy h e r e  b e publish-  a c re s conveyed to th e sa id C- B. I  w eek f o r fo u r sue-1  Cawthorn by W. T. Marshall 1 ceasiVe weeks in the Times-1  and brother, a tract of 897 j Virginian, a newspaper pub-1 t acres on which Charles S. lished in the County of Appo- j Cawthorn did reside and i8  a 0  known as the htome tract, con_ I House of this county on dr be- i j veyed to the said C S I forg the 3rd dfi-y of March j j thorn in several tracts by sev- 1930, that being the next sue-   b . i r A t i ss 1 acres conveyed to the said u.j clerk majt a copy hereof Died in Action in W ar Ig. Cawthorn by J. W. Cawthorn L eack 0f the said defendants Washington. Rut one American lanj wjfe. I to the post-office address given general officer was killed in aettra  d . A tract of 264 in the affidavit herein, and file .during .. tM, WwM j w . ro u n tv a certificate o f th e fa e t itt th e War department official records d1-1 acres, situated in said County la _ . . . . e closed. Two other general ce and District and about 4 milePaPera x ---- 2 nn Jl.A nnnliorila PH 11 SPR BfiOf tO 1   W"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "ar Ig. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> L eack 0f the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "ar Ig. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> L eack 0f the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1522.8, 466.43, 1685.4, 529.47], "bbox_id": "61fb8600f8", "file": "AppomattoxNewspapers_1933-1936a_0097.pdf", "page": 1, "text": "Town taxes now due and payable. Penalty added after August 1. J j. W. Cawthorn, SKv- __ ji Order of Publication"}, "highlight": {"text": {"matched_tokens": ["J", "j", "W", "Cawthorn"], "snippet": "Town taxes now due and payable. Penalty added after August 1. <mark>J</mark> <mark>j</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, SKv- __ ji Order of Publication"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "j", "W", "Cawthorn"], "snippet": "Town taxes now due and payable. Penalty added after August 1. <mark>J</mark> <mark>j</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, SKv- __ ji Order of Publication"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1030.79, 1367.94, 1355.97, 1807.88], "bbox_id": "a8d9a6b908", "file": "AppomattoxNewspapers_1933-1936a_0051.pdf", "page": 1, "text": "Town of Appomattox, condit ioned to the effect that the said grantee will const- pfuct and jmaintain the plant or system provided for, and reasonably necessary for tha exercise of the fights and privileges granted in and by this Ordinance, and will main tain the same in good order through the terms of this grant, and will comply in all respects with the terms, conditions, and provisions of this Ordina nee. It is understood that any demand made hereunder by either party shall be jreason able- This Ordinance shall be n force from its passage. Be it ordained that bids in writing for the Franchise, P 1 pipe lines, water mains, plugs 1 vileges .and rights proposed _ and connections, shall be sub- be granted by the above au  ject. to the approval of the com  ority  7 oclock mittee on Streets of the day of Feb, 1934      Council of the Town of Ap-  ? M to Hon- C S McDearmn pomattox. and when plan  mayor of said 1 Town 1  .knnr tvo locAtirtTi vf sHch . Town office That . showing the location of sch  the nine lines, water mains, nlugs I of Appomattox reserV , ail and connection .bll t rP t . anh v law heoy, to cor- bds as Authorized by mittee on Streets and annroved A TTEST by the Town Council, the same  J W. Cawthorn, Clerk"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Town Council, the same  <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark>, Clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Town Council, the same  <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark>, Clerk"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [296.96, 1466.39, 462.79, 1668.97], "bbox_id": "1f973e6a88", "file": "AppomattoxNewspapers_1912-1915a_0241.pdf", "page": 1, "text": "TOBACCO Class I. 5 lbs Mahogany W rapper Blue Ribbon, R J Coleman Red Ribbon, W atson W oolridge Class II. 10 lbs D ark Ship ping Blue Ribbon, Jno Turnes Red Ribbon, L M Southall Class IH 10 lbs Filler J W Cawthorn, won both blue and red ribbons Class IV. 5 lbs. M ahogany Leaf Blue Ribbon, J W Car ter. Class V. 10 lbs. Sweet Stakes Blue R ibbon, W , W OBrien Red R ibbon, J W Grow"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "IH 10 lbs Filler <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>, won both blue and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "IH 10 lbs Filler <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>, won both blue and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.3, 225.35, 2489.66, 499.14], "bbox_id": "af53c9110e", "file": "AppomattoxNewspapers_1926-1933a_0238.pdf", "page": 1, "text": "To our patronsWe appro Mrs. O. L. Schaffler, 7.25 Horace Shirey, 19.50 Frank Smith, 3 Alice Lee Smith, 2 Helen Dickerson, 2 Annie Elder, 0.50 Mrs. W. L. Brown,  6  Mrs. W. H. Conner, 1.25 Mrs. J. W. Cawthorn, 0.50 Bessie Christian, 0.60 Mrs. L. F. Caldwell, 1.50 Es telle Dickerson, 0.75 John Doss, il Mrs. J. L. Foster, 4.25 Mrs. J. R. F o r d , 1 Mrs.-Pitzer Gills, 2 Mrs. D. B. .Henderson, 0.50 Mrs. Z. T. Moran, 0.50 Willie Mor ris, 1.75 Vernell Mitchell, 0.50 W. W. Martin, 8.50 Mrs. H. B. Pack,  6  Mrs. J. M. .Rosser, 0.75 Mrs. M. C. Smith, 2.75 Mrs. Grey Smith, 1.25 C. H. Smith, 3 Mrs. J. E. Sears, 2 Frances Smith, 1 Clyde Thomas, 1 E. Le- Roy Smith, 10 Louise Turnes, 0.25 v Mrs. J. B. Wheeler, 0.25 Helen Smith, 0.50"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.60"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.60"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2225.29, 586.06, 2384.59, 885.42], "bbox_id": "0a2d7f9ec6", "file": "AppomattoxNewspapers_1908-1909a_0577.pdf", "page": 1, "text": "The town of Appomattox is going to observe Clean-Up Days next Monday, Tuesday and Wednesday, May 8, 9 and 10, sergeant J. W Cawthorn, Jr., announced yestrday. Town residents are asked tc clean their premises Monday o next week and place rubbage garbage, etc., on the streé ..onts and Tuesday and Wed nesday it will be called for and aken away. This clean-up period is an nually iised as a means of beau tifying the town and making premises more sightly i nap- pearance and the cooperation of the public is urged. The town furnishes feee drayage of rubbagç on these days, . ----- o -------- -- ---------- - Miss, Franklins Pupils To Have Recital May 17"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "9 and 10, sergeant <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>, Jr., announced yestrday. Town"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "9 and 10, sergeant <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>, Jr., announced yestrday. Town"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2027.75, 599.07, 2191.38, 724.27], "bbox_id": "0eba2d3ff5", "file": "AppomattoxNewspapers_1949-1952a_0277.pdf", "page": 1, "text": "The Town of Appomattox has made a change in the set-up for trying town court cases. The Town has appointed J. W. Cawthorn, re tired town manager, as its judge to try town cases and preside over the town court. A former mayor and town manager until his retirement two years ago, Mr. Cawthorn is well versed in town law and procedure. He will be paid a monthly compen sation and the compensation will not be based on fees."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "The Town has appointed <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, re tired town manager,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "The Town has appointed <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, re tired town manager,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [830.86, 177.79, 985.97, 265.57], "bbox_id": "20d238d50a", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "the statements j j . W Cawthorn has been making to boost his can didacy for re-election to the Legis lature are meanly mendacious, and I leave him tothe tender mercies of the truth-loving people of Ap pomattox County. Respectfully , 8 . L F E R G U S O N ."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Cawthorn"], "snippet": "the statements j <mark>j</mark> . <mark>W</mark> <mark>Cawthorn</mark> has been making to"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Cawthorn"], "snippet": "the statements j <mark>j</mark> . <mark>W</mark> <mark>Cawthorn</mark> has been making to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [671.78, 1522.16, 938.24, 1545.16], "bbox_id": "bdbffb2ac1", "file": "AppomattoxNewspapers_1939-1943a_0010.pdf", "page": 1, "text": "the J. W. Cawthorn store"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> store"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> store"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1922.87, 1549.88, 2088.84, 1645.63], "bbox_id": "b747c46c51", "file": "AppomattoxNewspapers_1926-1933a_0258.pdf", "page": 1, "text": "The Girls Auxiliary of Lib-j erty Baptist Church are in camp this week at the former home of J. W. Cawthorn on the Appomattox River. Mis ses Florence Gregory and Vir ginia Hancock are camp direc- tors and their girls are pursu ing two study courses."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the former home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> on the Appomattox River."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the former home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> on the Appomattox River."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1919.31, 1530.14, 2080.43, 1625.44], "bbox_id": "9b411cd841", "file": "AppomattoxNewspapers_1908-1909a_0258.pdf", "page": 1, "text": "The Girls Auxiliary of lib erty Baptist Church are in camp this week at the former home of J. W. Cawthorn on the Appomattox River. Mie ses Florence Gregory and Vir ginia Hancock are camp direc tors and their girls are pursu ing two study courses."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the former home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> on the Appomattox River."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the former home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> on the Appomattox River."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.53, 1188.49, 1881.17, 1306.78], "bbox_id": "a02b91f7b8", "file": "AppomattoxNewspapers_1905-1912a_0366.pdf", "page": 1, "text": "The Farmers Union held a largely attended picnic at Rose Bower school house on the 4th of July. Fine speeches were made by J. W. Cawthorn, Jr., Major J. W. Flood, A. B. Thornhill and A. L. Matcbett. Table 40 feet long w filled with fine prov sions and the farmers, wives and babies had f glorious 4th."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J", "W"], "snippet": "speeches were made by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., Major <mark>J</mark>. <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J", "W"], "snippet": "speeches were made by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., Major <mark>J</mark>. <mark>W</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1289.03, 1156.22, 1445.96, 1238.72], "bbox_id": "c41ec4b8dd", "file": "AppomattoxNewspapers_1905-1912a_0108.pdf", "page": 1, "text": "The Farmers U nron will convene in Petersburg on April 22. Messrs. J. W. Cawthorn, l. M. Gannaway, J. J. Wood, 0. R. Salideraon, R. W, Fuqua, and D r . W . Evans, are members of the Executive Commit tee."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "on April 22. Messrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, l. M. Gannaway, <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "on April 22. Messrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, l. M. Gannaway, <mark>J</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.91, 1394.73, 1634.52, 1697.22], "bbox_id": "f89682bb95", "file": "AppomattoxNewspapers_1926-1933a_0165.pdf", "page": 1, "text": "Stapleton Thanksgiving p a s s e d off qiuetly in this section and so far ai T have heard, there were no  fatalities, Having had ideal weather for the season, it seems that no one could have an excuse for hot enjoying the day to the fullest extent. Game is plentiful and quite a few have succeeded in killing several turkeys. Misses Martha Moore and Dixie  Madison, of Buchanan, and Mary Martin spent the week-end with Miss Louise Drinkard. AH re turned to their respective homes I Sunday afternoon Miss N e l l Cawthorn who teaches Mt. Zion school, spent Thanksgiving with her parents, Mr. and Mrs. J. W. Cawthorn, at Appomattox. The Ladies Aid Society of"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, at Appomattox. The Ladies"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, at Appomattox. The Ladies"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Thornhill, T. J. Stratton, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and R. L. Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Thornhill, T. J. Stratton, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and R. L. Burke."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1559.06, 668.03, 1731.58, 1674.28], "bbox_id": "551cae8740", "file": "AppomattoxNewspapers_1912-1915a_0012.pdf", "page": 1, "text": "Sheriff McKinney, E. R. A b- bitt and Reuben B ryant had  been busy for several days ar-1 ranging a Farm ers Union picnic for Friday, A ugust 23rd, I at this place. I Early Friday morning the teams with trunks and baskets I began to arrive and by ton oclock about the time of the parade at least 1500 people were I thronging the streets. The town was turned over to the farm ers and they enjoyed the day in every way.  . The Farm ville Silver Band furnished splendid music for the occasion and our boys girls joined in the parade and the festivities of the occasion. President of the County Union, J. W . Cawthorn, Jr., introduced A. B. Thornhill, who spoke on the objects of the Union and welcomed the far mers, their wives and daugh ters and the visitors to the ele g an t dinner w hich was spread on the Court Green, Mr. F. A. LaBaume, Indus trial A gent of the N.  W . Ry., who had been invited to ad dress the farm ers, was intro duced by Mr. Thornhill, and made a very practical speech, interspersed by many am using jokes. He paid Appomattox a high com plim ent on her splen did enterprise, progress and commended especially the I great Work being done by Prof. Crawley in our fine Agricul tural College. He told the farm ers how to beautify their  homes and keep the boys on the farm. Mr. LaBaume is a good speaker and the large audience enjoyed his rem arks very much and no doubt w ill gather some inspiration there from fpr greater effort tow ards real progress. . President Ganaway, pf Cum berland, w ae present and made an address w hich was much enjoyed.  Btate Secretary D. M. Blank- inship, of Campbell County, was also present and m ade a good business talk to the far mers. The day was strictly a far m ers day and they are to be congratulated on the big suc cess of their picnic, and now we w ant to move that they m ake thefourth Friday in Au gust every year the annual picnic day of the Farm ers Union at Appomattox. The interest and attendance shows th at the Union is here to stay and th at the substantial saving which is being made to the farm ers in their respective Unions is worth the considera tion of those who are not mem bers. There were several m atch games of base ball played, and the entire day was given over to one of pleasure and social intercourse. Come again farm ers, and long live the Union."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of the County Union, <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark>, Jr., introduced A. B."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of the County Union, <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark>, Jr., introduced A. B."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [145.72, 1662.83, 309.49, 1706.44], "bbox_id": "84487f7fb1", "file": "AppomattoxNewspapers_1926-1933a_0541.pdf", "page": 1, "text": "Sat. Aug 1 st is the last day to pay town taxes before pen alty is added. J. W. Cawthorn, Tress."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Sat. Aug 1 st is the last day to pay town taxes before pen alty is added. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Tress."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Sat. Aug 1 st is the last day to pay town taxes before pen alty is added. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Tress."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [895.18, 515.83, 1046.43, 581.98], "bbox_id": "9956c054b1", "file": "AppomattoxNewspapers_1933-1936a_0404.pdf", "page": 1, "text": "Roanoke. o Miss Corine Hancock left today r- Franklin where she is teaching. o Mrs. J . W. Cawthorn, who has en sick, is better."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Roanoke. o Miss Corine Hancock left today r- Franklin where she is teaching. o Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, who has en sick, is better."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Roanoke. o Miss Corine Hancock left today r- Franklin where she is teaching. o Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, who has en sick, is better."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2203.43, 609.18, 2361.86, 816.29], "bbox_id": "c564ae5caa", "file": "AppomattoxNewspapers_1933-1936a_0113.pdf", "page": 1, "text": "rHIS will be a regular weekly I feature in the Times Virginian. I it will publickly praise the things I done to improve our town, that I ordinarily might pass unnoticed. I SEND IN YOUD NOMINATION. I Lets boost those who PROGRESS. I 1. A bouquet to the Bank of Ap I pom attox for installing  P   I vault a d money pr otector. 2 . Orchids to J . W . Cawthorn.  Hes town official who doesnt mi 6 getting out with n pick and and shovel to holp beautify our tow. , 3. And a hand fo r the hotel, it s a new sign out in fro nt. 4. Ring up an improvement Ir Moses Motor Co. theyre adding to their building. SEN D IN YO UR nominations for this feature."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "otector. 2 . Orchids to <mark>J</mark> . <mark>W</mark> . <mark>Cawthorn</mark>.  Hes town official who"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "otector. 2 . Orchids to <mark>J</mark> . <mark>W</mark> . <mark>Cawthorn</mark>.  Hes town official who"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.7, 223.64, 1728.03, 1387.8], "bbox_id": "295b95fef2", "file": "AppomattoxNewspapers_1918-1922a_0173.pdf", "page": 1, "text": "Rev. Lepsismuch indisposed. Mias Eva Harvey is visiting ! relatives in Lynchburg. Refreshing showers m a k e bountiful gardens and beauti ! ful flowers. Mr. Qallie Burke, wife and ! daughter, are guests here for some days Messrs U Lucado and Wilev Morris are owners of new Fords Mrs L. J. Morris is on a weeks visit to her old home in Nelsou. Misses Wave Turnas and Earie Patteson are visiting relatives in Charlotte this week Miss Mary Covington, of I Hollywood, is visiting relatives  in Lynchburg this week Miss Susie Hancock, who hue been lescMng at Blue.fleld, W. Va , is spending her vacation at home here. Prof, nd Mr Oi-awlev and young Charles a r e taking, e vacation at the heme of Mrs raw lev, in the Valley. Mr. Burnett, the electrical maintainer, will soon have his family here. He will occupy the cottage of M rs. Patteson Mr and Mrs Simpkins and Mrp. J W. Cawthorn spent the week end with her daughter Mrs John Tweedy, uear here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotte county, spept tne week end with her aunts, Meadames. J. W. Patt son aud L D. Puck ette. Mr. and Mrs Chandler Simp kinp, of Richmond, have been visiting Mrs Simpkins parents, Mr. end Mrs. J. W Cawthorn, bere. Miss Helen Morris, of V tra, spent several days t .Bt week with Miss E a Harvey hre, on ner way home from Rich tnond College. Mrs. F 14. Craig and son, Frank, are vigitiug Mrs Craigs father, at Allendale. Mr Craig stopped for a ua.y on his way to N. Y. Mr H. 8. East, son of Rev. H. Parletc East, has gone to Berryville, V., or the summer, where he is employed iu Dr. A. W. Warners pharmacy. Mr. W. 0 Moss has been vis iting iiis old home in North Carolina. He wus accompa nied here by his father and brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, Va , after spending a few days at tbe baptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo mattox. The quality of our wheal is good aud speculators are said to be buying up the farmers bread before it is threshed. Re careful how you part with your bread. The Editor received an invi tation to be present at the marriage of Frank Green and Sarau Abbitt Burke Sunday morning. These are old and 1 reliable colored citizens of Ap pomattox. A wedding supper was enjoyed Monday evening Tho ladies of New Hope eburch will have a lawn party at parsonage, Vera, Va., Sat urday, June 19th, beginning at 5 oclock. Proceeds ior benefit ! of now church. Old church I will be sold at 4 oclock. Pub  lie cordially invited. R. L. Burke, cashier of Bank j of Appomattox, and chairman ot Group Four of tue Virginia Rankers Association, left to- ! day to atteuu tbe State Con-  vernion of Rankers, which will be in session at tbe Homestead Hotel, Hot S,iriogt, Vu., June 17, lb ana 19."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrp. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrp. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1324.11, 580.13, 1483.31, 608.13], "bbox_id": "98f81e6f0b", "file": "AppomattoxNewspapers_1933-1936a_0338.pdf", "page": 1, "text": "R C Simpkins and Earl Tracy, of Mount Hope, W Va., spent Sun day with J W Cawthorn."}, "highlight": {"text": {"matched_tokens": ["W", "J", "W", "Cawthorn"], "snippet": "R C Simpkins and Earl Tracy, of Mount Hope, <mark>W</mark> Va., spent Sun day with <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "W", "Cawthorn"], "snippet": "R C Simpkins and Earl Tracy, of Mount Hope, <mark>W</mark> Va., spent Sun day with <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1864.28, 788.82, 2035.08, 1264.26], "bbox_id": "6d914327ad", "file": "AppomattoxNewspapers_1908-1909a_0292.pdf", "page": 1, "text": "Pursuant to authority vested in me by United. States Court for Western District of Vir ginia, I will sell at public auc tion to highest bidder subject to the lien of Federal Land Bank of Baltimore, all real es tate of Charles Samuel Caw- held or the premises on April 5, 1930, at 2 P. M. A certain tract of land con taining 558 acres, more or less, with the buildings and im provements thereon, situated in Clpver Hill . District off- the. County of Appomattox, Virgin ia, shout ten miles North-East of the Court House, on both sides of Appomattox River, and adjoining the lands of W. T. Marshall, B. D. Dickerson, W. j . Almond, W. R. Baldwin, T. . Cawthorn, Mrs. Lillie Gilliam and others. The said tract of and consists of three- racts, to-wit a tract of 32 acres conveyed to the said C. S. Cawthorn by W. T. Marshall and brother, a tract of 397 acres, on which Charles S. Cawthorn  did reside and is known as the home tract, con veyed-to the said C. S. Caw thorn in several tracts by sev eral deeds, and a tract of 128 acres conveyed to the said C. S. Cawthorn by J. W. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1838.65, 450.19, 2021.16, 1222.73], "bbox_id": "3fd9ec5077", "file": "AppomattoxNewspapers_1908-1909a_0290.pdf", "page": 1, "text": "Pursuant to authority vested I in me by United States Court I for Western District of Vir- j ginia, I will sell at public auc-1 tion to highest bidder subject to the lien of Federal Land Bank of Baltimore, all real es tate of Charles Samuel Caw- held on the premises on April 5, 1930, at 2 P. M. A certain tract of land con taining 568 acres, more or less, with the buildings and im- iprovements thereon, situated in District, of the j County of Appomattox, Virgin ia, about ten miles North-East of the Court House, on both sides of Appomattox River, and adjoining the lands of W. T. Marshall, B. D. Dickerson, W. J. Almond, W. R. Baldwin, T.  J. Cawthorn, Mrs. Lillie Gilliam and others. The said tract of I land consists of three separate I tracts, to-wit . a tract of 821 acres conveyed to the said C. S. I lCawthorn by W. T. Marshall and brother, a tract of 8971 acres, on which Charles S. j Cawthorn did reside and is known as the hkme tract, con veyed to the said C. S. Caw-j thorn in several tracts by sev-H eral deeds, and a tract of 128 acres conveyed to the said C. S. Cawthorn by I W. Cawthorn and wife. Second A tract of 26 acres, situated in said County and District and about  mile I North of the above named tract I known as Indian Field and I was conveyed to said C. S.  Cawthorn by J. W. Cawthorn and wife, all of which deeds are of record in the Clerks Office of Appomat tox County and to which refer- fence is here made.   Thiese farms will be offered seperately and in parcels, and as a whole, and the mode pro-  during the highest price will be reported for confirmation. This is a fine opportunity to secure one of the best farms in Appomattox County for a mod erate cash payment. Good dwellings on both"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S.  Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and wife, all of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S.  Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and wife, all of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [518.11, 1079.11, 689.02, 1579.29], "bbox_id": "86e832fe62", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "PRIVATES. Abbett Geo. Dallas Alvis Ed ward, died in hospital at Mt. Jack- son, 1862 Alvis Wm. M., wounded Bagby Luke, discharged Banton James Bell Wyatt H . Bingham, Jno. S., discharged Bocock, Jno, T., deserted in December 1863 Bragg, Jno. J., transferred Bran ham, George W., from Albemarle county Brown, C. C. Carson, Jno, J. Carson, M. J. Carson M. W. j Cawthorn, Hudson  Cheatham, R, H., wounded at 2nd Manassas, Sept. 22nd 1862 Chick, J. J., captured wounded at Hanes Shop, May 28th, 1864 Chick, E. A . Clock, Cotton  Clock, William Clarke Henry Clarke William Coleman Drury  Coleman Henry, died in hospital Coleman, J. A., captured at Toms Brook, Oct. 9th, 1864 Colemtn Madison Coleman, Schuyler, died pt home 1862 Connelly, Warner Geo. Conner Allen, discharged lb overage Crawley, Richd, trans ferred  Crenshaw, Jno J., captured u Ilanes Shop. May 28th, 1864. Crumby, Frank, died in hospital in Richmond 1862 Davidson Jas II., died Diggs, John Doss, Jos. E. Dunn,put in substitute Elliott, Jno W. died at home in service Elli ott, Thos. wounded at Toms. Brook, Oct. 9th, 1864 Featherston, Jas. H. detailed with Hills, A. P. Signal j corps Ferbush, Henry discharged f Furbush, J. D. killed at Fort Ken- i"}, "highlight": {"text": {"matched_tokens": ["W", "j", "Cawthorn"], "snippet": "M. J. Carson M. <mark>W</mark>. <mark>j</mark> <mark>Cawthorn</mark>, Hudson  Cheatham, R, H.,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "j", "Cawthorn"], "snippet": "M. J. Carson M. <mark>W</mark>. <mark>j</mark> <mark>Cawthorn</mark>, Hudson  Cheatham, R, H.,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 450.08, 1959.69, 1747.65], "bbox_id": "6d7a6c0bcd", "file": "AppomattoxNewspapers_1915-1918a_0017.pdf", "page": 1, "text": "Platform ot Principles Adopt ed. Party Organization. Much Enthusiasm. Large Attend ance. Pursuant to a call of Dr. D. M. Robertson, Chairman, of the Citizens Party a large and enthusiastic meeting of citi zens assembled in mass meet ing at the Courthouse here Fri day and adopted a platform of principles and practically put a full tioket in the field for all County and District1 officers in opposition to the nominees of the Democratio party. Every seat in the Courthouse was oc cupied and m an were stand ing in the aisles. The crowd was estimated at 200.  Many of these, however, were specta tors, and not in sympathy with the movement. Dr. L. M. Robertson, Chair man, appointedthe following Committee on Resolutions J. W. Cawthorn Jr., R. S. Jen kins, David Alvis, E. F. Col- lips, S. P. Coleman and J. T. jGotas. While the committee was out J. P. L. Fleshman addressed the meeting. Mr. Fleshman has been a Republican for many years his remarks were direct ed against the office-holders of Appqmattox County, particu larly for raising the assessed values and the rate of taxation he referred to a notice posted by the Superintendent of Schools, 1800 for schools and 1700 for incidentals. He wanted the receipts and dis bursements published of the school fund, also the road fund and the Supervisors proceed ings. He wants Appomattox to sell her poor houses and pay her debts, two poor houses and three paupers is too expensive, he deolared. He opposed a bond issue, saying it would make slaves of the people. The Committee on Resolu tions then made its report and the chair requested J.- W. Caw- thon, the Chairman, to ex- lain to the meeting the reso- utions they were unanimously adopted. We, the citizens of Appomat tox County in mass-meeting assembled at the Courthouse of said county on this the 20th day of August, 1915 desirous of promoting our own welfare and that of every other - citizen of our county do make the fol lowing declaration of princi ples and for the support of this declaration we mutually pledge to each other our influence and our votes. We demand a more economi cal administration of our State and county affairs, and that all taxes and licenses be eq a- ized as nearly as possible and that the poll tax be made col lectible as other taxes and abolished as a prequisite to voting. We demand the repeal of the aw appointing the  board of review to do over the work al ready performed by the -con? missioners of the revenue, as this is a useless waste of money and very objectionable to the people. We believe that it is detri mental to the best interests of the people for any county offi cial to bold office for a period of more than two terms, as ex perience has proved that many of them become seif-perpetuat ing political bosses, thus caus ing a detriment to the public welfare. We demand that the expen sive, antiquated system of deeds and mortgages be discon tinned and a modern system be adopted, such as the Torrens system, whioh would be a sav ing to the people of Virginia of a half million to one million dollars a year. We demand that the State publish and distribute its school books at cost, which would mean a large annual saving to our people. We demand that our old sol diers be better provided for in thoir declining years and th at"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "following Committee on Resolutions <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Jr., R. S. Jen"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "following Committee on Resolutions <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Jr., R. S. Jen"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.87, 455.73, 1848.88, 674.57], "bbox_id": "e42ca71daf", "file": "AppomattoxNewspapers_1926-1933a_0214.pdf", "page": 1, "text": "Patterson- Bob Caldwell is sick at his Floyd Dinkins, who under-, home East Ridge, went an operation at the Farm- j Miss Emma Gregory was hos ville -hospital liast week is im proving. Miss Nell Cawthom, of Gold Hill, spent the week-end with her parents, Mr. and Mrs- J. W. Cawthorn. Mrs- J. A- Sears visited her daughter, Miss Mary Grey, in Lynchburg, Tuesday Dr. D- N. Twyman, who has been sick is able to be out again Lewis McDearmon is spend ing some time with his parents, Mr. and Mrs. C- mon-"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "parents, Mr. and Mrs- <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Mrs- <mark>J</mark>. A- Sears"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "parents, Mr. and Mrs- <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Mrs- <mark>J</mark>. A- Sears"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.39, 857.65, 1932.44, 1289.79], "bbox_id": "3a62aca275", "file": "AppomattoxNewspapers_1933-1936a_0520.pdf", "page": 1, "text": "On the morning of July 23, our ,aople were shocked beyond power t expression as the sad news spread iirough our little town that Tad ears was la d . What! Tad lears dead? Why he waited on me n the store only yesterday and eemed to be perfectly well and many similiar expressions were heard. Yes Tad is dead, we will see hiln no more in the flesh, but let as thank God that death is not an- niliation, but a transition from one sphere to another and in this tran sition we leave behind an influence that lives on to effect the lives of others. Our departed frieiyl and fellow councilman was gifted with the faculty of making and holding frends, a man just in the prime of life who had been in business here since graduating from school to the day of his death, admired and res pected by all who knew him not op vly as one of our best business men but as a man who could be trusted and relied upon. Clause and effect are inseparable. What was the cause of this confiedence and respect? Tad word was his bond, he held honor and integrity as a guiding star. Not a flatterer, but a plain spoken man standing four square for what he conceived to be right and just. We assure the bereaved family that we share with them the sorrow that must come to all at the loss of such -a loved one and frined. S .W . Sears had been a member of the council since September 1928, and his gn ial face -and fine business .advice will be missed by the body of whilch he was a member so long. F C. Dresser, H. G. Johnson, j  W. Cawthorn, Committee."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Cawthorn"], "snippet": "Dresser, H. G. Johnson, <mark>j</mark>  <mark>W</mark>. <mark>Cawthorn</mark>, Committee."}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Cawthorn"], "snippet": "Dresser, H. G. Johnson, <mark>j</mark>  <mark>W</mark>. <mark>Cawthorn</mark>, Committee."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.98, 815.41, 1920.21, 1139.75], "bbox_id": "c692ca3e09", "file": "AppomattoxNewspapers_1905-1912a_0530.pdf", "page": 1, "text": "On th e Appomattox Mr. and Mrs. J. W. Paris en tertained a num ber of young people on Monday night at their home. There was music, gam es and fun until a late hour when refreshm ents were served. The table was beautifully deco rated in ferns and arbutus, and cream, cakes, candies and fruit were served. All seemed to enjoy themselves and were sorry when Home Sweet Home was played. Miss Lelia Tweedy, of Roa noke, spent E aster at home. Misses L aura Tweedy and Ella Inge are a t Rome from school. Miss Louis Morriss died at the home of her brother-in-law, Mr. J. W. Cawthorn, last Sat urday. H er body, accom panied by Mr. and Mrs. J. W Caw thorn and R uth Cawthorn, was tak n to Farm ville for burial."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of her brother-in-law, Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, last Sat urday. H"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of her brother-in-law, Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, last Sat urday. H"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.09, 785.07, 1207.58, 931.17], "bbox_id": "33063670c9", "file": "AppomattoxNewspapers_1933-1936a_0535.pdf", "page": 1, "text": "of Newport News, spent Thursday night in the home of Mrs. J. W Cawthorn.  -O- Mrs. Rothwell Smith, of Glad stone, Miss Ada Davis, of Richmond, and Rorrer A. James J r., of Dan ville were guests last week of Mr.  and Mrs. Joel W Flood, o Mr.and Mrs. Wiley Godsey, Dor othy and Winston Godsey and Law rence Moore, of Appomattox and Miss Hilda Shelton, of Lynchburg, spent Sunday at Ocean View, and Norfolk."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the home of Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>.  -O- Mrs. Rothwell Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "the home of Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>.  -O- Mrs. Rothwell Smith,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1496.89, 289.95, 1656.31, 492.2], "bbox_id": "4924762f5b", "file": "AppomattoxNewspapers_1918-1922a_0081.pdf", "page": 1, "text": "of Jerry A. Burke in this issue. W antedG o o d tenant to work farm on shares. M bs D. E . C a l d w e l l . I will buy 25 shares Farmers National Bank stock. W. B. C a l d w e l l Miss Louise Inge is visiting at the home of Mr. and Mrs. J. W. Cawthorn this week M i s s Etheliene Glenn, of Princeton, West Virginia, has been visiting Miss Macie Inge. Read auction sale of Appo mattox oounty farm in Classi fied Column."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> this week M i"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> this week M i"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1382.45, 1351.12, 1515.29, 1414.02], "bbox_id": "484d5e58d8", "file": "AppomattoxNewspapers_1926-1933a_0322.pdf", "page": 1, "text": "Nell Cawthorn, of Kile State Teac.hers Col- ent several days last iwith her parents, Mr. rs. J. W. Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "J", "W", "Cawthorn"], "snippet": "Nell <mark>Cawthorn</mark>, of Kile State Teac.hers Col- ent several days last iwith her parents, Mr. rs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "J", "W", "Cawthorn"], "snippet": "Nell <mark>Cawthorn</mark>, of Kile State Teac.hers Col- ent several days last iwith her parents, Mr. rs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1384.06, 1327.38, 1677.21, 1390.53], "bbox_id": "d18d1184e4", "file": "AppomattoxNewspapers_1908-1909a_0322.pdf", "page": 1, "text": "Nell ? Cawthorn, of I  lie State Teachers. Col- Friday evening Monroe ent several days last  Lodge had an official visit  th her parents, Mr. Trom Grandmaster Jno. T.  s. J. W. Cawthorn. Cochran, of The Planes."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Grandmaster Jno. T.  s. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Cochran, of The Planes."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Grandmaster Jno. T.  s. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Cochran, of The Planes."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1350.25, 421.22, 1503.69, 842.11], "bbox_id": "1b3ef66998", "file": "AppomattoxNewspapers_1908-1909a_0419.pdf", "page": 1, "text": "Mrs. W B. Caldwell who has len ill is better.  Mrs. 0. R. Turnes is reported i be ill. Little Nancy Moss, who has pen sick is better. J Chas. F. James visited his par- lits at Dendron for the holidays. Miss Ruth Clement gave a ridge party to her friends dur- ig Christmas. 1 Miss Mary Gills, of Lynchburg ps been on a visit to the family  J. W. Cawthorn here.  Misses Lucy Smith and Lucy aldwell are down with flu and fiss Emma Smith is sick. I Mr. and Mrs, J , - W. Carter,  Brookneal,wpre visitors at W. , Browns Xmas. I Mrs. G. A. Runner came in fomDhio to attend the funeral her aunt, Miss Alice Paris St week. LA big Christmas dance was Irgely attended - at the Hotel ppomattox Thursday evening  was a most enjoyable affair. Willie Coleman, of Washing- kn, D. C , was in Christmas to le Daddy and his sister, Mrs. Benn."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "visit to the family  <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> here.  Misses Lucy Smith"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "visit to the family  <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> here.  Misses Lucy Smith"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2164.29, 207.33, 2338.66, 698.27], "bbox_id": "89460561d7", "file": "AppomattoxNewspapers_1908-1909a_0238.pdf", "page": 1, "text": "Mrs. O. L Schaffler, 7.25 Horace Siirey, 19.50 Frank Smith,  Alice Lee Smith, 2 Helen Dickerson, 2 Annie Elder, 0.50 Mrs. W. I Brown, 6  Mrs. W. H. Conner, 1.25 Mrs. J. W. Cawthorn, 9.50 Bessie Christian, 0.50 Mrs. L. F. Caldwell, 1.50 Es telle Dickerson, 9.75 John Doss, il . Mrs. J. L. Foster, 4.25 Mrs. J. R. F o r d , 1 Mrs. .Pitzer Gills, 2 Mrs. D. B. .Henderson, 9.59 Mrs, Z. T. Moran, 9.50 Willie Mor ris, 1.75  Yemell MitcheU, 0.50 W. W. Martin, 8.50 Mrs. H. B. Pack, 6 Mrs. J. M. Rosser, 0.75  Mrs. M- C. Smith, 2.75  Mrs. Grey Smith, 1.25 C. H. Smith, 3 Mrs. J. E. Sears, 2 Frances Smith, 1 Clyde Thomas, 1 E. Le- Roy Smith, 19 Louise Tuzpes, 0.25  - Mrs. J. B. Wheeler, 0.25 Helen Smith, 9.60 Fred Tumes, 1 E. L. Upton, 1.75  Mrs. N. A. Wages, 1 . H. Carson, 1.50H- C. Cole, 1.60  Virginia C h r istian, 0.50 Mrs. Thelma CaldweU, 1.50 Mrs. H. C. Babcock, 3.25 Leonard BlackweU, 3 Mrs. C. -N. Abbitt, 1  M rs. Frank Dresser, 1  Evelyn Dic kerson, 0.50 Mrs. L. W. Car ter, 1 Mrs. Jack Caldwell, 3.25 M. Avis Brown, 1 F. T. Cawthorn, 8 Grace! Caldwell, 1 F. T. Cawthorn, 3 B. G- Anderson, 2 Mrs Lottie Bledsoe, 8 P. W. Cal lahan, Colored Exhibit 50 Mice Mannie Inge,,5,1st prize but second money on account of no competition. ________ g"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 9.50 Bessie Christian, 0.50"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 9.50 Bessie Christian, 0.50"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1683.6, 226.57, 2329.3, 456.88], "bbox_id": "ca4165e700", "file": "AppomattoxNewspapers_1926-1933a_0237.pdf", "page": 1, "text": "Mrs. O. L. Schaffler, 7.25 Horace Shirey, 19.50 Frank Smith, 3 Alice Lee Smith, 2 Helen Dickerson, 2 Annie Elder, 0.50 Mrs. W. L. Brown, 6 Mrs. W. H. Conner, 1.25 Mrs. J. W. Cawthorn, 0.50 Bessie Christian, 0.50 ------ Hnwntn work with prepared and are now being u.ov  v., We offer you just w hatyou, of Teachers as last mailed out, we are informed by Mrs. L. F. Caldwell, 1.50 Es- need, and we can prove ?Mr a  e e  ijment which the eecretary.  K  telle Diekerjon, , morft f . W u ___ 1 . 1 . f.J TV HKlAwraiT ivflfi fit A heat lStl ?. Mrs. J. L. Foster. No service lasts more than one hour, but every minute filled with inspiration. Sunday school Sunday, Sept. 28th, 945 .A. M. Preaching at 11 A. M. Epworth League at 7 P. M. We worship in the evening with the Presbyterians. The 4th Quarterly confer ence meets Tuesday, Sept. 30, 730 P. M."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.50"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25 Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.50"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.9, 203.73, 2336.99, 693.76], "bbox_id": "330487dfd7", "file": "AppomattoxNewspapers_1908-1909a_0237.pdf", "page": 1, "text": "Mrs. O. L. Schaffler, 7.25 119-5 Frank Smite, 8  JUlee Lee Smith, 2  Helen Dickerson, 2 Annie Elder, 0.50 Mrs. W. L. Brown, 6 Mrs. W. H. Conner, 1.25  Mrs. J. W. Cawthorn, 0.50 Bessie Christian, 0.50 Mrs. L. F. Caldwell, 1.50 Es telle Dickerson, 0.75 John Doss, jl-Mrs. J. L. Foster, 4.25 Mrs. J. R. F o r d , 1 Mrs. -Pitser Gills, 2 Mrs. D. B. .Henderson, 0.50 Mrs. Z. T. Moran, 0.50 Willie Mor ris, 1.75 Vernell Mitchell, 0.50 W. W. Martin, 8.50 Mrs. H. B. Pack, 6 Mrs. J . M. Rosser, 0.75 Mrs. M. C. Smith, 2.75 Mrs. Grey Smith, 1.25 C. H. Smith 3 Mrs. J. E. Sears, 2  Frances Smith, 1 Clyde Thomas, 1  E. Le- Roy Smith, 10  Louise Turnes, 0.25   Mrs. J. B. Wheeler 0.25 Helen Smith, 0.50 Fred iTurnes, 1 E. L. Upton, 1.75 Mrs. N. A. Wages, 1 E. H. Carson, 1,50 R. C. Cole, 1.50  Virginia C h r istian, 0.50 Mrs. Thelma Caldwell, L50 Mrs. H. C. Babcock, 3.25 Leonard Blackwell, 3 Mrs. C. N. Abbitt, 1 Mrs. Frank Dresrer, 1 Evelyn Dic kerson, 0.50 Mrs. L. W. Car ter, 1 Mrs. Jack Caldwell, 8.25 M. Avis Brown, 1 F. T. Cawthorn, 8 Grace Caldwell, !  F. T. Cawthorn, 8 B. G. Anderson, 2 Mrs Lottie Bledsoe, 8 P. W. Cal lahan, Colored Exhibit 50 Miss Mannie Inge, 5,1st prize but second money on account of no competition."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25  Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.50"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H. Conner, 1.25  Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, 0.50 Bessie Christian, 0.50"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.52, 679.41, 1655.81, 726.91], "bbox_id": "3febb5179c", "file": "AppomattoxNewspapers_1918-1922a_0073.pdf", "page": 1, "text": "Mrs. J. W. Cawthorn and two children, Nell and Billy,  are visiting hur daughter, Mrs J. A. Tweedy, this we k."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and two children, Nell and Billy,  are visiting hur daughter, Mrs <mark>J</mark>. A. Tweedy, this we k."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and two children, Nell and Billy,  are visiting hur daughter, Mrs <mark>J</mark>. A. Tweedy, this we k."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.75, 1466.93, 1482.35, 1494.93], "bbox_id": "24e3d2262f", "file": "AppomattoxNewspapers_1933-1936a_0132.pdf", "page": 1, "text": "Mrs. J. W. Cawthorn and daughter Nell, returned yesterday after i visit in Mount Hope, W. Va."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and daughter Nell, returned yesterday after i visit in Mount Hope, <mark>W</mark>. Va."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and daughter Nell, returned yesterday after i visit in Mount Hope, <mark>W</mark>. Va."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [923.5, 996.8, 1083.45, 1067.75], "bbox_id": "34328bd10d", "file": "AppomattoxNewspapers_1933-1936a_0369.pdf", "page": 1, "text": "Mrs. J . W. Cawthorn and daughter Nell, returned today after visiting in M t. Hope, W . Va.  o  Mrs. S. J. Evans and daughter, Majorie, Gharjes Ai Truax 1 and Meredith Evans and Jack Furbush, spent Tuesday in Roanoke."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark> and daughter Nell, returned"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark> and daughter Nell, returned"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.52, 540.19, 1653.31, 776.83], "bbox_id": "eb50dbdef3", "file": "AppomattoxNewspapers_1908-1909a_0318.pdf", "page": 1, "text": "Mrs. A. C. Bledsoe, who has been sick during the past week is improving, whis is good news to her many friends here. Mr. and Mrs. J. H. Lucado, accompanied by Miss Eliza_ beth Phelps, spent last week- snd in Richmond. Mrs. J. W. Cawthorn, Mr? Lilly Gregory and Miss Emm Gregory were recent visitor in Farmville. Miss Frances Gordon, who s a teacher in Blstckstone, wil pend Christmas with her par ents near here."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "snd in Richmond. Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Mr? Lilly Gregory and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "snd in Richmond. Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Mr? Lilly Gregory and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.23, 629.98, 1692.84, 742.97], "bbox_id": "ced29d2093", "file": "AppomattoxNewspapers_1926-1933a_0395.pdf", "page": 1, "text": "Mr. Ned Hancock left today! for Williamsburg to b ing Misses Corine Hanco k, Alice Harwood and several of their riends home for the holidays. For Rent  The residence of Dr. Jas. B. Abbitt just vacated by J. W. Cawthorn. Apply Miss E ula B urke . 14-2t"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Abbitt just vacated by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Apply Miss E ula"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Abbitt just vacated by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Apply Miss E ula"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [665.04, 1130.21, 809.62, 1140.21], "bbox_id": "0d1340fe8d", "file": "AppomattoxNewspapers_1898-1902a_0414.pdf", "page": 1, "text": "Mr. J. W. Cawthorn, Jr., one ol"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., one ol"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., one ol"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1547.3, 1304.06, 1707.85, 1362.56], "bbox_id": "84cd9fe228", "file": "AppomattoxNewspapers_1905-1912a_0322.pdf", "page": 1, "text": "Mr. and Mrs. J. W. Moore, Basil Moore and Jesse Gawthorn have re tnrned to their homes at Warren from a visit to Mr. J. W. Cawthorn, at Bed Honse."}, "highlight": {"text": {"matched_tokens": ["J", "W", "J", "W", "Cawthorn"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Moore, Basil Moore and Jesse Gawthorn have re tnrned to their homes at Warren from a visit to Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, at Bed Honse."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "J", "W", "Cawthorn"], "snippet": "Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. Moore, Basil Moore and Jesse Gawthorn have re tnrned to their homes at Warren from a visit to Mr. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, at Bed Honse."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.58, 390.05, 1821.51, 1381.17], "bbox_id": "67cbd95959", "file": "AppomattoxNewspapers_1918-1922a_0177.pdf", "page": 1, "text": "Misses Wave Turnes and Earle Patteson are visiting relatives in Charlotte this week MÍ88 Mary Covington, of Hollywood, is visiting relative n L nchburg this week Miss Susie Hancock, who hot been tea chin tr at Him field, Va , is spending her vacation it home here Prof, nnd M8 Irawley a n  young Charles are taking e vacation at the hme of M th rawlex, in the Valiev Mr. Rurnett, the electrical nr aintainer, will soon have his frmily here. He will occupy the cottage of Mr. Patteson Mr and Mrs Simpkins and Mrs. J W. Cawthorn spent the week end with her daughter Mrs. John Tweedy, uear here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotte county, spent tne week end with her aunts, Mesdaines J. W. Patteson and L D. Puck ette. Mr. and Mrs Chandler 8imp kins, of Ricinnorid, have beet, visiting Mrs. .Simpkinsparents Mr. end Mrs J W C.twtbori here. Miss Helen Morris, of V.wa pent several days l..at weoi with Miss K a Harvey here on tier way home I rom Rich inond College. Mrs. F 1. Craig and sor Frank, ure visiting Mrs Craig fa her, ai  Allendale , Mi Craig stopped for a úy on hi wiy to N Y. Mr H. P. E as , son of Rev H. Farlott E tst, has gone to Berry ville, Vw , , lor the Bummer where he is employed in Dr A. W. Warners pharmacy. Mr. W. 0 M ohs has been vis it ing his old home in North Carolina. He was accompu nied here by his father anc brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, Va , after spending a few days at the fiaptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo mattox. The quality of our wheat is good and speculators are said to be buying up the farmers bread before it íb threshed, fie careful how you part with your bread. The Editor reoeived an invi tutiou to be present at tbe marriage of Frank Green and IS trail Ahbitt Burke H.inday morning. These are old and reliable colored citizens of Ap I pomutti x A wedding supper was enjoyed Monday evening The ladies of New Hope church will have a lawn party at parsonage, Vera, Vo,, Sat urday, June ljfii, beginning at 5 oclock. Proceeds tor benefit of new church. Did cburch  will be sold at 4 oclock. Pub I lie coidiaily invited, j K. L. Burke, cashier of Bank of Appouiaitox, and chairman ot Group our ot the Virginia Bankers Association, left to day to aiteud the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Spring.-, Ve,, June 17, lo and 19."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [623.99, 379.71, 788.48, 1367.69], "bbox_id": "8d957fe034", "file": "AppomattoxNewspapers_1918-1922a_0174.pdf", "page": 1, "text": "Misses W ave Turnas and Earle Patteson are visiting relatives in Charlotte this week . Miss Mary Covington, of Hollywood, is visiting relatives m Lynchburg this week M isfl Susie Hancock, who hap been teaching a t Biuefield, vV. Va , is spending hvr vacation at home here. Prof, ond Mrs Crawley and young Charles are taking a vacation at the home of Mrs raw ley, jn the Valley. Mr. Buroett, the electrical m aintainer, will soon have his fam ily here. He will occupy the cottage of Mrs. Patteson Mr and Mrs Simpkins and Mrs. J W. Caw thorn spent the week end w ith her daughter Mrs. John Tweedy, near here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char Iotte county, spept toe week end w ith her aunts, Meadaraes. J. W. Pattason and L 1, Pnek ette. Mr. and Mrs Chandler Simp- kinp, of Richmond, have been visiting Mrs. Sim pkins parents, Mr. and Mrs. J. W Cawthorn, here. Miss Helen Morris, of Vera, spent severa day6 i..st week with Miss Eva H arvey hre, on her way home from Rich tooni College. Mrs. F .,J. Craig and son, Frank, are visiting Mrs Craigs father, at  Allendale . Mr Craig stopped for a uay on his way to N. Y. Mr. H. 8. East, eon of Rev. H. Parlett East, has gone to Berry ville, Va., tor the summer, where he is employed in Dr. A. W. W arners pharm acy. Mr. W. O Moss has been vis iting his old home in North Carolina. He was accompa nied here by his father and brother for a visit. Miss Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Em poria, V a , after spending a few days at the baptist parsonage, have return ed to their homes. Next week the hum of the binder will be heard in Appo m attox. The qaaiity of our w heat is good and speculators are said to be buying up the farm ers bread before it is threshed. Be careful how you part with your bread. The Editor received an invi tation to be present at the m arriage of Frank Green and Sarau A bbitt Burke Sanday morning. These are old and reliable colored citizens of Ap pomttox. A wedding supper was enjoyed Monday evening. Tho ladies of New Hope cburch will have a lawn party at parsonage, Vera, Va., Sat urday, June 19th, beginning at 5 oclock. Proceeds ior benefit of new church. Old church will be sold at 4 oclock. Pub lie cordially invited. R. L. Burke, cashier of Bank of Appomattox, and chairm an of Group Four of the Virginia Bankers Association, left to day to attend the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Springe, Va., June 17, 18 ana 19."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>, here. Miss Helen Morris,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>, here. Miss Helen Morris,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.94, 725.46, 1936.33, 865.05], "bbox_id": "eddd843ad0", "file": "AppomattoxNewspapers_1943-1947a_0317.pdf", "page": 1, "text": "Misses Harriett Cale and Betsy Higginbotham, of S. T. C., Barm. ville will spend the holidays at their homes here. Mr. and Mrs, Owen Persingr, j f Iren Gate, are visiting Mr. and Mrs. J. H. OBrien. Mrs. R. C. Smpkins, of Mount .ope, W. Va , is. visiting her fath- r, J. W. Cawthorn. Local schools will reopen Mon I lay after the Thansksgiving holi- lay."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "visiting her fath- r, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Local schools will reopen"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "visiting her fath- r, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Local schools will reopen"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.94, 257.23, 1668.86, 1220.78], "bbox_id": "c23e22c711", "file": "AppomattoxNewspapers_1908-1909a_0210.pdf", "page": 1, "text": "Misses Anna and Nina Jones and- Frank Stratton attended the Christmas Pageant Holy Night pven at S. Pauls in Lynchburg Sunday night  T. A. Woodsoii has appendi citis.    9    L. C- Mitchell returned Mon- lay-night from a two weeks isit -in Washington, D-, C. Mrs- J. L. Clark, of Ever green, who has been ill is somewhat better. Mr. and Mrs. David Cald well visited in Richmond tost week-  - 7 - - Alfred McFadden is a pat ient in the Soldiers Home hos pital at Hampton, Vs- Mrs- Belle Payne, formerly jf this county, is ill at th-i home of Miss Dora Thornhill, of Roanoke. Dr- D- A. Christian took his ton, William, to a specialist in Lynchburg, Wednesday morn ing to have his ears lanced. A. H. .it-ment, special Com missioner, sold, the J- J- Wood xarm at Spring Mills, Saturday 0 Mr. J. G. Wood for 4150 cash. Mr. and Mrs- G. L. Doss and daughter Mary Leiern and ivirs. Ola Patterson visited tn .aters sister, Mrs- W- S. Bry ant, at Cullen, Sunday. W- W- Mitchellr-foreman o. .he Garment Factory, of Appo mattox, was confined to hii. .tome with the ftu last week- Mrs. R- C. Simpkins ana children, of Mt. Hope, W. Va-, iave arrived in Appomattox to -pend the Christmas holidays with. Mrs- Simpkins parents, Ar. and Mrs. J- W. Cawthorn- -- Ttfii r-j - Recent visitors in the.home f Mrs. C. T. Moses include Misses Mary Lee and Mildred. Godwin, of S. T- C., Farmville, and Mr and Mrs- W. H. God win and children, of Richmond.- H. G- Smith and daughter, Miss Mamie Churchhill, of Fay- jtteville, N- C-, were guests las Week of Misses Emma and Lu cy Smith- Jimmy Carter, of Brook aeal, has been given the posi ion of depot agent at Spou brings. It is probable th Mr. and Mrs. Carter will mak  .heir home in Appomattox- News has been received hert of , the marriage in Hillsvilie Va., of Miss Serena Pendleto to John R- Hollingsworth Mrs- Hollingsworth was  fre juently the guest of her cousin, Miss Elizabeth Hancock. . Mrs. H. B- Pack, who has jeen a patient in the Baptis hospital, has, returned to hex hornet  J  Mrs. Judson- Bush, of Nor folk, has returned home afte- pending some time with her orother, Rob Caldwell, who is xick at his home, East Ridge. Mrs. Oscar Moss and daughter, Nancy, of Lynch-"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Ar. and Mrs. <mark>J</mark>- <mark>W</mark>. <mark>Cawthorn</mark>- -- Ttfii r-j - Recent visitors"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Ar. and Mrs. <mark>J</mark>- <mark>W</mark>. <mark>Cawthorn</mark>- -- Ttfii r-j - Recent visitors"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2019.85, 881.24, 2180.52, 1054.98], "bbox_id": "00430d3dc4", "file": "AppomattoxNewspapers_1926-1933a_0205.pdf", "page": 1, "text": "Miss Nell Cawthorn, of Gold Hill, spent the week-end with her parents, Mr- and Mrs. J. W. Cawthorn- Miss Florence Gregory and Mrs. Helen Welch were dinner guests of Mr land Mrs. E. H. Hancock, in Lynchburg Satur day. I Mr. and Mrs. L. B. White- I house and son, of Lynchburg, and Mrs. Anna Record, of Maine, were dinner guests at the C. F. James home Satur day evening."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr- and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>- Miss Florence Gregory and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr- and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>- Miss Florence Gregory and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [508.29, 389.08, 668.74, 715.17], "bbox_id": "735cad3043", "file": "AppomattoxNewspapers_1933-1936a_0093.pdf", "page": 1, "text": "Miss Mary Jamerson will leave or. Saturday to attend summer school at William and Mary. P 4 Recent visitors of Mr. and Mrs. Pat Coleman were Mr. and Mrs. Stover Morris, of Ringgold.    Mr. and Mrs. W. W. Mitchell am family will spend this week-end witl relatives in Richmond.   Misses Virginia Reynolds and Cor ine Hancock motored to Richmond to spend several days.    Mrs. R. A. Glenn and Mrs. Henry Caldwell and son spent Tuesday kith friends in Farmville.    Rev. and Mrs. A. S. Anderson and family, of Cramerton, N. C. are vis iting her sister, Mrs. J. W. Cawthorn.    Mrs. W. T. Steele and Mrs R. F. B Steele and son visited Mrs. J. B. Abbitt in Norfolk last week.   e Mr. and Mrs. J. E. Sears, Mrs. Robert Irby and Miss Lula Irby were in Blackstone Sunday. Miss Eddy Hardy, of Lynchburg, is visiting in the home of Mr. and Mrs. R. L Burke."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "iting her sister, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>.    Mrs. <mark>W</mark>. T. Steele"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "iting her sister, Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>.    Mrs. <mark>W</mark>. T. Steele"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.38, 593.53, 1508.98, 627.78], "bbox_id": "0618216b04", "file": "AppomattoxNewspapers_1926-1933a_0419.pdf", "page": 1, "text": "Miss Mary Gills, of Lynchburg s been on a visit to the family J. W. Cawthorn here."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Miss Mary Gills, of Lynchburg s been on a visit to the family <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> here."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Miss Mary Gills, of Lynchburg s been on a visit to the family <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> here."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [809.73, 474.03, 966.78, 521.68], "bbox_id": "977792af9c", "file": "AppomattoxNewspapers_1898-1902a_0414.pdf", "page": 1, "text": "Miss Edna Cawthorn came home from college to spend Christmas with her parents, Mr. and Mrs. J. W. Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Cawthorn", "J", "W", "Cawthorn"], "snippet": "Miss Edna <mark>Cawthorn</mark> came home from college to spend Christmas with her parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Cawthorn", "J", "W", "Cawthorn"], "snippet": "Miss Edna <mark>Cawthorn</mark> came home from college to spend Christmas with her parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.11, 571.2, 1690.48, 713.95], "bbox_id": "270d44f6db", "file": "AppomattoxNewspapers_1908-1909a_0395.pdf", "page": 1, "text": "Miss Bessie V larwood, of I Richmond, came home yesterday j 0 rest of the week. Mr. Ned Hancock left today for Williamsburg to biing Misses Corine Hanco k, Alice Harwood and several of their riends home for the holidays. For RentThe residence oil Dr. Jas. B. Abbitt Ju st vacated! by J. W. Cawthorn. Apply"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Ju st vacated! by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Apply"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Ju st vacated! by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Apply"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [682.13, 1016.59, 938.81, 1269.52], "bbox_id": "6964731f2a", "file": "AppomattoxNewspapers_1926-1933a_0500.pdf", "page": 1, "text": "Med ical College of Virginia. Mr. and Mrs. Howard Glenn of New York, were guests last week in the home of the Rev. W. M, Thompson. Mrs. Mattie Moss and daugh ter, Nancy, of Lynchburg, visit- jfrom the hospital, ed last week-end in the home i g of Mrs. Ola Furbush. Mrs. Carrie Hunter Willis, of Frederickburg, has been visit ing Miss M. Anna Jones and  while here took part on the Memorial Day program, held at the Confederate cemetery. Miss Nell Cawthorn returned to Mt. Hope, W. Va., with her sister, Mrs. R. C. Simpkins, who has been visiting in the home of J. W. Cawthorn. Mr. and Mrs. W. M. Thomp-"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "in the home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Mr. and Mrs. <mark>W</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "in the home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Mr. and Mrs. <mark>W</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1195.88, 948.07, 1356.33, 976.52], "bbox_id": "f595de26a8", "file": "AppomattoxNewspapers_1933-1936a_0477.pdf", "page": 1, "text": "Ma. Bernice Wilkerson, of Phila delphia is vititing her sister, Mrs. J . W . Cawthorn."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Ma. Bernice Wilkerson, of Phila delphia is vititing her sister, Mrs. <mark>J</mark> . <mark>W</mark> . <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Ma. Bernice Wilkerson, of Phila delphia is vititing her sister, Mrs. <mark>J</mark> . <mark>W</mark> . <mark>Cawthorn</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1856.82, 302.56, 2025.01, 929.84], "bbox_id": "a5ca5c2245", "file": "AppomattoxNewspapers_1949-1952a_0505.pdf", "page": 1, "text": "Lynchburg were dinner guests of Mrs. Jennie Johnson Sunday night. Mrs. S. J. Evans and daughter Ann will spend the week end with Mrs. Jennie Johnson. Rev. and Mrs. R. Carl Maxwell, Mrs. Rachael Lawson, and Mr. Ric hard D. Robinson attended a lun cheon meeting of Red Cross coordi nating committees at the Roanoke Hotel in Roanoke, Thursday, January 10. The next bloodmobile visit to Ap pomattox will be made April 19. Lieutenant Governor and Mrs. L. P. Collins of Marion were the week end guests of Congressman and Mrs. Watkins M. Abbitt. Mr. and Mrs. Channing Simpkins of Mount Hope, West Virginia, spent the Week end with Mrs. Simpkins father, J. W. Cawthorn. The Simp kins were en route to Florida for a vacation. R. L. Burke continues ill at his home here. The Burke relatives here during the week end included Mr. and Mrs. R. F. B. Steele and two daughters of Petersburg, Mr. Hallie Burke of Floyd, Mr. and Mrs. R. F. Burke of I ynchburg, and Mr. and Mrs. Douglas Williams of Brookneal. Miss Mar jorie Woody returned to Washington, Wednesday, after spend ing the past two months here as sec retary to Congressman Watkins M. Abbitt. Mrs. Lewis Winters who has Been a patient at the Lynchburg General Hospital, was carried to the Univer sity Hospital Wednesday, for further treatment. Mrs. W. B. Ellett of Roanoke is spending some time withe her sister, Mrs. Richard L. Burke. Billy Conner wil leave Friday for vacation in Florida. While away he will visit Harry G. Lawson, USN, Jacksonville. His mother, Mrs. Verna Conner, will accompany him as far as Rocky Mount, where she will visit elatives. Herbert C. Pulliam is spending sev eral days in Richmond, attending the opening sessions of the Virginia egislature. Mrs. Frank C. Dresser is in Lynch burg with her great nephew, William Herndon, Jr., who underwent an ope- ation at the Virginia Baptist Hos pital today. Mrs. Floyd Mitchell has returned home from Virginia Baptist Hospital where she underwent an operation Monday."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "with Mrs. Simpkins father, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. The Simp kins were"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "with Mrs. Simpkins father, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. The Simp kins were"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1357.84, 476.52, 1497.53, 835.06], "bbox_id": "06768dd34e", "file": "AppomattoxNewspapers_1926-1933a_0375.pdf", "page": 1, "text": "le friends of Clarence Agee be glad to learn he is im- ng at Soldier Home. f Sale1 Hot Point two Electric Stove. Apply M rs . L. R. G ills . as Nina Jones is visiting her er, Dr. H. E. Jones, of oke. ss Louise Shirey, recently ated from Sheltering Arms ital, Richmond. J. W. Cawthorn, Jr., is again after a fall which ured a rib. irke Steel and several friends ichmond, were week-end irs here last week. ss Nell Cawthorn is on a to her sister, Mrs. Simpson, t. Hope, W. Va. . and Mrs. L. M. Ringham children, of W. Va., are ng parents at Hotel Appo- BX. lcombe and Frances Cald- are home from an extended to Charleston, S. C."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Sheltering Arms ital, Richmond. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., is again after"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Sheltering Arms ital, Richmond. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., is again after"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.08, 651.04, 2043.14, 1224.08], "bbox_id": "a906ed66d4", "file": "AppomattoxNewspapers_1905-1912a_0528.pdf", "page": 1, "text": "Ladies Aid Society off the church will art the satne J tim e sell refteahtoieiitB flftKfttffe are requested to bring, boxes- There Will be a cakew biolrw ilt go to the most1 pofidfaY gift. The proceeds of this ente tafti- m ent will be uBed for thSbene fit of the church Whlh isbehig repaired. The public is cordi ally invited to attend and help a good cause. The rem ains of Mrs. John H. OBrien, who died in Lynch burg last week, were laid to rest at her home in this county ast Thursday. The funeral service w as conducted by Rev. J . J. Spencer before a . large concourse of friends and rela tives. The deceased was about 65 years of age and was a member of B.ethel Methodist Church. W ell we may say a goOd woman has gone to her rew ard and one th a t will be greatly missed as she w as evSr ready to assist those in pdin and sorrow. We are sad to report thV death of Miss Louie Morris, who died a t the home o f her sister, Mrs. J. W . Cawthorn, on Saturday last. ShV had been a g reat sufferer for a long tim e from th at dtead dissdse consum ption apd her death was not unexpected Death is sad at all times, but it in- more sad to see the young taken aw ay in the bloom of ydiith We believe tbat she has erftfcY- ed th at fair and hals lhtt where no pain or death Will ever enter. She led a  ifihdei Christian life, gentle id dlftjfMkf- tion and to knew her was to loye her."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "f her sister, Mrs. <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark>, on Saturday last. ShV"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "f her sister, Mrs. <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark>, on Saturday last. ShV"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [462.71, 1584.69, 576.44, 1738.54], "bbox_id": "4de2cba520", "file": "AppomattoxNewspapers_1952-1954a_0078.pdf", "page": 1, "text": "Joel W. Flood C. W. Smith J. H. OBrien Mrs. W. R. Reynolds C. S. Jenkins H. Y. Spencer D. A. Connor J. W. Cawthorn Oscar Jamerson Chas, F. James"}, "highlight": {"text": {"matched_tokens": ["W", "W", "J", "W", "J", "W", "Cawthorn"], "snippet": "Joel <mark>W</mark>. Flood C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Mrs. <mark>W</mark>. R. Reynolds C. S. Jenkins H. Y. Spencer D. A. Connor <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Oscar Jamerson Chas, F. James"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "W", "J", "W", "J", "W", "Cawthorn"], "snippet": "Joel <mark>W</mark>. Flood C. <mark>W</mark>. Smith <mark>J</mark>. H. OBrien Mrs. <mark>W</mark>. R. Reynolds C. S. Jenkins H. Y. Spencer D. A. Connor <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Oscar Jamerson Chas, F. James"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [814.11, 992.56, 972.2, 1029.53], "bbox_id": "a6768c32e6", "file": "AppomattoxNewspapers_1926-1933a_0212.pdf", "page": 1, "text": "J. W. Cawthorn Is Appointed Sergeant"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "<mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Is Appointed Sergeant"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "<mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Is Appointed Sergeant"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1048.8, 1219.16, 1351.85, 1249.56], "bbox_id": "9683517c57", "file": "AppomattoxNewspapers_1933-1936a_0071.pdf", "page": 1, "text": "J. W CAWTHORN, Clerk of Council We have checked up entries and disbuhsemenia and believe them 0 K for year ,1933."}, "highlight": {"text": {"matched_tokens": ["J", "W", "CAWTHORN"], "snippet": "<mark>J</mark>. <mark>W</mark> <mark>CAWTHORN</mark>, Clerk of Council We have checked up entries and disbuhsemenia and believe them 0 K for year ,1933."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "CAWTHORN"], "snippet": "<mark>J</mark>. <mark>W</mark> <mark>CAWTHORN</mark>, Clerk of Council We have checked up entries and disbuhsemenia and believe them 0 K for year ,1933."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1575.49, 473.82, 1740.67, 1066.8], "bbox_id": "66c4fedd20", "file": "AppomattoxNewspapers_1912-1915a_0243.pdf", "page": 1, "text": "Irish PotatoesFirst prize, R C W agner second, F A OBrien third, L E Smith PeppersFirst prize, D A Conner second, Miss Enwia Smith Tom atoes  First prize, no tag second, T H Inge third, L G Caldwell Lim a BeansFirst prize, W P Gills second, L M Southall third, R I? Caldwell Peanuts  First prize, Carl Blackwell second and third, R C W agner B ean s First and second prize, D A Conner PeasFirst prize, D A . Con ner second, J D Childress PumpkinsFirst prize, R E Cheatham second, W 8 Child ress third, -H B Jennings W aterm elons  First prize, W iley Morris s TurnipsF irst prize, J W Cawthornsecond, L G. Cald well -i OnionsFirst prize, E L Up ton second, H enry Oder  Stock BeetsFirst prize, T A Smith second, J T Cawthorn third, W W Martin Apples and Pears-First prise thres plates, R C W agner first prize, single plate, C F_ Smith first prize, box W inesap, R C W agner first prize, box Ben Davis, R C W agner first prize, plate, York Im perial, A D Fer guson first prize, pears, R C W agner second, R C Harvey third, M iss Em m a Sm ith W ine  First prize, grape, Frank Babcock second, J W Cawthorn third, Frank Bab cock. First prize, dewberry, Mrs J R Atwood second, Mrs W ilkerson third, Mrs M L Moore"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "grape, Frank Babcock second, <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark> third, Frank Bab cock."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "grape, Frank Babcock second, <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark> third, Frank Bab cock."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.19, 1273.11, 2042.48, 1379.21], "bbox_id": "d2e6303346", "file": "AppomattoxNewspapers_1908-1909a_0292.pdf", "page": 1, "text": "In the Clerkrs Office of the Cer- .  iTILrf 2RlA. cuit Court of the County of Second. A tra t A Appomattox on theL7th day acres, situated m said County of February 1930. and District and about  nile Laura O. Johnson,, who Bues by L orth of the above named tract I A. W. Almond her known as Indian Field and against  was conveyed to said C. S. j Bennie H. Johnson, Defendant. Cawthorn by J. W. Cawthorn I The-object o rth is suit ia tojnd wife. all of which deeds"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Johnson, Defendant. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> I The-object o rth"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Johnson, Defendant. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> I The-object o rth"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1899.11, 941.47, 2064.36, 1303.1], "bbox_id": "fa2652b978", "file": "AppomattoxNewspapers_1933-1936a_0040.pdf", "page": 1, "text": "holidays here with her parents, Mr. and Mrs. G. O. Gordon.    Miss Dorothy Evans, of Rich mond, will spend several days during Christmas in the home of C. W.,Smith. .     Mrs. R. W. Simpkins and I son, of Mount Hope, W, Va. are visiting in the home of J. j W. Cawthorn. y    Misses Virginia Lee Thomp-j son and Virginia Reynolds, of Amherst, will arrive here to morrow7 fco spend the holidays.    Mr. Summergill and son, James, of Port Arthur, Texas, visited Mrs. Mattie ! Hubbard last week.    W. Kenneth ICunningham Jr, a student at Duke University, is spending the holidays with  his parents, Reverend and. Mrs. W. K. Cunningham.    I Sargent W. S. Franscisco of Fort P agg, N. C., is spending the Christmas holidays with his motiicr, Mrs. R. C. Wright."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Cawthorn"], "snippet": "the home of J. <mark>j</mark> <mark>W</mark>. <mark>Cawthorn</mark>. y    Misses Virginia Lee"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Cawthorn"], "snippet": "the home of J. <mark>j</mark> <mark>W</mark>. <mark>Cawthorn</mark>. y    Misses Virginia Lee"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2167.98, 469.96, 2334.26, 928.6], "bbox_id": "24fc338d2b", "file": "AppomattoxNewspapers_1902-1905a_0123.pdf", "page": 1, "text": "HoIlyWood. We are now having fine growing weather. , Crops herabout are look ing quite promising. There was a reunion ou June 2 at the home of Mr. H. C. Turnes. There are nine living children and seventeen grandchildren, and all ol them were present Mr. B. L. Jordan and his wife and three children, of Charlotte county ir. W. L . Tur and wife and five children, of Prince Edward couuty Mr. P. J . Shepherd and wife and four children, of Ap pomattox county Mr. Thomas Con ners and wife and two children, of Appomattox county aud Mr W. H Turns, of Appomattox, and Mr. J W. Patteson and wife and two child ren. All are of the Baptist faith Rev. W. E. Warren, Mr, J , H . Bag by, Mr. J . W. Cawthorn, Mr. A. E Turns and his wife, and Mr. T. E Turns, of West Virginia, were pre sent. It was a very enjoyable day. and-all seemed to find it so. Dinner was served at the uiual hour. The singing ip the afternoou was pleas ant. The solo and prayer by Rev W. E. Warren were excellent. Rev. W. A . Snyder,of Portsmouth, preached a fine sermon at Gold-Hill schoolhouse. Mr. J , H. Bagbv a few days sine made a flying visit to Buckiuglmm Miss Lula B. Turns and Mr, B. L oidan are contemplating u trip t Norfolk on July 4. Miss Venoim Turns is visiting re latives in Charlotte aud Priuce Eo- ward counties. Rev.- W. A. Snyder and wife, oi Portsmouth, are visiting relatives in bis neighborhood. Mrs. T. P. Inge is visiting friends in Rodnoke."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H . Bag by, Mr. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, Mr. A. E Turns"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "H . Bag by, Mr. <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>, Mr. A. E Turns"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.91, 1572.38, 897.46, 2008.5], "bbox_id": "97f4fa7344", "file": "AppomattoxNewspapers_1898-1902a_0383.pdf", "page": 1, "text": "HIXBURG PRECINCT. W. H. Ligon, chairman J. W. Wright, J. F. Lee, E. P. Sears, F. W. Coleman, Joel Watkins, F. B. Forbes, W. B. Ford, B. W. Bristow, A. A. Baldwin, Jno. W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, Thomas Dickerson. CLOVER HILL PRECINCT. .W. J. Trent, Chairman, E. E. Chism, D. P. Ferguson, H. C. Fer guson, A. B. Franklm, M. E. Agee, E. H. Lucado, J. W. Flood, J. W. Cawthorn, Jr., B. A. OBrien, C. M. Drinkard.. J. B. Hamilton, H. B. Pitmau, E. B. Abbitt, P. J. Shep- perd. AGEE PRECINCT, A. B. Thornhill, Chairman, T. J. Gooding, N. B. Featherstone, 8 . P. Taylor, W. D. Woodson, A. E. Milt- imore, J. H. Wood, C. A. Horsley, T. J. Megginson, D. M. Anderson, J. B. Childress, M. F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Cole man. OAKVILLE PRECINCT W. C. Abbitt, Chairman, T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Field Smith. C. H. Coleman, C. E. Carson, T. M, Tay lor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, B. T, Moss, J. D. Haiftersley. STONEWALL PRECINCT. S. C. Stratton, Chairman, M. W. Carson, J. C. Shearer,.S. E. Ander, son, T. C. Stratton, T. W. Tnggle, W. D. Sandidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. 8 , Thornhill, T. A. Driukartl, MtlUj Isbell, W. 8 . Taylor."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Lucado, J. W. Flood, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., B. A. OBrien,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Lucado, J. W. Flood, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr., B. A. OBrien,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.88, 631.88, 1753.81, 1363.91], "bbox_id": "22d92341a0", "file": "AppomattoxNewspapers_1908-1909a_0579.pdf", "page": 1, "text": "Herr Hitler is not satisfied tc control what shall be printed now in Germany, but has issu- ed ,to public and. private libra ries a list of books they may have upon their shelves. AL others not on the list must be destroyed! And all libraries must have from two to ten cop ies of a book by Hitler himeslf. called, My Fight. He controls everything else in Germany why doesnt he try to control himself f    And why not come on now and give an orchid to A. R Har wood for the wonderful way he and his assistents have worked night and dayto secure th e reopening of our other bank.  V  Father Darkleaf h a s heard a number of wouldbe-busines? men complain that they were not able to advertise until their business picked up a n d they had I more money . to spend. Thats drivil. Ive never heard of a sick man-on the point ol death declare that hed wait until he got well before hed call a doctor. By heck, if a man is well and hearty he doesnt need a doctor. The av erage business concern should, statistics definitely prove, spend from 2 to 3 per cent ol its gross receipts for advertis ing. We happen to have the exact percentage for each indi vidual sort of business. ------ ------o --------- -----  WILDWOOD, May 10. Sunday visitors in the home di Mr. and Mrs. E. F. Glove were, J. W. Cawthorn, C. S McDearmon, of Appomattox George Glover. Mrs. O. N  Gunter has re turned home after spending sometime with home people pear Prospect. Hanley P h e l p s and Frith, of Baltimore, Md., visit-1 Buckingham, is spending t h i s ed Mr. and Mrs. James Evans week with her daughter, Mrs. . Monday. I J. K. Megginson. The Sunday guests of Mr. Misses Cleo and Katie Rey- and Mrs. J. O. Evans w ere I n0id8 had as their guests over C. M. and S. J. Evans, W. the week-end, Misses Ema W. Wilkes and daughter, Ma- Dickerson, Pear! Burnette, Eliz- ble, J. W. Cawthorn and C. S- Lpeth Drinkard, Thelma Cov- McLearmon, Miss Carrie Lonell I mgton and Dorothy OBrien. and Lapdy W aniner. The Rev. O. G. Burnette a n d _ _________ w __________  Walter Payne were also On Tuesday afternoon at the dinner guests in this home Sun- home of Mrs. T. M. Trent, a 13 night, group of young boys met f o r i Miss Christine Garrette spent the organization of the Royal the week-end at her home here Ambassadors f Libelrty Bap I Miss Sue Childers arid Bern-"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "E. F. Glove were, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, C. S McDearmon, of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "E. F. Glove were, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, C. S McDearmon, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.9, 812.11, 2016.08, 1496.3], "bbox_id": "96c8d8a5b8", "file": "AppomattoxNewspapers_1939-1943a_0519.pdf", "page": 1, "text": "Heres a letter from Pvt. Warren Barlow to his mother, Mrs. K. V. Barlow, Appomattox, Va. Derr Mother, I received your letter today. Was lad to hear from you. I will fcr.ve o answer today. This will be the ist ime j can write you from here. T t . _ , .. ,   cant tell you where we are go- Up_to now we have three black- or whe we are goIng. l wU1 We outs effective in Appomattox. The first two were very successful. The last one was not thoroughly carried out. We believe the main reason for this was lack of understanding of what was expected. It was a combi nation dim-out and- blackout. We know, of course, that there were no intentional violations of the rules governing these tests. In either a dim-out or a black out, no lights should be seen from the streets. In a blackout, all people must be in their homes, or at least off the streets except those assist ing in the blackout. The only differ ence between a.dim-out and a black out, is that people may be on the streets during a dim-out, and traffic may continue as usual, with hooded lights. However, during a blackout, all citizens are supposed to be off the strets and all traffic slopped. In the event that you attempt, to us blackout shades br curtains, be sure to test them out a night or two b. forehand, to be certain that no light shines through or by your shades. Ordinary window shades do not blackout. No light, regardless of its color, should be visiblefrom the outside. Flashlights, lighted cigars or cigarettes or matches are prohibit ed. Civilian defense officers on duty during the blackout must guard against striking matches or smoking. In he past, the auxiliary police have called the peoples attention to any violation of the.rules, explaining the violation to them and asking.that it not be repeated. In the future, the o.ice will give no further warnings r.nd no explanations to any of us. It is felt by the State authorities that all of us have had sufficient expla nation and instructions regarding the regulations, and we should govern ourselves accordingly. We are in structed to say further that if any one is found in violation of any of the regulations governing dim-outs or black-outs, that person will auto matically and promptly be summons ed to the mayors court of the town of Appomattox. By order of the local defense council, Appomattox County Va - C. S. McDeaymon, mayor, Appomat tox, Va. George F. Abbitt Jr., di rector of Defense, Appomattox Co., Va. J. W. Cawthorn, town sergeant Appomattox, Va. D.A Comer, head of  Auxiliary Police,  Appomattox, Va. J. A. Burke, local Coordinator,"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Defense, Appomattox Co., Va. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, town sergeant Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Defense, Appomattox Co., Va. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, town sergeant Appomattox, Va."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1704.89, 483.81, 1867.03, 686.81], "bbox_id": "99d5d8134e", "file": "AppomattoxNewspapers_1918-1922a_0105.pdf", "page": 1, "text": "Foreman J C Hall, of the Aileghany county convict road force, spent Thanksgiving with relatives here. Miss Thelma Gawthorn, of Lynchburg, is spending this week with her parents Mr. and Mrs J. W. Cawthorn. Appomattox i to have a brans band The instruments have arrived and the practice has begun Mrs S L Ferguson is in Richmond wich her daughter, Mrs. Peacock, who in at hospital for an operation."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents Mr. and Mrs <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Appomattox i to have"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents Mr. and Mrs <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. Appomattox i to have"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1103.76, 876.24, 1261.02, 1029.11], "bbox_id": "85cbfb4e1b", "file": "AppomattoxNewspapers_1898-1902a_0226.pdf", "page": 1, "text": "FN TH E CLERKS OFFICE OF THE C lh 1 CU1T COIJKT OF TH E COUNTY OF Al POMATTOX, on the 22d day o f A ugust, 189.  Ben.ice Colly, who sues by J . W. Cawthorn. her fath er and n ex t frien d , ............ Plaintiff. against C. C. Colly,...........................................Defendant The object of this su it is to secure a decri . for alim ony and o th er allowances against tl.t defeudant in favor of the plaintiff. And an affidavit having been made and fik th a t the defendant, C. C. Colly, is not a res. d eq t of the S tate of V irginia, it is ord erie th a t he do appear here w ithin fifteen das after due publication here f. and do whi.i may be necessary to pro tect nis in terest ii this suit. And it is fu rth e r ordered th a t . copy hereof be published once a week fc i four successive weeks in the A ppom attcj and Buckingham T im es , and th a t a copy L i posted a t the fro n t door ot th e courthouse  1 th is county on th e first day of the n ex t ten  of the county court.A copy. T este GEO. T. PEEKS, Clerk. H. D. F lood , p. q. 8-2441."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Colly, who sues by <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>. her fath er and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Colly, who sues by <mark>J</mark> . <mark>W</mark>. <mark>Cawthorn</mark>. her fath er and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [121.93, 625.91, 291.97, 1054.51], "bbox_id": "bc0632f870", "file": "AppomattoxNewspapers_1908-1909a_0188.pdf", "page": 1, "text": "ffiburg, was week-end guest of her mster, Mrs. R. H. Coleman, near T vera. Mrs. Jimmie Caldwell has re- turned from an extendedvisit to jpber sister, Mrs. Simpkins, at Mt. Hope, W. Va. i Mr. and Mrs. J. Ellis Brame, Shy were the guests of Mr. and pire. J. Q. OBrien for the week- end. BpMfaas Mabel Connor,of Lynch burg, spent the week-end1 with lier parents, Mr. and Mrs T. U. Connor, near here.  Beautiful Hat?, Dreeses, and .Coats on sale isaturefay.  Bo sure to come in. 1 1 V a  s B onnet S hop . ! Mr. and Mrs. D. B. Hefiderson Jr, and little daughter visited the formers parents, Mriarid Mra7 D. B. Henderson, at Bedford, Va., Sunday. ! Mr. and Mrs. Chandler Simp kins and daughter, of Mt. Mope, W-Va,, visited Mrs. Simpkins parents, Mr- and Mrs. J. W. Cawthorn, this week. Misses Mary Lou, Shirley and Loveline Bryant, of Lynehbu spent the week-end with their plurent, Mr. and Mrs. W. S. Bryant, near Hollywood."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr- and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, this week. Misses Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr- and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, this week. Misses Mary"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1426.28, 1284.07, 1759.31, 1326.97], "bbox_id": "a5773956af", "file": "AppomattoxNewspapers_1912-1915a_0110.pdf", "page": 1, "text": "elected Mr. J. W . Cawthorn as our Sunday School Superinten-I dent for the year 113, and we -  , , . .. . . i .m ade arrangements to m eet at for several days, is able to be"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "elected Mr. <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark> as our Sunday School"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "elected Mr. <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark> as our Sunday School"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1349.8, 527.49, 1479.52, 903.29], "bbox_id": "b576e3922d", "file": "AppomattoxNewspapers_1908-1909a_0440.pdf", "page": 1, "text": "E. M. Burke has return- im an extended visit to. her j Mrs. McGill, iu N. C. Iloween next Wednesday the gate. Therell be a Toree in Lynchburg that g.   have requested list .of Fair Is from secretary of the as- ion and will publish same an get it. . f i S l can live cheaper if you Irour groceries from our y department. nge  s N ovelty S h o p p e . I J. W. Cawthorn Jr has led from a visit tjo his r in West Virginia. Thelbert Trent, , of. Duke rsity, and Mr. Eran Trent, teaching . at Altavista, the week-end with their i here. her new lot of wool Man- 150. A real bargain, get fauick, at W. R. R eynolds . e Burke and Heqry Doher- s returned from the Island They were hunting Ire."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "p p e . I <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Jr has led from"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "p p e . I <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> Jr has led from"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [503.45, 210.26, 773.8, 1359.52], "bbox_id": "78ba41e859", "file": "AppomattoxNewspapers_1918-1922a_0178.pdf", "page": 1, "text": "e 8  V i r g i n i a n eT hepsism uch indisposed Miss Eva H arvey is visiting relatives in Lynchburg. Refreshing showers m a k e bountiful gardens and beauti ful flowers. Mr. Hallie Burke, wife and daughter, are guests here for some days Messrs W . H. Lucado and Wiley Morris are owners of new Fords Mrs L. J. Morris is on a weeks visit to her old home in Nelson. Misses W ave Earle Patteson relatives in Charlotte this week Miss Mary Covington, of Holly wood, is visiting rela tiv e in Lynchburg this week Jlliss Susie Hancock, who hah been ,eohinvr at Biut iield, W Va , is spending hi-r vacation at home here. Prof, end Mg. Crawley an- young Charles ere taking i- vacatioD at the h.me of Mrs -rawl, t in the Valley. Mr. Burnetf, the electrical nr, aintainer, will soon have hie fcmily here. He will occupy the cottage of Mrs. Patteson Mr. and Mrs Simpkins and Mrs. J W. Cawthorn spent the week end with her daughter Mrs. John Tweedy, near here. Mrs. F. W McKinney and daughter, Miss Frankie, have returned from a visit to rela tives in Lynchburg and New York. Miss Carrie Jordan, of Char lotto county, spent tne week end with her aunts, Mesdames J. W. Patteson and L 1. Puck ette. Mr. and Mrs Chandler Simp kinp, of Richmond, have been visiting Mrs. Simpkins parents, Mr. aud Mrs J W Cawthorn, here. Miss Helen Morris, of V.ra. pent several days lust week with Miss K -a Harvey h-re, ou her way home irom Rich inond College. Mrs. F fl. Craig and son, Frank, are visiting Mrs Craigs father, at  Allendale . Mr Craig stopped for a uay on his way to N. Y. Mr H. S. E as , son of Rev. H. Parlett East, has gone to Berry ville, Va., lor the summer, where he is employed in Dr. A. W. W arners pharmacy. Mr W. O Moss has been vito iting his old home in North Carolina. He was accompa nied here by his father and brother for a visit. Mies Nina Holland, of Hoi land, Va., and Miss Dorothy Fox, of Emporia, V a , after spending a few days at the Haplist parsonage, have return- ed to their homes. Next week the hum of the binder will be heard in Appo m attox. The quality of our wheat is good and speculators are said to be buying up the farm ers bread before it is threshed, be careful how you part with your bread. The Editor reoeived an invi tation to be present at the m arriage of Frank Qreen and Sxrab Abbitt Burke Uanday morning. These are old and reliable oolored citizens of Ap pomatti x A wedding supper vas enjoyed Monday evening Thu ladies of New Hope church will have a lawn party at parsonage, Vera, Vs,, Sat urday, June 10tb, beginning at 5 oclock. Proceeds tor benefit of new church. Old church will be sold at 4 oclock. Pub lie cordially invited, R. L. Burke, cashier of Bank of Appomattox, and chairman of Group Four ut the Virginia Bankers Association, left to day to attend the State Con vention of Bankers, which will be in session at the Homestead Hotel, Hot Spring-, Va., June"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Mrs Simpkins and Mrs. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> spent the week end"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2404.26, 1354.52, 2571.53, 1419.72], "bbox_id": "b688405fe8", "file": "AppomattoxNewspapers_1939-1943a_0230.pdf", "page": 1, "text": "Due to the illness of town ser geant J , W. Cawthorn, the regular meeting of the town council of Ap pomattox was postponed from Mon day night. It is probable that the meeting will be held next Monday night."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of town ser geant <mark>J</mark> , <mark>W</mark>. <mark>Cawthorn</mark>, the regular meeting of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "of town ser geant <mark>J</mark> , <mark>W</mark>. <mark>Cawthorn</mark>, the regular meeting of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2075.99, 1013.46, 2241.43, 1708.05], "bbox_id": "dc31262698", "file": "AppomattoxNewspapers_1915-1918a_0055.pdf", "page": 1, "text": "D It. CANNONS L E T T E R . Oct. 22, 1915. Mr. L. W. Hoffman, Pamplin, Va. Dear Mr. Hoffman As you know the victory for Statewide Prohibition wis won ony after i protracted struggle in the Legislature of Virginia, ex tending over several years and then after a strenuous bat tle, culminating on September 22. 1914. In order to reap the results of such a great expenditure of time, labor and money, it is exceedingly important that every diy  x50unty shall send as its Representative to the House ot Delegates a man whose devotion to the prohibi tion cause is undoubted, for tbe legislation to be passec will be much more influentia if it is passed by practically unanimous vote. It has been the policy of the Anti Saloon League from the begiuoiug of its works to fur hish to tbe citizens of the county where there is a contest, for public office the r?cords of tt e candidates so far as we can do so It is our understanding that there are two candidates for the Legislature from Appo mattox County namely, Mr. J W. Cawthorn and Mr. R. L Burke. The record of Mr. Cawthorn in the General Assembly o 1914 was not at all atisfactory The crucial vote iu the figh for the Enabling Act was the vote on the beport of the Con ference Committee. Had the adoption of that Report been defeated in the House of Dele gates, we could not have voted on Statewide Prohibition on September 22, 1914, and we would still be fighting for Legislature to give us an op portuoity to exercise our right to vote. Tho Journal of the House of Delegates shows that on that vote Mr. J. W Caw thorn of Appomattox is re corded as voting against the adoption of the Report. So that in view of his record at that critical time, the Anti Saloon League of Virginia con siders Mr. Cawthorn to be a mm who cannot be depended upon to be of any service in the passage of the prohibitory law by the General Assembly of 1916."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "mattox County namely, Mr. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> and Mr. R. L"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "mattox County namely, Mr. <mark>J</mark> <mark>W</mark>. <mark>Cawthorn</mark> and Mr. R. L"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1414.98, 1325.81, 1745.52, 1626.91], "bbox_id": "1c6bb40e90", "file": "AppomattoxNewspapers_1912-1915a_0245.pdf", "page": 1, "text": "Corrections. _ Some errors iu reporting the re  e8fa .eB  a - i offered for suit of the Fair exhibits- H f in thl,8 P  p e rty . L ocated m . n a few m iles from R ichm ond Mr. 1 . a . Caldwell got the bine I C ity fine sta te of cu ltiv atio n ribbon on prcheron 4 year old mare. 114-room colonial residenoe Mrs. M. L. Moore did not havr I w ith m odern conveniences! any Rhode Island Red chicken bnt h ? 16 barn8 Pou ltry Bouses Eddie Moore had White  c  , 8evoi ui .ten a n t Bouses. . , . wnite Deguorn I F in ely w atered, ab o u t 40 acres insteaa. I0f fine low grounds, close to As to the embroidery there were I tro lley lin e, tw o m iles to R. R. several bine ribbons given in the  G ood for d airy in g , stock, truck various classes, bat the best hand 0P f eneral.fa r in8-  wo. it or all classei in the bine rib I  bons was awarded to Miss Lizzie I    . 136 acres 4500 Irby. Some have wanted to know I Bis. is one of th e choice whv it was that tha.  7, places in A ppom attox. M ain rihhnn k  j  806 a blne county ro ad runs th ro u g h th e ribbon, but did not get the parlor farm  w ell fenced good water lamp. This explains it, it is there h ig h sta te of cu ltiv ate th ree lore called sweepstakes. The name of J. W. Cawthorn should be m place of J. W. Carter ou tobacco. The prizes will be mailed to th- prize-winuers as soon as the took- can be adjusted."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "sweepstakes. The name of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> should be m place"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "sweepstakes. The name of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> should be m place"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [207.07, 833.23, 365.87, 998.83], "bbox_id": "ded395fe8e", "file": "AppomattoxNewspapers_1908-1909a_0573.pdf", "page": 1, "text": "Charles A. Truax will spend this week-end with friends at Pamplin,    Miss Ann Abbitt, of Norfolk is spending this week in t h e home of J. E. Sears.   0   Mrs. J. T. Gills, of Lynch burg, spent the week-end in the home of J. W. Cawthorn.    Misses Dorothy OBrien and Thelma Covington spent th e week-end in Lynchburg, visit ing Grace and Etta Austin."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "in the home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>.    Misses Dorothy OBrien and"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "in the home of <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>.    Misses Dorothy OBrien and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [288.71, 1328.01, 450.6, 1463.05], "bbox_id": "665c8e00f5", "file": "AppomattoxNewspapers_1912-1915a_0568.pdf", "page": 1, "text": "CÂWTHOBN q u i t s . Hon. J. W. Cawthorn, Jr. gives up the fight for the Legis lature, and now the time is so short, the nomination will go to Mr. R. L. Burke, assist ant cashier of the bank here, without opposition. Mr. Caw- thorn feels that he will not be able to make the fight on ac count of illness in his family."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "i t s . Hon. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. gives up the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "i t s . Hon. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. gives up the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1648.29, 423.44, 1818.08, 523.46], "bbox_id": "30bdc34620", "file": "AppomattoxNewspapers_1912-1915a_0441.pdf", "page": 1, "text": "c o n t i n u e d f r o m l a s t w e e k  Best citron1st J W Carter. Turnips1st J T Cheatham, 2nd J L Franklin, 3rd J W I Carter. Carrots1st J W Cawthorn. Parsnips1st Mrs JenningB Conner."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "W I Carter. Carrots1st <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>. Parsnips1st Mrs JenningB Conner."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "W I Carter. Carrots1st <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>. Parsnips1st Mrs JenningB Conner."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.74, 362.2, 620.74, 1795.51], "bbox_id": "c22bc15a56", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "By order of the Electorial Board of Appomattox County, all Regis tration Books in Southside District shall be purged as of October 4 1954. The names listed below have been removed from the Registration Books, Courthouse Precinct, South- side District, Appomattox County Virginia for reasons of death transferred or moved. This action is provided for and ordered under Sec tions 24-94 through 24-107 of the Virginia Election Laws as amend ed. Any one who can prove conclus ively that any of the names listed below have a right to be on the Registration Books of said County of said district, they shall make such information available to the undersigned registrar. JAMES H. LUCADO REGISTRAR. E. B. Abbitt W. A. Agee A. W. Almond Henry C. Almond Leonard Anderson T. F. Akers C. N. Abbitt J. Russell Abbitt J. R. Adams R. M. Almond T. Dyer Almond Daniel Almond Mrs. Patricia Almond Helen West Alvis Vergie L. Almond Mrs. W. M. Almond Mrs. R. F. Akers W. W. Brown J. W. Blackwell F. B. Blackwell Homer W. Blackwell John A. Booth K. V. Barlow H. H. Bazemore Harold W. Babcock George W. .Bass Alfred Bryant D. J. Berger L. I. Bryant Henry H. Beale William Boyce Alfred L. Barlow R. W. Burkey W. L. Brown H. M. Burge George P. Blackwell J. O. Babcock R. H. Bates O. S. Burnett Jerry A. Burke, Jr. P. M. Burton R. F. Burke, II F. E. Babcock R. H. Baber R. B. Boney, Sr. Berkley Brown H. 0. Blackard Jennie L. Blackwell Eula M. Burke Mrs. Myrna S. Bingham Mrs. Sallie Binkley Mrs. Julia A. Burton Mrs. Jessie Fitzgerald Baird Pearl E. Berger Mildred Babcock Mrs. K. V. Barlow Dorothy Buchanan Mrs. Nannie V. Blackwell Mrs. Ila Jean Buettner Miss Ila V. Buchanan Majorie B. Bailey Mrs. Martha A. Baber Mrs. Bertha L. Baber Addie Bates Mrs. Thelma L. Bazemore Katherine Burge Sara Beasley Mrs. Stanley Blystone Mrs. Mozell D. Boyce Mrs. R. B. Boney, Sr. J. W. Baber W. C. Chilton, Jr. Julian M. Campbell William A. Clark Tucker Cheatham J. W. Cawthorn, Jr. J. H. Cheatham L. Crawley J. B. Chilton J. T. Cole J. S. Cyrus E. P. Carson W. P. Coleman James L. Caldwell J. W. Caldwell J. T. Coleman J. M. Clapp Harvey A. Caldwell Wiley Coleman M. Earl Carson T. L. Christian R. L. Carter Archer A. Caldwell N. H. Cheatham E. H. Cawthorn Wilson R. Cole T. A. Clark S. H. Collins Twyman Conner R. E. Clapp Harry P. Clark W. Twyman Coleman P. W. Coleman W. A. Coleman W. W. Carter John L. Cates, Jr. G. A. Chocolate Enid M. Clapp Robert Cawthorn W. L. Coleman H. S. Coleman E. G. Cheatham T. E. Childress J. R. Conner John R. Cheatham Roy Conner D. L. Cawthorn F. T. Cawthorn, Jr. C. C. Cawthorn J. D. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "A. Clark Tucker Cheatham <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. <mark>J</mark>. H. Cheatham"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "J"], "snippet": "A. Clark Tucker Cheatham <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. <mark>J</mark>. H. Cheatham"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1356.5, 572.41, 1495.58, 896.6], "bbox_id": "d848135a85", "file": "AppomattoxNewspapers_1908-1909a_0375.pdf", "page": 1, "text": "bs Louise Shirey, recently lated from Sheltering Arms tat, Richmond.  j J. W. Cawthorn, Jr. is again after a fall which lured a rib. irke Steel and several friends Richmond, were week-end brs here last week. iss Nell Cawthorn is on to her sister, Mrs. Simpson, t. Hope, W. Va. . and Mrs. L. M. Ringham children, of W. Va., are ng parents at Hotel Appo 5X. blcombe and Frances Cald are home from an extended  to Charleston, Si C. rs. Marion Willis, of Fred isburg, has been op a visit fcr aunts here at Oakland. B. Marshall has had with his brother of Portsmouth on a - visit."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Arms tat, Richmond.  j <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. is again after"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Arms tat, Richmond.  j <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Jr. is again after"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [532.77, 1466.86, 685.97, 1545.31], "bbox_id": "7a454359c7", "file": "AppomattoxNewspapers_1915-1918a_0258.pdf", "page": 1, "text": "Best Peck E arly Potatoes 1st, W L Coleman 2nd, Claude and H ubert Caldwell 3rd, Mil ton Isbell. Best Peck Late Potatoes1st, J W Cawthorn, jr  2nd, same 3rd, R C Wagner."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Best Peck Late Potatoes1st, <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>, jr  2nd, same 3rd,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "Best Peck Late Potatoes1st, <mark>J</mark> <mark>W</mark> <mark>Cawthorn</mark>, jr  2nd, same 3rd,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.22, 693.54, 1667.88, 1214.33], "bbox_id": "123da45659", "file": "AppomattoxNewspapers_1918-1922a_0066.pdf", "page": 1, "text": "Bead list oftColumbia Grafo- nola records advertised by Lester B. Harvey in his space, on 1st page Miss Alice Gawthorn, a train ed nurse of Catawba, is spend ing her vacation with her parents, Mr. and Mrs. J. W. Cawthorn, here. Mieses Gladys Patteson and Iliene Smith left Thursday night last for a ten-day vaca tion at Virginia Beach and Norfolk Mr. James H. Stanley, jr., after a few weeks spent at home since being mustered out of the army, has gone to Rich mond io work. Misses Mabel Conner and Wave Turnes, of Turnes Mill, are visiting their cousin, Miss Sadie Turnes, in Charlotte county this week. Mr. and Mrs. B. L. Jordan and family, of Charlotte county, spent Sunday at the house of Mr. and Mrs. H. C. Turnes at Hollywood. Miss Sadie Turne and friend, Mr. John Crute, of Charlotte county, were Sunday guests of Miss Edna Turnes at Turnes Mill. Grand Patron S. H. Huddles ton, of Roanoke, will be here Saturday, July 19th, at 7 p. m., to install a Chapter at Appo mattox of the Eastern Star. The place of meeting will be at Masonic Hall."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, here. Mieses Gladys Patteson"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "parents, Mr. and Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, here. Mieses Gladys Patteson"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2365.9, 500.9, 2543.24, 1199.62], "bbox_id": "3f4f394ddc", "file": "AppomattoxNewspapers_1933-1936a_0032.pdf", "page": 1, "text": "Appomattox may ye.t share in the public and civil works projectsbeing encouraged by the federal administration. A large group, including Don Moses, J. W. Cawthorn. C. W. Smith, F- A. OBrien, J H. OBrien, T. E. Owen, S. L. Ferguson, E. T. Mitchl and Watt Abbitt attended a called meeting of town and, county of ficials of this section in Faripr ville yesterday afternoon. Pos sible work projects in the ter ritory were urged. The civil works administra tion is ready to grant funds to carry out a great number of relatively small projects in or der to.restore employment. It is hoped that 2,000,000 men can be put to work vithin a few weeks time, therefore smaller projects that can be undertaken on short notice, 1 giving immediate employment,  are being pushed. The group from Appomat-  tox considered application for funds to properly drain sew age disposal within the town of Appomattox, possible street and sidewalk wotk, sewage, painting of interior and exter iors of county schools, small ad dirions to schools, possible heating plant In larger schobls- It appears that the original plan to install a town owned water and sewage plant here will not be carried through. However, the time is auspicious for public works here and tho federal government knbckrf at the door of opportunity offer ing funds to finance any reas onable projects. With towns, cities and coun ties being granted large sums for public projects and giving subsequent employment a n d aid to the financial welfare of the people, it is felt that Appo mattox should not be left out. Public opinioji and pressure will make it possible for not one family honestly desiring to work to go unemployed this winter in Appomattox. How ever, speed must be the decid ing factor in lining up the de sired applications- ---------  ---- o -------- - -------"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "group, including Don Moses, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. C. <mark>W</mark>. Smith, F-"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "W"], "snippet": "group, including Don Moses, <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>. C. <mark>W</mark>. Smith, F-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [299.03, 641.24, 468.09, 987.02], "bbox_id": "3fbb6068be", "file": "TimesVirginian_1981a_0274.pdf", "page": 1, "text": "Ance vuwmsrn op m j Alice Cawthorn Simpkins, 85, of Appomattox, died at 1p.m . Saturday in Medical Care Center. Her husband was the late Richard C. Simpkins. Born in Prince Edward County, she was a daughter of the late J. W. Cawthorn tad Lizzie Morris Cawthorn. She was a member of Mémorial United Methodist Church. She is surviyed by a . daughter, Mrs. Edith S. By set of Vienna three sisters, Mrs. Thelma Caldwell, Mrs. Nell Thrasher, and Mrs. Clara . Hanenkrat, all of Appomattox two granddaughters and two great-granddaughten. Funeral services were con ducted Monday, August 24 at Robinson Funeral Home at 2 p.m. with burial Wednesday at 10 a.m. in Oak Hill, West Virginia. Leonard Meredith Thsruhffl Leonard Meredith Thornhill of Richmond, Va., died Aug. 22, 1981. He is surved by his wife, Mrs. Lula Harris Thornhill, .jfonw aona, David L.. Jamee A"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn", "Cawthorn"], "snippet": "daughter of the late <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> tad Lizzie Morris <mark>Cawthorn</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn", "Cawthorn"], "snippet": "daughter of the late <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> tad Lizzie Morris <mark>Cawthorn</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1660.3, 490.96, 1830.01, 609.0], "bbox_id": "dffba04243", "file": "AppomattoxNewspapers_1939-1943a_0336.pdf", "page": 1, "text": "AN ORDINANCE Be it enacted by the Town Coun cil of Appomattox, that the Norfolk and Western Railway Co. be and are hereby directed to maintain a .Gate and Wiatchman at the crossing on Chruch Street near the N.  W. Station 24 hours a day, effective as of September 15th, 1941 C. S. McDearmon, Mayor. A Copy J. W. Cawthorn, Clerk."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "McDearmon, Mayor. A Copy <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "McDearmon, Mayor. A Copy <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Clerk."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1860.96, 1303.77, 2179.1, 1431.37], "bbox_id": "a628301d33", "file": "AppomattoxNewspapers_1908-1909a_0294.pdf", "page": 1, "text": "A Copy Teste North of the above named tract I c. V. SMITH, Clerl., known as Indian Field andjj. y. FLOOD, p. q. was conveyed to said C. S. Cawthorn by J. W. Cawthorn and wife, all of which deeds are of record in e j Clerks Office of Appomat- tox County and to which refer- once is here made."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and wife, all of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "C. S. Cawthorn by <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark> and wife, all of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [840.01, 1015.02, 1003.86, 1042.27], "bbox_id": "a7634b79f7", "file": "AppomattoxNewspapers_1936-1939a_0029.pdf", "page": 1, "text": "A copy J. W. Cawthorn, Clerk Sept. 18th, 1939"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "A copy <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Clerk Sept. 18th, 1939"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "A copy <mark>J</mark>. <mark>W</mark>. <mark>Cawthorn</mark>, Clerk Sept. 18th, 1939"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [690.66, 862.9, 864.33, 1716.31], "bbox_id": "3da06e0013", "file": "AppomattoxNewspapers_1908-1909a_0523.pdf", "page": 1, "text": "A. B- Abbitt and Jno Abbitt with Mr. gdwards, of Newport News spent the week-end at Vera. ... Clyde OBrien, of the Medi cal College of Va., is home for the hotidaysff , Miss Margaret Pittman, of Richmond, will be.the guest of Miss Cornelia Gills for the DahlOBrien nuptials and Christmas week. Miss Elizabeh McDearmon, who is attending U. of S. C., arrived home Saturday for the Christmas holiday  Edward Coffman and Mr. William Burke are home from U, of Va. Miss Margaret Smith spent the week-end at home. Services at the Baptist church on Decenfber 27 1 w consist ofa progsram presented entirely by members who have attended college during the last seven years The program will be a combination of music, both vocal and instrumental, and three minute talks. William Burke will preside. Charles James, of Medical College of Va., Is home for the holidays. Charles Crawley, of W-  L. is home for Christ .mu. Miss Virginia Lee  lorij sm and Miss Mary Grey Sears, of R. M. W- C-, in Lynchburg,  came home Saturday for Christ mas. The Methodist church gave a pageant Sunday night with an audience from all the local churches. . -.v i Many of our young people will arrive home the 23rd, af ter schools close- Among those who will come home at this late minute are Misses An nie and Corinne Hancock, Mis ses B. V. and Alice Harwood, Mis Florence Gregory, Miss Mildred McDearmon. E. T- Price and son, Carring ton, of Brooknetal, were visi tors here Saturday. Mr. and Mrs. R- C. Simpkins of Mt. Hope, W Va., are pend ing tiie holidays with Mr- and Mrs. J. W Cawthorn. 1  - --  Master Scott Sears is up again after several days sick ness resulting from taking tet- mus anti-toxin after bein hurt by a fire cracker. H- Y. Spencer is sick. Mr. and Mrs. W. F.- Wool- folk and Billy will be here for the holidays-  Edward Ramsey is home for the holidays. Mr. and Mrs. Lloyd Cates, of Burlington, N. C-, have mov ed their residence to Appo mattox. .   Miss Eltha Morris is visiting relatives in Bluefield, W. Va- She is staying there with Ml Lena Morlss and Mrs- Custis Fleshman, her sisters."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "with Mr- and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>. 1  - --  Master Scott Sears"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "with Mr- and Mrs. <mark>J</mark>. <mark>W</mark> <mark>Cawthorn</mark>. 1  - --  Master Scott Sears"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1493.75, 1390.97, 1781.44, 1548.24], "bbox_id": "cc4af151cc", "file": "AppomattoxNewspapers_1933-1936a_0482.pdf", "page": 1, "text": "1936 town taxes are due and payable iw. A penalty of 5 per cent will be Ided to all taxes not paid by July 1 j J. W . Cawthorn Town Treasurer Anyone that wants to know the amount of their tax can call at the mayors office"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Cawthorn"], "snippet": "by July 1 j <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark> Town Treasurer Anyone that"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Cawthorn"], "snippet": "by July 1 j <mark>J</mark>. <mark>W</mark> . <mark>Cawthorn</mark> Town Treasurer Anyone that"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1994.16, 796.61, 2166.36, 954.21], "bbox_id": "995292d54b", "file": "AppomattoxNewspapers_1939-1943a_0061.pdf", "page": 1, "text": "1040 auto licenses go on sale to morrow, Friday, March 16. They wifi be sold l Appomattox by C S McDearmon. The Appomattox numbers will begin this year at 328-651.That first Appomattox num ber has already bee applied for by Raymond Jamerson. The plates this year will be white, with black fluures. Appomattox county usual ly requires sUghtiy over 1600 tegs The town o f App niattox auto licenses will go on sale at the same tim e. Town tegs are sold by J . w . Cawthorn. _ .  u.-v Motorists nave oO uy  to procure the new license plates."}, "highlight": {"text": {"matched_tokens": ["J", "w", "Cawthorn"], "snippet": "tegs are sold by <mark>J</mark> . <mark>w</mark> . <mark>Cawthorn</mark>. _ .  u.-v Motorists nave oO"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "w", "Cawthorn"], "snippet": "tegs are sold by <mark>J</mark> . <mark>w</mark> . <mark>Cawthorn</mark>. _ .  u.-v Motorists nave oO"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
