{"document": {"bbox": [2301.83, 1204.79, 2491.55, 1599.81], "bbox_id": "8266fced7a", "file": "AppomattoxNewspapers_1926-1933a_0347.pdf", "page": 1, "text": "WiA certain tract of land, with the buildings and  ments thereon, containing 13 acres, more or less, situated in Stonewall District of  coun ty of Appomattox, Virginia, about eight miles Northwest from the courthouse end boot one and one-half miles w est of Oakville, adjoining the lands of L. S. Doss, Elmo Wilkerson, W. J. Jones and others. Said tract of land consdsts of thre tracts of land, one of 2 acres, upon which the storehouse and dwelling is built, which was conveyed to the said T. B Doss by Ann V. Doss and others, by deed bearing date on the 20th day of May, 1902 , and of rec ord in the Clerks Office of Ap pomattox County, D. B. No. 7, at page 79 another tract of 44 acres, which was conveyed to the said T. B. Doss by T. E. Owen and wife by deed bear ing date on June 30th, 1913,  which is of record in said I Clerks Offiice, D. B. No. 14, at  page 304, and another tract of I86 acres, which was convey I tbP said T. B. Doss by L. b.   Doss and wife,by deed dated I July 6th, 1911, and of record I in said Clerks Office in D. B. I No. 12, page 521, to all  I which deeds reference is here"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [828.7, 836.57, 983.55, 1263.67], "bbox_id": "c403fb4fc7", "file": "AppomattoxNewspapers_1918-1922a_0598.pdf", "page": 1, "text": "Washington.The program which the American Farm Bureau will sub mit to the National Agricultural Con ference will call for early enactment by Congress of laws clearly defining the rights of the farmers to market their products co-operatively. In making this announcement the bureau said their economic and legis lative proposals would be based upon the plan adopted at the recent annual convention in Atlanta, Ga. At the same time it was said information which the Department of Agriculture is collect ing on farm tenantry and other prob lems will be made available to the delegates. James R. Howard, president O. E. Bradfute, vice-president, and members of the executive committee, it was an nounced, would represent the Federa tion at the conference. Six women were Included in an ad ditional list of 3 names of delegate made public by Secretary Wallace. They are Mrs. Nellie F. Blakeman, Oronoque, Conn., chairman of the home economics committee of the Na tional Grange Mrs. Charles W. Sewell, Otterbein, Ind., leader in Farm Bureau womans work Mrs- John Black, Roslyn, Md., leader in grange work Mrs. J. W. Jones, Olney, Md., leader in farm womens activities Mrs. Frank B. Black, Myersdale, Pa., president of the Society of Farm Women of Penn sylvania, and Mrs. W. C. Martin, Dal las, Texas, State chairman of the Fed eration of Rural Life Clubs. Among other delegates in the list are George Livingston, Washington, former chief of the Bureau of Mar kets, and S. S. Pennock, Philadelphia, president of the Society of American Florists and Ornamental Horticultural- ists."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "in grange work Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, Olney, Md., leader in"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "in grange work Mrs. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, Olney, Md., leader in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [417.61, 812.75, 1878.56, 1314.09], "bbox_id": "c116225f14", "file": "AppomattoxNewspapers_1971-1973a_0530.pdf", "page": 1, "text": "Warm Morning WOOD HEATER -F o r sale -In good condition. Call 248-6160. ll-1 6 -2 t with a special donation for the annual Hayes Day on December 6 to be held at the Virginia College in Lynchburg. The pastor of the church will deliver the sermon and music will be rendered by his choir. Impressive Pre-Thanksgiv ing services were held at the Galilee Baptist Church last Sunday morning at the 11 a.m. service. The pastor delivered the message. Music was rendered by the Senior Choir. Despite the rain an apprecia tive crowd came out. The Mount Shiloh Baptist Church will conduct its annual religious service at the Pine View Nursing Home this Sunday evening at 2 p.m. Music will be rendered by the Senior and Junior Choirs of the church. The pastor will deliver the message. Friends are invited to attend. The Mens Club of the Mount Shiloh Baptist Church will sponsor a Three Way Sermon on the first Sunday in December at 3 p.m. The Reverends W. R. Jones, J. W. Paige and C. L. Elliott will be the guest speaker. Music will be rendered by the Senior Choir of the church. The public is cordially inyited to attend. All members ahd friends are cordially invited to attend the regular preaching service at the Promise Land Baptist Church this Sunday morning at 11 a.m."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. R. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and C. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. R. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and C. L."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2019.83, 909.37, 2187.68, 1128.91], "bbox_id": "10da619d22", "file": "AppomattoxNewspapers_1926-1933a_0349.pdf", "page": 1, "text": "W X certain tract of land, with the buildings and improve ments thereon, containing l acres, more or less, situated m Stonewall District of the coun ty ot. Appomattox, Virginia, about eight miles Northwest from the courthouse and about one and one-half miles V est of Oakville, adjoining the lands of L. S. Doss, Elmo Wilkerson, W . J. Jones and others. Said tract of land consists of three tracts of land, one of 2 acres, upon which the storehouse and dwelling is. built, which was conveyed to the said T. B. D by Ann V. Doss and others, by deed bearing date on the 20th day of May, 1902, and of r ord in the Clerks Offic"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark> . <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark> . <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.08, 371.07, 1896.44, 1093.84], "bbox_id": "3b7dd022af", "file": "TimesVirginian_1980a_0400.pdf", "page": 1, "text": "tho widows of the Mount Shiloh Baptist Church will be held on the first Sunday in December at 3.p.m. The Reverends W. ft. Jones, J. W. Paige and C. L. Elliott will bring special messages. Music will be rendered by the St. Paul Gospel Singers. The public is invited to attend. A special musical progam will be presented at the Galilee Baptist Church on the first Sunday evening in December at 7 p.m. A . special chorus of the Lewis Baptist Church of Farmville, . Va. wfll be the guest. The public is cordially invited to come out, Mr. John H. Lewis has returned to his home here after a very successful operation pi the Baptist hospital in Lynchburg, Va. Regular preaching service was hold at the Promise Lana Baptist Church last Sunday morning. Impressive service was held at the Promise Land Baptist Church Sunday. The guest minister was the Rev. A lbert Davis, assistant pastor of the Galilee Baptist Chuch. Beautiful music was rendered by the senior choir. The religious service sponsored by the Mt. Shiloh Baptist at the Pine View Home for the aged last Sunday at 2 p.m. was highly enjoyed by all present. Music was rendered by the Mt. Shiloh Senior Choir. Prayer and praise service will be held at the Promise Land and the Mt. Shiloh Baptist Church on Thanks giving Day at 11 a.m. Members and friends, , are asked to come out and give God thanks for his goodness and tender mercy given unto us. Deacon Stewart Robin- Son has entered the Lynch burg General Hospital for special treatment. 7 eiving special treatmei in the state hospital. M r.1 Lloyd Forest -is improving nicely at his home after special treatment in the Lynchburg Geperal Hospital. Rev. Albert Davis was the dinner guest of Rev. and Mrs. Lawing Sunday."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. ft. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and C. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. ft. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and C. L."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [631.2, 586.5, 797.7, 669.2], "bbox_id": "691d092ac0", "file": "AppomattoxNewspapers_1939-1943a_0277.pdf", "page": 1, "text": "The Rev. W. J. Jones, 75 years old, member of Jordan, died April 14, 1941, at Bent Creek, Va., in the home of Mr. and Mrs. John McCoy, after an illness of several days. He had been pastor of the Canaan Bnptis church for the past twenty years. He will be missed by all. Funeral services were held at"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "The Rev. <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, 75 years old, member"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "The Rev. <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, 75 years old, member"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1773.81, 438.82, 1940.98, 732.06], "bbox_id": "1e42eddbe9", "file": "AppomattoxNewspapers_1926-1933a_0256.pdf", "page": 1, "text": "The following enjoyed a camping trip 0n the James over near Gladstone laSjt reek Mrs. A. R. Harwood, Mrs. Peterson, of New York,  George Langren, Roland ILaw- lon, Jr., Hamlet Franklin, of Pamplin, Misses Alice and Eleanor Harwood, Jeane Mar- c it, of Haleys, Va., and Virginia Carroll, of Baltimore, and Messrs Kenneth Saum, of Strawsburg, and H a m l e t Franklin, of Pamplin, and Tom Dinges, of Strawsburg. Members of the Jones fam- 1 ly met at the home of Mr. A. j W. Jones, Spout Spring, Va., ast Sunday to celebrate the annual event of the family re anion. All the sisters and aipitherisi, Mis. Kate Walton Mrs. R. H. Bates, Mrs. M. C. Jaldwell, Miss Ella Jones and Mr. A. W. Jones and their amilies were present. All .pent an enjoyahle day."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Jones"], "snippet": "home of Mr. A. <mark>j</mark> <mark>W</mark>. <mark>Jones</mark>, Spout Spring, Va., ast"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Jones"], "snippet": "home of Mr. A. <mark>j</mark> <mark>W</mark>. <mark>Jones</mark>, Spout Spring, Va., ast"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2093.29, 867.69, 2254.67, 1031.04], "bbox_id": "62edbad8e1", "file": "AppomattoxNewspapers_1892-1898a_0140.pdf", "page": 1, "text": "rapidly falliog into ruin and deoay The first thing which meets tlie eye of a stranger, approaching the. place from the direction of Prospect, the nearest railroad station is a mass of brick where stood, in olden times an Aoademy for Boys. It has long since passed into nothingness. Af terward a building was reared in the suburbs of the village and was dub bed Scuffletown College by the urchins who attended the schoo which was taught, firs! by J. W, Jones, then by L H. and Archibald"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "was taught, firs! by <mark>J</mark>. <mark>W</mark>, <mark>Jones</mark>, then by L H."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "was taught, firs! by <mark>J</mark>. <mark>W</mark>, <mark>Jones</mark>, then by L H."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.22, 585.8, 1789.32, 874.03], "bbox_id": "d6e5563b8e", "file": "AppomattoxNewspapers_1892-1898a_0148.pdf", "page": 1, "text": "OurColored Debaters. The colored people of Oakville met in the public school house near that place to discuss the subject, Our Present Needs. The speakers were Rev. E. Austin, Jr., W. J. Jones, aud J. R. Johuson, Rev. Austin being the first speaker. He was followed by W. J. Jones, af ter which a recess was taken and a nice dinner was served on the lawn. At 230 oclock J. R. Johnsons address renewed the exercises, S. J. Hunter next took the stand and sought to impress upon his hearers the necessity of the colored standing together. After a speech by S. Cheatham benediction was pronounced by Rev. E. Austin, Jr., and then all went- home rejoicing."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones", "J"], "snippet": "Rev. E. Austin, Jr., <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, aud <mark>J</mark>. R. Johuson,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones", "J"], "snippet": "Rev. E. Austin, Jr., <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, aud <mark>J</mark>. R. Johuson,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1585.42, 314.11, 1745.43, 335.65], "bbox_id": "0f8e313971", "file": "AppomattoxNewspapers_1892-1898a_0073.pdf", "page": 1, "text": "Mr. J. W. Jones, of Buckingham, called at this office yesterday."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, of Buckingham, called at this office yesterday."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "Mr. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, of Buckingham, called at this office yesterday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1389.36, 963.55, 1792.44, 1203.54], "bbox_id": "cec9b37ae6", "file": "AppomattoxNewspapers_1908-1909a_0317.pdf", "page": 1, "text": "ing a new co-operative to- to be made up through increas- A that state are expected ed rajs on income or on bant listen the organization of j stock, rginia. co-operative, ie formation of a new co stive was discussed at a j minor brence on ceting held at Lrday and attended by j as a whole, nnia growers and county largely around a few I agents. J. W. Jones, of sources, such as income, Washington division of co- estate and tangible 1 tive marketing, speak- property, and business in the place of J. C. Stone, franchise taxes, supplemented counties, Lber of the federal farm by such special taxes as the oc- can I _ Mgijw seem to warrant. I increased local Thb tax functions should through generous concentrated state. , Counties in"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "a few I agents. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, of sources, such as"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "a few I agents. <mark>J</mark>. <mark>W</mark>. <mark>Jones</mark>, of sources, such as"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [645.1, 577.99, 791.47, 1034.52], "bbox_id": "3a7e234f9e", "file": "AppomattoxNewspapers_1912-1915a_0024.pdf", "page": 1, "text": "H C Rogers, repairing bridge and culvert ............... . Oct. 30, J J Carson, work on Mt. road  D Alvis, work on Spt. Spr. rd - W J Jones, blacksm ith aeot.  H G Harding, salary ....... ...  M w Carson,  . ........ . Chas F Button  .......... . Jno M Scruggs, work on w al kers Ford ro ad ..........  Chas Thomas, work on Con cord road ..................... Dec. 7, R H Baber, work on road near wildway ............  ......... Dec. 18, w D Sandldge, work on Lynchburg road ........  Lee Carter, lum tier and Ax ing bridge ................... Dee. 22, Sam Jones, ditching and hauling rook. ........  M w Carson, amts, adv, for work on road ............ . 1912 Feb. 7, H C Doss, placing log across Davids C reek....... Apr. 24, Drinkard Sc Harding, work on culvert Stonewall Creek road .................... -  jaswoodson, work on road.-  CM Stratton Sc B ro, oross- - laying road ............... -  R j Coleman, crosslaylng rd.  w H Lucado, crosslaylng Oakville road ............ . Apr. 27. Ainslie-Martln Co, dynam ite Apr. 29, John M Scruggs, Ailing hole w alkers ford ro ad .. . May 4, M w Carson, am t. adv. for working road ............ ..  S R Martin, w ork on wagon and m achine .............  John Holt, w ork on old Stage road ..................  H B Jennings, work on w reck Island Ford  H B wheeler, crosslaylng on. W, I. Creek read .......  Va Seed  Feed Co, mnle feed  J A Splggie, filling hole a t N orths creek bridge  c B Page, cutting tree out o f ro a d -.- ........................ May 13, Alex Hughes, work on road.  8am Johnson   Chas Moore,  May 30, jerry w atson, moving rd. mob  j 3 Plunkett, sal-try foreman  j T Wooldridge, wages as d riv e r.............. ... ......... - Travis woolridge, labor .........  A F Godsey,  ......... w D Doss, ........ Sam Hollins,  j s Plunkett, am t, adv, fo r board ol laborers ....... H G Harding, am t adv for frt on dynam ite ............... E A w alton, w ork on Con and. B G road ............  Buck Drinkard, collar for mule j w Neighbors, supplies ......... Va. Seed Sc Feed Co- mule feed w w Thornhill, work on B C rdl John Eagle, w ore on Horsley road . ............................. Lee C arter, work on road ....."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "on Spt. Spr. rd - <mark>W</mark> <mark>J</mark> <mark>Jones</mark>, blacksm ith aeot.  H"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "on Spt. Spr. rd - <mark>W</mark> <mark>J</mark> <mark>Jones</mark>, blacksm ith aeot.  H"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1916.65, 1097.15, 2204.49, 1186.34], "bbox_id": "5955468dac", "file": "AppomattoxNewspapers_1962-1965a_0495.pdf", "page": 1, "text": "erally, a farm owner tenant, or j Jones w v JoneS H w sharecropper is eligible to vote E Carter Martln T c Pankey if he is taking part or is eligible paul garver. to take part in one or more of the ASCS programs. Envelopes containing marked ballots should be mailed or re turned to the ASCS county office, Appomattox, Virginia, anytime"}, "highlight": {"text": {"matched_tokens": ["j", "Jones", "w", "JoneS", "w"], "snippet": "farm owner tenant, or <mark>j</mark> <mark>Jones</mark> <mark>w</mark> v <mark>JoneS</mark> H <mark>w</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Jones", "w", "JoneS", "w"], "snippet": "farm owner tenant, or <mark>j</mark> <mark>Jones</mark> <mark>w</mark> v <mark>JoneS</mark> H <mark>w</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2308.28, 605.8, 2475.43, 710.6], "bbox_id": "fad91d632c", "file": "AppomattoxNewspapers_1912-1915a_0433.pdf", "page": 1, "text": "Engineer L. A, Bonham is in a Bristol hospital with a broken leg end other injuries, and his fireman, W. J. Jones, is injured, as .the result of a passenger train on tee Holston River division of the Southern Rail way, splitting a switch at Mendota, Va. The engine turned over and Bon hams leg was caught Tinder the cab. The coaches remained on the rails and no passengers were injured."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "injuries, and his fireman, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, is injured, as .the"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "injuries, and his fireman, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, is injured, as .the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [627.59, 292.49, 800.11, 716.48], "bbox_id": "d6834ecd31", "file": "AppomattoxNewspapers_1939-1943a_0271.pdf", "page": 1, "text": "Eliza Gets Kissed, a one act drama, will be presented at the Buckingham County Training School this Friday night at 830. The bus will leave the campus of the Car ver high school at 730. Friends are invited to go. _ j Impressive funeral services werej held over the remains of Rev. W. J. Jones, pioneer school teacher,! preacher and pastor of the Jordan  Baptist church, last Wednesday, be fore a capacity audience, with the Rev. H. H. Cabell officiating. He was j a sisteil by the Reverends P. W.   i . R . R. Vaw.er and  A. C. _ Resolutions wu,e read from tne ministers and deacons union, Can aan Bap.ist church, Community, and several friends. He died in his 73rd year. Interment was held in the church cemetery. G. J. Stephens is recovering nice ly after undergoing an operation in he University of Virginia hospital. He will return home Saturday. Rev. Yates was the Sunday din ner guest of Mr. and Mrs. Tom Tibbs. Misses Hester and Helen Stephens nd Mildred Hart and Robert Wat- sen motored to Charlottesville last Sunday to visit Mr. and- Mrs. G. j J. Stephens. Mrs. Bernard Baker and son left las Thursday, after spending a weeks vacation here with her par ents, Mr. and Mrs. Vann Pattenson. Eliza Gets Kissed, a one-r.ct drama, will be presented a t the Spout Spring school next Wednes day night, April 30, at 830. The Promise Land church will render service at the Mt. Zion church at Red House Sunday at 8 P. M."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "the remains of Rev. <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, pioneer school teacher,! preacher"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "the remains of Rev. <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark>, pioneer school teacher,! preacher"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1952.39, 652.74, 2123.14, 1023.29], "bbox_id": "cc16b51d6a", "file": "AppomattoxNewspapers_1902-1905a_0368.pdf", "page": 1, "text": "democratic ticket will carry in the county by a handsome ma jority. The committee arrang ed to have speaking at the var-. ious precincts of the county. I The appointments will- be made I and published later. I A motion was made for the I appointment of a campaign committee of five for each pre cinct. This motion was carried and the workers are given be low BUCKINGHAM DEM.. EXE CUTIVE COMMITTEE W. C. Chappell, Chairman- W. W. Haskins, Secretary. P. A. Grigg. I J. H. Fitzgerald.  L. D. Jones. J. W. Hebditch.  , E. W. Hubbard. A. W. Moore. J. T. Bransford. I M. L. A. Moseley. William Williams. F. A. Agee. Julian Smith. R. B. Hughes. A S Terrell. R. S. Ellis. A. L. Hall. Camm Patterson. CAMPAIGN COMMITTEE."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W", "W"], "snippet": "H. Fitzgerald.  L. D. <mark>Jones</mark>. <mark>J</mark>. <mark>W</mark>. Hebditch.  , E. <mark>W</mark>. Hubbard."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W", "W"], "snippet": "H. Fitzgerald.  L. D. <mark>Jones</mark>. <mark>J</mark>. <mark>W</mark>. Hebditch.  , E. <mark>W</mark>. Hubbard."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1153.64, 874.65, 1321.13, 999.89], "bbox_id": "25fdfda288", "file": "AppomattoxNewspapers_1939-1943a_0266.pdf", "page": 1, "text": "Deacon and Mrs. James Conner were the recent Sunday dinner guests of Deacon and Mrs. Luther Patterson. Special funeral services were held at the Mount Airy church last Wed nesday over the remains of Stephen McCoy, a?ed citizen of that com munity. The eulogy was delivered by Rev. H . H . Cabell, past ir of t he church. He was assisted in the ser vice by Reverends P . W . Price, W. J. Jones and Perry, of Roanoke."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "Reverends P . W . Price, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and Perry, of Roanoke."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "Reverends P . W . Price, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and Perry, of Roanoke."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [923.43, 1715.43, 1086.98, 1967.59], "bbox_id": "57fdc4cfcc", "file": "AppomattoxNewspapers_1898-1902a_0275.pdf", "page": 1, "text": "Commissioners Sale of Valuable Land in Appomattox County. Pursuant to decree of the Circuit Court of j Appomattox county, entered at the October s term, 1899. the undersigned Commissioners, appointed by said court, in the suit oi W. J. Jones c.aguin8t Mary E. Jones c. wiil sell on the premises, on SATURDAY, DECEM- ÜEK 2UTH. 1899, AT 10 OCLOCK, A. M., thô lollowiug real property, situated in and near ithe village of Oakville it being the real es tate of which Alfred Jones died seized and 2 oses 8 ed..viz  Tract No. 1. The Home T act containing 88 acres, near Jordan Church, adjoining bell aud others  has o  it comfortable dwelling, mtl out buildings and orchuid. Land im  proved. Tract No. 2.  Lower Doss Field contain-  gAiS acres on which Samuel Jones now lesides  consists o ft improved highland uud leru ie low grounds has.on it comfortaole dwelling and out houses. Tract No. J. 42  acres adjoining the Home Tract consists in cleared and wood  laud originally good, and lays well  no im provements. Tract No. 4. Oakville Tract, containing 25 acres, situated iu the village of Oakville and is a very desirable building lot. No im- provemenigsave school bouse on it, TER6Ono fourth cash, the residue on 1 2 and S years from the date of sale, for Aviiicb deferred payments, purchasers are to execute their bonds, to bear interest from date or sale, with good personal security. L P b R k S , P  Commission.."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones", "Jones"], "snippet": "in the suit oi <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> c.aguin8t Mary E. <mark>Jones</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones", "Jones"], "snippet": "in the suit oi <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> c.aguin8t Mary E. <mark>Jones</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2310.49, 970.31, 2496.87, 1643.52], "bbox_id": "69c1b1860d", "file": "AppomattoxNewspapers_1926-1933a_0343.pdf", "page": 1, "text": "By virtue of a certain deed of trust, executed by T. B. Doss and Hattie E. Doss, his wife, dated July 15th, 1926, and re corded in the Clerks Office of Appomattox County, Virginia, in Deed Book No. 26, at page 184, wherein the hereinafter described property was con veyed to the undersigned trus tee, in trust, to secure the pay ment of a certain negotiable note, default having been made jin the payment of said deed of trust, said trustee will sell at public auction at Appomattox Court House, Virginia, on Saturday, October 5, 1229 at 2 p. m., in ront of the Farmers National Bank to the highest bidder, for cash, the real estate described in said deed of trust as follows to- wit , ... A certain tract of land, with  the buildings and improve- jments thereon, containing 132 1 acres, more or less, situated in Stonewall District of the coun ty of Appomattox, Virginia, about eight miles Northwest from the courthouse and about lone and one-half miles West of Oakville, adjoining the lands of L. S. Doss, Elmo Wilkerson, W. J. Jones and others. Said tract of land consists of three tracts of land, one of 2 acres, upon which the storehouse and dwelling is built, which was conveyed to the said T. B. Doss by Ann V. Doss and others, by deed bearing date on the 20th day of May, 1902, and of rec ord in the Clerks Office of Ap pomattox County, D. B. No. 7, at page 79 another tract of 44 acres, which was conveyed to the said T. B. Doss by T. E. Owen and wife by deed bear ing date on June 30th, 1913, which is of record in said Clerks Offiice, D. B. No. 14, at page 304, and another tract of 86 acres, which was conveyed the said T. B. Doss by L. S. Doss and wife,by deed dated July 6th, 1911, and of record in said Clerks Office in D. B. No. 12, page 521, to all of which deeds reference is here made. This farm has on it a spien-"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "S. Doss, Elmo Wilkerson, <mark>W</mark>. <mark>J</mark>. <mark>Jones</mark> and others. Said tract"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2051.22, 244.74, 2199.26, 533.33], "bbox_id": "752cb3160d", "file": "AppomattoxNewspapers_1962-1965a_0253.pdf", "page": 1, "text": "Baptist Church are asked to at tend the Three Way sermon at the Galilee Baptist Church this Sunday evening at 730. The fol lowing yourg ministers will ap pear on the program Reverends Wins on Jones, J. W. Paige and E. R. Berryman. The program1 will be given for the Patron of j The Year contest. Special music will be rendered by Mount Shi-1 loh, Promise Land and Canaan Senior choirs. The regular meeting of the lo- j cal Appomattox Teachers Asso ciation will be held on Monday, October 7 at 4 p.m. All teachers are urged to attend. The dele gate to the annual V.T.A. will be elected. Rev. and Mrs. R. Q. Lawing I visited their brother in the Har- , risburg. Pa. hospital last Sunday. He was accidentally hurt at the Bethlehem Steel Company in Harrisburg. Mrs. Bessie Bolden and Mrs. Nancy Owens, of New Y o r k , spent a week here as the guest of their sister Mrs. Mary Tann"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "program Reverends Wins on <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and E. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "program Reverends Wins on <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and E. R."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [995.71, 280.98, 1137.79, 712.12], "bbox_id": "49cdadcb7e", "file": "AppomattoxNewspapers_1962-1965a_0245.pdf", "page": 1, "text": "An unusually large crowd at tended the seventh anniversary of the Appomattox Trumptears in the main auditorium of the Carver Price High School last Sunday evening at 730. The Reverends J. W. Paige and W. R. Jones served as master of ceremonies. The following pro gram was carried out Group singing, Pass me not O Gentle Savior  Prayer, Rev. R. Q. Lawing Scripture reading, Rev. W. R. Jones, Welcome address assistant principal E. T. John son Response the manager of the Gospel Four of Lynchburg. The following singing groups ap peared on program The Gospel Harmcnnettes of Pamplin The Clouds of Joy of Monroe The Gospel Four of Lynchburg and the Williams Family, of Rice. An anniversary cake was presented to the group by Rev. Lawing on behalf of Mrs. J. D. Johnson. The offering of over 100.00 was taken by several deacons from local churches. An impressive service was held at the Galilee Baptist Church last Sunday morning. The pastor delivered a special sermon. The offering for the day was very good. The Junior Choir rendered special music. A Three Way sermon will be delivered at th eGalilee Baptist Church on the first Sunday eve ning in October at 730. The fol lowing young ministers will take a part The Reverends W. R. Jones, J. W. Paige and E. R. Perryman. The service will be given for the benefit of the Car"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. R. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and E. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "The Reverends W. R. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Paige and E. R."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.49, 899.2, 1709.6, 1381.22], "bbox_id": "a33330fdae", "file": "AppomattoxNewspapers_1955-1957a_0286.pdf", "page": 1, "text": "According to the Appomattox County ASC Office, nominations for community committeemen and delegates to the County Convention have been made by the Commuffity Election Boards for the forthcom ing committee elections on Oct. 16. Nominations for each community are as follows Clover Hill Community Bennie Beale, A. W. Covington, W. D. Hix HI, Charles Torrence, W. J. Trent Jr., Jack Caiwthorn, HowardM. Gilbert, R. K. Martin, Bernard C. Richardson, Monroe Webb. Southiide Community J. W. Blanks, A. B. Carson, Floyd Fleshman, E. W. Jones, J. W. Megginson, Harold Chambers Jr., J. P. Harvey, E. W. Mar shall, C. S. Rush, Carter Martin. Stonewall Community Bennett, Harding, Winston Mar tin, Homer D. Reynolds, Charles Scruggs, Hugh Tanner, T. R. Mar tin Jr., Aubrey I. Moore, L. C. Reynolds, C. Roland Smith, Lyle B. Thomas. Petitions signed by 16 or more eligible voters favoring nomination of additional persons will he re ceived bythe community election hoards at any time through Oct. 1 , and the names of persons so pe titioned for will be included in the slate of nominees if found willing to serve and eligible under the Re gulations of the Secretary of Agri culture.  Signed petitions may be sent to D. M. Wood, Appomattox, Va., Chairman of Clover Hill Commun ity Election Board F. O. Jones, Spout. Spring, Va., Chairman of Southside Community Election Board John Alvis, Concord, Va-, Chairman of the Stonewall Com munity Election Board."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J", "W"], "snippet": "Carson, Floyd Fleshman, E. <mark>W</mark>. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Megginson, Harold Chambers"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J", "W"], "snippet": "Carson, Floyd Fleshman, E. <mark>W</mark>. <mark>Jones</mark>, <mark>J</mark>. <mark>W</mark>. Megginson, Harold Chambers"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [620.65, 819.05, 793.14, 1143.19], "bbox_id": "865b3ef795", "file": "AppomattoxNewspapers_1943-1947a_0426.pdf", "page": 1, "text": "VIRGINIA In the t lerks Office of the Cir cuit Court cf Appomattox County on the 6th day of May, 1946. Elliott R. Jones and F. O. Jon . Plaintiff Against Don.,Id Eil.ott Jones, Ruth Jones Hughes. George Martin Jones,Will- mm Kingston Jones, Jane Rita Jones, Paul Warren Jcnes, Marion Grace Jones, Nellie J. Jones Mrs. W m. S. Jones  Unknown heirs at law of W illiam J. Jones, deceas- t Defendants. he object of this suit is to  a e partition of the real estate wied by the Complainants and Defendants in the County of Ap pomattox, Va., And it appearing by affidavit fil ed that Donald Elliott Jones, Ruth Jones Hughes, George Marvin Jones, William Kingston Jones, Jane Rita Jones, Paul Warren Jones, Marion Grace Jones, Nellie J. Jones Mrs. Wm. S. Jones and Unknown Heirs at Law of William S. Jcnes, deceased, are not resi dents of Virginia, they are hereby required to appear within ten days after the due publication of this order .and do what is necessary to protect their interests."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W", "Jones"], "snippet": "Marion Grace Jones, Nellie <mark>J</mark>. <mark>Jones</mark> Mrs. <mark>W</mark> m. S. <mark>Jones</mark>  Unknown"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W", "Jones"], "snippet": "Marion Grace Jones, Nellie <mark>J</mark>. <mark>Jones</mark> Mrs. <mark>W</mark> m. S. <mark>Jones</mark>  Unknown"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1269.84, 984.46, 1388.04, 1544.55], "bbox_id": "08f3a18183", "file": "AppomattoxNewspapers_1955-1957a_0224.pdf", "page": 1, "text": "TRUSTEES SALE Pursuant to authority vested 1 undersigned Trustees by ratal that certain deed of trait, November 18th., 1955, exeuM Mary Kathryn Jones Jones, wife and husband r ly, of record in the Clerks of the Circuit Court of tox County, Virginia, on N 21st., 1955, in D. B. S3, it 321, that whereas, default been made in the payment if indebtedness therein secured, Upon request by the holder 1 obligation that said trust be ted, and in conformity the following described real will be offered for sale is pliance with the terms and tions of the aforementioned ment. DESCRIPTION All of that certain tract 1 cel of land with the buildn improvements thereon, sit Stonewall Magisterial Hsj Appomattox County, Virginia two  2  miles!north of J- Depot, and laying on M of ,the main road leading fa ford to Stonewall, contsifflf proximately 98-  atSi  same more or less, being ed and to be sold by the and not by the acre, MW the lands now or formerly at Essie Jones and Cora fa It is the same rea 1 estate Adolphus Jones acquired W j from Go. F. Abbitt, , Commissioner, dated_ JW, 1950, of record in D. B. Hi 336, and by deed, dated 14th., 1950, the said  Jones conveyed said real - Mary Kathryn Jones, J which is of record on A 1950, in D. B. 53, d Place of Sale On The Time of Sale 1040 1  Friday July 27th Terms of Sale C Austioneer James Tip Trustees J. C. Davidson Burke.  6 - 21-6 tc"}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "j"], "snippet": "rea 1 estate Adolphus <mark>Jones</mark> acquired <mark>W</mark> <mark>j</mark> from Go. F. Abbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "j"], "snippet": "rea 1 estate Adolphus <mark>Jones</mark> acquired <mark>W</mark> <mark>j</mark> from Go. F. Abbitt,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.49, 217.07, 1766.69, 819.6], "bbox_id": "38d51d2543", "file": "AppomattoxNewspapers_1974-1975a_0437.pdf", "page": 1, "text": "this Sunday morning at 10 a.m The churches involved are asked to have all candidates ready at 10 a.m. Immediately following the baptizing service the regular preaching service will follow. The right hand of fellowship will be given at the close of the morning message and the Lords Supper will be adm inistered. The general public is cordially invited to attend. Seating capacity of the Appo m attox Elem entary Schbol was taxed to its capacity last Sunday evening when the Appomattox Trumpteers cele brated its nineteenth annivers ary. Every community in the county was represented and many guests from outside the local community. The Rever ends W.R. Jones and J. W. Paige assisted in the program. The Rev. R. Q. Lawing and the Galilee Baptist Church Senior Choir took a part in the installation of the Rev. Dr. G. N. Marshall as pastor of the Mount Pleasant Baptist Church of Rt. 2, Gladys, Va. last Sunday evening at 6 p.m. The youth program sponsor ed by the Youth Club of the Mount Shiloh Baptist Church last Sunday evening at 3 p.m. was enjoyed by all. Miss M argaret Calloway Burns served as mistress of cere mony. Music was rendered by the Mount Shiloh Junior Choir under Mrs. C.S. Turner for the devotional period. Scripture was read by Miss Gail Tanner and prayer was offered by Miss Bridgette Watts and a very cordial welcome was extended by Miss Marzatte Hodnett Mrs. T. W. Hamlett responded to the welcome. The special guest, The Pinn Family Singers of Madison Heights was introduced and presented by the youth leader, Mrs. Rowena Robinson. The offering was very good. The final remarks"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "The Rever ends W.R. <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige assisted in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "The Rever ends W.R. <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige assisted in the"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [312.5, 250.51, 458.95, 1089.16], "bbox_id": "90959416b4", "file": "AppomattoxNewspapers_1971-1973a_0056.pdf", "page": 1, "text": "The general public is cordial- i ly invited to attend the annual union baptizing services held at the P r o m i s e Land B a p t i s t Church this f o u r t h S unday ! morning beginning at 10 a.m. 1 Candidates from Galilee, Mount Shiloh, Promise Land and Morning Star will be baptized ! At 11 a.m. regular preaching services will be conducted and the Holy Communion will be served. A large crowd attended the fifteenth anniversary of theAp- j pomattox Trumpteers last Sun day evening at 730 in the audi- j torium of the Appomattox Inter mediate School. The Reverends W. R. Jones and J. W. Paige j served as m asters of ceremony. The following groups appeared on the program The Johnson j Family of Lynchburg The Holi-  ness Gospel Singers of Pamp- j lin The Gospel Echoes of Dan-  ville, and the Waynesboro Sing- ! ing Aires of Waynesboro. The j general offering was lifted by j Deacons James C h r i s t i a n of Amherst, Deacon W. Hancock  of Appomattox and Deacon Cal- I vin Elliott of Spout Spring. Ordination services will be i held at the Mount Airy Baptist j Church this Sunday at 3 p.m. for the following young men as deacons of the Mount Airy Bap tist Church M essers Joseph Berry, Edward McCoy and Al W. J o h n s o n . M e m b e r s and friends of local churches are cordially invited to attend. The Rev. H. W. Pryor is taking this opportunity to invite ministers and deacons to attend. Impressive services w e r e held at the Galille B a p t i s t Church last Sunday morning at the regular preaching hour.Spe cial music was rendered by the combined choirs of the church. Several visitors attended the service. Mrs. Letha Moss was the month leader. She reported the sum of 50.25 during the offering period. Mr. Tom Davis is receiving special treatment in the Lynch burg General Hospital. Mrs. Lillie Stevens spent the week end in Roanoke, Va., as the g u e s t of relatives an d friends. The public is reminded of the trip to Baltimore on the third Sunday in October. The bus will leave at 6 a.m. in the morning. Rev. Lawing will deliver the homecoming message at the Peaceful Zion Baptist Church in Lynchburg on the first Sunday in October at 3 p.m. Music will be rendered by the Galilee Junior Choir. The Rev. J. W. Paige is con ducting the annual revival at the Mount Pieler Baptist Church this week. Friends are invited to attend."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W", "j"], "snippet": "The Reverends W. R. <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige <mark>j</mark> served as"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W", "j"], "snippet": "The Reverends W. R. <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige <mark>j</mark> served as"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.84, 1647.68, 1829.31, 1780.81], "bbox_id": "b48a2aaae2", "file": "AppomattoxNewspapers_1898-1902a_0338.pdf", "page": 1, "text": "The following citizens well known to our readers have been summoned as jurors for the fall term of the U. 8. District Court, which will begin in Lynchburg on September 11  AppomattoxJ. C. Jones and W. J. Trent. BuckinghamW. W. Haskins. J. H. Fitzgerald. CumberlandJ. W. Adams and Eugene Davis."}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J", "W"], "snippet": "September 11  AppomattoxJ. C. <mark>Jones</mark> and <mark>W</mark>. <mark>J</mark>. Trent. BuckinghamW. <mark>W</mark>. Haskins."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J", "W"], "snippet": "September 11  AppomattoxJ. C. <mark>Jones</mark> and <mark>W</mark>. <mark>J</mark>. Trent. BuckinghamW. <mark>W</mark>. Haskins."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [130.1, 737.4, 273.15, 1578.45], "bbox_id": "f54dd1486e", "file": "TimesVirginian_1976_0396.pdf", "page": 1, "text": "The East and West Bound Sunday School Union will convene with the Chestnut Grove Sunday School this Sunday at 1000 a.m All schools are asked to be presented. The day sessu begin with the Sunday School lesson. The first business will begin at 1100 a.m. The annual sermon will be delivered by the pastor of the church. The president will bring recomendations for the new year. Refreshments will be served by the home school at the close of tije business session. The general public is cordially invited to attend. The general public is cordially invited to atend the anniversary celebration of the Mount Shiloh Church Usher boards, on the first Sunday evening at 3 p.m. The Rev, Wyatt T. Venable and his church choir will be the special guest. Mrs. Lucinda Lewis, president will serve as mistress of ceremony. A musical program by Mr. James Braxton of the Rose Chapel Baptist Church will be presented at the Promise Land Baptist Church on the second Sunday in November at 3 P.M . On the first Sunday evening at 6 P.M . the Rev. R. Q. La wing and the Galilee Senior choir will be the special guest at the Mount Pleasant Baptist Church at H ixburg. Members and friends are reqeusted to attend. The general public is invited to attend a special service sponsored by the Pastors Aid Society of the Zion Baptist Church this Suhday at 11 a.m. The Rev. James Franklin of West Virginia will be the guest speaker. Impressive service was held at the Promise Land Baptist Church Sunday morning. The Rev. K . W. Davis was the guest speaker. Beautiful music was rendered by the senior choir. He was assisted in the service by the Rev. A . B. Jones. A very large crowd attended the regular preaching service at the Mount Pleasant Baptist Church last Sunday morning. The Rev. Mr. Ghee of the High Rock Baptist Church was the guest speaker. He was assisted in the service by the Rev. H. 0 . Flood who served as master of ceremony and the Rev. R. Q. Lawing. All officers of the Assembly are asked to attend the next Council meeting on Wednesday Nov. 3rd at 730 P.M . at the Galilee Church Fellowship Hall. We are very happy to report the Reverends W. R. Jones and J . W. Paige have returned to"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "the Reverends W. R. <mark>Jones</mark> and <mark>J</mark> . <mark>W</mark>. Paige have returned to"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "the Reverends W. R. <mark>Jones</mark> and <mark>J</mark> . <mark>W</mark>. Paige have returned to"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [592.99, 1647.8, 751.8, 1782.2], "bbox_id": "c14c500b22", "file": "AppomattoxNewspapers_1898-1902a_0339.pdf", "page": 1, "text": "Th following citizens well known to our readers have been summoned as jurors for the fall tsrm of the U. District Court, which will begin in Lynchburg on September 11 AppomattoxJ. C. Jones and W. J. Trent BuckinghamW. W. Haskins. J. H. Fitzgerald. CumberlandJ. W. Adams and Engene Davis."}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J", "W"], "snippet": "September 11 AppomattoxJ. C. <mark>Jones</mark> and <mark>W</mark>. <mark>J</mark>. Trent BuckinghamW. <mark>W</mark>. Haskins."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J", "W"], "snippet": "September 11 AppomattoxJ. C. <mark>Jones</mark> and <mark>W</mark>. <mark>J</mark>. Trent BuckinghamW. <mark>W</mark>. Haskins."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2555.59, 1164.59, 2703.95, 1644.74], "bbox_id": "00d7503cdc", "file": "AppomattoxNewspapers_1962-1965a_0609.pdf", "page": 1, "text": "Shown abc-ve is a copy of the 5-cent Appomattox Commemora tive postage stamp, fifth and final in the Civil War Centennial series. The stamp will be issued April 9 with ceremonies here at Appomattox and will include an official visit from the assistant postmaster general, William M. McMillan. Lonard Fellman, 44- year-old commercial artist of Edina, Minnesota, designed the stamp, an unsolicited stamp de sign which met with approval from Postmaster General John A. Gronouski. It is a rarity for 1 unsolicited designs to be accept ed for postage stamps. Fellmans designs shows a soldier and stacked rifles sil-  houetted against a blue a n d gray background. A phrase from Lincolns second inaugural ad- I dress  with malice toward none . .  catches the mood I of the event at Appomattox that was to lead to the end of hos tilities. At the top of the stamp ap- I pears Civil War Centennial in  black, and beneath this Is Ap- I pomattox in white. Both are in  modified barnum, as are the dates  1865-1965, in b l a c k , w h i c h appear vertical left. United States Postage, In j white sans serif capitals is at the j base of the stamp and the de- I nomination 5 cents is lower i right. Of the five stamps in the Civil  War centennial series, this is the j sole vertical design. It was mod- i cled at the Bureau of Engrav ing and Printing by Robert J. j Jones. Arthur W. Dinlaman en-  graved the vignette and letter  ing and numerals are by George j A. Payne. One hundred fifteen I million will be printed on the Giori press in black and blue."}, "highlight": {"text": {"matched_tokens": ["j", "Jones", "W"], "snippet": "Printing by Robert J. <mark>j</mark> <mark>Jones</mark>. Arthur <mark>W</mark>. Dinlaman en-  graved the"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Jones", "W"], "snippet": "Printing by Robert J. <mark>j</mark> <mark>Jones</mark>. Arthur <mark>W</mark>. Dinlaman en-  graved the"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.96, 1439.83, 1959.72, 1721.03], "bbox_id": "cdacce6580", "file": "AppomattoxNewspapers_1915-1918a_0466.pdf", "page": 1, "text": "R ed Gross The following organization was perfected last night Chairm an, 8. L , Ferguson vice-chairm an,M rs. J A. Sears secretary, Miss Anna Jones treasurer. Miss Eula Burke. Executive Com m ittee8. L Ferguson, B. G. Anderson, L Orawley, A. H. Glement, Dr. O W. Jones, Mrs J. A. t-eare, Miss Anna Jones, Miss E ula Burke Mrs. Jam es 8tanley, Mrs. 8. L. Ferguson E ntertainm ent Com m ittee Mrs Lindsay Craw ley, Miss Anna Jones, Miss Godwin Miss Rollins. Serving Committee  Miss Luster Gold, Mrs Jam es Stan ley, Miss N ina Jones, Mrs. R C. W agner. K nitting Committee  Mrs Jeannette Mann chairman"}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "H. Glement, Dr. O <mark>W</mark>. <mark>Jones</mark>, Mrs <mark>J</mark>. A. t-eare, Miss Anna"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "H. Glement, Dr. O <mark>W</mark>. <mark>Jones</mark>, Mrs <mark>J</mark>. A. t-eare, Miss Anna"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.39, 745.97, 2137.62, 966.57], "bbox_id": "78aacfece1", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "Pursuant to a decree of the Circuit Court of Appomattox County, rendered April term 1807, in the obanoery suit of Fore, See. vs. Fore. c. we will offer for sale a t public auction at Appomattox Court House, a t 12 oclock M., ou THURSDAY, AUGUST 5th, 1897, that being County Couxt day the tract f 244 acres ot land, more of les?, in the pro ceedings in said suit mentioned. This trac t of land is situated on the watui F of Appomattox Kiver a n  Holliday reek, adjoining the lands of Wm. A. Jones, Wm. J. W atkins and Alex. A. Morris. It has upon t a good dwell!ug house, with m w ra ry ou.- buildingB, and aboutt5 acres of lino iTver and creek flats. This is the tract oi !und ui oil which Prerorick W. Fore resided o - u n .m- ber of yeai r . and ha always been i ru d i an exceptionally good pin e. T erm s Ca li, about yti.V.u for the osidi e of the purcluiBc money a credit o o.uv t o and three years will be gi6ii. The rui chaser will be required to give bonds in eU 1 installm ents for the deferred payments, w 1 h ? ood personal security, bearing intore t rora the day of sale, bu., if any purchaser will pay n s muoh as one-fourth of tuc pur chase money in cash, personal security will be dispensed with. Sale Subject to ratifica tion by the court. W. 0. F ranklin , C. H. S ackett , Commissioners."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "lands of Wm. A. <mark>Jones</mark>, Wm. <mark>J</mark>. <mark>W</mark> atkins and Alex. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "lands of Wm. A. <mark>Jones</mark>, Wm. <mark>J</mark>. <mark>W</mark> atkins and Alex. A."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1228.81, 901.38, 1452.1, 971.53], "bbox_id": "279123471a", "file": "AppomattoxNewspapers_1933-1936a_0518.pdf", "page": 1, "text": "OFFICERS E. P. Miller ............. .. ............. ....................... O. B. Barker ........................................................  J. D. Owen ........................... W J. L. Jones . .............................. ....................... J. L. Nicholas.......................................................Assis L. W. Horton .. ri . .. ................................."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones", "J", "W"], "snippet": "OFFICERS E. P. Miller ............. .. ............. ....................... O. B. Barker ........................................................  J. D. Owen ........................... <mark>W</mark> <mark>J</mark>. L. <mark>Jones</mark> . .............................. ....................... <mark>J</mark>. L. Nicholas.......................................................Assis L. <mark>W</mark>. Horton .. ri . .. ................................."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones", "J", "W"], "snippet": "OFFICERS E. P. Miller ............. .. ............. ....................... O. B. Barker ........................................................  J. D. Owen ........................... <mark>W</mark> <mark>J</mark>. L. <mark>Jones</mark> . .............................. ....................... <mark>J</mark>. L. Nicholas.......................................................Assis L. <mark>W</mark>. Horton .. ri . .. ................................."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [442.53, 212.73, 586.89, 348.7], "bbox_id": "b8dc3db441", "file": "AppomattoxNewspapers_1918-1922a_0451.pdf", "page": 1, "text": "Notice of D issolution Tbo partnership h ereto fo re Ixbiatiotc between W. E. Jones Ind J K Poe under the firm I me 0f W. E Jones  J. B. oe has been dissolved ty mu lual consent.  25-3w W. E. J okes . ThcTsocond Sunday in June . d esig n ated as Fathers Day Jed flowers will be used. Put In your order early i 12w. Miss E. M. B ubkb"}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "firm I me 0f <mark>W</mark>. E <mark>Jones</mark>  <mark>J</mark>. B. oe has been"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "firm I me 0f <mark>W</mark>. E <mark>Jones</mark>  <mark>J</mark>. B. oe has been"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1050.68, 697.07, 1390.08, 736.87], "bbox_id": "a4f531be78", "file": "AppomattoxNewspapers_1947-1949a_0496.pdf", "page": 1, "text": "NOTICE Anyone interested in Against Jnea PlantifT piano or voice lessons contact j Edward W. Jones. William nanl .1 M.UIU. Jones and Velna Jones  als, dtp"}, "highlight": {"text": {"matched_tokens": ["j", "W", "Jones", "Jones", "Jones"], "snippet": "NOTICE Anyone interested in Against Jnea PlantifT piano or voice lessons contact <mark>j</mark> Edward <mark>W</mark>. <mark>Jones</mark>. William nanl .1 M.UIU. <mark>Jones</mark> and Velna <mark>Jones</mark>  als, dtp"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Jones", "Jones", "Jones"], "snippet": "NOTICE Anyone interested in Against Jnea PlantifT piano or voice lessons contact <mark>j</mark> Edward <mark>W</mark>. <mark>Jones</mark>. William nanl .1 M.UIU. <mark>Jones</mark> and Velna <mark>Jones</mark>  als, dtp"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [119.74, 648.63, 285.62, 915.22], "bbox_id": "ca9bbd4c0c", "file": "TimesVirginian_1980a_0406.pdf", "page": 1, "text": "n. Dont forget the widows bl program given at the Mt.   Bniioh Baptist Church this  8n Sunday evening at  p.m. , The reverends C. L. Elliott, . R . Jones and J. W. Paige will present a special sermon ff. p rtfcir choker . -.Thai annual mens pro-  TJ grain will be held on the , n second Sunday in December ? ft S p.m. at the Promise And Baptist Church. Local . ,u hens elbbs are invited to I -The- Rev. J. W4, i 5 n jg e and his mens chorus j Z  Rill be the special guest. -T  quarterly church , gi Ghg will be held at the I Mt. Shiloh Baptist Church Yf Saturday before the aeeoud 1 Sunday hi December. -- Denonn Stewart Robinson, n s returned to bis home p ier an operation in the w Lynchburg General Hospi-"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "C. L. Elliott, . R . <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige will present a"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "C. L. Elliott, . R . <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Paige will present a"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [678.23, 263.82, 1002.4, 617.28], "bbox_id": "c1eb47ae7d", "file": "AppomattoxNewspapers_1892-1898a_0306.pdf", "page": 1, "text": "Lieut D. J . Evans 2nd Lieut,Jno. P. Harvey 3rd Lieut, C. W. Hun ter 1st Sergt., W. J. Colima  2nd Sergt, W. E. Isbell 3rd Sergt, J S. H unter 4th Sergt,E. W. Walker 5th Sergt, H. D. LeGrand 1st.  _ Corpl., T. J . Stratton 2nd Corpl., o f l 4 by,oronbehah _ _ __ 7 . _  _ I or, toe plaintiff, to ascertain in what onuntv T. D. Evans 3rd Corpl, G. S. Jones 4th Corpl., J. P. Br anch I P a t s e y Femju Musicians, E. G. Jenkins and T. M. ?J ut?irrV nd  ciarithe iaat  i dec years of age who are heirs at Turner. Il?w . .iS11 M. Johnson and necestary par ties to this -suit, reside without effect that p u iv u r s l Pf??!88.,118 heen sent to various counties and EK1 AXES. I corporation against them and returned non a h it - t  . T, , r I residents and that their piaces ot residence Allen, . R ., Anderson, D. M ., I re unknown, it is ordered that they do at- . . . .  t -r, t , . I herp within tlfteen days after due publi- Aydlott, W. D., Bass, W. R., Bates, I cation of this order and do what may be nee l i t ! n - l. n -m I ciwary to protect their interest In the prem- Boaz, J. D. B in g h a m , G. W. I And that a copy of this order be pub- n  i i . m  n n , I  ,d once a week rorfour successive weeks Oralle, I. L. Collins, E. r . Carson, I n the Appomattox and Buckingham Times, a  newspaper published in the State of Virginia and nriGtod mo tlw, a t _ _ a .  J. M. Carson, W. H. Cardwell, C. W. Cum by, F. W. Cheatham, T. H A. Christian, H. B. Dickey, J. S. Davidson, 8. S. Drinkard, Wm. I Evans, D. E. Eisman, M. Furbush, I C. H. Foster, W. T. Fleshman, J. P. L. Grow, J. P. C. Grow, W. B. Glover, J. H. Garland, B. C. Harris, T. Harris, W. M. Howard, W. D. Howerton, A. P. Hundley, J. R. Hunter, R. P. Hendrick, G. Isbell, M. Isbell, A. J. Jones, T. W. Jones,  F. B. Jones, II. C. Jones, J. J. John-"}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W", "Jones", "Jones"], "snippet": "Isbell, M. Isbell, A. <mark>J</mark>. <mark>Jones</mark>, T. <mark>W</mark>. <mark>Jones</mark>,  F. B. <mark>Jones</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W", "Jones", "Jones"], "snippet": "Isbell, M. Isbell, A. <mark>J</mark>. <mark>Jones</mark>, T. <mark>W</mark>. <mark>Jones</mark>,  F. B. <mark>Jones</mark>,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1053.34, 660.15, 1223.01, 825.69], "bbox_id": "1b37d03cfa", "file": "AppomattoxNewspapers_1939-1943a_0562.pdf", "page": 1, "text": "Leroy Jones, of the U. S. Navy,  spent several da s here with his 1 parents, Mr. tnd Mrs. W. A. Jones j of Route Two. Ezra Hamlet, of the U. S. Navy spent the week-end here with his sister and brother, Mr. and Mrs. J.  A. Hamlet and Mrs. Ada Jenkins.  T. Cpl. Joseph Robinson, of the  IT. S. Army is spending a furlough i with his parents at Pamplin. Miss Mattie Hicks is teaching in  Mrs. Mattie Tiant Wests position! at Spout Spring. Professor C. A. Pennington at tended the teachers meeting in Rich mond last Thursday. Mrs. Mozella Trice represented"}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "j"], "snippet": "parents, Mr. tnd Mrs. <mark>W</mark>. A. <mark>Jones</mark> <mark>j</mark> of Route Two. Ezra"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "j"], "snippet": "parents, Mr. tnd Mrs. <mark>W</mark>. A. <mark>Jones</mark> <mark>j</mark> of Route Two. Ezra"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [346.59, 300.51, 523.09, 1763.43], "bbox_id": "f490ffaac6", "file": "AppomattoxNewspapers_1902-1905a_0217.pdf", "page": 1, "text": "l ii i c k i i iK h a i i i. At a largely attended mass-meet ing B. F. Nuckola was nmde chair man and _ P. Grigg, secretary. Fhe object of the meeting was the adoption of the resolutions printed below, bidding fuiewdl to tbe old County Court system, and the strong ndorsement of Judve Moss, as a Tair and impartial judge, who has -irerided over the court for the past twelve .rars. Col. Kobt. T. Hub bard. Hon. E. W. Hubbard, A. P. Grigg and others spoke feelingly to the resolution and Judge A. 8. Hall, while not opposing the resolution, -aid he was glad the constitution bad abolished the Conntv Court -ysteni. The resolution was adopt ed, and the Messrs. Hubbard and Col. James Lyons were appointed a committee to inform Judge Moss of I - he action of the meeting, and the Judge came forwa-d and in a few well chosen remarks thanked the bar and the meeting for the expres sions of confidence and esteemed the resolutions contained. Whereas our English ancestors rod their decendants in America have for nearly a thousand years had i court of tbe shire, or county court for hearing and determining the minor controversies of the people, a court especially intended for the masses of small means to save them from journeys and heavy expense, nd whereas such local tribunal is t great convenience to them and either it or some substitute will be necessary for letting to bail, ap pointment of guardians and person- 1 representatives, probate of wills tnd etc., therefore Resolved, by this mass-meeting  -f citizens of Buckingham county, held at this December connty court, 1903, that we regret the change in the, constitution abolishing this court. 2nd.  That in severing our rela tions with the incumbent, Judge John R. Moss, we bear cheerful testimony to tbe intelligence, integ rity, ability and dignity with which he has discharged the duties of County Judge, and in his retire ment will carry with him our best i wishes for bis wellfare. 3rd. That these proceedings be certified to the County Court with the request that they be entered on I the minutes of the Court. Jndge Moss will tender his resig nation as Connty Judge of Buck ingham as soon as the present term is adjourned, and will assume his duties in the Legislature the first of the year. Governor Montague! will be requested to appoint Jndge Crute, of Farmville, to hold the I January term. In the Court the only case of any importance was that of J. A. Le- Sneur  Bro., applicants for liquor license at lpha, which was opposed by a large petition to the Judge, ask ing that license be not granted. The Jndge continued the case, and ren dered an opinion, in which he said he had rather the new Court would pais upon the application for . li cense when there is objection. J. A. Trent ws granted  license to sell liquor near Arvonia, there being no opposition to him. Peter Coles, of Albemarle, and Mr. Addie Spencer were hunting at New Store last week. They were! the guests of Mr. L. D. Jones. Mr. J, W. Word has been ap- to the position of store keeper for the National Government at a salary of 2 per day. It iB said Mr. Wiley Hubbard will be married on the 16th to a Miss Sims. Marriage licenses have been is sued during the month as follows Jas. P. Andrews to Emma Lang- horn Gantt, J. E. Pnrvis to Mary E. Miles. Mr. Henry Glencrossi Hebditch to Mies Ora Kyle Spen- oer, at Enon church on December 23rd at noon. The young lady is a daughter of Willis Bocock Spencer, and the groom to be is a son of Mr. J. W. Hebditch. I Justice Garnett held a trial Mon-1 day night, and fined Isiah Moss 5 1 and cost for swearing upon the i.reet, and placed him under a peace bond of 200. Mr. William Spencer, is perhaps, the happiest travelling man who represents a Lynchburg house. He sold for the Quin-Marshall Co., in about eleven months time 100,000 in drygoods and notions. When this fact was reported to Mr. Spen cer, he promptly served notice ou his employers that he had a vaca tion due him. His request was granted and for two weeks be has been the guest of his brother, Mr. Sidney Spencer, down in old Buck- iugham, where he has made many a fleety buck bite the dost before his unerring aim. December 15, 1903."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "of Mr. L. D. <mark>Jones</mark>. Mr. <mark>J</mark>, <mark>W</mark>. Word has been ap-"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "of Mr. L. D. <mark>Jones</mark>. Mr. <mark>J</mark>, <mark>W</mark>. Word has been ap-"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [339.34, 454.55, 657.35, 574.56], "bbox_id": "9cd642f942", "file": "AppomattoxNewspapers_1898-1902a_0540.pdf", "page": 1, "text": "Joseph Button, S. L. Ferguson, R. L. Burke, D. A. Langhorne, J. C. Jones.. W ilson H. Craile, J. R. Horsley,  COIU5ES FONI K TS Firt National Bunk of Lynchburg, American Nntioua Bank of Richmond, Ciiuso National Bunk of New York. , DEPOSITS tolicitod subject to check. luteiest paid upon time certificates of LOANS made upon satisfactory security, real or personal. ______"}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W", "J"], "snippet": "Burke, D. A. Langhorne, <mark>J</mark>. C. <mark>Jones</mark>.. <mark>W</mark> ilson H. Craile, <mark>J</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W", "J"], "snippet": "Burke, D. A. Langhorne, <mark>J</mark>. C. <mark>Jones</mark>.. <mark>W</mark> ilson H. Craile, <mark>J</mark>."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1308.5, 1361.94, 1445.1, 1498.14], "bbox_id": "c0562810f3", "file": "AppomattoxNewspapers_1912-1915a_0272.pdf", "page": 1, "text": "H Orange County Fair V, on 1er 1914 have been elected nuirr? Lyne president S. yuu, j. F. Vanderhoff and Thomas vice-presidents Roy W. .secretary and manager, and   s. Willis, E. M. Timberlake, E. Wfs. R. D. Browning, W. N. q , T HHaday, Jr., R. F. Hol-  A C. Wambersie, T. G. Scott,  J- Camper, Jack Woodruff, Wll- Bu Pont, w . L. Kirby, A. A. V  Gillum, W. F. Jones, J. N. jZ? W- L- Bradbury and George    or, board of directors."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J", "W"], "snippet": "A. A. V  Gillum, <mark>W</mark>. F. <mark>Jones</mark>, <mark>J</mark>. N. jZ? <mark>W</mark>- L-"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J", "W"], "snippet": "A. A. V  Gillum, <mark>W</mark>. F. <mark>Jones</mark>, <mark>J</mark>. N. jZ? <mark>W</mark>- L-"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2297.5, 1227.8, 2562.26, 1367.01], "bbox_id": "791af7f0a6", "file": "AppomattoxNewspapers_1926-1933a_0537.pdf", "page": 1, "text": ",fo the year OFFjUKRS - -fo attack- E- P- Mimfe ............ ..........----------------- O. B Barker .................... five-. .............. foatter of H. T. Nicholas ................ k  ........... .. J. D. Owen ...................... .. Vice-Prea  r t - J. L- Jones ...................... W ........... - a ---- J. L. Nicholas .............. .. .................. -.. Af RESOURCES 1 in the Eight Million Five Hundred Thousand THE OLD, BIG, STR O N G ."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W", "J"], "snippet": "Owen ...................... .. Vice-Prea  r t - <mark>J</mark>. L- <mark>Jones</mark> ...................... <mark>W</mark> ........... - a ---- <mark>J</mark>. L. Nicholas"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W", "J"], "snippet": "Owen ...................... .. Vice-Prea  r t - <mark>J</mark>. L- <mark>Jones</mark> ...................... <mark>W</mark> ........... - a ---- <mark>J</mark>. L. Nicholas"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [691.88, 940.82, 849.68, 1215.54], "bbox_id": "e210bacdea", "file": "AppomattoxNewspapers_1898-1902a_0554.pdf", "page": 1, "text": "FBAW OJkC 0 d i s t r i c t . A t a district meeting held at New Store on the 7th instant, delegates were elected favorable to the candi dacy of Wm. P. Ellis for the State Senate, to wit, II. F. Chappell aud Louis j. Jones and J . W. Hebditch and Paul M. Jones to tje Rucking- ham-Camberhmd convention, in structed to vote for A. B. Armstrong for the House of Delegates. The district committee was also recast, L. D. Jones, W. C. Chappell, and J . W- Heigjitpii being chosen as the new committee The following wag unanimously passed  Resolved, That this meeting en dorses the candidacy of A. B. Arm strong as candidate for the House of Delegates, as in all justice aud fair ness Cumberland is entitled to the nomination, Buckingham having named tie candidate three times in the last, four elections. V. C. C happell , Chairman. J . W. HJBBPITGH, Secretary."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "Chappell aud Louis j. <mark>Jones</mark> and <mark>J</mark> . <mark>W</mark>. Hebditch and Paul M."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "Chappell aud Louis j. <mark>Jones</mark> and <mark>J</mark> . <mark>W</mark>. Hebditch and Paul M."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2174.92, 517.38, 2339.32, 1004.96], "bbox_id": "7ff0ded123", "file": "AppomattoxNewspapers_1922-1923a_0512.pdf", "page": 1, "text": "F o re s t C hapel. Revival services closed here on la 3 t Friday night with eleven con versions. There were large attend ances and Rev. J. 8 . Jones preached some excellent sermons. Rev. J. J. Gook began a series of meetings at Pamplins Baptist Church on last Sund iy morning and will continue on through thé week, morning and night service. Childrens Day-Picnic will be tmld at the Chapel here on Satur day, Aug. 24th. Shaking begins at 10 oclock a. m. All come and enjoy the day. A very mysterious robbery oc- cured at the home of Mr. J. D. Childress on last Tuesday eight. While he and his family were at- nding meeting the kitchen door of his residence was broken open and 30 in cash was stolen from his ingiters trunk. As nothing else n the house was disturbed it is ought that the money was taken few weeks before e.tiil that the or wm broken in that night to try and mi.lead the clue, us tiie m mev had not been examined for several weeks. Strong suspicion rests upon a certain party and pro bably heir rrest will soon follow. Revs. J. 3aunders Jones and J. W. Meadows are a 1 tending the Bap tist Association in Farmville this eek. Mr. Brown Roach, of the U. 8 .  my, is visitiny his brother, Mr. 1. Roach."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "follow. Revs. J. 3aunders <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Meadows are a 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "follow. Revs. J. 3aunders <mark>Jones</mark> and <mark>J</mark>. <mark>W</mark>. Meadows are a 1"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.71, 505.86, 1902.89, 632.26], "bbox_id": "ed6caee06f", "file": "AppomattoxNewspapers_1962-1965a_0137.pdf", "page": 1, "text": "enship, forgery. Commonwealth annua eace Service scheduled vs Steve Justus, unauthorized use or Sunday at the Surrender of a motor vehicle. Grounds. The service begins with   the Appomattox High School Grand Jury Band concert at 2 p.m., followed The Grand Jury was composed j py a worship service at 230. of Duvall Conner, R. B. Hudgins J. L. Thornhill, W. A. Jones, J. H. OBrien, G. F. Langran, and H. C. Blackwell. They were in structed by the court that they will be called to hear other cases before the current term of court is completed."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "Hudgins J. L. Thornhill, <mark>W</mark>. A. <mark>Jones</mark>, <mark>J</mark>. H. OBrien, G. F."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "Hudgins J. L. Thornhill, <mark>W</mark>. A. <mark>Jones</mark>, <mark>J</mark>. H. OBrien, G. F."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [800.65, 654.68, 978.93, 944.02], "bbox_id": "99dd2d12f4", "file": "AppomattoxNewspapers_1943-1947a_0414.pdf", "page": 1, "text": "E-Lott Jones, Ruth Jones George Martin Jones,Will- ir-ton _ Jones, Jane Rita . ones, Paul V, arren Jcnes, Marion  Grace Jones, Nellie J. Jones Mrs. Am. S. Jones  Unknown heirs  at law of W illiam J. Jones, deceas- j tcb Defendants, j , The object of this suit is to have partition of the real estate i owned by the Complainants and  Defendants in the County of Ap-  pc mattox, Ya., And it appearing by affidavit fil- j ed that Donald Elliott Jones, Ruth  Jones Hughes, George Marvin Jones, William Kingston Jones,  June R.t-i Jones. Paul W arren Jones, Marion Grace Jones, Nellie J. Jcnes Mrs. M m. S. Jones ar.d Unknown Heiis at Law of William S. Jones, deceased, are not resi dents of Virginia, they are hereby required to appear within ten das after t e due publication of this orcer and do what is necessary to protect their interests. Teste C. .V. Smith, Clerk. T. M. Abbitt, p. q. o-9-4tc"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones", "j"], "snippet": "heirs  at law of <mark>W</mark> illiam <mark>J</mark>. <mark>Jones</mark>, deceas- <mark>j</mark> tcb Defendants,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones", "j"], "snippet": "heirs  at law of <mark>W</mark> illiam <mark>J</mark>. <mark>Jones</mark>, deceas- <mark>j</mark> tcb Defendants,"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.19, 1659.06, 1679.72, 1720.08], "bbox_id": "58758fb056", "file": "AppomattoxNewspapers_1939-1943a_0371.pdf", "page": 1, "text": "E- P. killer . _ - J T. N oa II ................................President OFFICERS J- Noell, Jr  D. Owen . ................ J. L. Jones . ............ J Niclsias  W. Horton"}, "highlight": {"text": {"matched_tokens": ["J", "J", "J", "Jones", "J", "W"], "snippet": "E- P. killer . _ - <mark>J</mark> T. N oa II ................................President OFFICERS <mark>J</mark>- Noell, Jr  D. Owen . ................ <mark>J</mark>. L. <mark>Jones</mark> . ............ <mark>J</mark> Niclsias  <mark>W</mark>. Horton"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "J", "Jones", "J", "W"], "snippet": "E- P. killer . _ - <mark>J</mark> T. N oa II ................................President OFFICERS <mark>J</mark>- Noell, Jr  D. Owen . ................ <mark>J</mark>. L. <mark>Jones</mark> . ............ <mark>J</mark> Niclsias  <mark>W</mark>. Horton"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.9, 727.64, 1785.1, 1080.54], "bbox_id": "a8377d9c80", "file": "AppomattoxNewspapers_1912-1915a_0334.pdf", "page": 1, "text": "Charlottesville.For tbe purpose of putting an end to the series of burg laries from which the .University of Virginia community has suffered, a number-of students have organized,a Vigilance Committee. The follow ing men, most of whom have been ap pointed by Judge John W. Fishbume, of the Circuit Court, as special police for Albemarle county, comprise the committee at present Harry Varner, assistant football coach Pichegru Woolfolk, captain of next falls foot ball eleven M. S. Fitchett, member of last years baseball team Wylie Cooke, ex-captain of the track team T. H. Todd, P. H. Bailey, W. A. Jones, J. S. Graves, John B. Jenkins, E. W. Smith, Jr., George B. Eager, Jr., Sid ney Davis, Nelson Harris, Bernard Meredith, Jesse Ford, J. C. Lamb, W. H. Whitmore and Dr. J. A. WaddelL The objects of the committee are to raise by. subscription from the stu dents, faculty and members of the community a large sum of money to be used in employing expert detectives and in obtaining bloodhounds to use in tracking the criminals to ask the co-operation of the community In de tecting the burglars by reporting any possible clue, and to promulgate rules which will require the procurement of a license badge by such persons as are servants within the University, and to arrest or prosecute those who have no business in the neighborhood."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "Todd, P. H. Bailey, <mark>W</mark>. A. <mark>Jones</mark>, <mark>J</mark>. S. Graves, John B."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "Todd, P. H. Bailey, <mark>W</mark>. A. <mark>Jones</mark>, <mark>J</mark>. S. Graves, John B."}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1987.68, 476.6, 2134.79, 834.8], "bbox_id": "14b1788d3b", "file": "AppomattoxNewspapers_1962-1965a_0591.pdf", "page": 1, "text": "At the top of the stamp ap pears Civil War Centennial in black, and beneath this is Ap pomattox in white. Both are in modified barnum, as are the dates  1865-1965, in black, which appear v e r t i c a l left. United States Postage  in white sans serif capitals is at the base of the stamp and the denomination 5c is lower right. Of the five stamps in the Civil War centennial series, this is the sole vertical design. It was mo deled at the Bureau of Engrav ing and Printing by Robert J. Jones. Arthur W. Dintaman en graved the vignette and letter ing and numerals are by George A. Payne. One hundred fifteen million will be printed on the Giori press in black and blue- Collectors desiring first day cancellations may send address ed envelopes, together with re mittance to cover the cost of the stamps to be affixed, to the Postmaster, Appomattox, Virgin ia, 24522. Postage stamps and personal checks will not be ac cepted in payment of the new issue. The envelope to the Post master should be endorsed First Orders for covers must not in clude requests for uncanceled stamps. Requests must be post marked not later than April 9, 1965."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W"], "snippet": "and Printing by Robert <mark>J</mark>. <mark>Jones</mark>. Arthur <mark>W</mark>. Dintaman en graved the"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W"], "snippet": "and Printing by Robert <mark>J</mark>. <mark>Jones</mark>. Arthur <mark>W</mark>. Dintaman en graved the"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [774.68, 248.33, 930.2, 814.61], "bbox_id": "b7b893a482", "file": "AppomattoxNewspapers_1971-1973a_0126.pdf", "page": 1, "text": "at 3 p.m. The Rev. and Mrs. C. 0 . Cooke and Mr. and Mrs. Peter Flood, of Baltimore, were the house guest of Mr. and Mrs. Howard Stevens last week while attending the funeral hereof the late Deacon Mace Lewis. The Rev. and Mrs. R. Q. Law ing, Jr. motored to Graham,N. C. last Sunday. Rev. Lawing was the guest speaker for the ann ual Mens Day of the First Bap tist Church. They were th e i house guest of Deacon and Mrs, C. T. Packenham. Mr. John Lewis of Baltimore, is spending some time here as the guest of his sister and fami- 1 ly, Mrs. Berenice Lawing. A l a r g e crowd attended a ! s p e c i a l appreciation service j last Saturday evening at 7 p.m. I at the Mount A i r y Baptist   Church in honor of the Rev. H. j W. Pryor. The service was pre- I sented by the deacons, trustees j and m e m b e r s of his t h r e e ! churches Mount Airy, Union j Hill, of Buckingham and the Scott Zion Baptist Church of  Madison Heights , Va., Deacon Percy Johnson served as mas ter of ceremony. Special ser- monnetts were delivered by the j Reverends J. W. Paige, W. R. j Jones and James Miller. Beau- tiful music was rendered by the combined choirs of the three churches. After the offering period, deacon Christian of the I Scott Zion Church presented to Rev. and Mrs. Pryor on behalf of the three churches the keys to a 1972 LaSabe Buick. Rev. and M rs. Pryor gave heart warm ing words of thanks and apprec iation to all of the members and friends who made the gift pos sible. Rev. Pryor in his own way pledge his continued loyality and devotion. Remarks were given by the following ministers Re v e r e n d s Paul J o n e s , J.D"}, "highlight": {"text": {"matched_tokens": ["W", "j", "Jones"], "snippet": "Reverends J. W. Paige, <mark>W</mark>. R. <mark>j</mark> <mark>Jones</mark> and James Miller. Beau-"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "j", "Jones"], "snippet": "Reverends J. W. Paige, <mark>W</mark>. R. <mark>j</mark> <mark>Jones</mark> and James Miller. Beau-"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1131.6, 1666.05, 1448.85, 1751.01], "bbox_id": "1320a5b2fa", "file": "AppomattoxNewspapers_1947-1949a_0429.pdf", "page": 1, "text": ". OFFICERS J t xi n ...  Owaa, President  T. Noel!, Jr., Visa President I w w J. L. Jones, Vice Preetdeet u n  wHorton- Assistant Cashier J- L. Nicholas, Cashier t d Morrett,Assistant Cashier T. R. Hawes, Assistant Cashier CAPITAL 1,000,000 .mb. Ector.. BjAvn, P .d , D  , Con,"}, "highlight": {"text": {"matched_tokens": ["w", "J", "Jones"], "snippet": "Visa President I w <mark>w</mark> <mark>J</mark>. L. <mark>Jones</mark>, Vice Preetdeet u n"}}, "highlights": [{"field": "text", "matched_tokens": ["w", "J", "Jones"], "snippet": "Visa President I w <mark>w</mark> <mark>J</mark>. L. <mark>Jones</mark>, Vice Preetdeet u n"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [245.31, 714.63, 646.1, 731.28], "bbox_id": "7b96f8b7fb", "file": "AppomattoxNewspapers_1892-1898a_0415.pdf", "page": 1, "text": ". . , , .... , At 12 oclock Judge Christian ad-j Vctcmns, pl- ts devoid of P onies urued h.s coMrfc .u onhr that the Jones, Major J. W. blood, J. I"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W", "J"], "snippet": ". . , , .... , At 12 oclock Judge Christian ad-j Vctcmns, pl- ts devoid of P onies urued h.s coMrfc .u onhr that the <mark>Jones</mark>, Major <mark>J</mark>. <mark>W</mark>. blood, <mark>J</mark>. I"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W", "J"], "snippet": ". . , , .... , At 12 oclock Judge Christian ad-j Vctcmns, pl- ts devoid of P onies urued h.s coMrfc .u onhr that the <mark>Jones</mark>, Major <mark>J</mark>. <mark>W</mark>. blood, <mark>J</mark>. I"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2166.0, 281.26, 2310.58, 309.46], "bbox_id": "ccbb510838", "file": "AppomattoxNewspapers_1962-1965a_0592.pdf", "page": 1, "text": "WANTED TO BUY CORN. Clar-1 encs W. Jones. Phone 352-5059 j After 4 p.m. 12-10-tf j"}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "j", "j"], "snippet": "WANTED TO BUY CORN. Clar-1 encs <mark>W</mark>. <mark>Jones</mark>. Phone 352-5059 <mark>j</mark> After 4 p.m. 12-10-tf <mark>j</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "j", "j"], "snippet": "WANTED TO BUY CORN. Clar-1 encs <mark>W</mark>. <mark>Jones</mark>. Phone 352-5059 <mark>j</mark> After 4 p.m. 12-10-tf <mark>j</mark>"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1415.08, 1244.16, 1599.63, 1652.38], "bbox_id": "7e7d480bd1", "file": "AppomattoxNewspapers_1908-1909a_0253.pdf", "page": 1, "text": "v e t e r a n visrtsA Pn H i !  i POMATT J. A., Porterj of Winchester, Temi., who Was here at? the surrender 65 years ago is Im e visiting friends-and scèneAin Appomattox where he. with olAeirs tpok part in the sur render, Mr. Porter wasjfmthe w éntire war with the exception of one day and only a few of his company, all of whom vere  from this county, now survive His company was company 44 v i t    triyRnt w  in p qP th o se  ..whosurrive no are ajor -   a h s 7 f i o  e r t  C S i d w   l J  Grand Jones, and -Milton Is- - bell The company WiAln the  famous Pickétts liviaion. Mr. Porter is ja brother of the late B. DUvall porter, au thor and editor, and fie is the only surviving member of his I P i family Since the, war, he has J beén an engineer on A railroad in Tennesseé for 45 years, but is now retired.  His captain in ! -the army was Capf. W. Ei Rob- ertson, and later Capt. Sam L. Overtoh all of this county.  He I is visiting at the  home of his cousin, W. F. Abbott ahd-Mrs. W. A. Owen near, this place. Mr. Porter is 89 yeare Old, but still active and erect. He w ill return to his home to Ten nessee in a few weeks. COT Lynchburg News."}, "highlight": {"text": {"matched_tokens": ["w", "J", "Jones"], "snippet": "C S i d <mark>w</mark>   l <mark>J</mark>  Grand <mark>Jones</mark>, and -Milton Is- - bell"}}, "highlights": [{"field": "text", "matched_tokens": ["w", "J", "Jones"], "snippet": "C S i d <mark>w</mark>   l <mark>J</mark>  Grand <mark>Jones</mark>, and -Milton Is- - bell"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1293.11, 826.08, 1421.41, 925.13], "bbox_id": "c7d1656e55", "file": "AppomattoxNewspapers_1892-1898a_0165.pdf", "page": 1, "text": "Thos. Harvey, of Spring land Mrs. Addie B. Plunkett, ksouri spent yesterday with j. W. Hunter. Anna Jones, of this county, ednesday for Roanoke, where meets to spend the next two with her brother."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Jones"], "snippet": "ksouri spent yesterday with <mark>j</mark>. <mark>W</mark>. Hunter. Anna <mark>Jones</mark>, of this county, ednesday"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Jones"], "snippet": "ksouri spent yesterday with <mark>j</mark>. <mark>W</mark>. Hunter. Anna <mark>Jones</mark>, of this county, ednesday"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1580.92, 197.31, 2398.21, 367.65], "bbox_id": "512eedafd8", "file": "AppomattoxNewspapers_1971-1973a_0123.pdf", "page": 1, "text": "Thetis Carr  It is a good thing to give thanks unto the Lord, and to sing praise unto toy name. Psalm 921 The public is invited to attend our special Thanksgiving pro gram Thursday tonight at 730 p.m. Rev. R. Q. Lawing will be our guest speaker. Dont forget regular preach ing services Sunday morning at 11  00 .  Sunday night, Rev. C. L. El liott, Rev. W.R. Jones, and Rev. J. W. Paige will preach in a three-way sermon and the Mt."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "El liott, Rev. W.R. <mark>Jones</mark>, and Rev. <mark>J</mark>. <mark>W</mark>. Paige will preach in"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "El liott, Rev. W.R. <mark>Jones</mark>, and Rev. <mark>J</mark>. <mark>W</mark>. Paige will preach in"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [532.78, 834.73, 693.43, 1162.03], "bbox_id": "6fd954fcc0", "file": "AppomattoxNewspapers_1898-1902a_0265.pdf", "page": 1, "text": "There will be a grand tourna ment at Appomattox Depot Nov. 17th, 1899. Tilting to commence promptly at 1oclock, p. in. Ball at Hotel Atwood at night. The charge to the Knights will be de livered by Hon. H. D. Flood. The coronation address by Col. R. B. Berkley, of Farmville, Va. This bids fair to be a most enjoyable oc casion. Ali are invited to the tour nament. Special tickets will be sent for the ball. Good music will be in attendance. Come and see the rid ing and enjoy the evening. The following Knights have entered George Purdum, A. W. Jones, H. W. McKinney, J. B. Taylor, W. D. Mason, J. R. Horsley, Jas. B. Abbitt, E. P. Sears. L. B. LeGrande. Dan Browning, J. H. Payne, R. N. Daw son, J. Hunter Abbitt, J. D. Mc- Dearmon, Joseph OBrien, and R. C. Harvey. Other Kuights will enter this week and the Committee respectfully urges them to send in their names."}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J", "W"], "snippet": "George Purdum, A. W. <mark>Jones</mark>, H. <mark>W</mark>. McKinney, <mark>J</mark>. B. Taylor, <mark>W</mark>. D."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J", "W"], "snippet": "George Purdum, A. W. <mark>Jones</mark>, H. <mark>W</mark>. McKinney, <mark>J</mark>. B. Taylor, <mark>W</mark>. D."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.44, 781.06, 1792.91, 849.9], "bbox_id": "50542edb63", "file": "AppomattoxNewspapers_1952-1954a_0250.pdf", "page": 1, "text": "The Rev. H. Frederick Jones, of Greenville, N. C. is spending this week in the home of Mr. and Mrs. W. J. LeGrand. Rev. Jones will preach morning and evening Sunday at Liberty Baptist Church. He is a former pastor of Liberty Church."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "of Mr. and Mrs. <mark>W</mark>. <mark>J</mark>. LeGrand. Rev. <mark>Jones</mark> will preach morning and"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "of Mr. and Mrs. <mark>W</mark>. <mark>J</mark>. LeGrand. Rev. <mark>Jones</mark> will preach morning and"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.04, 1127.95, 1417.79, 1733.13], "bbox_id": "d7d44bcefa", "file": "AppomattoxNewspapers_1952-1954a_0578.pdf", "page": 1, "text": "The object of this title of a certain tract d taining eighty acres and being a portion tract known as The M and being on Bent Cm! wall Magisterial District, tox County, Virginia, ffl! ed and established Court may declare and all persons claiming said land under or B. Jones, deceased, w all right and interest ia land. An affidavit having beeei filed that Mrs. W. S. Jones Hughes, Michael aid Jones, Mrs. Donald vin Jones, Mrs. Marvin iam K. Jones, Mrs. W Jane Jones Hufford, J Paul Jones, Mrs. Paul Jones Walsh and Jam not residents of this S Bill stating that then J be heirs, devisees or  ors in title of Frank B. ceased, whose names  and making them part 1 by the general descrip ties unknown and 8  been made and filed t. unknown, such unknon ing all persons other named in the Bill, be heirs, devisees and ors in title of Frank  ceased. It is ordered that resident defendants, W. S. Jones, Ruth n Michael Hughes, Don Donald Jones, Mart Marvin Jones, WiH 11 Mrs. William K. Jo Hufford, James H u Mrs. Paul Jones, Gra and James Walsh and sons made defendant eral description of  known, do apper days after due P  order and do to protect their   It is further order foregoing portion o published once a cessive weeks W t ginian, a newspaper P pomattox, Virginia-"}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J", "Jones"], "snippet": "iam K. Jones, Mrs. <mark>W</mark> Jane <mark>Jones</mark> Hufford, <mark>J</mark> Paul <mark>Jones</mark>, Mrs. Paul"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J", "Jones"], "snippet": "iam K. Jones, Mrs. <mark>W</mark> Jane <mark>Jones</mark> Hufford, <mark>J</mark> Paul <mark>Jones</mark>, Mrs. Paul"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2453.69, 490.84, 2602.08, 660.19], "bbox_id": "d58b579024", "file": "AppomattoxNewspapers_1962-1965a_0055.pdf", "page": 1, "text": "the new club are L. C. Reynold forest warden and farm er of this county, Dan Moody, Asst Coun ty Aget, E . W. Jones and D. J. Franklin, both pulpwood grow ers, John L. Harrison, soil con servationist of Appomattox and Campbell counties, H. P. Evans, county supervisor for the Farm  ers Home Administration, New ton Jennings, ASCS office m ana ger, D. M. Wood, E. D. Jones, Paul Mlayfoerry, W. D. M ayberry, plus Thacker Cheatham, Sammie Scott, Thomas Lucado, and Cecil Dean of the FFA, and Jim m y M artin of the Oakville 4-H Club."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "Coun ty Aget, E . <mark>W</mark>. <mark>Jones</mark> and D. <mark>J</mark>. Franklin, both pulpwood grow"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "Coun ty Aget, E . <mark>W</mark>. <mark>Jones</mark> and D. <mark>J</mark>. Franklin, both pulpwood grow"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1770.01, 416.51, 1936.48, 709.55], "bbox_id": "25c662cc14", "file": "AppomattoxNewspapers_1908-1909a_0256.pdf", "page": 1, "text": "The following enjoyed a mtoPtog trip on the James ver near Gladstone last veek  Mrs. A. R. Harwood, Mm. Betemon, of New York, Kxeorge Langren, Roland, Law- 1 Mn Jr., Hamlet PVanklin, of Pampfin, Misses Alice and Eleanor Harwood, Jeane Mar- junt, of Haleys, Ya., and Virginia Carroll, of Baltimore, jnd Messrs Kenneth Saum, of  Strawsburg, and H a m l e t Frankfin, of Pampfin, and Tom Dinges, of Strawsburg. Members of the Jones fam- ly mét at the hOmerof Mr. A. W, . Jonés, Spout Spring, Va., ast Sunday to celebrate the innual event of the family re union. All the sistera and orethersá Mbs. Kate Waltan Mrs. R. H. Bates, Mrs. M. C. Jaldwell, Miss Ella Jones and Mr. A. W. Jones and their J amifiillr, were present. All pent án enjoyable day."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "Jones and Mr. A. <mark>W</mark>. <mark>Jones</mark> and their <mark>J</mark> amifiillr, were present. All"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "Jones and Mr. A. <mark>W</mark>. <mark>Jones</mark> and their <mark>J</mark> amifiillr, were present. All"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1081.88, 308.17, 1253.83, 526.72], "bbox_id": "cfeb283ee4", "file": "AppomattoxNewspapers_1955-1957a_0188.pdf", "page": 1, "text": "The bed spread program that was to have been held at the Stonewall Rosenwald School April 27 will be held Saturday, night, May 26, at the Spout Spring school. It is sponsored by the Community Health Clulb. A very large crowd attended the fifth annual Mens program of the Galilee Baptist Church last Sunday evening at 8 oclock. The following program was carried out in a very fine manner opening hymn, devo- tionals, Leon A. Lowing welcome pddress, Craig Watson response and greetings, Wiliam Hancock a read ing, George Beasley musk. The Gospel Six, of Lynchburg a selec tion, the New Farmers of America greetings, Johnnie Paige solo, Wal ter Jones Jr. greetings, Winston Jones solo, deacon J. W. King re marks, Dr. Franklin Jones solo,"}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "Jones Jr. greetings, Winston <mark>Jones</mark> solo, deacon <mark>J</mark>. <mark>W</mark>. King re marks, Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "Jones Jr. greetings, Winston <mark>Jones</mark> solo, deacon <mark>J</mark>. <mark>W</mark>. King re marks, Dr."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [591.58, 267.43, 738.35, 983.96], "bbox_id": "5bf0c33ba4", "file": "AppomattoxNewspapers_1962-1965a_0539.pdf", "page": 1, "text": "The annual meeting of tjie l East and West Bound Sunday School Union will convene with the Zion Baptist Church Sunday School at 10 a.m. this fifth Sun day. The pastor, Rev. H. J. Hendericks, will deliver the spe cial sermon. Special music will be rendered by the Home Choir. The youth program will be made up of talent from the different schools. The public is invited to attend. Impressive services were held at the Promise Land Baptist Church last Fourth Sunday at the regular 1130 a.m. service. The pastor delivered an inspir ing message from the subject Why We Should be Thankful. All present enjoyed the mess age. The Senior Choir rendered special music. Several visitors attended the service. The special offering for Hayes Day was lift ed at the close of the morning worship. An appreciative crowd attend ed the Three Way sermon at the Morning Star Baptist Church at Evergreen last Sunay evening at 3 p.m. The Rev. R. Q. Lawing served as m aster of ceremony. The following ministers took a part in the service Reverend J. W. Paige, Winston Jones and C. L. Elliott, The music was rend ered by the New Hope Baptist Church Choir of Campbell. The offering was lifted by Deacons Booker Martin and Mr. Wheaton of the New Hope Baptist Church. Mr. Earnest Abbott gave words of welcome an appreciation. The service was sponsored by the Morning Star Baptist Church Sunday School. Members and friends of the Cornerstone Baptist Su n d a y School Union are asked to meet at the Promise Land Baptist Churchat 10 a.m. in its regular meeting. An appreciation service has been planned for the Rev. R. Q. Lawing, pastor of the Galilee Church for the third Sunday aft ernoon in December at 3 p.m. The special committee is headed by Miss H. B. Stephens. Mem bers and friends of local church es are cordially invited to at tend. The Rev. Emmette Palm er and his Cross Road Baptist Church choir will render special services at the Galilee Baptist Church on the first Sunday eve ning in December at 3 p.m. This program is being rendered by the Galilee Church Choir. The Mordenistic Club will be t h e"}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "in the service Reverend <mark>J</mark>. <mark>W</mark>. Paige, Winston <mark>Jones</mark> and C. L. Elliott,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "in the service Reverend <mark>J</mark>. <mark>W</mark>. Paige, Winston <mark>Jones</mark> and C. L. Elliott,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [598.09, 860.12, 907.65, 1138.52], "bbox_id": "02ec7391ff", "file": "AppomattoxNewspapers_1918-1922a_0356.pdf", "page": 1, "text": "T. S. McNalleySy. as F o re m an .... ........................ . ................................ 421.50 L. T. MorrisWork on Roads......................................................... .. . . ......... 11.00 Jno. J. FarrarWork on Roads ..................................... .. ........... . ................. 14.75 I. H. WillDragging Road............................ ......................... .. ....................... 4.75 Buck DossLabor ............................ . ...................................... .. ....................... 29.26 Buck WellsLabor ............................ . ............................. ................... ........... 60.74 Mrs. T. S. McNallyCooking for Rd. free.................................... . ............... 21.00 J. J. JenningsDragging Road ........ ! . . . . ......................... . ......................... 46.20 W. S. GobbleRepairing Saddle .................. . ........................... ..................... 2.00 Appox. GarageRoad Dltcber....................................................... . . ............. 89.00 Gaiion Iron Works  Mfg. Co.Rd. Mch. and Supplies .......................... 356.18 Buck GodseyLabor ............................ . ................... . ....................... ........... . 18.00 Wm. GarrettLabor .............................. .. . ................................. . ................... 109.12 T. S. McNallyIncidental Expenses........................................................... 23.66 W. H. LigonHalf Expenses to Purchase M ules. . . ......... . ....................... 4.041 Ernest FergusonLabor ................................................................. .. 6.40 Hall BryantLabor ....................................................... .. ................................. 108.00 Charlie HornLabor ............................................................................ Edner MannLabor ................................................. . ............. . Jim HillCooking ........................................... . ................................... .. Fred IsbellL a b o r........................................................................................ Bill TurnerLabor ............................................. . ..................... . ......... . C. A. FlowersBlacksmith W o rk ..., ............................................... . .. W. E. DickersonFencing Wire and Staples ......................................... Sam Mayberry  BoysLabor................................................................... J. F. JenningsDragging R o ad s.............................................................. J. W. Cawthon. Jr., H ay............................ .. ............. ......... . ......... . ............. T. W. OdorWork on Road ........................................................................ Fred DooleyL a b o r........................................................... ............. . . . . a . G. W. WatsonBlacksmith Acct ............. ..................... . ......................... W. E. Jones and J. R. RoeLumber ......................................................... R. S. WheelerL u m b e r ....,.,... ............ ................................. .. ............. Evergreen Supply Co.F e e d ..... ............................................................. J. A. Sears, AgentFreight ............................................... . ......................."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "G. W. WatsonBlacksmith Acct ............. ..................... . ......................... <mark>W</mark>. E. <mark>Jones</mark> and <mark>J</mark>. R. RoeLumber ......................................................... R. S."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "G. W. WatsonBlacksmith Acct ............. ..................... . ......................... <mark>W</mark>. E. <mark>Jones</mark> and <mark>J</mark>. R. RoeLumber ......................................................... R. S."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1284.93, 1702.75, 1587.67, 1787.7], "bbox_id": "54f3694150", "file": "AppomattoxNewspapers_1912-1915a_0173.pdf", "page": 1, "text": "P. Anderson, poetoffloe An I Johnaon J  p  Dickerson, Chas Godsey, N. H. Gregory, Ü. O. Fer F- Anderson, postoffloe An L     11 IT district , cf-?ood- postoffloe winyin. j guson, Joel Fore, J. C. Jones, J. F,  Dicker!, W. A. Oar best wishes Ljifeo 1 Peao-P. r. Giovar p o e t-.rr o-A ,  , I Hampum. A.C. Horsley, postoffloe 1 7 go with the veterans for a pleasant . IW IU ft MAC VC HCl AJO i v i and a safe retara."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "Joel Fore, J. C. <mark>Jones</mark>, <mark>J</mark>. F,  Dicker!, <mark>W</mark>. A. Oar best wishes"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "Joel Fore, J. C. <mark>Jones</mark>, <mark>J</mark>. F,  Dicker!, <mark>W</mark>. A. Oar best wishes"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1225.93, 1668.5, 1470.81, 1741.09], "bbox_id": "e1cce3c7dc", "file": "AppomattoxNewspapers_1947-1949a_0495.pdf", "page": 1, "text": "OFFICERS J. D. Owen, President J. T. Noell, Jr.. Vice President L. W. Horton,  J. L. Jones, Vice President S. D. M o rriss e tM J J. L. Nicholas, Cashier T. R. Hawes, AR CAPITAL 1.000,000"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "Jr.. Vice President L. <mark>W</mark>. Horton,  <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "Jr.. Vice President L. <mark>W</mark>. Horton,  <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1277.33, 1660.8, 1513.98, 1733.8], "bbox_id": "cf7d5824a6", "file": "AppomattoxNewspapers_1947-1949a_0277.pdf", "page": 1, "text": "OFFICERS J. D. Owen, President J. T. Noell, Jr., Vice President 1.. W. Horton, J. L. Jones, Vice President S. D. Morrissett J. L. Nicholas, Cashier T. R. Hawes, Ai CAPITAL 1,000,000"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "Jr., Vice President 1.. <mark>W</mark>. Horton, <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "Jr., Vice President 1.. <mark>W</mark>. Horton, <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1053.84, 1191.42, 1332.16, 1311.61], "bbox_id": "535084a20f", "file": "AppomattoxNewspapers_1939-1943a_0411.pdf", "page": 1, "text": "OFFICERS E. P. M iller ..................... J. T. Noell, Jr. ......... J. D. O w en ........... . J. L. Jones . . . . . J. L. Nicholas L. W. Horton RESOURCES NEARLY TE N MILLION DOLLA r T  Member Federal Reservo System Federal Deposit Inswsaco Corporation THE OLD BIG STRONG BANK"}, "highlight": {"text": {"matched_tokens": ["w", "J", "Jones", "J"], "snippet": "Jr. ......... J. D. O <mark>w</mark> en ........... . <mark>J</mark>. L. <mark>Jones</mark> . . . . . <mark>J</mark>. L. Nicholas L."}}, "highlights": [{"field": "text", "matched_tokens": ["w", "J", "Jones", "J"], "snippet": "Jr. ......... J. D. O <mark>w</mark> en ........... . <mark>J</mark>. L. <mark>Jones</mark> . . . . . <mark>J</mark>. L. Nicholas L."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1253.0, 1696.33, 1488.94, 1749.88], "bbox_id": "ad5047d8d1", "file": "AppomattoxNewspapers_1947-1949a_0302.pdf", "page": 1, "text": "OFFICERS _ _ J D. Owen, President J . T. Noell, Jr., Vice President L. W. Horton, J. L. Jones, Vice President S. D. Morrissett, J . L. Nicholas, Cashier x. R. Hawes, As"}, "highlight": {"text": {"matched_tokens": ["J", "J", "W", "J", "Jones", "J"], "snippet": "OFFICERS _ _ <mark>J</mark> D. Owen, President <mark>J</mark> . T. Noell, Jr., Vice President L. <mark>W</mark>. Horton, <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D. Morrissett, <mark>J</mark> . L. Nicholas, Cashier x. R. Hawes, As"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "W", "J", "Jones", "J"], "snippet": "OFFICERS _ _ <mark>J</mark> D. Owen, President <mark>J</mark> . T. Noell, Jr., Vice President L. <mark>W</mark>. Horton, <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D. Morrissett, <mark>J</mark> . L. Nicholas, Cashier x. R. Hawes, As"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [779.5, 1259.57, 935.74, 1521.23], "bbox_id": "e8e11165c7", "file": "AppomattoxNewspapers_1902-1905a_0273.pdf", "page": 1, "text": "Of Valuable Property a t Ap pom attox C. H., Va. By virtue of authority given us by reaolu tton passed by the stockholders of the Far mers Exchange of Appomattox, iD their reg ular auDual meeting at Appomattox C. H. Va., Feb. 8th, 19U4, we the undersigned Board of Directors of said Farmers Ex change will offer for sale, at public auction, on the front porch of the store house, on the premises of said Farmers Exchange, at 3 oclock, p. m., ON SATURDAY, APRIL 2nd, 1904, that desirable lot situated at the Railway Grossing, between the depot and the mill, in the village of Appomattox C. H., Va. This lot contains one half acre, ts beauti fully and conveniently situated for the con duct of most any kind of business, and has on it a splendid, large two story store bouse, agood guano house and a storage house, TERMS OF SALE  One third cash on day of sale, the residue in two equal install ments, to be cvideuoed by two bonds of pur chase, with approved security, payable six and twelve months, respectively, from day of sale, with interest thereon from date. Possession given on May1st. JOEL T. CAWTHOBN, M. L. COVINGTON, J. F. PURDCM, THOS. HARVEY, F. B. JONES, Directors. By W. J. TRENT, Secy."}, "highlight": {"text": {"matched_tokens": ["JONES", "W", "J"], "snippet": "THOS. HARVEY, F. B. <mark>JONES</mark>, Directors. By <mark>W</mark>. <mark>J</mark>. TRENT, Secy."}}, "highlights": [{"field": "text", "matched_tokens": ["JONES", "W", "J"], "snippet": "THOS. HARVEY, F. B. <mark>JONES</mark>, Directors. By <mark>W</mark>. <mark>J</mark>. TRENT, Secy."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1788.49, 418.36, 1952.09, 1738.99], "bbox_id": "4a33cdbf1c", "file": "AppomattoxNewspapers_1892-1898a_0098.pdf", "page": 1, "text": "of Appomattox county, and Miss Annie L. Plunkett, the lovely and accomplished daughter of the late Willis A. Plunkett, for many years the highly esteemed Sheriff of this county. The church was artistically decor ated, thé altar lined with beautiful flowers and brilliantly illuminated with colored lights. Immediately in frontof the chancel was an arch of flowers, from the centre of which was suspended a floral design in the shape of a horseshoe with the inscription! Good tu c k . It was under this the young couple stood to plight their troth, the Gne to the other. At the appointed time the bridal party entered the church in the fol lowing order  First came the ushers, Mr. Hunter Smith and Mr. Walter Cheatham, down the right and left isles respect ively. Then came the bridesmaids and groomsmen  Miss Elma Shearer with Dr. J. H. Abbitt Miss Susie Jones with Mr. W. J. Trent. . - ,  , -, -. Miss Daisy Lawson, of Bróoknéal, with Mr. Charlie Hunter. Miss Florine H u n t,, of Prince Edward, with Mr. Joseph Button.  Miss Sallie Rica with , Mr. John Overton. MisS Annie Abbitt with Mr. R. W. Stratton. Miss Jessie Cheatham with Mr. Hicks Rice. Miss Vashti Reynolds, of Brook- neal withMr. Hunter Tones. Mr. Robert Harvey immediately preceded the bride and Miss Hattie Plunke the groom. The bride, witlfher sister,Miss Minnie Plunkett, as maid of honor, came down the left isle, and the groom, with his best man, Mr. L. H. Gilliam, came down the right, and met under the arch, where they were declared man and wife in a solemn and impressive man ner by the Rev. Mr. Royall, of the Baptist Church. The arrangement of the bridal party abont the altar, the mellow lights and profuse decorations creat ed a scene of beauty rarely witnessed. The Bride was becomingly attired in a white surah silk, en train, a tulle veil caught up by a diamond brooch. A bouquet of Maréchal Neil roses, tied with white satin ribbon, was carried in her hand. The bridesmaids were air attired in white silk, wifh natural flowers, the gfoomsmen in conventional black. After the ceremony was over ,the bridal pgrty, together with other in vited guests, repaired to the residence of Mrs. D. P. Robertson, mother of the groom, where a reception was tendered them. There was also present the bridal party of Mr. Robert G. Robertson, another son who had been married that morning in Amherst county. After a season of merry-making among the yonng folks, and on the part of the older ones, indulging in reminiscences of similar scenes in which they were the central figures, the assembled party was invited into supper. And such a supper ! A long table, a d o r n e d with flowers, in the centre of which was a large floral pyramid. It was laden with the choicest viands, and beg gars description. . Suffice it to say that it was an old-time Virginia spread,! which the guests did ample justice. It was not until the wee s ma hours that the guests departed, wishing the newly wedded ones, long and happy lives. Besides the two bridal parties there were present, Shearer, Katie Thomas, Annie Col lins, Mary Evans, Mrs. Rufus Bates, Mrs. C. Inge, Mrs. Dan Evans, Mrs. John Hanter, Dr. and Mrs. D. Mott Robertson, Mr. and Mrs. C. T. Plunkett, of Lynchburg, Mr. and Mrs. W. C. Nowlin, Mr. and Mrs. Geo. Hunt, of Prince Edward, Mr. and Mrs. F. W. M cKinnney, Mr. and Mrs. Daniel McK inney, Mr. and Mrs. 3D. R. Abbitt, Mr. A. Plunkett, of Lynchburg, Mr. H. C. Shearer, j Mr. Walton McKinney, and a host of others."}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J"], "snippet": "H. Abbitt Miss Susie <mark>Jones</mark> with Mr. <mark>W</mark>. <mark>J</mark>. Trent. . - ,  , -, -. Miss Daisy Lawson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J"], "snippet": "H. Abbitt Miss Susie <mark>Jones</mark> with Mr. <mark>W</mark>. <mark>J</mark>. Trent. . - ,  , -, -. Miss Daisy Lawson,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1172.36, 387.5, 1463.03, 430.6], "bbox_id": "be35387a51", "file": "AppomattoxNewspapers_1943-1947a_0546.pdf", "page": 1, "text": "O F F IC E R S J. D. Owen, President J. T. Noell, Jr., Vice President L. W. Ilurton J. L. Jones, Vice President S. D. Morri at Catti"}, "highlight": {"text": {"matched_tokens": ["J", "J", "W", "J", "Jones"], "snippet": "O F F IC E R S <mark>J</mark>. D. Owen, President <mark>J</mark>. T. Noell, Jr., Vice President L. <mark>W</mark>. Ilurton <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D. Morri at Catti"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "W", "J", "Jones"], "snippet": "O F F IC E R S <mark>J</mark>. D. Owen, President <mark>J</mark>. T. Noell, Jr., Vice President L. <mark>W</mark>. Ilurton <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D. Morri at Catti"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1673.49, 847.83, 1995.25, 1069.4], "bbox_id": "47706e0f0b", "file": "AppomattoxNewspapers_1926-1933a_0506.pdf", "page": 1, "text": "Nine seniors are expected to fin-    2.000 ouM have been ra als to be held next Tuesday quired for the project. Appo- niffht Mav 10 Principal John mattox is one of the few towns Soee yeaterdw announced its aiae in Virginia that can ?hrfonoto? list of prosper- boast of even- street m the i i town being hard-surfaced. It luve grad t  ! was felt that resurfacing of the Robert Jones, Charles Spen- strets now was needed, but cer, Susie Spencer, Julia councilman decided that the ne- I Florence Kyle, Fannie Snoddy, .gggary money had best be Gladys Ripley Grace Rosen and Sallie Jones. _ _____ o ---- - ------- - Dr. J. W. Cammack, PIesi  P a l i e r About dent of Averett College, D an -tieaas r a p o , .. g  ville, will deliver the com mencement adyess.  xa 15 a tios now in progress will de termine the class validictonan and salutarian."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "Grace Rosen and Sallie <mark>Jones</mark>. _ _____ o ---- - ------- - Dr. <mark>J</mark>. <mark>W</mark>. Cammack, PIesi  P a"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "Grace Rosen and Sallie <mark>Jones</mark>. _ _____ o ---- - ------- - Dr. <mark>J</mark>. <mark>W</mark>. Cammack, PIesi  P a"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [420.01, 789.69, 904.91, 810.48], "bbox_id": "2beb4bb2c0", "file": "AppomattoxNewspapers_1902-1905a_0150.pdf", "page": 1, "text": "N. Pamier Justices of the Peace-Lam ech Jones, W. A. Moses, J. T. j sue in the matter is not known  but Lee. Road Comnnssioner-S. J. Lee defeats J. C. Jones by 15 m ajority.! let that be as it may, the matter will"}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J", "j"], "snippet": "of the Peace-Lam ech <mark>Jones</mark>, <mark>W</mark>. A. Moses, <mark>J</mark>. T. <mark>j</mark> sue in"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J", "j"], "snippet": "of the Peace-Lam ech <mark>Jones</mark>, <mark>W</mark>. A. Moses, <mark>J</mark>. T. <mark>j</mark> sue in"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [626.39, 365.01, 787.64, 398.51], "bbox_id": "aec6a106d1", "file": "AppomattoxNewspapers_1898-1902a_0035.pdf", "page": 1, "text": "Messrs. J. M. Jones, Petersburg, j and W. R. McSmith, N. 0., are reg  istered at Hotel Appomattox."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "j", "W"], "snippet": "Messrs. <mark>J</mark>. M. <mark>Jones</mark>, Petersburg, <mark>j</mark> and <mark>W</mark>. R. McSmith, N. 0., are reg  istered at Hotel Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "j", "W"], "snippet": "Messrs. <mark>J</mark>. M. <mark>Jones</mark>, Petersburg, <mark>j</mark> and <mark>W</mark>. R. McSmith, N. 0., are reg  istered at Hotel Appomattox."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [348.68, 218.67, 513.1, 364.19], "bbox_id": "bc6d734f14", "file": "AppomattoxNewspapers_1922-1923a_0227.pdf", "page": 1, "text": "Marriage at Glenmore. j Mr. W. A. Jones announces the marriage of his daughter, Miss Lula Jackson Jones to M.. Luther Thornhill Agee, to take place Wed nesday, April 25th at 330 oclock, in Glenmore Methodist Episcopal church. Rev. W. P. Province will officiate. Miss Jones is a very at tractive young lady of Glenmore. and Mr. Agee is a popular young business man of Scottsville, Va."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Jones"], "snippet": "Marriage at Glenmore. <mark>j</mark> Mr. <mark>W</mark>. A. <mark>Jones</mark> announces the marriage of"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Jones"], "snippet": "Marriage at Glenmore. <mark>j</mark> Mr. <mark>W</mark>. A. <mark>Jones</mark> announces the marriage of"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [594.93, 361.71, 673.23, 593.0], "bbox_id": "e0b0b17e95", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "J R Atwood R W Hunter, G A Walton, T E Wooldridge, W W Martin, R O Harvey, W P Mann. L T Seay, J C Jones, II W McKinney. P It Wooldridge, A W Jones, Joel II Martin, John Cumby, W A Martin, Albert Davidson, W T Davidson, II W Davidson, J H Abitt, J W White, G W Williams, Nat Guill, W. A. Moses."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W"], "snippet": "Mann. L T Seay, <mark>J</mark> C <mark>Jones</mark>, II <mark>W</mark> McKinney. P It Wooldridge,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W"], "snippet": "Mann. L T Seay, <mark>J</mark> C <mark>Jones</mark>, II <mark>W</mark> McKinney. P It Wooldridge,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [378.29, 277.13, 526.56, 383.32], "bbox_id": "f65b71b3b4", "file": "AppomattoxNewspapers_1918-1922a_0447.pdf", "page": 1, "text": "J. O OBrien, 6 25 2 w Appomattox, Va jtteeoF D issolution The partnership heretofore lexaisting between W. E Jones laad J It Foe under the firm lium eof VV. E Jones  J. R Ipoe has been dissolved Ly mu tual consent. h 25 3w W. E. J ones ."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "partnership heretofore lexaisting between <mark>W</mark>. E <mark>Jones</mark> laad <mark>J</mark> It Foe under the"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "partnership heretofore lexaisting between <mark>W</mark>. E <mark>Jones</mark> laad <mark>J</mark> It Foe under the"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1258.32, 1675.09, 1339.86, 1733.14], "bbox_id": "121fd961ef", "file": "AppomattoxNewspapers_1943-1947a_0171.pdf", "page": 1, "text": "J. D. Owe . . . , J. T. Noell, Jr. J. L. Jones . . . J. L. Nicholas . . !.. W. Horton S. D. Morrisse u"}, "highlight": {"text": {"matched_tokens": ["J", "J", "J", "Jones", "J", "W"], "snippet": "<mark>J</mark>. D. Owe . . . , <mark>J</mark>. T. Noell, Jr. <mark>J</mark>. L. <mark>Jones</mark> . . . <mark>J</mark>. L. Nicholas . . !.. <mark>W</mark>. Horton S. D. Morrisse u"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "J", "Jones", "J", "W"], "snippet": "<mark>J</mark>. D. Owe . . . , <mark>J</mark>. T. Noell, Jr. <mark>J</mark>. L. <mark>Jones</mark> . . . <mark>J</mark>. L. Nicholas . . !.. <mark>W</mark>. Horton S. D. Morrisse u"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.49, 1439.83, 561.19, 1485.1], "bbox_id": "40cae9932d", "file": "AppomattoxNewspapers_1898-1902a_0043.pdf", "page": 1, "text": "ilette Clark, of Hat Creek l. W. Joues, of Red House guests of Mr. J. C. Jones c . W. Hunter Sunday and"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones", "W"], "snippet": "ilette Clark, of Hat Creek l. <mark>W</mark>. Joues, of Red House guests of Mr. <mark>J</mark>. C. <mark>Jones</mark> c . <mark>W</mark>. Hunter Sunday and"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones", "W"], "snippet": "ilette Clark, of Hat Creek l. <mark>W</mark>. Joues, of Red House guests of Mr. <mark>J</mark>. C. <mark>Jones</mark> c . <mark>W</mark>. Hunter Sunday and"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [426.49, 526.39, 908.32, 815.72], "bbox_id": "f4854657a5", "file": "AppomattoxNewspapers_1898-1902a_0033.pdf", "page": 1, "text": "I Urnw ioi uicio _ , , , . .. , , _ , ! Wilson, John Root, Miss Eleanor hud his entire crop of tobacco de- j . . .  Morgan. Robert Jeffrey. Miss Willie -troved, his oss supposed to be 500. f ,,  , f  , .,  Davis, R H Williams, C E Roberts, Many of onr farmers around this _ w ,,  , . , ,  T M Jones. J C Chambers, R B place have nice crops of tobacco. _  T   . __ _ ni unta! Hughes. R H Williams, Ellis E Mr. J. E. Pearson has some plants s  _ _ T ,, T . . . - .. , 77i Jones. Mrs E E Jones, Mrs McLane, which measure from tip to tip 77i , . . . . .. .  ixriUo. inches and 2  inch th . leaf. Mr. S ta rt Gilji,pie fa.   T  rt H B Hul.m e 11 acre, in tobacco which is estima-  4 d  hli r  0  , , , . . . . okaa lLo if a u Bremo W. E. Shaw, Buckingham  ted here will raise 2500 lbs. It is a .  .. . c . . Jessie Wood, H L Williams, wife and maguificient crop. We trust sin-  , . , v  daughter, J H Dnnevant, Enonville cerely our farmers may realize a _ _ .  . __  y ma A J Pierce. Geo. Pankey, Arvonia good price for their crops and mav .  , ,   - 1 s tv Tonb.ne Garland --- I. j j- ifaf0 mmp 1 N D Jenkins, Garland Wilkerson, The latter must be exhausted be- ! be eneonragtd o c  Farmville W E MaXey. Arvonia fore the land is delinquent or liable. I an ery year until onr whole  7- ITnder this decision, a purchaser connt7 shft11 be m a prosperous of delinquent land under tbe recent conlitin delinquent land act would not get a L Mr- E- W- Everett one of ihe !d good title where the owner of the est inhabitants of our town is m his land had personalty to pay the taxes 90th baeco all due, and fo. the non-payment 0f  some time since and he says the and was returned delin- ! cr0P8 are the finest we have had for many years."}, "highlight": {"text": {"matched_tokens": ["w", "Jones", "J"], "snippet": "onr farmers around this _ <mark>w</mark> ,,  , . , ,  T M <mark>Jones</mark>. <mark>J</mark> C Chambers, R B"}}, "highlights": [{"field": "text", "matched_tokens": ["w", "Jones", "J"], "snippet": "onr farmers around this _ <mark>w</mark> ,,  , . , ,  T M <mark>Jones</mark>. <mark>J</mark> C Chambers, R B"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.8, 921.16, 1773.0, 1513.65], "bbox_id": "17b08a1b71", "file": "AppomattoxNewspapers_1915-1918a_0153.pdf", "page": 1, "text": "heart. In her new nome Ham burg, Mrs Jones w as also J w orker in Ch .vyrhilb. no eouid ev8r be the same to her as old Liberty, yet this did not ete? her from faithfully enter ing the Masters work. B eautiful resolutions were passed by the H am burg Bap tisc C hurch in w hich her home and dhurch T fe were referred i,o as foliowes  They soon ee ablishecl a happy home, -vhere oved teigned. and Christ was aonored. God blessed the labor, ot their hanne but tbis did not i blind  hem to the world or t cl ime of the church, so h ea ly identified hetBelf w ith the B aptist C hurch and became onoroughly enjjated in ail it work. Active im Sunday school, helpful iniauBic and liberal in th e m issionary work of the church, she will be m iss ed every where, but especially in the W Omans Missionary Society of wuich she was for a long time president N ature endowed Miss L iian w ith a brillian m ind and rare alenta. These she enriched and m ade beautiful by conse cratin g them to tbe Masters use. She is gone but not for- got-en The sunshine of he soul, the rich heritage o hop , tbe fragrance of her lips, wil avei linger in the hesrts of thou who mourn her going. Bei isufferings are over, and he oody nowfreBts in Lio- rty Cemt tery.   Rev C W . McElroy conduct e l a rose com m ittal service ii presence of a large crowd o sorrow ing friends and love ones, and tbe handsom e flora offerings completely covere- the grave, while her body thu sleeps in peace we believe th at her soul has-gone to th a t fair land where there is no more sorrow, no more sickness, no more death, where all it on eternal day and where the oule of the redeemed live on while God and eternity lasts, and"}, "highlight": {"text": {"matched_tokens": ["Jones", "w", "J", "w"], "snippet": "nome Ham burg, Mrs <mark>Jones</mark> <mark>w</mark> as also <mark>J</mark> <mark>w</mark> orker in Ch"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "w", "J", "w"], "snippet": "nome Ham burg, Mrs <mark>Jones</mark> <mark>w</mark> as also <mark>J</mark> <mark>w</mark> orker in Ch"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2332.79, 1327.39, 2828.77, 1419.57], "bbox_id": "0bc34101f9", "file": "AppomattoxNewspapers_1926-1933a_0201.pdf", "page": 1, "text": "H- T. Nlcholn--.  l       i A t d . owbn .  m ,,  r. W ,n  lS  S S S  J. L- Jones.  . 1     -    W U Nicholas... . . . . . m  .AAlifttant C   m RESOURCES . . jm Eight Million Fbr Hundred Thoiuand Dollars THE OLD BIG- STRONb BANE"}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W"], "snippet": "lS  S S S  <mark>J</mark>. L- <mark>Jones</mark>.  . 1     -    <mark>W</mark> U Nicholas... . . . . . m  .AAlifttant"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W"], "snippet": "lS  S S S  <mark>J</mark>. L- <mark>Jones</mark>.  . 1     -    <mark>W</mark> U Nicholas... . . . . . m  .AAlifttant"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [349.21, 234.04, 512.76, 459.08], "bbox_id": "e00c9c5bd6", "file": "AppomattoxNewspapers_1902-1905a_0161.pdf", "page": 1, "text": "FOR DISTRICT OFFICERS. Southside District. SupervisorJno. H. Robertson. Hoad CommissionerS. J. Lee. ConstableR. 0. Mann. Justices of Qie PeaceLamech Jones, J. T. Lee, W. A. Moses. Stonewall District. SupervisorT. J. Stratton. Road OommissnerJ. C. Shearer. ConstableRichard Moss. Justices of the PeaceCharles F Button, N. W. Owen, J. D. Hamers ley. Clover-Hill District. SupervisorW. H. Ligon. Hoad CommissionerHenry R. ! Pitman. I ConstableE, P. Sears, j J ustices of Peace Joel T. Wat kins, P. H. Gilliam, W. A. Womack. Overseer of PoorA. E. Turnes."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "Justices of Qie PeaceLamech <mark>Jones</mark>, <mark>J</mark>. T. Lee, <mark>W</mark>. A. Moses. Stonewall District."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "Justices of Qie PeaceLamech <mark>Jones</mark>, <mark>J</mark>. T. Lee, <mark>W</mark>. A. Moses. Stonewall District."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2318.03, 474.21, 2473.18, 612.41], "bbox_id": "61fe7d78cd", "file": "AppomattoxNewspapers_1952-1954a_0243.pdf", "page": 1, "text": "Ethel Delores Harvey, April 2i5. Deborah Jean Phelps, April 18. Mrs. William Layne, Jr. April 25. Flora Mae Puckett, April 25. Mrs. Fred Grishaw, April 10. P. J. Jones, April 13. W. Frank Moore, April 26. Billy Moore, April 18. Mrs. Viola Mann, April 27. Mrs. Betty Nuckols, April 27. George Farrar, April 25. T. M. Ford, April 12."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W"], "snippet": "Grishaw, April 10. P. <mark>J</mark>. <mark>Jones</mark>, April 13. <mark>W</mark>. Frank Moore, April 26."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W"], "snippet": "Grishaw, April 10. P. <mark>J</mark>. <mark>Jones</mark>, April 13. <mark>W</mark>. Frank Moore, April 26."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [201.6, 1690.84, 291.7, 1754.35], "bbox_id": "44ff23d2df", "file": "AppomattoxNewspapers_1933-1936a_0107.pdf", "page": 1, "text": "E- P Miller.. O. B. B arker.. J. D. O w en.... . J. Lr Jones. .. J. L. Nicholas. L. W. Horton"}, "highlight": {"text": {"matched_tokens": ["J", "w", "J", "Jones", "J", "W"], "snippet": "E- P Miller.. O. B. B arker.. <mark>J</mark>. D. O <mark>w</mark> en.... . <mark>J</mark>. Lr <mark>Jones</mark>. .. <mark>J</mark>. L. Nicholas. L. <mark>W</mark>. Horton"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "w", "J", "Jones", "J", "W"], "snippet": "E- P Miller.. O. B. B arker.. <mark>J</mark>. D. O <mark>w</mark> en.... . <mark>J</mark>. Lr <mark>Jones</mark>. .. <mark>J</mark>. L. Nicholas. L. <mark>W</mark>. Horton"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1583.27, 1639.04, 1713.57, 1693.04], "bbox_id": "0724dc7a2a", "file": "AppomattoxNewspapers_1939-1943a_0219.pdf", "page": 1, "text": "E. P. Miller . . . . . J. T. Noon, Jr. ............ J. D. O w en ................ J. L. Jones . . . . . . . J. L. N toko las . L. W. Hoiton ."}, "highlight": {"text": {"matched_tokens": ["J", "J", "w", "J", "Jones", "J", "W"], "snippet": "E. P. Miller . . . . . <mark>J</mark>. T. Noon, Jr. ............ <mark>J</mark>. D. O <mark>w</mark> en ................ <mark>J</mark>. L. <mark>Jones</mark> . . . . . . . <mark>J</mark>. L. N toko las . L. <mark>W</mark>. Hoiton ."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "w", "J", "Jones", "J", "W"], "snippet": "E. P. Miller . . . . . <mark>J</mark>. T. Noon, Jr. ............ <mark>J</mark>. D. O <mark>w</mark> en ................ <mark>J</mark>. L. <mark>Jones</mark> . . . . . . . <mark>J</mark>. L. N toko las . L. <mark>W</mark>. Hoiton ."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1063.9, 1706.15, 1345.52, 1742.34], "bbox_id": "b11ca83416", "file": "AppomattoxNewspapers_1918-1922a_0070.pdf", "page": 1, "text": "E. P. M ILLER, President. ERNEST WILLIAMS, V.-President J . D. OWEN, Cashier. J. L. JONES, Asst. W"}, "highlight": {"text": {"matched_tokens": ["J", "J", "JONES", "W"], "snippet": "E. P. M ILLER, President. ERNEST WILLIAMS, V.-President <mark>J</mark> . D. OWEN, Cashier. <mark>J</mark>. L. <mark>JONES</mark>, Asst. <mark>W</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "J", "JONES", "W"], "snippet": "E. P. M ILLER, President. ERNEST WILLIAMS, V.-President <mark>J</mark> . D. OWEN, Cashier. <mark>J</mark>. L. <mark>JONES</mark>, Asst. <mark>W</mark>"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [499.44, 563.84, 732.95, 1158.95], "bbox_id": "3c1f42519d", "file": "AppomattoxNewspapers_1918-1922a_0232.pdf", "page": 1, "text": "Disbursements. W. A. MosesSy. as Clerk Old Rd. Bd.................................. L. E. SmithSy. as Chm. Clerk and Present Rd. Bd ........... J. O. OBrienSy. as Rd. Comr. and Agent Rd. Bd............. R. E. CaldwellWork on Road...................................... . Daniel JohnsonWorking Roads ....................................... .. . Edgar ChiltonL ab o r.................................... . ........................ D. B. ThomasLabor............................................................... Andy ColemanLabor ............................................................ J. R. PoeRepairing Bridge.................................................... W. L. FordLabor .................................................. . .............. J. h. DriskiNWork on Bridge............................................... R. F. JameraonWork on Road ............................................ Appox. Hdw. Co.Supplies...,............................................... Cbas. PattersonLabor .......................................................... C. W. SmithSy. as Clk. Rd. Bd............................................. L. F. FergusonStamped Envelopes ..................................... T. S. McNallyFeeding Mules, Etc ...................................... Ottle DavidsonCleaning Out-Pipe ....................................... T. B. Scruggs  Co.Mdse...................................................... H. M. BurgeFeed and Supplies............................................. J. J. ForeFeeding Males ........................................................ L. E. Smith  Bro.Feed . ....................................................... W. A. MosesSurveying Road............................................... Barker Jennings Hdw. Co.Drag Scrapers .......................... C. B. GodseyOpening Jamerson Rd., Etc............................ J. A. FarisMules..................................................................... D. R. PuckettBlacksmith Work.......................................... R. F. JamersonLabor and Lumber on New R d. ............. S. L. MayberryLabor ........................ . ................................. H. B. MarshallWork on New Road ..................................... H. C. BabcockFee ..........  ............ . ........................................ L. L. FergusonLabor............................................................. Sam FergusonLabor ..................... . ................................... . S. B. DoveLabor..................................................................... Dewey FergusonLabor ........................ ................................. Andrew PillowLabor ............................ .. .........................   T. S. McNalleySy. as Foreman .......................................... L. T. MorrisWork on Roads................................................. Jno. J. FarrarWork on Roads............................................... I. H. WillDragging Road ...................................................... Buck DossLabor ................................................................... Buck WellsLabor ................................................................. Mrs. T. S. McNallyCooking for Rd. Fee .............................. J. J. JenningsDragging Road............. ................................. W. S. GobbleRepairing Saddle.. ......................................... Appox. GarageRoad Ditcher. . .............................................. Calion Iron Works  Mfg. CoRd. Mcb. and Supplies... Buck GodseyLabor ................................................................ Wm. GarrettLabor ............................................................... T. S. McNallyIncidental Expenses ..................................... W. H. LigonHalf Expenses to Purchase Mules ................. Ernest FergusonLabor ................................. . .................... Hall BryantLabor ................................................................. Charlie HornLabor .......................................................... .. Edner MannLabor ................................................................ Jim HillCooking ................................................................... Fred IsbellLabor ................................................................... Bill TurnerLabor ................................................................ . C. A. FlowersBlacksmith Work........................................... W. E. DickersonFencing Wire and Staples....................... Sam Mayberry  BoysLabor ........................ , ..................... J. F. JenningsDragging Roads............................................. J. W. Cawthon. Jr., Hay.......................................................... T. W. OdorWork on Road .................................................... Fred DooleyL abor................................................................. O. W. WatsonBlacksmith Acct ........... . ............................. W. E. Jones and J. R. Roe-Lumber ..................................... R. S. WheelerLum ber.... .................................................... Evergreen Supply Co.Feed.................................... . ............ J. A. Sears, AgentFreight ...................................................."}, "highlight": {"text": {"matched_tokens": ["W", "Jones", "J"], "snippet": "O. W. WatsonBlacksmith Acct ........... . ............................. <mark>W</mark>. E. <mark>Jones</mark> and <mark>J</mark>. R. Roe-Lumber ..................................... R. S."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Jones", "J"], "snippet": "O. W. WatsonBlacksmith Acct ........... . ............................. <mark>W</mark>. E. <mark>Jones</mark> and <mark>J</mark>. R. Roe-Lumber ..................................... R. S."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [325.2, 234.63, 491.3, 868.18], "bbox_id": "a1f326670a", "file": "AppomattoxNewspapers_1905-1912a_0344.pdf", "page": 1, "text": "b y hope generally win out. The question of a business maua ger for the town is still a subject of discussion and earnest consideration. If a business man of the council owned the town of Farmville and had the selection of a man to man age its affairs for him no mistake would be made, but when men as sociate to do work for the people so often the, level business heads leave them. In Washington they play politics, peanut politics, but in Farmville we should sail clear of I such folly. j Hon. W. A. Jones addressed the I voters of harmville and the sur rounding country on the afternoon of the 18th, and though the houi was not wisely chosen he had a large and attentive audience to hear him. His speech here didnt differ from those made elsewhere, but it must be confessed that ho profoundly im pressed many who heard him. A supporter of Senator Martin re marked as he was leaving the court room, Senator Martin will have to come and defend himself or else he wid lose many votes. 1 heard Mr. Jones some years ago when he was fignting Republicans and not Demo- cVat s and have often said since that it was one of the strongest speeches I had heard in a decade, but Some how no man very much moves upon me when he is waging war on mem bers of his own party. It may be necessary, but the washing of dirty linen in front yards isnt a pleasant sight to look upon. It is now said that there was no necessity for cutting down the hade trees on our Main street, and if not then a great wrong has been penetrated upon our people. A tree is mans genuine friend and to have ones friends removed makes ugly gaps. What think you of those news papers that refuse advertisements of the politicians provided the mat ter is clean? Such men I somehow feel mast be rare indeed."}, "highlight": {"text": {"matched_tokens": ["j", "W", "Jones"], "snippet": "of I such folly. <mark>j</mark> Hon. <mark>W</mark>. A. <mark>Jones</mark> addressed the I voters"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "W", "Jones"], "snippet": "of I such folly. <mark>j</mark> Hon. <mark>W</mark>. A. <mark>Jones</mark> addressed the I voters"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [333.06, 1152.42, 490.33, 1466.46], "bbox_id": "3a36d13f86", "file": "AppomattoxNewspapers_1902-1905a_0317.pdf", "page": 1, "text": "A t a convention of delegates from the several precincts of this coun ty hold here Saturday afternoon, the following delegates and alternate were elected to the State Democratic convention Deleg ttes-H. D. Flood, F . W. Mc Kinney, W. H . I.igon, W. D. Hix, Dr. D. Mot Robertson, Dr. J . II.- Abbitt, S. L. Ferguson, J . O. Jones T . W. Moses. Joe Button, T. J . Stratton, Alternates-W. F . Wright, 8. R. Dickerson, E . I. Seurs, W. J . laulet e, A . II. Howerton, J . N. Wooldridge, J . R. Atwood, R. C. Mann, W. H. Lewis, J . O Shearer, J . R. IIorsleF. The unit rule was adopted and resolutions passed endorsing Con gressman Flood iu the highest terms as his own successor. The prim-try plan was not discussed, but it is beleived that the plan is generally approved by he Democrats of tbe county. We wish tbe delegation a pleasant and harmonious convention."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "W"], "snippet": "Abbitt, S. L. Ferguson, <mark>J</mark> . O. <mark>Jones</mark> T . <mark>W</mark>. Moses. Joe Button, T."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "W"], "snippet": "Abbitt, S. L. Ferguson, <mark>J</mark> . O. <mark>Jones</mark> T . <mark>W</mark>. Moses. Joe Button, T."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.73, 1445.64, 1753.39, 1719.62], "bbox_id": "4389ffbc38", "file": "AppomattoxNewspapers_1902-1905a_0265.pdf", "page": 1, "text": "A p- O f V aluable P roperty at pom attox C. H ., Va. By virtue of authority given us by resolu tion passed by the stockholders of the Far mers Exchange of Appomattox, In their reg ular annual meeting at Appomattox C. H. Va., Feb. 8th, 1904, we the undersigned Board of Directors of said Farmers Ex change will offer for sale, at public auction, on the front porch of the 6tore house, on the premises of said Farmers Exchange, at t oclock, p. m., ON SATURDAY, APRIL 2nd, 1904, that desirable lot situated at the Railway Crossing, between tbe depot and the mill, In the village of Appomattox C. H., Va. This lot contains one half acre, is beauti fully and conveniently situated for . the con duct of most any kind of business, and has on It a splendid, large two story store house, agood guano bouse and a storage house. TERMS OF SALE One third cash on day of sale, the residue in two equal Install ments, to be evidenced by two bonds of pur chase, with approved security, payable six and twelve nfonths, respectively, from day of sale, with Interest thereon from dale. JOEL T. CAWTHORN, M. L. COVINGTON, J. F. COVINGTON, THOS. HARVEY, F. B. JONES, Directors. By W. J. TRENT, Hecy. FOR SALE OR EXCHANGE."}, "highlight": {"text": {"matched_tokens": ["JONES", "W", "J"], "snippet": "THOS. HARVEY, F. B. <mark>JONES</mark>, Directors. By <mark>W</mark>. <mark>J</mark>. TRENT, Hecy. FOR SALE"}}, "highlights": [{"field": "text", "matched_tokens": ["JONES", "W", "J"], "snippet": "THOS. HARVEY, F. B. <mark>JONES</mark>, Directors. By <mark>W</mark>. <mark>J</mark>. TRENT, Hecy. FOR SALE"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [294.22, 941.82, 468.72, 1778.36], "bbox_id": "2c78f16e37", "file": "AppomattoxNewspapers_1902-1905a_0350.pdf", "page": 1, "text": "8 n  i f be so desired or he might keep them together another week, or even until Christmas, and yet they would never be able to come to any posi tive agreement. . Upon this most positive announce ment Judge Hundley dismissed the twelve faithful men, and they were allowed to go to their respective homes from which they had been absent so long. The jory stood nine for conviction and three for acquittal. Those for acquittal were G. W. Moss, of Shep herdsLeou Pollard, of Shepherdsand B. L. Apperson, of New Canton. Those for conviction were David L. Jones, W. D. Brown, J. H. Cox, H. F. Baughan, J. M. Oslin, W. T. Hndgirs, W. A. Maxey, B. B. Hanes and C. H. Agee. This result vjas a great surprise to many, yet it is safe to say that the majority of the people rather ex pected i t Many had begun to think after Mr. Hubbards great speech this morning, that the result would be a conviction, and early this after noon there were hundreds upon the oonrt green who confidently expect ed a verdiot of guilty. The court opened at 8 oclock this morning. Mr. Flood resumed his argument for the defense, and spoke for an hour with intense force and earnestness. The conclusion of his speech was a masterly piece of eloquence and wisdom. Seldom has snoh oratory been heard in this county before. When this lawyer took his seat the expression upon the faces of his magnificent audience showed what a powerful effect his speech had made. Mr. Edmond W. Hubard made the closing argument for the Common wealth from-9 oclock in the morn ing until past noon. He had the closest attention of the jury and of a vast crowd of people. It would be hardly doing tbe speech justice to say it was a great oue in many respectB it was magnificent. The speaker, who is always a man of eloquence and of force, was in the best of trim, his voice was strong, his intonation clear, and his argu ment was a well-nigh perfect one from all lawyers standpoint. He took the case from its very beginning and brought down every possible point in order and made out of the whole a terrific arraignment of the prisoner at the bar. At times bis denunciation of the crime, and of the criminal, was awful. As a prosecutor, Mr. Hubbard is unsur passed. Many p ominent visitors healing him to day, said they con sidered Mr. Hubbard the finest pros ecutor in the State. From his speech"}, "highlight": {"text": {"matched_tokens": ["Jones", "W", "J"], "snippet": "conviction were David L. <mark>Jones</mark>, <mark>W</mark>. D. Brown, <mark>J</mark>. H. Cox, H. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "W", "J"], "snippet": "conviction were David L. <mark>Jones</mark>, <mark>W</mark>. D. Brown, <mark>J</mark>. H. Cox, H. F."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [531.58, 1276.57, 685.78, 1446.16], "bbox_id": "4c24f1c11b", "file": "AppomattoxNewspapers_1915-1918a_0258.pdf", "page": 1, "text": "5 lbs black W rappers1st, C J H arding 2nd, W T Childers 3rd, E M Stratton  Bros. 5 lbs m ahogany W rappers 1st, Royal Coleman 2nd, C J Harding 3rd, J L Woodson. 5 lbs bright Tobacco1st, Z M Jones 2nd, J N W oolridge 3rd, B C Cole. 5 lbs Fillers1st, C M Strat ton 2nd, E M Stratton  Bros  3rd, T T Phelps. 6 lbs Shipping1st, Clar nc- Drinkard 2nd, C M Stratton 3rd, E M Stratton  Bros."}, "highlight": {"text": {"matched_tokens": ["Jones", "J", "W"], "snippet": "bright Tobacco1st, Z M <mark>Jones</mark> 2nd, <mark>J</mark> N <mark>W</mark> oolridge 3rd, B C"}}, "highlights": [{"field": "text", "matched_tokens": ["Jones", "J", "W"], "snippet": "bright Tobacco1st, Z M <mark>Jones</mark> 2nd, <mark>J</mark> N <mark>W</mark> oolridge 3rd, B C"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [753.6, 821.54, 921.95, 1460.84], "bbox_id": "a28c8c823a", "file": "AppomattoxNewspapers_1892-1898a_0472.pdf", "page": 1, "text": "1112 an admirable sceue. A bevy of young girls sixteeu in num ber, and young gentlemau assisting in their several parts dressed each in red and wince and red blending with the hearty good will and ani mation of all present presented a picture uot to be forgotton by those in attendance. The menue consisted of the choicest of viands of every variety and the? cuisine was of the highest order. The waitresses were Misses Rachel Caldwelil, Sallie Burke, Nina Joues, Sarah Taylor, Lizzie Fieshman, Fannie Clement, Vara Burke, Maud Gregory, Lucy Smith,.Laiws--PardiiXH, Liiiie Han cock, Willie Jones and Emma Smith. Reception committee,Madames J. W. Flood, J. C. Jones, T. A. Smith, C. W. Hunter, and Miss, Eddie Hardy. Soliciting committee, Mrs. J. W. Flood, A. H. Clement, C. W. Hunter, ind Misses Eddie Hirdy, Nina Jones, Emma Smith aud SarahVaylor aided by the rest of the chapter.- Liberal Contributions were given by the iyhole chapter and the chapter is much indebted to the following who are not members, Messrs. P. R. Wool dridge, R. F. Burke jr., J. R. Hill, Benj. Caldwell, Winston McKinney, Zan Joues, Geo. T. Peer3, - T. Jeter Ligon, Alfred Harwood and Hunter Abbitt and Madames R. F. Burk, G. U. Graff, J. R. Caldwell, 0. W. Hancock, J. II. Stanley, Robt. Irby, L. E. Smith, T. A. Walton aud Miss Sue Sears. Entertainment CommitteeMrs. A. H. Clement, Mrs. T. A. Smith, Mrs. J. JR. Atwood, Misses Hardy and Joues. The program was as tollows Dixie about tweuty voices in their several ptiits. admirably aud enthusiastically sung, calling forth a hearty applause from the audience. Maryland, My Maryland by James Randall Miss Emma Smith, Tent ing on the old Camp Ground. Kitt- ridge, Miss Taylor, ably assisted by a full chorus."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "Smith. Reception committee,Madames J. <mark>W</mark>. Flood, <mark>J</mark>. C. <mark>Jones</mark>, T. A. Smith, C."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "Smith. Reception committee,Madames J. <mark>W</mark>. Flood, <mark>J</mark>. C. <mark>Jones</mark>, T. A. Smith, C."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [582.51, 481.0, 752.76, 911.44], "bbox_id": "c313931d62", "file": "AppomattoxNewspapers_1892-1898a_0064.pdf", "page": 1, "text": "with Spout Springs line to starting point. The voting place of this election district shall be Chap. COURT HOUSE PRECINCT, Commencing at Fleshmans east comer on railroad and folow Clover Hill precinct line to R. D. Williams, thence sonth along the Bent Creek and Appomattox C. H. road to where j . W. Flood and J. C. Jones corner on said road, thence along said line between the two said fanners to where J. A. Caldwells farm joins two said farms, thence along the line to where said J. W. Flood joins An derson Stephens thence along said lines to road leading by Daniel McKinneys, thence along said road cross! ng the Lynchburg and Rich mond road and Norfolk and Western Railroad to Hancocks milk thence east along Gum Branch road to Pughs fork, and leaving said Gum Branch road at this point following neighborhood road until it intersects with Wesley Chapel road near L. A. Williams, thence south down said road to where said road intersects ! with Evergreen and Wesley Chapel road, thence north with said road to 1  n l a r c o n f s m i f l i  R n f l l a n v l wnere it lAiiciBCLw  , road, thence along said Bethany road to Evergreen, thence west with Nor folk and Western Railroad to start ing point. The voting place of this election district shall he at Appomat-"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "road to where j . <mark>W</mark>. Flood and <mark>J</mark>. C. <mark>Jones</mark> corner on said road,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "road to where j . <mark>W</mark>. Flood and <mark>J</mark>. C. <mark>Jones</mark> corner on said road,"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.0, 419.83, 1895.4, 799.18], "bbox_id": "6d2a249141", "file": "AppomattoxNewspapers_1892-1898a_0094.pdf", "page": 1, "text": "what party yon belong. Come and we can assure a pleasant and enjoya ble day. It is an opportunity that no one should miss. If you are on the fence, yon may hear somethihg that may decide yon. Be sure to contribute promptly. The committee on edibles will take charge of whatever yon may feel dis posed to give. Let ns all unite in making this day a grand success. . On Saturday Sept. 23rd a mssa meeting was held at this place and after a very harmonious and pleasant discussion the following committees were appointed Committee on EdiblesT. A. Smith, chairman, W. A. Moses, S. P. Coleman, Mrs. J. R. Atwood, Miss Sallie Burke and Miss Kate OCon ner. Finance CommitteeJ. B. Taylor, chairman, J. H. Abbitt, R. F. Burke. Committee, of ArrangementsJ. R. Atwood, chairman, J. M. Miles, W. J. Trent, Miss Anna Jones, Miss Mary Statham, MiasLizzie David son, Mrs. J. W. Flood, Miss Fannie Johns and Miss Lonlie Peers. Committee on SpeakersW. J. Trent, chairman, R. C. Harvy and R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "chairman, J. M. Miles, <mark>W</mark>. <mark>J</mark>. Trent, Miss Anna <mark>Jones</mark>, Miss Mary Statham, MiasLizzie"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "chairman, J. M. Miles, <mark>W</mark>. <mark>J</mark>. Trent, Miss Anna <mark>Jones</mark>, Miss Mary Statham, MiasLizzie"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [572.14, 1656.63, 2346.59, 1696.79], "bbox_id": "4a313e91d9", "file": "AppomattoxNewspapers_1933-1936a_0444.pdf", "page": 1, "text": "VWOINIA rjcivw J. L. Jones . . . . J. L. Nicholas ... L. W. Horton .."}, "highlight": {"text": {"matched_tokens": ["J", "Jones", "J", "W"], "snippet": "VWOINIA rjcivw <mark>J</mark>. L. <mark>Jones</mark> . . . . <mark>J</mark>. L. Nicholas ... L. <mark>W</mark>. Horton .."}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Jones", "J", "W"], "snippet": "VWOINIA rjcivw <mark>J</mark>. L. <mark>Jones</mark> . . . . <mark>J</mark>. L. Nicholas ... L. <mark>W</mark>. Horton .."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.14, 279.63, 1635.29, 759.26], "bbox_id": "519609cb17", "file": "AppomattoxNewspapers_1962-1965a_0275.pdf", "page": 1, "text": "Vocational rendered special music. The it has or- j offering for the day was very iss for the good. Several visitors attended lattox and the service. The class  Education Week will be ob- r evening served at the local Carver Price High School beginning this Sun day evening at 8 p.m. with a developed sppcial address by the Rev. C. L. Brown and his choir frm the Sulphur Spring Baptist Church. The public is cordially invited to attend this service. A special school sendee will be held on Wednesday and Friday at 1 p.m. Mrs. Carol P. Jones, Elementary Supervisor of schools in Buck ingham. Mrs. J. C. Webb is chairman of the special commit tee. An appreciative crowd attend ed the sppecial dedication ser vice at the Springfield Baptist Church last Sunday evening at 3 p.m. The Rev. R.. Q. Lawing and the Senior Choir of the Gali lee Baptist Church were the spe cial guest. Robes for the Spring- field Choir and its minister were formally dedicated. The dedica tion prayer was offered by dea con J. W. King. Mrs. Delores Jones served as mistress of cre- monies and Mrs. Arabell McCoy read the scripture. The welcome address was given by M iss Izet- ta Lewis. All present enjoyed the service. Mr. Anderson Haskins has mov ed into his new home in Appo mattox, Va. Mr. and Mrs. Leon Stovall, of Richmond, spent the week end here as the guest of her mother, Mrs. N. R. Jordan. R. Q. Lawing, Jr. and Miss Walston, of Heathsville, spentì the week end here as the guests of his parents."}, "highlight": {"text": {"matched_tokens": ["J", "W", "Jones"], "snippet": "offered by dea con <mark>J</mark>. <mark>W</mark>. King. Mrs. Delores <mark>Jones</mark> served as mistress of"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "W", "Jones"], "snippet": "offered by dea con <mark>J</mark>. <mark>W</mark>. King. Mrs. Delores <mark>Jones</mark> served as mistress of"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1054.28, 1374.45, 1345.63, 1428.54], "bbox_id": "36e793802a", "file": "AppomattoxNewspapers_1947-1949a_0051.pdf", "page": 1, "text": "U-J OFFICERS J. D. Owen, President J. T. Noell, Jr., Vice President L. W. Horton, Assistant  J. L. Jones, Vice President S. D. Morrissett,Assistant  J. L. Nicholas, Cashier T. R. Hawes, Assistant CaS"}, "highlight": {"text": {"matched_tokens": ["W", "J", "Jones"], "snippet": "Jr., Vice President L. <mark>W</mark>. Horton, Assistant  <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}}, "highlights": [{"field": "text", "matched_tokens": ["W", "J", "Jones"], "snippet": "Jr., Vice President L. <mark>W</mark>. Horton, Assistant  <mark>J</mark>. L. <mark>Jones</mark>, Vice President S. D."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
