{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Flood, Thos. S. Bocock, <mark>James</mark> <mark>Watkins</mark>, D. Mott Robertson, W."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Flood, Thos. S. Bocock, <mark>James</mark> <mark>Watkins</mark>, D. Mott Robertson, W."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [895.67, 179.46, 1039.9, 309.2], "bbox_id": "9c0abe70e1", "file": "TimesVirginian_1978_0388.pdf", "page": 1, "text": "Rev. James Johnson. Rev. Johnson, of Madison Heights, Va., has been serving us for the past several months as acting pastor. We are happy that Mr. T. W. Hamlet is slowly making her way around town again. During the month of August, she was visited by Mr. and Mrs. James Watkins and Mr. and Mrs. R. D. Watkins, all of Baltimore, Md."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "by Mr. and Mrs. <mark>James</mark> <mark>Watkins</mark> and Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "by Mr. and Mrs. <mark>James</mark> <mark>Watkins</mark> and Mr. and Mrs."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2202.26, 1273.86, 2271.49, 1356.11], "bbox_id": "9aa635fcac", "file": "TimesVirginian_1981a_0368.pdf", "page": 1, "text": "ORvia Lambert Anale Trent M inio Rood Daisy Watkins Warna Watkins James Watkins dando Psanis"}, "highlight": {"text": {"matched_tokens": ["Watkins", "Watkins", "James", "Watkins"], "snippet": "ORvia Lambert Anale Trent M inio Rood Daisy <mark>Watkins</mark> Warna <mark>Watkins</mark> <mark>James</mark> <mark>Watkins</mark> dando Psanis"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "Watkins", "James", "Watkins"], "snippet": "ORvia Lambert Anale Trent M inio Rood Daisy <mark>Watkins</mark> Warna <mark>Watkins</mark> <mark>James</mark> <mark>Watkins</mark> dando Psanis"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [881.96, 880.82, 1046.69, 1273.37], "bbox_id": "b50045d977", "file": "AppomattoxNewspapers_1936-1939a_0045.pdf", "page": 1, "text": "of Virginia, Gilbert C. Walker, of New York, appointed a Mayor for the City of Richmond, and the citi zens of Richmond elected one for the same office. Of course there was a hob fight as to which should serve, and on April 27th, 1879, there was a meeting in the State Capitol to discuss the qustion, and Mr. Bocock was a spectator. The gallery of the building collapsed, known as the Capitol Disaster. Mr. Bocock was one of the many badly injured, his ankle being crushed, causing him to limp through life. The accident caused such a shock that he never fully recovered physically, but that gigantic structure of intellect con tinued to shine and cast its bright ness above his surroundings. Well do I remember Mr. Bocock in he old age, as he would lean on his cane and limp from the effects of the accident. What a striking figure he presented of the true type of the old Virginia gentleman. Went To Huse of Delegate Mr. Bocock was elected bo the House of Delegates of Virginia from Appomattox County in 1877, and was the candidate of the Democratic Party in 1879, but was defeated by James Watkins, the Re-Adjuster candidate, his defeat being caused only by a division in the Democratic ranks as to the settlement of the state debt. There were about as many negro voters in the county as were white voters and the solid negro vote combined with the Demo crats who voted for Watkins o the state debt question defeated Mr. Bo cock, the only defeat lie received during his long and distinguished"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "but was defeated by <mark>James</mark> <mark>Watkins</mark>, the Re-Adjuster candidate, his"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "but was defeated by <mark>James</mark> <mark>Watkins</mark>, the Re-Adjuster candidate, his"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [920.13, 302.3, 1088.43, 547.05], "bbox_id": "dcf1fb5d48", "file": "AppomattoxNewspapers_1939-1943a_0225.pdf", "page": 1, "text": "of the church. News was received here early last Sunday morning of the sudden death of Mrs. Cora Hamlet of New York. She was the sister of John Floo.d, who left Monday for New York. Miss Mildred Hart is out after be ing in with the flu for a few days. Rev. Yates and Miss Stephens and James Flood were the Sunday dinner guests of deacon and Mrs. Robinson. Mrs. Helen Morgan and sister, Mr. and Mrs. Brooks and family, Mr and Mrs. Collier and family, and Mrs, Maggie Lawing and son, of Petersburg and Mr. Pooch and Miss Fasion, of Emporia, were Sun day dinner guests of Mr. and Mr. R. Q. Lawing. Mr. and Mrs. John Green and son, Marvin, Mattie Wright and James Watkins, of Baltimore were guests of friends here Sunday. Mrs. Bettie Flood is sick with the flu.Ned Leftwieh is sick with the flu."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Marvin, Mattie Wright and <mark>James</mark> <mark>Watkins</mark>, of Baltimore were guests"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Marvin, Mattie Wright and <mark>James</mark> <mark>Watkins</mark>, of Baltimore were guests"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [720.93, 1397.82, 1044.35, 1796.11], "bbox_id": "c845a5ae87", "file": "AppomattoxNewspapers_1898-1902a_0364.pdf", "page": 1, "text": "not afraid to be geurous to the needy I  years. 1 hen Bucklens Arnica and suffering. The proprietors of kulye cured him. It cures Cuts, Dr. Rings New Discovery for Con-1 Rroses Burns, Boils, belong, Corns, sumption, Coughs, and Colds have Ernptious. Best Pile lure on given away over ten millions of trial earU. 25 cts. a box. Cure guuran- botties of this great medicine, and I eec by L H. Atwood, W est have the satisfaction of knowing it Appomattox R. J. Carter, Pros has absolutely cured thousands of  Peet Virginia, hopeless cases. Asthma, Bronchi- _ 77777 .  tis, Hoarseness, and all diseases of Death of Robert R. Watkins. the Throat, Chest, and Lungs are Mr. Robert R. Watkins, a former surely cured by it. Call on J. R. well-known resident of this city, died Atwood, West Appomattox, or R. J. on Saturday evening last at the home Carter, Prospect, and get a free trial of his father, Mr. James Watkins, at bottle. Regular sizes, 50c. and 1. Eviugton, Campbell couuty, aged 31 Every bottle guaranteed, or price years. Mr. Watkins had been for a refunded.  Jong time a sufferer from consnmp- ,  ., D .. , -ion, and for many weeks prior to  1 see by de papers, said Brother hi3 death hilJ frieds aud  Dickey,  dat dey beo a-trym ter L  that the end waa lynch my race in de north en wes proa hinfr He hsd to ve  erg in. My, my! What do dem p08ition iu Lynchburg iu Februtry yaukees mean, anyhow t Dey tol I fa8tj and afle,- tha ,ime his condi u8. when dey sot us free, dat dey tjon jjecame more aud more precari- gwine ter give us plenty er rapt, eu, 0QS. jjuring thl. fifteeu year of hig bless God I f um de way dey been rfe 8 jdt.uce D Lynchburg Mr. Watkins cuttm up lately, hit look lak dey wag connected with several clothing gwine keep dey promise! En now, I e8tabH8hineDt8 his Br8t 8 itnation heah come a white lady f um Bos- havjng been with the house of Simon tiug preachin ter de hullud Strause, and his last with Cinning- dat hits mo better ter be lynched I ham   He wa8 weirknown in de north dan in de sooth! But, I u Lynchburg, and possessed here a fer de Lawd sake, whar s de dif-1 jarge number of friends. Tbe re- funce ? Ter save my life, I can t mains were taken through Lynch- see none. Lynchin is lynchin , whar-1 burg yesterday afternoou to Spout ever hit come,en a dead uigger is a Spring, Appomattox countv, where dead nigger, f um. Billviile ter Bos- they will be interred by the side of ting! My advice ter my race is ter Mr. Watkinss mother.-Lynchbnrg stay whar home is, en ef dey gits New8 of Tuesday, lynched arter all, dey at leas will be 1"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "of his father, Mr. <mark>James</mark> <mark>Watkins</mark>, at bottle. Regular sizes,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "of his father, Mr. <mark>James</mark> <mark>Watkins</mark>, at bottle. Regular sizes,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2058.25, 771.18, 2213.23, 1022.03], "bbox_id": "9dfd3c3c5a", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "N theiClerks Office of the Circuit Court of the County of Appomattox on the 18th day of June, 1917. Mattie M. Bristow and her husband, K. W. B ristow , ........................................... Plaintiffs against W ert Watkins, Berta Watkins, W U Farrar and his wife Jill Farrar, Alma White and her husband Jesse White, Minnie Cheadle and ber husband 8 H Obeadle. . Laura Meadows and ber husband Walker Meadows, Lou Meadows and ber hus band J it Meadows, Mrs. W B Hubard and her husband W B Hubard, James T Watkins. E L Childress, Frank W atktns and Snow Watkins, and tbe unknown belrs a t law of Ella Watkins Wallace, deceased .......... . ..................... Defendants Tbe object 08 this suit is to partition tbe tract of 95 acres ot land In Appomattox county, Virginia, of which M B Watkins died seized and possessed. And an affidavit baying been made and filed that the defendants James Watkins and E L Childress are not residents of the State of Virginia, and that the whereabouts of tbe belrs at law of Lila Watkins Wallace, de ceased, are not known, it Is oraered that they do appear hpre within fifteen days alter due publication hereof and do w hat may. be necessary to pro tect their Interests In ibis suit. AVa It I b further ordered that a copy hereof be published onoe a week for tour weeks In tbe Times-Virginian, a newspaper published in the oounty of Appomattox, and th at a copy bo posted at the trout door of the oonrt- house ol this county on the 16th day of June. 1917, that being the next succeeding rule day after this order was entered. A oopyTeste J K Hi"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "filed that the defendants <mark>James</mark> <mark>Watkins</mark> and E L Childress"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "filed that the defendants <mark>James</mark> <mark>Watkins</mark> and E L Childress"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.88, 887.24, 2251.36, 1135.91], "bbox_id": "ba9b29f1c1", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "N theicierka Office ot tbe Circuit Court ot tbe Oounty ot Appomattox on tbe 14th day of June, 1017. Mettle M. Brlitow and her butand, R. w . Bristow ........ . .............................. .....P lain tiff atainat Wert Watkins, Berta Watkins, w h Ferrer end bis wife Gill Ferrer. Alma White end her husband Jerne White, Minute Cheadle end bar husband 8 H Cbeadle. Laura Meadows and her busband Walker Meadow, Lou Meadows end bar hus band J R Meadow, Mrs. W B Huberd end her husband W B Huberd, James T Watkins, B L Childress, Frank VI etktns end Snow Watkins, end the unknown heirs at law of Blla Watkins Wallace, deceased . ............... . Defendants Tbs object of this suit 1 to partition tbe tract of It sores of lend in Appomattox oounty, Virginia. 0f which M B Watkins died seised and possessed. And an affidavit bavin bean made and filed that tbe defendants James Watkins and K L Childress are not residents of the State of Virginia, and tbat tha whereabouts of the beirs at law of Blla Watkins Wallace, de ceased, are not known, it la ordered tbat they do appear here within fifteen days after due publloatlon hereof and do what may be neeesaary to pro- teot thalr interests in thia suit. And tt 1 further ordered that a copy hereof be ubiiahed onoe a week for four waeka in tbe Imas-Virginian, a newspaper published in tbe oounty of Appomattox, and that a copy be posted at tbs front door of tbeoourt- house of this oounty on tbe ltth day of June, 1817, tbat being tbe next suooeedlng rule day after this order wae entered. A copyTeste J R HORS"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "filed that tbe defendants <mark>James</mark> <mark>Watkins</mark> and K L Childress"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "filed that tbe defendants <mark>James</mark> <mark>Watkins</mark> and K L Childress"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2059.7, 746.08, 2213.71, 1006.68], "bbox_id": "6ce8697931", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "N the Clerks Office ot the Circuit Court ot the Count, ot Appomattox on the 18th d a, ot JUne, 19IT. Mettle M. Brie tow end her husband, B. W. Bristow .......................................... . . PlelntlCa aghH.it Wert Watkins, Berta Watkins, W H Farrar and his w lte Qlll Farrar, Alma White and her hueband Jesse White, Minute Cheadle and her hueband 8 H Cbeadle. Laura Meadows and her husband Walker Meadows, Lou Meadows and her hue- band J R Meadows, Mrs. W B Hubard and her husband W b Hubard, Jam es T Watkins. B L Childress, Frank t atkins and Snow Watkins, and the unknown heirs a t law ot Blfa W atkins Wallace, deceased ............... . ......... . Defendants The obleot of this suit Is to partition the tract o t 26 acres of land tn Appomattox county, Virginia, of whioh M B Watkins died seized and possessed. And an affidavit having been made and Sled that the defendant James Watkins and B L Childress are not residents of the State of Virginia and th at the whereabouts of the heirs at law of Blla Watkins Wallaoe, de ceased, are not known. It la ordered that th e , do appear here within fifteen days after due publication hereof ana do w hat may be neeesaar, to pro tect their Interests In this suit. Ana It I farther ordered that a oop, hereof be mbllshed once a week for four weeks tn the Imes-Vlrgtnlan, a newspaper published In the oounty of Appomattox, and th at a copy be posted at the front door of the court house of th is oount, on the 18th day of June, 1SIT, th at being the next suoeeedlng rule d a, after this order was entered. t A oopyTeste J U HOBBLEY, Clerk, b , C W Smith, D O A H Clement, p q 718 U"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Sled that the defendant <mark>James</mark> <mark>Watkins</mark> and B L Childress"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Sled that the defendant <mark>James</mark> <mark>Watkins</mark> and B L Childress"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2037.6, 338.6, 2193.33, 613.05], "bbox_id": "ee34908f8c", "file": "AppomattoxNewspapers_1915-1918a_0408.pdf", "page": 1, "text": "N the Clerk Offlce ol the Ctroult Court of the Countv of Appomsttox on the 16th day of June, 1917. Mattie M. Bristow and her husband, R. W. B ristow , .............. . .......................... Plaintiffs against Mrs. W B Hubbard, W B Hubbard, Mra. J K Meadow. J K id endow, Mrs. Laura Meadow, J w Meadow, W irt watklna. Miss Berta Watklna, v H Karrar, Mary B Farrar, Al fred Farrar. Gilt Farrar. Alma White, Jer sey White, Minnie Cheaale, H 8 Cheadle, Frank Watklna, Snow Watkins, James W stkinsand K L Childress.... Defendants Tbe object of this suit Is to partition the tract of. 25 acres of land In Appomattox county, Virginia, of which M B Watkins died seised and possessed. And an affidavit having been made and died that tbe defendants James Watkins and 1 L Childress re not resident of the State of Virginia, it is orooted th at they do appear I here within fifteen days after due punflea- tion hereof and do what may be necessary to protect their Interests In this suit. Ana It is further ordered that a copy hereof be published once a week for fonr weeks in tbe rimes-Virginian, a newspaper published In the county of Appomattox, and that a copy be posted at the front door of theoourt- house of this county on the lttth day of June. 1917, that being the next succeeding rule day alter this order was entered.  oopyTeste J KHOUSLBT,Clerk, by C W sm ith, D G A H Clement.  q 27 LOOK"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Cheadle, Frank Watklna, Snow <mark>Watkins</mark>, <mark>James</mark> W stkinsand K L"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Cheadle, Frank Watklna, Snow <mark>Watkins</mark>, <mark>James</mark> W stkinsand K L"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2008.53, 925.82, 2166.2, 1121.63], "bbox_id": "7f56666ba3", "file": "AppomattoxNewspapers_1915-1918a_0400.pdf", "page": 1, "text": "N tbe Clerk Offloe of tie Circuit Court I of tbe Count of Appomattox on tbe I Mth day of June, 1B1T. Mattie M. Brlitow and ber buaband, U. W.l Brlatow ............................................. Plaintiff I agalnat I Mr. W B Hubbard, w B Hubbard, Mr. J HI Meadow. J B of eadow, Mrs. Laura Meadow, 1 J W Meadow. Wirt watklna. M in Berta  Watkins, W H Farrar. Mary B Farrar, Al fred Farrar, Sill Parrer. Alma White, Je r . er White, Minnie Cbeadle, H 8 Cbeadle, I Frank Watklna, Snow Watklna, James I Watkins and B LChildren....D efendant I Tbe object of this suit la to partition the I tract of a acre of land In Appomattox I oounty, Virginia, of which M B Watkins  died gelled and pollened, and an affidavit having been made and iled that the defendant James Watkins and I  L Childress are not resident of tbe State I Virginia, It 1 ordered th at they do appear I here within fifteen day after due publloa-1 tion hereof and do what may be neoeinry I to protect their lnteet In thla suit. Ana I It Is further ordered th a t a oopy hereof be I published onee a week for four weeks in the I Times-Virginian, a newspaper published in i the county of Appomattox, and th at a oopy I be dob tea at thu front door of tbe oourt-1 house of this county on tbe 18th day of June. I 19X7, that being the next succeeding rule day I after this order was entered."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "iled that the defendant <mark>James</mark> <mark>Watkins</mark> and I  L Childress"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "iled that the defendant <mark>James</mark> <mark>Watkins</mark> and I  L Childress"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2089.06, 782.96, 2257.01, 1182.99], "bbox_id": "d0f48de77d", "file": "AppomattoxNewspapers_1955-1957a_0081.pdf", "page": 1, "text": "Mrs. Rosa Reynolds Buchanan died January 21 at her home here, after an illness of three months. She was born in Appomattox Coun ty June 13, 1898, daughter of Thomas Edwards and Emma Jones Reynolds. She was the wife of form er Appomattox Mayor George B. Buchanan, who also served as Ap pomattox County Treasurer, Besides her hufband, she is sur vived by three daughters, Mrs. Jo seph Tindall, Middletown, N. J. Mrs. Charles Morris, Richmond and Miss Ilah Buchanan, with the State Department in Saigon, Viet Nam one son, George B. Buchanan Jr., Appomattox one brother, Ho mer W. Reynolds, Ashbury Park, N. J., and four grandchildren. Funeral services were held at 2 P. M. Monday, at Robinsons Fu neral Home here. Interment was in Liberty Cemetery. Services were conducted by Dr. Carl A. Collins, Jr. Dr. Twyman Williams, and the Rev. Lee H. Richcreek. Active pallbearers were David T. Robertson, Grover Smith, A. R. Har wood Jr., Billy Conner, Robert C. Hubbard and William C. Hubbard. Honorary pallbearers were Dr. C. F. James, Watkins M. Abbitt, George Abbitt Jr., George Abbitt Sr., Chas. F. P. Crawley, J. A. Burke, William Burke, H. C. Pul liam, Carroll Ould, Calvin Robinson, Leonard E. Anderson, Fred Lawson, Jesse Guill, Robert Alford, Thos. T. Martin, Joel W. Flood, C. T. Moses, C. T. Moses Jr."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "were Dr. C. F. <mark>James</mark>, <mark>Watkins</mark> M. Abbitt, George Abbitt"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "were Dr. C. F. <mark>James</mark>, <mark>Watkins</mark> M. Abbitt, George Abbitt"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [342.5, 652.34, 484.4, 872.33], "bbox_id": "4c5936dc7e", "file": "AppomattoxNewspapers_1971-1973a_0107.pdf", "page": 1, "text": "Mrs. Margaret L. Watkins,  39, of Concord, died early Fri day in Lynchburg General-Mar shall Lodge Hospital. A native of Appomattox Coun ty, she was the daughter of Mrs. Flossie Madison West of Balti more and the wife of James E. Watkins. Survivors, in addition to her husband and mother, include one son, James Watkins, Jr. of Concord two daughters, Bren da Watkins and Eelisa Watkins of Concord four sisters, Mrs. Fannie L. Watkins, Mrs. Fran ces Brown and Mrs. Maxine Johnson of Baltimore, and Mrs. Lorene Wilson of Philadelphia. Community F u n e r a l Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "mother, include one son, <mark>James</mark> <mark>Watkins</mark>, Jr. of Concord two"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "mother, include one son, <mark>James</mark> <mark>Watkins</mark>, Jr. of Concord two"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [648.24, 451.62, 817.46, 581.31], "bbox_id": "48d6541fbf", "file": "AppomattoxNewspapers_1952-1954a_0467.pdf", "page": 1, "text": "Mr. Oscar H. Davis and Miss V ir ginia Smith, of Red House Mr. Lawrence Baghy and Miss Sally Randolph, o f Red House Mr. Ray mond Williams and Miss Alma White, of Red House Mr. James Watkins and Miss Margaret Madi son, of Concord and Mr. Evan Fleshman and Miss Mary Antlonette Lawing, of Appomattox, were mar ried in the home of the Rev. and Mrs. R. Q. Lawing. Rev. Lawing of ficiated."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "of Red House Mr. <mark>James</mark> <mark>Watkins</mark> and Miss Margaret Madi"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "of Red House Mr. <mark>James</mark> <mark>Watkins</mark> and Miss Margaret Madi"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1472.63, 529.86, 1642.23, 823.3], "bbox_id": "12d2239f18", "file": "AppomattoxNewspapers_1933-1936a_0336.pdf", "page": 1, "text": "last Friday evening before a largi  crowd of boys, school patrons ant  friends. The exhibits consisted oi !. the following classes wheat  i coin, tobacco and sweet potatoes j turnips, and butter. .JHc- following boys were winners of first, second and third prize respectively wheat, Vane Watkins James H. Watkins and Neal Lewis corn James H. Watkins, Peter Flood Vind  !Lawerance Hanar tobacco Neal Lewis, Neal Lewis ana PtCer Flood potatoes John Leathers, Lawrence Qallhan and James H. Watkins sweet potatoes Martin. Mason, McKinley Tibbs and Raiph Lewis. There was not sufficient cor Petition in butter and turnips. The judges were Mr B. G Ander son and Progessor Gills, who rendered a Very fine service and spoke very complimentary about the. exhibit. t F ootball Game ll.e Appomalttox Gangsters will 1 meet the R. R. Morton high schpol of Farmville here Friday, November 15. The game will be called at 2 30. This is our first game at home and we are happy ifc0 play it on ou r new field. Principal A. E. Jordan and also coach is calling on"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James", "Watkins"], "snippet": "prize respectively wheat, Vane <mark>Watkins</mark> <mark>James</mark> H. <mark>Watkins</mark> and Neal"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James", "Watkins"], "snippet": "prize respectively wheat, Vane <mark>Watkins</mark> <mark>James</mark> H. <mark>Watkins</mark> and Neal"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.71, 196.51, 2180.56, 379.05], "bbox_id": "0744d7c306", "file": "AppomattoxNewspapers_1971-1973a_0431.pdf", "page": 1, "text": "Johnny Sperry, Dennis Tho mas, Steve Trent, E rnest Wade, Ronnie Wade, James Watkins, Marvin Watson, Lacy Webb. Tommy Wheeler. Henry White, Coy Williamson, Ricky Wingfield, Norman Younger, Linda Price, Nora Pugh, Grace Ranson, Debbie Rush, Joanne Scott, Charlene Shrock, Dona Steppe, Sue Terry, Carla Varner. Carolyn Walker, Mari lyn Washington, Judy Watson, Pam Williams, Joan Wright.  NINTH GRADE HOMEROOM GYM Lawrence Bagby, William i Bryant, Jerry Cyrus, Marvin"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "rnest Wade, Ronnie Wade, <mark>James</mark> <mark>Watkins</mark>, Marvin Watson, Lacy Webb."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "rnest Wade, Ronnie Wade, <mark>James</mark> <mark>Watkins</mark>, Marvin Watson, Lacy Webb."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [367.69, 494.08, 592.24, 508.08], "bbox_id": "9f2cfb05a0", "file": "AppomattoxNewspapers_1971-1973a_0293.pdf", "page": 1, "text": "James Watkins Receives Award"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "<mark>James</mark> <mark>Watkins</mark> Receives Award"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "<mark>James</mark> <mark>Watkins</mark> Receives Award"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.8, 1023.46, 2172.94, 1181.04], "bbox_id": "7342a012df", "file": "AppomattoxNewspapers_1915-1918a_0404.pdf", "page": 1, "text": "I Nof,hiTrSlLÎÏB4Ç 2 tha ffitontt Court j Mththy0SfU3LToo.VT!,POtt0  th Brl,tow her butband, a. w. 8rtoW............    i ............  -  i MI?  6 HnbtwrdTW u Hubbard, Mr. J K Mdow J H aleadow, Mrs. Leur Meadow I J W Mkwdow, Wirt Vatklna. Mias Uerti WatUut,  H Ktnvr, Mry B Karrar.Al- fred Farrar. Oil. Farrar, Alma White, Jer Wbi, WinnieOheadle.H Sebeadle. VAnk Watklna, Snow Watkins. Janes Watkins and 1 L Cblldress.... Defendants I Tbe obleetiM this suit is to partition tbe rOAC OI K   --- n Ian2 a____. . I i A- a V HW BU SU Ml  , traet of  agree of land tn Appomattox ?2P tr l í??1- or whiob M B watkins died seised and possessed. 1 ffflilV lt, toying been made and I tot the defendants James Watkins and  wpyfd.raH,ire not resident ot the state of Virginia, it is oroeied that they do appeal tore within fifteen days after due pubnoa -1 tion hereof and do what may be neoeasarv .protecttheir interuets in this suit. And  or8red that a oopy hereof be I t ll n lla h o il A n n a am tt, A a 1 . fa a Slaaaaaa _ . . . a .a I"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "I tot the defendants <mark>James</mark> <mark>Watkins</mark> and  wpyfd.raH,ire not resident"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "I tot the defendants <mark>James</mark> <mark>Watkins</mark> and  wpyfd.raH,ire not resident"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2070.25, 1009.22, 2228.8, 1272.08], "bbox_id": "19f4e08582", "file": "AppomattoxNewspapers_1915-1918a_0429.pdf", "page": 1, "text": "I N thelClerka Office of the Circuit Court of tbe County of Appomattox on tbe 16th day of June, 1917. I Mattie M. Bristow and ber husband, B. W. Bristow ............................................. Plaintiffs against Wert Watkins. Berta W atklns. W H Farrar and bis wife ail Farrar, Alma White and her husband Jesse White, Minnie oheadle and her husband S H Cbeadle. D o ra Meadows and ber busband Walker Meadows, Lou Meadows and her hus band J H Meadows, Mrs. W U Hubard and ber husband W B Hubard, Jam es 1 Watkins. BLChildress, Frank Watkins and snow Watkins, and the unknown heirs a t law of Blla Watkins Wallace. deceased.................................. Defendants Tbe object of this suit Is to partition tbe ! tract of aores ot land In Appomattox county, Virginia, of wblob M B Watkins died seized and possessed. And an affidavit having been made and died that tbe defendants James Watkins and B L Childress are not residents of the State of Virginia, and that the whereabouts of tbe belrs at law of Slla Watkins Wallace, d e ceased, are not known. It Is oroeied that they do appear here within Ofteen days after due publication hereof and do wbat may be neoessary to pro tect their Interests in this suit. Ana It Is further ordered that a copy hereof be published onoe a ,week for four weeks in tbe Times-Virginian, a newspaper published in tbe county of Appomattox, and th at a copy be posted a t tbe front door of the court house of this county on the 16th day of June. .917, tbat being tbe next succeeding rule day  after this order was entered. A copyTeste J H HOBS LB Y, Clerk, by C W sm ith, DO IA H Clement, p q 7 18 It"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "died that tbe defendants <mark>James</mark> <mark>Watkins</mark> and B L Childress"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "died that tbe defendants <mark>James</mark> <mark>Watkins</mark> and B L Childress"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [351.84, 517.27, 616.83, 750.04], "bbox_id": "47bd076ba8", "file": "AppomattoxNewspapers_1971-1973a_0293.pdf", "page": 1, "text": "Highest point winner, James Watkins, Jr., is being pre sented the sweepstakes award, an engraved Silver Tray by Program Leader, Agriculture, Mr. Travis Ple- Jam es totals come from selling twelve qualifying market hogs at the Piedmont Junior Hog Show and Sale. He placed first with a truck load of five 5 second in a pen of three 3V two single first in different weight classes and third in showmanship. James total prize money was 52.00. In qualifying for the sweepstakes his total points were 56 49 points was his nearest rival. Jam es animals sold for 88.10 Boys and girls from ten surrounding counties exhibited, showed, and sold 102 animals weighing 19,830 pounds. The average weight per hog was 190 lbs., and the average price was 19.54. Total prize money paid out was 294.00. This exceptional educational and rewarding event for our local 4-H project members is sponsored by Mr. Ralph King of Kings Markets, Inc. Congratulations  James Watkins, Jr.! Any 4-H member may participate in this very worthy ev ent. Please be reminded now is the time to secure your eight week old or 40 pound pigs to start on this project that takes place August 15, at the Lynchburg Livestock Market."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Highest point winner, <mark>James</mark> <mark>Watkins</mark>, Jr., is being pre"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Highest point winner, <mark>James</mark> <mark>Watkins</mark>, Jr., is being pre"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1188.0, 346.7, 1355.73, 499.3], "bbox_id": "025a200e03", "file": "AppomattoxNewspapers_1952-1954a_0245.pdf", "page": 1, "text": "Hello Readers! Our first baseball game played at Farmville ended in a score of 5-4 with Moton High the victors. Outstanding players were Charles Walker, Eugene Brow der, Allen Watkins, James Graham, Joe Robinson, Harrison Kelso, and Donald Hart. In the game with Am herst last Tuesday, we lost by a score of 7-6. Algie Williams pitch, ed the whole game, and hes good. Allen Watkins, tenth grader, pitch ed the first game. Hes rookie Al len, in case you didnt know."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Eugene Brow der, Allen <mark>Watkins</mark>, <mark>James</mark> Graham, Joe Robinson, Harrison"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Eugene Brow der, Allen <mark>Watkins</mark>, <mark>James</mark> Graham, Joe Robinson, Harrison"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [787.91, 647.57, 1250.77, 831.43], "bbox_id": "857e07f8fe", "file": "AppomattoxNewspapers_1971-1973a_0256.pdf", "page": 1, "text": "GOLDEN INTERMEDIATE 4-H CLUB dent Hal Smith. Pledges to flags were led by Frances Chernault and Judy Watson. Projects were passed out. Cindy Guill receiv ed a trophy for firstplaceinthe Public Speaking contest. James Watkins received a silver plat ter for a hog he entered in a hog show. We are very proud of our 4-H members. Share-the-fun will be held April 7. Time has Time has not been set. Senior 4-H camp will be held June 10- 14. A silm strip was shown en titled Our Money System. The meeting was then adjourn-"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "firstplaceinthe Public Speaking contest. <mark>James</mark> <mark>Watkins</mark> received a silver plat"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "firstplaceinthe Public Speaking contest. <mark>James</mark> <mark>Watkins</mark> received a silver plat"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [489.3, 1306.97, 630.17, 1794.07], "bbox_id": "de070a469e", "file": "AppomattoxNewspapers_1962-1965a_0592.pdf", "page": 1, "text": "Elizabeth . Betty Pen nix, Darnell Waahlngton. FIFTH GRADE  Rickey Fer guson. Herbert Fleshman, Gloria Culpeper, Llrtda Kaundem, Gla dyn Walker, Loretta Walker, L e a 11 e T u r n e r . Pat ricia Patterson, Frances Wood, Meressa Jones, Annie Gillts- pie, Caksel Cawthom, Bruce McCoy, Gertrude Walker, Mi ckey Ann Petty, John Lumpkins, Frank Forrest, Rickey gar- rett, Edith Patterson, Joyce Robinson, Corrlne Hubbard FOURTH GRADE  Paul McCoy, Leola Austin, Bren da Watkins, James Goode, Theo dore Pennix, Ellen Snell, Lavern Washington, Samuel Pe n n , Rosetta Rerkley. Ke n neth Oafford, Vivian Garrett, Dar lene Hudson, Marietta Pankey Coloaal Walker, LocUl Fcrg son, Nathan Snell, Velcla Lewis, Mary Wood, Marlon Austin THIRD GRADE  Marie A Booker, Juanita Hamlet. Brenda Stevens, Carolyn Booker, Donald Walker, Jessie Walker, Margie Hamlet, Rufus Robinson, Robert Harvey, Lorenza Moseley Chris topher Christian, John Harvey, Mildred Randolph, Mary Hudson Monica Branford, A1 Fontaine Johnson, Maurice Tweedy, Wen dell Ferguson, Richard McCoy Valarle Paige, Henry Robinson Cheryl White. SECDND GRADE  Tibbie Allen, Lawrence Robertson, John Scruggs, Velma Austin, Gloria McCoy, John Jones, Fred Jones, Marlon Watson, Shelia Robinson! Marilyn Washington, L a r r y Booker, James Watkins, Ernest Wade, Lacy Webb, Joyce Foster, Jacqueline Hudson, Brenda John son. Delophine Lewis. FIRST GRADE  Tony Mc Coy, Vivian Pankey, John Bailey"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Leola Austin, Bren da <mark>Watkins</mark>, <mark>James</mark> Goode, Theo dore Pennix,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Leola Austin, Bren da <mark>Watkins</mark>, <mark>James</mark> Goode, Theo dore Pennix,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [772.14, 1463.55, 931.68, 1816.14], "bbox_id": "126ca101c5", "file": "AppomattoxNewspapers_1898-1902a_0362.pdf", "page": 1, "text": "Death of Robert R. Watkins. Mr. Robert R. Watkins, a former well-known resident of this city, died on Saturday evening last at the home of his father, Mr. James Watkins, at Eviugton, Campbell county, aged 31 years. Mr. Watkins had been for a long time a sufferer from consnmp- Jon, and for many weeks prior to bis death his friends aud relatives recognized that the end was ap proaching. He had to give up his position in Lynchburg iu Februtry last, and after tha .ime his condi tion became more aud more precari ous. During the fifteen years of his residence in Lynchburg Mr. Watkins was connected with several clothing establishments, his first situation having been with the house of Simon Strause, and his last with Cunning- ham  R ad. He was welf known iu Lynchburg, and possessed here a large number of friends. The re mains were taken through Lynch burg yesterday afternoon to Spout Spring, Appomattox connty, where they will be interred by th.e side of Mr. Watkinss mother.Lynchburg News of Tuesday. Mr. Watkins was well known iu this county, where he had spent a large part of his life, and where he had many relatives."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "of his father, Mr. <mark>James</mark> <mark>Watkins</mark>, at Eviugton, Campbell county,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "of his father, Mr. <mark>James</mark> <mark>Watkins</mark>, at Eviugton, Campbell county,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [334.08, 598.62, 599.83, 839.26], "bbox_id": "c2fb6a3fef", "file": "AppomattoxNewspapers_1971-1973a_0026.pdf", "page": 1, "text": "By G. L. James The Piedmont Junior Show and Sale was held at the Lynch burg Livestock Market, August 12, 1971. Appomattox 4-Hers and FFA members really did anout- standingjob of market hog production for this years event. The exhibitors this year were James Watkins, Jr., Edward Hudson, Manley Ferguson, Brent Wasburn and Emmett Knight. These boys showed and sold twenty animals averag ing 190 lbs. each. The market price the day of the sale was 20? per pound. James Watkins was outstanding with his prize winnings pictured above 1st in a truck load of 5 2nd in pen of 3 and reserve champion pen of 3 1st with Grade 2 3rd in showmanship and 1st in this class. We are proud of these young men and their progress and results. We would like to see more young folks partici pating. This is not just a project for boys  this year a young lady from Albemarle County showed the Grand Champion and Reserve Champion --the second girl to win top honors in the 16 years of the Junior Market Show and Sale event. Again, Congratulations! James Jr. He is the son of Mr. and Mrs. James Watkins of Route 2, Concord."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "exhibitors this year were <mark>James</mark> <mark>Watkins</mark>, Jr., Edward Hudson, Manley"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "exhibitors this year were <mark>James</mark> <mark>Watkins</mark>, Jr., Edward Hudson, Manley"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.4, 985.12, 2285.86, 1057.42], "bbox_id": "e6842f4e6e", "file": "AppomattoxNewspapers_1933-1936a_0202.pdf", "page": 1, "text": "bent creek , v a . Mrs. Ida F. Marks __ _ The uarver ---- . j ers of America is being represented at the state t---, - h College, Petersburg, by James  Watkins, McKinley Tl Wright, Van Petterson wis. The  members left"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "h College, Petersburg, by <mark>James</mark>  <mark>Watkins</mark>, McKinley Tl Wright, Van"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "h College, Petersburg, by <mark>James</mark>  <mark>Watkins</mark>, McKinley Tl Wright, Van"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1783.91, 1127.53, 2030.36, 1276.96], "bbox_id": "e439aae4ce", "file": "TimesVirginian_1980a_0253.pdf", "page": 1, "text": "SATURDAY, AUGUST 16,1980 AT 1000 A.M. ON THE PREMISES PARCEL I Parcel located one mile West of the village of Evergreen, adjoining lands of Stephen Gafford, James H. Watkins and Scruggs, containing ap proximately 13.09 acres, more or less, this being a sale by the boundary and not by the acre, and being the residue of the tract conveyed to Ernest Abbitt, Jr. and Nannie Belle Abbitt, husband and wife, by deed dated September 9,1961, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Book 75, page 57."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.49, 1132.46, 1754.63, 1282.76], "bbox_id": "35a6859745", "file": "TimesVirginian_1980a_0247.pdf", "page": 1, "text": "S A T U R D A Y , A U G U ST 1 6 ,1 9 8 0 A T 10 0 0 A .M . ON T H E PREM ISES PARCEL I Parcel located one mile West of the village of Evergreen, adjoining lands of Stephen Gafford, James H. Watkins and Scruggs, containing ap proximately 13.09 acres, more or less, this being a sale by the boundary and not by the acre, and being the residue of the tract conveyed to Ernest Abbitt, Jr. and Nannie Belle Abbitt, husband and wife, by deed dated September 9,1961, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Book75, page 57. ."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1878.24, 452.06, 2016.94, 956.93], "bbox_id": "643c1467dd", "file": "AppomattoxNewspapers_1974-1975a_0180.pdf", "page": 1, "text": "reaved. May God ever be with them for strength, and comfort. We trust that Sister Ella Brown is still on the road to recovery. We talked with Sister Harris, she was fair, and in good spirit Sunday. In and out of town Mr. James Harvey Watkins has returned to his home in Baltimore, Md. after spending the first week here in Historic Appomattox, Va., after the passing of the late Deacon Hamlet, his brother-in-law. Mrs. Erner W. Moal of Pfeifers Rd., Bradshaw, Md., spent the second week here with her sister, Mrs. T. W. Hamlet, returned to her home Satur day. Mr. Jamie Thornton of Philadelphia, Pa. is spending sometime here with his aunt, Mrs. T. W. Hamlet. We trust that Mr. Thornton will enjoy our big city while here. Mr. Herbert Fleshman the son of Mr. and Mrs. Evan Fleshman is spending the week end with parents and other relatives here in Appomattox for the week end. Mr. Flesh man is a student at St. Pauls College, Lawrenceville, Va. The Fleshmans younger son, Raymond is a student in the Community College, Lynch burg, Va. We are hoping for the boys much success in their college work. Mr. and Mrs. George Martin, Sr. have returned to their home here, after attending the funeral service of a very dear friend, and fraternity brother, over the week end in Brooklyn, N.Y.  See you next week!!!"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "out of town Mr. <mark>James</mark> Harvey <mark>Watkins</mark> has returned to his"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "out of town Mr. <mark>James</mark> Harvey <mark>Watkins</mark> has returned to his"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [341.5, 632.74, 483.48, 644.24], "bbox_id": "a39778d256", "file": "AppomattoxNewspapers_1971-1973a_0107.pdf", "page": 1, "text": "MRS. JAMES E. WATKINS"}, "highlight": {"text": {"matched_tokens": ["JAMES", "WATKINS"], "snippet": "MRS. <mark>JAMES</mark> E. <mark>WATKINS</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["JAMES", "WATKINS"], "snippet": "MRS. <mark>JAMES</mark> E. <mark>WATKINS</mark>"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.63, 603.84, 1717.78, 781.63], "bbox_id": "043dd450e7", "file": "AppomattoxNewspapers_1971-1973a_0512.pdf", "page": 1, "text": "James E. Watkins of Concord has been notified of the death of his mother-in-law, Mrs. Florence Flossie West. She died Tuesday, October 31, 1972, in Baltimore. Born in Appomattox, sie is survived by four daughters, Mrs. Frances Veney, Mrs. Maxine Johnson and Mrs. Fannie Watkins of Baltimore and Mrs. Lorene Wilson of Philadelphia. Funeral services were con ducted at noon Saturday in Baltimore."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "<mark>James</mark> E. <mark>Watkins</mark> of Concord has been"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "<mark>James</mark> E. <mark>Watkins</mark> of Concord has been"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.78, 365.42, 1774.3, 603.41], "bbox_id": "72d377d0e9", "file": "TimesVirginian_1980a_0260.pdf", "page": 1, "text": "By virtue of Decree entered by .the Circuit Court of Ap pomattox County, Virginia on the 21st day of July, 1980, in the Chancery cause of Commonwealth of Virginia etc. v. Nannie Belle Abbitt, the undersigned will offer for sale the hereinbelow described parcels of real estate, located fan Clover Hill Magisterial District of Appomat tox County, Virginia about 2A miles East of the Town of Appomattox, near Evergreen. SATURDAYAUGUST 16,1980 AT 1000 A.M. ON THE PREMISES PARCEL I Parcel located one mile West of the village of Evergreen, adjoining lands of Stephen Gafford, James H. Watkins and Scruggs, containing ap proximately 13.09 acres, more or less, this being a sale by the boundary and not by thè acre, and being the residue of the tract conveyed to Ernest Abbitt, Jr. and Nannie Belle Abbitt, husband and wife, by deed dated September 9,1961, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Book 75, page 57."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "lands of Stephen Gafford, <mark>James</mark> H. <mark>Watkins</mark> and Scruggs, containing ap"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.25, 1721.87, 1903.11, 1794.76], "bbox_id": "07acd8c98b", "file": "AppomattoxNewspapers_1962-1965a_0164.pdf", "page": 1, "text": "are Nancy Jo Kidd, John Harrison. Mary Lou Jamerson, Elizabeth Evans, Tony Mann, Ann Martin, and Jean Page Maddox. In the third row Jacqueline Sarvcr, Brenda Nash, Rachel Snow. Mary McClenny, Betty Watson, Bar bara Thomas, Mary Watkins Booth. James Whitehead, Amy Moore, and Joyce Toiley."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Bar bara Thomas, Mary <mark>Watkins</mark> Booth. <mark>James</mark> Whitehead, Amy Moore, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Bar bara Thomas, Mary <mark>Watkins</mark> Booth. <mark>James</mark> Whitehead, Amy Moore, and"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2183.5, 487.72, 2349.0, 631.17], "bbox_id": "43879296d5", "file": "AppomattoxNewspapers_1939-1943a_0466.pdf", "page": 1, "text": "A large crowd attended the spec ial service at the Chestnut Grove Baptist church last Sunday. Rev. Yates, pastor of the Galilee Baptist church was the guest speaker. The church choir rendered special music. Ihe results of the rally that day amounted to 62.00. Rev. Price is pastor of the church. The following friends were here for the week-end Miss Lillie Clay- tor, Howard Stephens, Peter Flood, James H. Watkins, Thomas Patter son, Mr.and Mrs. Otis Patterson and Miss Ingram."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Howard Stephens, Peter Flood, <mark>James</mark> H. <mark>Watkins</mark>, Thomas Patter son, Mr.and"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Howard Stephens, Peter Flood, <mark>James</mark> H. <mark>Watkins</mark>, Thomas Patter son, Mr.and"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [685.44, 503.83, 857.56, 805.68], "bbox_id": "88607cdea1", "file": "AppomattoxNewspapers_1949-1952a_0294.pdf", "page": 1, "text": "A large crowd attended the regu lar pleaching services at the First  Baptist Church Sunday. The pastor , preached an inspiring sermon. Madame Minnie W. Allen and the Jericho Gospel Singers will appear l in a musical program at the Mount Airy Baptist Church on the fourth  Sunday in February at 730. Impressive services were held at the Mount Shiloh Baptist Church last Sunday morning. The pastor de-  livered a special message. The public is invited to worship at the Galilee Baptist Church this  Sunday morning. Walker Jordan is ill at this time. He is receiving treatment at the 1 home of his sister, Mrs Price. The Western Federation of New! Farmers of America will hold a bus iness meeting at the Carver Hign School Friday at 1 P. M. Rev. and Mrs. R. Q. Lawmg and! family were Sunday dinner guests I of Mr. and Mrs. Charlie Tanner. Mrs. Theda Harris and Robert Tnn-J nor were also dinner guests. James H. Watkins, of Baltimore, and his brother, Vance spent the Week-end here with their father."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "were also dinner guests. <mark>James</mark> H. <mark>Watkins</mark>, of Baltimore, and his"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "were also dinner guests. <mark>James</mark> H. <mark>Watkins</mark>, of Baltimore, and his"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [515.7, 1345.25, 1178.13, 1770.71], "bbox_id": "a20cefb6b6", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "T-401 Charles Spurgeon Jenkins JrYV 402 Eldridge Colman Martin YV T-403 James Edward Thornton YV 404 John Newton Herbert N T-405 William Marshall Mitchell W T-406 Aubrey Tyler Fleshman W . T-407 Horace Dillard Baker W  lT-408 Burley Braxton Harris W 1 T-409 McKinley Thorn to. N 410 Jefferson Badgky K. mey W T-411 Charlie Friend Johnston W YV .-257 Jrmes Gilbert Dinkins YV 413 Thomas Melven Jameson W T-258 James E. Carter N 414 Richard Drew Coleman W T-2 59 Edward Lee Thomas w 415 Frank Edwards N T-260 Rhony Lee Wdson YV 416 Vincent Williams Collins W 261 Robert Elliott rlarvey N T-417 Homer Wert Blackwell W T-2 62 Alexander Franklin W T-418 James Howard Pryor N 263 B.njamin Currv Harvey VV 419 Randolph Peyton Marsh W .-204 Brauiey Whitney Wingfield W T-420 Leroy Prce Smith W 265 S.erling Richaio Gallier w T-4 21 Richard Daniel Ivash YV 266 D.ivid Herod Cyrus w 422 Edward Birkhead W 267 James Freeman Carl N T-423 Lonnie Christian Reynolds W 1-268 Willard Asnburn  .rvir.g YV T-424 Watt Hugh Stai  Jy w T-2 06 Joseph Rufus Burnetta W 425 Elmer Alexandra Ferguson N T-2 70 Graydon Cleveland Max.we11W T-426 Walter Alexander Beasley N T-271 Howard Maurice Gilbert w 427 Robert Lee Davis N T-2 2 Hazekiah Megginscn N 428 Clem Hancock OBrien W 273 Murry Rufus Austin N 429 Hrvin Pennix N 1-274 Willie Abbitt N T-430 MilPrd Vernon Harvey VY .-276 John Esmond Pugh YV T-431 Mabie Junior Carter W r-276 Jchn Henry Spiggle YV T-432 Warren Washington Gibbs N .-277 Henry James Fleshman YV 433 Jessie Melvin Moore W 278 Chap Ray mood Garrett YV T-434 John Richard E. Dennis N 279 Jack McCoy N 435 Joe Earl Case W -a80 Russell Hatchette Eagle V. 436 Lewis Bates Turner VV T-281 Robert Lee Jackson N 437 Roy Musgrove Phelps w 282 Lyle Bernard Thomas W 438 Hubert Lee Price w 283 Jasper Warded Watkins N 439 James Silas Cox N 284  i homas Clarence Moore N 440 Charlie Averette w 285 McKinley Culpepper N T-441 Ernest Gibbs Johnson w T-2 8 6 Charlie Jackson N 442 Benny Petty N 287 Louis Watkins N 443 Warren Garland Crews W 288 Harry Hornsey Hamilton W T-444 Wallace Edward BandurantW -289 Harry Thomas Ferguson W T-445 Walker Clarke Moore w 290 R ymond Walker N 466 Jeff Saundra N T-291 Harold YTernon Taylor N --447 Abraham Lincoln Gobble w P ERFECT for spring is this jacket dress festured in the March issue of Good Housekeeping Magazine. Navy sheer rayon-crepe dress with ruffled rayon-taffeta collar and cuffs, short buttoned-up jacket front pleats in the skirt."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "w 283 Jasper Warded <mark>Watkins</mark> N 439 <mark>James</mark> Silas Cox N 284"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "w 283 Jasper Warded <mark>Watkins</mark> N 439 <mark>James</mark> Silas Cox N 284"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1732.55, 590.61, 1899.7, 956.56], "bbox_id": "bfabfa6210", "file": "AppomattoxNewspapers_1912-1915a_0519.pdf", "page": 1, "text": "Mrs. Mecca b. Childress, wife of Mr. Dallas Childress, died at tier home near Pamplin on Monday evening, March 8th, at 430 p. m. in the 69rh year of tier age. She has been a constant sufferer for 80 vearo or more and had been oon- flned to her bed for about four months. She was a member of Matthews Baptist Chnroh at H ix burg nd died trusting in her Savi our. Besides her husband she is survived by one son and five daugh ters, Mr. E. L. Ooijdreas, Mrs. W. B. Hubbard, Mrs. R. W. Bristow, Mrs. S. h . Cheadle, and Mrs. J . R. Meadows, of this County, and Mrs. J. W. Meadows, of Abingdon, Va. AJso one sister, Miss Ella Watkins, and two bro.hers, Messrs. James and Frank Watkins. - Interment was made in the old family burying ground on the old John Henry Marshall place near Hixbnrg on Tuesd-y evening at 330, servioe being conducted by her pastor. The deceased had many friends and relatives in this county as well as Charlotte, who will regret to hear of her death."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "and two bro.hers, Messrs. <mark>James</mark> and Frank <mark>Watkins</mark>. - Interment was made in"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "and two bro.hers, Messrs. <mark>James</mark> and Frank <mark>Watkins</mark>. - Interment was made in"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2330.84, 589.12, 2483.7, 1082.0], "bbox_id": "a4d0da9501", "file": "AppomattoxNewspapers_1962-1965a_0164.pdf", "page": 1, "text": "Twenty - one seniors have been named Honor Students by Ap pomattox High School, as they close out twelve years of study in commencement exercises scheduled for June 5. About ten of the twenty - one have college plans with the remainder plann ing on business, nursing, or homemaking careers. Top Four Principal Frank C h uc h e k stresses the fact that scholarship is important, but that exact rating as far as grades are concerned is a difficult thing to determine. He pointed out that all of the top four graduates, Marlene Barger, Joan Moses Gaynell Thompson, and Suzanne Gills, have had very good grades and made real achievement in their school careers thus far. Only a hair - line separates them Insofar as rank in the class is concerned, he said, and we think of our graduates as people not numbers. Senior Events The Junior - Senior prom will be held tomorrow night, Friday, at the gymnasium. Baccalaure ate Service will be held at Lib erty Baptist Church June 2, with Rev. O. D. Moore delivering the address. A Senior Banquet is be ing planned, as well as Class Day, with Commencement exer cises in the school auditorium the evening ef June 5. The first twenty  one in the class of 78 are as follows! Mar lene Bargers Joan Moses, Gay nell Thompson, Sueanne Qills. Itancy .-John ..Harrioon. M mv fjlpllamerson. Eiivabeth Evans, Tony MMp, Ann Martin, Joyce Tolley, Mary McClenny, Jean Maddox .Barbara Thomas, Brenda Nash, Jacqueline Sarv- er, Rachel Snow, Betty Watson, Amy Moore, James Whitehead, and Mary Watkins Booth."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Betty Watson, Amy Moore, <mark>James</mark> Whitehead, and Mary <mark>Watkins</mark> Booth."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Betty Watson, Amy Moore, <mark>James</mark> Whitehead, and Mary <mark>Watkins</mark> Booth."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [694.77, 293.13, 861.84, 2004.83], "bbox_id": "02ae436ebd", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "The Senatorial Convention Nominates H. D. Flood by AcclamationThe Buckingham and Cumberland Dem ocrats Nominate E. W. Hubard for the House of DelegatesSenator Martin Endorsed. Promptly at the appointed hour, Chairman V. E. Pratt, of the Buck ingham Democracy, called to order the convention of the Eighteenth senatorial district Iu the courthouse ou Monday. The convention organ ized by electing Dr. Pratt chairman and W. W. Haskins secretary. This organization was made permanent. The chair appointed the follow ing committee on credentials Frank Moon, of Buckingham Paul Pettit, f Fluvanna Joel Watkins, of Ap pomattox. The committee reported!he fol lowing delegates present and end- lied to stats in the convention BuckinghamFailed to get the names of these delegates. AppomattoxJoel Watkins, A. II. Clement, James B. Abbitt, II. 8. Coleman, A. B. Thornhill, J. W. Davidson, W. F. Wright. FluvannaA. A. Gray, Paul Pet- dt, C. B. Wood, W. C. White, W. F. Snead. Mr. A. A. Gray, of Fluvanna, then nominated Hon. H. D. Flood to suc ceed himself as Senator from this district, iu a speech which was well received, by the audience, and which elicited much applause, showing plainly that the audience endorsed his eulogistic remarks on Mr. Flood and his record as a representative. Mr. Gray is a pleasant speaker, aud his remarks were timely and highly appreciative. Mr, A. B. Thornhill, of Appomat tox, in a beautiful speech, seconded the nomination of Mr. Flood. He referred to the magnanimity with which Mr. Flood refused the certifi cate of election to Congress in 1896, and presented figures showing that iie received 4,000 more votes than diu Mr. Tucker in 1894, and 6,000 more than did Mr. Quarles in 1898. Mr. Thornhills remarks made a good impressiou, and he was the re cipient of congratulations upon his peech. Messrs. F. C. Moon and Ednt. W. Hubard, ou the part of Bucking ham, made short speeches seconding the nomination. At the conclusion of these speech es Mr. Paul Pettit moved that the nomination be made by acclamation, which was adopted, and the chair appointed Messrs. Gray, Thornhill, and Hubard to iuform Mr. Flood of his nomination, and to present him to the convention. Mr. Flood accepted the nomina tion in a speech of twenty minutes, which aroused much enthusiasm. He assured the peopie of his appie- fiaaou of the honor conferred, and of their endorsement and loyalty, to him and his public acts. He spoke earnestly of the faithful service to the laboring people of Virginia ren dered by Senator Martin, aud of the light he made for him in the Demo cratic caucus six years ago, assuring the Democracy of Virginia that, if- they would lay the mantle of the seuatorship upon Mr. Martin at that time, the Democracy of the Old Do minion would approve their action. Mr. Flood referred to the large ma jority of counties having gone for Senator Martin as proving the truth of his prediction, and said that Mr. Martin would be renominated by a four-fifths majority. At the con clusion of his speech he was pre sented wit-h a bouquet of beautiful flowers. Mr. F. 0. Moon offered the follow ing resolutions, which weie unani mously adopted Resolved, That the course of Hon. T. S. Martin, United States Senator, is fully endorsed and approved and the nomiuee of this convention is in structed to vote for and support Him for re-election to that position. . 2d, That the tiominee of this con vention is instructed to vote for and support Hon. George J. Hundley for re-electiou as Judge of this judicial circuit. Mr. W. W. Haskins said that he was instructed by the Maysville-dis- trict meeting to bring up the ques tion of moving the courthouse aud the nominee was instructed to op pose any movement looking to the removal of the courthouse. The senatorial convention then adjourned, and the house conven tion, composed of delegates from Buckingham and Cumberland, as sembled for the purpose of nomi nating a candidate for the House of Delegates. Dr. Pratt and Mr. Haskins were retained as chairman and secretary, respectively, of the convention.  W. M. Smith, of Cumberland, and F. C. Moon, of Buckingham, were appotiled a committee on creden tials, who reported the following delegates present and entitled to scats in the cony.epjbj.Qn t CumberlandW. if. South, H. D. Woodson. H. K. Adams, E. B. Davis, A. B. Armstrong, and J. W. Adams. BuckinghamWe are nnable to give the names of these delegates. F. C. Moon uommated Hon. E. W. Ilubar.t for delegate to the General Assembly from tjiis district, com posed of Buckingham an,d Cumber land counties, Mr. W. M. Smith, of Cumberland, in a few well chosen remarks, sec onded the nomination. Mr. John W. Adams moved that it be made by acclamation, which was done with a whoop. Sfr. Hubard was informed of his nonuuatiQQ, and was presented to the convention for a speech. Mr. Hubard made onj ?fp t his h.ap-i py speeches, full of logic and rea-! sou. He was severe on independ ents, and promised that the flag of Democracy should not trail in the dust, aud predicted a great victory fojt tjie party at the general election. He appealed ty his hearers with much force io si an cl by fthe nomi nees, saying it was not now afight, of Flood and Hubard, but a fight for the supremacy of Democratic"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "of these delegates. AppomattoxJoel <mark>Watkins</mark>, A. II. Clement, <mark>James</mark> B. Abbitt, II. 8."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "of these delegates. AppomattoxJoel <mark>Watkins</mark>, A. II. Clement, <mark>James</mark> B. Abbitt, II. 8."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [772.54, 1588.06, 943.41, 1708.45], "bbox_id": "a96133eb90", "file": "AppomattoxNewspapers_1960-1962b_0676.pdf", "page": 1, "text": "The Piedmont Youth Exposition was held in Lynchburg at the Live stock Market. The Apppmattox 4-H boys and girls participating in this project Market Hogs, w eer Mary Webb, Buck James, Lloyd Forest. Bobby Watkins, Jesse Lewis, Win fred Tweedy, Nathaniel Meggin- on, eStwart Robinson and Simon Walker. The 4-JTers raised and prepared 21 hogs for market over the six monthg growing period."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "eer Mary Webb, Buck <mark>James</mark>, Lloyd Forest. Bobby <mark>Watkins</mark>, Jesse Lewis, Win fred"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "eer Mary Webb, Buck <mark>James</mark>, Lloyd Forest. Bobby <mark>Watkins</mark>, Jesse Lewis, Win fred"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [562.78, 227.44, 704.87, 506.74], "bbox_id": "7f57fb2204", "file": "AppomattoxNewspapers_1962-1965a_0240.pdf", "page": 1, "text": "featuring appropriate music and reading of he scripvures. The following Young Ptoplo of the church will enter-or re-enter col lege next week  Peny Abbitt, Tommy Ashworth, Emily Wood Burke, Bill Caldwell, Dan Cole man, Harold Conner, Jane Mar tin, Myron Richardson, Freddie Wingfield, Robert Carter, Sam Kerr, Catherine Richardson, Nan cy Chandler, Mary Watkins Booth Barbara Thomas, James White- head and Randolph Smith. Calendar of Activities SUNDAY 945 a.m. Sunday School 1100 a.m. Worship  The One Needful Thing Phil. 313-14 600 p.m. Celestial Choir 630 p.m. Training Union MONDAY 730 p.m. Worship  Observance of the Lords Supper. 730 p.m. Training Union Group meeting at Spout Spring WEDNESDAY 330 p.m. Carol Choir 630 p.m. Concord Choir"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Nan cy Chandler, Mary <mark>Watkins</mark> Booth Barbara Thomas, <mark>James</mark> White- head and Randolph"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Nan cy Chandler, Mary <mark>Watkins</mark> Booth Barbara Thomas, <mark>James</mark> White- head and Randolph"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [724.54, 416.93, 890.31, 465.33], "bbox_id": "98adddbf5d", "file": "AppomattoxNewspapers_1949-1952a_0342.pdf", "page": 1, "text": "The eighth grade boys were the honored recipients. They were Ed die Lilly, James Pennix, Curtis Whitted, Allen Watkins and Willie Lilly."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "The eighth grade boys were the honored recipients. They were Ed die Lilly, <mark>James</mark> Pennix, Curtis Whitted, Allen <mark>Watkins</mark> and Willie Lilly."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "The eighth grade boys were the honored recipients. They were Ed die Lilly, <mark>James</mark> Pennix, Curtis Whitted, Allen <mark>Watkins</mark> and Willie Lilly."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.98, 382.08, 1857.77, 972.16], "bbox_id": "490c230c49", "file": "TimesVirginian_1978_0545.pdf", "page": 1, "text": "perform in the county show include Jennifer Coleman, Dana Lee, Monica Stratton, and Ann Paige Nolen, Darlene Ferguson, Jennifer Burke, Cheryl Austin, Joanne Jaraer- son, Nancy Cote and Lisa Williamson, Anne Hancock, J. T. Carter, Emily Shea, Leslie and Suzette Ran son, Regina Watkins, Sandy Walton and Tammy Martin, Donna Dicker- son, June Jenkins, Scott Drinkard, Joanie Canada and James Beaty, Lisa Ferguson, Marlene Watkins, Sandra Wat kins and Delisa Watkins, Anita Harvey and Karen Stevens, Mike McCoy and Malcolm Miller. In addition to the above 4-Hers, the following members participated in Share-the-Fun this year. Each person received ribbon awards based on the Danish system Todd Nash, Barry Hamlett, Maria King, Chuck Womack, Jeff Miller, Jody Williams, Blair Smith, Virginia Crews, Lisa Coleman, Harold Vassar, Sherry Vassar, Steve Hamfott, Allen Hamlett, Eve Thomas, Cynthia Johnson, M arie Doss, Mike M artin, Gwyn Dalton, and Jeff Drink ard. Also Gina McCormick, Pam Sellers, Jill Neally, Becky Bass, Sally Coleman, Tracy Fitch, Terrilynn Moore, Traci Sch- mutz, JoAnn Wooding, Mike Knight, R. D. Hudson, Dawn Dawson, Barbara oDonnell, M aureen ODonnell, Duane Hamlett, Janice Abernathy, Cindy Clark, and Tina Moore. Also Renee M arsh, Jeff Williams! Darrell Conner, Lisa Campbell, Stephanie Martin, Renee Ham s, Nancy Wool dridge, Mike Hansen, Steven Woods, Jeff Chauncey, Alex Almond, Lee Drinkard, Brett . Mar stem .Billy Carter, Chattel Harvey, Teresa Austin, Beraly"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Drinkard, Joanie Canada and <mark>James</mark> Beaty, Lisa Ferguson, Marlene <mark>Watkins</mark>, Sandra Wat kins and"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Drinkard, Joanie Canada and <mark>James</mark> Beaty, Lisa Ferguson, Marlene <mark>Watkins</mark>, Sandra Wat kins and"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [297.57, 918.28, 629.12, 1063.88], "bbox_id": "5e1781db31", "file": "AppomattoxNewspapers_1933-1936a_0347.pdf", "page": 1, "text": "Misses Corine Hancock and o Frankie McKinney aid Watkins. ...W- .M. Berry Jessie James and M Abbitt and C H Swing are at Mr. and Mrs Eddie Moore and tending the football game in Rich- daugbiei. anil Jones Loy, of Al mond todays   . goma, W. Va., spent several days o last week with Mrs. Mollie Moore. Miss Rebecca Harvey, of Lynch- Wbi,e here they enjoyed several  burg, and J F Harvey, of Hopewell days of hunting- are spending the liday8 here. ... C, D. Diggs, 7 f lrmville, spent Mrs. D. A Sorrell and Mrs Clay- Mo,dPy in town, tot Carpenter, of Durham. N. C. , ,,  t T spent Saturday with Mrs. J F Har . r anc  rs JeI Flood, Mr. and vey. They were accompanied home   .!I ________  ______ by Mrs. Baxter Carlton and chilHran. i .  _lrrrf who have been visiting here. t"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "o Frankie McKinney aid <mark>Watkins</mark>. ...W- .M. Berry Jessie <mark>James</mark> and M Abbitt and"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "o Frankie McKinney aid <mark>Watkins</mark>. ...W- .M. Berry Jessie <mark>James</mark> and M Abbitt and"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1287.33, 1017.77, 1594.75, 1039.67], "bbox_id": "87ee67fad7", "file": "AppomattoxNewspapers_1905-1912a_0209.pdf", "page": 1, "text": "ju  e of til? piaceG. w. Biam, post- 0 f his daughter, Stella Watkins, to Guinea mihs . ! Mr. James Blair Wilson, Wednes-"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "ju  e of til? piaceG. w. Biam, post- 0 f his daughter, Stella <mark>Watkins</mark>, to Guinea mihs . ! Mr. <mark>James</mark> Blair Wilson, Wednes-"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "ju  e of til? piaceG. w. Biam, post- 0 f his daughter, Stella <mark>Watkins</mark>, to Guinea mihs . ! Mr. <mark>James</mark> Blair Wilson, Wednes-"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1507.9, 709.31, 1655.01, 979.5], "bbox_id": "07e233d2e4", "file": "TimesVirginian_1980a_0167.pdf", "page": 1, "text": "Herman L. Lee Thomas A. Owen Phillip B. Swan Campbell W. Teeter Melvin M. Watkins Melvin Watson WAR n James D. Lee David R. Mayberry Raymond Moore Ernest Morgan William R. Morris . Charlie Nelson NoelO. Price James W. Roberts, Jr. Winford J. Rush - James T. St. John Thomas A. Trent AlUm D. Turner Cloice M a . Turner VIETNAM WAR Fred Henry Patterson Calvin Coolidge Tolley, Jr. Curtis Whitted Roger W. Grubbs"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "W. Teeter Melvin M. <mark>Watkins</mark> Melvin Watson WAR n <mark>James</mark> D. Lee David R."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "W. Teeter Melvin M. <mark>Watkins</mark> Melvin Watson WAR n <mark>James</mark> D. Lee David R."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [555.64, 1154.88, 719.52, 1203.23], "bbox_id": "88c82dd6ba", "file": "AppomattoxNewspapers_1952-1954a_0202.pdf", "page": 1, "text": "Guests of the Watkins and Ham let family over the week-end were 2nd Lt. Hubert Watkins, Fort Lee, and Pvt. James Hakws, of Buffalo, N. Y., stationed at Camp Pickett."}, "highlight": {"text": {"matched_tokens": ["Watkins", "Watkins", "James"], "snippet": "Guests of the <mark>Watkins</mark> and Ham let family over the week-end were 2nd Lt. Hubert <mark>Watkins</mark>, Fort Lee, and Pvt. <mark>James</mark> Hakws, of Buffalo, N. Y., stationed at Camp Pickett."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "Watkins", "James"], "snippet": "Guests of the <mark>Watkins</mark> and Ham let family over the week-end were 2nd Lt. Hubert <mark>Watkins</mark>, Fort Lee, and Pvt. <mark>James</mark> Hakws, of Buffalo, N. Y., stationed at Camp Pickett."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1432.31, 562.16, 1591.36, 701.95], "bbox_id": "076d58460e", "file": "AppomattoxNewspapers_1902-1905a_0495.pdf", "page": 1, "text": "B o ll o f H o n o r. The following pupils of New Gold Hill School are on the Honor Roll for tbe sixth month ending the 7th inst. Katherine Watkins, Beulah Walden, Hattie Fore, James Walden, Pauline Ooleman, Annie Fore, John Fore, Letherine Fergu son, Bayard Coleman, William J. Watkins, Frank Coleman, Willie Colemm, Aubrey Wtbb. E. V H a r d y , Teacher."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "the 7th inst. Katherine <mark>Watkins</mark>, Beulah Walden, Hattie Fore, <mark>James</mark> Walden, Pauline Ooleman, Annie"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "the 7th inst. Katherine <mark>Watkins</mark>, Beulah Walden, Hattie Fore, <mark>James</mark> Walden, Pauline Ooleman, Annie"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1499.5, 1055.33, 1822.4, 1328.37], "bbox_id": "b1c460ef59", "file": "AppomattoxNewspapers_1933-1936a_0214.pdf", "page": 1, "text": "1 JS 1 George Abbitt IV, Butler Lbngworth, George Woolridge, Billy Hubbard, John Booth, R. L. Bdtfke Jr., Ned LeGrande, Thel- bert Trent, Charles Gregory. Socialites . ...................................................... Catherine Gills and others v Worker .......................................... ......................... Lucile Cralle Irs. Katherine K elly ............... ................................. Mrs. Charlie Moses ack G regory.............................. .... . .. .. . ............ James Langran Jol. Jan Gregory . ........................ .. .. .. . Watkins M. Abbitt irs. McKenzie . .  ............................. .. .. , . .. Mrs. George Langran estryman , , .. . ...................................... .... ............... .. W. W. Scott .ector- . ,. . . . . ,. , .  ......... Alfred Harwood Jr. vlephistopheles ............ . ........................................................ T. M Trent outh    ................................................................. .. .. .. W. T. Smith -Jeopatria .. .. .. .. . ..........................................Nellie Moses Dresser j vstarte........................................................ .... .. ., .. Elaine McDearmon .ais ,, ... . .......................................... .. .................... .. Emily Harvey   . ........................... ......................... Calla Babcock Cates Ballenni Dorothy Lucado, Virginia Cralle, Pat Sean, Virginia Moses, Polly Furbush, Marjorie Evans, Katherine Burge, Elizabeth Cralle. Singer Anna Jones, Kathleen Caldwell, Phoebe OBrien, Calla Cates, Florence Trent, Eiizabeth Ford, Sara Caldwell, Louise Gills, Kate Franklin, Don Moses Sr., Butler Longworth, W. W. Scott. Choruses Bamberg  9 Nymphs and Fauns Schumanns Gipsies Mend elssohns On Musics Wings OMiearas Summer Fan.es Rossinis In flammatus est Strauss-Spick lers Soldiers Chorus. Ballet Nym phs and Fauns. Temptation of Youth."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Moses ack G regory.............................. .... . .. .. . ............ <mark>James</mark> Langran Jol. Jan Gregory . ........................ .. .. .. . <mark>Watkins</mark> M. Abbitt irs. McKenzie"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Moses ack G regory.............................. .... . .. .. . ............ <mark>James</mark> Langran Jol. Jan Gregory . ........................ .. .. .. . <mark>Watkins</mark> M. Abbitt irs. McKenzie"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1503.1, 1049.64, 1824.79, 1245.88], "bbox_id": "66c0777a09", "file": "AppomattoxNewspapers_1933-1936a_0210.pdf", "page": 1, "text": "Unlisted men George Abbitt IV, Butler Longwortih, George Woolridge, Billy Hubbard, John Booth, R. L. Burke Jr., Ned LeGrande, Thel- bert Trent, Charles Gregory. Socialites .........................................  .................. Catherine Gills and others C W ork er ............................................................. ..................... Lucile Cralle Irs. Katherine K e lly ...................................................... Mrs. Charlie Moses ack G reg o ry ............................................... .. .. . ............. James Langran ol. Jan G regory................ .. ..................................... Watkins M. Abbitt Irs. M cK enzie........................................ .. . . . . .. Mrs. George Langran  estrym an........................................................................... .. TV. W. Scott le c t o r ................................................... .. . . . . . . . Alfred Harwood Jr. Mephistopheles...................................................... .. .. .  . . . . . T. M. Trent tfouth . . . . ....................................................... .. . .   W. T. Smith Jleopatria ....................................................... , . . . . Nellie Moses Dresser . ................................................................................. ..   .  Elaine McDearmom ,a ig ............... .. . ............................ .. . .................... Emily Harvey Margherita   . . ..  . . . . . .  . . . . Calla Babcock Cates Ballerini Dorothy Lucado, Virginia Cralle, Pat Sear3, Virginia Moses, Polly Furbush, Marjorie Evans, Katherine Burge, Elizabeth Cralle."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "G reg o ry ............................................... .. .. . ............. <mark>James</mark> Langran ol. Jan G regory................ .. ..................................... <mark>Watkins</mark> M. Abbitt Irs. M"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "G reg o ry ............................................... .. .. . ............. <mark>James</mark> Langran ol. Jan G regory................ .. ..................................... <mark>Watkins</mark> M. Abbitt Irs. M"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [738.67, 1013.98, 877.11, 1064.97], "bbox_id": "d1a02db28c", "file": "AppomattoxNewspapers_1974-1975a_0470.pdf", "page": 1, "text": "Rev. George Watkins, will preach at the St. James ÂME Church at Prospect on Sunday, October 19, at 00 In the afternoon."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Rev. George <mark>Watkins</mark>, will preach at the St. <mark>James</mark> ÂME Church at Prospect on Sunday, October 19, at 00 In the afternoon."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Rev. George <mark>Watkins</mark>, will preach at the St. <mark>James</mark> ÂME Church at Prospect on Sunday, October 19, at 00 In the afternoon."}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.45, 1668.11, 1993.61, 1780.98], "bbox_id": "07f6ece47b", "file": "TimesVirginian_1983a_0190.pdf", "page": 1, "text": "Oakville area - 3 BR - Cape Code, 1 bath, basement, garden, fruit trees.  firewood, 4.07 acres. 29,500. SALES ASSOCIATES J0MR l. WILSON 352-259 AppwMrttox RICKY MUTT 376-5057 Brooknool JAMES C. SIFTER 552-7543 Appt ttex WATKINS M. ABBITT JB. 93-4599 GM sttot"}, "highlight": {"text": {"matched_tokens": ["JAMES", "WATKINS"], "snippet": "RICKY MUTT 376-5057 Brooknool <mark>JAMES</mark> C. SIFTER 552-7543 Appt ttex <mark>WATKINS</mark> M. ABBITT JB. 93-4599"}}, "highlights": [{"field": "text", "matched_tokens": ["JAMES", "WATKINS"], "snippet": "RICKY MUTT 376-5057 Brooknool <mark>JAMES</mark> C. SIFTER 552-7543 Appt ttex <mark>WATKINS</mark> M. ABBITT JB. 93-4599"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2279.74, 174.64, 2429.02, 239.39], "bbox_id": "ad6759931f", "file": "TimesVirginian_1976_0299.pdf", "page": 1, "text": "during the week. The scouts  attending were Kurt Green- baum, Billy Hammock, Ronald Reed, Sylvester Watkins, Allen Hamlett, Mike Carmody and James Ferguson."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "during the week. The scouts  attending were Kurt Green- baum, Billy Hammock, Ronald Reed, Sylvester <mark>Watkins</mark>, Allen Hamlett, Mike Carmody and <mark>James</mark> Ferguson."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "during the week. The scouts  attending were Kurt Green- baum, Billy Hammock, Ronald Reed, Sylvester <mark>Watkins</mark>, Allen Hamlett, Mike Carmody and <mark>James</mark> Ferguson."}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2322.99, 692.61, 2468.55, 1103.88], "bbox_id": "7a8913e143", "file": "AppomattoxNewspapers_1971-1973a_0373.pdf", "page": 1, "text": "The marriage of Miss Linda Jo Watkins to Herbert Lawren ce Shirey took place the after noon of June 24 at 4 oclock in Rustburg Baptist Church in Rustburg. The bride is the daughter of Mr. and Mrs. Otis Lee Watkins, Jr. of Rustburg. The bride groom is the son of Mr. and Mrs. Horace White Shirey of Spout Spring. The Rev. Charles E. ORoark, pastor of the church, officiated at the double ring ceremony. The bride was escorted and given in marriage by her father. Mrs. Edward L. Watkins of Rustburg wa s her sister-in- laws matron of honor. Brides maids were Mrs. Laura P. Emerson of Rustburg, cousin of the bride Mrs. Lewis C. Booth of Concord Mrs. A. J. Wilson of Pembroke. Miss Eve Marie Emerson of Rustburg, cousin of the bride, was junior brides maid. Miss Rhonda Faye Wat kins and Miss Melissa Kaye Watkins of Rustburg, nieces of the bride, were flower girls. Mr. Shirey was his sons best man. Ushers were Edward L. Watkins of Rustburg, brother of the bride James E. Shirey of Arlington, brother of the groom Eugene W. Shirey of Lynchburg, brother of the groom and Geo rge H. Sumpter, HI of Lynch-"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Ushers were Edward L. <mark>Watkins</mark> of Rustburg, brother of the bride <mark>James</mark> E. Shirey of Arlington,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Ushers were Edward L. <mark>Watkins</mark> of Rustburg, brother of the bride <mark>James</mark> E. Shirey of Arlington,"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1664.4, 1305.88, 1827.2, 1442.38], "bbox_id": "38490176dc", "file": "AppomattoxNewspapers_1933-1936a_0395.pdf", "page": 1, "text": "The Hi Y organization was re presented at the Lynchburg and vicinity Youth conference held at the Rivermont Baptist church, by McKinley Tibbs, Vaes Watkins and Garfield Wright. Professor Lawing and James Flood accom panied the delegates Sunday. Miss Lillie Claytor was the week nd guest of Mrs. Theda Harris. Mr. and Mrs. Thomas Morgan daughter, Emma and Messers iforge Stevens and Thomas Davis vere Sunday dinner guests of Mr. nd Mrs. Charlie Irvin and daughter"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "by McKinley Tibbs, Vaes <mark>Watkins</mark> and Garfield Wright. Professor Lawing and <mark>James</mark> Flood accom panied the"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "by McKinley Tibbs, Vaes <mark>Watkins</mark> and Garfield Wright. Professor Lawing and <mark>James</mark> Flood accom panied the"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [532.55, 662.85, 691.32, 949.14], "bbox_id": "bef3f456d0", "file": "AppomattoxNewspapers_1908-1909a_0258.pdf", "page": 1, "text": "Rev. IR. Hunter, of the Pres byterian church, preached for Rev. H. L. Reaves on Sunday night. His theme was Build ing Homes. It was a timely message and much needed at this time. I wish the pastors would preach such doctrine often. , Mr. and Mrs. Reese Longs- worth, who have,been on a two weeks visit here have returned to their home in Oklahoma. MrsL E. L. Paulette enter tained the missionary society of the Methodist church on Wednesday afternoon. Frank Lukin is visiting his parents, Dr. and Mrs. F. H. Lukin. Misses Alice Watkins and Jane Martin are visiting Mrs. James Conally. Hamlet Franklin of Rich mond, iri visiting his mother, Mrs. Rosa Franklin. Mrs. Bernard Carey, of"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "H. Lukin. Misses Alice <mark>Watkins</mark> and Jane Martin are visiting Mrs. <mark>James</mark> Conally. Hamlet Franklin of"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "H. Lukin. Misses Alice <mark>Watkins</mark> and Jane Martin are visiting Mrs. <mark>James</mark> Conally. Hamlet Franklin of"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [534.92, 682.29, 701.84, 1673.88], "bbox_id": "58ad35c71b", "file": "AppomattoxNewspapers_1926-1933a_0258.pdf", "page": 1, "text": "Rev. 1R. Hunter, of the Pres byterian church, preached for Rev. H. L. Reaves on Sunday night. His theme was Build ing Homes. It was a timely message and much needed at this time. I wish the pastors would preach such doctrine often. Mr. and Mrs. Reese Longs- worth, who have,been on a two weeks visit here have returned to their home in Oklahoma. Mrs. E. L. Paulette enter tained the missionary society of the Methodist church on Wednesday afternoon. Frank Lukin is visiting his parents, Dr. and Mrs. F. H. ukin. Misses Alice Watkins and Jane Martin are visiting Mrs. James Conally. Hamlet Franklin of Rich mond, ib visiting his mother, Mrs. Rosa Franklin. Mrs. Bernard Carey, of armville, was the recent guest of her mother, Mrs. John Gil- iam. Quite a number of our people are planning to attend the Baptist association a t Rocks church on Wednesday and Thursday. Mrs. L. N. Ligan and children are visiting in Franklin. Mr. T.  J. Ligan and sons 1 spent Wednesday in Rich mond. Miss Mary McDearmon spent a portion of last week in Norfolk as the guest of Miss Mabel Britton. Mrs. Curtis Harvey spent last week in Lychburg. Miss Mary Wise left on Tuesday for .Chapel Hill where she will attend the second Summer school at the Universi ty of N. C. Mrs. Lillie Irving spent a portion of last week with Mr. and Mrs. Frank Irving. Mr. and Mrs. J. R. Cawthorn of Roanoke, were week-end guests of Mr. and Mrs. Nor man Farrar. Mr. and Mrs. Montgomery of Kentucky, Mr. and Mrs. Les lie Carwile, of Keeyston, were the recent guests of Mr. and Mrs. Ed. Carwile. Mr. J. S. Darsey and daugh ters, Virginia and Bettie, are spending their vacations at Monroe, N. C. Misses Ernestine Southall and Ulene McClenny epent last week in the homes of Mrs Mose Hunter and Mrs. Ned Moore. Dr. and Mrs. JE. tE. Walker and daughter, Mrs. L. H. Hatch are planning a trip to outh Hill this week. Mr. and Mrs. J. A. Fore, o Petersburg, w e r e week-enc guests of Mr. and Mrs. Wiley Richardson. Mrs. Lillie Moses and daugh ter, Miiss Lucile Moses were guests of Mrs. E. G. Harvey on Sunday.  Mrs. Norman Booker, of La Crosse, spent Sunday with his mother, Mrs. Sallie Booker. We are glad to report Hha  Jesse Harvey, Jr., who was so badly burned is improving in the Baptist hospital. Mr. Frank Fitzgerald is serv ing as relief agent in Norfolk this week."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "H. ukin. Misses Alice <mark>Watkins</mark> and Jane Martin are visiting Mrs. <mark>James</mark> Conally. Hamlet Franklin of"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "H. ukin. Misses Alice <mark>Watkins</mark> and Jane Martin are visiting Mrs. <mark>James</mark> Conally. Hamlet Franklin of"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [990.23, 256.48, 1133.24, 904.88], "bbox_id": "9ea1ac2cf4", "file": "AppomattoxNewspapers_1962-1965a_0230.pdf", "page": 1, "text": "Mr. and Mrs. W. M. Thomp son, of Richmond, visited in the home of Mr. and Mrs. L. M. Moses, Saturday afternoon.   9 Mr. Percy George returned Sunday from Mason City, Iowa where he has been attending an auctioneering school. Mr. George was successful  as we knew he would be  in passing examinations and getting his di ploma.    Mr. and Mrs. A. Judson Bush and granddaughters, Betsy and Caroline Bush, all of Norfolk, are visiting Mr. and Mrs. J. C. Caldwell.  9 9 Mrs. R. E. Wilbun returned home Sunday from the Virginia Baptist Hospital where she und erwent surgery two weeks ago.    Mrs. O. L. Persinger, of Iron Gate, visited her father, James H. OBrien and her sister, Mrs. James A. Smith, last week.  0  Rev. and Mrs. Jack Adams has as their guests last week end their daughter, Grace, from Nor folk, and Richard J. Gugelmann and Michael Campbell, of the U n i v e r s i t y of the South, Sewanee, Tenn. 9 9 9 Mrs. David Goode and children and Mr. Larry Judd, all of Lynchburg, are visiting Mrs. Goodes mother, Mrs. W. W. Scott.  9  Mr. and Mrs. W. F. Woolfork returned to their home in Pet ersburg Monday after spending several days with Mrs. Wool- forks sister, Mrs. W. W. Scott. m   J. M,. McAden underwent an operation at the Virginia Baptist Hospital Monday. His condition is reported to be satisfactory at this time.    Mr. and Mrs. George Totty, of Wilson, N. C., were guests of Mrs. Ed Blackwell on Tuesday night. Other guests for dinner were Mrs. Nathlie Robertson and Miss Frankie McKinney.   9 W. Dottridge Martin will re turn home this week end after visiting his uncle and aunt, Dr. and Mrs. Charles F. James in Epes, Ala.  9 9 Mrs. Watkins M. Abbitt and two daughters, Mrs. Sam Kerr, and Rinne Abbitt, are spending several days at Virginia Beach."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "and Mrs. Charles F. <mark>James</mark> in Epes, Ala.  9 9 Mrs. <mark>Watkins</mark> M. Abbitt and two"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "and Mrs. Charles F. <mark>James</mark> in Epes, Ala.  9 9 Mrs. <mark>Watkins</mark> M. Abbitt and two"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.48, 1265.04, 2005.78, 1523.93], "bbox_id": "8d4a997591", "file": "TimesVirginian_1978_0020.pdf", "page": 1, "text": "k I The Appomattox County Board of Supervisors delayed action Friday on the proposed curfew and loitering ordinances j for Appomattox County when opposition emerged at the j meeting. After opposition was voiced I at a public hearing, the j supervisors asked W. S. Kerr, j . commonwealths attorney, to j develop a new curfew ordin- ! ance. According to the clerk of the board, Tommy Lawson, W. M. Abbitt, Watkins Abbitt, T. E. Sonny Conner, Rev. James Becker, Roland Murphy, Bill B ritton, Virginia Babcock, Delna Barksdale and Richard M artin opposed both proposed ! ordinances. They felt that  something should be done but"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Lawson, W. M. Abbitt, <mark>Watkins</mark> Abbitt, T. E. Sonny Conner, Rev. <mark>James</mark> Becker, Roland Murphy, Bill"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Lawson, W. M. Abbitt, <mark>Watkins</mark> Abbitt, T. E. Sonny Conner, Rev. <mark>James</mark> Becker, Roland Murphy, Bill"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.46, 456.54, 1655.86, 507.84], "bbox_id": "5abd2e8c6f", "file": "AppomattoxNewspapers_1974-1975a_0233.pdf", "page": 1, "text": "Iter Babcock, President of the Romans Club Mrs. H. S. sident of the Alice Kyle EL. C. Watkins, Jr., Junior Lyle District and Mrs. James"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Iter Babcock, President of the Romans Club Mrs. H. S. sident of the Alice Kyle EL. C. <mark>Watkins</mark>, Jr., Junior Lyle District and Mrs. <mark>James</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Iter Babcock, President of the Romans Club Mrs. H. S. sident of the Alice Kyle EL. C. <mark>Watkins</mark>, Jr., Junior Lyle District and Mrs. <mark>James</mark>"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [647.05, 378.77, 986.84, 592.77], "bbox_id": "332e31c2bd", "file": "AppomattoxNewspapers_1952-1954a_0377.pdf", "page": 1, "text": "It is difficult to believe that our high school students here. 4 first six weeks period is about half j Interesting and profitable sum over. For those who are still ab- mer work was done by one of oui sent because of farm duties, hurry former students, Charles O. Jef and return, youre missing your as - 1 fries. He had a Civil Service ap signments. I pointment and worked as a Studen The Student Council officers and j Trainee for the Soil Conservatioi members were installed by Principal j Service in Appomattox. He had ai R. E. Patrick in assembly last Fri- opportunity to see and do things hi dav. Mr. James Clay, sponsor, pre-jis learning as an Agronomy majo sented the officers to the principal.  at Virginia State. His report t Curtis Whitted, president, is going some of us here was interesting, to run for State President at the William Forbes is entering som yearly meeting this spring. We are of his prize pigs in the Five-Count expecting great things from our Fair in Farmville. The N. F. A. held its first mee ing of the year on Monday. Ne officers for 1953-54 are presiden Joe L. Robinson v.-pres., Perry E wards secretary, James Fergusoi treasurer, Bobby Booker? chaplai Nathan Watkins watcher, John 1"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Perry E wards secretary, <mark>James</mark> Fergusoi treasurer, Bobby Booker? chaplai Nathan <mark>Watkins</mark> watcher, John 1"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Perry E wards secretary, <mark>James</mark> Fergusoi treasurer, Bobby Booker? chaplai Nathan <mark>Watkins</mark> watcher, John 1"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.55, 730.11, 1925.39, 1105.53], "bbox_id": "523b951d48", "file": "AppomattoxNewspapers_1971-1973a_0277.pdf", "page": 1, "text": "Democrats Name Delegates To Convention Appomattox c ou nt y Demo crats have elected eleven dele gates to the Virginia St at e Democratic Convention to be held in Roanoke on June 9th and 10 th. Four alternates were also named at the Saturday morning mass meeting held at the Court House. E l e c t e d delegates include Watkins M. Abbitt, Claudia Gordon, Beverly Lou Davidson, Mrs. Earl Robinson, R.QXaw- ing, Harry T. Ferguson, Jr., Watkins M. Abbitt, Jr. Harry G. Lawson, James Eugene Rich ardson, John D. Simpson and W. S. Kerr. A lternates are R. F. Wil liams, Jr. Mrs. Bena E. House, Lewis E. Mann and Mrs. Aldah B. Gordon. P r e s i d i n g at Saturdays meeting was the Honorable W. M. Abbitt, 4th District Con gressional Representative and county chairman, Democratic committee."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Harry T. Ferguson, Jr., <mark>Watkins</mark> M. Abbitt, Jr. Harry G. Lawson, <mark>James</mark> Eugene Rich ardson, John"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Harry T. Ferguson, Jr., <mark>Watkins</mark> M. Abbitt, Jr. Harry G. Lawson, <mark>James</mark> Eugene Rich ardson, John"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [572.64, 571.23, 719.51, 893.97], "bbox_id": "de8cb68a8e", "file": "TimesVirginian_1976_0171.pdf", "page": 1, "text": "choir Scripture Reading, Mrs. Alice Moore Prayer, Rev. Wyatt Venable Special Song, Hes Sweet I Know by choir Welcome Address, Mrs. Linda Watkins Response, Deacon Hudson Tribute to Pastor, Mrs. Catherine Haskins Motto of Church to our pastor What can we say but thank you Master for our pastor To Mrs. Elliott We thank you Introduction of Guest Minister, Rev. H. 0 . Flood Guest Minister, Rev. James Miller, Service in Charge, Deacon Archer Watkins. Rev. Millers theme was Surrender Yourself to God. V Presentation Gift, Mrs. Bai ley, pinned a corsage on Mrs. Elliott, given by Mrs. C. Haskins. A cake, by Mrs. Mineva Venable, given from Deacon and Mrs. Jessie King. Mrs. Alice Moore, cake given from Deacon and Mrs. Archer Watkins and family. A Bicennt- tennial layer cake, given from Woodrow"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Flood Guest Minister, Rev. <mark>James</mark> Miller, Service in Charge, Deacon Archer <mark>Watkins</mark>. Rev. Millers theme was"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Flood Guest Minister, Rev. <mark>James</mark> Miller, Service in Charge, Deacon Archer <mark>Watkins</mark>. Rev. Millers theme was"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1999.65, 208.87, 2141.0, 544.32], "bbox_id": "df2a8ccc14", "file": "TimesVirginian_1981a_0444.pdf", "page": 1, "text": "Baptist Church, -a veteran of World War I and a retired farmer. His wife was the late Lillie Mae Hamlett Mason. He is survived by four sons, Keith Walker Mason, William Gibbs Mason, James John Lacy Mason Jr. and Marion Buck Watkins Mason, all of Charlotte County a daughter, Mrs. Parker Mamie Dodd of Monroe three sisters, Carrie M. Clark of Brookneal, Mozelle M. Hamlett of Phenix and Nellie M. Ayres of Lynchhurg five half-sisters, Pauline M. Leslie of Roanoke, Kathleen Ramsey of Phenix, Ruby M. Kiser of Lynchburg, Ora Mae Long of Idaho and Jane Mason of Madison Heights tw half-brothers, Lewis Mason and Clarence Mason, both of Virginia 15 grandchildren and 13 great-grandchildren. Funeral services were con ducted Tuesday at 2 p.m. at Henderson Funeral Home, Brookneal, by the Rev. Charles Anderson. Interment was in Salem Baptist. Church ceme tery, Charlotte Couifty. Henderson Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Mason, William Gibbs Mason, <mark>James</mark> John Lacy Mason Jr. and Marion Buck <mark>Watkins</mark> Mason, all of Charlotte"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Mason, William Gibbs Mason, <mark>James</mark> John Lacy Mason Jr. and Marion Buck <mark>Watkins</mark> Mason, all of Charlotte"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.3, 1463.15, 2450.39, 1799.29], "bbox_id": "c50b1888a7", "file": "AppomattoxNewspapers_1952-1954a_0270.pdf", "page": 1, "text": "12 Men Report,For Phyticale The following young men left here Tuesday, May 19, for physical exam inations, being sent by the Selective Service Board of the county Kelly David Stratton, Route 2j Concord. . Robert Ellis Simms, Spout Spring. William Albert Harvey, Ever green. Foster Alexander Lewis, Route 2, Gladstone. Herman Harrison Richardson, of Pamplin. James Edward Woody, Jr., Appo mattox. Buford Hunter Nash, of Spout Spring. James Edward Grishaw, Route 4, Appomattox. Narrold Winchcll Watkins, Appo mattox. Sylvester Osby McCoy, Route 2, Gladstone. Virgil Moore, Route 2, Gladstone. J. C. Stedman, Route 1, Pamplin. Woodmen Circle Met Monday The Supreme Forest Woodmen  Circle, Robert E. Lee Grove No. 73 will meet Monday, May 25, at 800 P. M. in the Masonic Hall. A report will be given by delegates who a -line Drive and visited Luray Caverns tended the recent state convention, and Natural Bridge."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Nash, of Spout Spring. <mark>James</mark> Edward Grishaw, Route 4, Appomattox. Narrold Winchcll <mark>Watkins</mark>, Appo mattox. Sylvester Osby"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Nash, of Spout Spring. <mark>James</mark> Edward Grishaw, Route 4, Appomattox. Narrold Winchcll <mark>Watkins</mark>, Appo mattox. Sylvester Osby"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [679.45, 456.07, 826.04, 890.85], "bbox_id": "2721424346", "file": "AppomattoxNewspapers_1971-1973a_0177.pdf", "page": 1, "text": "We hope everyone had a Mer ry Christmas and is now enjoy ing a Happy New Year. On the 3rd Sunday in January  Jan. 16 The Spiritual Knights  and the Traveling Echos will be i on program at 300 p.m. Come out for an afternoon of good singing. The Senior Choir will pract ice Thursday night at 730. The people of the J orda n Communty were very sorry to hear of the death of Mr. Adol phus Mosley and offer to the family their deepest sympathy. On Christmas Day, Mr. and Mrs. Cris Austin had the fol lowing dinner guest Mr. and Mrs. Harry Carter and sons, Mr. James Carter, Jr. and children, Mr. and Mrs. Harry Watkins and daughter, M r s . Hilda Jonefc and children, Mr. and Mrs. David Trent and dau ghter, Mr. and Mrs. John Jones and Mrs. Willie Wheeler. On December 29 Mrs. Hilda Jones and Mrs. Alice Carter had the following supper guest Mr. and Mrs. James Carter, Sr., Mr. and Mrs. John Jones, Mrs. Willie Wheeler, Mr. and Mrs. Cris Austin and family, Mrs. Martha Watkins and dau ghter, Mrs. Mamie Watkins and daughter, Mr. Harry Carter and sens, and Mr. Jack Morgan. On December 26 Mrs. Hilda Jones had as her dinner guest Mr. and Mrs. David Trent and daughter."}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "Carter and sons, Mr. <mark>James</mark> Carter, Jr. and children, Mr. and Mrs. Harry <mark>Watkins</mark> and daughter, M r"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "Carter and sons, Mr. <mark>James</mark> Carter, Jr. and children, Mr. and Mrs. Harry <mark>Watkins</mark> and daughter, M r"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [982.3, 194.13, 1142.3, 1168.52], "bbox_id": "8d9b059536", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "711, Aubrey Chester Spencer 841, Spencer Watkins 688, Peter Floyd Rush 623, John Archer Powers 269, Edmund Smith Dennis, jr. 685. Southall Seay . 335, Robert Lee Gough 493, Ethelbert Tandy Loving 341, Selden Bruce Gilliam 391, Wiley James Hillard 353, John Gordon 637, Hubert Thomas Ragland 360, Leian Harris 571, William Neighbors 488, Walter Fletcher Logan 704, Charles Raymond Senger 72, James H. Briddie 356, James Harvey 112, Lewis Brown 128, Relius Walden Bartee 679, John James Sharp 805, John Daniel Wood 11, John Agee 363, Willie Hartwell 6, Thomas W Adcock 327, John Penny Godsey 664, Archer Richardson 93, Joe Broxton 345, Houston Letcher Gary 103, Robert Franklin Bransford 556, Ernest Agee Morgan 154, Charlie Bagby 51, Paul Ayres 717, Walter Brooks Shoemaker 30, William Andrew Anderson 199, Tom Cox, 388, Fred Walter Hellard 773, Thomas Vest 608, Charles J Pruvis 406, Frank Harris 519, John Alexajder Miller 25, John Randolph Amos 392, John Rocker 383, Samuel David Harris 588, Grover Cleveland Patteson 856, Frank Allen Zimmerman 705, Thomas Harrison Staton 576, John Nicholas 122, E iward Brown 642, Roy T Reynolds 222, Allen Floyd Christian 700, Frank Pharr Simms 297, Sidney Lee Fountaine 321, William Gregory 736, Gordon Lee Snoddy 707, James Wertley Sears 368, Percy Robert -Horsley 320, James Alex Gregory 656, Henry Harrison Rosen 814, Bernard Mayfield Wooten 738, John Ed Stanton 848, Meli Woodson 121, Aaron Brown 221, Robert Lee Childress 292, Sampson Ford 822, James Williams 504, John Edward MoBley 470, William Kane 312, Willie Gray 90, Ernest Norfield Banton 191, Cliff Chambers 477, Harry Clinton Landeree 753, Robert Samuel Toney 130, Carey Booker 858, Wesley Gray 168, James Oscar Christian 424, John Letcher Jones 840, George Watkins. 657, Bernice Gilmer Ranson 175, William Henry Clark 300, Charlie Gardner Fleming 278, George Russell Edwards 524, Clarence Maynard 532, James Earley Marshall 336, Charles Lightfoot Gunter"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "858, Wesley Gray 168, <mark>James</mark> Oscar Christian 424, John Letcher Jones 840, George <mark>Watkins</mark>. 657, Bernice Gilmer Ranson"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "858, Wesley Gray 168, <mark>James</mark> Oscar Christian 424, John Letcher Jones 840, George <mark>Watkins</mark>. 657, Bernice Gilmer Ranson"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2295.6, 895.57, 2463.32, 1101.24], "bbox_id": "d6642f10ed", "file": "AppomattoxNewspapers_1952-1954a_0502.pdf", "page": 1, "text": "- ------- B S IS VIVCIt As a proposed project for the future, Mr. Watkins included plans for a new bridge across the James River at Bent Creek, to replace the ancient, one lane bridge now in use. He estimated the cost of a new Bent Creek bridge at 600,000. This is on U. S. Route 60. The commission member did not itemize secondary road needs in Ap pomattox County, but there are ap proximately 70 miles of secondary roads unpaved in the county. In many  quarters, it is being con tended that road construction needs can be speeded up from the present pace without additional taxes. The present Governor, Mr. Stanley, cam paigned for the office on a platform of no increase in taxes."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "for the future, Mr. <mark>Watkins</mark> included plans for a new bridge across the <mark>James</mark> River at Bent Creek,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "for the future, Mr. <mark>Watkins</mark> included plans for a new bridge across the <mark>James</mark> River at Bent Creek,"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [196.56, 698.11, 359.86, 1800.91], "bbox_id": "848b23d479", "file": "AppomattoxNewspapers_1892-1898a_0292.pdf", "page": 1, "text": "Trial of the Flood-Flanagan Case Set for nay 6th. It was a case of rain outside and Flood inside yesterday, and a gen eral all-round April-fool for those who attended the Police Court in expectation that a result would be reached in the cause of Senator H. D. Flood, who is charged with an assault upon Senator W. M. Flana gan, of Powhatan. The difficulty between the sena tors occurred during the closing days of the legislative session, and the trial was set for to-day from an examination held early m the past month. At an early hour yesterday morn ing, men began to arrive, and at 10 oclock the court-room was crowded to its utmost capacity, for all thought that the much-discussed case would be finally determined. It was a little after 10 oclock when Justice Crutchfield called the case of H. D. Flood,and immediately the hum and buzz of the expectant throng caused Sergeant Thomas to rap vigorously for order. In the row of seats reserved for the attorneys sat Commonwealths- Attorney Harry Smith, and neur him sat Senator Flanagan, who was not represented by any assistant in the prosecution. General Edgar Allan, who was in the court in the former hearing was not present, and Judge Waddill, another friend of Mr. Flanagan was also absent. Senator Flood occupied a chair between Senator Conway R. Sands and Mr. Charles V. Meredith his counsel. Justice Crutchfield called the following witnesses Malcolm A. Coles, H. L. Maynard, 6. T. Snead, F. B. Watkins, Dr. Pierce, Dr. Jeffries, Dr. Michaux, O. T. Crump, James R. Werth, Morris Parr, Mor ris Evws, Major Robert Stiles, Frank Perkins, and Norman Ran dolph. He then announced that a number of the witnesses had not responded to their names, and the list was recalled. MR. EVANS ABSENT. Mr. Flanagan had then come in side the rail just before the Justice. He stated that Mr. Morris Evans, was not present. Mr. Smith asked Mr. Flanagan if he thought they could get along without Mr. Evans, and Mr. Flana gan replied that he considered Mr. Evans one of the most important of all the witnesses. It then became apparent that the case would have again to be post poned. Mr. Evans lives in Powha tan and was expected on the Alle ghany road from Columbia this morning. Justice Crutchfield had the railroad office telephoned to and found that the train had ar rive on time. It was then suggested that possibly Mr. Evans had been unable to reach the railroad on ac count of the high water in the river near Columbia. Justice Crutchfield announced that he was very sorry to be com pelled to again continue the case, as the witnesses were many of them, brought from some distance, and that the expense to the state was large. Mr. Smith here jocularly remarked that as many of the witnesses were members of the Legislature, they were also of course opposed to in creasing the criminal expenses of the State."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "T. Snead, F. B. <mark>Watkins</mark>, Dr. Pierce, Dr. Jeffries, Dr. Michaux, O. T. Crump, <mark>James</mark> R. Werth, Morris Parr,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "T. Snead, F. B. <mark>Watkins</mark>, Dr. Pierce, Dr. Jeffries, Dr. Michaux, O. T. Crump, <mark>James</mark> R. Werth, Morris Parr,"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1119.61, 732.89, 1288.79, 813.94], "bbox_id": "34f8f4bd65", "file": "AppomattoxNewspapers_1954-1955a_0430.pdf", "page": 1, "text": "President, Frank Lee Thomas Vice-president, -Watkins Abbitt Secretary, Kyle Almond Reporter, Suzanne Gills Song leaders James Whitehead and Jacqueline Sarver Program chairman James White head and Marvin Caldwell."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James", "James"], "snippet": "President, Frank Lee Thomas Vice-president, -<mark>Watkins</mark> Abbitt Secretary, Kyle Almond Reporter, Suzanne Gills Song leaders <mark>James</mark> Whitehead and Jacqueline Sarver Program chairman <mark>James</mark> White head and Marvin Caldwell."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James", "James"], "snippet": "President, Frank Lee Thomas Vice-president, -<mark>Watkins</mark> Abbitt Secretary, Kyle Almond Reporter, Suzanne Gills Song leaders <mark>James</mark> Whitehead and Jacqueline Sarver Program chairman <mark>James</mark> White head and Marvin Caldwell."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.29, 806.85, 2388.64, 968.99], "bbox_id": "49f76900ad", "file": "AppomattoxNewspapers_1933-1936a_0091.pdf", "page": 1, "text": "of Mrs. Featherston was I a nattarn of Christian strength. Site  termed her family, her church and community with loyalty nd afth Cherished as one oi the devout nd unselfish ladies of the coupty, hei untimely death cast a  I clomm ever this section. A large I throng attended the funeral service which were held from the home, with interment at the family bu y- ing ground, near Hlxbvrg.  Among the relatives coming here for the funeral were James Marshall of Big Stone Gp, Mr. and Mw. Joel Watkins ndYamlly, of Farmville Mrs. Thoma- R. of Lynchburg and Thomas R. Pugh"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "for the funeral were <mark>James</mark> Marshall of Big Stone Gp, Mr. and Mw. Joel <mark>Watkins</mark> ndYamlly, of Farmville Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "for the funeral were <mark>James</mark> Marshall of Big Stone Gp, Mr. and Mw. Joel <mark>Watkins</mark> ndYamlly, of Farmville Mrs."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1065.84, 346.11, 1227.01, 598.34], "bbox_id": "1eb99bd52f", "file": "AppomattoxNewspapers_1933-1936a_0027.pdf", "page": 1, "text": "I PAMPLIN  o- -------------------- -o Pamplin, Nov. 1- The mon thly meeting of the Bible stu dy circle was held l a s t Tues day in the home of Mrs. Frank Fitzgerald. Miss Alice Watkins, of Ri chmond has been visiting her aunt, Mrs. James Connally. Mrs. Nicholas A. Davis has returned from a visit to Mr. and Mrs. Thomas C. Davis,of Dayton, Ohio.. Those attending the annual conference of the Methodist church in Norfolk returned home Monday. The high school junior le ague gave a Halloween party at the schoo last Friday night.  - --------------- o ---------------"}, "highlight": {"text": {"matched_tokens": ["Watkins", "James"], "snippet": "Frank Fitzgerald. Miss Alice <mark>Watkins</mark>, of Ri chmond has been visiting her aunt, Mrs. <mark>James</mark> Connally. Mrs. Nicholas A."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James"], "snippet": "Frank Fitzgerald. Miss Alice <mark>Watkins</mark>, of Ri chmond has been visiting her aunt, Mrs. <mark>James</mark> Connally. Mrs. Nicholas A."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1782.96, 981.27, 1960.96, 1734.31], "bbox_id": "73c0f3dc59", "file": "AppomattoxNewspapers_1943-1947a_0383.pdf", "page": 1, "text": "Ghe following have been re leased from ths service Harry D. Baldwin James W. Wheeler Daniel- A. Tanner John R. Lawson, Jr. Clovis I S. Anderson William W. Ford Jr. Archie C. McCann Alfred S. Puckett Claudy J. Ryan Char es ,T.-Moses Jr. James E. Maxwell Nathaniel L. Ferguson James E. Tweedy George R Hughes William h. Richardson Walter If. Routon Will iam Di. - Oarrico Roy W. Warriner Robert D. Hunter William S. Moses Eugene H. Franklin John W. Routt Don Moses Jr. Charlie L. Kidd LeRoy P. Smith Hubert L. .Price Oscar L. West Carl A. Hash Embra T. Davis Clarence F. Perdue Richard N. Jones Maynard G. OBrien Elwyn E. Megginson John W. Harris Paul E. Gilbert Maurice E. Gordon Edward L. Jones George W. Stevens Eugene E. Turner Randolph P. Marsh Peter C. Flood Floyd E. McFadden Herman W. .Harvey Monroe J. Kelso James J. Richardson John J. Ligon  Herbert B. Lucado Robert L. Lea Jr. Malcolm A. Booker John C. Stanley Willie B. Hlarvey Robert D. Watkins Douglas S. MacKetizie Paul S. Childers Hubert C. Wilkes James Wilson Franklin Floyd James Trent David Clement Coleman Lloyd Banks Robertson Willie M. Thornton Ra.-mon i A. Coleman Byron B. Cole James C. Puckett George W. Evans Clarence W. Redding Stratton H. Franklin Aubrey L. Doss Jr. Earl H. Dickenson    Robert I.  Scott Jr. Johnnie W, Pillow Paul W, McCoy William Ci Hubbard, ffhe following white registrants were recently inducted Ster i !.. Vaughan Charles C. Patterson Walter H. Elmer Wilmer."}, "highlight": {"text": {"matched_tokens": ["Watkins", "James", "James"], "snippet": "B. Hlarvey Robert D. <mark>Watkins</mark> Douglas S. MacKetizie Paul S. Childers Hubert C. Wilkes <mark>James</mark> Wilson Franklin Floyd <mark>James</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins", "James", "James"], "snippet": "B. Hlarvey Robert D. <mark>Watkins</mark> Douglas S. MacKetizie Paul S. Childers Hubert C. Wilkes <mark>James</mark> Wilson Franklin Floyd <mark>James</mark>"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["James", "Watkins"], "snippet": "John H. Plunkett H <mark>James</mark> McDearmon. I These men nominated to the Governor Joel <mark>Watkins</mark> for Rriff, and he"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Watkins"], "snippet": "John H. Plunkett H <mark>James</mark> McDearmon. I These men nominated to the Governor Joel <mark>Watkins</mark> for Rriff, and he"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.08, 915.87, 1894.38, 1740.21], "bbox_id": "e1af8c101e", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "with Miss Mary Elizabeth Paris Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messrs. John Rolfe Horsley, B. Watkins Nowlin, John Overton and lampton Steele. The little ribbon- bearers were Jerry Burxe and Jao- queline Atwood Curtis Taylor and Fraces Abbitt Kendall Huuter and Katie Woolridge, and James Stanley and Mattie Sears. Before thp bridal party entered one verse of O Promise Me was softly-sung by Miss Eula Burke ac companied by Mrs. J. R. Atwood. At the conclusion of the solo follow ed the strains of Lohengrins wedding march. The bridesmaids entered from the left wing of tbe church near the altar and passed in front of the altar and down the right aisle. The male attendants entered the left aisle at the front of the church and marched down the right aisle while the bridesmaids passed up the left, forming a semi-circle around the al tar. Following the attendants the groom on the arm of the best man en tered the right aiale, while the bride on the arm of her father, Mr. H. F, Burke, appeared in the left aisle, and proceeded to the alter. The bride was preceded by the maid of honor and followed by her colored maid, Sarah. The bride was attired in a hand some traveling dress of broad-cloth with hat and gloves to matcl. She carried in her hand a small white bible and a white rose-bud. The maid of honor wore a gown of cream crepe cloth, with trimmings of pearls and chiffon, and carried in her hand a large bunch of white chrysanthemums. Tfie bridesmaids wore dresses of white silk mull wearing aigrettes in their hair, and each carrying a white rose iu her hand. After lunching at the brides home they happy pair left on the 130 oclock train for a tour through the West, followed by the best wishes of a host of friends. The groom is a son of Mr. John Steel, of Concord, and bolds the re sponsible position of Agent at Spout Springs of tbe N.  W. By., and is a young man highly esteemed and very popular wherever known. He  has for his young bride a daughter I of Mr. B. F. Burke, cashier of our bank. She is attractive popular, j and highly accomplished. She is  an expert at the telegraph key and Mr. Steele will have a help mate ca pable as be. The presents were  costly and beautiful."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "John Rolfe Horsley, B. <mark>Watkins</mark> Nowlin, John Overton and"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "John Rolfe Horsley, B. <mark>Watkins</mark> Nowlin, John Overton and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1017.81, 256.5, 1188.32, 805.08], "bbox_id": "e0344ef338", "file": "TimesVirginian_1983a_0107.pdf", "page": 1, "text": "wife thè late Kenneth B. Hogan. Born in Appomattox, she was a daughter of John Esmond Pugh and Zora Guthrie Pugh, Spout Spring. She was a member of Appomattox Baptist Temple and an employee of Thomasvide Furniture Corporation. In addition to her parents, she is survived by two sons, William Harvey Hogan and Charles Edward Hogan, both of Appomattox five brothers, Tommy Lee Pugh, Houston, Tex., Grover D. Pugh. Lynchburg, Joel Watkins Pugh, Appomattox, and Harold Walker Pugh mid Robert Guthrie Pugh, both of Spout Spring two sisters, Eugenia Pugh Clay, Gladys, and Nora Pugh Webber. Appomattox. Funeral services were held Sunday at 4 p.m. at Robinson Funerql Home by the Rev. Ronald L. Gallagher. Burial was in Liberty Cemetery. ThcHMsKiaclde Moore Thomas Kinckle Moore, 75, of Route 4, died early Saturday morning in Lynchburg General Hospital. He was born in Appomattox County, a son of, the late Hunter Marshall and Bertha Pajrrish Moore. He was a retired welder for Truck Body Corporation and 4 member of Mt. Comfort United Methodist Church. He is survived by his wife, Estelle Doss Moore four sons. L.C. Moore, Gladstone,- T. Eddie Moore, Appomattox, James A. Moore, Lynchburg and Henry Palmer Moore, Richmond a daughter, Mrs. Herbert Peggy Wood, Madison Heights 13 grandchildren and three great-grandchildren. Funeral services were conducted Monday at 2 p.m. from Mt. Comfort United Methodist Church by the Rev. David Camden, with burial in the church cemetery. Robinson Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "D. Pugh. Lynchburg, Joel <mark>Watkins</mark> Pugh, Appomattox, and Harold"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "D. Pugh. Lynchburg, Joel <mark>Watkins</mark> Pugh, Appomattox, and Harold"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [567.1, 703.69, 831.7, 825.49], "bbox_id": "d52fd238eb", "file": "AppomattoxNewspapers_1974-1975a_0235.pdf", "page": 1, "text": "Were proud of our many accomplishments, says Mrs. James A. Nolen, president of the Appomattox Junior Womans Gub, as she helps to show club members and guests what the Juniors won at the recent Alice Kyle District meeting. Shown above are left to right Mrs. Ronnie Lewis, The Honorable Watkins M. Abbitt, U.S. House of Representatives retired. The Honorable Howard Anderson, Virginia Senate, and Mrs. Nolen. Senator Anderson was the clubs guest speaker at its March meeting. Read The Times-Virginian each week for more aobut how this organization betters our community!"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "many accomplishments, says Mrs. <mark>James</mark> A. Nolen, president of"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "many accomplishments, says Mrs. <mark>James</mark> A. Nolen, president of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1823.97, 825.3, 2018.1, 1202.5], "bbox_id": "6c4a269039", "file": "AppomattoxNewspapers_1952-1954a_0217.pdf", "page": 1, "text": "were presented by County Agent G. L. James. Serenia Christian, club president, presided. Claude Lambert and William Forbes reported on their activities. WilliamForbes won a 50.00 Bond awarded by the Ex tension Service, made available by the Advisory Board of Virginia. Claude Lambert was awarded a me dal for tractor driving achievement, Algie Williams for soil conservation and William Forbes for his pig project. The official candelight serv ice was held, Jacqueline Lawing, past president presenting the 4-H em blem to the present president, Se- vAnio lf Mf i  m ne nunofint. A cuta v i u iiiviaili m uoic ao p i vuuuu ed by the 4-H Chorus, under the direction of Mrs. T. W. Hamlet. Sarah Watkins was accompanist. A Post St. Patrick Dance will be held on Thursday evening, sponsor ed by the County Teachers Associ ation. The Continentals Orchestra from Lynchburg will play. I We are happy Mrs. Theda Harris Cook.is back after illness. Dont forget the Red Cross Drive and the Blood Bank to be held March 26. Give and help save the life of a fellow citizen now on the battlefield. No one ever knows when disaster may strike. Negro citizens, lets show our patriotism! Our country! In her intercourse with foreign nations, may she al ways be in the right but our coun try, right or wrong."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "County Agent G. L. <mark>James</mark>. Serenia Christian, club president,"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "County Agent G. L. <mark>James</mark>. Serenia Christian, club president,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.63, 1662.16, 1616.89, 1805.81], "bbox_id": "85ec05fc6a", "file": "AppomattoxNewspapers_1962-1965a_0183.pdf", "page": 1, "text": "weeks seniors, now graduates of Appomattox High  afe spending the summer days applying for per- work  already working on summer jobs, or lazily t the good-weather. Theres college or technical train- for about 25 out of the 75 graduates pictured above, right on first row are Robert Brown, James Harse. whitehead, Pat Wells, Nancy Jo Kidd, Blaine Carter,  urks, Harry Ranson, John Harrison, and Tony Mann, second row are Margaret Johnson, Linda Thomas, helps, Thomas Richardson, James McCormick, Robertson, Mary McClenny. Randoph Smith, Kyle  ,chrd Harris, John Alvis, Mary Ranson. In the .7 Ahen Conner, Thacker Cheatham, Bill Stratton, vrawley, Mary Watkins Booth, and Barbara Thomas."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "row are Robert Brown, <mark>James</mark> Harse. whitehead, Pat Wells,"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "row are Robert Brown, <mark>James</mark> Harse. whitehead, Pat Wells,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2125.45, 320.66, 2463.37, 542.86], "bbox_id": "28ff57d397", "file": "AppomattoxNewspapers_1952-1954a_0004.pdf", "page": 1, "text": "We want to thank the editor, Mr. new school exterior and not be able Calvin Robinson, for publishing our weekly column. We have enjoyed writing it as well as reading it. The Senior Banquet held on Tues day evening was gala girls looking lovely in their evening gowns. Din ner, served by Maudes, was delicious. Mrs. Mozella J. Price, who was intro duced by Mrs. Harriet James, gave an inspirational address, stressing self analysis to achieve success, set ting goals and letting nothing hinder you. Mrs. Price was presented a cor sage in token of all she has done. Norrald Watkins, class president, presided. Doris Fleshman and War ren Minnifield gave two poems. The class was reminded that they were first in many respects first to have the largest graduating class, and first to see and enjoy the nice"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "duced by Mrs. Harriet <mark>James</mark>, gave an inspirational address,"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "duced by Mrs. Harriet <mark>James</mark>, gave an inspirational address,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1029.81, 826.19, 1201.58, 1084.13], "bbox_id": "1f3c39a408", "file": "AppomattoxNewspapers_1955-1957a_0488.pdf", "page": 1, "text": "Watkins Abbitt, 6th grade stu dent, .won tri-color in Junior Gar den club section, in class depicting Jamestown Festival. Sweepstakes went to Miss Beulah Ferrell for winning the most blue ribbons in the artistic section, and to Mrs. T. M. Richardson in the horticulture section. Mrs. Goode Robinson and Mrs. P. W. Payne, of Lynchburg, were resposible for the educational ex hibit of Peonies and Beared Iris, and Mrs. C. L. Burgess had an ex hibit on Birds. Also included was a commercial exhibit by Windheight Nurseries. Winners in the show were an nounced this morning by Mrs. C. T. Moses, Jr., Chairman of the Shew. Judges for the Show were Mrs. Fred Arnold, Mrs. James W. Guy, Mrs. B. M. Simmons, Mrs. C. D. Rennie, Jr., Mrs. F. B. Key and Miss Frances Cole, all of Rich mond, Va."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "<mark>Watkins</mark> Abbitt, 6th grade stu"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "<mark>Watkins</mark> Abbitt, 6th grade stu"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1181.27, 1334.57, 1664.76, 1512.96], "bbox_id": "4cea8f3bfc", "file": "TimesVirginian_1981a_0131.pdf", "page": 1, "text": "W. Mays, Seibert McCoy, James Eugene Richardson, and Ronald C. Spiggle were all elected to represent Appomat tox as delegates at both the Fifth District and State Conventions. In addition, elected as alternates were Watkins Ab- bitt, Jr., Gary W. Brooks, F ather Darkleaf"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "W. Mays, Seibert McCoy, <mark>James</mark> Eugene Richardson, and Ronald"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "W. Mays, Seibert McCoy, <mark>James</mark> Eugene Richardson, and Ronald"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.01, 1368.85, 1612.72, 1640.5], "bbox_id": "3922358aad", "file": "TimesVirginian_1978_0445.pdf", "page": 1, "text": "W. M. Abbitt Watkins Abbitt, Jr. Dick Bass Patti Booker Garet Bosiger Jerry L. Burge Richard F. Burke, III William A. Bill Burke Patsy Butler Sammy Carter Jim Cobb T. E. Sonny Conner Dorothy Davidson Crawford Davison  J. B. Drinkard, Jr. Floyd Buddy Eggleston T. DeWitt Evans John M. Fedison Harry T. Ferguson, Jr. Sam Ferguson, III James Ford"}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "W. M. Abbitt <mark>Watkins</mark> Abbitt, Jr. Dick Bass"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "W. M. Abbitt <mark>Watkins</mark> Abbitt, Jr. Dick Bass"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.36, 1162.87, 2367.95, 1399.54], "bbox_id": "5e1281f10c", "file": "AppomattoxNewspapers_1939-1943a_0079.pdf", "page": 1, "text": "Visit Colamaus the next Timo iu Lynchburg. H. W. McKinney, Admr. Catherine Walker et als. Defendants. TO Joel Watkins, H. W. McKin ney, Admr. estate of Catherine Walk er, decd., Henry J. Walker, James L. Walker, Norman A. Walker, Jos- CatAierine Jones, Core an Walker, eph J. Walker, Mary E. Edwards, I Howard Willis Walker, Jessie Fay Walker, Veralce Walker, and George F. Abbitt Jr., Gdi- ad Litem, Plaintiffs and Defendants In the above styled suit. You are hereby notified that I have fixed on Monday the 15th day of April, 1940, at 11 a. m., as the time, and my office at Appomattox C. H., Virginia, as the place for taking the accounts in the above ptyled suit ordered by decree, there in of the April Term, 194. tc-wit 1. What property Catherine Walk- of her death."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "als. Defendants. TO Joel <mark>Watkins</mark>, H. W. McKin ney,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "als. Defendants. TO Joel <mark>Watkins</mark>, H. W. McKin ney,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [130.29, 551.89, 456.9, 1765.52], "bbox_id": "9eaa684c64", "file": "AppomattoxNewspapers_1905-1912a_0215.pdf", "page": 1, "text": "us hope that eloquence hasnt all., gone to sea from Virginia, nor . re 11 all the orators dead or sleeping. I Martin lives, and having often commanded a listening Senate oil conrse he can wake the echoes of I the mountains. The sad and sudden end oil James M. Wilson, who met his death on the Tidewater and West ern, has caused sadness to hearts! and shrouded homes in gloom. He was prominently connected and had many friends. ! Fair banners span our streets and  the air already thrills with Fair talk and Fair preparation. Rich mond may have had a larger orowd but Richmond didnt have half the fun we are anticipating. Our peo ple are so absorbed with their own exhibition that they dont attend! upon others as they once did and as perhaps they should continue to do. And yet loyalty to home is a virtue not quite so much in evidence as it should be. Our race track is al and big barn on it. Ho now has a model farm and is going to teach us just, what ten acres of Southside Virginia land c n be made to yield. He is dividing the land into lots of two acies, sowing grass, raising corn and vegetables, keeps two good cows, a few hoga and a hun dred chickens. He needs but one more thing to mhke the-home ideal, and that is a wife to look after the chickens md the milking. And he Bays he is t on the carpet. Some good catch for some good housewife. I would be glad to give his name aiid address o parties who may be interested in what 1 have written. - Capt. S. W. Watkins, president oi our Fair Association, and Mr. A. A. Cox, an enthusiastic horseman, attended the Lynchburg Fair and secuted soule fast racers for our Fair. I noticed iu your paper that the excursion tickets on sale at your depot for the Lynchburg Fair were all soon exhausted, and parties had to pay full fare. Remind the agent to provide against like contingency .When the gates of the Farmville Fair open. Everybody in Appo mattox will want to attend our ex hibition and wheu Appomattox holds its Fair, and it should next season, everybody in Farmville will return the compliment. Dr. Irwio, who came to Farmville from St. Augustine, Florida, brought with him two dogs as big as oxen, and I noticed that he ir advertising them for sale. They are monsters and may be valuable to somo lolk8, I confess, however, that I would hesitate to control them. Lawyers Lancaster and Thomp son, who had that little scrap in Cumberland Court-room, are neit her disabled or disfigured. It the hai been allowed to fight it out there would have been a battle royal, for both are big and strong. Peace, however, reigns supreme. My blind friend, Mr. W. H Richardson, hearing a gentlemen from Ohio, who has come hero to make his home, say that he had never tasted a julip, a mint julip of course, at once carried him to his home and introduced him to the genuine article. He smacked his lips and said,  Fine. The editor of the Richmond Times-Dispatch, referring to your Farmville correspondent, wished to know whether or not the orators of Virginia are all temporarily absent from the country, delighting French audiences with their eloquence? I am rather disposed to thnk that in addition to those touring spell binders the old Mother has a lot of them out in the Ninth district j while others are lookers on as the  Norfolk pane axia of how to do i things if being unfolded. No, let"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "and sudden end oil <mark>James</mark> M. Wilson, who met"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "and sudden end oil <mark>James</mark> M. Wilson, who met"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2522.37, 494.1, 2667.03, 1358.98], "bbox_id": "d42343c725", "file": "AppomattoxNewspapers_1962-1965a_0132.pdf", "page": 1, "text": "Two county incumbents face newly announced opposition this week with the announcement by David M. Wood, Rtr 3,.Appomat tox, on Monday, that he has fil ed to run for county supervisor In the Clover Hill District. In cumbent Clover Hill supervisor, Richard M. Webb, had previous ly made public that he will seek re-election. Thomas E Tommie OBrien announced on Saturday h is candidacy for the post of Com missioner of Revenue, a job hte father. James Dick OBrien, held for over 35 years. Stonewall Supervisor O. W. Martin, Jr., incumbent county supervisor for the Stone wall District, filed Friday with Democratic chairman, Watkins M. Abbitt, to run for re-election to the post he has held for the past two terms. As candidate for commissioner of revenue, Tommie OBrien will be opposed by John Curtis Cald well who defeated his father in the 1959 election. Caldwell is co-owner of th e Ooswell Drive-In Theatre. He a graduate of Appomattox High School, attended the College of William and Mary. He Is mar ried and has two sonsJohn C. Jr., an electrical engineer in Lynchburg, and William, who is a student at the University of Richmond. OBrien, a graduate of Appo mattox High School and fonder football player at VPI, teaches business at E. C. Glass High 8cbool. He is line coach for the football team and assistant bas ketball coach. OBrien is married to the for mer Joanne C. Price, of Panip- lin, and has three children, Kathy. 5, Pam 3, and Kevin 18 months. David Wood, candidate for the Clover Hill supervisors position native of Carbon Hill,  Where he finished high He and his wife, moved pomattox Comity 15 years ago. They have three children, David M. Wood, Jr., Mrs. Raymond Disley, of Cumberland, Ky., and Mrs. Ted Layne, of Rt 4, Ap pomattox. Richard Webb, present super visor from the Clover HUl Dis trict, was elected In 1955 also, and reelected In 1969. Hte won his first term when tocumbeht. Frank Allen OBrien did not of-, fer for reelectlon.. He has had no opposition in either race. J Webb, a farmer and dairy man, is a graduate of Vera High School and is a member of the Appomattox Welfare Board and clerk of Hollywood B a p t i s t Church. He is married to the former Betty Morris, and Has one daughter, Mrs. David Re pass, of Appomattox. Former Councilman H. G. Johnson, former town councilman appointed when A. H. Gregory died In 1926, served three consecutive terms until he resigned In 1939 when trans ferred to Lynchburg as a plant superintendent for Standard OIL He said he is entering the race for the good of the town and not for personal reasons."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "a job hte father. <mark>James</mark> Dick OBrien, held for"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "a job hte father. <mark>James</mark> Dick OBrien, held for"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [461.07, 298.38, 1373.27, 881.96], "bbox_id": "063d30132f", "file": "AppomattoxNewspapers_1952-1954a_0396.pdf", "page": 1, "text": "THURSDAY THE TIMES-VIRGINIAN, APPOMATTOX, VIRGINIA PAGE TEN Birthday List Clover Hill Club Meets Oakville W. T. Childers, Oct. 7. Mr. Chil ders observed his 70th birth day. Congratulations!. Clyde Childers, Oct. 28. Carolyn Childers, Oct. 5. Mrs. Ida Beale, Oct. 18. Etta Beale, Oct. 6. James Beale, Oct. 26. Bennie Beale, Oct. 29. John Megginson, Oct. 25. Mrs. Robert Gilbert, Oct. 16. Mrs. Rosa Mitchell, Oct. 15. Mrs. iSusie Perdue, Oct. 24. Mrs Paul Cawthorne, Oct. 11. Paul Cawthorne, Oct. 18. Mrs. W. W. Wooldridge, Oct. 24. Robert Willis Almond, Oct. 9. Sgt. WilliamG arrett, Oct. 9. Bill Henry Williamson, Oct. 13. Robert L. Doss, Oct. 13. Watkins M. Abbitt, Jr., Oct. 20. C. S. Jenkins, Oct. 11. J. G. Plunkett, Oct. 6. William McFadden, Oct. 13. Mrs. Roy Robertson, Oct. 1. Mrs. Claude Jennings, Oct. 4. Mrs. Hal Bryant, Oct. 4. Percy George, Oct. 19. Mrs. Leslie Gordon, Jr., Oct. 4. Miss Nina Barlow, Oct. 4. Mrs. Estelle Moore, Oct. 8. Mrs. R. D. Robinson, Oct. 19. Mrs. W. M. Hancock, Oct. 9. John T. Hall, Oct. 10. Rev. D. M. Spence, Oct. 14. Mrs. Jessie Carwile, Oct. 15. W. W. Sweeney, Oct. 22. Mrs. Frank Gilliam, Oct. 23. Miss Mary I. Babcock, Oct. 23. Miss Lula Iriby, Oct. 24. Mrs. F. L. Murphy, Oct. 28. Mrs. Ruth Wheeler, Oct. 28. iMs. George Harris, Oct. 16. Miss Kitty Lou OBrien, Oct. 30. Miss Claudine OBrien, Oct. 30 Mrs. D. E. Torrence, Oct. 17. Mrs. Sylvia iSifferd, Oct. 31. Mrs. A. R. Harwood, Sr., Oct. Mrs. B. B. Harris, Oct. 5. Lloyd Richardson, Oct. 12. Katherine Panson, Oct. 30."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "Etta Beale, Oct. 6. <mark>James</mark> Beale, Oct. 26. Bennie"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "Etta Beale, Oct. 6. <mark>James</mark> Beale, Oct. 26. Bennie"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1669.72, 533.69, 1841.98, 849.94], "bbox_id": "7bd1b57ffd", "file": "AppomattoxNewspapers_1955-1957a_0181.pdf", "page": 1, "text": "Thomas, Ashby Wright, Rebekah Barger Dale Doss, Bonnie Gilbert, Linda Jarrell, Marjorie Johnson, Mary Elizabeth King, Susan Nell OBrien, Cynthia Richardson, Judy Smith, Vickie Smith, Lina Trent, Brenda Williamsdn, Anne Crawley, Michael Johnson. Fourth grade, Mrs. Thelma W. Martin Harold Carter, Earl Day, Wayne Ferguson, Doug Mitchell, Mike Mitchell, Cecil Phelps, Wayne Phelps, David Reed, Richard Smith, Jimmy Torrence, Kathy Jo Bragg, Linda Carter, Gloria Jean Dos3, Sue Giles, Vickie Mayberry, Linda Slagle. Fourth grade, Miss Nola Burkey William Allen Bryant, John Gillette, James Gunter, Joe LeGrande, Wen dell Maddox, Charles Martin, Ron ald Millner, Herbie Pulliam, Joe Terry, T. C. Torrence, Priscilla Cole, Barbara Giaines, Carolyn Keys, Linda Phelps, Jane Wilson, Nellie Ruth Harris. Fifth grade, Mrs. Parris Watkins Abbitt, Kyle Almond, Marvin Cald well, Freddie Carter, Allen Conner, Freddie Grishaw, Irby King, Taylor Mabley, Billy Trent, Suzanne Gills, Margaret Johnson, Juanita Maddox,"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "Allen Bryant, John Gillette, <mark>James</mark> Gunter, Joe LeGrande, Wen"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "Allen Bryant, John Gillette, <mark>James</mark> Gunter, Joe LeGrande, Wen"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1151.74, 211.16, 1295.72, 849.45], "bbox_id": "d2126d310a", "file": "AppomattoxNewspapers_1962-1965a_0465.pdf", "page": 1, "text": "They spent Thursday with Mr. and Mrs. J. A. Carson. On Wed nesday they visited Mr. and Mrs. R. K. Martin. Mr. and Mrs. J. A. Carson at tended the reunion of the family of the late Henry Clay Turnes at Hollywood Baptist Church, Sunday. Patrick Lair, Jr. spent the week end at Virginia Beach. Michael Lair, who had been stationed in Norfolk, has been sent to the Caribbean for three weeks. Mrs. P. H. Lair entertained with a birthday party for her son, Matt, Thursday. Matt re ceived many gifts, but his bigg est surprise came when he re ceived from his parents, a mon key, Hobo, which was flown in from Miami. Mrs. James Guild and three children, of Mechantic, will visit in the home of her brother and sister-in-law, Mr. and Mrs. E. M. Sears. Lt. Ronald Coleman, of Ocea na, and Mrs. Coleman, of East Tennessee State University spent last week end with their parents. Mr. and Mrs. Fred Glover and children, of Huntsville, Ala spent last week with his mother, Mrs. Agea Glover. Recent guest of Mr. and Mrs. R. L. Gilliland were Mr. Gilli lands mother and sister-in-law, Mrs. G. L. Gilliland and Mrs. Francis Hankins, of Yazoo, Miss. Mr. R. H. Gray, Sr. had as his guest last week Mr. Georgie Tyler and his wife, Dr. Tyler, of New York, N.Y. Mr. Gray entertained Tuesday night in honor of them. A surprise birthday dinner was given by Mr. R. H. Gray, Sr. Friday night for his son, R. H. Gray, Jr. Mrs. R, H. Gray, Jr. and Mrs. H. P. Lair entertained Saturday night with a buffet supper at the Lair home honoring Mr. R. H. Gray Jr. for his birthday. Those attending were Mr. and Mrs. Billy Watkins, Mr. and Mrs R. E. Fore, Jr., Mr. and Mrs. R Glenn, all of Farmville Mr. and Mrs. Anderson Coleman, of Prospect Mr. and Mrs. Stuart Farrar, Mr. and Mrs. R. E. Fore, Sr., and Mr. and Mrs. John Hix."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "in from Miami. Mrs. <mark>James</mark> Guild and three children,"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "in from Miami. Mrs. <mark>James</mark> Guild and three children,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [190.81, 730.6, 523.8, 1806.92], "bbox_id": "92bda03f03", "file": "AppomattoxNewspapers_1922-1923a_0366.pdf", "page": 1, "text": "they, come again. Our newly married couples begin to look like old married folks, not that there are any wrinkle on theii brows or care marks on their faces, but that they do seem to be so ai home with each other. Our local post-office affairs are ominously quiet. But a short time, new, before the appointment of M r Buggi successor has to be made and all as yet is guess work. Opr warehouse authorities will havé no sales on Thanksgiving day, and after 1st of next January no sales on Saturdays. This last change might not be the best thing to be done as many farmers must come to town on Saturdays and I VIney truble_ couib vu -  .  - , I Kidney trouble causas quick or unsteady Blight very conveniently bring a I heart beats, and makes one eel as though .i __ tv, Tf hnw-l hey had heart trouble, because the heart i- lU tlebacker with th mu . If, now JV r.worklng ln puniping thick, kidney ever, they fetch a few eggs instead I poisoned blood through veins and arteries they will carry back home with It used to be considered that only urina win v j I roubles were to be traced to the kidneys them more in returns for th I but now modern science proves that nearly _ I 11 constitutional diseases have their begin mount.invested. I .mg In kidney trouble. What a Splendid thing for tln l If you are sick you can make no mistake .  n  . negro that he i. ont ol pol- J O W B t a S   itics. No more hanging around the I Swamp-Root, the great kidney remedy I Doles all day expecting something, I soon realized. It stands the highest for it J r . . . , , ...I wonderful cures of the most distressing case to return to the cabin at night with I ln1 is sold on its merits a hie  disgust, hungry, footsore and  by all druggists in fifty- -rtB weary. No longer the all night j is You may have a meeting with the ignorant and in-1 .ample bottle by mail Home of ftwamp-Roo   . , _ , I hee, also pamphlet telling you how to finí flammatcry norator stirring pie I ,ut f y0U have kidney or bladder trouble indicies and kindling into flame 1 Mention this paper when writing Dr, Kill mouldering pinions and prejudicio- I  Co- Binghamton. N. Y. On tomorrow every negro in the Southland should make it the sub ject of special thanks that the na tive whites are making and exact ing our laws. Left to themselves they would relapse into laborism within two decades with Booker Washington the high priest of the temple. As an imitator, the negr , or some of them at least, have un questioned capacity, but without something worthy of imitati in, deg radatiou is inevitable. This is not written in malice or wi.h unkind- ness towards those with whom the whites have been reared and iron whom he has received uniform courtesy and consideration. Nw that the days are so short, dayie so slow to break and dusk to come so soon our electric lights are great comforts. They keep watcl during the long watches of the night and are always ready to welcome us in the early morning. The ohampion shot of the season hant been named as yet, though Meaars. John Watkins, John Berk leyr John Hamlet, and IF. R. Rich ardson are leaders in the sport. Each of course has th best guu and the best dog. Dr. Alfred Morrison is contrib uting weekly to the columns of the Herald weekly articles of local his torical interest. The old passenger depot of the N.  W. has now be-.n deserted by the.express company, its office hav ing been rei-oved to a more central location on Main St. The wonder is that it was ever considered large enough for its purposes. TheCommercial Company of our town has g Aten to be one of the moat liberal of our advertisers the result being that there is always tiustle about tbe store and business -always activo. Printers ink is a winner every time and all the time Farmville, as a town, doesnt appre iate that  It shoud, or else it would! getting reqdy fw James- te v a ."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "yet, though Meaars. John <mark>Watkins</mark>, John Berk leyr John"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "yet, though Meaars. John <mark>Watkins</mark>, John Berk leyr John"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1279.09, 401.39, 1443.07, 1968.23], "bbox_id": "12fa8e9d1f", "file": "AppomattoxNewspapers_1898-1902a_0204.pdf", "page": 1, "text": "The United States Government refused to arbitrate the Austria-Hungary claims aris ing from tho Hazleton, Pa., riots. It was reported that no additional yellow fever eases had developed at Santiago. A murderous assault was committed by two negroes on William Ahern, an operator in a block tower on the Delaware Railroad. Two negroes answering the description of tbe assailants have been jailed. Dick Williams, a colored murderer, was hauged by a mob in Almn, Kansas, but was resuscitated by tbe town marshal, who cut him down. The Trunk Line presidents havo agreed to increase tho grain rats from Chicago to Eastern markets three to live cents on the 100 pounds. Captain Watkins ol tho Paris, admitted bis responsibility lor the stranding of tbe steamer, and his license was suspended for two years. Tbe Baltimore and Ohio Southw estern was sold for three nnd a half militons to a committee representing the security-holders. Henry M. Flagler has presented J. CJsby Wise, of Atlanta, G., with a 40,000 house and 200 shares of Standard Oil slock. The accidental setting off of a burglar alarm frightened Dr. Mary C. Edmonds to death in Sau Fiam-lsco. Robert Hester, sixteen years old, accident ally killed bis brother at Rodmans Station, Norfolk county, Yn. Mrs. Ada Addis-,Sterke was arrested in Hauta Barbara for threatening to kilt Attor ney Grant Jackson. One hundred and fifty miners arrived at Victoria from the Klondike with 126,000 in gold dust. Mrs. Ella Sba.tuck was arrested in Erie, Pa., on the charge of murdering her hus- baud. John K. Nevltt was struck and killed by a train nt a Crossing near Alexandria, Va. ihe great Christian Endeavor convention in Detroit, Michigan, wus concluded. Two passengers were killed aud thirteen injured In a wreck at Newman, Cal. Five men were injured by an explosion oi gas in tbe mines at Ehreufeld, Fa. The Scott Paper Mill in Philadelphia was turned. L obs 100,000. Section bands employed by the Chicago Junction railway struck. The workers in the tin mill at Lisbon, went on a strike. Charles Graham, tbe ballad writer, died iu New York. Mr. W. H. Ijams, who has been reeently re-elected Trensur r ol the Baltimore and Ohio Railroad, lias been in the employ ol tbe Company for 46 years and has beeu Treasurer since May 1866. When a small boy in Baltimore, ho saw the great parade that Baltimoreans arranged to celebrate the laying of tbe corner-stone of tbe Baltimore aud Ohio Railroad on July 4th, 1828. A New Orieaua judge awarded two while children to the care of their colored foster mother as agnlnst their own mother, the children crying to remain with their colored mammy, who had cared for them for years. Two rabbis and several other persons were Injured by the fall of a platform at Ihe lay- lug of the cornerstone of a synagogue in Cleveland, Ohio. A train on tbe A.  N. C. R. R. wae de railed by cows at Morebeud City, N. C., and Harry Mansfield nnd n colored waiter wete killed-. _____ _ ___ . Justice Truax, in the New York Supreme Court, granted an injunction forbidding a labor union from boycotting Charles Me- Queed. E. Weatherford, an engineer, was mur dered while usleep on bis traiu at Tuscnm- bin, Ala. His son was arrested ou suspi cion. Six of the seven memDers of William ltein- bards family were killed by a traiu striking their carriage at Columbus, O. During a terrific storm on Lake Erie a steamer and two schooners were driven ashore, but no lives were lost. James McCauley, former city treasurer oi Easton, Pennsylvania, tried to commit sui cide. Steven Gardner, a prominent railroad man, did ut Stamford, Conn., of apoplexy. Henry Wnnklius big sluum bakery In Philadelphia was burned loss 75,000. Frank Smith deserted bis two little girls in the woods near Carbondale, Pa. Hundreds of people in Texas who took refuge from the floods on a mound nre starving and also suffering torture from the bites of poisonous r tiles. The bodies ol twenty-three drowned persona were recov ered lu Robertson county. Della Lewis, aged eight years, was kid napped by a rag pedlar from her home, in Darby, Delaware county. Pa., and found by tbe police of Woodbury, N. J., who also ar rested hr abductor. The Wisconsin Central Railroad was sold at Eau Claire, Wis., for 47,310,000 to the re organization committee. Henry Taylor was sentenced in Lexing ton, Ya., to twenty years In the penitentiary for felonious assault. E. S. Leigh, Jr., of Richmond, Va., was elected president of tbe Southern Wholesale Grocers Association. William K-atop, wife-murderer, commit ted suicide in Lis cell in Moyamenslug prison, Philadelphia. J. B. Clifford was arrested In Martins- btirg, W. Va., on tbe charge of Improperly using the mails. The fireman wag killed and twenty pas sengers injured in a wreck on tbe Burling ton. Losses to the railroads by tho floods will aggregate several millions. Santiago hotels are now Infected with yellow fever. Judge Candler issued a temporary re- straioing older preventing the transfer ol stock of Atlanta street railways, as the re sult of a bill filed against tbe combination of the railways of tbat city recently effected In Baltimore. At the Christian Endeavor Convention, In Detroit, Rev. Dr. Francis E. Clark delivered j his annual message, and Secretary Baer read his annual report, showing splendid growth ! during tbe year. Ex-GoTernor John Peter Richardson, cf j South Carolina, died suddenly of heart dis ease. Judge Taft, of tbe United States Court, sustained the appointment of S. M. Felton as receiver of tbe Columbus, Sandusky end Hocking Railroad. Great destitution prevails In Texas as a re sult of tbe floods, and the War Department at Washington bas issued rations for tbe starving people. Consolidation of tbe ice companies, from Maine to Chicago, was practically effected in New York. Emanuel Hockstadler was iDdletedin Nor folk, Va., for passing a forged check on E Wertheimer. Robert Hill, bend of tbe glassworkers union, was accidentally killed near Tiffin, O, Robert Bonner, tne publisher, nnd for many years the owner of famous race horses, i9 dead. The transport McClellan arrived at New York, with three chs  s of yellow fever. Tbe Acting Comptroller of the Treasury decided that Rear Admiral W. T. Sampson is not entitled to the pay of tbat grade from August 10, 1898, when he was commissioned by tbe President, to Mardi 4 last. To a Pennsylvania de legation President McKinley expressed bis appreciation of tbe services of tbe Pennsylvania soldiers in the Philippines. Arrangements have been practically com pleted for iho presentation to Admiral Dewey of tbe sword voted to him by Con gress."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "the 100 pounds. Captain <mark>Watkins</mark> ol tho Paris, admitted"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "the 100 pounds. Captain <mark>Watkins</mark> ol tho Paris, admitted"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1005.33, 561.7, 1174.09, 1204.64], "bbox_id": "40ed9b855e", "file": "AppomattoxNewspapers_1949-1952a_0453.pdf", "page": 1, "text": "The student body is glad to have Allen, Sarah and Norrald Watkins back with them. We are also glad to see Margaret Madison in school after her illness. Mazie Hubbard and Rudolph Robinson have returned too, were happy to report. The Juniors are studying Fpla nations in English and find it quite interesting. They are on their sew ing unit in Home Economics. The majority of the girls are going to make jumpers, weskits, or skirts, Jacqueline Lawing and Rachel Pan key have some beautiful woolen material. Like to see them when they are completed. We hear the tenth graders were planning to make Os on their re port cards. Wonder what they real ly got? An effort is being made in thi homeroom to make students mor alert in their classes and do better work. They are progressing, they tell us. The ninth grade girls are learn ing Kick Ball in Physical Ed. class Some of those girls now know what that foot can be used for. . We wonder who Barbara Hub bards and Virginia Hubbards dream boys are. Wonder if it is who we think? Last Friday the New Farmers of America held an asscnibly program for the observance of conservation week. Reports were given on con servation and what it means to the farmer. County Agent G. L. James spoke on conservation work being done in the county and showed slides of conservation practices carried on at different county farms. The new N. F. A. officers and members are learning quickly, and are taking over where the old mem bers who have graduated left. The Seniors trip to Virginia State is Saturday. They will tour the school with guides showing them all the buildings. They will attend football game and an evening pro gram at the school. Didnt Hiawatha Johnson sing in assembly Friday. Hes another Perry Como. The tenth graders begin sewing next week. This term they will sew on woolens. It was cottons last term. The news for the week is all in We close our column with the thought To err is human, to for give divine."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "Allen, Sarah and Norrald <mark>Watkins</mark> back with them. We"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "Allen, Sarah and Norrald <mark>Watkins</mark> back with them. We"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [606.73, 544.05, 773.75, 1968.08], "bbox_id": "2241b1c9ad", "file": "AppomattoxNewspapers_1898-1902a_0352.pdf", "page": 1, "text": "The steamer Elihu Thompson ar rived at Port Townsend, Wash., from Cape Nome, with passengers, many be ing without means. A serious state of affairs is reported to exist at the Cape. The striking employees of the Craw ford Woolen Mills, In Martinsburg, W. Va., returned to work. Seven hundred male and- female clgarniakers in McSherrystown, Pa., went on a strike. William Henry Pitsnogle died at his home In Martinsburg, W. Va. The cruiser Baltimore, in command of Rear Admiral Watson, arrived and anchored In New York harbor. The cruiser will be placed out of commis sion to undergo extensive repairs. A woman giving her name as Mrs. Rosa Heiking, aparently Insane, cre ated a scene at the White House in sisting upon seeing the President. Three thousand, union carpenter went out in Chicago because the con tractors refused to allow the Saturday balf-holiday. By an explosion at the -gas works in Chambersburg, Pa., Georg? Davis, a laborer, was killed and the gas works wrecked. The United States monitor Wyoming was launched at the shipyard of the Ur ion Iron Works, in San Francisco. Ex-President Cleveland has declined President McKinleys appointment on the international peace tribunal.  Henry Shue, who was drenched .with vitriol at the York Pa. Chemical Works, died from his injuries. Thirty-eight weavers at the Craw ford Woolen Mills In Martinsburg, W. Va., went on a strike. Patrolman Perry Gates was shtt dead by three thieves in Lacrosse, Wis. The West India hurricane which swept the coast towns of Texas nearly entirely destroyed thè oity of Galves ton. It is estimated that 2000 people perished, and the property loss will j run up Into the millions. The towns of Sabine Pass and Houston also suf- j tered heavy losses. In Galveston 4009 houses were destroyed. The executive board of the United Mine Workérs left it in the hands of President Mitchell and Secretary Wil son to order a strike if the influences said to he at work to bring about an adjustment of the pending differences do not succeed. Maria Santelio, a little 8-year-old girl, saved the Chicago express from a bad wreck at Bound Brook, N. J. She removed a large tie from the track while six men stood idly by. The excursion steamer John Endicott struck a sunken lock off Minot Light, Massachusetts, and foundered, but all of her 600 passengers were safely taken off. Customs officials in.New York seized the trunks of Mrs. ElizabethShanabau aud Mrs. Anna E. Conlin, dressmakers, who had dresses iu them they had not declared ou. Mrs. Margaret Shannon Was saved from death In the quicksand at Lake Hoptacoug, N. J., by Farmer Joseph Saunders, who rescued her after she was nearly lost. James F. Menns, a watchman at the New Haven poorhouse, became de spondent from the miaery he saw and committed suicide. Corone i.ioyd. In St. Louis, held tho Seckner Contracting Company respon sible for the electrocution of two po licemen by Improperly placed wires. Wm. Bulock, colored, who had been three times tried in Frehold N. J., for the murder of the chief of police of Red Bank, escaped from jail. Rev. Lorenzo Waugh, supposed to he the oldest Methodist preache inthe world, died suddenly in a railroad sta tion in Williams, Cal. The clgarmakcrs of A. F. Hostefter jf Hanoyer, went on a strike- because he refused to adopt the shop system.  Four men were horribly burned In a powder explosion at the Sterling col liery, near Shamokln, P a., - The strike, of the iron-workèrs on the new Bast river bridge in New York was settled by a compromise. Chief Illowahe, an aged medicine man of the Yakima tribe, was stoned to death in Washington State. Night Watchman Aulgur, of the Chi cago and Alton Railroad, was killed in Marshall, Mo., by robbers. Fire destroyed Samfreys Hotel and a number of adjoining houses in Lib erty, Tioga county, Pa. The National Association of Letter Carriers, in session in Detroit, re elected the old officers. Officers had a battle with safe-blow ers near Canauville, Ohio, and cap tured two of them. Jealous John Riedeck killed his wife and himself in Brooklyn. The Spanish-American War Nurses Association was organized, at New York. The Carnegie and Rockefeller Inter ests have ordered the construction of nineteen big vessels to export iron and steel. William Watkins, aged 88 years, was killed By a CapeMay accommodation train at Woodbury, N. J. George Vanlew,. a telegraph lineman,1 of Roanoke, Va., was killed at Eck- man, W. Va. David E. Folsom was nominated for governor of Montana by the Republi cans.- Wm. J. Morgan, Comptroller of the State of New York, died at Albany. . Dysentery prevails in parts of Adams county, Pa. The Secretary of War has instructed General Shatter, commanding the De partment in California, to discharge all volunteers in San Francisco. The Western Federation of Jiiners has 8d unions and about 10,00uiins. The Navy Department win bring home the remains of officers mid en listed men of the navy and marine corps who were killed since Aprili 1898. Capi Harry E. Householder, who was . captain of Company I, First West Virginia Infantry, during the Spanish- American War, died at his home in Berkeley Springs. At Saratoga, N. Y., the Republican State Convention nominated B. B. Odell, Jr., for Governor, and- Tlgtothy L. Woodruff im i Lieutesant-Goyemer. Rev. E.M. Cravath, twenty-two yeass president òf JFisk University, at Nash- tllo Team, died in Minnesota."}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "she was nearly lost. <mark>James</mark> F. Menns, a watchman"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "she was nearly lost. <mark>James</mark> F. Menns, a watchman"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1210.95, 520.6, 1366.3, 1212.4], "bbox_id": "c3014b37d6", "file": "AppomattoxNewspapers_1918-1922a_0402.pdf", "page": 1, "text": "The State Board of Education an nounced the election of sixty-four di vision school superintendentsthese having no opposition. Elections were made for all the cities except Alex andria, Danville and Newport News. There is a single applicant for Dan ville, and the -passing of the city is a surprise. C. E. Crossland, president of Averett College, is understood to be the choice ot certain persons. Dr. Crossland and the trustees of his col lege are said to bare suffered a mis understanding over the question of dancing, and it is reported that he may resign. His friends are now urg ing that he be made superintendent of schools. Following aro the elections as an nounced Accomac, G. C. Joynes, Onancook Albemarle, A. L. Bennett, Charlottes ville Arlington, Fletcher Kemp, Rosslyn Alleghany, J. G. Jeter, Cov ington Amelia, W. R. Wrlggles- worth, Blackstone Amherst, W. L. Tucker, Amherst Appomattox, N. R. Featherston, Pamplin Augusta, F. M. Somerville, Staunton, R. F. D. 6 . Bedford, C. M. Abbot, Bellevue Botetourt, E. A. Fainter, Fincastle Brunswick, W. B. Balen tino, Raw lings Buchanan, M. L. Combs, Grundy. Charles City, Herman L. Harris, Toano Charlotte, E. H. Hall, Drakes Branch Clarke, L. D. Kline, Win chester. Dinwiddle, O. B. Zehmer, Dinwid dle. Elizabeth City, J. H. Brent, Hamp ton Essex, W. G. Rennolds, Center Cross. Fauquier, F. Osgood Smith, Wart renton Franklin, R. A. Prlllamn, Rocky Mount. Giles, R. H. Farrier, Newport Grayson, Lyle T. Cox, Independence. Halifax, H. J. Watkins, South Bos ton Hanover, J. Walton Hall, Ash land Henrico, A. C. Cooper, Rich mond, Henrico Courthouse Henry, W. B. Gates, Martinsville Highland, R. E. Mauzy, Hlghitown Isle of Wight, Gavin Rawls, Carrsville. Lancaster, Frank W. Lewis, Morat- tico Loudoun, O. L. Emerick, Pur- cellville. Mecklenburg, C. B. Green, Boyd ton. Nelson, W. E. Kidd, Lovingston Norfolk, James Hurst, Norfolk. Prince Edward, T. J. Mcllwaine, Hampden-Sidney Prince William, Woodstock -Smyth, B. E. Copenhaver, Pulaski, E. L. Darst, Dublin. Rappahannock, H. D. Hite, Front Royal Roanoke, R. E. Cook, Salem Rockbridge, R. M. Irby, Lexington Rockingham, John C. Myers, Harri sonburg Russell, R. N. Anderson, Le banon. Shenandoah, C. V. Shoemaker, Woodstock Smyth, B. E. Copenhaver, Marion Southampton, R. M. Newton,"}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "Independence. Halifax, H. J. <mark>Watkins</mark>, South Bos ton Hanover,"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "Independence. Halifax, H. J. <mark>Watkins</mark>, South Bos ton Hanover,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [949.65, 551.63, 1123.37, 1535.3], "bbox_id": "993b492efe", "file": "AppomattoxNewspapers_1955-1957a_0560.pdf", "page": 1, "text": "The public is cordially invited to attend the revival and home com ing services at the Galilee Baptist Church this Sunday, beginning at 1130 A. M. The pastor of the church will deliver a special ser mon at the morning service and the Mount Shiloh Baptist Church choir will render music. Dinner will be served at 100 P. M. Ait 230 P. M., special service will be held by the St. Mathews Baptist Church, pastor W. H. Watkins and his choir. The home coming rally will be reported at the beginning of the evening service. The revival serv ice will begin on Monday evening at 8 P. M. The young Rev. Charlie Franklin, of Pamplin, a student of Virginia Seminary and College will be the guest minister for the week. A very large crowd attended the annual home coming and revival services at the Jordan .Baptist Church last Sunday. The Rev. Mc- Cienon, of West Virginia, was the pastor in charge and is conducting the weeks service. Dinner was serv ed at 2 P. M. The afternoon serv ice began at 3 P. M. The pastor and choir of the Promise Land Baptist Church was the special guest. The Hasidiah Baptist Association will convene with the Mount Zion Baptist Church, Red House today and Friday. The theme .of the meeting is The role of the church in a changing world. The modera tor, Professor H. A. M. Jones will deliver his annual message at the afternoon session.- The annual ser mon will be delivered by the Rev. L. S. Ward. The youth program will be conducted Friday afternoon. The Womans Auxiliary will meet jointly with the association.  Mrs Westalla Allen will deliver her an nual meesage following the modera tors address. A panel discussion will also be held Friday morning A large crowd attended the fu neral services for the late David Preston at the First Baptist Church last Wednesday at 2 P. M. The pas tor of the church, Rev. N. R. Jor dan officiated. He was assisted in the service by Reverends C. A. Mar shall and R. Q. Lawing. Special mu sic was furnished by members of several local choirs, with Miss Anne Fleshman at the piano. Remarks were made by Mrs. Price, county supervisor, and Principal R. E. Patrick. The floral designs were in large numbers. The following survive a mother, father, step father, grandfather and two grand mothers, one sister, 5 aunts and six uncles. Burial was held in the com munity cemetery. A large crowd attended the re gular evening services -at Mount Shiloh Baptist Church last Sunday at 8 P. M. The Goldentone Singers of Lynchburg had charge of the service. They were assisted in the service by the Gospel Trumpters, of Appomattox and the Traveling Six, of Monroe, Va. Special services will he held at the First Baptist Ohurdh this Sun day at 8 P. M. The Rev. Charlie Franklin, of Pamplin, will be the guest speaker. Mrs. BettieFlood and daughter, Betty Lou and her company are spending some time here. The Rev. Garland Thompson, of Lynchburg preached in the morn ing service at Promise Land Sun day. Revival will begin at the Zion Baptist Church, Pamplin this Sun day, beginning at the morning service. Mr. and Mrs. James Fleshman and his aunt, Mrs. Hayden, of Chi cago were visitors here last week."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "Church, pastor W. H. <mark>Watkins</mark> and his choir. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "Church, pastor W. H. <mark>Watkins</mark> and his choir. The"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.44, 650.49, 2009.97, 1231.91], "bbox_id": "0d91780b79", "file": "AppomattoxNewspapers_1960-1962b_0452.pdf", "page": 1, "text": "The marriage of Miss Lucye Watkins Seay, daughter of Mr. and Mrs. Cameron Cardoso Seay, to James Hubert Thompson, son. of Mrs. S. Winston Garnett, all of Richmond and the late Mr. Ver non S. Thompsbn took place Sat urday, October 14th. at 330 P. N. in Second Presbyterian Church, Richmond Va. The Rev. Dr. James W. Clarke, Pastor officiated, using the double ring ceremony. Given in marriage by her father, the bride wore a wedding gown of ivory silk peau de soie, fash ioned with a circlet neckline ap- pliqued with Aleucon lace, em broidered in seed pearls and cry stals, bracelet length sleeves. The skirt was styled with a flat front so ft unpressed pleats on either side and back. The Chapel train cascaded from a bustle-type bow. Her imported English illusion veil fell from a dcmi-cloche of satin Alencon lace and pearls. She car ried a boquet of lilies, stephano tis and orchid.. The bridesnaids wore dresses of Opera Green taf feta with matching velvet head dresses. Mrs. Lynn .Furman Floyd of Fairmont, North Carolina was mat ron of hqpor. Other attendants were Miss Sandra Sandlin, Miss Susan Patricia Butler, and Mrs. Robert Lee Brown, all of Richmond, Mrs James Ray Thomas of Hampton, and Miss Carolyn Walker Whitting ton of Greensboro, North Caro line. Robert Milliam Taylor of Rich mond was best man. Ushers were Lt. Kenneth Church Gimbert of Virginia Beach, William Claborne Hendricks, Charles Dolese Klotz, William Rodman Martin, and Aub rey Jackson Stewart, Jr. all of Richmond. iMusic was provided by Wyatt Insko, Church Organist and Luck Wills Soloist. A Reception was held at the Jefferson Hotel, im mediately following the Ceremony. After a northern trip, the couple will live in Richmond."}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "marriage of Miss Lucye <mark>Watkins</mark> Seay, daughter of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "marriage of Miss Lucye <mark>Watkins</mark> Seay, daughter of Mr."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [546.51, 306.53, 724.76, 750.67], "bbox_id": "12d726e7fd", "file": "AppomattoxNewspapers_1952-1954a_0016.pdf", "page": 1, "text": "The local chapter of New Farm ers of America was represented with the largest delegation in its history .1 The following young men made ui the delegation Narrold Watkins and McKinley Tanner, state officers Curtis Whitted and Willie Lilly delegates Winston Jones, Claudi Lambert, Algie Williams and Will iam H. Turner, judging team Hia watha Johnson, James Itnnix, Othe phous Johnson, and Charles Booker quartet Arnold Kleshman and War ren Jones, special visitors. The loca chapter received the following a- wards the bronze placque for chap ter participation, and a modern fanner degree pin awarded to one of its members, Haywood D. Walk- er. It. Q. Lawing, local chapter ad visor, accompanied the delegation. The P.-T. A. will hold its regular monthly meeting in the agricultural class room this Monday at 8 I. M. All patrons are asked to come out. An appreciative crowd attended the first womans day program at the Promise Land Baptist Church last Sunday evening. The following churches took an active part Mount Shiloh, Fust Baptist, Galilee and Mount Zion, Red House. Mrs. C. M. Harvey served as mistress of cere mony. Prayer was given by Mrs. Lucy Wheeler. The welcome address was given by Mrs. Elsie Walker and Mis. 1 neda Harris responded. Mrs. Margaret Lawing Collier, of Black- stone was the guest speaker. Her address was a challenge to the en tire audience. She spoke from the sioject What women can do to Christianize the world. Remarks were given by Mrs M I r,.- - , . i R e v XT a r  1  f - J T i e e a n d Rev. N. R Jordan and the pastor of the church,"}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "ui the delegation Narrold <mark>Watkins</mark> and McKinley Tanner, state"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "ui the delegation Narrold <mark>Watkins</mark> and McKinley Tanner, state"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [598.09, 524.19, 747.93, 863.03], "bbox_id": "ed8b7f6937", "file": "TimesVirginian_1981a_0067.pdf", "page": 1, "text": "The jazz ensemble includes trumpeters, Keith Leonard and Timmy Lawson saxophonists, Bruce Saunders and. Richard Baxter tenor saxophonist, James Bohannon, Jr. trombo-  nists, Kevin Jaggers and J. C. Rogers, and a rhythm section of pianist, Allen Smith bass guitarists. Dean Hamilton and Sylvester Watkins and drum mer, David Coffey. A special feature on the program will be music perform ed by the S tarliters, a professional band .working in the central Virginia area. They play a variety of music from progressive country to blu es and fifties rock. The concert will conclude with the Jazz Express and the Starliters playing a special arrangem ent for combined bands. Mr. Coffey performs with both bands, and he feels that jthe copibined concert is a. good musical experience for dedicat ed band students at the high School to perform with profes sional musicians in a public performance,"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "Richard Baxter tenor saxophonist, <mark>James</mark> Bohannon, Jr. trombo-  nists,"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "Richard Baxter tenor saxophonist, <mark>James</mark> Bohannon, Jr. trombo-  nists,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.97, 471.13, 2406.27, 869.5], "bbox_id": "2cf6397aa5", "file": "AppomattoxNewspapers_1955-1957a_0292.pdf", "page": 1, "text": "The James River Fox Hunters Association has accepted the invita tion from the sportsmen of Appo- miattox County to hold their Annual Bench Show and Field Trials here on October 10, 11, 12 and 13. Headquarters for the event will be the American Legion Hall. Bench Show will be held Wednes day, Oct. 10, at 800 oclock, at the Appomattox Ball Park. First Cast of Hounds October 11, at 700 A. M. Bench Show Judge Professor N. W. Weldon, Stovall, N. C. Ring Master Herbert Gordon, of South Hill, Va. Master of Ceremonies, Congress man Watkins Albbibt, of Appomat tox. Master of Hounds M. W. East, of Roanoke, Va. Nationally known Field Judges se lected from Tennessee and Virginia. Officers of the James River Fox Hunters Association are A. A. LeGrand, president, Boyd- ton, Va. E. W. Harvey, Vice President, Appomattox, Va. M. E. Patterson, Secretary-Treas urer, Lynchburg, Va. F. S. Clements, Assistant Secre tary, Lynchburg, .Va. Painting Class Starts Oct. 10"}, "highlight": {"text": {"matched_tokens": ["James"], "snippet": "The <mark>James</mark> River Fox Hunters Association"}}, "highlights": [{"field": "text", "matched_tokens": ["James"], "snippet": "The <mark>James</mark> River Fox Hunters Association"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [102.26, 920.75, 266.04, 1842.0], "bbox_id": "3af26ec491", "file": "TimesVirginian_1976_0162.pdf", "page": 1, "text": "The Golden Echoes of Evington, Va. will render a musical program at the Promise land Baptist Church this Sunday evening at 7 p.m. All Ulcers, members and friend! are asked to come out. This service will take the place of the egulaFevefiiiigservfoe.  The 26th anniversary of the ladies Aid Club of the Galilee Baptist Church was held last Sunday evening at 3 p.m. Lucile Martin served as the mistress of , ceremony. The Mount Airy Baptist Church, pastor and choir were the special guest. The following program was carried out in a very . appreciative manner A call to worship, mistress of ceremony Opening hymn guest choir Scripture, Mrs Eva Allen Prayer, Mrs Dorothy Stevens Welconte Mrs. Dorothy Panneli Respon se, Mrs. Ethel Tanner Greet mgs were extended from the following Ladies Clubs Pro mise Land Mount Shiloh Zion Baptist Mount Zion Red House Mount Airy Peaceful Grove Springfield and Sulpur Spring Introduction of speak er, Rev. Lawing Sermon, Rev. H. W. Piryor Music, Guest choir Offering, Miss Helen Stevens, Mrs. Eva Allen, and Mrs. Dorothy Panneli Re marks, Pastor Lawing Closing hymn, guest choir Benediction, Rev. Pryor. Everyone present enjoyed the entire service. A large crowd attended the special service entitled Cut ting the Gospel Cake last Sunday evening at 7 p.m. sponsored by the Jordan Baptist Church. The following program was called with Mrs. Dorothy Turner serving as mistress of ceremony special selection by the Canaan Baptist Senior Choir Scripture, Mrs. Veoia Mosley Prayer, Mrs. Mary Lamberth Music, Guest choir, Welcome, Mrs. Martha Watkins Response, Mrs. Ellen Davidson Pageant, Ingredi ents of the Gospel Cake was given by the following ladies with Mrs. Martha Pankey as narrator Flour, Mrs, Pinkey Humbles Butter, Mrs. Patricia Turner Sugar, Mrs. Mary Trent Raisins, Mrs. Doris Terrell Figs, Mrs. Mary Holland Honey, Mrs. Carter Austin Eggs, Mrs. Ann Franklin Milk, Mrs. Bessie Watson Leaven, Mrs. Eliza beth Scott Spice, Mrs. Elnora Franklin Salt, Mrs. Diane Humbles Almonds, Mrs. Annie Trent Wine, Mrs. Willie Jones. A selection. Guest choir Presentation of speaker, Mrs. Hilda Jones Sermon, Rev. R. Q. Lawing Blessing and cutting of cake, Rev. C. L. Elliott, pastor of church Solo, Mrs. Mary Hollands Offering,. Mrs. Christine McCoy, Mrs. Edna Lamberth nd Mrs. James Carter. Remarks wern"}, "highlight": {"text": {"matched_tokens": ["Watkins"], "snippet": "choir, Welcome, Mrs. Martha <mark>Watkins</mark> Response, Mrs. Ellen Davidson"}}, "highlights": [{"field": "text", "matched_tokens": ["Watkins"], "snippet": "choir, Welcome, Mrs. Martha <mark>Watkins</mark> Response, Mrs. Ellen Davidson"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
