{"document": {"bbox": [1832.12, 292.9, 2002.99, 658.35], "bbox_id": "2b584808f6", "file": "AppomattoxNewspapers_1939-1943a_0502.pdf", "page": 1, "text": "who have been spending some time with Mrs. James B. Abbitt, left to day toiin. Lt. McKee in New Or leans. Marvin Godsey, of Culpeper vis ited his mother, Mrs. A. F. Godsey Tuesday. Mr. and Mrs. Homer Blackwell and family, who have been liying in Norfolk have moved back to Appo mattox and are occupying the resi dence formerly occupied by Mrs. Berta Smith. Miss Dorothy Ould, who has been visiting Miss Betty Parriott, of- Farmville, has returned to the home of her grandmother, Mrs. W.L.Ould. Mrs. Oscar Moss and daughter Nancy, are visiting in the home of Mrs. J. E. Sears. Dan .Browning, of Richmond, was a recent guest of Mrs. R. N. Dawson. Mr. and Mrs. Lloyd Bradley, of Richmon spent Sunday with Mr. and Mrs. R. M. Mann. Mrs. G. L. Doss and daughter, LeFern, who have been visiting re- latives here and in Lynchburg, re turned to their home in Portsmouth Tuesday. They were accompanied I by Miss Barbara Ann Johnson. Mr. and Mrs. J. A. Burke, Jr. of Richmond spent the week-end here."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "some time with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, left to day toiin."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "some time with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, left to day toiin."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1131.6, 491.57, 1300.9, 723.56], "bbox_id": "9e06b17c16", "file": "AppomattoxNewspapers_1954-1955a_0093.pdf", "page": 1, "text": "Western Railway at their general offices in Roanoke. Mr. Burke was a veteran of the Spanish-American War and World War I. He is survived by a daughter Mrs. Burke Bowers, and a son, Rich ard F. Burke, both of Salem, Vir ginia two sisters, Mrs. James B. Abbitt, Mrs. William T. Steele and two brothers, Richard L. and Jerry A., all of Appomattox, Virginia. Graveside services were conduct ed at 400 P. M. Saturday in Lib erty Cemetery, by Dr. Carl A. Coll ins, Jr. and Dr. Twyman Williams. Military services were participated in by American Legion Post 104 of Appomattox. Pallbearers included Gibson Max well, William T. Steele, Jr. Jerry A. Burke, Jr. William W. Burke Richard L. Burke, Jr., and R. F. Burke Steele."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "ginia two sisters, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs. William T. Steele"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "ginia two sisters, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs. William T. Steele"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2220.19, 303.0, 2384.51, 322.6], "bbox_id": "ddcf4f3b6d", "file": "AppomattoxNewspapers_1943-1947a_0008.pdf", "page": 1, "text": "Wanted A stroller. Please no tify Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Wanted A stroller. Please no tify Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Wanted A stroller. Please no tify Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.53, 308.52, 1901.5, 1078.85], "bbox_id": "aa998edfda", "file": "AppomattoxNewspapers_1939-1943a_0235.pdf", "page": 1, "text": "v lie spent the week end with her parents, Mr.and Mrs.C.C.Cralle. Mesdames G. F. Langran, C.G. OBrien and R. W. Stanley spent Wednesday in Richmond. Miss Ruth Gratz, of Atlantic City, is visiting her brother, Dr. M. Morton Gratz. Mr. and. Mrs. Edward Ransome have moved into the -Walton home on South Church Street. Frank Hanenkrat will drive to Radford Sunday, where he has ac- cepted a position. Friends are glad to hear tha Mrs. Florence Bingham is out after x recent illness. Otis Inge, of Lynchburg spent the weak end in the home of Mrs.F. T. Cawthorn. Mutt Cawthorn, of Petersburg returned today after spending sev eral days with his mother here. Marshall Babcock left yesterday for a years military service at For tress Monroe. W .T. Steele J r., of Richmond, p.nt Friday night in the home oi Mrs. James B. Abbitt. The U. D C will meet Thursday af.ernoon, February 20, with Mrs. H . B . Caldwell. Mr, and Mrs.David Caldwell left vVednesday for a weeks tr.p to W. Virginia. Mrs. J. R. Lawson and Mrs.S. L Ferguson spent Tuesday with Mrs. N. A Wagers in Lynchburg The Thursday afternoon bridge club meets today with Mrs. J . W. Flood. Harry Gordon Lawson will be tak en .o Memorial hospital, Lynchburg Saturday for treatment. Mrs. E . LeRoy Smith and daugh ter, Alice Lee, spent. Sunday ana Monday in Washington. I.he Appomattox high school base Bail team will begin practice on oi around March 1. Percy Car.er has returned to Ao- poma-tox and plans to operate a meat market in Babcocks Store. Local 4-H Club leaders plan to att-nd a club conference Monday in Lynchburg. Miss Mary Featherston, M.ss Em ily Featherston and N.R.Feather ston spent Sunday in Roanoke. Mr. and Mrs. Otho Godsey ana son, of Portsmouth, spent the week end with relatives here. Our former correspondent, W, A Swan, of Hixburg, was a visitor in The Rev. and Mrs. H Frederick the Times Virginian office luesday Jones visited her brother, Dr. W. M. Winn, in Clarksville last week. We are glad to report that J.W . Cawthorn is improving after a re cent illness."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home oi Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. The U. D C"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home oi Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. The U. D C"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1514.42, 561.53, 1716.22, 810.08], "bbox_id": "a8763ee56e", "file": "AppomattoxNewspapers_1962-1965a_0027.pdf", "page": 1, "text": "The ushers were Dr. James B. Abbitt, Dr. D. N. Twyman. Mr. Bayliss Carson and Mr. Claud Smith. Little Rachel Fer guson was ring bearer. Among the many handsome yterian Church I and costly presents received by Mary Elizabeth the bride Was a beautiful silver f and attractive j ggj-vjce. John W. Paris, paris has m,any friends i of Mr. George and adrnjrers in this comimtinity of oak Harbor, and the jjyjje c h u r c h could fch was prettily fclm ferns, Pott -1 Kens, cedar and  Ke surrounding Kleiffliity to the he bride enter- Bhestra, consist- K Franklin, and . F. Longworth Bred Lohengrin She was accom- rother, Charles ron of Honor,"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "The ushers were Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Dr. D. N. Twyman."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "The ushers were Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Dr. D. N. Twyman."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [694.77, 293.13, 861.84, 2004.83], "bbox_id": "02ae436ebd", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "The Senatorial Convention Nominates H. D. Flood by AcclamationThe Buckingham and Cumberland Dem ocrats Nominate E. W. Hubard for the House of DelegatesSenator Martin Endorsed. Promptly at the appointed hour, Chairman V. E. Pratt, of the Buck ingham Democracy, called to order the convention of the Eighteenth senatorial district Iu the courthouse ou Monday. The convention organ ized by electing Dr. Pratt chairman and W. W. Haskins secretary. This organization was made permanent. The chair appointed the follow ing committee on credentials Frank Moon, of Buckingham Paul Pettit, f Fluvanna Joel Watkins, of Ap pomattox. The committee reported!he fol lowing delegates present and end- lied to stats in the convention BuckinghamFailed to get the names of these delegates. AppomattoxJoel Watkins, A. II. Clement, James B. Abbitt, II. 8. Coleman, A. B. Thornhill, J. W. Davidson, W. F. Wright. FluvannaA. A. Gray, Paul Pet- dt, C. B. Wood, W. C. White, W. F. Snead. Mr. A. A. Gray, of Fluvanna, then nominated Hon. H. D. Flood to suc ceed himself as Senator from this district, iu a speech which was well received, by the audience, and which elicited much applause, showing plainly that the audience endorsed his eulogistic remarks on Mr. Flood and his record as a representative. Mr. Gray is a pleasant speaker, aud his remarks were timely and highly appreciative. Mr, A. B. Thornhill, of Appomat tox, in a beautiful speech, seconded the nomination of Mr. Flood. He referred to the magnanimity with which Mr. Flood refused the certifi cate of election to Congress in 1896, and presented figures showing that iie received 4,000 more votes than diu Mr. Tucker in 1894, and 6,000 more than did Mr. Quarles in 1898. Mr. Thornhills remarks made a good impressiou, and he was the re cipient of congratulations upon his peech. Messrs. F. C. Moon and Ednt. W. Hubard, ou the part of Bucking ham, made short speeches seconding the nomination. At the conclusion of these speech es Mr. Paul Pettit moved that the nomination be made by acclamation, which was adopted, and the chair appointed Messrs. Gray, Thornhill, and Hubard to iuform Mr. Flood of his nomination, and to present him to the convention. Mr. Flood accepted the nomina tion in a speech of twenty minutes, which aroused much enthusiasm. He assured the peopie of his appie- fiaaou of the honor conferred, and of their endorsement and loyalty, to him and his public acts. He spoke earnestly of the faithful service to the laboring people of Virginia ren dered by Senator Martin, aud of the light he made for him in the Demo cratic caucus six years ago, assuring the Democracy of Virginia that, if- they would lay the mantle of the seuatorship upon Mr. Martin at that time, the Democracy of the Old Do minion would approve their action. Mr. Flood referred to the large ma jority of counties having gone for Senator Martin as proving the truth of his prediction, and said that Mr. Martin would be renominated by a four-fifths majority. At the con clusion of his speech he was pre sented wit-h a bouquet of beautiful flowers. Mr. F. 0. Moon offered the follow ing resolutions, which weie unani mously adopted Resolved, That the course of Hon. T. S. Martin, United States Senator, is fully endorsed and approved and the nomiuee of this convention is in structed to vote for and support Him for re-election to that position. . 2d, That the tiominee of this con vention is instructed to vote for and support Hon. George J. Hundley for re-electiou as Judge of this judicial circuit. Mr. W. W. Haskins said that he was instructed by the Maysville-dis- trict meeting to bring up the ques tion of moving the courthouse aud the nominee was instructed to op pose any movement looking to the removal of the courthouse. The senatorial convention then adjourned, and the house conven tion, composed of delegates from Buckingham and Cumberland, as sembled for the purpose of nomi nating a candidate for the House of Delegates. Dr. Pratt and Mr. Haskins were retained as chairman and secretary, respectively, of the convention.  W. M. Smith, of Cumberland, and F. C. Moon, of Buckingham, were appotiled a committee on creden tials, who reported the following delegates present and entitled to scats in the cony.epjbj.Qn t CumberlandW. if. South, H. D. Woodson. H. K. Adams, E. B. Davis, A. B. Armstrong, and J. W. Adams. BuckinghamWe are nnable to give the names of these delegates. F. C. Moon uommated Hon. E. W. Ilubar.t for delegate to the General Assembly from tjiis district, com posed of Buckingham an,d Cumber land counties, Mr. W. M. Smith, of Cumberland, in a few well chosen remarks, sec onded the nomination. Mr. John W. Adams moved that it be made by acclamation, which was done with a whoop. Sfr. Hubard was informed of his nonuuatiQQ, and was presented to the convention for a speech. Mr. Hubard made onj ?fp t his h.ap-i py speeches, full of logic and rea-! sou. He was severe on independ ents, and promised that the flag of Democracy should not trail in the dust, aud predicted a great victory fojt tjie party at the general election. He appealed ty his hearers with much force io si an cl by fthe nomi nees, saying it was not now afight, of Flood and Hubard, but a fight for the supremacy of Democratic"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Watkins, A. II. Clement, <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, II. 8. Coleman, A."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Watkins, A. II. Clement, <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, II. 8. Coleman, A."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1699.91, 1127.82, 1847.86, 1186.52], "bbox_id": "c65ad31ed0", "file": "AppomattoxNewspapers_1898-1902a_0534.pdf", "page": 1, "text": "The printer said last week thJ Dr. James B. Abbitt has located 1 Buckingham for the practice ol medicine. It should have neen iu stead Beckham, in this county. j"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "The printer said last week thJ Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> has located 1 Buckingham for the practice ol medicine. It should have neen iu stead Beckham, in this county. j"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "The printer said last week thJ Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> has located 1 Buckingham for the practice ol medicine. It should have neen iu stead Beckham, in this county. j"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [554.92, 1121.79, 711.97, 1180.04], "bbox_id": "306bb261a3", "file": "AppomattoxNewspapers_1898-1902a_0535.pdf", "page": 1, "text": "The printer said last week that Dr. James B. Abbitt has located nt Buckingham for the practice ol medicine. It should have oeen in stead Beckham, in this county."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "The printer said last week that Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> has located nt Buckingham for the practice ol medicine. It should have oeen in stead Beckham, in this county."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "The printer said last week that Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> has located nt Buckingham for the practice ol medicine. It should have oeen in stead Beckham, in this county."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.12, 577.28, 1590.77, 659.03], "bbox_id": "0913c4e701", "file": "AppomattoxNewspapers_1936-1939a_0037.pdf", "page": 1, "text": "The Business Womans Circle of Liberty chcrch met Monday night, with Mrs. A .T . Inge. Mrs. R. M Mann had charge of the program, the subject being, China. Those taking part were Mesdames T.M . Trent, Elizabeth Ford and James B. Abbitt. The hostess server de lightful refreshments."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Trent, Elizabeth Ford and <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. The hostess server de"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Trent, Elizabeth Ford and <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. The hostess server de"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [725.05, 929.05, 893.4, 1089.05], "bbox_id": "c7824f4389", "file": "AppomattoxNewspapers_1939-1943a_0061.pdf", "page": 1, "text": "T . Fulp, of Pennsylvania, who has been sick here, returned Mon day. Mutt Cawthom, of Petersburg, spent the week-end here with his mother, Mrs. Eva Cawthom. Mrs. R . F . B . Steele and two .children, of Petersburg, were recent guests in the Burke home here. M r. and Mrs. Tony Coleman, of New Jersey, are visiting relatives in the county. Mrs. James B , Abbitt and daugh ter, Vay, are visiting Mr.and Mrs. R .F.B .Steele i Petersburg."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "in the county. Mrs. <mark>James</mark> <mark>B</mark> , <mark>Abbitt</mark> and daugh ter, Vay,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "in the county. Mrs. <mark>James</mark> <mark>B</mark> , <mark>Abbitt</mark> and daugh ter, Vay,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [530.41, 584.85, 630.24, 614.04], "bbox_id": "c8fe0d9b49", "file": "AppomattoxNewspapers_1952-1954a_0157.pdf", "page": 1, "text": "stove, with reservoir Reasonably priced. -James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "stove, with reservoir Reasonably priced. -<mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "stove, with reservoir Reasonably priced. -<mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.55, 407.07, 2216.23, 925.2], "bbox_id": "828a6652b9", "file": "AppomattoxNewspapers_1952-1954a_0433.pdf", "page": 1, "text": "STEELE . BURKE Liberty Baptist Church was the scene of a beautiful marriage today. Mr. W. T. Steele and Miss Alice F. Burke were the contracting parties. The church was beautifully decora ted with evergreens, and an arch spanned the church, from which a chandalier, with lighted candles gave the only light for the auditorium. Beneath this arch and chandalier Mr. iSteele and Miss Burke took the marriage vows, using the ring, her pastor, the Rev. Hugh C. Smith, per forming the ceremony in a very im pressive manner. The attendants were as follows Mr. Clinton Steele, brother of the groom, groomsmn, and Miss Vera W. Burke, sister of the bride, maid of honor. The other attendants were Mr. Hallie Burke with Miss Lee Steele Mr. Robert C. Harvey with Miss Jenine Irby Hon. H. D. Flood with Miss M. Elizabeth Burke Dr. James B. Abbitt with Miss Lula Terrell j Mr. Oscar Sho- walter with Miss Roberta Wood Mr. R. L. Burke with Miss Mary Eliza beth Paris j Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messers. John Rolfe Horsley, R. Watkins Nowlin, John Overton and Hampton Steele. The little ribbon bearers were Jerry Burke and Jacqueline Atwood Cur tis Taylor and Frances Abbitt Ken dall Hunter and Katie Wooldridge, and James Stanley and Mattie Sears. Before the bridal party entered one verse of O Promise Me was softly sung by Miss Eula Burke, ac companied by Mrs. J. R. Atwood. At the conclusion of the solo followed the strains of Lohrengrins Wedding March. The bridemaids entered from the left wing o f the church near the altar and passed in front of the al tar and down the right aisle. The male attendants entered the leit aisle at the front of the church and"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "M. Elizabeth Burke Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> with Miss Lula Terrell"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "M. Elizabeth Burke Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> with Miss Lula Terrell"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.83, 1443.66, 1728.78, 1775.27], "bbox_id": "f19b6ba760", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "STBELE-BUKE. Liberty Baptist church was the scene of a beautiful marriage to-day, Mr. W. T. Steele and Miss Alice F. Burke were the contracting par ties. The church was beautifully decorated with evergreens, and an arch spanned the church from which a chandelier, with lighted candles gave the only light for the auditorium. Beneath this arch and chandalier Mr. Steele aud Miss Burke took the marriage vows, using the ring, her pastor, the Bev. Hugh C. Smith, performing the ceremony in a very impressive manner. The attendants were as follows Mr. Clinton Steele, brother of the groom, groomsman, and Miss Vera W. Burke, sister of tbe bride, maid of honor. The other attendants were, Mr. Hallie Burke with Miss Lee Steele Mr. Robert C. Harvey with Miss Jennie Irby Hon. H. D. Flood with Miss M. Elizabeth Burk? Dr. James B. Abbitt with Miss Lnla Terrell Mr. Oscar Showalter with Mias Roberta Wood Mr. K. L. Burke"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "M. Elizabeth Burk? Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> with Miss Lnla Terrell"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "M. Elizabeth Burk? Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> with Miss Lnla Terrell"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [272.13, 386.82, 600.58, 730.71], "bbox_id": "700c881411", "file": "AppomattoxNewspapers_1908-1909a_0221.pdf", "page": 1, "text": "spending some time visiting friends and relatives in Rich mond.  Dewey Agee, of Charlotte, N. C., spent the week-eud as the guest of his parents, Mr. and Mrs- W. A. Agee- . J Mr. and Mrs- T. H. Morris and children, of Richmond, Pat Coleman, jvho recently I ü.aTe returned home after a underwent an operation in the IYJ81 Mr. Morris mother, Baptist Hosgrtffil is improving. IMrs Louella Morris- G. Pack was operat-l Dr. James B- Abbitt, a form ed dn in a Lynchburg hospital er re8ldent f Appomattox, but Tuesday- now of N o r f o l k , visited tnends and relatives here this Ted Gills, of Bluefiehi, W. week.  I V., is spending several days!  ,  at thehome of Mrs- E. E. Gills- lr an Mrs- George Inge  , , ,  and two friends from Hope- Uunter Moses, of Lynchburg well, spent the week at the 5? 8 f  ajr Parents, home o f Mr. Inges parents, Mr. and Mrs. W- A- Moses- j Mr. and Mrs- 0V H. Lnge- Mrs. T. H- Inge was called! Miss Marion Wagner of to Lynchburg Sunday to see her  Pearisburg, arrived h o m e sister, Mrs. Brooks, who is ill., Thursday to spend several days H- L. Lukardt, of Richmond, Mr and Mre l visited . J. N. Phelps, of Oak-  C Wafirner ville for a few days last week. R- C- and J, Daniel J- Jennings, of Petera -"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Pack was operat-l Dr. <mark>James</mark> <mark>B</mark>- <mark>Abbitt</mark>, a form ed dn"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Pack was operat-l Dr. <mark>James</mark> <mark>B</mark>- <mark>Abbitt</mark>, a form ed dn"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [729.6, 1262.77, 887.58, 1561.77], "bbox_id": "ee0335ada8", "file": "AppomattoxNewspapers_1922-1923a_0083.pdf", "page": 1, "text": "solus lauies and elequani gownB Tnose present were Misses Florence and Nannie OaldWdlJ, Mrs J, E. Dinwiddie, Mrs. Pelham Uooke, Nortolk Mrs. E. HammerBley,Richmond .Hiss Lucile Caldwell, Mrs.Dan Browning, Richmond Miss Ulara Caldwell, Mrs. John Ran dolph Atwood and Mrs. Jeter Palmer, Misses Emma and Lucy Brnitb, Mrs. James B Abbitt, Nortolk Mrs. Wm.-Tay lor Bteele, Mrs. Frank McKin ney, Mies Jannie McKinney, Mrs. Benjamin Caldwell, Mrs Jerry Allen Burke, Mrs. Hal lowed Burke, Roanoke Mrs. John Edward Sears, Mrs. Wm. Hale Byrne, Mrs. Alfred H ar wood, Mrs. Emmett Abbitt, Mrs. Butler Pretlow, Mrs. 8. W Sears, Mrs Walter Scott, Mrs. Ed Price, Miss Jessolyn Han cock, xirb. 8 L. Ferguson."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "and Lucy Brnitb, Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark>, Nortolk Mrs. Wm.-Tay lor"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "and Lucy Brnitb, Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark>, Nortolk Mrs. Wm.-Tay lor"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [301.9, 408.14, 640.85, 800.98], "bbox_id": "52166f0df0", "file": "AppomattoxNewspapers_1939-1943a_0537.pdf", "page": 1, "text": ".pent the week-end at his home here. Thomas Smith, of Salem and Billy Ford, who is working at Staunton, spent the we1 k-end in the home of Mr. and Mrs. L. E. Smith. Mrs J C Hudgins has retained from a visit with her mother in Sur ry Counfy. Mrs. Mattie Garrett, who had her tonsils removed in Lynchburg Mon day, is home and is getting along nic.ly. Mrs. James Gunter anu Mary Ann lift Saturday for Texas, to join her husband,- U S. Army. Mrs. James B. Abbitt and daugh ter. Vay, spent the week-end in Richmond with Mr and Mrs. C. D. Stiples. Mrs. H. M. Burge spent the week end in Richmond with her daugh ter, Miss Catherine Burg?. Mrs. Mildred Alvis and Miss Kate OBrien sp. nt the week-end in Rich mond. Mr. and Mrs. G. F. Langran have been visiting their son, James Lan- Morton Rosser and son, Jes-! la 11  n Baltimore. sie Morton, were visitors in Brook- neal Sunday. Miss Elaine McDearmon has re signed her position as a member of  the local high school faculty ami left today for Farmville where s0.e  has accepted a governmenet posi-  .ion."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "U S. Army. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter. Vay,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "U S. Army. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter. Vay,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [664.79, 385.09, 1006.61, 459.69], "bbox_id": "f1efc60ce6", "file": "AppomattoxNewspapers_1949-1952a_0446.pdf", "page": 1, "text": "Mrs. W. T. Steele, Miss Eula May! m Burke, Mr. and Mrs. C D Staples,! . r and Mrs- Cliff Thomas and Mrs. James B. Abbitt, Miss Vay Ab- cddren of Newport News spent the bitt and R.F . B . Steele, Jr. Mr. and week-end with her parents, Mr. and Mrs. R. F. Burke, III, Mr. and Mrs.  rs Evans- Mr. and Mrs. E. Ernest O. Lacy and Dr. Twyman  Almnd and daughter, Dana Kay Williams enjoyed a coffee hour Sun- Madison Heights spent Saturday in frtiva knma"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Cliff Thomas and Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Vay Ab- cddren"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Cliff Thomas and Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Vay Ab- cddren"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [978.27, 623.06, 1147.92, 685.86], "bbox_id": "117f56146d", "file": "AppomattoxNewspapers_1939-1943a_0176.pdf", "page": 1, "text": "Mrs W. T. Steele is visiting in I Petersburg. I Mrs. James B . Abbitt has re turned home after spending two weeks with her d ughter, Mrs. A. D Staples, in Richmond."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "I Petersburg. I Mrs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> has re turned home"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "I Petersburg. I Mrs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> has re turned home"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.53, 1292.08, 1886.9, 1408.17], "bbox_id": "356e19e89f", "file": "AppomattoxNewspapers_1952-1954a_0057.pdf", "page": 1, "text": "Mrs. W. T. Steele celebrated her birthday on Saturday, August 16, in the home of her sister, Mrs. James B. Abbitt. Mrs. Steeles guests in cluded Mr. and Mrs. W. T. Steele, Jr. and sons . Bill  and Rusty, of Richmond Mr. and Mrs. R. F. B. Steele and daughters, Scottie and Alice Booker, of Petersburg Mr. and Mrs. R. F. Burke, III, and chil dren, Ernie, Lein and Debbie, of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "of her sister, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. Steeles guests in"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "of her sister, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. Steeles guests in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1493.5, 512.29, 1662.75, 845.84], "bbox_id": "6e877f1f2a", "file": "AppomattoxNewspapers_1939-1943a_0496.pdf", "page": 1, "text": "Mrs. W. D Morris spent the past Week-end at her home in Farmville. Dr. and Mrs. C. F. Barnes visited Captain and Mrs. C. F. James Jr. at Fort Monroe this week. One of the largest crowds of shoppers of the year was in Appo mattox last Saturday. I Mr. iColeman, of Arlinjgton, is visiting his sister, Mrs. W. R. Cheadle, of Pamplin. Mr. and Mrs. J. A. Burke Jr. of Richomnd spent the week-end with his parents.  Mrs. W. H. Hix, of Norfolk is a guest of Mrs. James B. Abbitt. Mr. and Mrs. Alfred Price spent last week at Holliday Lake. Their small dlaughter, I Evelyn Farmer spent the week at Rice. Miss Maiybell Babcock spent the week-end with relatives in Lynch burg. Mrs. John S. McKee, Jr. and son, of Morganton have arriv d to spend some time in the home of Mrr. James B. Abbitt. Dr. McKee has been called for active duty and is stationed at the LaGard Hospital at Naw Orleans, with the rank of Cap tain."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "a guest of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Alfred"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "a guest of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Alfred"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1982.63, 409.08, 2154.21, 749.13], "bbox_id": "6a8fe23c40", "file": "AppomattoxNewspapers_1939-1943a_0320.pdf", "page": 1, "text": "Mrs. Rachel OBrien, of Lyn h- burg had the misfortune to fall and break her hip recently. Mrs. Robert Irby, Misses Lizzie ,and Lula Irby Pat Sears and Dot Sears, Mrs. J. E. Sears, R. L. Burke, Mrs. James B. Abbitt, Miss Eula May Burke and Miss Vay Abbitt attended the funeral of the late W. B. Irby at Blackstone Tuesda.y John Tavlor was in Richmond on business Tuesday. Effective tomorrow, 24 hourly employees ot Che J. E. Sears Co., Appomattox, will be given a wage ncrese of two and one-half cents per hour. The August meeting of the Appo mattox town council will be held on Friday night, August 1, instead of next Monday night. Chief business at the meeting will be action on the proposals of the Norfolk anu West ern Railway for the additional pro tection at the depot crossing in the to.wn. The installation of a wig-wag light and bell system at this cross ing has been under discussion, al though it is believed that several months would be required before it would be in operation, and then, it would require a railroad expenditure of between 4,000 and 6,000. ITihe crossing has a gate watchman on duty between 7 A. M. and 11"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "R. L. Burke, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Eula May Burke"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "R. L. Burke, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Eula May Burke"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.09, 510.47, 1844.79, 547.82], "bbox_id": "6e6dcf3dc9", "file": "AppomattoxNewspapers_1939-1943a_0529.pdf", "page": 1, "text": "Mrs. R. Lee Covingon and daugh ter, Betty Burke of Winston Salem are visiting in the home of Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. R. Lee Covingon and daugh ter, Betty Burke of Winston Salem are visiting in the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. R. Lee Covingon and daugh ter, Betty Burke of Winston Salem are visiting in the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [702.08, 979.24, 872.46, 1425.03], "bbox_id": "ae6ad18143", "file": "AppomattoxNewspapers_1936-1939a_0012.pdf", "page": 1, "text": "Mrs. Mary E . Browning Martin, and Mrs. Fay Lewis Nob1 and son, Paul, of Jacksonville, Florida, are visiting Mrs, R.N. Dawson. Mr. and Mrs. -Jack Martin, of Jacksonville, Florida stopped to vis it in the home of Mrs. R.N.Daw son, en route home from the worlds fair. Mrs. Carrington Burgess, of Char lottesville, Mrs. John Crute and Mrs. Quinn, of Buckingham were guests of Mrs. C.H. Robinson on Tuesday. Col. and Mrs. Joseph Button, of Washington, were visitors in Appo mattox this week. They left yester day for Virginia Beach. R. L. Burke, Miss Vay Abbitt, and Irs. James B . Abbitt are at tending the treasurers convention at Virginia Beach. Mrs Ola Patteson, Mrs. G. L. Doss and daughter, LeFern, and Mr. and Mrs. O.R.Turnes will leave Friday to spend the week-end at Ocean View, Mrs. Campbell, of Caroline coun ty, neice of the late John Garland Pollard, is visiting in the home of ,urs. F . B . Cale. Mr and Mrs. H . E . Gilliam and I Robert Ramsey, of Lynchburg, were guests of Mr. and Mrs. J.A. Burke Tuesday for the Young Democratic barebecue. Friends are indeed sorry to hear that Mrs S. L. Ferguson is a pa tient in the Memorial hospital in Lynchburg, and wish her a speedy recovery. B. L. Hancock, of Washington, D. C., was a week-end visitor in Ap pomattox. His family left for Blue-"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Vay Abbitt, and Irs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> are at tending the"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Vay Abbitt, and Irs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> are at tending the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1273.17, 333.72, 1445.25, 581.36], "bbox_id": "889e79cfbc", "file": "AppomattoxNewspapers_1939-1943a_0304.pdf", "page": 1, "text": "Mrs. James B. Abbitt, Mrs.J.A, Burke and son, Richard Floyd, III, motored to Henderson, N. C., last week-end to attend the wedding on Saturday of Miss Anne Mills, to Mr. John Daniels .Rose, Jr. Mr. Rose is the grandson of Mrs. Julian Abbitt, and the late Dr.Abbitt. Mr. and Mrs.W. T. Steele, Jr., and son, Bill, of Richmond, are spending this week in the Burke home. Mr and Mrs. Frank Harris, Mr. nd Mrs. R. F. B. Steele and child ren, of Petersburg were guests in theBurke home here over the past week-end. Mr. rnd Mrs. R. E. Baldwin, of Richmond, spent the week-end hero -n the home of the Featherstons. Miss Pattie Featherston has re turned after spending a few days in Richmond with her sister, Mrs. i R E Baldwin."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs.J.A, Burke and son,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs.J.A, Burke and son,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1538.1, 1331.15, 1710.26, 1807.77], "bbox_id": "311eb872af", "file": "AppomattoxNewspapers_1954-1955a_0307.pdf", "page": 1, "text": "MRS. JAMES B. ABBITT Mrs. Vara W. Burke Abbitt, the widow of Dr. James B. Abbitt, died Friday afternoon at 4 oclock, after an illness of several months. She was a former deputy treasurer of Appomattox County. .She was the daughter of the late Richard F. and Alice Sears Burke. For the last twen ty years she had made her home here and was deputy treasurer until her retirement in 1953. She was prominently identified with civic and religious activities both here and in Norfolk where she had previously re sided. She was a member of the Daughters of the American Revolu tion and the United Daughters of the Confederacy. She was a past president of the Medical Auxiliary of the Norfolk Medical Society. She was an active member of the Liberty Baptist Church here, where she taught a Bible class for many years. Surviving are two daughters, Miss Vay Abbitt and Mrs. C. D. .Staples, both of Bon Air a niece, Mrs. Lee Covington, of Raleigh, N. C. three granddaughters a sister, Mrs. W. T. Steele, of Appomattox two broth ers, Richard L. Burke and Jerry A. Burke, both of Appomattox, and a number of nieces and nephews in addition to Mrs. Covington, whom she reared. Funeral services were held from Liberty Baptist Church at 200 P. M. Sunday, conducted by the pastor, Dr. Carl A. Collins, Jr., assisted by Dr. Twyman Williams. Burial was in Liberty Cemetery. Active pall bearers were Robert A. Sears, Jerry A. Burke, Jr. Richard F. Burke, III R. F. B. Steele, W. T. Steele, Jr. Richard F. Burke, Josh ua Pretlow, and John D. Abbitt."}, "highlight": {"text": {"matched_tokens": ["JAMES", "B", "ABBITT"], "snippet": "MRS. <mark>JAMES</mark> <mark>B</mark>. <mark>ABBITT</mark> Mrs. Vara W. Burke"}}, "highlights": [{"field": "text", "matched_tokens": ["JAMES", "B", "ABBITT"], "snippet": "MRS. <mark>JAMES</mark> <mark>B</mark>. <mark>ABBITT</mark> Mrs. Vara W. Burke"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1156.79, 959.15, 1324.32, 1057.75], "bbox_id": "f77fc14fe0", "file": "AppomattoxNewspapers_1939-1943a_0169.pdf", "page": 1, "text": "Mrs. James B. Abbitt is spending .wo weeks in Richmond with her daughter, Mrs. C. D. Staples. Carl Evans, of Roanoke, spent the ve-k-end here with his parents, Mr. ad Mrs. S. J. Evans. Pace Smijh, of Washington, visit ed his parents, Mr. and Mrs, LeRoy Smith, last week."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is spending .wo weeks"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is spending .wo weeks"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.4, 718.87, 1655.4, 746.87], "bbox_id": "de83678187", "file": "AppomattoxNewspapers_1939-1943a_0411.pdf", "page": 1, "text": "Mrs. James B. Abbitt is spending this week in Richmond with her .aughter, Mrs. C.D.Staples."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is spending this week in Richmond with her .aughter, Mrs. C.D.Staples."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is spending this week in Richmond with her .aughter, Mrs. C.D.Staples."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1629.8, 875.81, 1795.75, 972.46], "bbox_id": "cbdef00c4b", "file": "AppomattoxNewspapers_1949-1952a_0068.pdf", "page": 1, "text": "Mrs. James B. Abbitt and her daughter, Miss Vara Burke Abbitt spent Wednesday in Richmond and attending the unveiling of a portrait in the City Hall of Justice John Jeter Crutchfield. Mr. and Mrs. George M. Cale, of Wytheville, have arm oil"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and her daughter, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and her daughter, Miss"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1196.63, 1010.67, 1359.18, 1048.07], "bbox_id": "5dc12c2186", "file": "AppomattoxNewspapers_1933-1936a_0477.pdf", "page": 1, "text": "Mrs. James B. Abbitt and daughv ter, Vay .returned Monday from a visit in Mörganton and Statesville, North Carolina,"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daughv ter, Vay .returned Monday from a visit in Mörganton and Statesville, North Carolina,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daughv ter, Vay .returned Monday from a visit in Mörganton and Statesville, North Carolina,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [916.29, 591.87, 1078.19, 655.67], "bbox_id": "f763fec967", "file": "AppomattoxNewspapers_1933-1936a_0463.pdf", "page": 1, "text": "Mrs. James B. Abbitt and daugh ter, Vay, have returned after spending two weeks in Richmond.  o  Shirley Morris, young daughter of Mr.and Mrs. James Morris, is improving in a Lynchburg hospital."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.2, 1004.89, 1659.4, 1031.44], "bbox_id": "4302f3c2a8", "file": "AppomattoxNewspapers_1939-1943a_0565.pdf", "page": 1, "text": "Mrs. James B. Abbitt and daugh ter, Vajy, spent Sunday in Winston- Salef, N. C."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vajy, spent Sunday in Winston- Salef, N. C."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vajy, spent Sunday in Winston- Salef, N. C."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [532.3, 985.32, 699.82, 1023.17], "bbox_id": "c6b0eb140a", "file": "AppomattoxNewspapers_1943-1947a_0123.pdf", "page": 1, "text": "Mrs. JameS B. Abbitt and daugh ter, ay, will spend Christmas in Richmond with Mr. and Mrs. C. D. Staples."}, "highlight": {"text": {"matched_tokens": ["JameS", "B", "Abbitt"], "snippet": "Mrs. <mark>JameS</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, ay, will spend Christmas in Richmond with Mr. and Mrs. C. D. Staples."}}, "highlights": [{"field": "text", "matched_tokens": ["JameS", "B", "Abbitt"], "snippet": "Mrs. <mark>JameS</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, ay, will spend Christmas in Richmond with Mr. and Mrs. C. D. Staples."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1949.75, 1164.64, 2120.74, 1254.79], "bbox_id": "4407af28b9", "file": "AppomattoxNewspapers_1947-1949a_0570.pdf", "page": 1, "text": "Mrs. DeWitt Evans and Mrs. Rob ert Hubbard will be in charge of the refreshments and will be assist ed at the punch bowl by Mrs. L. Crawley, Mrs. A. R. Harwood, Sr., Mrs. James B. Abbitt, Mies Kate Franklin, Miss Harriett Holly, Mrs. J. A. Burke end Mr. Gladys Wood- son."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "R. Harwood, Sr., Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mies Kate Franklin, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "R. Harwood, Sr., Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mies Kate Franklin, Miss"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.5, 541.08, 1697.91, 1273.51], "bbox_id": "ef2f02b546", "file": "AppomattoxNewspapers_1943-1947a_0008.pdf", "page": 1, "text": "Mrs. David Nicol Twyman and Mrs. Fanny Shipman, of Williams burg are guests in the home of their  sister, Mrs. M. H. Lawson. Mr. and Mrs. Edmund Theodore Gills and daughter, Marianne, are visiting in the home of Miss Mary Louise Gills this week. - Miss Ilah Buchanan, of Washing ton is spending her vacation at her home here. Miss Betty Ferguson, , of Ever green is spending this week with her grandmother, Mrs. Lillie Gre- gy. Mrs. Jack Dickerson, nee Jose phine Jenkins, is visiting her par ents, Mr. and Mrs. Charles Jen kins. Mrs. Daniel Browning, of Rich mond has returned home after spending some time with her sister, Mrs. Harry P. Davis. Mrs. Carolyn, Cates was a visitor in Burlington, N. C. last week. Miss Mary Louise Gills spent sev- rnl days last week in the home of Mrs. Malcolm A. MacLean. Mrs iTicLean has moved back to her home,  Bonniebrae 901 Pershing St., Lynchburg. Mrs. Burke S eele and children, Burke, Jt., and Louise r cott, of Petersburg are spending several days, in the home of Mrs. James B. Abbitt. Mr. and Mrs. Frank Medbury, of Washington, D. C., and Mrs. Fran ces Norin of the same city were guests last week in the home of Mr. and Mrs. R. C. Wagnes. The Rev. and Mrs. W. MThomp- son wave recent guests in the home, of Miss Mary Louise Gills. Billy Carter, of Crewe is spenV ing some time with his grandmother Mrs. William Lawrence Brown. MrS. A. B. Nowlin is recovering from a recent illness at the home of her daughter, M r s . W.W.OBrien. Miss Lucy Etta Austin, of Wash ington is recuperating at the home of Mrs. C. C. Rosser, Pamplin, af ter a recent operation at the Vir ginia Baptist Hospital. Her moth er, Mrs. E. W. Austin, who has been with her is spending This week with her sister, Mrs. W. L. Cole man. Misses Nelwyn a n d Maurie OBrien, Tommy and Dicky OBrien hate returned to their home near here after spending several days wnh the Rev. and Mrs. O. G. Bur nette, of Nathalie. Mrs. A. I. Caudle has returned from a visit with relatives in Keys- ville. Mr. and Mrs. C. E. Kirkwood left"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Frank"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Frank"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.46, 797.04, 1663.45, 1186.48], "bbox_id": "6472075847", "file": "AppomattoxNewspapers_1939-1943a_0490.pdf", "page": 1, "text": "Mrs. Charles Hanenkrat, who un derwent an operation at the Vir- inia Baptist hospital several weeks ..go, has returned to Appomattox. Mrs. J. R. Lawson spent several days this week at the beach. Mrs. T. U. Conner spent Tuesday sd Wednesday in Portsmouth with Mrs. G. L. Doss. Miss Vay Abbitt, who has been visiting in Richmond returned home Saturday. She was accompnied to Appomattox by Mr. and Mrs. C. D. Staples and daughter, Priscilla Ann, who are spending this week with Mrs. James B. Abbitt. Mr. and Mrs. Pace Smith, of Washington are visiting his parents, Mr. and Mrs. LeRoy Smith. Mr. and Mrs. R. D. Marks have moved into their recently complet ed home on the Old Court House Road.  R. F. B. Steele, of Petersburg, was in Appomattox Thursday. His mother, Mrs. W. T. Steele return ed with him for a visit. Miss Colyer Smith is spending this week with- her sister, Mrs. Al fred Doss, of Concord. Mr. and Mrs. Alfred Doss and children spent Sunday in the home of Mr. and Mrs. J. A. Smith Miss Colyer Smith spent Satur day with Miss Mabel Gunter."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "this week with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Pace"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "this week with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mr. and Mrs. Pace"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.05, 403.45, 1880.74, 823.13], "bbox_id": "01f38671d8", "file": "AppomattoxNewspapers_1952-1954a_0358.pdf", "page": 1, "text": "Mrs. C. A. Hancock and Braxton Hancock, of Huntington, W. Va., and Mr. and Mrs. Russell Gimbert, of Oceana, Va. spent the week-end with Mrs. Bessie Ferguson. Miss Louise Gills, who has just returned from a trip to California is visiting Mrs. Ferguson. They all attended the home-coming at Liberty Baptist Church Sunday. Mr. and Mrs. R. F. B. Steele and daughters, Scottie and Alice, of Petersburg Miss Betty Temple, of Danville Mrs. W. T. Steele, Jr., and sons, Bill, III. and Rusty, of Rich mond were luncheon guests Wednes day of Mrs. W. T. Steele and Mrs James B. Abbitt. Mrs. Steele, Jr, and sons remained for a few day visit. Mrs. J. J. Chernault had all of her family except one son-in-law with her over the week-end. They all went to Holliday Lake Sunday for a picnic dinner. Those present were Mr. and Mrs. Robert H. Chernault and Bill, of Washington, D. C. Mrs. George Craddock, Joyce Lee and G. W. Craddock, of Portsmouth, Va. Mr. and Mrs. Wiley McCor mick and Brenda Lee, of Lynch burg, Va. Mr. and Mrs. Hugh Bail ey, of Pamplin Mr. and Mrs. E. O. Blackwell, Mr. and Mrs. Henry T. Chernault and Debra, of Appomat tox- Mr. and Mrs. Russell Chernault and Gene Ethel, Wanda and Jean ette Chernault Jimmie, Clark and Walter Chernault and also Mr. and Mrs. Frank Chernault and Gerald ine, of Chestnut Gorve."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "T. Steele and Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. Steele, Jr, and"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "T. Steele and Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. Steele, Jr, and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1401.11, 1062.86, 1510.86, 1103.36], "bbox_id": "9606e06b7d", "file": "AppomattoxNewspapers_1954-1955a_0222.pdf", "page": 1, "text": "Mrs. . D. Staples and if Bon Air, will spend d with Mrs. Staples . James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. . D. Staples and if Bon Air, will spend d with Mrs. Staples . <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. . D. Staples and if Bon Air, will spend d with Mrs. Staples . <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1532.38, 764.6, 1700.23, 849.75], "bbox_id": "1b7432ce9b", "file": "AppomattoxNewspapers_1952-1954a_0402.pdf", "page": 1, "text": "Mr. Floyd Mitchell, who has been a patient in the Virginia Baptist Hospital for several days, will return to his home today. R. F. B. Steele, and Frank Harris, of Petersburg were dinner guests Monday evening of Mrs. W. T. Steele and Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "T. Steele and Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "T. Steele and Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [315.1, 480.08, 640.4, 588.93], "bbox_id": "ab6c342df6", "file": "AppomattoxNewspapers_1933-1936a_0347.pdf", "page": 1, "text": "Mr. and Mrs. W. T Steele and I Mrs. James B Abbitt and daugh- W T Steele Jr are spending this ter. Vay, spent the week end in week with Mr. and Mrs. R F B Richmond. Steele in Petersburg. _ tQ__ ,  Mrs. Alice Barum spent the week Miss Cornelia iGills, of Blacks- end with relatives. ia Richmond, burg, spent the week end at Jiome. o o .. R. A. Steffans, of Vera, is in Flot Miss Mary A Savage will spend f!a- Thanksgiving at her home. _ , .  o  ,. Drv and Mrs. Charles F Janies Richard Lee Burke will attend And Miss Addie White are in Rich-"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Steele and I Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark> and daugh- W T"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Steele and I Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark> and daugh- W T"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1664.07, 533.42, 1840.94, 1059.66], "bbox_id": "b0ec6889f0", "file": "AppomattoxNewspapers_1939-1943a_0266.pdf", "page": 1, "text": "Mr. and Mrs. T. J . Harvey, oi Richmond, visited Mil. Louella Mor ris during the week-end. X?lise Sarah Myers spent the holi days at her home in Bridgewater. Mr and Mrs. C. A. Short, of Wilson, N. C., were dinner guests Monday of Miss Frankie McKinney. Miasma Elaine McDearmon and Frankie McKinney, Dr. C . H . Swing and H. Y. Spencer spent Sunday in Richmond. Mrs. James B. Abbitt spent the week-end in Richmond. Mr. and Mrs. Otis Davis and son, of Portsmouth, spent the week-end with her parents, Mr. and Mrs. F. E. Wooldridge. Miss Doris Luca do and Dan Ruck er, of Richmond, spent the week end with her parents, Mr. and Mrs. J, H. Lucado. Mr. and Mrs. Carlton Godsey,of Lynchburg were in Appomattox on Tuesday. Mr. and Mrs. G.M. Deane were recent visitors in Richmond. Mrs. Fred Roth and sons, of Phil adelphia spent the holidays .with Mrs. R. N. Dawson. Robert Hubbard spent Sunday in Richmond. Mr and Mrs. I.H.Houston and family, of Lynchburg and Mr.and Mrs. Hornsey Inge, of Evergreen, were recent guests of Mr. and Mrs. W. H . Lucado. James Langran has accepted a position with J. C. Hudgins A Co. Cadet George Cale, of Fork Un ion Military Academy, was home for he holidays. Dr. and Mrs. Havilah Babcock and son, of Columbia, S.C., spent the holidays at Hotel Appomattox. Mrs. Bessie James, of Lynchburg, C."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Sunday in Richmond. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> spent the week-end in"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Sunday in Richmond. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> spent the week-end in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.54, 764.45, 1714.91, 1011.79], "bbox_id": "1925723c51", "file": "AppomattoxNewspapers_1952-1954a_0358.pdf", "page": 1, "text": "Mr. and Mrs. S. J. Evans, of Petersburg and Mrs. E. L. Almond and two children, Dana and Ricky, of Madison Heights spent Wednes day in Appomattox. Mr. and Mrs. R. F. B. Steele and daughters, Alice and Scottie, i Petersburg and Mr. and Mrs. R. D Covington, of Raleigh, N. C. week-end guests of Mrs. W. and Mrs. James B- Abbitt. Mr. and Mrs. Arthur Blackwell and son Mrs. E. W. Blackwell, Mrs H. O. Blackard spent Sunday with Mr. H. O. Blackwell, who is a pa tient in McGuire Hospital in Rich mond. Mrs. W. R. Reynolds hasr returned- a trip to Richmond and Vir-  . Dcunb ippomDameu by ginia iseacn,  Sadie Bradley who is spending a few days here before returning to Richmond."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. W. and Mrs. <mark>James</mark> <mark>B</mark>- <mark>Abbitt</mark>. Mr. and Mrs. Arthur"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. W. and Mrs. <mark>James</mark> <mark>B</mark>- <mark>Abbitt</mark>. Mr. and Mrs. Arthur"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.37, 516.11, 1759.14, 823.75], "bbox_id": "2cc9210f7b", "file": "AppomattoxNewspapers_1939-1943a_0008.pdf", "page": 1, "text": "Mr. and Mrs. R .L. Burke spent Thanksgiving in Roanoke as guests of Mr. and Mrs. Walter Ellett. ITheir son, Richard Leigh, who is a student at V. P . I ., Who attended the V .P .I.- V.M .I. football game in Roanoke, accompanied hem home for the week-end. Little Miss Helen Hancock, who has been sick, is out again. Miss Jean Cartier, of Burkeville, spent Thanksgiving with her grand parents, Mr and Mrs. W.L.Brown. Miss Mary Louise Gills spent sev eral days this week in Petersburg, as guest of friends there. Mr. and Mrs C. D. Staples, of Richmond, and Miss Hazel Mc Leod, of Madison, Wis., were guests of Mrs. James B. Abbitt for the week-end. Mr. and Mrs.John Over- ten, of Siouith Boston, were ialso visiters in this home Sunday. Miss Dorothy Sears, of South Boston, was home for the holidays. Mr. and Mrs. Ray Purdum, and family, of Elkin, W.Va., were the guests of Mr. and Mrs. E .E. Pur dum for the week-end."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "were guests of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> for the week-end. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "were guests of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> for the week-end. Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.9, 315.95, 821.98, 751.75], "bbox_id": "23dc74b94e", "file": "AppomattoxNewspapers_1939-1943a_0443.pdf", "page": 1, "text": "Mr. and Mrs. Perrow Harvey, and daughter, and Mrs. Powers, of Obc.r- lin, Ohio, spent Easter here with his mother, Mrs. J .F.Harvey. P. P. Plunkett, of Crewe, visited his mother, Mrs. J . S.Plunkett last week. Mr. and Mrs. C.C.Poe motored to Camp Pendleton Sunday. Dick Ferrell, of Baltimore was home for the week-end. e Mr. and Mrs. C.D.Staples and daughter, Patricia Ann, of Richmond spent Easter with her mother, Mrs. James B. Abbitt. Friends are glad to hear that Mrs. Martin Covington, who underwent an operation recently, has returned to her home near Hollywood and is re covering nicely. Mr. and Mrs. R.L. Crouch and family, Garland Sheets and Hunter Murphy, of Roanoke, spent Sunday in the home of Mr.and Mrs.W.P. Ferrell. Private Richard McDearmon, who bss been at Camp Lee, is stationed now at Camp Croft, S.C. T. H. Trent, who underwent an operation at the Virginia Baptist hos pital Saturday night, is reported some better. Miss Susie Plunkett, of Richmond was home for the holidays. Ilhcmas Smith, of Salem was home for the week-end. Mrs. Mary Lizzie Martin, who has been visiting her sister, Mrs. R.N. Dawson, left Sunday for Richmond, where she will spend several days before returning to her home in Jacksonville, Florida."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Friends are glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Friends are glad to"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.78, 463.71, 1844.98, 595.16], "bbox_id": "25b1a6cc11", "file": "AppomattoxNewspapers_1939-1943a_0164.pdf", "page": 1, "text": "Mr. and Mrs. Percy Baxendall, of Lynchburg, visited Mrs. S. L. Ferguson Sunday. Mr. and Mrs. Leroy Smith motor ed to Harrisonburg Monday, Where thair daughter, Harriett Smith enter-  ed Madison College. The contract bridge club will meet Friday evening with Mrs.Cal vin Robinson.  Mrs James B. Abbitt spent sev eral days last week in Richmond."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs.Cal vin Robinson.  Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> spent sev eral days"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs.Cal vin Robinson.  Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> spent sev eral days"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.28, 441.66, 1803.03, 505.66], "bbox_id": "d66bd700b7", "file": "AppomattoxNewspapers_1939-1943a_0300.pdf", "page": 1, "text": "Mr. and Mrs. Hugh Martin, Mrs. Helen Welch and mother moved in to the residence owned by Mrs James B. Abbitt, Monday. Mr.and Mrs. Wilbur McDearmon have mov ed into the residence formerly oc cupied by Mr. and Mrs. V.H.Gill."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "residence owned by Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Monday. Mr.and Mrs. Wilbur"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "residence owned by Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Monday. Mr.and Mrs. Wilbur"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1838.89, 294.03, 2009.14, 390.43], "bbox_id": "bc7423bb6e", "file": "AppomattoxNewspapers_1939-1943a_0475.pdf", "page": 1, "text": "Mr. and Mrs. Eugene Dickerson,  of Lynchburg, were recent guests of Mr. and Mrs. Allen Carter. Mrs. James B. Abbitt and daugh ter, Vay, spent the week-end in Rich mond. f Mrs. W. F. Woolf jrk and son, Bil ly, of Petersburg, are spending the month of June with her mother, Mrs. W. M. Hancock."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. Allen Carter. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. Allen Carter. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [779.48, 569.29, 947.58, 649.84], "bbox_id": "e1f0dc1369", "file": "AppomattoxNewspapers_1952-1954a_0331.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples, of Richmond, spent the week-end with her mother, Mrs. James B. Abbitt. They were accompanied home by their daughters, Priscella and Sally, who have been visiting here. Miss Vay Abbitt also accompanied them home for a visit."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. They were accompanied home"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. They were accompanied home"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.23, 455.23, 1708.57, 504.11], "bbox_id": "2f1ccef718", "file": "AppomattoxNewspapers_1954-1955a_0138.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples and two children, Patricia and Sally, of Richmond, are spending the holiday week-end here with her mother, Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mr. and Mrs. C. D. Staples and two children, Patricia and Sally, of Richmond, are spending the holiday week-end here with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mr. and Mrs. C. D. Staples and two children, Patricia and Sally, of Richmond, are spending the holiday week-end here with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1546.55, 1244.06, 1719.32, 1314.76], "bbox_id": "a59752525b", "file": "AppomattoxNewspapers_1952-1954a_0465.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples and daughters, Priscilla and Sally, and Miss Vay Abbitt, of Richmond, Will spend the week-end here. They will be accompanied by Mrs. James B. Abbitt, who spent the holidays I with the Staples."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "be accompanied by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, who spent the holidays"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "be accompanied by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, who spent the holidays"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1529.51, 658.14, 1696.16, 717.61], "bbox_id": "0dd6a03a42", "file": "AppomattoxNewspapers_1952-1954a_0433.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples and daughters, Priscilla and Sally, and Miss Vay Abbitt, all of Richmond, are spending the Thanksgiving holi days with Mrs. James B. Abbitt and Mrs. W. T. Steele."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "holi days with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Mrs. W. T."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "holi days with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Mrs. W. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [624.7, 736.69, 794.13, 808.14], "bbox_id": "b57aa149bc", "file": "AppomattoxNewspapers_1939-1943a_0177.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples and daughter, Priscilla Ann, of Richmond will spend the week-end with Mrs. James B. Abbitt. Mrs. C. H . Hix S r. and Mrs. W . I Miller, of Norfolk are guests of Mrs. James B. Abbitt"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "the week-end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. C. H . Hix"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "the week-end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. C. H . Hix"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.43, 664.74, 2040.45, 743.63], "bbox_id": "97f5e401f4", "file": "AppomattoxNewspapers_1952-1954a_0326.pdf", "page": 1, "text": "Misses Priscilla and Sally Staples, of Richmond are spending this week with their grandmother, Mrs. James B. Abbitt. Other guesits in this home for the week-end were Dr. John McKee, and d a u g h t e r of Morganton, N. C. and Mr. and Mrs. C. D, Staples, of Richmond."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "with their grandmother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Other guesits in this"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "with their grandmother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Other guesits in this"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1860.5, 1279.98, 2024.0, 1378.77], "bbox_id": "7dd9b5878b", "file": "AppomattoxNewspapers_1933-1936a_0273.pdf", "page": 1, "text": "Miss Vernie Oden and Richard Dozier Lee Covington were married Tuesday, August 20, in the home ef Mrs. James B. Abbitt, at Raleigh Square, Norfolk. Those from here attending the wedding were Miss jane L-irke, Mrs. W. T. Steele, Miss Eula Mav Burke, R. L. Burke and J. A. Burke and W. T. Steele Jr and aunt Sarah Green, family fervent."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home ef Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, at Raleigh Square, Norfolk."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home ef Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, at Raleigh Square, Norfolk."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.68, 659.05, 1895.17, 801.91], "bbox_id": "d8a71b1c45", "file": "AppomattoxNewspapers_1943-1947a_0045.pdf", "page": 1, "text": "Miss Lucille Cralle, of Charlottes- uleton Furr,  Bluefield, W.Va. ville and Miss Elizabeth Cralle, of Liuieion r u i, Richmond spent the week-end at j uiian Scott Gills, of Bluefieid, their home here. I W.Va.,. will arrive in Appomattox  _ , , 3-undav to spend sever 1 days in the Mrs. liveiy Holland and sons have - Mary Louise Gills, moved to Massachussets, where Lt. home oi iviiss na y Holland is stationed.  Mrs. Carolyn Babcock Cates ar- T tj a uKin- .nd fidugh-  rived home Wednesday after spend- Mrs. James B . Abbitt and daugh e t me at Southern Semi- ter, Vay, spent the week-end in 8 at Buena Vista. Mrs. Cates Richmond. . the position of dietician. Miss Elizabeth McDearmon, oi Franklin, who has Richmond, spent the week-end here teaching music her for the with her parents, Mr. and Mrs.C. been teaching  J tQ her"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Wednesday after spend- Mrs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> and daugh e t"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Wednesday after spend- Mrs. <mark>James</mark> <mark>B</mark> . <mark>Abbitt</mark> and daugh e t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [961.69, 1006.94, 1138.35, 1551.18], "bbox_id": "b48a581b7f", "file": "AppomattoxNewspapers_1939-1943a_0298.pdf", "page": 1, "text": "Miss Eva Martin is spending this week in Lynchburg. Mr. and Mrs. John Carroll Stan ley, of North Carolina, spent the week-end with his mother here. Mrs. E. T. Gills and daughter, of Bluefield, W. Va., have arrived to spend two weeks in the home of Mrs. E. E. Gills, and Mr. and Mrs. R. C. Wagner. Mr. and Mrs. Eston Harvey, of Chase City, have announced the birth of a daughter, Patricia Lee. born at the Southside Hospital, at Farmville, fTuesday. Mrs. Lester Furney, of Radford, is spending this week with her par ents, Mr. and Mrs. W. J. LeGrand. Carroll Smith, of Charlottesville,- spent the week-end in the home of Mr. and Mrs. W. L. Brown. Mrs. Sallie Brown, of Lynchburg spent Sunday with Mrs. R N. Daw son. Mr. and Mrs. C. D. Staples and daughter, of Richmond, spent Sun- icy .with her mother, Mrs. James B. Abbitt. Mrs. John S. McKee and s-n, of Morganton, N. C., are visiting in the Burke home. Dr. McKee sipent Sunday in this home. Garland OBrien, who has been visiting his parents, Mr. and Mrs. W. W. OBrien,  returned to Dun- kalk, Maryland, Tuesday. M iss Edithe Lucado, Jack Over-1 street and Mrs. Willis, of Lynch burg spent Sunday with Mr. and Mrs. J. H. Lucado. Mrs. Annie Adams, of Kentucky, is visiting in the home of Mr. and Mrs. D. A. Conner.  Miss Phoebe OBrien, of Sweet Briar, an Maynard OBrien, fof Fort Meade, Md., spent the week end at their home near here. Miss Dorothy OBrien and Clar ence Perkins, of Richmond attended the commencement exercises here Friday night."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. John S. McKee"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "with her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mrs. John S. McKee"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.89, 1120.47, 2041.15, 1209.71], "bbox_id": "1ec298370a", "file": "AppomattoxNewspapers_1952-1954a_0320.pdf", "page": 1, "text": "Miss Betty Burke Covington, of Raleigh, N. C., is visiting her aunt, Mrs. James B. Abbitt, and will at tend the teen-age dance at the American Legion Hall this evening. Others attending will include Miss Eliza Williams and Douglas Will iams, III, of Brookneal, who are visiting Mr. and Mrs. J. A. Burke."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "visiting her aunt, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, and will at tend"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "visiting her aunt, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, and will at tend"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.0, 1114.75, 1805.29, 1414.9], "bbox_id": "f39419b9f8", "file": "AppomattoxNewspapers_1933-1936a_0308.pdf", "page": 1, "text": "MiS Margaret Wright, of Peters burg is visiting Miss Margaret Hawley. a   George Hawley spent the week end at home.    Mrs. W. S Corning, of Chicago, is spending sometimc at Cymberian Farm near here.   J. T. Cole returned Mondr.y from vis t with relatives in Danville. t   Mr. and Mrs. Lee Covington, of .Virston Salem, N. C.. Dr and Mrs. John McKee, of Morgantown, N. C. .nd Mrs. R. F. D. Steele and son, of Petersburg, spent the week end with Mrs. James B. Abbitt and Mrs. W. T. Steele.    Ms. and Mrs. Calvig H. Robinson attended the Richmond and Roanoke football game Saturday in Salem.    Ernest Smith, of Harrisonburg, spent several days last week with his parents, Mr. and Mrs. M. C. Smith.    Mr. and Mrs. T. M. Trent en tertained at four tables of bridge"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "week end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Mrs. W. T."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "week end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Mrs. W. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [779.96, 450.6, 938.89, 936.84], "bbox_id": "df5cf85cdc", "file": "AppomattoxNewspapers_1898-1902a_0685.pdf", "page": 1, "text": "MartinMoore. The borne of Mr. W. E. Moore, at Beckham, was the scene of a bemti- iul wedding on Wednesday, May 7, when his attractive and accomplish ed daughter, Miss Maude Annie, be came the wife of Mi. E. B. Martin, u prosperous young farmer of this county. Promptly at 730 p . m . the bridal party, consisting of the bride, bride groom, and following attendants Miss Irvie Moore, of Buena Vista, with Mr, Edgar Martin Miss Mol- lie Martin with Mr. Forest Moore, Miss Faunie Moore with Mr. Robert Babcock, Miss Viola Moss w.th Dr. James B. Abbitt, Miss Edna Burge with Mr. Sidney Martin, Miss Alice Harvey with Mr. James Burge marched into the parlor to the sweet strains of the wedding march, ren dered by Mrs. T. It. Rucker. They were met at the hymeneal altar by Rev. 11. W. Dunkley, the officiating minister. The ceremony was very unique and impressive. Immediate ly after it, the entire party was in vited into the dining-room, where an old-time wedding supper was served. Suffice it to say that the party fared sumptuously. The contracting parties are very popular in the county, and were the recipients of many handsome and useful presents. Among those present fiom a dis tance were Rev. L. J. Moore, of Ma- otaca Miss Irvie Moore, of Buena Vista Dr. aud Mrs. T. It. Rucker of Pedlar Mills."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Viola Moss w.th Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Edna Burge with"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Viola Moss w.th Dr. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Miss Edna Burge with"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1856.61, 869.18, 2021.44, 896.38], "bbox_id": "f17d4199ea", "file": "AppomattoxNewspapers_1939-1943a_0430.pdf", "page": 1, "text": "M r , and M rs . W . T . Steel, Jr. ana son, of Richmond spent the week end with Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "M r , and M rs . W . T . Steel, Jr. ana son, of Richmond spent the week end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "M r , and M rs . W . T . Steel, Jr. ana son, of Richmond spent the week end with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [780.7, 473.68, 956.6, 775.54], "bbox_id": "e625083475", "file": "AppomattoxNewspapers_1939-1943a_0205.pdf", "page": 1, "text": "Lie utenant Dale Honeycutt spent last week end in Southwest Virginia. The Rev. W. M. Thompson, of Petersburg, was in Appomattox on  Monday. We are glad to see Mrs. W.M. 1  Kbitt out after a receni. illness. We are also glad to repor. that her .... or, Anne Culvin, who has bien sick, is improving. Mrs. Harry P . Daviss pent sev eral days last week in Richmond. Mrs. E . E . Gills and Miss Louise , Gills are spending the winter months at Tuscan Villa, Apartment 8, Ken- ! singbon Ave. Richmond. Mr. and Mrs. Jerry A. Burke, Jr,, of Richmond and Richard Floyd Burke III, of Lex ng c-n were week i end guests in the home of Mr. and  Mrs. J , A . Burke. Mrs. W . T Steele has returned from a visit with relatives in Mor- gantan, N.C.and Winston Salem. Mr. and Mrs. C. D Staples and , daughter, Pricilla Ann, of Richmond j intently Visited her mother, Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Visited her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Visited her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1541.99, 737.49, 1786.01, 823.73], "bbox_id": "2842bb6edb", "file": "AppomattoxNewspapers_1952-1954a_0261.pdf", "page": 1, "text": "Jff J- Lloyd Hudson has returned to bis home here and is recovering from Y an operation he underwent at the IY 0 th Virginia Baptist Hospital Saturday. Mr. and Mrs. C. D. Staples and t two daughters, Priscilla and Sally, of Ct Richmond spent the week-end with m her mother, Mrs. James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "m her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "m her mother, Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.86, 800.29, 1596.29, 915.19], "bbox_id": "b4b72de284", "file": "AppomattoxNewspapers_1949-1952a_0435.pdf", "page": 1, "text": "jA. Burke, Mrs. Calvin H. Mrs. G. L. Doss, Mrs. W. Hind Mrs. James B. Abbitt Jhe state convention of d C. at Natural Bridge s ace Dawson has received Jher nephew, 1st. Lieut, th, of Philadelphia, was In Korea September 17. rlorted to be recovering."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. W. Hind Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> Jhe state convention of"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. W. Hind Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> Jhe state convention of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2282.91, 1556.71, 2460.36, 1623.74], "bbox_id": "e3d1723a52", "file": "AppomattoxNewspapers_1943-1947a_0491.pdf", "page": 1, "text": "j er service on September 25 at 730 P. M., observing the State Mission Season of Prayer. All organiza tions will participate, with Mr3. James B. Abbitt is lea de-.. It s I requested that state mission offer ings be sent or br lUglu"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "will participate, with Mr3. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is lea de-.. It"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "will participate, with Mr3. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> is lea de-.. It"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1853.51, 319.59, 2036.13, 1277.57], "bbox_id": "ec4d11ff07", "file": "AppomattoxNewspapers_1939-1943a_0242.pdf", "page": 1, "text": "is spending the week here with Mr. and Mrs. Calvin Robinson. The. RvA B. F. Robinson will spend  tonight here, after Attending the sessions of the  Baptist General Association this Tveek in Danville, Oscar Scheffler, of Radford, was here for the week-énd. Miss Annie Martin, of Richmond, spent the week-end at her home near Spout. Spring. Mayor C. S. McDearmon will le- turn this- week-érid from Jackson ville, Florida, where he has been  visiting his daughter, Sirs. Elliott Cheatham. J. F. Inge, of- Crewe, has been on relief duty at the depot here this week. Richard McDearmon, of Richmond whs here for the week-end. ,v Mr. and Mrs. Russell Jamersen, of Arlington, spent the week-end with relatives here. Mr. and Mrs. Lewis. Doss and. daughter, Mrs. Ola Patteson and Mr. and Mrs. C. H. Robinson riiotor- ed to Radford Sunday. Mrs. S. J. Evans and daughter, Ann, Mr. and Mrs. H. G. föhn j son and family, of Lynchburg, spent Sunday with Mrs. Jennie Johnson. , Huck Babcock, of Columbia,,S, C., spent the week-end in Appo- mattox. Miss Clara Whitney Moaes was a dinnerguest Saturday evening of Miss Dorothy Lee Johnson in Lynch burg. Mrs. James B. Abbitt and daugh ter, Vay1 spent the week-end in Richmond with Mr. and Mrs. C.- D. Staples. Miss Frances Thomas spnt the week-end at her home in Richmond. Miss Kathleen Agee accoompanied Marian Jurié Evans to Lynchburg for the week-end. Mrs. Wilbtir McDearmon has re turned home after having been cali ed to Ivor due to iUness in her family. , ,  Murray Bates Jr. spent the week end in Richmond, v  Lewis McDearmon spent Tuesday in Roanoke.  . Vi. v. . Miss Edith OBrien, o f. Norfolk,, spent the week-end in the home of Mr. and Mrs. F. A. OBrien.  Miss Mandane Anderson, of Briit tol, spent the week-end at -her home  here. .  I Mrs. Ola Furbush spent the week- end in Bedford with Mr. and Mrs. Jack H. James. Mr. and Mrs. James Langrattand children have  returned to Appo mattox, after spending two weeks at Lovingston. George Cale, of Fork Union Charlie Abbitt of V. M. 1, Richard F Burke, of Washington and Lee, and Richard Leé Burke,e of V. P, L, spent the week-end at their respec tive homes here.-  . jjThei Sunbeam? met last Thurs day aftemootn with Mrs. Barry Dahl, with the following officers be ing elected LaFeniie O qss , presi dent and Bolling Conner, secretary and treasurer. . . _   -   Mr. and Mrs Calvin Robipsoi, Miss Beulah Ferrell and Raymond Jamerson motored to Lexington last Friday night to attend the. charter night banquet d r the Lexington Lions Club. v  5  . Lawrence Jioojre, of Washington, 1 spent Monday .ate his home here."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "in Lynch burg. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay1"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "in Lynch burg. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and daugh ter, Vay1"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.94, 1476.76, 1832.89, 1585.16], "bbox_id": "85db0f1082", "file": "AppomattoxNewspapers_1939-1943a_0127.pdf", "page": 1, "text": "in Lexinjgbdn. Miss Emily Featherston, who has been visiting her sister, Mrs. .W.A. iTIhomhill of Bluefield returned home Saturday. Mrs. Thornhill accom panied her here for the week end. Mrs Charles H. Balfour, Mrs. Richard A. Smith and Mrs. Milton. B. Ames, of Norfolk spent several days recently with Mrs. James B. Abbitt. . .  T . Mis. Frances Norton, of Wash"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "days recently with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. . .  T . Mis. Frances Norton,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "days recently with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. . .  T . Mis. Frances Norton,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2022.25, 270.61, 2529.79, 498.78], "bbox_id": "c67913928d", "file": "AppomattoxNewspapers_1943-1947a_0026.pdf", "page": 1, "text": "i Lt. Leonard H Childim, Jr.r of Guests in the horns of Mr. and ,0 u. S. Army Air Corps has re- Mrs. Roland Ferguson Sun lay were turned to the United States and is Mr.and Mrs. Jack Snrh ar.d soil,  now stationed at the A.rtiy Air Base Burnette,. Mr. and Mrs. CUrence at Charleston, S C. Smith and family, of Uyn hburg, j ..  Mr and Mrs Herman Guill and  The mee ing of the U. y- daughters, Mr.and Mrs. Harris and  which was scheduled to be held inis children, Mrs. C. C. Ferguson, j with Mrs. W .W Scott, nas Miss Juan Ferguson, Melvin Smith 1,en postponed iniliUteiy 1Yle  ml Hop, David, Ralph and Lowe ber8 will be notified when the meet- Thonias Ferguson. ing is to be held. Mrs. A. R. Harwood, Mrs. J . C .  -- Caldwell, Miss Mary Trent, Mrs. I James B. Abbitt and Miss Vay Ab-,  _ _ T l l A a t f A bitt are spending today in Rich-   H  C  llV mond. Miss Jean Cheatham lef this morn ing to visit ncr aunt, Mrs. Minnie  Massey, of Newport News Mrs. D. A. Conner spent last 11.s. - -------- - ----- week in Petersburg with her daugh- Gordon anj Mrs. Myrtle Paris and ___  TT 1 CfVlA TOO C . i 1 1 Y n itA flP"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mary Trent, Mrs. I <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Miss Vay Ab-,"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mary Trent, Mrs. I <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> and Miss Vay Ab-,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1497.59, 474.14, 1660.53, 554.49], "bbox_id": "3e184692f2", "file": "AppomattoxNewspapers_1939-1943a_0053.pdf", "page": 1, "text": "Fwmk Gilliam, of Roanoke spent -----  with his mother, Mrs. ,iam. id Mrs. JohnS. McKee and lorganton, N.C., and Mr. Clarence D. Staples, of were guests in the home f James B. Abbitt over the"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "in the home f <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> over the"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "in the home f <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> over the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1840.31, 500.69, 2011.06, 900.23], "bbox_id": "955eee7e4e", "file": "AppomattoxNewspapers_1952-1954a_0203.pdf", "page": 1, "text": "Funeral services for Miss May Burke, for many years a puty treasurer of Appomattox County, were held at 2 30 P. M. Tuesday afternoon at the Liberty- Baptist Church, with interment in the Church Cemetery. Services were conducted by the Rev. W. M. Thompson and the Rev. Edgar S. Price. Miss Burke died Sunday in a Lynchburg Hospital. For a number of years, she had been chairman of the Appomattox Chapter, American Red Cross. She was past president of the County Chapter of the Daughters of the Confederacy, member of the D. A R., organizer of the Young DemO cratic Club of Appomattox Coun ty, organizer of the first Girl Scout Troop in the county, instrumental In organizing and conducting health clinics, including T. B. and Crippled Childrens clinics. Surviving are three brothers, K L. and J. A. Burke, both of Appo mattox and William H. Burke, of Floyd two sisters, Mrs. James B Abbitt and Mrs. W. T. Steele, both of Appomattox, and a number of neiees and nephews. _ Active pallbearers were Dr. C. U OBrien, Dr. C. F. James, C. K Hunter, Dr.. H. Y. Spencer, H. C, Pulliam, Judge Joel W. Flood, C W. Smith and R. B. Hudgins."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Floyd two sisters, Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark> and Mrs. W. T."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Floyd two sisters, Mrs. <mark>James</mark> <mark>B</mark> <mark>Abbitt</mark> and Mrs. W. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1116.27, 336.74, 1283.87, 386.59], "bbox_id": "40adce1982", "file": "AppomattoxNewspapers_1952-1954a_0332.pdf", "page": 1, "text": "FOR SALE A Baby High Chair, n excellent condition. See Mrs. W. T. Steele In home of Mrs. James B. Abbitt, Appomattox, Va. ltc"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "FOR SALE A Baby High Chair, n excellent condition. See Mrs. W. T. Steele In home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Appomattox, Va. ltc"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "FOR SALE A Baby High Chair, n excellent condition. See Mrs. W. T. Steele In home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Appomattox, Va. ltc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1836.7, 663.52, 2004.23, 701.47], "bbox_id": "6805c00fde", "file": "AppomattoxNewspapers_1939-1943a_0053.pdf", "page": 1, "text": "FOR RENT First floor apart ment, residence f Mrs. James B. Abbitt. See Mrs. Abbitt, at Bank of Appomattox."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt", "Abbitt"], "snippet": "FOR RENT First floor apart ment, residence f Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. See Mrs. <mark>Abbitt</mark>, at Bank of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt", "Abbitt"], "snippet": "FOR RENT First floor apart ment, residence f Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. See Mrs. <mark>Abbitt</mark>, at Bank of Appomattox."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [366.24, 1196.17, 525.82, 1229.9], "bbox_id": "8bc1a49508", "file": "AppomattoxNewspapers_1933-1936a_0262.pdf", "page": 1, "text": "FOR BENT  Upper apartment ta the home owned by Mrs. James B. Abbitt j town of Appomattox. Apply to MRS J. A BURKE."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "FOR BENT  Upper apartment ta the home owned by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> j town of Appomattox. Apply to MRS J. A BURKE."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "FOR BENT  Upper apartment ta the home owned by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> j town of Appomattox. Apply to MRS J. A BURKE."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1863.07, 896.79, 2211.06, 1725.65], "bbox_id": "3ffcaa81ec", "file": "AppomattoxNewspapers_1943-1947a_0055.pdf", "page": 1, "text": "erai days wren tvuoui, jyir ana hub , a . v . --- Mary Louise Gills. Mrs. Scull was and- Mrs. L. T. Lucado and da ugh the former Miss Jane McFerran, of er Avis, Mr and Mrs. L.H.Child- Roanoke nd visited here some ers and grrndson, Len Raymond, years ago. j and Mrs. J . A. Bingham. Mrs. W. L. Brown is visiting her Mr. and Mrs. Lloyd Doss had as daughter, Mrs. Jimmy Carter, in their gue ts last week-end Mr.and j Crewe.  jjrg clarence Stanley and daugh - 1 Miss Annie Hancock, of Salem, teFf Helen, Mr. and Mre. bert spent the weekend in the home of patterson, of Lynchburg, and Mrs. her mother, Mrs. W. M. Hancock, j r D oss and daughter, Thelma. Mrs. Gallic Cates, of Buena Vis- Miss Gertrude Doss spent last ta visited her sister, Mrs. F. L. week-end with her sister, Mrs. T.K. Murphy Sunday. i Moore. Mrs. Carroll Smith is spending Msr. Clarke Moore and daughter this week in Richmond with Mr. j Mary Ellen, Misses Pearle Henry, Smith and her cousin, Mrs. Camer on Seay. Edward Scott Cates, of Hampden Sydney spent the week-end in Ap pomattox. Mrs. David Nichol Twyman, of Williamsburg is visiting relatives and friends in Appomattox. Miss Mandane Anderson, of Bris tol, spent the week-end with Mr. and Mrs. B. G. Anderson. Mrs. W. D. Morris spent the week-end with her parents in Cum berland. Mrs. Ola Patteson will return to her home here this week-end after visiting her daughter, Mrs. G. L. Doss in Portsmouth. Oscar Seheffler and Sam Collins, who work at the Naval Base in Norfolk, were home for the week end. L. E. Morris, of Norfolk, will trrive this week-end to spend soma me at his home here. Frankie Dresser, of V . M. I . was ome last week-end.  Miss Rebecca Johnson, of Lynch urg spent toe week-end with Mrs. Calvin Robinson. Miss Edith Lucado, of Lynchburg md Miss Doris Lucado, of Rich- nond spent the week-end with their j arents, Mr.and Mrs. James H. Lucado. Miss Betty Collins, of Lynchburg spent the week-end at her home near here.. Mr and Mrs. C. D. Staples, nd daughter, Priscilla, and Miss Covie Morrison, of Richmond spent the week-end in the home of Mrs. James B. Abbitt. Miss Dot Sears, of South Boston hd Robert Allen Sears, of V .P.I. spent the week-end in Appomattox. Miss Vay Abbitt spent last week in Richmond as the guest of her sister, Mrs. C. D. Staples. Mrs. F. C. Dresser, Mrs. H. F. Jones and Mrs. H . P . Davis spent Monday night in Richmond. Mrs. W. S. Bryant, of Cullen, called to see her sister, M rs.T.U. Conner Tuesday. Dr. Adfield McCainIs spending this week st his home in Alabama. Sgt. and Mrs. F. T. Cawthorn, Jr, and daughter, Carol, of Peters- l . __ _ Alt n rA a lf-O n W lt.F 118"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Miss Dot Sears, of"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "the home of Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Miss Dot Sears, of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2316.67, 593.81, 2485.27, 771.06], "bbox_id": "b908b09874", "file": "AppomattoxNewspapers_1939-1943a_0335.pdf", "page": 1, "text": "Betty Burke Covington, of Win ston-Salem, N. C., is visiting Mrs. James B. Abbitt. Mg. and Mrs. C. D Staples aind .daughter, Priscilla Ann, of Richmond, spent the week end with Mrs. Abbitt. Mr. and Mrs. J. A. Burke, Jr., and R. F. Burke III, were guests Of Mr. and Mrs. J. A. Burke, Sr., over the holidays. Dr. Charles F. James, Jr., of New York, spent the week-end here with his parents.  A. R. Harwood is building a res idence On Route 460, opposite the Burges No. 8 Service Station."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "C., is visiting Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mg. and Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "C., is visiting Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Mg. and Mrs. C."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.48, 746.57, 1528.03, 775.27], "bbox_id": "fb91b68fff", "file": "AppomattoxNewspapers_1952-1954a_0402.pdf", "page": 1, "text": "bbitt, of Richmond, jek-end here with her James B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "bbitt, of Richmond, jek-end here with her <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "bbitt, of Richmond, jek-end here with her <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1519.46, 712.45, 2195.71, 1225.98], "bbox_id": "863499d70c", "file": "AppomattoxNewspapers_1943-1947a_0011.pdf", "page": 1, "text": "Babcock himself had given the an- ?le that the five bells should be j ment whereby the entire output be- tolled all night on the night of the comes available to the United States, end of the war. Perhaps we can or-1 With thousands of troops fighting anize a club of pledgees to report in tropical areas where malaria is it the hotel immediately upon the a constant threat, the needs for qui- news that the war is over, and toll nine are extensive, he bells until dawn. I ______________ Bunch of Bananas Puts An intifcnate sketch on Harry t Hopkins came to our attention re-1 Two Into Naval Service E. H. Cawthorn has returned rom the hospital. Miss Kate OBrien, who has been teaching in Farmville for the past session, will arrive Saturday to spend some time at her home near here. -  Miss Nancy Ward, of Tazewell, Va. was a guest of Miss Alice Har wood the past week. Mrs. H. G. J-ohnson, of Lynch- jurg spent Monday .with her sister Mrs. Calvin Robinson, en route to Portsmouth to spend the rest o f he week with Mrs. G. L. Doss. Mrs. C D Staples and daughter, Priscilla, of Richmond are visiting ler mother, Mrs James B. Abbitt. Miss Mildred Christian, will leave September 12 for Tallahassee, Flo- ida, where she will be student die tician in the Womans College. Her ister, Miss Catherine Christian will be a student at the same school. Booker Bunch, of Lynchburg was i guest of Miss Mildred Christian Wednesday. Mrs. H. B. West has returned to her home here after spending a month with relatives in Ashville, N. C. Miss Joyce Christian is visiting I.russer, of Roanoke, spent Friday Miss Jean Stratton, of Bedford, j-.ht in the home of Mr and Mrs. Miga Kate Franklin win ieave Y. . P. Ferrell. , next week to visit her brother, Dr. Miss Dorothy Ould, of Norfolk.! lames H. Franklin, in Chester, Pa. Miss Catherine Christian is spend-"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "visiting ler mother, Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Miss Mildred Christian, will"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "visiting ler mother, Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>. Miss Mildred Christian, will"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1643.99, 1298.89, 2128.89, 1373.82], "bbox_id": "59986add4d", "file": "AppomattoxNewspapers_1933-1936a_0315.pdf", "page": 1, "text": "Apartment for RENT furnished or unfurnished. Mrs. James B. Abbitt, Phone 54 Appomattox, Va. Hixburg Red Cross Drive"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Apartment for RENT furnished or unfurnished. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Phone 54 Appomattox, Va. Hixburg Red Cross Drive"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Apartment for RENT furnished or unfurnished. Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Phone 54 Appomattox, Va. Hixburg Red Cross Drive"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [425.06, 421.47, 589.27, 480.92], "bbox_id": "a996d8ae0e", "file": "AppomattoxNewspapers_1952-1954a_0149.pdf", "page": 1, "text": "1OR SAL E Kurtzman Up right Pinno. Whitt enamel wood or coal COOk s .ove with reservoir for hot wat er. Both reasonably priced. Mrs James B. Abbitt i n"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "1OR SAL E Kurtzman Up right Pinno. Whitt enamel wood or coal COOk s .ove with reservoir for hot wat er. Both reasonably priced. Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> i n"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "1OR SAL E Kurtzman Up right Pinno. Whitt enamel wood or coal COOk s .ove with reservoir for hot wat er. Both reasonably priced. Mrs <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> i n"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1253.27, 311.24, 1427.64, 631.02], "bbox_id": "54682e36dd", "file": "AppomattoxNewspapers_1939-1943a_0149.pdf", "page": 1, "text": "! Ji. U.UU.JUt1 LJ..CV 1 JJ IWBZIW JJJ. lias. The groom had as his best man his brother, Lieuetnant Jeffries Jam es, of Lancaster, Pa. The following zeted as ushers Lieutenant Eames A Powers, of Richmond Lieut- nant Paul Douglas Stogsdale, of Lexinglon Bayliss Rector Garson, Jr., of Wakefield, and John Allen Booth, of Appomattox. A reception for the bridal party, relatives and out-of-town guests was held immediately after the cere mony in the home of the brides great uncle and aunt the late Mr. and Mrs. Richard F . Burke, with Mrs. James B. Abbitt, Mrs. Will- !am T Steele, Mrs. Jerry Allen Burke, Mrs. R. L. Burke and Miss Eula Mae Burke as joint hostesses, all of whom were daughters and daughters-in-law of the late Mr.and Mrs. Burke. After the reception Lieutenant and Mrs. James left for a Northern trip. Mrs. James is a popular mem ber of the communitys social set, and is a young lady oi unusual charm. She is a graduate of the Appomati ox high school and has held a secretarial position with her uncle, the late John Edward Sears."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "F . Burke, with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs. Will- !am T"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "F . Burke, with Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>, Mrs. Will- !am T"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [350.14, 1086.45, 509.99, 1121.15], "bbox_id": "d917a52f7e", "file": "AppomattoxNewspapers_1933-1936a_0259.pdf", "page": 1, "text": ", FOR RENT Upper apartment in the home owned by Mrs. James B. Abbitt in town 0f Appomattox. Apply to MRS J. A. BURKE."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": ", FOR RENT Upper apartment in the home owned by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> in town 0f Appomattox. Apply to MRS J. A. BURKE."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": ", FOR RENT Upper apartment in the home owned by Mrs. <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark> in town 0f Appomattox. Apply to MRS J. A. BURKE."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.48, 1206.06, 1655.57, 1336.9], "bbox_id": "4f68d1b543", "file": "AppomattoxNewspapers_1898-1902a_0185.pdf", "page": 1, "text": ". . now more suitak farming operations, there is quite uW ivas ii.-aislpd in i i. ill all kinds of business, speciallyit in Wig OpeiatKin by Dr, noticeable in seeds and fertilizers. Talibfern, of Pamnlin i i i v l i .. . lover seed is now being sold at quii  9 1 1 liy , iJtW, sonable prices, and the sales will be veiji of Lviiclj bu ns  D M an da K a  .0 this season. Almost all grass sc dsw   9 lvOuei .HOI. and farmers are buying freely. and James B. Abbitt  Oats are somewhat higher than oa  tli crop was generally short. rni  , - tT. , Fertilizers are now being old quitti J-fie liOiird Of vlBltOrs of ilit Vii-i gr use on plant-beds. Millers bigM  . Tobacco-Fertilizer ha given entiressc 114 Mllltury lBStltllt, at jis inuei- tion for that purpose. It is sold in Jp n .... andfbu-pouna baas. ng June 19, will fall ten viicancH-t . , 3  In the State padetshijis at. thai lim- . . - Tf school. One cadetship will come u a j ft, this the 18th senatorial dietrict."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "are buying freely. and <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>  Oats are somewhat higher"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "are buying freely. and <mark>James</mark> <mark>B</mark>. <mark>Abbitt</mark>  Oats are somewhat higher"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [193.69, 623.5, 519.68, 815.05], "bbox_id": "2a71c82f87", "file": "AppomattoxNewspapers_1926-1933a_0519.pdf", "page": 1, "text": "State senator S. L- Ferguson, of Appomattox, presided at a caucus of senate Democrats Tuesday night in Richmond, and during the caucus was pre sented with a gravel, made irom a tree on the site of the surrender at old Appomattox court house. The gavel w as presented by the Appomattox U. D. C. and was turned over to lieutenant governor James Dr. J. B. Abbitt Dies In Norfolk I H- IJrice ______ I Senator Ferguson is chair- . ,  .. T .... man of a number of important Final Rite Here Today For and nerhans Prominent Former Citizen"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "over to lieutenant governor <mark>James</mark> Dr. J. <mark>B</mark>. <mark>Abbitt</mark> Dies In Norfolk I"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "over to lieutenant governor <mark>James</mark> Dr. J. <mark>B</mark>. <mark>Abbitt</mark> Dies In Norfolk I"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [940.23, 966.53, 1063.38, 987.58], "bbox_id": "6e162f6e86", "file": "AppomattoxNewspapers_1933-1936a_0382.pdf", "page": 1, "text": "Mrs. James r, Vay. are B . Abbitt and in Norfolk."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> r, Vay. are <mark>B</mark> . <mark>Abbitt</mark> and in Norfolk."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Mrs. <mark>James</mark> r, Vay. are <mark>B</mark> . <mark>Abbitt</mark> and in Norfolk."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [528.94, 410.61, 716.47, 601.6], "bbox_id": "095f1bb635", "file": "TimesVirginian_1984a_0126.pdf", "page": 1, "text": "Twenty-nine members of tin Appomattox Senior Chapter Future Farmers of America were elected to the degree of Chapter Farmers in cerem onies held at Appomattox County High SchooHliiring the regular FFA meeting. Those members elected to this second degree of membership include Roger Abbitt, Joe Arrighi, James Baldwin, Bobby B ryant, Robert Chenault, Michael Franklin, Chip Garrett, Todd Garrett, Mike Hamlett, Darryl Hurt, Chip Irvin, Joseph Johnson Jim Kennon, Kevin Kidd, Larry Mabrv. Keith Martin, Wayne Martin, Curtis Moore, Corey Murphy, David OBrien. Scott Phelps, Craig"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "James", "B"], "snippet": "of membership include Roger <mark>Abbitt</mark>, Joe Arrighi, <mark>James</mark> Baldwin, Bobby <mark>B</mark> ryant, Robert Chenault, Michael"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "James", "B"], "snippet": "of membership include Roger <mark>Abbitt</mark>, Joe Arrighi, <mark>James</mark> Baldwin, Bobby <mark>B</mark> ryant, Robert Chenault, Michael"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.01, 1518.39, 1674.02, 1730.99], "bbox_id": "70528448df", "file": "AppomattoxNewspapers_1918-1922a_0115.pdf", "page": 1, "text": "of Appomattox all welcome Miss Grace back. Among the visitors to Appo mattox for the holidays we mention Mr. Harry Hancock wife and son, of Lynchburg H D Flood, of Washington Mrs J. B. Abbitt, of Norfolk Ray an James Stanley, of Norfolk Adam Clement and Kendall Hunter, of Washing ton V. B. Clement, ot Danville Mrs. F. G Craig, of West, Va Mrs. Baylis Carson, Mr and Mrs Walter Booth, Mrs. Oia Furbush, W alter Durham, o LicbmondJack Higginbotham, of Alleghany."}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt", "James"], "snippet": "of Washington Mrs J. <mark>B</mark>. <mark>Abbitt</mark>, of Norfolk Ray an <mark>James</mark> Stanley, of Norfolk Adam"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt", "James"], "snippet": "of Washington Mrs J. <mark>B</mark>. <mark>Abbitt</mark>, of Norfolk Ray an <mark>James</mark> Stanley, of Norfolk Adam"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1524.01, 908.47, 1699.31, 1205.96], "bbox_id": "b1d72163fb", "file": "AppomattoxNewspapers_1939-1943a_0216.pdf", "page": 1, "text": "Mr. and Mrs Mitchell Lewis and son, Ronnie, have returned from a  Visit with relatives in Chatham. Mrs R C. Moore attended th e . funeral ofthe late Mrs.James Do- ley in Portsmouth, Ohio, Friday. Oscar Hall has returned home i from the hospital and is improving after a recent illness. tr Charles James J r ., of. New York, spent part of the holidays j here with his parents. Mr. and Mrs. Hardy Kestner soent Christmlas daiy with Mr. and Mrs. George White. Misses Lucy LeGrand and D ot, Beasley spent part of the holidays with friends in Columbus, Oh. Mr and Mrs. Russell Jamerson, of Arlington, visited relatives here  during Christmas week. Mrs. L. W. Carter and Miss Hilda Carter visited relatives in Lynchburg last Thursday. Mrs. James B. Abbit. and Miss Vay Abbitt spent the. holidays in Richmond."}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Lynchburg last Thursday. Mrs. <mark>James</mark> <mark>B</mark>. Abbit. and Miss Vay <mark>Abbitt</mark> spent the. holidays in"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Lynchburg last Thursday. Mrs. <mark>James</mark> <mark>B</mark>. Abbit. and Miss Vay <mark>Abbitt</mark> spent the. holidays in"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1593.86, 1145.07, 1763.31, 1640.78], "bbox_id": "604489fb78", "file": "AppomattoxNewspapers_1902-1905a_0446.pdf", "page": 1, "text": "J e n n i n g s S t r a t t o n The social event of the seaeon took place yesterday afternoon at the home of .Vir. and Mrs. H. B. Jennings, when their daughter, Nannie Lou, became the bride of M r. James Ernest Stratton. Dr. J, O. Davidson performed the ceremo ny, and lit. le Mary Beasley, of Lynchburg, was ring bearer. The bride and gropm entered to the strains.of the wedding march, beautifully rendered by Mrs. Au- drew R. Jeuniugs of Roanoke, Va, Miss Maggie iVlay Jennings, cousin of the bride, was n aid of honor, and H, B. Jenniugs, Jk, brother of the bride, was best man. Hid other attendants were Miss Annie Davidson audT, C. Strattou, Miss Janje Thornhill and J. R. Horsley, Miss Mary Fannie Moss and Dr J. B, Abbitt, Miss Esmer Snapp aud James Carson, Miss Emma Giey Jennings and Osborne Davidson, Miss Sue Davidson and George O. Thornhill. The spacious parlors were beauti fully decorated with evergreens. Tbe bride woie a beautiful gown of crepe de chine over taffeta, aDd her flowing tulle veil was caught with pearls, aud she curied a shower boquet of 111 lies of the valley. Those iu attendance from a dis tance were Mrs. E. C. Beasley, of Lynchburg, - Va. Misses Maggie May and Emma Grey Jennings, of Amherst Mrs. S. O. Stratton, of Richmond Miss Louise Stepton, of Bedford Miss Mattie Davis, of Amherst Mr. B. F  Cox of Big Island, and Mrs. A. R. Jennings, of"}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt", "James"], "snippet": "Moss and Dr J. <mark>B</mark>, <mark>Abbitt</mark>, Miss Esmer Snapp aud <mark>James</mark> Carson, Miss Emma Giey"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt", "James"], "snippet": "Moss and Dr J. <mark>B</mark>, <mark>Abbitt</mark>, Miss Esmer Snapp aud <mark>James</mark> Carson, Miss Emma Giey"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.74, 362.2, 620.74, 1795.51], "bbox_id": "c22bc15a56", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "By order of the Electorial Board of Appomattox County, all Regis tration Books in Southside District shall be purged as of October 4 1954. The names listed below have been removed from the Registration Books, Courthouse Precinct, South- side District, Appomattox County Virginia for reasons of death transferred or moved. This action is provided for and ordered under Sec tions 24-94 through 24-107 of the Virginia Election Laws as amend ed. Any one who can prove conclus ively that any of the names listed below have a right to be on the Registration Books of said County of said district, they shall make such information available to the undersigned registrar. JAMES H. LUCADO REGISTRAR. E. B. Abbitt W. A. Agee A. W. Almond Henry C. Almond Leonard Anderson T. F. Akers C. N. Abbitt J. Russell Abbitt J. R. Adams R. M. Almond T. Dyer Almond Daniel Almond Mrs. Patricia Almond Helen West Alvis Vergie L. Almond Mrs. W. M. Almond Mrs. R. F. Akers W. W. Brown J. W. Blackwell F. B. Blackwell Homer W. Blackwell John A. Booth K. V. Barlow H. H. Bazemore Harold W. Babcock George W. .Bass Alfred Bryant D. J. Berger L. I. Bryant Henry H. Beale William Boyce Alfred L. Barlow R. W. Burkey W. L. Brown H. M. Burge George P. Blackwell J. O. Babcock R. H. Bates O. S. Burnett Jerry A. Burke, Jr. P. M. Burton R. F. Burke, II F. E. Babcock R. H. Baber R. B. Boney, Sr. Berkley Brown H. 0. Blackard Jennie L. Blackwell Eula M. Burke Mrs. Myrna S. Bingham Mrs. Sallie Binkley Mrs. Julia A. Burton Mrs. Jessie Fitzgerald Baird Pearl E. Berger Mildred Babcock Mrs. K. V. Barlow Dorothy Buchanan Mrs. Nannie V. Blackwell Mrs. Ila Jean Buettner Miss Ila V. Buchanan Majorie B. Bailey Mrs. Martha A. Baber Mrs. Bertha L. Baber Addie Bates Mrs. Thelma L. Bazemore Katherine Burge Sara Beasley Mrs. Stanley Blystone Mrs. Mozell D. Boyce Mrs. R. B. Boney, Sr. J. W. Baber W. C. Chilton, Jr. Julian M. Campbell William A. Clark Tucker Cheatham J. W. Cawthorn, Jr. J. H. Cheatham L. Crawley J. B. Chilton J. T. Cole J. S. Cyrus E. P. Carson W. P. Coleman James L. Caldwell J. W. Caldwell J. T. Coleman J. M. Clapp Harvey A. Caldwell Wiley Coleman M. Earl Carson T. L. Christian R. L. Carter Archer A. Caldwell N. H. Cheatham E. H. Cawthorn Wilson R. Cole T. A. Clark S. H. Collins Twyman Conner R. E. Clapp Harry P. Clark W. Twyman Coleman P. W. Coleman W. A. Coleman W. W. Carter John L. Cates, Jr. G. A. Chocolate Enid M. Clapp Robert Cawthorn W. L. Coleman H. S. Coleman E. G. Cheatham T. E. Childress J. R. Conner John R. Cheatham Roy Conner D. L. Cawthorn F. T. Cawthorn, Jr. C. C. Cawthorn J. D. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["JAMES", "B", "Abbitt"], "snippet": "to the undersigned registrar. <mark>JAMES</mark> H. LUCADO REGISTRAR. E. <mark>B</mark>. <mark>Abbitt</mark> W. A. Agee A."}}, "highlights": [{"field": "text", "matched_tokens": ["JAMES", "B", "Abbitt"], "snippet": "to the undersigned registrar. <mark>JAMES</mark> H. LUCADO REGISTRAR. E. <mark>B</mark>. <mark>Abbitt</mark> W. A. Agee A."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [810.71, 1186.26, 967.73, 1487.86], "bbox_id": "baa5aefb5e", "file": "AppomattoxNewspapers_1898-1902a_0017.pdf", "page": 1, "text": "The remains were carried by the faithful old horse  John, that the deceased had for the last 20 years had in his service, to Mt. Vernon Church, where he was laid to rest. The pall-bearers were  Messrs. C. A. Abbitt, C. B. Bloxton, C. W. Cardwell, James Carson, B. B. Wil son and E. 6 . Moore. Well done, thou good and faithful servant Enter thou into the arms of thy Lord. Mrs. Rev. Fisher and family have our deepest sympathy in their sad affliction. Miss Maggie Dickey, of Lynch burg, is visiting Miss Rosa Howard, of this place. Mrs. C. H. Furbush accompanied by her daughter, Mr. E. P. Cham- berlayne spent Tuesday with the family of Mr. Ellis Simms, in App omattox. Miss Ruby Woodson, of Lynch burg who has been sojourning here left Sunday for her home. P ye ."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "B", "James", "B", "B"], "snippet": "were  Messrs. C. A. <mark>Abbitt</mark>, C. <mark>B</mark>. Bloxton, C. W. Cardwell, <mark>James</mark> Carson, <mark>B</mark>. <mark>B</mark>. Wil"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "B", "James", "B", "B"], "snippet": "were  Messrs. C. A. <mark>Abbitt</mark>, C. <mark>B</mark>. Bloxton, C. W. Cardwell, <mark>James</mark> Carson, <mark>B</mark>. <mark>B</mark>. Wil"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2117.3, 362.08, 2280.88, 848.25], "bbox_id": "13bb5f5b1f", "file": "AppomattoxNewspapers_1902-1905a_0059.pdf", "page": 1, "text": "Onr W eek Island river was so swollen from the rain Sunday as to be. past fording. One of our bright cities suggests that we petition to con gress for an appropriation to entarg- en the channel which seems too small for the immeuse stream of water. The trappers have caught a large quantity of tbe destructive varmints aud are shipping the skins to other parts. Notwithstanding the inclement weather of the 2d Sabbath, there were about sixty at Hebron. The rain came in torrents aft-r the con gregation dispersed, and we fear those who live at a distane were well ed. Bethel P. M. church of our town is without u pastor at present, A uoble consecrated little band wor ships there, aud they deserve a good pastor. . Ye are glad to see Gapt. T. J Stratton out again aud looking well Mr. N-. W. Owens, Oapfc. Watt Carson, Mrs. Lizzie Stratton aud others are victims of la grippe. Mrs. F. D. Horsley, whose horse ran away throwing her out of her bupgy has nearly recovered. . Mr. Jas. B. Taylors little four year old daughter Annie Clare has been very sick, but is jnow improv ing- Mr. Harry Blanks, who out his, foot bo budly to hinder him from farming, has left for Amherst for a position iu u store. Dr. James Abbitt is growing in favor and pructioe. Mrs. V. B. Taylor is hauling in material for a nice nw dwelling. Quite an improvement it will hp- t the suburb uf pHMsh Oaks, The T imes has been coming so re guluriy F.iJav. so newsy aud cheer ful."}, "highlight": {"text": {"matched_tokens": ["James", "Abbitt", "B"], "snippet": "iu u store. Dr. <mark>James</mark> <mark>Abbitt</mark> is growing in favor and pructioe. Mrs. V. <mark>B</mark>. Taylor is hauling in"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "Abbitt", "B"], "snippet": "iu u store. Dr. <mark>James</mark> <mark>Abbitt</mark> is growing in favor and pructioe. Mrs. V. <mark>B</mark>. Taylor is hauling in"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1373.99, 753.48, 1524.73, 793.53], "bbox_id": "04c4365626", "file": "AppomattoxNewspapers_1947-1949a_0018.pdf", "page": 1, "text": "Mrs. J. B. Abbitt and Mr. and rs. C. D. Staples visited James- oti and other points of interest ently."}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt", "James"], "snippet": "Mrs. J. <mark>B</mark>. <mark>Abbitt</mark> and Mr. and rs. C. D. Staples visited <mark>James</mark>- oti and other points of interest ently."}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt", "James"], "snippet": "Mrs. J. <mark>B</mark>. <mark>Abbitt</mark> and Mr. and rs. C. D. Staples visited <mark>James</mark>- oti and other points of interest ently."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1848.0, 736.67, 2012.15, 1609.54], "bbox_id": "23a7c5adf2", "file": "AppomattoxNewspapers_1939-1943a_0404.pdf", "page": 1, "text": "JRAND TOTAL turned in to War Fund Treasurer as of 5 P. M. January 7, .......... 962.77 LReported last week F L Murphy  10.00 .. O. Paulette 5.00 Mrs Carolyn Cates 1.00 Mrs Lillia H Gregory 20.00 iiss Naomi Hancock 5.00 ppomr.ttor Garment Co. 19.00 note Garment Factory employees gave 52.00 in Roll Call drive, and plan to makè their contribution one hundred per cent. C L Cash 1.0C G. B. Buchanan 4.0C Rev H F Jones 20.00 R C Hubbard 1.00 Chas. F James 25.00 Mrs T H Unge 5.00 Mrs J B Abbitt 1.00 J T Irby 1.00 H. M. Burge Cd. and Employees 60.00 Moses Motor Co. 50.00 Southern Battery Co. and Employees 50.00 J.E . Sears Co. and Employees 50.00 Hunter Lumber Co and Employees Ix M J. W Durham 1.00 Miss Ecla May Eurke 10.00 Central Vr.. Electric Cooperative Company 10.00 George D Coleman 1.00 Joel W. Flood 25.00 Norman H Cheatham 1.00 Mr and Mrs Carroll Smith 10.00 Dr C. G. OBrien 15.00 B G Anderson 10.00 W S Taylor 10.00 Obey Ferguson 1.00 C L Johnson 1.00 L N Herncall 1.00 H B Martin 1.50 J P Taylor 10.00 Bank of Appomattox 50.00 N R Featherston 1.00 J W McDearmon 1.00 St. Paul Baptist Churcn 2.50 Farmers National Bank 50.00 Mr and Mrs L J Morris 5.00 E W Smith 5.00 Mrs Adelia G Ferguson and Lawson family 25.00 Mrs Jennie Johnson 1.00 TOTAL ................................ 591.00 J . W . Cawthon 2.50 Mrs. G. R. Purdum 5.00 Mrs. Clara Davis 2 00 W. D Morris 2.60 J . D Morris 2.50 Cash 2 00 Calvin H. Robinson 5.00 L. M. Wilkes 2.00 Oscsr Scheffler 1.00 C. W. Smith 10.00 Eastern Star 5.00 Lester Harvey 2 00 W. E. Hancock 5.00 E . W , Morris 1.00 Mrs. M H . Lawson 1.0C R . L. Burke 10.00 Mr. and Mrs. W P Ferrell 5.00 H. W. McKinney 5.00 C. S McDearmon 5.00 Mr. and Mrs. G. M. Dixon 2.00 Miss B. Ligon 1.00 Rev. W . R Reed 5.00 A Friend 1.00 Mrs. Virginia Marks 2.0Ò C S. Jenkins 5.00 Mrs. W. M Hancock 5.00 Miss Frankie McKinney 1.00 Mrs, Watt Stanley 1.00 Clarence Gobble 1.00 G. W. B ess 1.00 Miss Cornelia Gills 1.00 A. R Harwood 5.00 Appomattox Hardware Co. and employees 50.00 G. F. Abbitt, Jr. 15.00 R.B. Haley 3.00 J . C Hudgins 20.00 W. M Abbitt 15.00 Don Moses 5.00"}, "highlight": {"text": {"matched_tokens": ["James", "B", "Abbitt"], "snippet": "Hubbard 1.00 Chas. F <mark>James</mark> 25.00 Mrs T H Unge 5.00 Mrs J <mark>B</mark> <mark>Abbitt</mark> 1.00 J T Irby"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B", "Abbitt"], "snippet": "Hubbard 1.00 Chas. F <mark>James</mark> 25.00 Mrs T H Unge 5.00 Mrs J <mark>B</mark> <mark>Abbitt</mark> 1.00 J T Irby"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [477.86, 1090.69, 646.57, 1149.69], "bbox_id": "010d2433b8", "file": "AppomattoxNewspapers_1949-1952a_0446.pdf", "page": 1, "text": "Among those from here who left Wednesday for a soa hunt in King William County were J. W. Flood, W. M. Abbitt, G. F. Abbitt, Jr. Dr. C. H. Swing, James H. Lucado, G. B. Buchanan and Sam Conner."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "James", "B"], "snippet": "M. Abbitt, G. F. <mark>Abbitt</mark>, Jr. Dr. C. H. Swing, <mark>James</mark> H. Lucado, G. <mark>B</mark>. Buchanan and Sam Conner."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "James", "B"], "snippet": "M. Abbitt, G. F. <mark>Abbitt</mark>, Jr. Dr. C. H. Swing, <mark>James</mark> H. Lucado, G. <mark>B</mark>. Buchanan and Sam Conner."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [852.25, 1416.66, 1026.23, 1718.26], "bbox_id": "79d7f92007", "file": "AppomattoxNewspapers_1947-1949a_0173.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 12th day of December, 1947. James B. Woodson and Andrew C. Woodson, Plaintiffs Against Walter H. Woodson, and the un known heirs at law of said Walter H. Wootlson, Defendants. The object of this suit is to de- clare the said Walter H. Woodson  dead and to have partition of the. tract of real estate that was owned j by Robert Herbert Woodson at his death, containing 176 acres in Ap pomattox County, Va. _ I And it appearing by affidavit filed that Walter H. Woodson has not been heard of since 1933  and whose address is unknown, and any un known heirs at law of said Walter H. Woodson, are hereby required to appear within ten days after the due publication of this order and do what is necessary to protect their inter ests. p0St I C. W. Smith, Clerk. Geo. Abbitt, Jr., p. q. 12-18-4tc"}, "highlight": {"text": {"matched_tokens": ["James", "B"], "snippet": "day of December, 1947. <mark>James</mark> <mark>B</mark>. Woodson and Andrew C."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B"], "snippet": "day of December, 1947. <mark>James</mark> <mark>B</mark>. Woodson and Andrew C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.81, 1308.66, 1562.63, 1611.7], "bbox_id": "d4fd10adf0", "file": "AppomattoxNewspapers_1947-1949a_0169.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the C a euit Court of Appomattox Coun m on the 12th day of December, 1 9  James B. Woodson and Andrew C. Woodson, Plainti Against Walter H. Woodson, and the un-  known heirs at law of said Walter ,-j H. Woodson, Defendan- 4 The object of this suit is to clare the said Walter H. Woods dead and to have partition of t tract of real estate that was own- by Robert Herbert Woodson at U death, containing 176 acres in  pomattox County, Va. And it appearing by affidavit ft that Walter H. Woodson has is been heard of since 1933  and wh address is unknown, and any ij known heirs at law of said Wall H. Woodson, are hereby required appear within ten days after the c publication of this order and do w! is necessary to protect their int ests. Teste C. W. Smith, Clerk. Geo. Abbitt, Jr., p. q. 12-18-4tc"}, "highlight": {"text": {"matched_tokens": ["James", "B"], "snippet": "of December, 1 9  <mark>James</mark> <mark>B</mark>. Woodson and Andrew C."}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B"], "snippet": "of December, 1 9  <mark>James</mark> <mark>B</mark>. Woodson and Andrew C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.48, 1152.61, 1844.28, 1386.76], "bbox_id": "795ffae3fd", "file": "AppomattoxNewspapers_1939-1943a_0163.pdf", "page": 1, "text": "Vera, Sept. 24.- Mr. and Mrs. W. J . Covington and Mr.and Mrs. Robert A. Covington, of Vinton, spent the week-end with Mrs. A. W . Covington, of Vera. Mr. and Mrs. A. B. Abbitt vis ited Mrs. D. N. Robertson Sunday afternoon, Jim Covington is out again after being shut-in for some time. Mr. and Mrs. J. J . Chemault, and children spent Sunday at Chest nut Grove with Mr. and Mrs. R, L. Harris. Mr. and Mrs. R. H. Coleman, Tyler Coleman, Mr. and Mm. L. A . Coleman, Abbitt Coleman, Mr. _, . , . and Mrs. T. H. Robertson, Miss st place in the World to Daj Robertdon, of Lynchburg, the advertising columns jjrs Percy Thompson, Mr.and Mm. Willie Beale, Walker and James Beale, Mm. Maude Abbitt, Evelyn I Chemault and Mr and Mm I"}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt"], "snippet": "Mr. and Mrs. A. <mark>B</mark>. <mark>Abbitt</mark> vis ited Mrs. D."}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt"], "snippet": "Mr. and Mrs. A. <mark>B</mark>. <mark>Abbitt</mark> vis ited Mrs. D."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.26, 1309.82, 1730.71, 1791.47], "bbox_id": "394bc6ebf9", "file": "AppomattoxNewspapers_1926-1933a_0082.pdf", "page": 1, "text": "This highly connected citizen passed away at his home at Vera Tiesday  in the 71st year of his age, after a ling ering illness of four months. He was a son of the late Col- Geo. Abbitt and is survived by his wife and nine children, Geo. R. Abbitt, Mrs. Sussie Covington. Mrs. Betty OBrien, Mrs. Lillie Casey, Robert Abbitt, W.D,,Col- I yer and A. B. Abbitt and Miss I Laura Abbitt. He leaves also I the following brothers and sis- ItersMrs. W. J. Covington, Mrs Mark Bernard, Mrs- A. P. White, A. B., R. W.. C. W. and Geo. F. Abbitt. Rev. S. P. Tucker, deceaseds pastor conducted funeral service at New Hope Church, where he had worshipped for many years when able to attend. The ser vice was consoling to the bereft family and sweet to his friends. The singing.was especially sweet. F. A. OBrien, Mrs. L E. Smith and Mrs. Bessie James sang sev eral se lections. The casket was I tenderly borne to the church I yard by Geo. R., R. O., W. D.t I A. B, Abitt and Clint Casey, sons and grand-son, where last sad rites were performed by young ladies who covered the grave with beautiful flowers. Raliegh Abbitts passing leaves a memory and frisndship among those who knew and loved him that will not soon die."}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt"], "snippet": "I yer and A. <mark>B</mark>. <mark>Abbitt</mark> and Miss I Laura"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt"], "snippet": "I yer and A. <mark>B</mark>. <mark>Abbitt</mark> and Miss I Laura"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.64, 637.48, 1669.86, 1163.26], "bbox_id": "2261c33cc2", "file": "TimesVirginian_1976_0428.pdf", "page": 1, "text": "The object of this suit is to quiet title to those certain tracts or parcels of real estate, lying and being in Southside District of Appomattox County, Virginia, containing 29 acres and 30 acres, now.owned by your complainants. And it appearing by affidavit filed that there are or may be persons interested in the subject m atter of this suit -whose names and addresses are unknown, and making them parties defendant by the general description of parties unknown, ..such unknown par ties being the unknown heirs at law of Claiborne Harvey, deceased, the unknown heirs at law of Susan Harvey, deceased, the unknown heirs at law of James B. Harvey, deceased, and all other unknown parties who may have an interest in two tracts of land consisting of 29 acres and 30 acres in Southside District of Appomat tox County, V irginia and I formerly standing on the Land Books of Appomattox County, Virginia, in Southside District in th? name oi Wm. A- Hrve aridliowStandlng onsaid Lan Books in the name of Dorothy Harvey, Mary Harvey, Ernest Harvey and Helen Harvey Crewford, and they are hereby ordered to appear within ten days after the due publication of this order and do what is necessary to protect their interests. Teste BARBARA R. WILLIAMS t , Clerk W.M. Abbitt, p.q. Attorney at Law Appomattox, Virginia ll-ll-4 t"}, "highlight": {"text": {"matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.7, 894.42, 1671.94, 1400.74], "bbox_id": "c9d56a03d3", "file": "TimesVirginian_1976_0435.pdf", "page": 1, "text": "The object of this suit is to quiet title to those certain tracts or parcels of real estate, lying and being in Southside District of Appomattox County, Virginia, containing 29 acres and 30 acres, now owned by your complainants. And it appearing by affidavit fited that theye at oi may. be persons interested in the subject matter of this suit whose names and addresses are unkiiown, and making them parties defendant by the general description of  parties unknown, such unknown par ties being the unknown heir at law of Claiborne Harvey, deceased, the unknown hep-s at law of Susan Harvey, deceased, the unknown heirs at law of James B. Harvey, deceased, and all other unknown parties who may have an interest in two tracts of land consisting of 29 acres and 30 acres in Southside District of Appomat tox County, Virginia and formerly standing on the Land Books of Appomattox County, Virginia, in Southside District in the name of Wm. A. Harvey and now standing on said Lana Books in the name of Dorothy Harvey, Mary Harvey, Ernest Harvey and Helen Harvey Crawford, and they are hereby ordered to appear within ten days after the due publicaiton of this order and do what is necessary to protect their interests. T6St6! BARBARA R. WILLIAMS Clerk W. M. Abbitt, p.q. Attorney at Law Appomattox, Virginia ll-ll-4t"}, "highlight": {"text": {"matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1673.28, 605.69, 1816.18, 1130.51], "bbox_id": "0e5cc5d3c9", "file": "TimesVirginian_1976_0419.pdf", "page": 1, "text": "The object of this suit is to quiet title to those certain tracts or parcels of real estate, lying and being in Southside District of Appomattox County, Virginia, containing 29 acres and 30 acres, now owned by your complainants. And it appearing by affidavit filed that there are or may be persons interested in the subject matter of this suit whose names and addresses are unknown, and making them parties defendant by the general description of parties unknown, such unknown par ties being the unknown heirs at law of Claiborne Harvey, deceased, the unknown heirs at b rv of Susan Harvey, deceased, n s unknown heirs at law of James B. Harvey, deceased, and all other unknown parties who may have an interest in two tracts of land consisting of 29 acres and 30 acres in Southside District of Appomat tox County, Virginia and formerly standing on the Land Books of Appomattox County, Virginia, in Southside District in the name of Wm. A. Harvey and now standing on said Land Books in the name of Dorothy Harvey, Mary Harvey, Ernest Harvey and Helen Harvey Crawford, and they are hereby ordered to appear within ten days after the due publicaiton of this order and do what is necessary to protect their interests. Teste BARBARA R. WILLIAMS Clerk W. M. Abbitt, p.q. Attorney at Law Appomattox, Virginia ll-ll-4t"}, "highlight": {"text": {"matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}}, "highlights": [{"field": "text", "matched_tokens": ["James", "B"], "snippet": "heirs at law of <mark>James</mark> <mark>B</mark>. Harvey, deceased, and all"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1856.88, 680.04, 2181.66, 869.04], "bbox_id": "e0ab557101", "file": "AppomattoxNewspapers_1933-1936a_0159.pdf", "page": 1, "text": "The meeting was conducted by the president, Miss M. Anna Jones. Mrs. Luther Morris gave a paper on the Lee family, Mrs. Charles James told something of the boyhood of Jefferson Davis, Miss Elaine Me-1 church Sunday night Dearmon read the Constitution of the United States and the Const itution of the Confederacy, showing i  - their similiarities. Mrs. L. Crawley  . roIe?sor , ?ayne, Jr. spent ave a poen from tih writings of lnf p6 iei1 Lanier and Miss Mary Louise Gills 4  i pIln- read an essay, To advance the name . Miss Lou Covington visited her of Sidney Lanier, Poet, Musician, I father E- Covington Saturday and Soldier of the Confederacy for ard Sunday. the Hall of Fame. I Mrs. Lucy Conner is out again Among the guests present were I aiter being sick witih flu. Airs. Mattie Holley and1 Miss Har- Mrs. A. B. Abbitt Miisses Frn rq6T iiDnA Ttlg Wlsconsin and Miiss- ces Abbitt and Hazel Eppard of cs Lucile Lawrence and Maude Bur-1 Newport News spent the week end  . , at their country home here."}, "highlight": {"text": {"matched_tokens": ["B", "Abbitt"], "snippet": "Miss Har- Mrs. A. <mark>B</mark>. <mark>Abbitt</mark> Miisses Frn rq6T iiDnA"}}, "highlights": [{"field": "text", "matched_tokens": ["B", "Abbitt"], "snippet": "Miss Har- Mrs. A. <mark>B</mark>. <mark>Abbitt</mark> Miisses Frn rq6T iiDnA"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
