{"document": {"bbox": [1784.89, 355.86, 1954.25, 985.76], "bbox_id": "0e8f7e66a9", "file": "AppomattoxNewspapers_1915-1918a_0158.pdf", "page": 1, "text": "you saw them, Castner? They were In front of Pegleg Johns in the .nest block- Miss Mas singale was waiting for Smith, who was just coming out of Peglegs den shaking his head. 1 put two. nnfl two together and guessed they were look ing for Stephen. If the? went there Miss Amy had her reasons., Lets try it, said Brouil lard, and he was half-way across street when Castner overtook him. There was a dance hall next door to Pegleg Johns barrel house and gam bling rooms, and, though the daylight was still strong enough to make tt electrics garishly unnecessary, the orgy was In full swing, the raucous clanging of a piano, and the shuffle and stamp of many feet drowning the monotonous cries of the sidewalk barker, who was inviting all and sundry to enter and join the dancers. Castner would have stopped to ques tion the barkerwas, in fact, trying to make himself heardwhen the sharp crash of a pistol shot dominated the clamor of the piano and the stamp ing feet. Brouillard made a quick dash for the open door of the neighboring barrel house, and Castner was so good a second that they burst in as one man. The dingy interior of Pegleg Johns, which was merely a barrel-lined vesti bule leading to the gambling rooms beyond, staged a tragedy. A handsome young giant, out of whose face sudden agony had driven the brooding pas sion of intoxication, lay, loose-flung, on the sawdust-covered floor, with Amy Massingale kneeling In stricken, tearless misery beside him. Almost within arms reach Van Bruce Cort wright, the slayer, was wrestling stub bornly with Tig Smith and the fat armed barkeeper, who were trying to disarm him, his heavy face a mask of irresponsible rage and his lips bub bling imprecations. Turn me loose. he gritted. Ill fix him so he wont give the governors snap away! Hell pipe the story of the Coronida grant off to the-papers? not if I kill him till hes too dead to bury, I guess. Castner ignored the wrestling three and dropped quickly on his knees be side Stephen Massingale, bracing the misery-stricken girl with the needed word of hope and directing her in low tones how to help him search for the wound. But Brouillard hurleid himself with an oath upon young Cortwright, and it was be, and neither the cattleman nor the fat-armed barkeeper, who wrenched the weapon out of Cortwriglits grasp and with it menaced the babbling mur derer into silence."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "In front of Pegleg <mark>Johns</mark> in the .nest block-"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "In front of Pegleg <mark>Johns</mark> in the .nest block-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1087.7, 683.27, 1247.77, 976.17], "bbox_id": "20b8084593", "file": "AppomattoxNewspapers_1902-1905a_0137.pdf", "page": 1, "text": "Yosemite Valley, Cala. Special.- Mrs. A. E. Johns, o f New York city, who has been staying in the valley fot a few days, was found Tuesday morning in a steep crevasse back of the Sentinel Dome. Monday Mrs. Johns started from Glacier Point Hotel to walk to the fissures, located some two miles from the hotel, and did not return at night. Early Tuesday morning searching parties started out, and one. of them made a discovery that filled the specta tors with horror. Far down the Sen tinel fissure, whose crevasses drop in some places for thousands of feet, sus pended on a ledge that jutted out from the steep side, the almost lifeless form of Mrs. Johns was found by Mr. Pat ter, a hotel clerk. She was too weak to speak, but was able by feeble signs to make Mr. Potter know that she still lived. After trying in vain to work his way down the mountain side to her. Mr. Potter was forced to go to the hotel for help. Provided with plenty of ropes and carrying a stretcher, a party of eight made its way back to the crevasse, Where the work was commenced of try ing to extricate Mrs. Johns from her dangerous situation. Mrs. Johns is suffering much from nervous shock, but as no bones were fractured she will recover."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Special.- Mrs. A. E. <mark>Johns</mark>, o f New York"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Special.- Mrs. A. E. <mark>Johns</mark>, o f New York"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.1, 207.84, 1863.46, 615.98], "bbox_id": "fd27b9d0f5", "file": "AppomattoxNewspapers_1912-1915a_0505.pdf", "page": 1, "text": "Yon are going to pursue this Jack- o-lantern? I am determined to. It you deny me aid and advice I shall eeek another counselor. Johns name must be vin dicated. He gave her a look, turned and glanced down at the child piling stone on stone and whimpering just a little when they tell. Watch that baby for a while, he remarked, and yon will learn the les son of most human endeavor. Madam, I have a proposition to make you. You cannot wish to remain at the Inn, nor can you be long happy separated from your daughter. I have lost Bela. do not know how, nor would I be willing, to replace him by another servant. I need a housekeeper some_ one devoted to my interests and who will not ask me to change my habits too materially. Will you accept the position, if I add as an inducement my desire to have Reuther also as an inmate .of my home? This doeB not mean that I countenance or In any way anticipate her union with my son. do not but any other advantages she may desire she shall have. I will not be strict with her. Deborah Scoville was never more taken aback in her life. The recluse opening his doors to two women! The man of mystery flinging aside the reti cences of years to harbor an inno cence which he refueed to let weigh against the claims of a son he had seen fit to banish from his heart and home! You may take time to think of it, he continued, as he watched the con fused emotions change from moment to moment  the character of her mo"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "shall eeek another counselor. <mark>Johns</mark> name must be vin"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "shall eeek another counselor. <mark>Johns</mark> name must be vin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1226.56, 1728.97, 1378.57, 1858.97], "bbox_id": "6969cde977", "file": "AppomattoxNewspapers_1918-1922a_0386.pdf", "page": 1, "text": "Would Build Memorial. Patriotic societies in Virginia have inaugurated a movement to build suitable monument to the memory of George Wythe, great lawyer and first professor of law In the United States, whose grave in old St. Johns church yard is unmarked and almost forgotc ten. Among his pupils may be men tioned Jefferson, Monroe, Marshall, Edmund Randolph and Bishop Madi son. The monument would mark his grave."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "grave in old St. <mark>Johns</mark> church yard is unmarked"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "grave in old St. <mark>Johns</mark> church yard is unmarked"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1169.5, 1765.67, 1324.09, 1896.78], "bbox_id": "23ed25a081", "file": "AppomattoxNewspapers_1918-1922a_0583.pdf", "page": 1, "text": "Would Build Memorial. Patriotic societies in Virginia have inaugurated a movement to build a suitable monument to the memory ot George Wythe, great lawyer and first professor of law in the United States, whose grave In old St. Johns church yard is unmarked and almost forgot ten. Among his pupils may be men tioned Jefferson, Monroe, Marshall, Edmund Randolph and Bishop Madi son. The monument would mark his grave."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "grave In old St. <mark>Johns</mark> church yard is unmarked"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "grave In old St. <mark>Johns</mark> church yard is unmarked"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1043.02, 1722.52, 1349.11, 1852.25], "bbox_id": "c6e33fee83", "file": "AppomattoxNewspapers_1918-1922a_0387.pdf", "page": 1, "text": "Would Build Memorial Patriotic societies in Virginia have Inaugurated a movement to build a suitable monument to the memory ol George Wythe, great lawyer and first professor of law in the United States, whose grave in old St. Johns church yard is nnmarked and almost forgot ten. Among his pupils may be men tioned Jefferson, Monroe. Marshall, Edmund Randolph and Bishop Madi the intention of enlarging his market gon. The monument would mark his oaanectlons in those section.  grave."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "grave in old St. <mark>Johns</mark> church yard is nnmarked"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "grave in old St. <mark>Johns</mark> church yard is nnmarked"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [637.9, 1084.37, 967.88, 1539.32], "bbox_id": "7d14e80003", "file": "AppomattoxNewspapers_1905-1912a_0109.pdf", "page": 1, "text": "word of reproof and warning for John, Blessed is he whosoever shall find none occasion of stumbling In Me. This was a reference to Old I Testament prediction concerning the I Messiah Is. 814, 15. I II. Jesus Testimony to John the i Baptist, 7-11. Jesus had sent to John j a word of cheer and a word of re- ! proof, but, when the messengers were i out of hearing, Jesus gave .the multi tudes a glowing testimony to Johns worth and greatness. As he had been Otherranch ! Bhaken for a moment In his faith, it m  h. J  . to .hoot  T h S or poison the dogs. The domesticated  was not. Neither was he a man seek- wisdom of the dogs and the ferocitj  ing his own glory and comfort, gor- of the big wolf made a hard com hi- geously apparalled and living deli- nation for the ranchmon to over- i lately cf. Luke 725. He was a come. prophet, that Is, a man directly com- Yosterday Foreman Goyen located ! t0 and heSnUtlVe  i a thf,P1.aire I t0 men cf. Luke 176 and 26.  u t and being mounted Oi. a swift horse, j he was more than that, he was him- gave chaso, and after a hard ride of i self the subject of Old Testament pro- about ton miles ho succeeded in run phecy, one of whom the great pro- ning them down and roping the wolf. j Phete of .olden times had spoken He could have shot the wolf, but !  al- 81! 5 6 Is. 403 cf. Luke knowing that the dogs would follow ! 6   3 He was her he decided to lead her to tho cnosen from the whole human race to  v u leaa nr t0 be be God s own messenger to go before laf ch Jhere a11 tkr8 could be kllled.  the face of God Incarnate to prepare With the rope well fastened about the i the way before Him. John the Bap- wolfs body he pulled her Into the 1 fist filled one of .the lofteist offices ranch and the dogs followed. All ! ever filled by man. Amongst purely three wore then shot. human beings, there is none greater  Wolves have been killing stock ini  John the Baptist. And yet the Horse Creek Valley, but tho dog I geatr tL n Johnhe EaptUt.Thft trio was the worst of any bunch, and ranchmen rejoice over their exterm ination. This same trio have even threatened people when unarmed, and are said to havo followed Mrs. Nimmo for several miles a few weeks ago when she was coming into Chey enne. A similar instance of where a woll has joined wild dogs in attacks od stock occurred in the same district a few years ago, the wolf finally be ing caught by a trapper at Adam sons ranch."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "a glowing testimony to <mark>Johns</mark> worth and greatness. As"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "a glowing testimony to <mark>Johns</mark> worth and greatness. As"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [136.1, 298.26, 296.87, 1775.33], "bbox_id": "a0855d1820", "file": "AppomattoxNewspapers_1912-1915a_0010.pdf", "page": 1, "text": "Wonderful summer this one hurrying to a close. No wetting lain since May and yet never before tueh crops of vegetables and fruits, while well worked corn even on highland are promising good re turns. The rainbow spanned the ky the other day and a working, waiting, trusting farmer saw written upon it in letters of living light,  seed time and harvest and simply sang as he went to his daily tasks. Fine philosophy thatbetter still, fine religion. Onr streets are so smooth that anto drivers cant resist the temp tation to break the speed limit for which they aro mude to pay heavily. But some folk will have fun at any nd every  ost. Mr. Paul Venable, the venerable Confederate of whom 1 have made mention ia your paper, is just now bu y shipping choice cantalopes to t ie city markets upon whioh he makes handsome returns. You may recall that two seasons ago he sold the lettuce fiorn one acre for 1,000. And yet ome young and strong meu complain that its hard work to make even a living on broad acres. It may be that they are too broad, and if the acreage was con densed and more thought given to the working, a refreshing change might follow. Mr. J. J. Gilliam, who was so seriously wounded by a mad bull, ii improving. This in o nuection with the accident is worth repeating. O i the morning of the day when tne injury was received, an orphan b y began to work on his farm, was with him at the time, and and was told to run for his life. Instead of this, however, he seized the fork whioh Mr. Gilliam had for his own protection, drove it deep into the animals nose and so disarming him for further fighting. Of auoh stuff are the worlds herooi made. Rev. W. E. Hill did spend one Sunday in Farmville and preached twice at the Presbyterian church to the delight of the large congrega tions that were privileged to hear k.n. Mr. B. M. Cox, Dr. Hamlet and oiuors are c mping on the banks of the mill pond again and indulging that bolds chief charm for them. izidC Walton never had more de voted or more loyal disciples. W hether the fish bite or not still the fun never wates. Hope deferred d can, make their hearts sick, for they are expecting a catch to follow the next bite. The motor ear of Mr. R. B. Johns ha? been much in demand of late. When a fity mile spin is desired he rattles off the distance as though it was but a few m.les in the country. A Wilson Club is being organized bat as everybody is for Wilson in this section it hardly seems neces sary. The principal object, how ever, will be to raiai a campaign fund. Peoples money for the peo ples man will make a peoples Presi dent. The sweet cider train has arrived well laden with the pi ince of sum mer drinks. Three days old, and made of ripe apples and no French wine beats it. I confess, however, that I would prefer having it direct from the old time trongh rather than the modern day cider mill. A hail storm just now such as they had in Culpeper recently would play havoc in this section. And so far as Im advised insurance against hail is not oommon this season. Mr. and Mrs. W. P. Richardson are spending the week at the home of Mr. Joe Hazlegrove, Cumberland, preserving, piekling and canning lor winter rse. Mr. Hazlegrove has an abundant fruit crop and divid-.s liberally with his neighbors and friends. Some men do believe that it is more blessed to give than re ceive. Rev. W. L. Wayts has returned from Spring Creek Church where he conducted a successful meeting. Rev. Proctor is greatly improved by hiB stay in the mountains. Mrs. Dr. Gils and the boy hav returned from Virginia Beaoh. Mrs. Dr. Irving and Miss Mary Jackson drove to the country home of Dr. Chas. Blanton, of Richmond, in Cumberland, and spent the day. Perhaps a thirty mile drive, out they held the reins over a peerless roads ter. Mr. S. H. Davis, wife and daugh ter, of MoAlpine, W. Va., are visit ing in the home of Mr. Baxter Davis. Mr. Eugene Gill, one of the most mcoeraful of traveling men, has been fortunate to spend much of his time a t home during the summer, b  When be receives tl,000 orders Uuwogh the mail there isnt much"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "of Mr. R. B. <mark>Johns</mark> ha? been much in"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "of Mr. R. B. <mark>Johns</mark> ha? been much in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [565.43, 1709.56, 724.95, 1830.34], "bbox_id": "34f7cec826", "file": "AppomattoxNewspapers_1898-1902a_0043.pdf", "page": 1, "text": "wm never able to actively participate iu their meetings, she elweye manifested the deepest Interest in everything that pertained to the orgaulMtion. Besides her husband, Mrs. Johns is sur vived by five children, Mr. W. D. Johns, oi Lynehburg Mrs. William H. Trent, of Jloanoke Mrs. Edmund W. Moseley, of Bedford, and Misses Hettie and Deane Johns, of Appomattox. She was a sister of Mr. Robert L. Dudley, Mrs. William H. Kiuckle, and Mrs. Rose Calhoun, of this citr. -Lynch burg News."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Besides her husband, Mrs. <mark>Johns</mark> is sur vived by"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Besides her husband, Mrs. <mark>Johns</mark> is sur vived by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1753.86, 444.47, 1922.59, 1021.77], "bbox_id": "9ae9ee1bcf", "file": "AppomattoxNewspapers_1892-1898a_0033.pdf", "page": 1, "text": "witness said Beatty suggested croton oil, and I said no, that waa dangerous, and Dempsey said he knew a powder which would be better. Dempsey said he had used these powders to Chicago and he had broken a strike to four days. It is not dangerous. Dempsey said be would guarantee us fifty dollars each and our expens. Wegot no powders that day. We then left tbe hall together and talked about it. Beatty said we were to get fifty dollars each, and we were to get a gold watch and chain if we went. David son sid that of tbe fifty dollars promised him he got bat fourteen dollars. Attorney Brennen subjected the .witness to a severe cross eassitStioa, hut did not materially weaken Us evidence. Davidron, however, admitted that he was arrested late in November and taken into the St.- Nicholas building and waa sworn, and told the story he had just told. Then he was released. Gallagher was arrested before that. He said they had it down to black and white, and he had to tell all he knew. Mr. BrennenAre you to get a diamond watch for this? Oh, yes I guess so like the one I got from Dempsey. Captain BeckYqu were promised noth ing for coming here, were you? No, sir. J. H. Ford, a detective, swore I know Beatty, Gallagher and Davidson. On Dec. 1 1 heard a conversation between Beatty, Gallagher and Davidson, to which Beatty told abont the powders and .what they con tained. Gallagher said he believed if Dempsey was home the strike would be won, but Beatty said he thought not. I heard Gallager say Tom Brady first sug gested croton oil. On Dec. 4 1 overheard a talk between Gallagher and Beatty, which was about the same as the former one. Beatty said Turkish rhubarb end snuff was in tha powders and it was not necessary to tell the rest. Gallagher said he could take the powders and go west add break np some strike there, and told Beatty to go to Homestead next day and get the receipt if he had to pay five dollars, as there was money to it for both of them.  Louis Welters, steward of the restaurant to tbe Homestead mill, testified that he noticed unaccountable sickness soon after employing Gallagher as a cook. He said that to spite of the best of food he and his wife become very ill, and bad never fully recovered. He had several times seen  Beatty talking to Gallagher to tbe mill. Beatty was held in 5,000 bail for trial at court. - _____ _ A Flood Test Sait. P ittsburg , Dec. 19.Suit has been en tered to the United States circuit court agtenstthe South Fork Fishing club by Jffiies Jenktos and wife, of Youngstown, O in the right of Mrs. Jenkins for 20,000 damages for injuries received to the Johns town flood. This is the first suit ever en tered directly against the South Fork club for its connection with the flood, and is re garded as a test suit."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "injuries received to the <mark>Johns</mark> town flood. This is"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "injuries received to the <mark>Johns</mark> town flood. This is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [970.57, 328.56, 1105.19, 504.03], "bbox_id": "337f4cc1b1", "file": "AppomattoxNewspapers_1918-1922a_0201.pdf", "page": 1, "text": "WIRELESS PHONE REACHES ACROSS 2,000 MILES OF ATLANTIC. St. Johns, N. P.  Experts from the Marconi Wireless Company, who are here conduct ing experiments in long-distance wireless telephonic communica tion, announced they heard mes sages from the Chelmsford Sta tion, near London, more than 2,000 miles distan They said that they- recog nized the voice of Captain Round, the expert in charge, and identified several words, but failed to pick up any connected sentence."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "MILES OF ATLANTIC. St. <mark>Johns</mark>, N. P.  Experts from"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "MILES OF ATLANTIC. St. <mark>Johns</mark>, N. P.  Experts from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [881.99, 347.12, 1015.17, 521.14], "bbox_id": "2cc18a53d2", "file": "AppomattoxNewspapers_1918-1922a_0325.pdf", "page": 1, "text": "WIRELESS PHONE REACHES ACROSS 2,000 MILES OF ATLANTIC. St. Johns, N. F.  Experts from the Marconi Wireless Company, who are here conduct ing experiments in long-distance wireless telephonic communica tion, announced they heard mes sages from the Chelmsford Sta tion, near London, more than 2,000 miles distant. They said that they recog nized the voice of Captain Round, the expert in charge, and identified several words, hut failed to pick up any connected sentence."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "MILES OF ATLANTIC. St. <mark>Johns</mark>, N. F.  Experts from"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "MILES OF ATLANTIC. St. <mark>Johns</mark>, N. F.  Experts from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1517.3, 1652.29, 1820.89, 1691.39], "bbox_id": "be4927aaaa", "file": "AppomattoxNewspapers_1943-1947a_0193.pdf", "page": 1, "text": "Windows and Doors Screen Windows and Doors Johns - Manville Asbestos Shingles Both siding and roof"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Windows and Doors Screen Windows and Doors <mark>Johns</mark> - Manville Asbestos Shingles Both siding and roof"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Windows and Doors Screen Windows and Doors <mark>Johns</mark> - Manville Asbestos Shingles Both siding and roof"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [343.43, 1089.65, 508.88, 1301.25], "bbox_id": "677906371d", "file": "AppomattoxNewspapers_1922-1923a_0497.pdf", "page": 1, "text": "Winchester.Henry H. Coffman and Miss Blanche E. Gruver were married at the brides home, at Stephen City, this county. Rev. E. A. Stanton, of the United Brethren Church, officiating. Richmond.  Miss Emily Savage Crump and Frank Irving Starke, both of this city, were married at St. Johns Episcopal Church by the rector, the Rev. Robert A. Goodwin. Fredericksburg.  W i l l i a m T. Bland, of this city, and Miss Clara B. Thacker, of Spottsylvania County, were married at the residence, at Spottsylvania Court House, of Rev. J. H. P. Crismoud, who performed the ceremony. Roanoke.Hugh Haley, of Roa noke. and Miss Annie Griffin, daugh ter of Detective Sergeant A. H. Grif fin, of the police department, were married at St. Andrews Catholic Church, Rev. Father J. W. Lynch officiating."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "were married at St. <mark>Johns</mark> Episcopal Church by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "were married at St. <mark>Johns</mark> Episcopal Church by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [360.92, 1097.03, 524.47, 1309.12], "bbox_id": "5eea56e3c7", "file": "AppomattoxNewspapers_1922-1923a_0501.pdf", "page": 1, "text": "Winchester.Henry H. Coffman and Miss Blanche E. Gruver were married at the brides home, at Stephen City, this county. Rev. E. A. Stanton, of the United Brethren Church, officiating. Richmond.  Miss Emily Savage Crump and Frank Irving Starke, both of this city, were married at St. Johns Episcopal Church by the rector, the Rev, Robert A. Goodwin. Fredericksburg.  W i l l i a m T. Bland, of this city, and Miss Clara B. Thacker, of Spottsylvania County, were married at the residence, at Spottsylvania Court House, of Rev. J. H. P. Crismond, who performed the ceremony. Roanoke.Hugh Haley, of Roa noke. and Miss Annie Griffin, daugh ter of Detective Sergeant A. H. Grif fin, of the police department, were married at St. Andrews Catholic Church, Rev. Father J. W. Lynch officiating."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "were married at St. <mark>Johns</mark> Episcopal Church by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "were married at St. <mark>Johns</mark> Episcopal Church by the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1202.07, 901.97, 1358.89, 1884.16], "bbox_id": "fe56ca6ea1", "file": "AppomattoxNewspapers_1918-1922a_0310.pdf", "page": 1, "text": "Winchester.A good start hae been made in organizing a full company of infantry by George H. Grimm, who was designated as organizer by Ad jutant-General Stern. About thirty men have been signed for enlistment since the initial meeting, at whleh a number of World War veterans made speeches. Lynchburg.Union labor has com pleted arrangements here for the open ing of a retail store for union families. The store will be operated by union memberships at 1 a month, and a penny, profit will be put upon every purchase. A. E. Jones, of Appomat tox, will manage the store, which is to be located near several of the larger industrial plants of the city. Danville.Walter Reynolds, jointly Indicted with Reely Roberts for the murder of Albert Linnls, near here last March, was acquitted in the Corpora tion Court Counsel for Roberts had asked that his trial he continued ow ing to the absence of a material wit ness by reason of illness, but the court would not consent to this and the case will be called at the disposition of the court. Winchester.  Samuel Weaver, of Knox county, In-d., has been visiting relatives and War Between the States battlefields in this section for the first time since he was run out of Win chester along with General Banks entire army by Stonewall Jackson. On the retreat Mr. Weaver was cap tured, he says, by a gentlemanly Con federate boy, who scorned to take watch and money. Lynchburg.There is a general de mand in Lynchburg for the taking of a census by public-spirited enumerators to show that the census, which gives the city only 29,000, is erroneous to the extent of from 3,000 ito 5,000. Sug gestion has been made that work be done by members of the Rotary and Klwanis Clubs, and it is not improb able that a move will be made for this. Mayor Jester has offered his services to work several days, if necessary, on local recount. Heathville.Despite information re ceived recently to the contrary, the menhaden industry on the Northern Neck will not be discontinued. The first catch of the season has been an nounced by tbe Eubank Tankard fac tory to have amounted to a total of over 1,000,000 menhaden. The catch of the Bellows and Squire Factory was announced to have exceeded 1,250,000. Officials of the factories consider this an auspicious start tor the industry, and although these are the only fac tories operating -thus far, ft is a fore gone conclusion that tbe remainder of the factories on the Northern Neck will begin operations within a few days. -Salem.The trustees of Roanoke College announced the creation ot a new chair in chemistry, to which Dr. Harry I. Johnson, of the A.  8. Col lege, Raleigh, N. C., has been called. Dr. Johnson is a native of Hagers town, Md an alumnus of Roanoke College and a Ph. D. graduate of Johns Hopkins, where he was a fellow in chemistry. Lynchburg.Lynchburg banks have clamped down on loans for automo biles and this, dealers report, has checked somewhat the demand for cars in Lynchburg. Danville.  Reports received here from Martinsville tell of a skirmish which United States revenue agents had with blockade runners in tbe San- ville District, in which Jerry Metz, of Roanoke, was twice wounded in the arm. The officers had information that an automobile with liquor would pass a certain read, and they waited for it. The men on the car at once opened fire on the revenue officers and the officers returned the fire, after which the blockaders reversed their car and ran back eae dtstanee where they un- te ltd ftlty RailMI of"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Ph. D. graduate of <mark>Johns</mark> Hopkins, where he was"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Ph. D. graduate of <mark>Johns</mark> Hopkins, where he was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [320.9, 211.99, 644.4, 494.75], "bbox_id": "af73ddbf78", "file": "AppomattoxNewspapers_1912-1915a_0059.pdf", "page": 1, "text": "Winchester Minister Has Support Of Governor Mann. Winchester  There is a strong probability of the United States Sen ate having Rev. John Poisal Hyde, D. D of Winchester, as its chaplain after President-elect Wilson is Inaug urated next March. The matter was suggested to Dr. Hyde recently, and a day or two ago he allowed his name to be used in connection with the chaplaincy. Dr. Hyde, who is a native of Annapolis, Md., and a mem ber of the class of 1851 of St. Johns Colllege, of that city, was for many j years president of the Valley Female College In Winchester. He is now a I retired member of the Baltimore Con- j ference Methodist Episcopal Church South chaplain-general of the Grand Camp of United Confeder- ate Veterans of Virginia, and also chaplain of the various Masonic so-  cieties of Winchester. Dr. Hydes per80ns are reported to have perished candidacy has been indorsed in let- m V 1? 1003 which swept across the ters received from Governor Mann, LbUpplne8 t0 the south of Manila Senators Martin and Swanson, Speak-  Tf8ay according to belated advices er Richard Evelyn Byrd, of the Vir- , lcb reached the War Department ginia House of Delegates, who man- 5, Gfvernor General Forbes, of the aged the Wilson campaign In Virginia ppnes- before and after the Baltimore con- I __Te,e8raphic communication from"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "of 1851 of St. <mark>Johns</mark> Colllege, of that city,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "of 1851 of St. <mark>Johns</mark> Colllege, of that city,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1607.3, 171.88, 1785.01, 1762.51], "bbox_id": "d22cf72239", "file": "AppomattoxNewspapers_1905-1912a_0115.pdf", "page": 1, "text": "win ner regard Shd whb kfihws wffiat! may happen? f 4 f i if j V1. . And he laughed merrily, a laugh thai was broken by a sudden crash on the table. Norma had dropped a plate. Why, my dear! cried Normas father. Perhaps in the momeutafy confusion that followed the mishap this term of endearment was missed by the guest. Anyway he carefully refrained from glancing toward the scene of disaster, but kept up a lively dialogue with the hostess until Norma had passed from the room. But the new waitress didnt lack courage. She was back presently with the dessert, her pretty head held high and her air of indifference more pro nounced than before. When she had brought in the after- dinner coffee and passed out, the host ess turned to the guest with a little sigh of relief. As an old friend of the family, she said, I will confess that this dinner has worried me a little. How could it? te guest demand ed. fit was excellent and so nicely served. Yet it .did, persisted the hostess. Our maid-I mean the cookhas a spell of homesickness. She longs for a sight of a Danish face and the sound of the Danish tongueand when she has these attacks it Is almost impos sible to hope for any help fro her. Per haps you noticed my uneasiness? No, madam, replied Richard Cort land. There would appear to have been no cause for It. They arose and paased into the li brary and Richards spirits appeared to rise with eaoh passing moment I hope, he said, that you are both fully prepared to accept me as a friend  privileged character? Of course we are, responded the hostess. Of course, echoed John Lamed. And I am to consider myself en tirely at home? Yes, yes. He looked at the hostess quizzically. What is the name of the homesick cook? he suddenly asked. Olga. He arose. I am going to test the depth of your friendship, he laughingly said. I am going out to your kitchen to see 12 I cant cure your suffering domestic. We will soon know If my year in the University of Copenhagen was wasted. Dont move, please. Before the startled hostess could utter a word the guest was on hi way to the kitchen. John Lamed stared at his wife. Think of Normal she gasped. Yes, said Johns wife, quite un moved. Hes a splendid fellow. Then she suddenly sat up very straight. Hark! she whispered. They could hear a murmur of voices from the kitchen. Then one voice arose loud and clear. It seemed to be declaiming. Suddenly someone laugh ed and laughted again. - Thats Olga, whispered Mrs. Johij. First dose Mghly effective, mur mured John Larned. Then the clear .voice ran Into a quaint old songa college song, they thought. The words were in an unknown tongue, but there was t merry lilt to the tune and quite with out warning a second voice broke in and the two voices blended very fair- ly. Thats Olga again,. said Johns wife. Second dose equally effective, said John. The two voices sang the song through together. Then they stopped with a merry laugh. The masculine voice went on with the declamation. He must be talking Danish, said Johns wife. No doubt of it, my dear. Ive seen it stated -somewhere that Richard Cort land had mastered nine languages. The guest seemed to be telling story. From time to time tne delight ed cook loudly chuckled and at the cli max she roared with delight Theres no questioning that treat ment, murmured John. I wonder where Norma is? whis pered Normas mother. I wonder, repeated Nonnas fath er. Normas mother put her finger to her lips and stood up. Come, she skid. John Larned arose and followed his wife. Their way led them through the din ing room and into the china closet. They mtfved with great care and cau tion.- When they were in the dark closet they could look through the glass In the door into the kitchen. The culinary department looked, as usual, quite as clean as wax. Leaning back against the kitchen table stood Richard Cortland. He was talking rapidty in a foreign tongue and gesti culating freely. In front of Mm sat the light-haired Danish girl, the homesick Olga. She was looking at him eagerly, a bright smile on her face os she drank in his words. Mrs. John clutched her husbands arm and pointed across the room. Norma was sitting against the wall looking with a calm disdain at the cook and the stranger. She sat bolt upright, -her dainty little cap still on her head. John Larned suddenly put his hand over Ms mouth, and his wife gently shook Mm. And now Richard was finishing his story. He stepped forward and made Olga a very low bow. And Olga ris ing and spreading her skirts courtesled almost to the floor. Then the girls merry laughter rang out again. But she checked it and pointed to Norma. Whereupon the .guest bowed low to the smart young waitress. But Norma, with nose in the air, re ceived this salutation haughtily and Inclined her head very slightly. Again John Larned covered his mouth with his hand and his wife, fearing further consequences, drew him away and they retraced their steps to the library. - Scarcely were they seated when Richard entered the room. And Norma demurely followed. Richard was laughing, but Normas face ware a look that was meant tor offended dignity."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "she gasped. Yes, said <mark>Johns</mark> wife, quite un moved."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "she gasped. Yes, said <mark>Johns</mark> wife, quite un moved."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1608.25, 171.4, 1785.45, 1762.04], "bbox_id": "d929d09273", "file": "AppomattoxNewspapers_1905-1912a_0116.pdf", "page": 1, "text": "win her regard aind whb kff6ws wliat may happen?    And he faughed merrily, a laugh that was broken by a sudden crash on the table. Norma had dropped a plate. Why, my dear! cried Normas father. Perhaps in tbs momentary oonfusiqp, that followed the mishap this term of endearment was missed by the guest Anyway he carefully refrained from glancing toward the scene of disaster, but kept up a lively dialogue with the hostess until Norma had passed from the room. But the new waitress didnt lack courage. She was back presently with the dessert, her pretty head held high and her air of indifference more pro nounced than before. When she had brought in the after- dinner coffee and passed out, the host ess turned to the guest with a little Bigh of relief. As an old friend of the family, she said, I will confess that this dinner has worried me a little. How could it? te guest demand ed. Tt was excellent and so nicely served. Yet it .did, persisted tho hostess. Our maid-I mean the cookhas a spell of homesickness. She longs for a sight of a Danish face and the eound of the Danish tongueand when she has these attacks It 1 b almost Impos sible to hope for any help fro her. Per haps you noticed my uneasiness? No, madam, replied Richard Cort land. There would appear to have been no cause for It. They arose and passed Into the li brary and Richards spirits appeared to rise with each passing moment 1 hope, he said, that you are both fully prepared to accept me as a friend a privileged character? Of course we are, responded the hpstees. Of course, echoed John Lamed. And I am to consider myself en tirely at home? Yes, yes. jHe looked at the hostess quizzically. What Is the name of the homesick cook? he suddenly asked. Olga. He arose. I am going to test the depth ot your friendship, he laughingly said. I am going out to your kitchen to see 17 I cant cure your suffering domestic. We will soon know If my year in the University of Copenhagen was wasted. Dont move, please. Before the startled hostess could utter a word the guest was on his tray to the kitchen, John Lamed stared at his wife. Tblnfc of Normal she gasped. Yes, said Johns wife, quite un moved. Hes asplendid fellow. -  Then she suddenly sat up very straight Hark! she whispered. They could hear a murmur of voices from the kitchen. Then one voice arose load and clear. It seemed to be declaiming. Suddenly someone laugh ed and laughted again. Thats Olga, whispered Mrs. Johq. First dose highly effective, mur mured John Larned. Then the clear .voice ran into a quaint old songa college song, they thought. The words were in an unknown tongue, hut there was i merry lilt to the tune and quite with out warning a second voice broke !n and the two voices blended very fair- !y. Thats Olga again,. said Johns wife. Second dose equally effective, said John. The two voices sang the song through together. Then they stopped with a merry laugh. The masculine voice went on with the declamation. He must be talking Danish, said Johns wife. No doubt of it, my dear. Ive seen It stated somewhere that Richard Cort land had mastered nine languages. The guest seemed to be telling story. From time to time tne delight ed cook loudly chuckled and at the cli max she roared with delight Theres no questioning that treat ment, murmured John. I wonder where Norma is? whis pered Normas mother. I wonder, repeated Nonnas fath er. Normas mother put her finger to her lips and stood np. Come, she skid. . John Larned arose and followed his wife. Their way led them through the din ing room and into the china closet. They moved with great care and, cau tion. When they were In the dark closet they could look through the glass in the door into the kitchen. The culinary department looked, as usual, quite as clean as wax. Leaning back against the kitchen table stood Richard Cortland. He was talking rapidly fa a foreign tongue and gesti culating freely. In front of him sat the light-haired Danish girl, the homesick Olga. She was looking at him eagerly, a bright smile on her face as she drank in his words. Mrs. John clutched her husbands arm and pointed across the room. Norma was sitting against the wail looking with a calm disdain at the cook and the stranger. She sat bolt upright, -her dainty little cap still on her head. John Larned suddenly put his hand over his mouth, and his wife gently shook him. And now Richard was finishing his story. He stepped forward and made Olga a very low bow. And Olga ris ing and spreading her skirts courtesied almost to the floor. Then the girls merry laughter rang out again. But she checked it and pointed to Norma. Whereupon the guest bowed low to the smart young waitress. But Norma, with nose in the air, re ceived this salutation haughtily and inclined her head very slightly. Again John Larned covered his month with his hand and his wife, fearing further consequences, drew him away-and they retraced their steps to the library. Scarcely were they seated when Richard entered the room. And Norma demurely followed. Richard was laughing, but Normas face wore a look that was meant for offended dignity."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "she gasped. Yes, said <mark>Johns</mark> wife, quite un moved."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "she gasped. Yes, said <mark>Johns</mark> wife, quite un moved."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1988.15, 314.36, 2134.54, 695.61], "bbox_id": "7c876b0fdf", "file": "AppomattoxNewspapers_1962-1965a_0581.pdf", "page": 1, "text": "Willie Josiah LeGrand Willie Josiah LeGrand, 83, of Appomattox, Va., died at St. Johns Nursing Home in Lynch burg, Virginia, at 1245 p.m,. Tuesday, January 19, after a pro longed illness. He was bom in Appomattox, January 17,1882 and was a life long resident. He was the son of Thomas Edward and Sarah Ann LeGrand and a faithful member of Liberty Baptist Church. He was a retired farmer and busi nessman. He is survived by his widow, Mrs. Lula Drinkard LeGrand and four daughters Mary Ann Le Grand, Lynchburg Mrs. Lester C. Furney, Clearwater, Florida Mrs. L- Carter, Wellesley, Mas sachusetts, Mrs. Forrest L. Yeak- ley, Richmond and three sons Thomas E. LeGrand and Walter H. LeGrand, Appomattox and Alfred A. LeGrand, of Boydton, Va. Also surviving are seven grand children and two sisters, Mrs. W. A. Kelley, of Culpeper, Va. and Mrs. W. D. Mason, of Rice, Va. and a number of nieces and nephews. The body will lie in state at Robinson Funeral Home, Appo mattox. Funeral services will be con ducted from Liberty Bapt i s t Church at 330 p.m. Thursday with burial in Liberty Cemetery."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Va., died at St. <mark>Johns</mark> Nursing Home in Lynch"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Va., died at St. <mark>Johns</mark> Nursing Home in Lynch"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1027.43, 169.73, 1168.98, 558.46], "bbox_id": "7bc43b36a7", "file": "AppomattoxNewspapers_1974-1975a_0473.pdf", "page": 1, "text": "will do their best in each office. Mr. and Mrs. Lyle Thomas had all of their duldren-in-law and grandchildren and great grandchildren for dinner Sun day. Mrs. Hazel Gillaapie, Mr. and Mrs. I. B. Wheeler were Saturday night supper guests of Mr. and Mrs. Bill Roupe. Such a lovely supper was enjoyed by all. Mrs. I. B. Wheeler and Mrs. Hazel Gillaspie were shoppers in Lynchburg Friday. Mrs. C. T. Roach spent Sunday with ehr father, Mr. Osborne Davidson and uncle, Crawford Davidson. All in the neighborhood that were sick are doing fine now. A lot from this section went to RR Day at Appomattox Saturday and Sunday. There were really a lot of folks out. We were thankful for such a sunshiny day Sunday. The revival is in progress at Bethel this week. Rev. Johns ton from Concord in going some fine sermons. Come out and hear him. Mr. and Mrs. I. B. Wheeler visited Mr. Norman Jones and Mr. Burton Carson, Jr. Sunday afternoon. Both are doing quite well."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Bethel this week. Rev. <mark>Johns</mark> ton from Concord in"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Bethel this week. Rev. <mark>Johns</mark> ton from Concord in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.98, 749.5, 1952.21, 893.7], "bbox_id": "4311199597", "file": "AppomattoxNewspapers_1908-1909a_0503.pdf", "page": 1, "text": "will , i home. raging here. . ! Mrs. J. E. Martin, of Roan- Ï am glad to     î oke and J L. Martin, of Peters- grdens have been planted and burg acconipanied Misg Anne Martin for a few days to San ford, Fla., where the latter will spend the summer with her neice, Mrs. A. H. Garrett? Mrs. J. H. Cheatham, and daughter, Mrs. Ringham a n d Miss Iean Johns, of Appomat tox, were recent visitors in the home of Mrs. J. A. Martin."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "n d Miss Iean <mark>Johns</mark>, of Appomat tox, were"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "n d Miss Iean <mark>Johns</mark>, of Appomat tox, were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [349.7, 503.38, 518.34, 1623.81], "bbox_id": "469803c086", "file": "AppomattoxNewspapers_1902-1905a_0547.pdf", "page": 1, "text": "who was 011 nettles all the while, walked boldly to the door whither his mistress had retired, and knocked for admittance.  Send for this stranger, this upstart adventurer. he.said, his air that of a wish to unmask him liare ir presence. mans audacity nearly struck Mrs. Raynor dumb. She rose with flushed cheeks and Hashing eyes. I will send, since you request it. she said.  But 1 warn you beforehand that the result may he most damaging to you. If it is, you have only your self to blame. She pulled the hell-rope, and three minutes later the man whose claims were to be disputed was ushered into the apartment. A smile of triumph wreathed his lips and a strange light burned in Ills eyes ns they fell for a moment upon the tali, stalwart figure of tlie would-be accuser.  Am I wanted? lie coolly inquired. Mrs. Raynor nodded, and pointed contemptuously at her servant.  This fellow claims to have some thing to communicate that deeply con cerns you. Let him speak, then, lifting his handsome shoulders with an express ive shrug. What I have to say can be told in a very few words, said John.  Yonder adventurer cannot be Paul Raynor for the very good reason that I am ho!  You! gasped Mrs. Raynor, trem bling with excitement.  What mad ness is this? You are beside yourself!  Nay, said John.  I am the true heir of Summernook. It was a whim of mine to come here and hire out as a servantl wished to study you before declaring myself, and if you were found worthy, leave you lu undis turbed possession of the estate. This seems incredible!  Decidedly so, sneered Paul. The fellows insolence and assurance are extraordinary. But I have no desire to enter upon a long discussion. Here are two certificatesone the marriage of my parents, the other of my birth and baptism. Pray examine them you will find that they are duly attest ed. Mrs. Raynor took the papers lie of fered and hurriedly glanced at them. They were all they claimed to be. As Johns gaze fell upon them a look of surprise and terror swept over his face. He staggered backward as though some one had dealt him a dead ly blow.  Good God! be gasped.  1 have been robbed.  Robbed? echoed his mistress. These papers are minethe proofs of my identityI had them last night they were stolen from my room while l slept. Ob, madam, for Gods sake, dont suffet yourself to be misled by the villains cunning! Mrs. Raynor turned haughtily away. This artifice Is too shallow. You cannot expect me to credit a story so improbable. I am tired of the scene. You will be good enough to withdraw.  I swear ----   Not another word, she angrily in terrupted.  Go! He could do 110 less than obey. As lie went out with slow, reluctant steps be had the misery of seeing his rival clasp Mrs. Rhynors hand and raise it to his lips. Two days went by. John had been dismissed from the service of Ills mis tress, but he still lingered about tlie premises. He was nearly crazed with the dread that the woman lie loved might fail a victim to the adventurer who sought her favor, in spite of his efforts to save her. riiuling her alone on the terrace in the late twilight, he impulsively flung himself at her feet.  Listen to mo, dariing, he cried. You mustyou shall! I would gladly give my life for you. For weeks, now, 1 have lived only in the light of your smile. Waithe patient. I cant see you sacrifice yourself. Only give me time to bring forward those who can attest the truth of the strange story I have told. His passion and despair moved the woman more than she was willing to acknowledge.  Hush! she cried, trying in vain to calm herself. Stand out of my way How dare you ever speak to me after what lias passed? She hurried into the house, pretend ing to be very angry at his presump tion. But her heart beat fast, and 1 was with difficulty that she kept back the scalding tears that rose to hei eyes. An hour later, in tlie brilliantly-light ed drawing-room, other bearded lips were pouring their tale into her ear.  I have learned to love you passion ately already. the so-called Paul Ray nor said.  Summernook would be 1"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "claimed to be. As <mark>Johns</mark> gaze fell upon them"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "claimed to be. As <mark>Johns</mark> gaze fell upon them"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.6, 232.81, 538.45, 457.65], "bbox_id": "caec063eed", "file": "TimesVirginian_1984a_0083.pdf", "page": 1, "text": "Whitten Timnertake Chapel was in charge of arrangements. ttpry Purdum Smith Mary Ptnrdum Smith, 98, of Route 2, Appomattox died Wednesday, March 7, 1964, at St. Johns Nursing, Home. She was the widow of Sidney Guy Smith. II Born in Appomattox County, she was a daughter of the late John Fiknore Purdum and Laura Hewitt Purdum. She was a lifelong memeber of Memorial United Methodist Church. She is survived by  daughter, Mrs. Ben Helen Wheeler, Appomattox three grandchildren, Louise W. Gordon, V irginia Beach, David Wheeler, Silver Spring. Md., and Thomas Wheeler, Fredericksburg a great-grandson, John Gordon a sister, Mrs. Virginia P. Jonhs, Concord, and a"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "7, 1964, at St. <mark>Johns</mark> Nursing, Home. She was"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "7, 1964, at St. <mark>Johns</mark> Nursing, Home. She was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [819.68, 1605.35, 2580.14, 1675.54], "bbox_id": "2e91429111", "file": "TimesVirginian_1984a_0085.pdf", "page": 1, "text": "White 2 4 Oz t.Ot Senator Paul Tribfe will he a guest t the Farmville Area Town Meeting on Saturday, March 24 at 10 a.m. in Johns Auditorium. Hampden-Sydney College."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "White 2 4 Oz t.Ot Senator Paul Tribfe will he a guest t the Farmville Area Town Meeting on Saturday, March 24 at 10 a.m. in <mark>Johns</mark> Auditorium. Hampden-Sydney College."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "White 2 4 Oz t.Ot Senator Paul Tribfe will he a guest t the Farmville Area Town Meeting on Saturday, March 24 at 10 a.m. in <mark>Johns</mark> Auditorium. Hampden-Sydney College."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [983.99, 1306.55, 1142.0, 1556.25], "bbox_id": "f155cb3294", "file": "AppomattoxNewspapers_1902-1905a_0208.pdf", "page": 1, "text": "While President Roosevelt was in New York attending the funeral of the late Janies King Gracie, A. B. Doming, a harmless crank, made his way through the army of officers and placed a letter in the Presidents hands asking that lie recommend Dcmings charcoal cure for cancer to Emperor William. President Remscn, of the Johns Hop kins University, and Professor Upde- graff, of the Girls Latin School, deliv ered addresses at the convention of the Association of Colleges and Preparatory Schools of I lie Middle States and Mary land. The Probate Court judge in New Ha ven, Ct., entered a decree that the docu ments making the bequest to Bryan could not he recorded as part of flic will of Philo S. Bennett. Grover Cleveland wrote a letter to St. Clair McKelway declaring that lie can not open his, mind to the thought of be coming a candidate for the presidency. The American Flint-glass Manufac turers Association announced a reduc tion of from 18 to 14 cents. Wages will be reduced accordingly. The country home of William Wel-h Harrison, at Glenside, a suburb of Phila delphia, was robbed of jewelry valued at 25.000."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "President Remscn, of the <mark>Johns</mark> Hop kins University, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "President Remscn, of the <mark>Johns</mark> Hop kins University, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [712.56, 671.5, 821.77, 715.8], "bbox_id": "a32808f29c", "file": "AppomattoxNewspapers_1947-1949a_0370.pdf", "page": 1, "text": "While packing the box For Uncle Johns folks Dad qehs himself all Tangled up in the ropes."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "While packing the box For Uncle <mark>Johns</mark> folks Dad qehs himself all Tangled up in the ropes."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "While packing the box For Uncle <mark>Johns</mark> folks Dad qehs himself all Tangled up in the ropes."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [497.99, 278.1, 816.48, 394.45], "bbox_id": "9bc28bc56b", "file": "AppomattoxNewspapers_1892-1898a_0096.pdf", "page": 1, "text": "while heaping these fearful epithets upon our honored statesmen, he was endeavoring to clew himself from a charge of having essayed to impeach the fair name of Virginia. Con sistency, where art thou ? Patience would seem to be no longer a v irtu e _______ __ when we consider, in the words of j Bbcna.uHi3ciirr in the aB deed-1 Captain Johns, such a  rotten mushroom as this."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "the aB deed-1 Captain <mark>Johns</mark>, such a  rotten mushroom"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "the aB deed-1 Captain <mark>Johns</mark>, such a  rotten mushroom"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [350.13, 205.01, 518.98, 1319.71], "bbox_id": "6bfeda0b33", "file": "AppomattoxNewspapers_1892-1898a_0423.pdf", "page": 1, "text": "which were never answered and! travelling five and seven miles urg ing the Appomattox ladies to join and help them. They were in formed with an indifferent smile, that they had other important du ties and home affairs claiming their time, and their quarters could be better spent elsewhere than on the dead. In one seuse this is true. We have home duties and try not to neglect them, aud the monev ould be possibly more wisely spent While we do this to honor our dead, we try also to impress npo. the minds of the children of the county, hat the Confederate cause was just .ml right and thatthir fathers were not rebellious traitors and to give them a desire to acquire knowledge of the events of their country, and to teach, them to be patriotic aud proud of their South-land and an cestors. The little knowledge, be ginning here may grow in the minds and hearts of each, and be of great benefit to all. The president of the U. D. C. thought last year of giviug up the charter of the Appo mattox Chapter U. D. C. on account of the ladies lack of interest in this county. She wrote the National l D. C. president, and the Virginia president U. D. C. to that effect, stating she would join a chapter in Lynchburg. Letters from the Va. division, S. C. division and Md. di vision came pouring in not to let Appomattox surrender the second time also sending a list of names of prominent ladies who would join among them, Miss Ruth Early, Mrs. James Garnett, Miss M. Amelia Smith, the piesideut of Va. division U. D. C. and the daughter of ex-Gov Wm. Smith of Va., known as Ex tra Billy. The letter expressed surprise at the Appomattox ladies not caring to join one of the largest organizations m the whole south and living in one of the most his torical counties in the world. It is quite a reflection upon the county. We revised the roll and now have ouly eighteen members lu t they say they intend to keep up the or ganization and to be proud they are U. O C. of Appomattox and we shall be more than pleased if Coal ing will forward us the names ot the ladies desiring to join the IT, D. C. or the Memorial Association or any one reading this would like to become a member of either society please forward their name to Mrs. T. A. Smith, president of the Mem orial Association or Mrs. C. W. Hunter, president of U. D. C. West Appomattox. One prominent aim of the U. D. C. is to gather histori cal facts to help the historians of the U. D. 0. historical committee in collecting war experiences, inci dents and reminiscences of the old soldiers, their wives, daughters or any one who can remember during the Civil war. The U. D. C. es pecially requests, Mrs. T. W. Johns to write up hers and Capt. Johns also Mrs. George Miles, Mrs. A. H. Bocock, Major Flood, Mr. Chap Chilton, Drs. Wm. White and Wm. H. Ahbitt, Mrs. Mary Ann Robert son, Mr. Kirk Hannah and any one who will help us, also send us news paper clippings or Magazines or Journals or anything bearing on the war between the states. This is to help in having a correct history of the south. Please dont think yours will not be of service or interest for it may show up the spirit of the times more than you think. A D a u g h t e r ."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "requests, Mrs. T. W. <mark>Johns</mark> to write up hers"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "requests, Mrs. T. W. <mark>Johns</mark> to write up hers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1698.67, 406.13, 2038.83, 593.23], "bbox_id": "9267b85c87", "file": "AppomattoxNewspapers_1954-1955a_0391.pdf", "page": 1, "text": "When decorating a hall, living room or dining room, you have to year of operation, with 8,500 plan schemes that will please every- visitors and many additions of relics one in the family. In decorating a associated directly or indirectly bedroom, its differentplease only with Jackson and his family. the person who uses jt. Jay Johns, of Charlottesville. This goes for childrens rooms, President of Stonewall Jackson als0, Don,t worry if Juniors taste Memorial, Inc., which operates the T T  b  led SnakeS r sisters , . . ,  , . operates tn e , taste m ruffles seems a bit too-too. admission-free shrine, has reported j Childrensta ste s will develop as tnat the home now contains about they grow. 40 articles associated with Jackson  Pastels have long been popular family. for bedrooms because they are Ihe home was occupied by Jack- restful. However, dont hestitate to son when he was a professor at V.  use dark green or brown if thats m . I. and was the only home the ! what the occupant wants. Just be famous Confederate general ever sure the room has good light and"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "who uses jt. Jay <mark>Johns</mark>, of Charlottesville. This goes"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "who uses jt. Jay <mark>Johns</mark>, of Charlottesville. This goes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1933.85, 229.76, 2095.51, 851.96], "bbox_id": "26f3d49cb0", "file": "AppomattoxNewspapers_1915-1918a_0481.pdf", "page": 1, "text": "Whatwhat are you going to do? Frankly, Miss Vera, I do not know, I confessed. I have had no time to think, and my head still throbs so from blovs that I hardly realize the situa tion. I cannot hope to fight these men alone, and there can be no immediate danger  they are sailing the ship toward St. Johns. Yotr believe they will take to the boats, and leave us aboard? That would be their only safe course. They would never dare sail the Indian Chief Into that, or any other harbor. They must land as ship wrecked seamen, tell their story, and then quickly disappear. II know thatbutbnt will they dare to leave us afloat, to be picked up by some vessel? I hesitated, but her eyes compelled an answer. I do not know, I said soberly. It hardly seems possible they chn contem plate such an act of villainy as the scuttling of the ship, and leaving us on board to drown like rats. That would be too horrid a crime for this age. White and Liverpool might be brutal enough, but surely not Fergus Mc Cann. Why not Fergus McCann? His education, his former life, the civilization In which he has been reared he haa lived among gentle men.  Gentlemen! she echoed the word In scorn. His associates have been principally gamblers and rounders. He Is notorious In New York, and his money alone gives him entrance to de cent circles. He doesnt know what the word gentleman means. If there ts treachery behind this, It will be the plan of Fergus McCann. You know him better than I. . I know of him longer I have heard more tales, yet surely you saw- what he was In the boat? .You believe, then, the intention 1 b to scuttle the vessel? Yes, I do. And leave us helpless on jioard? Yes, Mr. Hollis. i drew a deep breath, at this direct verification of my own secret suspl-  cion. So do L I returned In a whisper, although I had no thought of telling you. Yon have some plan, then? You have considered what to do? No hardly that. There will be two days, at least, before we shall be close enough to the coast for them to take to the boats. Much may happen with in that time  we may be spoken by some other vessel, even overhauled by warship, and manned by a prize"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "the ship toward St. <mark>Johns</mark>. Yotr believe they will"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "the ship toward St. <mark>Johns</mark>. Yotr believe they will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.0, 419.83, 1895.4, 799.18], "bbox_id": "6d2a249141", "file": "AppomattoxNewspapers_1892-1898a_0094.pdf", "page": 1, "text": "what party yon belong. Come and we can assure a pleasant and enjoya ble day. It is an opportunity that no one should miss. If you are on the fence, yon may hear somethihg that may decide yon. Be sure to contribute promptly. The committee on edibles will take charge of whatever yon may feel dis posed to give. Let ns all unite in making this day a grand success. . On Saturday Sept. 23rd a mssa meeting was held at this place and after a very harmonious and pleasant discussion the following committees were appointed Committee on EdiblesT. A. Smith, chairman, W. A. Moses, S. P. Coleman, Mrs. J. R. Atwood, Miss Sallie Burke and Miss Kate OCon ner. Finance CommitteeJ. B. Taylor, chairman, J. H. Abbitt, R. F. Burke. Committee, of ArrangementsJ. R. Atwood, chairman, J. M. Miles, W. J. Trent, Miss Anna Jones, Miss Mary Statham, MiasLizzie David son, Mrs. J. W. Flood, Miss Fannie Johns and Miss Lonlie Peers. Committee on SpeakersW. J. Trent, chairman, R. C. Harvy and R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "W. Flood, Miss Fannie <mark>Johns</mark> and Miss Lonlie Peers."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "W. Flood, Miss Fannie <mark>Johns</mark> and Miss Lonlie Peers."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.26, 822.26, 2410.78, 871.86], "bbox_id": "d3d09c8634", "file": "AppomattoxNewspapers_1960-1962b_0340.pdf", "page": 1, "text": "were dinner guests of Bob Jenkins, of i Sunday. Mrs. Frank ed her sister, Eva e St. Johns Nursing Parkway Texaco Station"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "were dinner guests of Bob Jenkins, of i Sunday. Mrs. Frank ed her sister, Eva e St. <mark>Johns</mark> Nursing Parkway Texaco Station"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "were dinner guests of Bob Jenkins, of i Sunday. Mrs. Frank ed her sister, Eva e St. <mark>Johns</mark> Nursing Parkway Texaco Station"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [291.34, 680.27, 423.39, 873.61], "bbox_id": "a78b62a6b3", "file": "TimesVirginian_1980a_0169.pdf", "page": 1, "text": "were being persecuted was that God would eventually end their suffering and wipe away all tears from their eyes. The picture John paints is of a place where those things which cause people to suffer will no longer be present. Gods good plan Rev. 215-7 As though Johns word is not enough, God himself speaks out as if to place his authoritative stamp on Johns visjop, Goas pisu contains tne element of completeness. God is not a of good intentions."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Rev. 215-7 As though <mark>Johns</mark> word is not enough,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Rev. 215-7 As though <mark>Johns</mark> word is not enough,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1533.83, 1725.87, 2431.96, 1759.47], "bbox_id": "19a1ae5937", "file": "AppomattoxNewspapers_1943-1947a_0070.pdf", "page": 1, "text": "Well, Johns right o course. Hard to believe America could ever pass a law like Prohibition. Moses Motor Co"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Well, <mark>Johns</mark> right o course. Hard to believe America could ever pass a law like Prohibition. Moses Motor Co"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Well, <mark>Johns</mark> right o course. Hard to believe America could ever pass a law like Prohibition. Moses Motor Co"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [831.35, 231.19, 999.85, 1118.85], "bbox_id": "2f0701a6b4", "file": "AppomattoxNewspapers_1902-1905a_0153.pdf", "page": 1, "text": "Well, if I talk too long, you will get tired so I will branch off on- the election. I had thought and hoped that the New Constitution, the Barksdale law. Masonic obliga tions would constrain our people to have a fair primary, I never heard more complaint. I dont know that Johns half-and-half man voted or not bat it is charged that two-fify, or three hundred floaters, mostly Republicans, did that whiskey and money flowed freely. These things certainly ought to be stopped. This was Democrat vs. Democrat. Now, when it comes this fall, Democrat vs. Republican, let us see that it shall be fair. No power on earth can stop the buying but, with com mon sense, backbone, and a heart for honest elections, the delivery of bought votes can be stopped. Jack Hooper, Willie Trent, and other have pledged themselves to each other and to their district that no honght votes shall be delivered here unless under the penalty of the law I suppose any offender will be tried under Judge Hundley, as the county- court will end soon after the election I am not in eithei party shall vote for the best man, so far asI know at the time, let him be a Democrat, Republican, or Populist. There is one thing certain here on the farm, if two men make application for work, the one who does not drink gets the job with my consent, only such Shall be employed to make or execute the laws of this good old Commonwealth. I have no ill-trill inst any of the nominees, but drinking men, or men of immoral habits shouldnt be voted for. Thai example to the young is too bad. Well, I thought I was through, but it is raining, and I am rested 24 hours after I began but Ill talk mu to death, wont I ? Mr. Albert Steger, when a yoimg man, went to Alabama. In the town where he ivect was a Frenchmanboth great talkers. A wager was made as to who was the best. They were left over nigh! in the same room. Next morning the Frenchman was found dead, and Mr. Steger was found whispering in his ear.  I dont want to kill yon. Lawyers, editors, and doctors are thought by some to know all things. As you are lawyer and editor, I wish yon would tell me what became of the money collected for sale of ands delinquent for taxes iu De cember, 1873. The Auditor has written me twice that there were no lands sold in the State after the war ntil 1886 for delinquent taxes. Hundreds, if not thousands, of dol- ars was paid to the Treasurer of this county for lands purchased ai the December sale, 1873. I have a list of some 40 or 50 tracts, names of buyers, and the amount sold for. ou get even with Mr. Thomhili by making him enquire into this when he gets to Rich mono. There was, undoubtedly, such a sale of delinquent lands in Novem ber or December, 1873. This was rather more than ten years before Auditor Marye went into office, and more than twelve years oe.fore the second sales, made iu 1886. May peace on earth and good will to man be our motto now and ever more. Andersonville, August 11,1903."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "I dont know that <mark>Johns</mark> half-and-half man voted or"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "I dont know that <mark>Johns</mark> half-and-half man voted or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.76, 212.97, 1784.69, 1427.72], "bbox_id": "1cc6644422", "file": "AppomattoxNewspapers_1915-1918a_0481.pdf", "page": 1, "text": "Well, even with those two this will only give us six able-bodied men that is not enough with which to bring the Indian Chief into port. It will be all youll have, anyhow, said McCann grimly. And you are mighty lucky at that. The drift will be southward, and will take you direct ly Into the steamer lane. All you need do is keep steerage way, and whit until you are picked up. You dont Imngine we want you sailing into the harbor at St. Johns the same time we get there, do you? Come on now stop this talk, and give us an answer. For a long moment I stood motion less, staring out through the open port at the sunlit waters. It seemed to me my best course was to at least pretend to yield to their wishes. To acquiesce would Insure me a measure of free dom on board, an opportunity to learn the exact conditions, and might enable me to save the ship from destruction. As to McCann, he had some object in all this far more important than ap peared on the surface. He was never assuming this risk, or investing all tills money In an illegal cause, without a more serious purpose than an idle desire to return to New York. He was taking a tremendous chance, driv en by some impulse I could not com prehend. What was the secrethate, revenge, greed, love? I would find out sometime bnt now I could only grope In the dark, guessing at his mo tives. Yet I kqew thishis promises were lies. He would make use of me he would Induce me to pilot the ship to the spot he desired to attain on the broad bosom of the ocean, and then what? The man would never be fool enough to permit the Indian Chief to sail into any harbor to accuse him of such a crime. Back of all his words, his explanations, his apparent fair ness, lurked treachery. I felt it, and knew it, and the very suspicion led me to reach swift decision. My eyes met his with a smile. I cannot conceive that I have much choice I said quietly. It Is to either do this In freedom, or under compul slon. Naturally I prefer the former. You mean you accept our offer? YesL-I will figure out the proper course, and report to you when the ves sel Is at the place you designate. Tht Is all that is asked of me. In return -I have your pledge that the ship will be left in good condition, with all who are loyal safe on board? Yes. There Is one more condition, Mc Cann. What? That Miss Carrington be left abso lutely unmolested by either you or your men, until the time comes or you to take to the boats. Hah! So that Is really where the shoe pinches! We will not quarrel about Iteither say yes or no. What do you mean by unmolested? Am I prohibited from speaiking to the lady? That Is to be left to her choice, not yours. She Is to retain the key to her stateroom to eat alone If she prefers, and to see such associates aboard as she teslres. Liverpool laughed drunkenly. That aint the argyment, he said easily. So far as I see, that dont change things none. Shes locked her self In anyhow, an wont answer no body. McCann growled something which I took to be assent, and I was myself so anxious to ascertain our exact posi tion as to have no desire for further argument. I could be of no possible value locked a prisoner In that state room  no protection to her. Indeed, if I refused to navigate the vessel, leav ing the ship to drift blindly through these unknown waters, exposed con stantly to peril, I would be guilty of a failure to do my duty almost as great as the crime of these others. On deck, knowing where we were and the ! direction in which we were going, the opportunity might arise for the accom plishment of much. I grasped the nec essary Instruments from the swinging shelf, and, with these in my hands turned toward the door. Come on, then, I said, Ignoring the fact that I was any longer a prisoner. Bring the chart, one of you, and Ill point out where we are to you on deck. Just hold on a minute, and Liver pool, blocking the doorway, pushed me back with his huge hand. Were the bosses, not you. Glt It out o your head right now. mister, that yer the captain of this ship Indian Chief. Blast yer ye aint nuthln an If yer attempt to play jis any dirty tricks. Ill smash yer the same as I would a fly. Ain that right, Mr. McCann? Oh, Hollis understands, Red. He knows weve gone too far In this game to take any chances. Let him pass. Well, growled the giant, stepping aside, I just wanted him ter know, dont kill nobody in cold blood but In goln ter take keer of myself an my mates. Yer glt me, skipper? Yes, I get you, I answered a bit wearily. So let it go at that, my man I know the time to fight, and the time to keep quiet. Now lets go on deck."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "the harbor at St. <mark>Johns</mark> the same time we"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "the harbor at St. <mark>Johns</mark> the same time we"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.06, 485.39, 1461.46, 1596.23], "bbox_id": "0eef633326", "file": "AppomattoxNewspapers_1922-1923a_0427.pdf", "page": 1, "text": "Wekiva River rises Jn this hint Altamonte Spring, which is lrce is a comparatively small lad when we lifted our eighteen- L-boat from the wagon we had L doubts as to whether she I it into the little pool at all. t there was no choosing our ing spot. The spring was the llace where we could reach the I for beyond it the river plunged fee into thick hammock hard- Tforest and was lost to view. as Hobsons choice, and after Yaianeuvering the boat slid down Lep bank and floated like a cork i centre of the bubbling pool. piled our good hoard and led after them. A shouted good- f t0 our negro teamster and we I off. ere were four of us who started  t lovely March morning. Three Myers, and Marshall- i Americans the fourth, your He servant, an English orange- er. Our idea was to make a pleasant little picnic of th a ex- lion. Twelve miles below Alta!. te Spring another river, the Clay Igs Run, joined the Wekiva. j miles up the Run was a settle- fe where we had friends. We Xt to make this place the first It, sleep there, and start refreshed 1 morning for the mouth of the Hva, where It joins the St. Johns. Tlatter part of the journey we toned we could do in two days, Ing three In all. How sadly mis- lg we were in our calculations here to discover to our cost. i first part of our journey was Inctly exciting. The stream, far narrow for rowing, ran deep and t In a series of the very sharpest -so sharp that, In spite of the j efforts of the man in the bow, boat constantly charged the high i In a bull-headed fashion, which  filled her with loam and leaves made her occupants sit down 1 emphatic bumps and still more Ibatic language. fnddenly there loomed up a dead pk, lying right across the river 1 bank to hank. There was noth-  for It but to cut through the ob- cle. Myers sprang out with an , and the chips flew in a white wer. 1 did the ants. The half-rotten was the home of hordes of fee red ants, which bit like fiends, fore the boat could be pulled clear was swarming with the fierce lie warriors, and long after the oi bad parted and the boat had ped on its way we were busy pick- j ants oft ourselves and sweeping I d overboard. for some hours this sort of thing pt on, the river gradually growing Jelze, but still too narrow and loked for rowing. Sometimes,-a lhad to be cut through sometimes was necessary to life the boa c-ver lall-submerged trunk. The inks fee high and heavily wooded and 1 sunlight glittered down through ftracery of delicate foliage. The were all hardwoodlive oak, ter oak, bastard oak, bay, red gum, I magnolia, the latter forest giants Pi feet high and filling the air ph scent from white blooms the size Jdinner-plates. peon after luncheona scratch re- Tt of biscuits, cheese and peach lerthe boat suddenly left the pmock and glided into the mazes l 8 rat saw-grass swamp. Jww-grass is a purely Floridan Pduct. Ten to twelve feet from r summit, its blades are grey- in color, wide and stiff, with prated edges which cut abominably. T .ng short of an alligator can rate it its great height and ness make it imposible to force L, t through It. It covers hun- 1 of square miles in South Flor- F and many a life has been lost Tj tangled recesses. L he saw-grass the river spread P 0 a maze off shallow channels,  , aere our troubles began. We EL.  aRer another, and over and R j grounded or ran into blind  0 and were fcced to return ironiwi Wm drX. the boat hard it sans ? he hbttom was fair yel- L thl, . Myers and Marshall pulled lilt ho ts and sprang overboard  to u i instantly they were both e in ? v knees and sinking fast, path I k oat had t0 PnR He grim Ftreanhhaul them out of the Patch herons quicksand which they happened on. 1 U 8 e of Fortunately, by rrn, u ir mast xve managed to Didflo  681 back lnt0 water that"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "It joins the St. <mark>Johns</mark>. Tlatter part of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "It joins the St. <mark>Johns</mark>. Tlatter part of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2072.89, 205.22, 2230.89, 440.12], "bbox_id": "56ae4b2949", "file": "AppomattoxNewspapers_1915-1918a_0546.pdf", "page": 1, "text": "weather Gymnasium.  The Virginia Alumni Ataoeiatu will give luncheon to the members the graduating class on Mondi noon. Preaident and Mra. E. A. Alderman of the University will hold a reception for tbe class Mon day afternoon. The Phi Beta Kappa honorary fraternity will hold ita initiation Monday night, the Phil Beta Kappa addreta being delivered by Dr. Joseph 8. Ames, head o the department of physios at Johns Hopkint University. Dr. Ames, hat recently headed n commission to visit the war front and observe further application of science in the war. Dr. M. Aahby Jonea of At lanta, Georgia, will give the annual address to the Y. M. U. A. .m"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "department of physios at <mark>Johns</mark> Hopkint University. Dr. Ames,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "department of physios at <mark>Johns</mark> Hopkint University. Dr. Ames,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1738.29, 860.59, 1878.01, 972.54], "bbox_id": "9ceac5ae37", "file": "AppomattoxNewspapers_1962-1965a_0592.pdf", "page": 1, "text": "We wish to thank everyone who donated blood recently and in years gone by in behalf of Mr. L. M. Wilkes, of Appomattox. Mr. Wilkes, now a patient at St. Johns Nursing Home, Lynch burg, is deeply grateful for this and for all the cards, flowers, gifts, and other expressions of kindness and concern during his illness. Mrs. L. M. Wilkes, Mrs. Mabel Simpson. 2-11-lt"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "a patient at St. <mark>Johns</mark> Nursing Home, Lynch burg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "a patient at St. <mark>Johns</mark> Nursing Home, Lynch burg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [829.43, 802.29, 2105.89, 1057.9], "bbox_id": "83fdafde18", "file": "AppomattoxNewspapers_1908-1909a_0514.pdf", "page": 1, "text": "WE WANT YOUR PROSPECT ?r 2 fe,sso.r -y the chief attention of the court ten Moore- and Bobert Lee j Wjj consumed-by hearing Pricewere installed asEIder 3 0f criminal docket, much and Baseomb Price and John0f which is composed of prohi- Johnson, as deacons in Prospect bition cases. Local officers have Presbyterian- church here on been especially active in sleuth Sunday night. A featurenew ing proHibiton violated, a n d ta many who . witnessed the have made Quite a iW captures ceremony, was the laying on of an arrests, hands. ... f j  . .  Frank- Johns, a son,of Mini- Tji .j,...- Try  , roe Johns, and nephe of,Dr. H U r J K e J u L e ilU e S Frank John, ofRichmond, had 1  a narrow escape on Sunday J Q J L I c h t U U C 1  Y night when his car was in col- . w.  J lision with a truck driven hy a 1 negro on the highway near Appomattox One of Few Sheppards, in Buckingham Counties W ith No  county. The truck roiied over - Indebtedness 3 times down an embankment,  r  ..... . . - enjuring the negro- man. Mr. County Treasurer R. L Johns only had his car damag- Burke this week announced re"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "hands. ... f j  . .  Frank- <mark>Johns</mark>, a son,of Mini- Tji"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "hands. ... f j  . .  Frank- <mark>Johns</mark>, a son,of Mini- Tji"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [242.16, 617.38, 401.61, 1258.28], "bbox_id": "1144cb3c15", "file": "AppomattoxNewspapers_1918-1922a_0282.pdf", "page": 1, "text": "We ore now to have an Iron bridge acrosa North river near Mr. John Glovers place, the material was put In place Saturday and the work will be pushed right along, and travelers will be glad to know that a tempo rary bridge has been put across tbe river to be used while tbe new bridge is In course of e re ctio n 1 smw a man returning from market the past week he bad sold lugs for 60 oen s a hundred and he looked the picture of dejeo tlon. Good tobacco, however, sold as high as 10. and I hear that some sold In Farm- vllle as high as 20 Messrs. Thomas B Hall and J P Andrews attended the Farmers Onion meeting in Lynohburg last week. Farmers here are very much Interested In the scheme for eaoh one to sign a pledge that be will not plant any tobacco next year, provided dealers do not Uk upon a reasonable some of prices lor the tobacco now on hand. I asked the price of salt at four different stores tbe past week at two stores the price was 1.7 per 100 pounds, at an ther, 186 and at still another tbe price was 1.60 Une of my neighbors shipped a large beet hide and he paid 60 cents for a receptacle to put the bide In after paying express and commission be g t just 60 cents for the hide. A colored man shipped a bide and tbe com mission merchant sent him 80 cents in stamps to pay for it. And yet 1 paid  0 for a pair of leather shoes. Something Is wrong somewhere Good beef selling here for 10 cents pound, sugar selling at 11 cents in some places and 8 cents In others 1 started to say that whiskey was being used by people who 1 see Intoxicated, but I really do not know what they drink nor where they get it but they show plainly enough the effeots of what they drink. A young man told me of late that his fa ther told him If he didnt know anything good to say of anyone to say nothing at all, and he said he was making this a rule in life and fouud It not only was right but from a business standpoint It paid. As a rule la m glad to say the young people here are well- mannered. and a number of them show good breeding, but 1 a.so regret to notice that a few are wanting In deferonce to their eld ers, they are surely wanting In respect to their parents, and they seem lo cultivate a foppish, dont care manner, that they will live to see was altogether disrlght and Iunpretty when they arrive at years of discretionIf they ever do. All this is said in a spirit of kindness, and I have been pleased to notice a change for tbe better among certain people who have had a gentle reminder handed to them in this corre spondence I notloe people driving across the long new bridge near here with horses In a trot. We all remember to have seen signs like this posted at each end of a bridge 6 One for driving across this bridge faster than a walk. I think tbe board of supervisors would realize that the structure will remain intaet much longer If they would entoroe such a regulation. Mr. Reuben Johns has been ill of pneumo nia a t the home of Mr. A C Garnett here and bis devoted mother has baen at his bedside and Dr. Morriss Is his physician The high school here will close on Deo. 23 and reopen on January 8"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "a regulation. Mr. Reuben <mark>Johns</mark> has been ill of"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "a regulation. Mr. Reuben <mark>Johns</mark> has been ill of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [794.19, 1596.71, 1059.98, 1705.2], "bbox_id": "9909d50e58", "file": "AppomattoxNewspapers_1918-1922a_0043.pdf", "page": 1, "text": "We dont sell you merely roofing, we sell roofing serviced The roofing you buy must make good or we will. Thats why we offer you J o h n s - M a n v ille R e g a l R o o f i n g It is backed by 60 years of Johns-Manville Responsibility. You may register it with Johns-Manville by means of a special regis tration blank furnished with each roll of roofing an d Johns- Manville will see that it gives exactly the service Johas-ManviUe promises 2et us quote you prices"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "of roofing an d <mark>Johns</mark>- Manville will see that"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "of roofing an d <mark>Johns</mark>- Manville will see that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1082.14, 1027.48, 1238.51, 1100.61], "bbox_id": "cc4b79d61b", "file": "AppomattoxNewspapers_1898-1902a_0039.pdf", "page": 1, "text": "We buy all kinds of O O U N TU Y PROU17CF and pay best market prices. Ship us you P O U LT R Y and 15DGS, will always tin best we can for you call to see us.X rd get our prices, dont forget the place, iior the boys, we are always ready to serve you. Yours truly. TIIK TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. TIIK TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. TIIK TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1272.26, 952.36, 1432.78, 1026.97], "bbox_id": "8a3e959546", "file": "AppomattoxNewspapers_1898-1902a_0100.pdf", "page": 1, "text": "We buy all kinds of COUVTBY PRODUCE and pay best market prices. Ship us your POULTRY and EGGS, will alwaya do the best we can for you, oall to see us, and get our prices, dont forget the place, nor th , boys, we are always ready to serve you. Yours truiy. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truiy. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truiy. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.65, 1013.58, 1616.39, 1145.88], "bbox_id": "ee0da66cf5", "file": "AppomattoxNewspapers_1898-1902a_0042.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE aud pay best m arket prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to see us, and get our,prices, donf forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS. WANTED!"}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED!"}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [813.1, 1503.74, 1115.94, 1611.61], "bbox_id": "f7958e169d", "file": "AppomattoxNewspapers_1898-1902a_0148.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best market_ prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS. ATTENTION, FARMERS!"}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. ATTENTION, FARMERS!"}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. ATTENTION, FARMERS!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1437.59, 975.61, 1599.57, 1109.36], "bbox_id": "e2dd290784", "file": "AppomattoxNewspapers_1898-1902a_0063.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best m arket prices. Ship us your POULTRY and EGOS, will always do the best we can for you, call to see us, and g et our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS. WANTED!"}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED!"}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [929.7, 1062.37, 1088.32, 1135.93], "bbox_id": "2dbf588edd", "file": "AppomattoxNewspapers_1898-1902a_0144.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best m arket, prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [703.71, 1912.27, 862.81, 1986.4], "bbox_id": "91f9acd0b4", "file": "AppomattoxNewspapers_1898-1902a_0124.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best m arket prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [971.29, 1226.41, 1131.07, 1300.32], "bbox_id": "e4b1b61b20", "file": "AppomattoxNewspapers_1898-1902a_0138.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best m arket prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to aerve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [881.73, 1021.22, 1041.05, 1095.25], "bbox_id": "cab82c30d5", "file": "AppomattoxNewspapers_1898-1902a_0160.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE and pay best m arket prices. Ship us your POULTRY and EGGS, will always do the best we can for you, call to sec us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1058.37, 1287.16, 1216.73, 1362.02], "bbox_id": "44c5ffbf48", "file": "AppomattoxNewspapers_1898-1902a_0152.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PRODUCE ami pay best m arket prices. Ship us your POULTRY and EGGS, will always do the best wc can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready iosserve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1369.92, 1020.97, 1534.98, 1096.29], "bbox_id": "df4e0dd0bb", "file": "AppomattoxNewspapers_1898-1902a_0092.pdf", "page": 1, "text": "We buy all kinds of COUNTRY PKODUCB and pay best market prices. Ship ua your  POULTRY and BOOS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you.- Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1339.67, 1016.43, 1499.96, 1148.22], "bbox_id": "13e6c731d8", "file": "AppomattoxNewspapers_1898-1902a_0059.pdf", "page": 1, "text": "We buy all kinds of COUNTBY PEODUCB and pay best m arket prices. Ship us your POULTBY and EGGS, will always do the best we can for you, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS. WANTED !"}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED !"}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>. WANTED !"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1318.79, 1052.45, 1478.74, 1127.24], "bbox_id": "b041038437", "file": "AppomattoxNewspapers_1898-1902a_0051.pdf", "page": 1, "text": "We buy all kinds of C O U N T R Y P R O D U C E and pay best m arket prices. Ship us your P O U L T U Y and E C O S, vwill always do the best avc cun for ypu, call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Yours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Yours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [73.89, 1017.18, 212.56, 1091.53], "bbox_id": "58d23b100e", "file": "AppomattoxNewspapers_1898-1902a_0097.pdf", "page": 1, "text": "Wc buy all kinds of COL VTKV PKOUrCB and pay best market prices. Ship us your POULTRY and EGGS, will always do the best we can for you. call to see us, and get our prices, dont forget the place, nor the boys, we are always ready to serve you. Tours truly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "Tours truly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "Tours truly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [537.6, 261.55, 714.38, 876.14], "bbox_id": "7a3cdc73a4", "file": "AppomattoxNewspapers_1908-1909a_0331.pdf", "page": 1, "text": "Washington.The first step tywani establishment In Washington t a mi .a.Unwli i-entci for problem minan and animat tiayrUnluu mm hi ruble In smite ways to the twite.,. f standards, lias been taien by it m-orporutlon here of tin- National ft titule of Psychology, whose ini-nmer ill Ip Includes fit of the foremost Anuí can experimental psychologists The Incorporators Hre Irot Knnrti Dunlap, bend of the psychology  de arrment of Johns Hopkins universUv Utd until s few weeks ago of lh llvtsfon of psychology and anthrop.. my of the national research council. tr Hugh 8 f hi mining, surgeon gen rnl of the United States 1uldlc Health service, and Ot Edwin E. Sins- on The charier authorizes if to promote file application f scientific Tacts and principles to human nnd tint mnl life and welfare. The intent, us described hy Prides jor Dunlap. Is to found a nation., psychological laboratory, similar In mine of its functions to the bureau ot standards, hut not under federal con trol. Such a laboratory can he under a relatively permanent director amt can undertake programs of research too lengthy, expensive and complicat ed for other Institutions. In such a laboratory truly c ,-oper dive results of the highest value can he obtained. Men working in othet laboratories on details of the prob lems undertime!! In the -ationttl lab oratory could arrange to transfer theti work there during leave of absence, or In summers. Work done here can be subjected to criticism while In progress. Instead of afterward, and the co-operative method can Insure greater certainty as to conditions. Such a national lab oratory will be of really Inestimable advantage to psychology, not only he cause of Its availability for the soln tlon of problems unwieldy elsewhere, hut because standsrds of research may be elevated. The selection of a site In Washing- ton or Its environs. Professor Dunlap said, must be undertaken with great care The laboratories must be in some plodfe free from noise, vibrations and electrical disturbances of the city because of the extreme delicacy of the Instruments used In some experiment. The -Institute wants to locate in Washington, Professor Dunlap said, because the National Capital 1 b close to the geographic center of scientific America and because the excep tional facilities for reffarcb here."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "psychology  de arrment of <mark>Johns</mark> Hopkins universUv Utd until"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "psychology  de arrment of <mark>Johns</mark> Hopkins universUv Utd until"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [534.94, 271.83, 709.44, 672.78], "bbox_id": "866576c29b", "file": "AppomattoxNewspapers_1926-1933a_0331.pdf", "page": 1, "text": "Washington.The first step towam establishment in Washington i   tlotial research centet fm problem-  inman und animal psyeliologj arable In some ways to the lone. t standards, has been taken try  neorporation here of the National In finite ot Psychology, whose men.mer I ihlp Includes 5 of the foremost Atm- can experimental psychologists The Incorporators are Irot Ktncli  Dunlap, head ot the psychology de art ment of Johns Hopkins unlverslu Hid until a few weeks ago  1 h  IIvision it psychology ami atitlnopi., gy of the national research council.  Hugh 8 tmillUltlg. surgeon gen I rat of the United 8tats Public Health service, anti Dt Edwin E. Sins ton The charter autlmrtzes It to promote the application of scientific facts and principles to human and uni mnl life nnd welfare, The Intent, ns described by Proles  ior Dunlap, is to fount n tiutloo... I psychological laboratory, similar in  tome of Its ftini-thms to the bureau ot standards. lint not tinder federal on trol. Such a laboratory can be uwler a relatively permanent director amt can undertake programs of research roo lengthy, expensive and complit- d for other Instittithins. In such a laboratory truly c.-oper tflve results of the highest value can he obtained. Men wirklng In othtt laboratories on details ol the prob- tents undertaken In the .atlonal lab oratory could arrange to transfer ihjtr work there during leave of absence, or in summers. Work lone Here enn he subjected to criticism while In progress. Instead"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "de art ment of <mark>Johns</mark> Hopkins unlverslu Hid until"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "de art ment of <mark>Johns</mark> Hopkins unlverslu Hid until"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [323.3, 632.74, 481.09, 903.6], "bbox_id": "6619250fd9", "file": "AppomattoxNewspapers_1902-1905a_0459.pdf", "page": 1, "text": "Washington house, where she was joined by her son, the Rev. Laurence Washington, in 1043 . In that year he vacated the living of Purleigh, in Essex, which had been granted to him in 1032 . In 1050 mother and son both died, and were buried In the family vault at Brington. The two sons of the Rev. Laurence named John and Laurence emigrated with their sister Martha to Virginia, and Johns fcreat- grandson was George Washington. I shall not give the genealogical table of the familyIt had a ques- tloned link for some yearsbut the finding of severul wills, among them those of the three emigrants to Amer ica, has given proof to every link in the chain.  Washington house now is occupied by plain folks, laborers. Its internal structure has not been changed _ the quaint old staircase of oak lead to the bedroom where Robert and Elizabeth died so closely in time to each other. There are new wiudows, but not of plate glass. In the back yard an an cient pump appears which is as old os the house. Another and most pictur esque pump stands on the green. With Its thatched roof, overhung by a great"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Martha to Virginia, and <mark>Johns</mark> fcreat- grandson was George"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Martha to Virginia, and <mark>Johns</mark> fcreat- grandson was George"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1256.65, 605.27, 1418.43, 1053.66], "bbox_id": "48874d1127", "file": "AppomattoxNewspapers_1898-1902a_0689.pdf", "page": 1, "text": "Washington, D. G, Special. Lord Paunpefote, British ambassador to the United States, died at the embassy at 535 oclock A. M. The improvement which had been noted in his conditioi during the past week received a suddet check about 6 oclock, when it was no ticed that he was experiencing difficult In breathing. Df. Jung, his physician Was ilnmediately sent for, and he decldet upon a consultation with a local physic- igil in the meantime telegraphing fot Dr. Oslef, tìf Baltimore. In his steat came Dr. Thayer, of Johns Hopkins Uni versity, arriving about 2 oclock. Thi patients pulse was still good and whet Dr. Thayer left the embassy at 3 oclocl for Baltimore the Ambassador was rest ing so comfortably that a cablegram wa sent to his son-in-law, Mr. Bromley, ir London, that there was no immediati danger. Soon after 3 oclock a distinct weak ness of the heart developed and his pulse began to collapse. He died sc peacefully that It surprised even his phy- sieiafi, who feated that tbe asthmatic afi fection would prove troublesome whet the end came. Immediately upon being notified of the death of Lord Pauncefote, Secretary Hay went to the White House and, aftet a short conference with the President proceeded directly to the British embassy, where he made a formal call of condo lence as the personal representative ol the President, preliminary to the call oi the President himself. President Roosevelt drove to the Brit ish Embassy at 1 oclock, as soon as he had become disengaged from the cere monies attending the Rochambeau ex ercises. He was received in the draw- mg-room by the first secretary of the Embassy, Mr. Raikes, who now becomes British charge daffaires, and by some of the ladies of the household. The President expressed his deep sense of bereavement at the death of the Am bassador, not only in behalf of the gov ernment, but also for the people of the country, to whom Lord Pauncefote had become endtared in many ways"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "came Dr. Thayer, of <mark>Johns</mark> Hopkins Uni versity, arriving"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "came Dr. Thayer, of <mark>Johns</mark> Hopkins Uni versity, arriving"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [914.86, 370.29, 1077.12, 1131.43], "bbox_id": "5ae4510ae6", "file": "AppomattoxNewspapers_1902-1905a_0486.pdf", "page": 1, "text": "Washington, D. C., Special. Three warships will,soon be frowning on Monte Cristi, the most revolutionary port in Santo Domingo. The cruisers Detroit and Yankee, the latter with 200 marines, are already there, and the Newark has sailed from Guantanamo for that port. If the revolutionists reported as landing there two days ago make any dis turbances they are sure to feel the heavy hand of the American naval force. There is no secret of the Administra tions attitude that a revolution against Morales now is a revolution against the United States. Minister Dawson reports that the rea son for unrest which is favorable to revolutionary propagandas is that the Dominicans have heard that the United States Senate entirely rejecter the fiscal protectorate pratocol. Minister Dawson, President Morales and the American officers are doing their best to make the people all over the little republic aware of the new arrangement. The two men named by the United States to administer the customs of San to Domingo are Dr. W. E. Gould, of Baltimore, and Col. G. R. Colton, of Nebraska, who is Collector of Customs at Iloilo, P. I. Dr. Gould was suggested by Prof. J. H. Hollander, of Johns Hop kins University, Baltimore, who is to make a report to President Roosevelt on conditions in Santo Domingo. Consultations are being held daily be tween the President and Secretary of War Taft regarding the agreement be tween this country and Santo Domingo. The President belives, and has so ex pressed himself to many callers at the White House, that he has acted well within his executive power in conclud ing such an agreement with Santo Do mingo. He believes that his attitude and actions will receive the support of the Senate. He also is now firmly con vinced that, when the Senate convenes in extraordinary session next fall, the Santo Domingo  .city will be ratified. Both the President and Secretary Taft are inclined to question the right, of the Santo Domingo Improvement Company to receive the full amount of the 40,- 000 a mpnth from the customs receipts of the ports set apart for them under the arbitral agreement of last year. Pro fessor Hollander goes to Santo Domingo for the distinct purpose of investigating the claims of this company and also to examine carefully the fiscal affairs and prospects of the republic. His mission, it is explained at the W ar and State Departments, is radically different from that of Dr. Gould and Colonel Colton, who have been appointed to collect cus toms dues at Santo Domingo ports. Dr. Hollander is the agent of the United States Government and will report in detail the exact situation in the island. The Italian Ambassador, Signor May or des Planches, was an early caller at the State Department for the purpose of ascertaining definitely the arrangements recently reached by United States Minis ter Dawson, at Santo Domingo, for the administration of customs of the island. After the matter had been explained to him by Acting Secretary of State Adee Ambassador Planches was satisfied and said he would advise his Government to agree to the proposition and await the action of the United States Senate on the treaty next session. This re moves the last possible objection from foreign climates to the agreement."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "J. H. Hollander, of <mark>Johns</mark> Hop kins University, Baltimore,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "J. H. Hollander, of <mark>Johns</mark> Hop kins University, Baltimore,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1108.35, 562.24, 1263.07, 1216.98], "bbox_id": "22901982af", "file": "AppomattoxNewspapers_1898-1902a_0612.pdf", "page": 1, "text": "Washington, D. C., Special. The first step toward accepting Mr. Andrew Carnegies offer of 10,000,000 to the United States Government as an endow ment fund for the promotion of higher education was token here, when articles were filed with the Recorder of Deeds of the District of Columbia for the Car negie Institution. The incorporators are John Hay, Secretory of State, Edward D. White, Justice of the United States Supreme Court. Daniel Coit Gilman, late President of the Johns Hopkins University. Charles D. Walcott, superintendent of the Geological Survey. John S. Billings, ex-Surgeon-General of the Navy. Carroll D. Wright, Commissioner of Labor. The articles fix the name and title of the institution as the Carnegie Institu tion and show that it is organized  for a perpetual term. Its objects are the promotion of study and research, the power to acquire, hold and convey real estate and other property, and to estab lish general and special funds to as sist investigations in science, literature or art to co-operate with governments, universities, colleges, technical schools, learned societies and individuals to ap point committees of experts to direct special lines of research, publish and distribute documents, conduct lectures and hold meetings, acquire and maintain a library, and in general to do and per form all things necessary to promote the objects of said institution. The affairs, funds and property of the corporation will be in general charge of a board of trustees, to consist during the first year of 27, and thereafter not to exceed 30 members, except by a three- quarter vote of the board. . The filing of the papers followed a meeting in the offee of Secretary Hay, which was attended by all of the incor porators and Mr. Baker. It is assumed that from the legal action thus taken, Mr. Carnegie has removed the cause of the objection raised to the securities in which the 10,000.000 endowment was to be made on December 10, it being said that United States Steel Corpora tion bonds were the collateral. It was said that such securities in the posses sion of the United States, the income of which was used for the- promotion of education, might seriously embarrass the Department of Justice in the event of legal action being taken against combi nations or trusts. So Mr. Carnegie was informed their acceptance was impossi ble.  A few days later, Mr. Carnegie ap peared at the White House and dined with the President, after which it was announced Mr. Carnegie had decided to remove all grounds for objection. About the same tinie a sale of Steel Corpora tion securities amounting to about n,- 000,000 was reported in New York, and announced Mr. Carnegie had decided to this, in conection with Mr. Carnegies proposed donor was-the seller. Whether the new offer is in cash or some u n d  iluted bonds was not stated."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "late President of the <mark>Johns</mark> Hopkins University. Charles D."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "late President of the <mark>Johns</mark> Hopkins University. Charles D."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [956.15, 298.08, 1119.0, 1027.27], "bbox_id": "4526b43ad5", "file": "AppomattoxNewspapers_1902-1905a_0389.pdf", "page": 1, "text": "Washington, D. C. Special. I Henry C. Payne, Postmaster-General of the United States, a member of the National Republican Commit- I tee, a stalwart of his party, with the ! history of which, both in his home. State and nationality, he has been identified for many years, died at his apartments at the Arlington Hotel at 610 oclock Tuesday night, aged 60 I years. His death and its cause were announced in the following official bulletin issued by the attending phy sicians The postmaster-Gencral died at 610 P. M. He died peacefully with out a struggle. Cause of death, dis ease of mitral valve and dilation of th_ heart. P. M. RIXEY. G. LLO YD MAGRUDER. C. T. GRAYSON. Mr. Payne had been in pcor health for at least two years, but his last illness covered only seven days, an attack of heart trouble last week pre cipitating the end at a time when after a rest he seemed to have re- ! covered a small measure of his vital ity, impaired by years of arduous, la- 1 bor. Death came after nearly six I hours of unconsciousness. I The last official caller to inquire as to Mr. Paynes condition was Presi- ccnt Roosevelt, and he had been gone only about 10 minutes when the strick en member of the Cabinet expired, j secretary Hay had called at the Payne ! apartments a few -linutcs before the President made his visit. Neither j entered the sick room. As Mr. i Roosevelt was leaving, - about 6 i odock, he spoke feelingly of Mr. I Fayne to the newspaper men gath- I ered in front of the hotel as the I sweetest, most lovable and trustful  man I ever knew. The last day had been one during which practically all hope had been abandoned for sorne hours. The ap- I proach of dissolution began during j the noon hour, when the sick man  lost consciousness and no longer ree- 1 ognized those whom he had attempted  to cheer during his illness by saying 1 to them that he was all right. When  Mrs. Payne saw that the end was ! near she summoned Rev. Dr. Dunlap, i and at her request he read at the bed- i side of the dying man Psalm exxx,  Out of the Depths, and then re-  peated the prayers the Episcopal I Church provides shall be read at the- ! bed of those about to pass away. Funeral services will be held at St. I Johns Episcopal Church in this city I Friday morning, and at 315 in the afternoon the body will be taken to the Pennsylvania Railroad Station and placed aboard the private car of Presi dent A. J. Earling, of the Chicago, Milwaukee and St. Pa il Railroad, who j tendered the use of the car by tele- ! graph. The body should arrive at Milwaukee Saturday evening, and services will be held next Sunday evening at All Saints Episcopal Church there. A message has been sent to Rt. Rev. Isaac L. Nicholson, the Bishop of Milwaukee, who is now I at a convention in Boston, asking him j if he can officiate. L.terinent will be at the Forest Home Cemetery, Mil waukee. Mrs. Payne has expressed a desire that the services be as simple as possible."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "held at St. I <mark>Johns</mark> Episcopal Church in this"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "held at St. I <mark>Johns</mark> Episcopal Church in this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [634.51, 475.45, 963.95, 797.25], "bbox_id": "8a7ea9cedd", "file": "AppomattoxNewspapers_1905-1912a_0109.pdf", "page": 1, "text": "was the baptizer with the Holy Spirit I ind a clear, positive faith in Him- as j the Lamb of God, and Son of God John 133, 29, 34. But John was  lot perfect, he was human and when  lis active spirit was shut up in prison  loubts began to come, as they are so , likely to come to the man of intense I ictivity when he is obliged to sit still j nd wait cf. 1 Kings 193, 4. Many  find difficulty in reconciling Johns present questioning with his former tngs of all tilings are the beginning1  jlear faith but those who know men, if new things. When night ends, day, sven the mightiest men of God, and begins. When summer ceases, win ter Is upon us. The old year ends only to project its power or weakness into the new. Nothing is stationary. All things are fluid and progressive. The sure and final ending of this planet suggests that it was but the home and school room of human life In Its initial stages. When we leave It for a larger and greater world, on when It finally ceases to be there need1 De no regret nor undue alarm. Our considerations, in looking for-i ward, cause us to read into life as it Is the great truth that all things are by divine appointment working tow ard a great ethical and dramatic con clusion. In spite of the present popular tendency against church attendance, I believe that more people are truly, and thoughtfully religious than evfer Defore. It is bound t.o be so whenJ people become thoughtful. For then they must see that Now we have no"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "find difficulty in reconciling <mark>Johns</mark> present questioning with his"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "find difficulty in reconciling <mark>Johns</mark> present questioning with his"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1968.27, 1017.06, 2289.36, 1290.81], "bbox_id": "6ce9c6a25b", "file": "AppomattoxNewspapers_1933-1936a_0378.pdf", "page": 1, "text": "was going to school, and be had decided he could make a little extra money by raising song-birds. So he had bought two of them. He was Juat reaching out of the second- floor window, cage In hand, to hang Mr. Canary on a hook outsidewhen the canary Jinx went to work i T h is Canary W ould Seem to B e U nlucky. Zowlel Johns foot slipped, and out the window he shotl A second-floor clothes-line stopped his fall for a moment, and with one ind on the line, the cage In the other, and his feet on the distant window-sill John waited for Fate to make the next move. Fate didnt keep him waiting long. 8he snapped that rope, and John, bird-cage and canary, took another step toward Destiny. Wham! The-whole outfit dropped to earth! Another clothee-llne below had helped to break Johns fall, but, on chocking up, he found a sprained ankle and a cut hand. The canarys feathers were ruffled, and his feelings were hurt, but other wise he was as well as could be expected. John says he never let go of that cage for a second. . Well, sir, fohnny didnt blame the canary for that fall at first. He picked himself up and, grasping the cage, started painfully to climb the back stairs. And then what do you suppose happened? That doggone bird let Johnny think everything was all right, but Juat aa the boy reached the top step, the canary put tha finger on him again, and whaml Ha slipped and crashed head over heele down tho stairs. Bird-cage, bird and Johnny were in a sorry state when the man downstairs found them. . . . , . . . , __ . Johnny was out cold, and when he came to he found a big cut on hla head about a mile long, and bruises from head to foot. Tho onnnrv had survived again, but had lost an eye. And. this made him"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "e U nlucky. Zowlel <mark>Johns</mark> foot slipped, and out"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "e U nlucky. Zowlel <mark>Johns</mark> foot slipped, and out"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [477.06, 1256.95, 637.95, 1362.77], "bbox_id": "19361f3bb6", "file": "AppomattoxNewspapers_1912-1915a_0252.pdf", "page": 1, "text": "Was Father Of Professor Renouf, Of Johns Hopkins. Keene, N. H.Rev. Dr. Edward Augustus Renouf, rector emeritus of St. James Episcopal Church, died here, aged 95 years. Dr. Renouf, was one of the oldest alumni of Harvard, from which he was graduated in 1838. He is survived by a son, Dr. Edward Renouf, professor of chemistry at Johns Hopkins University."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Of Professor Renouf, Of <mark>Johns</mark> Hopkins. Keene, N. H.Rev."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Of Professor Renouf, Of <mark>Johns</mark> Hopkins. Keene, N. H.Rev."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [380.92, 760.24, 2541.73, 838.23], "bbox_id": "2a2a4766a0", "file": "AppomattoxNewspapers_1908-1909a_0569.pdf", "page": 1, "text": "Warning was given 18 monthsohfiikr f c t F f r   G -  indhufacturing arfljmLMr- JRlW -DrOduchaiMlliPSdte?. 11 its, Alpha. Johns wasirivn 6 partmsfit has inteiTreted this m M M monks and 50 fineton sete  -r- a5f ing afdnt ipiri. , prestqh    Wopdinjg v6i 6 ,montn, her honorf and 100 fine for maufactur"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "DrOduchaiMlliPSdte?. 11 its, Alpha. <mark>Johns</mark> wasirivn 6 partmsfit has"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "DrOduchaiMlliPSdte?. 11 its, Alpha. <mark>Johns</mark> wasirivn 6 partmsfit has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.89, 387.92, 1913.88, 1271.96], "bbox_id": "c7ab68a52d", "file": "AppomattoxNewspapers_1915-1918a_0493.pdf", "page": 1, "text": "ware to have no communication with any prisoners aboard, didnt you? I was not aware that Miss Car rington was considered a prisoner. Well, whether she Is or not, she Is no longer to be bothered with your at tentions, with no attempt to control his temper. I consider that you have broken your word. You will go back to your stateroom, and stay there. Supposing I refuse?, He grinned, exposing his teeth like a great cat. I wouldnt advise you to try that, he sneered, for there Is crew enough on deck to man-handle you to a finish. You can go In quietly, or Ill call them down, and have you thrown In.  So take your choice. I looked at the two of them, eager enough myself to make It a fight. Yet what was the use? Any excuse en abling him to confine me more closely would evidently be to his advantage. I conquered myself, and hands clinched, crossed the deck space, and entered my stateroom, dosing the door. I heard McCann laugh, and say some thing to Simms then I knew he crossed the cabin, nnd went up the stairs.. To better control myself I thrust my face out through the open port, breathing In tlse salty freshness of the air. Suddenly I became aware that others had entered the-main cabin. There was no sound of voices nothing to tell me the purpose of this Invasion, yet I felt certain that, at least, a dozen men had descended the steps from the compan ion. I stood erect listening there was fumbling at my door! Had McCann changed his mind? Were they about to attack me In force? Revolver in hand took a step forward, half-ready to welcome any open hostility, The first sea rat to open that door, called, will get whats coming to him. There was a mocking laugh In an swer, In which more than one velce joined then White growled reply No one is a cornin In, mister an damn me, if youre goln ter get out. I grasped the knob, throwing my whole weight against. the wood. It ielded scarcely half an inch, just enough to reveal a stout bar. This time 1 was a prisoner beyond donbt they had left me no loophole of escape. But why? What had I done to warrant them in breaking their pledge? Could It be that McCann had no further use for me? no desire for another observa tion? If this wa true, then It must be the men proposed deserting the ship that very night, and taking a chance at getting ashore in one of those northern bays. And they had nailed me In to die like a rat In this hole, when the Indian Chief went down. For the Instant, as this fear gripped me, I was dazed and incapable of thought helpless to even clearly com prehend the full horror, I do not be lieve It was my own situation which so completely unmanned me, but the remembrance of Vera. What would become of her? She would be alone In McCanns power without a human be ing to whom she could appeal. She would be forced Into the boat despite her struggles, laughed at, and mocked. She might even be compelled to wit- ness the slow staking of the ship carry lng us down Into the depths. And then what? The vision I conjured up was agony, and I sank back upon the stool, my face buried in my hands. It is not even yet clear in my mind how the remaining hours of that after noon passed. I was conscious only of a mad, Impotent rage. Wild schemes flashed through my brain, only to fall 6f execution. There could be only one reason for McCanns actiondesertion of the ship, that same night If the mutineers were really, as pretended, Intending to land their boats In the harbor of St. Johns, they would re quire my services for at least another"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "the harbor of St. <mark>Johns</mark>, they would re quire"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "the harbor of St. <mark>Johns</mark>, they would re quire"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1096.1, 1244.4, 1208.25, 1464.68], "bbox_id": "35126f734e", "file": "TimesVirginian_1983a_0110.pdf", "page": 1, "text": "WANTED Information needed for a hook  1 . Hie where-abouts of anyone kin to Miss Anna Deane Johns. 2 . Old photographs of Miss Deane Johns, any of her family or her house. 3 . Inf. on the Johns family, Adams family, Duval family, or family of John T. Davis. Anyone having information on toes families or having any old photographs of them or any rid photographs of Mt. Comfort please call Richard L. Guild  352-7950. 774-14-ltc"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "to Miss Anna Deane <mark>Johns</mark>. 2 . Old photographs of"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "to Miss Anna Deane <mark>Johns</mark>. 2 . Old photographs of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [272.15, 240.52, 415.3, 626.11], "bbox_id": "a9880d3689", "file": "AppomattoxNewspapers_1974-1975a_0309.pdf", "page": 1, "text": "Walter Beaver Murphy, 88, of 2315 Fairview Ave., Lynch burg, died at 607 a.m. Sunday j in St. Johns Nursing Home j after a long illness. He was the husband of the late Elmira Hamlett Murphy. Born in Pittsylvania County, he was a son of the late Stephen Booker and Minerva Jane Murphy. He was the retired owner of W. B. Murphy Plumbing and Heating Inc., and was a member of Fairview Christian Church. He is survived by five sons, Harris R. Murphy of Binghamp- ton, N.Y., Binford W. Murphy of Hampton, Stephen B. Murphy of West Palm Beach, Fla., Calvin H. Murphy of San Diego, Calif., and Raymond H. Murphy of Lynchburg two daughters, Mrs. Ethel M. Rice of Washington, D.C. and Mrs. Janie M. Hummer of Bethesda, Md. a brother, Fitz L. Murphy of Appomattox two sisters, Mrs. Walter Parker of Roanoke and Mrs. Kate Carter of Danville 10 grandchildren and six great-grandchildren. Funeral services were con ducted at 3 p.m. Tuesday at Whitten Park Avenue Chapel. Burial was in F o rt Hill Memorial Park."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Sunday j in St. <mark>Johns</mark> Nursing Home j after"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Sunday j in St. <mark>Johns</mark> Nursing Home j after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [645.09, 1016.9, 800.99, 1121.25], "bbox_id": "4ca441e27c", "file": "AppomattoxNewspapers_1915-1918a_0396.pdf", "page": 1, "text": "Walker, Johns n,Samuel Boyd, Johnson, Samuel, tocUoy, Al bert, McCoy, Hunter Marshall, McCoy, Yancy, McCoy, Um- pbry, Iankey, John Nelson, Robertson, Wood Reed, Robert son, Feager, Stephens, John Elia, Sweeney, Charles Spur geon"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Walker, <mark>Johns</mark> n,Samuel Boyd, Johnson, Samuel,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Walker, <mark>Johns</mark> n,Samuel Boyd, Johnson, Samuel,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.51, 833.02, 1912.5, 1060.05], "bbox_id": "e20c62f3e3", "file": "AppomattoxNewspapers_1892-1898a_0055.pdf", "page": 1, "text": "W recks. There was a freight wreck on the Norfolk and Western Railroad at Spout Springs, five miles .west of this place, June 5th, caused by a broken frog. Seven cars were de railed The damage tf both cars and track was slight. No one was huri,aiid only a . few hours were con sumed in clearing the track. A car was derailed at this place yesterday while being lowered at the eastern crossing of the Norfolk and Western Railroad. Jno. Johns, col ored employe at the depot, who was manipulating the break, found after the car was under good headway, that the air would not work, hence the wreck."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "and Western Railroad. Jno. <mark>Johns</mark>, col ored employe at"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "and Western Railroad. Jno. <mark>Johns</mark>, col ored employe at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1382.39, 631.41, 1525.41, 680.8], "bbox_id": "8f1d6f537d", "file": "AppomattoxNewspapers_1947-1949a_0076.pdf", "page": 1, "text": "W R- L. Kirschbaum, of Balti- L is a patient in Johns Hopkins j ipital Mrs. Kirschbaum is thej daughter of Mrs. Jennie John-j and has often visited here."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "W R- L. Kirschbaum, of Balti- L is a patient in <mark>Johns</mark> Hopkins j ipital Mrs. Kirschbaum is thej daughter of Mrs. Jennie John-j and has often visited here."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "W R- L. Kirschbaum, of Balti- L is a patient in <mark>Johns</mark> Hopkins j ipital Mrs. Kirschbaum is thej daughter of Mrs. Jennie John-j and has often visited here."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [854.15, 736.1, 1314.18, 811.6], "bbox_id": "82f0b0b6f7", "file": "AppomattoxNewspapers_1922-1923a_0343.pdf", "page": 1, "text": "W P VENABLE. President. J. F. CONNALLVice-President.. L. MORRIS WAR J t i atson R- L. Franklin W. C. Franklin -. 1 F. H. Lukin w. B. Bipford N. P. Gatling 1  ------------ - - ------------- ---- - ---- - -------- - -------------  JOHN JOHNS TO N SO RIAL AR TIST"}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "P. Gatling 1  ------------ - - ------------- ---- - ---- - -------- - -------------  JOHN <mark>JOHNS</mark> TO N SO RIAL"}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "P. Gatling 1  ------------ - - ------------- ---- - ---- - -------- - -------------  JOHN <mark>JOHNS</mark> TO N SO RIAL"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [622.81, 816.36, 665.86, 825.36], "bbox_id": "8e34369bbd", "file": "AppomattoxNewspapers_1898-1902a_0043.pdf", "page": 1, "text": "W. Johns."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "W. <mark>Johns</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "W. <mark>Johns</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.71, 1567.66, 1989.77, 1711.95], "bbox_id": "16e53215e0", "file": "AppomattoxNewspapers_1918-1922a_0038.pdf", "page": 1, "text": "W e stand b y o u r R oofs We dont sell you merely roofing, we sell roofing service. The roofing you buy must make good or we will. Thats why we offer you Jo h n s - M a n v iU e R e g a l R o o fin g It is backed by 60 years of Johns-Manville Responsibility. You may register it with Johns-Manville by means of a special regis tration blank furnished with each roll of roofing  and Johns- Manville will see that it gives exactly the sendee Johntr-Manville promises, Let us quote you prices."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "roll of roofing  and <mark>Johns</mark>- Manville will see that"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "roll of roofing  and <mark>Johns</mark>- Manville will see that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1175.49, 831.18, 1332.91, 903.22], "bbox_id": "5d3af67726", "file": "AppomattoxNewspapers_1898-1902a_0021.pdf", "page": 1, "text": "W e buy all kinds o f COUNTRY PRODUCE and pay b est m arket prices. Ship us your PO ULTRY and EGGS, w ill alw ays do the b est w e can fo r you, call to see us, and get onr p rices, .dont forget th e place, nor the boys, w e are alw ays ready to serve you. Y ours tru ly. THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "tru ly. THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "tru ly. THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1113.37, 1046.72, 1270.54, 1121.19], "bbox_id": "d694ad0858", "file": "AppomattoxNewspapers_1898-1902a_0034.pdf", "page": 1, "text": "W e b u y a ll k in d s o f CO U X TRY PRO OTIC  an d p ay b e st m a rk e t p rices. Ship u s yo i P O U L T R Y am i EGGS, w ill alw ay s io the b e st w e can fo r y o u , call to see us, am i get o u r prices, d o n t fo rg e t th e place, n o r tin boys, w e a re alw ay s read y to serv e you. Y ours tru ly . __ THE TWO JOHNS."}, "highlight": {"text": {"matched_tokens": ["JOHNS"], "snippet": "tru ly . __ THE TWO <mark>JOHNS</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["JOHNS"], "snippet": "tru ly . __ THE TWO <mark>JOHNS</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [571.93, 350.63, 729.22, 372.88], "bbox_id": "5775f7b496", "file": "AppomattoxNewspapers_1898-1902a_0368.pdf", "page": 1, "text": "W. D. Johns spent a tew days with CapL T. W. Johns this week."}, "highlight": {"text": {"matched_tokens": ["Johns", "Johns"], "snippet": "W. D. <mark>Johns</mark> spent a tew days with CapL T. W. <mark>Johns</mark> this week."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns", "Johns"], "snippet": "W. D. <mark>Johns</mark> spent a tew days with CapL T. W. <mark>Johns</mark> this week."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.09, 331.14, 1794.92, 352.68], "bbox_id": "87133245ac", "file": "AppomattoxNewspapers_1898-1902a_0367.pdf", "page": 1, "text": "W. D. Johns spent a few days with Gapt. r. W. Johns this week,"}, "highlight": {"text": {"matched_tokens": ["Johns", "Johns"], "snippet": "W. D. <mark>Johns</mark> spent a few days with Gapt. r. W. <mark>Johns</mark> this week,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns", "Johns"], "snippet": "W. D. <mark>Johns</mark> spent a few days with Gapt. r. W. <mark>Johns</mark> this week,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [623.97, 397.41, 783.66, 2012.5], "bbox_id": "3a5e7efd3f", "file": "AppomattoxNewspapers_1898-1902a_0320.pdf", "page": 1, "text": "W a s h i n g t o n , D C D v - Talmage 1 now traveling in Norway, where he has been deeply interested in the natural phe nomena and the quaint social life of that wonderful land. In this sermon he ar gues, contrary to the opinion of many, that religion is an active principle which works constantly for the welfare of body end mind and soul. His text is Luke xiv, 84, Salt is good. The Bible is a dictionary of the finest similes. It employs among living creat ures storks and eagles and doves and uni corns and sheep and cattle among trees, sycamores and terebinths amd pomegran ates and almonds and apples among jew els, pearls and amethysts and jacinths and chrysoprases. Christ uses no stale illustrations. The lilies that He plucks in His discourse are dewy fresh the ravens in His discourses are not stuffed specimens of birds, hut warm with life from wing tip to wing tip the fish He points to are not dull about the gills, as though long cap tured. but a-squirm in the wet net just brought up on the beach of Tiberias. In my text, which is the peroration of one of His sermons, He picks up a crystal and holds it before His congregation as an illus tration of divine grace in the heart when He says what wc all know by experiment, Salt is good. I shall try to carry out the Saviours idea in this text and in the first place say to you that grace is like salt in its beauty. In Gallicia there are mines of salt with ex cavations and underground passages reach ing, I am told, 280 miles. Far underground there are chapels and halls of reception, the columns, the altars and the pulpits of salt. W hen the king and the princes come to visit these mines, the whole place is illuminated, ami the glory of crystal walls and crystal ceilings and crystal floors and crystal columns, under lie glare of the torches and the lamps, needs words of crys tal to describe it. But you need not go so far as that to find the beauty of salt. You live in a land which produces millions of bushels of it in a year, and you can take the moruing rail train and in a few hours get to the salt mines and salt springs, and you have this article morning, noon and night on your table. Salt lias all the beauty of the snowflake and water foam, with durability added. It is beautiful to the naked eye, but under the glass you see the stars, and the diamonds, and the white trie branches, and the splinters, and the bridges of fire as the sun glints them. There is more architectural skill in one of these crystals of salt than human inge nuity has ever demonstrated in an Alham bra or St. Peters. It would take all time, with an infringe ment upon eternity, for an angel of God to tell one-half the glories in a salt crystal. So with the grace of God it is perfectly beautiful. I have seen it smooth out wrin kles of care from the brow I have seen it make an aged man feel almost young again I have seen it lift the stooping shoulders and put sparkle into the dull eye. Solomon discovered its therapeutic quali ties when he said. It is marrow to the hones. It helps to digest the food and to purify the blood and to calm the pulses and quiet the spleen, and instead of Tyn dalls prayer test of twenty years ago, put ting a man in a philosophical hospital to be experimented upon by prayer, it keeps him go well that he does not need to be prayed for as an invalid. I am sneaking now of a healthy religionnot of that morbid relig- iop that sits for three hours on a grave stone reading Herveys Meditations Among the Tombsa religion that pros pers best in a bad state of the liver! I speak of the religion that Christ preached. I suppose, when that religion has con quered the world, that disease will be ban ished, and that a man 100 years of age will come in from business and say, I am tired I think it must be time for me to go. and without one physical pang heaven will have him. But the chief beauty of grace is in the soul. It takes that which was hard and cold and repulsive and makes it all over again. It pours upon ones nature what David calls the beauty of holiness. It extirpates everything that is hateful and unclean. If jealousy and pride and lust and worldliness lurk about, they are cliaiued and have a very small sweep, Jesus throws upon the soul the fragrance of a summer garden as He comes in say ing, I am the Rose of Sharon, and He submerges it with the glory of a spring morning, as He Says, I am the light. Oh, how much that grace did for the three Johns! It took John Bunyan, the foul mouthed, and made him John Bun. van, the immortal dreamer it took John Newton, the infidel sailor, and in the midst of the hurricane made him cry out, My mothers God, have mercy upon me! It took John Summerfield from a life of sin and by the hand of a Christian maker of edge tools led him into the pulpit _ that butns still with the light of that Christian eloquence which charmed thousands te the Jesus whom He once despised. Ab, you may search all the earth over for anything so beautiful or beautifying as the grace of God! Go all through the deep mine pas sages of Wieliczka and amid the under ground kingdoms of salt in Hallstadt and how me anything so transcendently beau tiful as this grace of God fashioned and hung in eternal crystals. Again, grace is like salt in the fact that it is a necessity of life. Man and beast perish without salt. What are those paths across the western prairie? Why, they were made there by deer and buffalo going to and coming away from the salt licks. Chemists and physicians all the world over tell us that salt is a necessity of life. And so with the grace of God you must have it or die. I know a great many speak of it as a mere adornment, asort of shoulder strap adorning a soldier, or a light, froth ing dessert brought in after the greatest part of the banquet of life is over, or a medicine to be taken after powders and mustard plasters have failed to do their work, but ordinarily a mere superfluity, a string of bells around a horses neck while he draws the load and in nowise helping him to draw it. So far from that I declare the grace of God to be the first and the last necessity. It is food we must take or starve Into an eternity of famine. It is clothing, without which wo freeze to the mast of infinite terror. It is the plank, and the only plank, on which we can float shoreward. It is the ladder, and the only ladder, on which we can climb up into the light. It ij a postive necessity for the soul. You can tell very easily what the effect would be if a person refused to take salt into the body. The energies would fail, the lungs would struggle with the air, slow fevers would crawl through the brain, the heart would flutter, and tne life would be gone. Salt, a necessity for the life of the body the grace of God, a necessity for the life of the soul! Again, I remark that grace is like salt in abundance. God has strewn salt in vast profusion all over the continents. Russia seems built on a salt-cellar. There is one region in that country that turns out 90,000 tons of salt in a year. England and Russia and Italy have inexhaustible resources in this respect. Norway and Sweden, white with snow abdve, white with salt beneath. Austria, yielding 900,000 tons annually. Nearly all the nations rich in itrock salt, spring salt, sea salt. Christ, the Creator of the world, when He uttered our text, knew it would become more and more significant as the shafts were sunk, and the springs were bored, and the pumps were worked, and the crys tals were gathered. So the grace of God is abundant. It is for all lands, for all ages, for all conditions. It seems to undergirt everythingpardon for the worst sin, com fort for the sharpest suffering, brightest light for the thickest darkness. Around about the salt lakes of Saratov there are 10,000 men toiling day and night, nd yet they never exhaust the saline treas ures. And if the 1,600,000,000 of our race should now cry out to God for His mercy there would be enough for allfor those furthest gone in sin, for the murderer standing on the drop of the gallowB. It is an ocean of mercy, and if Europe and Asia, Africa, North and South America, and all the islands of the sea went down in it to-day they would have room enough to wash and come np clean. Let no man think that his case is too tough a one for God to act upon. Though your 8 in may be deep and raging, let me tell you that Gods grace is a bridge not built on earthly piers, but suspended and spanning the awful chasm of your guilt. One end resting upon the rock of eternal promises and tne other on the foundations of heaven. Demetrius wore a robe so in- crusted with jewels that no one after him ever dared to wear it. Bnt our Ring, Jesus, takes off the rebe of His righteousness, a robe blood dyed and heaven impearled, and reaches it out to the worst wretch in all the earth and says Pnt that on! Wear it now! Wear it forever! Again, the grace of God is like salt ia the way we come at it. The salt on the surface is almost always impurethat which incruits the Rocky Mountains and"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "did for the three <mark>Johns</mark>! It took John Bunyan,"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "did for the three <mark>Johns</mark>! It took John Bunyan,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1373.73, 982.92, 1689.15, 1369.02], "bbox_id": "da8a8e7709", "file": "AppomattoxNewspapers_1898-1902a_0711.pdf", "page": 1, "text": "W. A. Miller  Son1. l.te,t   t ftoc T e io  triI lloe.oe.eed.i.w lfertU i.enr  -g M -i poeod. were rolled lout on the office floor by Mr. Harvey 1blara Harvey, of Lynchburg, ftnd if we haTe raised such siting her brother, Mr. J. R. I red globes we would feel like oon- kl here last week. I t,eatiug for the prize at every fair in 8. A. Harvey and Mr. J. E. I Virginia. The sweetB weighed 7 J of .Crewe, are visiting at I pounds each. Now, whats the use J. Harveys. I of croaking about thin land ? If you . . . . .  j,- I will only go down and mix up a lit- kmght of the road, alias ho- U,J 8 , , . . . ... L. . . , I tie of our red clay sub-soil with the lias tramps, spent last bun- uc VL uu . . . . .  ... p,  . . - I grey top-soil, which has been lightly rht m our town. I6 J . . .. . .. plowed ever since the surrender, the lessor Hill, of the Naval Ob-1 0f 0jd Appomattox will pro- ry, Washington, D. 0., is bisI j uce prjze winners in many classes. muting in our coupty. I ... t . I Liberty Church gave more money Xa Moon, of Lynchbxrg, is j  mjg8jollg Jtjgt year than any other g Jhet graiulmother, M rs. L. C. I cjUrc jn the Appomattox Associa- f, wljo re-nSes near Anderson sL jonuamey, the handsome sum of 480. This year she wishes to give t. W. H Trent ml wife, of 500. Each member has received ke, Mr. V. D. Johns and wife.six envelopes, and it is hoped that rnchbnrg, are gnes s of Uupt.leacb oue will pat something in I. Jolni.  leach envelope. The times for these I . , .1 u ...  M-a  envelopes to come back are as fol- ke report of the Woman Mis-1- r . . ..   . . ...  bws MinisterialEducation. Octo- tv Meeting held last we-, k was I  . . .  r , , - her 1, 1J02 Home Missions, De- red too late for publication ml  ...  Y ,, icember 21, 1902 State Missions, ee  s piper.  February 15, 1908  Foreign Mis- irs- John W. Carroll, M, ,,nJ  sjon8 April 19,1903 Sunday-school C. A. H. Leys, and Mr. llol- aud Bible Board Jnne 2 1903 and Cairoll spent Monday at the slinigterg Relief Fund, July 5,1903"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "ke, Mr. V. D. <mark>Johns</mark> and wife.six envelopes, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "ke, Mr. V. D. <mark>Johns</mark> and wife.six envelopes, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [583.45, 466.06, 739.98, 487.56], "bbox_id": "465265b297", "file": "AppomattoxNewspapers_1898-1902a_0422.pdf", "page": 1, "text": "W. 1. Johns was visiting his fa ther CaptuiQ 1 . W. Johns Sunday."}, "highlight": {"text": {"matched_tokens": ["Johns", "Johns"], "snippet": "W. 1. <mark>Johns</mark> was visiting his fa ther CaptuiQ 1 . W. <mark>Johns</mark> Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns", "Johns"], "snippet": "W. 1. <mark>Johns</mark> was visiting his fa ther CaptuiQ 1 . W. <mark>Johns</mark> Sunday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1775.99, 421.23, 1850.52, 443.47], "bbox_id": "6fd90f0822", "file": "AppomattoxNewspapers_1898-1902a_0421.pdf", "page": 1, "text": "W. 1. Johns a ther Captain T."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "W. 1. <mark>Johns</mark> a ther Captain T."}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "W. 1. <mark>Johns</mark> a ther Captain T."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.49, 388.29, 1618.07, 442.14], "bbox_id": "fb63040d03", "file": "AppomattoxNewspapers_1915-1918a_0491.pdf", "page": 1, "text": ".von showed forged PPers 100, that Was easy enough, you we-nosed I was such a fool as ii yuT We ttre 0VgJ Johns to Liverpool wttli a  st The fellow swal- Iscellaneous cargo."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "yuT We ttre 0VgJ <mark>Johns</mark> to Liverpool wttli a"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "yuT We ttre 0VgJ <mark>Johns</mark> to Liverpool wttli a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1391.5, 1106.85, 1510.44, 1273.9], "bbox_id": "104115a5d4", "file": "AppomattoxNewspapers_1908-1909a_0313.pdf", "page": 1, "text": "visited L D. Johns Lynchburg last week, r M. Thompson is in Iton at the bedside oi lather. key Evans has return- Eharlottesville, after I several days at the Blrs. C. W. Smith. lizabeth Wagner, who I spending some time parents. Mr. and Mrs."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "visited L D. <mark>Johns</mark> Lynchburg last week, r"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "visited L D. <mark>Johns</mark> Lynchburg last week, r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1833.6, 314.93, 2002.95, 467.6], "bbox_id": "4cbc8e424c", "file": "AppomattoxNewspapers_1939-1943a_0336.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of thé Cir cuit Court of Appomattox County, on the 12th day of August, 1941. Commonwealth of Virginia, Plaintiff Against William E. Lewis, Jack Burchett, Nancy Coleman Davenport, Mary Ray, Annie Kimbrough, Mary John son, Opal Johns an, and the. un known heirs of Napofeon Johnson, decd., Defendants. Tae object of this suit is to sell a certain tract of real estate in Stonewall District of Appomattox County, Va., standing in the name of Napoleon Johnson, tor the pay-"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Mary John son, Opal <mark>Johns</mark> an, and the. un"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Mary John son, Opal <mark>Johns</mark> an, and the. un"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1942.55, 390.73, 2424.99, 624.63], "bbox_id": "f37219e42c", "file": "AppomattoxNewspapers_1952-1954a_0267.pdf", "page": 1, "text": "VIRGINIA BANKERS SET DATE FOR THEIR ANNUAL CONVENTION This Hello Readers! And right off the press news of our Physical Educa tion Demonstration and Fashion Revue, which was a memorable spec tacle. There were such features as the uniformed gym outfits, every girl in unison for the calisthenics and giant circle Seraentine with 80 girls many stunts and pyra mids and the Dance section. The story of the Dance concerned sailors who were boarding their ship, the Seven Ses. Before boarding the gangplank, they do their drill, then are off. Sailors were Ann Lawing, Frances Megginson, Sarah Watkins, Clarabelle Minni- field, Viola Johnson, Bernice Dill ard, Josephine Johns, and Hazel"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Bernice Dill ard, Josephine <mark>Johns</mark>, and Hazel"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Bernice Dill ard, Josephine <mark>Johns</mark>, and Hazel"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [539.45, 297.98, 701.3, 853.47], "bbox_id": "f97d1dc882", "file": "AppomattoxNewspapers_1926-1933a_0034.pdf", "page": 1, "text": "Vincennes, Ind.The city of Vin cennes has just taken the first formal action for purchase of part of the site of old Fort Sackville, In the pass age of an ordinance by the city coun cil, under suspension of the rules, for the issuance of 40,000 of bonds with which to make the purchase. Several weeks ago the Vincennes citizens leading in the movement for the George Rogers Clark sesqulcen- tenuial obtained options on the prop erty for the city of Vincennes. Mayor Claude Gregg and his board of public works has now ordered the options closed, and notice has been given to the owners that the purchases will be consummated. Tiie property to be bought by the city of Vincennes includes the Emi- son warehouse at First and Vigo streets and all the property of the same depth between Vigo and Barnett streets, Including the St. Johns hotel. As soon as the city acquires the titles to the property, the buildings will be razed, and the ground pre pared for beautification. Tiie George Rogers Clark sesqui centennial commission, headed by William Fortune of Indianapolis, Is planning for the sesquicentennial ob servance of the capture of Fort Sack- ville by George Rogers Clark, in 1928 and 1929, as the major part of its program for observance of the one hundred fiftieth anniversary of the conquest of tiie old northwest terri tory by Clark. Capture Came aa Climax. The capture of the fort at Vin cennes was the great heroic and Im portant military event of the whole revolution west of the Allegheny mountains. It was the climax of the campaign led by Clark which shat tered British control of the region north of the Ohio river. It Is the purpose of the commis sion to purchase the remainder of the old fort site, and the erection thereon of the national memorial to Clark. Other plans of the commission pro vide for a historical pageant portray ing the Important events of the Clark campaign, as well as early pioneer life, and for celebrations at other places in Indiana, Ohio, Kentucky and Illinois where events of the Clark expedition occurred."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "streets, Including the St. <mark>Johns</mark> hotel. As soon as"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "streets, Including the St. <mark>Johns</mark> hotel. As soon as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [537.6, 290.61, 699.07, 846.8], "bbox_id": "84693f88de", "file": "AppomattoxNewspapers_1908-1909a_0034.pdf", "page": 1, "text": "Vincennes, Ind.The city of Vin cennes has Just taken the first formal action for purchase of pari of the site of old Fort Sackville, in the pass age of an ordinance by the city .coun cil, under suspension of the rules, for the issuance of 40,000 of bonds with which to make the purchase. Several weeks ago the Vincennes lending in the movement for the George Rogers Clark sesqulcen- tennial obtained options on the prop erty for the city of Vincennes. Mayor Claude Gregg and his board of public works has now ordered the options dosed, and notice has been given to the. winters that the purchase will be consummated. The property to be bought by the city of Vincennes Ind udes the Eml- son warehouse at FIrkt and Vigo streets and all the property of the same depth between Vigo and Barnett streets, including the St. Johns hotel. As soon as the city acquires the titles to the property, the buildings will be razed, and the gronnd pre pared for beautification. Tlie George Rogers Clark sesqtit- centenniai - commission, headed by William Fortune of Indianapolis, Is planning for the sesqulcentennlal ob servance of the capture of Fort Sack vine by George Rogers Clark, in 1928 and 1929, as the major part of Its program for observance of the one hundred fiftieth anniversary of tlie conquest of the old northwest terri tory by Clark. Capture Came as Climax. The capture, of the fort at Vin cennes whs the great heroic and im portant military event of the whole revolution west of the Allegheny mountains. It was tlie climax of the campaign led by Clark which shat tered British control of the region north of the Ohio, river. It Is the purpose of the commis sion to purchase the remainder of the old fort site, and the erection thereon of the national memorial to  Clark. Other plans of the commission pro vide for a historical pageant portray ing the Important events of the Clark campaign, as well as early pioneer lifeand for celebrations at other places in Indiana, Ohio, Kentucky and Illinois where events of the Clark expedition occurred."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "streets, including the St. <mark>Johns</mark> hotel. As soon as"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "streets, including the St. <mark>Johns</mark> hotel. As soon as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1705.44, 1260.9, 1867.7, 1317.9], "bbox_id": "7c8d374723", "file": "AppomattoxNewspapers_1922-1923a_0559.pdf", "page": 1, "text": "Vestry Of Church In Which Patrick Henry Spoke Sends Protest. Richmond, Va. Special. In ac- i cordance with the action of the ves- I try of St. Johns Church, the his- I toric building in which Patrick Henry"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "I try of St. <mark>Johns</mark> Church, the his- I"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "I try of St. <mark>Johns</mark> Church, the his- I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [228.24, 1611.5, 560.69, 1717.49], "bbox_id": "af997ad0b6", "file": "AppomattoxNewspapers_1912-1915a_0484.pdf", "page": 1, "text": "Very sound indeed. It is itom old Buckingham where good I the man who keepa coal that emerges thing fie mostly grow aad raised by I most triumphantly from the crisis Mrs. B B. Johns. I end difficult positions that confront rumors fill the air as tojjnoat people at intervals on theii j aspirants for oonnty offices for t h  through life. Endeavor not to ooming 4 o rears. 1 am not autho Sto ried  endeavor In moments nsed to name candidate but am  m e n t to your m told that-tha wood may be full o il c7 in ."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "crisis Mrs. B B. <mark>Johns</mark>. I end difficult positions"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "crisis Mrs. B B. <mark>Johns</mark>. I end difficult positions"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.97, 1340.96, 2145.8, 1763.91], "bbox_id": "a02bb1f40d", "file": "AppomattoxNewspapers_1933-1936a_0114.pdf", "page": 1, "text": "Vera Vera, Sept. 5.- Miss Daisy Rob ertson spent the week end with her home people. Mr. and Mrs. Abbitt Woolridge, and children, ,of Winch ?st-, and Mrs. Leslie Coleman and sons spent Saturday with Mr. and Mrs. Walk er Carnefix. Mrs.George Robertson 1 returned home Saturday after spending a week with her daughter, Mrs. Hil da St. Johns. Mrs. Rawlings Scruggs is visiting her brothers, Laton and Lawrence, Hatcher. Mrs. George Toddy and children have returned ito Richmond after visiting frineds and relations in this communnty. Mr. and Mrs. C. T. St. Johns of Lynchburg are all smiles, over a baby girl. Mrs. Homer Reynolds and Mrs. JeffKinney spent Saturday in Lyn chburg. Hubert JCarnefix, of Richmond spent the week end in this neiigh- borhood. The writer is glad to hear that Mrs. Jessie Reynolds is improving. The community is glad to hear that Mrs. Jim Harvey is getting a- long nicely. Bob Bryant, of Bluefield is visit ing his brother, Ruben Bryant. Mr. and Mrs. Clarence Beale, of Buckingham, visited Mr. and Mrs. Willie Qeale Monday. Johnnie Thornhill has returned to Ohio after spending two weeks with his home people. , ,"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Mrs. Hil da St. <mark>Johns</mark>. Mrs. Rawlings Scruggs is"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Mrs. Hil da St. <mark>Johns</mark>. Mrs. Rawlings Scruggs is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [559.68, 338.77, 727.19, 639.91], "bbox_id": "4b0bf903ef", "file": "AppomattoxNewspapers_1949-1952a_0532.pdf", "page": 1, "text": "ver. The Seniors took their long-await ed trip to the General Assembly, Friday February 8th. The group was composed of 23 seniors and Miss Mattie Hicks as Chaperone and the the Instructor of the Government Class, Mr. J. H. Clay. Some of the places that they visited besides the General Assembly were the Valen tine Museum, St. Johns Church. Union University and the Virginia Teachers Association residence. They ate lunch in the Maggie Walk- er High School caferia, and had din ner at Slaughters Hotel. While at the Assembly they saw how bills are passed, and too, were recognized as visitors. The Senior Sociology Class re ports that they are doing nicely. The committees are now working hard to accomplish their aims. During English examination, sym posiums were given in the informa tion gained from their term papers. The Seniors have elected their Carver Herald staff. Norrald Wat kins is editor-in-chief. They are working hard to try to make it a"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "Valen tine Museum, St. <mark>Johns</mark> Church. Union University and"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "Valen tine Museum, St. <mark>Johns</mark> Church. Union University and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [673.9, 239.69, 818.94, 518.24], "bbox_id": "cf3da183a7", "file": "AppomattoxNewspapers_1962-1965a_0181.pdf", "page": 1, "text": "vention of New Farmers of  America at Virginia State Col lege next week will be Herbert Ferguson, Andrew Hill, Winfred Hamlet and William Stiff. The delegation will leave here on Tuesday, June 11, and return on Friday, June 14. They will be accompanied by their adviser, R . Q. Lawing. The annual Childrens Day service will be observed at the Mount Shiloh Baptist Church this Sunday morning at the regular preaching hour. A special pro gram will be given by the chil dren of the Church School. The pastor will deliver a special ser mon to the children. The public is cordially invited to attend. The annual St. Johns Day celebration will be held at the Promise Land Baptist Church on the fourth Sunday in June. The program will be sponsored by Long Mt. Lodge No. 204 A .F.A . M Prince Hall Affilation of Virginia. The public is invited to attend."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "attend. The annual St. <mark>Johns</mark> Day celebration will be"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "attend. The annual St. <mark>Johns</mark> Day celebration will be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [891.28, 532.49, 1059.28, 669.94], "bbox_id": "de4fd0f033", "file": "AppomattoxNewspapers_1939-1943a_0043.pdf", "page": 1, "text": "V A motio was made that the Irby Court Street loti be preserved und beautified as a memorial t o Miss Dean Johns. Due to scarcity of flowers no fall flower show will be held. Efforta are concentrated on planting and elec trifying the community Christmas tree. Seventeen dollars were dona ted to electrify the community tree, we are indebted to Messers W .S. Matthews and M .T. Parrish of our local Lee-Grant Camp for the mov ing and planting of this handsome cedar tree. Miss Anne Caldwell do-"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "t o Miss Dean <mark>Johns</mark>. Due to scarcity of"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "t o Miss Dean <mark>Johns</mark>. Due to scarcity of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.05, 907.91, 1888.39, 988.51], "bbox_id": "7f300f0471", "file": "AppomattoxNewspapers_1908-1909a_0459.pdf", "page": 1, "text": "V? 8f u. Hixburg-M iss Vivian Clarke k .u W I Taylor visited his I Gold Hill - Lucille Dickerson- brother and son in Richmond, Hollywood-Vara MorriB Airy last week-end. _ HillThelma Webb Rocks Mary i . . . ,  -   iJ.ucivienney Jam es KiverAnna I children of Richmond,  arc visit-j Ferguson Evergreen  Ursula Johns disciplei I m Mr.J Wooldridge Martin  Virginia I ladya J ennlnR8-"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "visit-j Ferguson Evergreen  Ursula <mark>Johns</mark> disciplei I m Mr.J"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "visit-j Ferguson Evergreen  Ursula <mark>Johns</mark> disciplei I m Mr.J"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [585.54, 1025.55, 743.09, 1151.29], "bbox_id": "36edbbf381", "file": "AppomattoxNewspapers_1922-1923a_0142.pdf", "page": 1, "text": "uuvuer morns o. a. ctaroiu Spencer J. D., Curtis Black- Wool- folk Treasurer, R L. Burke Stewards, Harry Johnson and Oscar UolejTy ler.Robt. O Brien. Arrangements were made for installation on So Johns nigh. December 27th, after which a banquet will be served by the Bistern Stars to the order."}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "for installation on So <mark>Johns</mark> nigh. December 27th, after"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "for installation on So <mark>Johns</mark> nigh. December 27th, after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [990.62, 1480.51, 1162.95, 1559.86], "bbox_id": "ce0e4a6c18", "file": "AppomattoxNewspapers_1960-1962b_0071.pdf", "page": 1, "text": "us around the Island of Manhattan. Thursday night we attended a movie and stage show at Radio City Mu sic Hall.   Bright and early Fridiay morning -we were off for a tour via bus. First we went to St. Johns Cathedral, ami from there to the United Na-"}, "highlight": {"text": {"matched_tokens": ["Johns"], "snippet": "we went to St. <mark>Johns</mark> Cathedral, ami from there"}}, "highlights": [{"field": "text", "matched_tokens": ["Johns"], "snippet": "we went to St. <mark>Johns</mark> Cathedral, ami from there"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
