{"document": {"bbox": [1726.08, 915.87, 1894.38, 1740.21], "bbox_id": "e1af8c101e", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "with Miss Mary Elizabeth Paris Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messrs. John Rolfe Horsley, B. Watkins Nowlin, John Overton and lampton Steele. The little ribbon- bearers were Jerry Burxe and Jao- queline Atwood Curtis Taylor and Fraces Abbitt Kendall Huuter and Katie Woolridge, and James Stanley and Mattie Sears. Before thp bridal party entered one verse of O Promise Me was softly-sung by Miss Eula Burke ac companied by Mrs. J. R. Atwood. At the conclusion of the solo follow ed the strains of Lohengrins wedding march. The bridesmaids entered from the left wing of tbe church near the altar and passed in front of the altar and down the right aisle. The male attendants entered the left aisle at the front of the church and marched down the right aisle while the bridesmaids passed up the left, forming a semi-circle around the al tar. Following the attendants the groom on the arm of the best man en tered the right aiale, while the bride on the arm of her father, Mr. H. F, Burke, appeared in the left aisle, and proceeded to the alter. The bride was preceded by the maid of honor and followed by her colored maid, Sarah. The bride was attired in a hand some traveling dress of broad-cloth with hat and gloves to matcl. She carried in her hand a small white bible and a white rose-bud. The maid of honor wore a gown of cream crepe cloth, with trimmings of pearls and chiffon, and carried in her hand a large bunch of white chrysanthemums. Tfie bridesmaids wore dresses of white silk mull wearing aigrettes in their hair, and each carrying a white rose iu her hand. After lunching at the brides home they happy pair left on the 130 oclock train for a tour through the West, followed by the best wishes of a host of friends. The groom is a son of Mr. John Steel, of Concord, and bolds the re sponsible position of Agent at Spout Springs of tbe N.  W. By., and is a young man highly esteemed and very popular wherever known. He  has for his young bride a daughter I of Mr. B. F. Burke, cashier of our bank. She is attractive popular, j and highly accomplished. She is  an expert at the telegraph key and Mr. Steele will have a help mate ca pable as be. The presents were  costly and beautiful."}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley", "John"], "snippet": "The ushers were Messrs. <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>, B. Watkins Nowlin, <mark>John</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley", "John"], "snippet": "The ushers were Messrs. <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>, B. Watkins Nowlin, <mark>John</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.55, 407.07, 2216.23, 925.2], "bbox_id": "828a6652b9", "file": "AppomattoxNewspapers_1952-1954a_0433.pdf", "page": 1, "text": "STEELE . BURKE Liberty Baptist Church was the scene of a beautiful marriage today. Mr. W. T. Steele and Miss Alice F. Burke were the contracting parties. The church was beautifully decora ted with evergreens, and an arch spanned the church, from which a chandalier, with lighted candles gave the only light for the auditorium. Beneath this arch and chandalier Mr. iSteele and Miss Burke took the marriage vows, using the ring, her pastor, the Rev. Hugh C. Smith, per forming the ceremony in a very im pressive manner. The attendants were as follows Mr. Clinton Steele, brother of the groom, groomsmn, and Miss Vera W. Burke, sister of the bride, maid of honor. The other attendants were Mr. Hallie Burke with Miss Lee Steele Mr. Robert C. Harvey with Miss Jenine Irby Hon. H. D. Flood with Miss M. Elizabeth Burke Dr. James B. Abbitt with Miss Lula Terrell j Mr. Oscar Sho- walter with Miss Roberta Wood Mr. R. L. Burke with Miss Mary Eliza beth Paris j Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messers. John Rolfe Horsley, R. Watkins Nowlin, John Overton and Hampton Steele. The little ribbon bearers were Jerry Burke and Jacqueline Atwood Cur tis Taylor and Frances Abbitt Ken dall Hunter and Katie Wooldridge, and James Stanley and Mattie Sears. Before the bridal party entered one verse of O Promise Me was softly sung by Miss Eula Burke, ac companied by Mrs. J. R. Atwood. At the conclusion of the solo followed the strains of Lohrengrins Wedding March. The bridemaids entered from the left wing o f the church near the altar and passed in front of the al tar and down the right aisle. The male attendants entered the leit aisle at the front of the church and"}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley", "John"], "snippet": "The ushers were Messers. <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>, R. Watkins Nowlin, <mark>John</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley", "John"], "snippet": "The ushers were Messers. <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>, R. Watkins Nowlin, <mark>John</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "Peers, Geo. W. Abbitt, <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark> and Claude W. Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "Peers, Geo. W. Abbitt, <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark> and Claude W. Smith."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [567.59, 198.8, 715.19, 459.59], "bbox_id": "1cf4f3be23", "file": "AppomattoxNewspapers_1974-1975a_0433.pdf", "page": 1, "text": "Mrs. Annie Davidson Hors ley of Rt. 4. Appomattox, died Tuesday morning in Guggen heimer Memorial Hospital, i Lynchburg. She was the widow  of John Rolfe Horsley. Born in Appomattox County on May 10, 1884, she was a  daughter of the late Thomas  Osborne Davidson and Emma  Stratton Davidson. She was baptized into the fellowship of  Hebron Baptist Church at age j 10, and was an active member  throughout her life. Surviving are two brothers, j J. Osborne Davidson and J. Crawford Davidson of Appo mattox six nieces and a nephew. Funeral services were held at Hebron Baptist Church at 330 p.m. Wednesday by the Rev. Dennis Moore. Burial took  place in the church cemetery."}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "was the widow  of <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. Born in Appomattox County"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "was the widow  of <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. Born in Appomattox County"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.07, 588.56, 2499.2, 1436.07], "bbox_id": "b2e07345fe", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "fty Calvin Robinson Clerk of the Circuit Court of Appomattox County, has submit ted his resignation, effective as of July 15. Smiths resignation was motivated by reasons of health and came with four years remaining in his current term of office. The resignation was submitted to Circuit Court Judge George F. Abbitt. Mr. Smith was bom In Fred erick County, Maryland, son of the late Mr. and Mrs. M. C. Smith. The family moved to Ap pomattox in 1907. He began his distinguished service in the Clerks office Feb. 8, 1908, as a Deputy Clerk under toe late John Rolfe Horsley. He became Clerk in 1919 and was elected to that Office in the fall of that year, and was re-elected, without op position in the county elections Of 1927, 1935, 1943, 1951 and 1959. This is thought to be a record for the State and indicative of the high respect and esteem In which he is held and reflects tribute to the efficiency and high quality of public service render ed. Since its establishment in 18- 45, Appomattox County has had six County Clerks John T. Bo- cock, Henry F. Bocock, Geo. T. Peers, George W. Abbitt, John Rolfe Horsley and Mr. Smith. In addition to his career aa Clerk, Mr. Smith has been most active in community, county and Church affairs. He was one at the drigttler of toe Appomat tox Light it Power Company In 1922. He wrote tf -Charter for the Town of .Appomattox when it was incorporated in 1925. He has served as Vice-President and Chairman of the Board of The Bank of Appomattox. He has served as Chairman of the Official Board of Memorial Methodist Church for 14 years served as Church Treasuer for 30 years. Superintendent of the Church School for 42 years and as a merriber of Monroe Lodge 301 AF  AM, Woodmen of the World and Appomattox L i o n s Club. In October of 1915, he was married to Miss Lucye Cabell Foster, who is an outstanding leader in local civic and church affairs. On toe occasion of the Cenn tennial of the forming of Appo mattox County in 1945, Mr. Smith wrote a splendid history of toe! county, which was widely dis tributed in booklet form. Despite the press of his many duties, he has found time for his favorite hobby, that of gardening, and his flower garden has been a show- place of the community. In World War II he served on the Appomattox Selective Service Board and through the years, Whenever the Community and! county needed the services of this modest and capable leader. The American Cancer Socle tys Appomattox unit will meet he has assumed assignments of Thursday at 730 p.m. at the responsibility. Farmers National Bank. All Mrs. Aldah B. Gordon, Deputy devoted almost an entire issue j board members and volunteers and Mrs. Joel W. Flood, assis- to Appomattox using the subject are urged to attend. I Continued on Page 3 title, Eighty-eight Years Later -- -----------------------------------  ------------------------"}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "Clerk under toe late <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. He became Clerk in"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "Clerk under toe late <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. He became Clerk in"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.54, 994.87, 2129.29, 1383.56], "bbox_id": "6c2dc705b6", "file": "AppomattoxNewspapers_1939-1943a_0416.pdf", "page": 1, "text": "For the convenience of men, wom en, boys and girls over sixteen years of age, the Appomattox Chapter of only by members of the family, I the American Red Cross announces was performed b y , the RavereriL .Mrs, Glib, nd. Robert flu Redding, pastor of .the Ap- ed Nurse, ana director of home nor-  - _ -  - pomattox Court House Presbyterian sing for the chapter, has agreed to church, before an altar of gladioli teach a class at Appomattox on each and cathedral candles with a back-! Monday night from 730 to 930. ground of laurel and other native I The course requires 30 hours, there- greens. fore 15 lessons will ge given. The During the ceremony violin solos, only expense will be seventy-five Tis I Alone Can Tell,  Call Me cents for each textbook. All who de- iThine Own, and other selections sire to join the night class are asked were played by tre Honorable John Rolfe Horsley. The bride, who was gsven in mar riage .by her father, wore a cream wool dress with navy accessories in cluding a toque and bouquet of peach  gladioli and purple violets. She also  wore a locket and lace handkerchief that had belonged to her great grand mother. Miss Nan Withers Throckmorton, cousin of the bride, of Richmond, and New Yrok, was maid of honor and Mrs. Jerry Allen Burke, Jr., of Richmond was matron of honor. Both wore dresses of pastel wool with flower toques and bouquets of iris and roses. Jerry Allen Burke, Jr., brother of the bride, was best man. The bride attended the State Teachers College, Farmville, where she was a member oi oigma Sigma Sigma sorority she also attended the Ringling School of Art in Sara sota, Florida and later studied in New York. She is descended from Colonial Virginia families being a direct des-"}, "highlight": {"text": {"matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "played by tre Honorable <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. The bride, who was"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Rolfe", "Horsley"], "snippet": "played by tre Honorable <mark>John</mark> <mark>Rolfe</mark> <mark>Horsley</mark>. The bride, who was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1590.69, 461.59, 1811.89, 949.17], "bbox_id": "516c420de4", "file": "AppomattoxNewspapers_1892-1898a_0201.pdf", "page": 1, "text": "forth the sweet strains of Mend elssohns wedding march, under the masterly touch of Professor Willie S. Adams. The beautiful and impres sive Episcopal ceremony was per formed by Rev. Wm. S. Roy all, of of Bedford City, who, until a few weeks ago, was pastor of Hebron church, in Appomattox, where he left behind a host of devoted friends aud admirers. The bride, who is a pretty brunette and very stylish looking, was hand somely gowned in a suit of light grey broad cloth trimmed in grey velvet and black fur, with hat to match the suit, carrying in her hand a lovely bouquet of roses composed of Amrican Beauties, tied with ribbon the same shade of pink. The maid of honor, her sister Miss Willie Le Grand, was attired in a darkgreen covert cloth gown and carried in her hand a pretty bonquet of pink carnations tied with ribbon to match the flowers. The groom wore the conventinal suit ot black cloth, and his best men was Mr. J. Rolfe Horsley, of Ap pomattox. Thé following couples were the attendants  Miss Annie Lawrie Taylor, with Mr. Walter Le Grand, Miss Jennie Stone with Mr. Albert Taylor, Miss Bessie Win ston Le Grand with Mr. Elmo Stone. Miss Minnie Kale with Mr. Fralk Le Grand, Miss Bessie Rosser with Mr. Stratton Taylor, Miss Lula Taylor with Mr. Emory Martin., Miss Anna Douglass Le Grand with Mr. E. J. Turner, and Miss Julia Turner with Mr. LeGrand Thorn hillThe ushers were Mr. S. C. Strat ton, Mr. Alexander Hancockk, Mr Sam Anderson, Mr. Eugene Chick and Mr. John Turner. . ____ .. The bride was the recipient ot bandage dam-j many usefuj and pretty presents,"}, "highlight": {"text": {"matched_tokens": ["Rolfe", "Horsley"], "snippet": "men was Mr. J. <mark>Rolfe</mark> <mark>Horsley</mark>, of Ap pomattox. Thé"}}, "highlights": [{"field": "text", "matched_tokens": ["Rolfe", "Horsley"], "snippet": "men was Mr. J. <mark>Rolfe</mark> <mark>Horsley</mark>, of Ap pomattox. Thé"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [135.38, 1130.71, 458.53, 1443.06], "bbox_id": "b573b13f84", "file": "AppomattoxNewspapers_1892-1898a_0088.pdf", "page": 1, "text": "THE TARIFF BILL. The Democratic Ways and Means Committee have completed a tariff bill which keeps every pledge made in the Chicago platform. We hope to be able to furnish a full text of it in onr next issue. It is not to be expected that this bill, as it now stands, will beaccept- A t! able to all the Democratic Represen tatives. There are so many diverse interests to be reconciled that it is hardly possible a bill can be framed to suit all parties. The districts where iron ore is mined or worked will want protec Have bad men been elected by the  tion for iron, coal will claim the Legislature to compose the 100 same, and so on, bnt it is to be hoped Electoral Boards of the State ? that a sense of duty and a pure pa- Wonld Representatives nominate triotic sentiment will prevail, and as to so highind responsible positions near as the necessities of the govern- men whose characters are open to ment will permit, every industry will suspicion ? be put on the same footing. It will When John H. Robertson, Presley J be a bright day for our farmers and M. Hannah and J. Rolfe Horsleyj laborer when the government ceases were selected to constitute the elec- to tax them for the benefit of the"}, "highlight": {"text": {"matched_tokens": ["Rolfe", "Horsley"], "snippet": "M. Hannah and J. <mark>Rolfe</mark> <mark>Horsley</mark>j laborer when the government"}}, "highlights": [{"field": "text", "matched_tokens": ["Rolfe", "Horsley"], "snippet": "M. Hannah and J. <mark>Rolfe</mark> <mark>Horsley</mark>j laborer when the government"}], "text_match": 1733920985477808249, "text_match_info": {"best_field_score": "2216176058368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985477808249", "tokens_matched": 3, "typo_prefix_score": 1}}
