{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock"], "snippet": "instead of by election. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, first clerk Thomas S."}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock"], "snippet": "instead of by election. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, first clerk Thomas S."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock"], "snippet": "each term of court. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark> was first county clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock"], "snippet": "each term of court. <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark> was first county clerk"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock"], "snippet": "of the Court. j <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, was named the first"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock"], "snippet": "of the Court. j <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>, was named the first"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2064.07, 588.56, 2499.2, 1436.07], "bbox_id": "b2e07345fe", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "fty Calvin Robinson Clerk of the Circuit Court of Appomattox County, has submit ted his resignation, effective as of July 15. Smiths resignation was motivated by reasons of health and came with four years remaining in his current term of office. The resignation was submitted to Circuit Court Judge George F. Abbitt. Mr. Smith was bom In Fred erick County, Maryland, son of the late Mr. and Mrs. M. C. Smith. The family moved to Ap pomattox in 1907. He began his distinguished service in the Clerks office Feb. 8, 1908, as a Deputy Clerk under toe late John Rolfe Horsley. He became Clerk in 1919 and was elected to that Office in the fall of that year, and was re-elected, without op position in the county elections Of 1927, 1935, 1943, 1951 and 1959. This is thought to be a record for the State and indicative of the high respect and esteem In which he is held and reflects tribute to the efficiency and high quality of public service render ed. Since its establishment in 18- 45, Appomattox County has had six County Clerks John T. Bo- cock, Henry F. Bocock, Geo. T. Peers, George W. Abbitt, John Rolfe Horsley and Mr. Smith. In addition to his career aa Clerk, Mr. Smith has been most active in community, county and Church affairs. He was one at the drigttler of toe Appomat tox Light it Power Company In 1922. He wrote tf -Charter for the Town of .Appomattox when it was incorporated in 1925. He has served as Vice-President and Chairman of the Board of The Bank of Appomattox. He has served as Chairman of the Official Board of Memorial Methodist Church for 14 years served as Church Treasuer for 30 years. Superintendent of the Church School for 42 years and as a merriber of Monroe Lodge 301 AF  AM, Woodmen of the World and Appomattox L i o n s Club. In October of 1915, he was married to Miss Lucye Cabell Foster, who is an outstanding leader in local civic and church affairs. On toe occasion of the Cenn tennial of the forming of Appo mattox County in 1945, Mr. Smith wrote a splendid history of toe! county, which was widely dis tributed in booklet form. Despite the press of his many duties, he has found time for his favorite hobby, that of gardening, and his flower garden has been a show- place of the community. In World War II he served on the Appomattox Selective Service Board and through the years, Whenever the Community and! county needed the services of this modest and capable leader. The American Cancer Socle tys Appomattox unit will meet he has assumed assignments of Thursday at 730 p.m. at the responsibility. Farmers National Bank. All Mrs. Aldah B. Gordon, Deputy devoted almost an entire issue j board members and volunteers and Mrs. Joel W. Flood, assis- to Appomattox using the subject are urged to attend. I Continued on Page 3 title, Eighty-eight Years Later -- -----------------------------------  ------------------------"}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "T"], "snippet": "had six County Clerks <mark>John</mark> <mark>T</mark>. Bo- cock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, George"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "T"], "snippet": "had six County Clerks <mark>John</mark> <mark>T</mark>. Bo- cock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, George"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Bocock", "T", "John"], "snippet": "T. Bocock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, Geo. W. Abbitt, <mark>John</mark> Rolfe Horsley and Claude"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "T", "John"], "snippet": "T. Bocock, Henry F. <mark>Bocock</mark>, Geo. <mark>T</mark>. Peers, Geo. W. Abbitt, <mark>John</mark> Rolfe Horsley and Claude"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["John", "T", "Bocock", "Bocock"], "snippet": "term of th court, <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>f the firs clerk, died and Henry F. <mark>Bocock</mark> his son, was named"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T", "Bocock", "Bocock"], "snippet": "term of th court, <mark>John</mark> <mark>T</mark>. <mark>Bocock</mark>f the firs clerk, died and Henry F. <mark>Bocock</mark> his son, was named"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [521.99, 1200.06, 683.59, 1968.35], "bbox_id": "498e8c5da7", "file": "AppomattoxNewspapers_1898-1902a_0593.pdf", "page": 1, "text": "P k V N T E R S T O W N . This was the nathe given to an old colonial town situated on the north side of Appoiiattox River, just be low the sire of the Cut Bauk bridge that used to span the river at that place. The town was at the head of what was then flat-bottom boat navi gatiou on Appomattox River, which was made so by the aid of sluice and dam improvement. Under the old British regulation the land was condemned, streets laid off, and the town Incorporated, bin it seems never to have been built up for a warehouse and tavern are tin only buildings of which we have any account. Perhaps the .GlUteU8, like those of old Jamestown, thought tin laud would be more valuable put in tobacco, aud who knows but they were right. Anyhow it was never built up, On the west side of the fown is the Cut Bank road, leading from Hopeville, Buckingham county, to Hurtsville and Hixburg, Appomat ,tox on the north, the elegant old mansion of - William R. Gilliam grandson of old Isham Gilliam, the celebrated fox hunter, who threw off his coat once iu an exciting chase and, finding it a month afterward swore it belonged to a runaway negro, for putting it to Ins nose he said it smelt like one, Th Madame could hardly convince him of his mistake. Here Mr. William R. Gilliam entertains his guests and friends in the most hospitable man ner, Qn the east is Woods Moun tain, which, jjsjpg jp all its majestic grandeur, throws itg shadow over hill aud dale. The mountain road crosses this m o u n ta in , running from Jones Mill road to the Cut Bank road through Pluuterstown, planned by old Mr. John Bocock, comniis sio.ier. Qn this road is the celebrated Rock Spring, gushiug from a rocky bed underneath an immense shelv ing rock, aud descending three or four feet to the reservoir below. It is a place of great resort for level lasses and then beaux, from which they ascend to the grand scenery above. Some eighteeu mouths ago a happy pair lost their way, passed ard repassed the spring without see ing it, although the lady declared she had bee there often before, and I had to pilot them to the place, The lady seemed veiy disconsolate and I had to console her by saying that such thiugs were of common occurrence, as I once myself, under almost similar circumstances, left a broad country road that I had often traveled and turned up in a cow-pen."}, "highlight": {"text": {"matched_tokens": ["John", "Bocock"], "snippet": "planned by old Mr. <mark>John</mark> <mark>Bocock</mark>, comniis sio.ier. Qn this"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Bocock"], "snippet": "planned by old Mr. <mark>John</mark> <mark>Bocock</mark>, comniis sio.ier. Qn this"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [416.16, 1484.9, 576.41, 2006.78], "bbox_id": "5e7ce1b7cb", "file": "AppomattoxNewspapers_1898-1902a_0617.pdf", "page": 1, "text": "The P o rtrait o f H on. T . S Bocock. The portrait of Hon. Thomas S, Bocock was presented to the Con federate Museum this morning by Judge Christian, on behalf of Mrs T. S. Bocock. amid an assembly of representaive Virginian Confederates Dr. Smith, chaplain of the Museum being master of ceremonies, in troduemg the speakers. Judge George L. Christian made an instructive and eloquent address, iu which he reviewed the seventy seven years of Speaker Bococks life, In his introduction he said in trying to honor the good and true we honor ourselves, and we are doing that this morning. He commenced from his birth in Buckingham county, and took his audience through the varied scenes of his life, his election to Con gress iu 1847 for seven consecutive terms, duriug which several branches of the Navy were reformed. At th conclusion, Mastor Thomas Bocock Price namesake and oldest grand child, unveiled the portrait. Hon. John Goode accepted the portrait on behalf of the ladies of the Confederate Museum, in au eloquent and patriotic speech, which was frequently interrupted by bursts of applause. In receiving this por trait, he said  Hallowed associations come u from the past, and I see in imagiua tion many familiar faces, which, if they could speak, would tell of this old White House, which is without a blot. Here lived Jefferson Davis bold as a lion heart Robert E . Lee, peerless captain among the sons of men Stonewall Jackson,that thun derbolt of war J . E. B. Stuart, the flower of cavaliers. We would not forget them if we could not if we would, for sufferings of right are grown deep ou the chronicles of nations. As a man he whose portrait"}, "highlight": {"text": {"matched_tokens": ["T", "Bocock"], "snippet": "o f H on. <mark>T</mark> . S <mark>Bocock</mark>. The portrait of Hon."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Bocock"], "snippet": "o f H on. <mark>T</mark> . S <mark>Bocock</mark>. The portrait of Hon."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [518.11, 1079.11, 689.02, 1579.29], "bbox_id": "86e832fe62", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "PRIVATES. Abbett Geo. Dallas Alvis Ed ward, died in hospital at Mt. Jack- son, 1862 Alvis Wm. M., wounded Bagby Luke, discharged Banton James Bell Wyatt H . Bingham, Jno. S., discharged Bocock, Jno, T., deserted in December 1863 Bragg, Jno. J., transferred Bran ham, George W., from Albemarle county Brown, C. C. Carson, Jno, J. Carson, M. J. Carson M. W. j Cawthorn, Hudson  Cheatham, R, H., wounded at 2nd Manassas, Sept. 22nd 1862 Chick, J. J., captured wounded at Hanes Shop, May 28th, 1864 Chick, E. A . Clock, Cotton  Clock, William Clarke Henry Clarke William Coleman Drury  Coleman Henry, died in hospital Coleman, J. A., captured at Toms Brook, Oct. 9th, 1864 Colemtn Madison Coleman, Schuyler, died pt home 1862 Connelly, Warner Geo. Conner Allen, discharged lb overage Crawley, Richd, trans ferred  Crenshaw, Jno J., captured u Ilanes Shop. May 28th, 1864. Crumby, Frank, died in hospital in Richmond 1862 Davidson Jas II., died Diggs, John Doss, Jos. E. Dunn,put in substitute Elliott, Jno W. died at home in service Elli ott, Thos. wounded at Toms. Brook, Oct. 9th, 1864 Featherston, Jas. H. detailed with Hills, A. P. Signal j corps Ferbush, Henry discharged f Furbush, J. D. killed at Fort Ken- i"}, "highlight": {"text": {"matched_tokens": ["Bocock", "T"], "snippet": "Bingham, Jno. S., discharged <mark>Bocock</mark>, Jno, <mark>T</mark>., deserted in December 1863"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "T"], "snippet": "Bingham, Jno. S., discharged <mark>Bocock</mark>, Jno, <mark>T</mark>., deserted in December 1863"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["T", "Bocock"], "snippet": "county at that time <mark>T</mark>. S. <mark>Bocock</mark>, Tower Hill J . P."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Bocock"], "snippet": "county at that time <mark>T</mark>. S. <mark>Bocock</mark>, Tower Hill J . P."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2418.5, 1329.2, 2582.42, 1688.6], "bbox_id": "79d5ae2165", "file": "AppomattoxNewspapers_1915-1918a_0215.pdf", "page": 1, "text": "CHARTERS ISSUED.  Charters were Issued by the State Corporation Commission as follows The Grand Order Brith Sholom of Baltimore City, a Maryland corpora tion No capital stock. Domesticated to do business in Virginia. The Com missioner of Insurance statutory agent, RIchmpnd. Rappahannock Brick Corporation, Richmond. Maximum, 40.000 mini mum, 1,000 par value, 100. J. V. Talley, president R. H. Walker, vice- president John H. Bocock, secretary and treasurer, all of Richmond. Amendment, to charter of Schwarz- schild Brothers, Inc., Richmond, elimi- . natlng provision for preferred stock. Crescent Electric Corporation, New port News. Maximum, 15,000 mini mum,, 2,500 par value, 100. Deal In electrical supplies. T. G. Gray, presi dent T. A. Fowler, vice-president A. p. Ransom, secretary and treasurer, - all of Newport News. Bluestone and Harmony Academic and Industrial School, Keysville. No capital stock. Mutual corporation. 8. L. Johnson, president, Boydton M. C.  Rux, secretary, Keysvflte.  Foreign charter American Ores Company, a Delaware corporation, with 50,000 capital stock, domesti cated to dp business in Virginia. John H. Bocock, statutory agent, Richmond. Riverside Squab Yards, Inc. Court- land. Maximum, 10,000 minimum, 2,500 par value, 100. W..J. Maury president E. F. White, secretary and I treasurer, both of COurtlund."}, "highlight": {"text": {"matched_tokens": ["John", "Bocock"], "snippet": "H. Walker, vice- president <mark>John</mark> H. <mark>Bocock</mark>, secretary and treasurer, all"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Bocock"], "snippet": "H. Walker, vice- president <mark>John</mark> H. <mark>Bocock</mark>, secretary and treasurer, all"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [536.13, 1099.95, 694.23, 1313.1], "bbox_id": "950b937251", "file": "AppomattoxNewspapers_1892-1898a_0201.pdf", "page": 1, "text": "roe A.G. Mo -.-plaintiff! AGAINST. Wra. A. Cabell aimr. of N. F. Bocock decd. ctavia K. Bocock. Henry Gibbs and Rosa hi ife, John N. F. Bocock. Sallie P. Bocock. rank W. Bocock. Victoria E. Curley in her irn rifrbr and as admr. of James S. A lie eed. Mattie Allen. Ben Shaw Allen, Joh lien and James Allen, the last four name eing infants....................................defendant! The object of this suit is to obtain a deed onveying lots Nos. 5 and 6 in the town of Masille in Buckingham county, Va., tc Wm. A. Moss, Jr., A.G. Moss, M. S. Matthew aisy A. Moss. Frank B. Moss and C. F. Mo hey being the parties entitled thereto. And 3 affidavit having been made and filed that the defendant Frank W. Bocock is not a resi- ent of the State of Vinrinia.it is ordered that e do appear here within fifteen days after ue publication hereof, and do what may be eccssary to protect his interest in this suii And it is further ordered that a copy hereof be published once a week for four successive reeks in the A ppom attox and B uckingham D im es , and that a copy be posted at the front loor of the Court House of this county on the irst day of the next term of the county ourt. A copv T este P. A. F o r bes , Clerk. E. W. H ubard , p. q."}, "highlight": {"text": {"matched_tokens": ["John", "Bocock", "Bocock"], "snippet": "and Rosa hi ife, <mark>John</mark> N. F. <mark>Bocock</mark>. Sallie P. <mark>Bocock</mark>. rank"}}, "highlights": [{"field": "text", "matched_tokens": ["John", "Bocock", "Bocock"], "snippet": "and Rosa hi ife, <mark>John</mark> N. F. <mark>Bocock</mark>. Sallie P. <mark>Bocock</mark>. rank"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [165.84, 466.23, 312.32, 1762.57], "bbox_id": "0a8502fbfc", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "Palma Let him now take his stand in the front rank of American Heroes. By Maj. Samuel J. Walker - Bartholomew Cyrus the only surviving Revolutionary Sol dier present May his last days behübest. By Bartholomew Cyrus A Revolutionary Soldier - May the feelings which filled the hearts o f the Patriots of the Revolution be justly appreciat ed by the youth of the present day. By Dr. Wm. D. Christian Speedy peace with Mexico continued peace with Great Britian and the world. By Maj. Samuel J. Walker  Gen. Scott and Gen. Gaines The distinguished services of these Generals in the late war, and the blood the one spilt at Lundys Lane and Chippewa, the other at Erie, will protect them against the assualts of President Polk and his Secre tary of War. The American people understand how to estimate these services. By Thomas S. Bocock  Gen Scott We thank him for what be has done for his country and only wish that during the next Presidential term he may take his hasty plate of soup in privacy, without the fear of enemies either in front or rear. By Rkhard Perldiu invited Guest - The County of Appomattox, I hope the hospitality exhibited by her citizens this day Will form a closer alliance with her deserted parents. I was her greatest enemy in war, in peace her best friend. By QBss  Partwood  Henry Claftffie wisp end good May posterity do homage to hie destinguished ability, by implic it acquiescence in the great leading measures of his policy of our Government By Cat Beujamiae P. Walker - John J. Crittenden The unrivalled Orater, accomplish ed Gentleman and able Senator, he deserves the gratitude of his Country for his services on the Oregon Question. By P. B. Pankey - Col. T. H Flood - long the whig tide of Buckingham surely Hot diked by Appomattox. Loci Focoisn. By Capt. J. A. Hamer - General Taylor like a Washing ton and Jackson May he long be remembered by the Ameri can People. By Henry F. Bocock - The ladies  of Appomattox, as patriotic as they are fair. By A. A. LeGrand - The perpetuation of our Republican Government and the just appreciation of the rights of the governed. By G. W. A. Raine - E. J. Goode - Reader of the Declaration of Independence - May a distinction worthy of the intelligence and patriotism of his youth crown his entire manhood with the love and respect of his countrymen. By H. F. Bocock - R. M. T. Hunter A fearless advocate of the rights of the people, regardless of the consequences which may result to himself - May he fill the seat about to be vacated by our distinguished Senator, Wm. S. Archer. By Capt. Thomas W. Johns - Gen. Andrew Jackson The warrior and statesman sleeps with his fathers. His memory will evpr be reversed alike by philanthropists and patriots, his services both in the council chamber and upon the lentel field will be handed down to the latest posterity - and shine as morning lights in his countrys history. By A. A. North - The United States and Texas - Long may this union of the two republics last and long may it continue to disperse its blessing? to the countless millions who in the course of time, are determined to animate its soul. By E. B. le nd - Henry Clay - May his evening sun set as tranquil as was his meridan, bright and luminous. By A, W, Carter - Edmund J. Goode The handsome which he this day delivered, gives us promise of future distinction and usefulness, and"}, "highlight": {"text": {"matched_tokens": ["Bocock", "T"], "snippet": "countrymen. By H. F. <mark>Bocock</mark> - R. M. <mark>T</mark>. Hunter A fearless advocate"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "T"], "snippet": "countrymen. By H. F. <mark>Bocock</mark> - R. M. <mark>T</mark>. Hunter A fearless advocate"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [208.08, 1270.8, 710.81, 1703.69], "bbox_id": "6faeb5f74c", "file": "AppomattoxNewspapers_1915-1918a_0560.pdf", "page": 1, "text": "p wi i 1  H 1 í i 30 Amos Lee Cress Pamplin 20 39 Chas. A. Bocock Vera 21 ujb 25 William Price Martin Appomattox 22 B  g te  12 Lyle Foster Caldwell Spout 8pring 23 ppnd no J R j Jf!j B  1 34 Henry Augustus Tames Appomattox 24 i   , m m t i 2 John McCartney Scott Appomattox 25 S r i a B ! IB B i, 1 46 Add Alvis Washing Branch Pamplin 26 fyiEOcl l A H H j l l p l l 8 Frank Obey Covington Hollywood 27 sjmgii c H lfí Í 2 n lr f  ü 40 George Ferguson Vera 28 1 38 Clarence Fletcher Moore Oakville 29 H n oB fii 7 Bennett Harding Beckham 30 foTphn dMfi  27 Durward Belmont Thomas Appomattox 31 Hoft w sH BF VjL- 1 James R. Alvis Spout Bpring 32 HM. ohH  52 Lucius Ashton Harrison Appomattox 33 D i i H .  jal a 6 Charles Reames Morris Concord Depot 34 24 Doctor Connie Baldwin Evergreen 35  4 j 14 Clarence Burnett Simmons Evergreen 36 19 Silas Paul Cawthon Vera 37 Hem H . 11 j 37 James Leonard Blackwell Appomattox 38 B r K.v 36 Geo. Wesley Tolley Evergreen 89 1 Jff i . 1 BBBBj h yl Vc.-i y  44 Junius D ud gee Spout 8pring 40 16 Jesse Peyton Harvey Evergreen 41 ftSflrai RS 26 Nick Burrell Pamplin 42 IpfMilwjB y Si 31 Allen Howard Mayberry Appomattox 43 B  i H I i B I B K i 63 John Henry Stephens Appomattox 44 43 Thomas Doss Spout Spring 45 23 Melvin Davis Childers Vera 46 H r 22 Joseph Rufus Burnett Stapleton 47 21 Thomas Tyndal Pugh Appomattox 48 IVeg 50 Walter Day Bent Creek 49 É É p ?fl 47 Ossie Watson Evergreen 50 P aaH HpODt jtff -T Jifííg i   Es 9 Emmett Mott Perdieu Spout Spring 61 20 William Ernest Layne Spout Spring 52 H P f  5 Ernest Wightman Harwood Pamplin 63 42 Nelson Harris Spout Spring 54 L ocal B oard A ppomattox C ounty ."}, "highlight": {"text": {"matched_tokens": ["t", "John"], "snippet": "24 i   , m m <mark>t</mark> i 2 <mark>John</mark> McCartney Scott Appomattox 25"}}, "highlights": [{"field": "text", "matched_tokens": ["t", "John"], "snippet": "24 i   , m m <mark>t</mark> i 2 <mark>John</mark> McCartney Scott Appomattox 25"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.17, 1013.54, 1792.06, 1539.92], "bbox_id": "153eb5b786", "file": "AppomattoxNewspapers_1902-1905a_0548.pdf", "page": 1, "text": "Arcanum. Mr. Arthar Hackett has baen and is still a very sick man, but under the care of Doctor Lightfoot Merries is slowly imprjving. Mrs. iiackett and her youngest child are also ill.  Mrs. J.Oarn Hebditch v.ith Iter mother, Mrs. Charles Spencer, of  Newport News, is on a visit to her husbands parents, Mr. and Mrs. J. W. Hebditch. Miss Quin Vic Hebditch returned home last week from a visit to her sister, Mrs. Newsom, in Portsmouth. Mr. Bocock Spent er is home on a visit to his parents, and also to Awe know who. Mr. Miller Steger has ran down from Amherdt for a few days to vis- t h is children. Rev. John Spencer preached to quite a large congregation at St. Annes on Sunday. Miss Eva Wright, grand-daughter of the late Anderson Wright who is residing in Tennessee is visiting her aunt, Mrs. Tom W. Garnett. Both candidates for Clerkship of tbe county have made a house to house canvass of Francisco district and both have oeen promised a ma jority of the votes at the prmary. When will all men be what they seem to be ? An open opponent is far more to be desired than a false iriend. Senator Martin and Mr. Swanson will be in the lead in Francisco, but with very little margin to spare, aud if Mr. Martins friends continue to trump up such frivolous, rediculous tales about Mont.gue that little margin will be wiped ont."}, "highlight": {"text": {"matched_tokens": ["t", "John"], "snippet": "few days to vis- <mark>t</mark> h is children. Rev. <mark>John</mark> Spencer preached to quite"}}, "highlights": [{"field": "text", "matched_tokens": ["t", "John"], "snippet": "few days to vis- <mark>t</mark> h is children. Rev. <mark>John</mark> Spencer preached to quite"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [893.7, 889.7, 1009.24, 1067.49], "bbox_id": "49ee285ba9", "file": "AppomattoxNewspapers_1947-1949a_0221.pdf", "page": 1, "text": "P. L. Thornton Dr. J. R. McDearmon Hon. Thomas S. Bocock S.F. Wright J. W. Flood J. R. Franklin C. T. Plunkett Dr. J. R. Robertson James Couch F.. H. Thornton Wm. H. Trent Dr. R. H. Watkins Spencer Gilliam Wm. B. Farnar Rev. J. H. Cawthorn John Sneed Sfc D. McDearmon Dr. T. P. Mathews."}, "highlight": {"text": {"matched_tokens": ["John", "T"], "snippet": "Rev. J. H. Cawthorn <mark>John</mark> Sneed Sfc D. McDearmon Dr. <mark>T</mark>. P. Mathews."}}, "highlights": [{"field": "text", "matched_tokens": ["John", "T"], "snippet": "Rev. J. H. Cawthorn <mark>John</mark> Sneed Sfc D. McDearmon Dr. <mark>T</mark>. P. Mathews."}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.53, 267.4, 1773.18, 1764.4], "bbox_id": "d1f7f47b98", "file": "AppomattoxNewspapers_1902-1905a_0454.pdf", "page": 1, "text": "acres, exchange. C. E. Lewis to,Nel8on Bocock 53 acres, exchange and 117. C. H. iSarkill, comr to Crawford H. Going, 280 acres, 240. R. B. Cralle c.. trustees to Farm ville Bldg.  Tr. Co., 26 acres, 125. Reuben Brown to J. B. Shearer, 12 acres, 250. E. W. Gilliam, c. to H. E. Gil liam, 319 acres, 10Q0. J W. Flood c. to T. B. Scruggs, 54 acres, 126. T. B. Scruggs to W. D. Sandidge, 202 acies, 600. W. J . Martin to T. W. Oder And Robt. Irvey, 3 acres, 135. Altert Thornhills Heirs to Thos. Chambers, 158 acres 400. Madison Cyrus to O. S. Cyrus, 101 acres, 400. Madison Cyrus to S. A. Cyrus. 50 acres, 500. Madison Cyrus to D. H. Cyrus, 50 acres, 500. J. M. Dnrphey to 8. E. J. Bur- ford, lot 11-16, 1625. Wm. W. Wright to Elizabeth S. Wright, 57 acres, 100. Annie H. Bocock to Ellen Morgan, 100 acres. 500. M. P. See c. to Flood and Fer guson 805 acre-, 800. Emeline Cheatham c. to T. S. Ferguson, 6 acres, 15. Etna Iron  M. Co. to E. M. Schaefer 115 acres, 2500. Wm. A. Miller to E. C. Marshall, 319 acres, 747.23. J. H. Robertson to Henry Jack- son, 5 acres, 150. J. M. Abbott to Henry Jackson, 5 acres, 1500. C. Wiley Tucker to E. E. Chism, 2 acres, 135. Jos. R. Abbitt to Obey Mann, 100 acres, 200. Robert Meadows to Marion Mose ley, 30 acres, 91.20. C. P. Marshall to C. H. See, 31 acres, 120. R. C. Maun to Z. N. Harris, 8 acres, 175. Saml Worley to Mary D. Worley, 11 acres. . aunders F. Wright to Fannie B. Wooldridge, 120 acres, 500. W. Q. Ligon to H. Ai. Marshall, 19 acres,1200. R. H. Purdum to Joel T. Caw- thorn, trustee for Liberty Church 3 acres, 93. Juo. W. Fvans to J. Hudson Cheatham, 11 acres, 200. Samuel A. Glover, c. to Thos. W. Moses, 4 acres, 40. J. R. Caldwell to Chas. Glover, 100 acres 280. F. C. Moon Comr to Eugene M. McCormick, 40 acres, 250. Farmers Exchauge to C. W. and C. A. Hancock, store and lot 2000. Nina E. Jones to J. C. Jones, 277 acres, 3000. J. C. Jones to Jno. Wilson Dur- rum, 277 3000. W. A. Durrum to Ann R, Dur- rum, 17 acres 207. W. E. Moo e to Peyton Vf. Calla- ham, 81J acres, 170. A. B. Scruggs to T. E. Fwen, 100 acres, 400. Sallie M. Featherson to H. R. Feathe stou, 305 acres, 1500. T. E. Oweus to L. S. and T. . Do s, 30 acres, 200 Lucv F. Caris to Jane E. Coleman, 75 acres, 375. Mattie W. Harvey to Ja-e E Coleman, 106 to 250.  - Jno. S. Davis to Jas. D. McDear- man Va a lot, 75. N. ii Featherston to Monroe L. Garrett, 201 acres, 900. J. A. Cheatham to School trustee South3ide and Court House,  acre, 37. H. F. Venable to School trustee Southside, 1 acre, 3. R. S. Burke to R. F. Burke acre iots, 595. Thos. H. Paris, trustee to Hun er M. Moore, 167 acres, 1400. C. S Morton, to S. W. Thornton 5 acres, 35. Flora E. and L, D. Th rntoir to S. W. Thorn cn, 39 acres aud 2 lots, Saml H. Gordou to W. Scott Thomas, 25 acres, 90. M. S. Davidson to D. T. Wool dridge, 50 acres, 350. T. W. Moses to D. T. Wooldridge 25 acres, 250 B. W. Bocock Comr io H. D. Johnson, lOaces, 78. Wm. Patteson to H. D. Johnson, 29 acres, 60. Jno. L. Davis and wife to W. E, Wooldridge c. 20 acres. Jno. L. Davis to Wesley Chapel Lruste l i acres, gift. A. B. Hoarman to J. W. Nash Jno. R. Phelps Heirs to 8. E and W. A. Wills, 50 acres, 100. A. A. White to Clifford Beck, 10 acres. 180. G. A. J. Pennell to Geo. W, Thomas, 19 acres, 200 G. W. W, Thomas to Oueida Lhomas 19 acres. Signora P. Fore to M. E. Agee 163 acres. S. S. and Elma Coleman c. to H. W. McKinney,  lot, 1200. J. R. Horsley Comr to Eliza Wright, 5 acres, 100.  E P. Evans Est. to N.  W. Ry. Co. 365-1000 acres, 260. A nna Staples Est. to N.  W. Ry. Co. 283-1000 acre, 100. B. W. Bocock Comr to D. M. Anderson 24 acres, 72. E. M. Schaefer to W. B. Sampso n 104 acres, 5. C. W. Hunter, Jr. trustee to N.  W. Ry. 17-100 acre, 15. N. C. Manson, Jr. Comr to Jos. O OBrien, 260 acres. 5455. John Reid to N.  W. R. R. Co. lot 1 acre, 400. C. W. Hunter to Sallie McKinnev"}, "highlight": {"text": {"matched_tokens": ["T", "Bocock"], "snippet": "W. Moses to D. <mark>T</mark>. Wooldridge 25 acres, 250 B. W. <mark>Bocock</mark> Comr io H. D."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Bocock"], "snippet": "W. Moses to D. <mark>T</mark>. Wooldridge 25 acres, 250 B. W. <mark>Bocock</mark> Comr io H. D."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1635.59, 662.06, 1797.94, 1306.05], "bbox_id": "898490984d", "file": "AppomattoxNewspapers_1892-1898a_0300.pdf", "page": 1, "text": "Spanish Oaks Item s. Spanish Oaks, Va., May, 4th, 1896. We have had fine rains and feel much encouraged at the improved condition of the crops in general is to be earnestly hoped that a eat part of the army of chinch- bugs shared the fate of Pharaohs army. Many of the neighbors are busy day receiving shipments of guano Concord Depot. Tobacco plants are pushing the farmers in their preparations for filling. We greatly appreciate the kind ness done us by Mr. Jos. Button, when in Washington, in securing desirable changes in onr mail route, which enables us to get our mails a day earlier. Mr. T. M. Lewis has qualified as Post Master to succeed Miss Alice Stratton who recently re signed, and be will soon assume charge of the office. At a recent meeting of the Stone wall Improvement Society one of the speakers, in describing a man who could resist feminine charms, com pared him to a bristled swine walk ing on his hind legs and was loudly applauded by the young ladies pres ent, and their escorts also. That speaker might be said to be strictly iu it. Mrs. S. M. Bocock who has been 4B paying a short visit to this neigh borhood, will leave go day for her nome at Hampden Sidney. She is  ust returning from Arkansas where she has been spending some months with her daughter, Rev. Mrs. Wil lis. Mr. E. L. Thornhill returned to Lynchburg last week from paying a visit of several days to his home near heie. We are sorry to note the extreme illness of Mrs, John Scruggs. Her recovery is almost despaired of by Dr. Rice. She has been sick for some months. C o a l in g ."}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "a day earlier. Mr. <mark>T</mark>. M. Lewis has qualified"}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "a day earlier. Mr. <mark>T</mark>. M. Lewis has qualified"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [487.44, 392.83, 659.14, 918.17], "bbox_id": "e90c8d5e33", "file": "AppomattoxNewspapers_1926-1933a_0501.pdf", "page": 1, "text": "Mrs. Martha A. Gills, a for mer resident of Appomattox, died at the home of her daugh ter, Mrs. T. L. Payne, in Crewe, April 11. Mrs. Gills was 93 years of age. She was a daugh ter of the late Captain Wilson Hix, of Appomattox, a leader in the community which play ed so dramatic a part in the War Between the States. Her mother was a sister of Hon. Thomas S. Bocock, of Appo mattox, who was the speaker of the House during the brief re gime of the Confederacy. Mrs. Gills remembered vivid ly the circumstances of the sur render of General Lee at Appo mattox. The surrender took place on a farm owned by her rather, and the terms of sur render were drawn and signed in a building formerly owned by her father, who sold it to Major McLean during the war. General Grant took possession of her fathers home for eight days while the Confederate sol diers were being paroled. When the Union soldiers were beginning to evacuate the village, an officer approached the young daughter of the house and informed her that he had hidden away a barrel of flour and a chicken, so that when they were gone her fami ly might not suffer for provi sions. The gloom of war was bright ened for Mrs. Gills by the ro mantic attachment she felt for her first cousin, Daniel Gills, a young cavalrymen in Fitzhughjj Lees brigade, which after the war culminated in marriage. Her husband, with his six brothers, William, Watt, John, and Edmund"}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "her daugh ter, Mrs. <mark>T</mark>. L. Payne, in Crewe,"}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "her daugh ter, Mrs. <mark>T</mark>. L. Payne, in Crewe,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [346.59, 300.51, 523.09, 1763.43], "bbox_id": "f490ffaac6", "file": "AppomattoxNewspapers_1902-1905a_0217.pdf", "page": 1, "text": "l ii i c k i i iK h a i i i. At a largely attended mass-meet ing B. F. Nuckola was nmde chair man and _ P. Grigg, secretary. Fhe object of the meeting was the adoption of the resolutions printed below, bidding fuiewdl to tbe old County Court system, and the strong ndorsement of Judve Moss, as a Tair and impartial judge, who has -irerided over the court for the past twelve .rars. Col. Kobt. T. Hub bard. Hon. E. W. Hubbard, A. P. Grigg and others spoke feelingly to the resolution and Judge A. 8. Hall, while not opposing the resolution, -aid he was glad the constitution bad abolished the Conntv Court -ysteni. The resolution was adopt ed, and the Messrs. Hubbard and Col. James Lyons were appointed a committee to inform Judge Moss of I - he action of the meeting, and the Judge came forwa-d and in a few well chosen remarks thanked the bar and the meeting for the expres sions of confidence and esteemed the resolutions contained. Whereas our English ancestors rod their decendants in America have for nearly a thousand years had i court of tbe shire, or county court for hearing and determining the minor controversies of the people, a court especially intended for the masses of small means to save them from journeys and heavy expense, nd whereas such local tribunal is t great convenience to them and either it or some substitute will be necessary for letting to bail, ap pointment of guardians and person- 1 representatives, probate of wills tnd etc., therefore Resolved, by this mass-meeting  -f citizens of Buckingham county, held at this December connty court, 1903, that we regret the change in the, constitution abolishing this court. 2nd.  That in severing our rela tions with the incumbent, Judge John R. Moss, we bear cheerful testimony to tbe intelligence, integ rity, ability and dignity with which he has discharged the duties of County Judge, and in his retire ment will carry with him our best i wishes for bis wellfare. 3rd. That these proceedings be certified to the County Court with the request that they be entered on I the minutes of the Court. Jndge Moss will tender his resig nation as Connty Judge of Buck ingham as soon as the present term is adjourned, and will assume his duties in the Legislature the first of the year. Governor Montague! will be requested to appoint Jndge Crute, of Farmville, to hold the I January term. In the Court the only case of any importance was that of J. A. Le- Sneur  Bro., applicants for liquor license at lpha, which was opposed by a large petition to the Judge, ask ing that license be not granted. The Jndge continued the case, and ren dered an opinion, in which he said he had rather the new Court would pais upon the application for . li cense when there is objection. J. A. Trent ws granted  license to sell liquor near Arvonia, there being no opposition to him. Peter Coles, of Albemarle, and Mr. Addie Spencer were hunting at New Store last week. They were! the guests of Mr. L. D. Jones. Mr. J, W. Word has been ap- to the position of store keeper for the National Government at a salary of 2 per day. It iB said Mr. Wiley Hubbard will be married on the 16th to a Miss Sims. Marriage licenses have been is sued during the month as follows Jas. P. Andrews to Emma Lang- horn Gantt, J. E. Pnrvis to Mary E. Miles. Mr. Henry Glencrossi Hebditch to Mies Ora Kyle Spen- oer, at Enon church on December 23rd at noon. The young lady is a daughter of Willis Bocock Spencer, and the groom to be is a son of Mr. J. W. Hebditch. I Justice Garnett held a trial Mon-1 day night, and fined Isiah Moss 5 1 and cost for swearing upon the i.reet, and placed him under a peace bond of 200. Mr. William Spencer, is perhaps, the happiest travelling man who represents a Lynchburg house. He sold for the Quin-Marshall Co., in about eleven months time 100,000 in drygoods and notions. When this fact was reported to Mr. Spen cer, he promptly served notice ou his employers that he had a vaca tion due him. His request was granted and for two weeks be has been the guest of his brother, Mr. Sidney Spencer, down in old Buck- iugham, where he has made many a fleety buck bite the dost before his unerring aim. December 15, 1903."}, "highlight": {"text": {"matched_tokens": ["T"], "snippet": "twelve .rars. Col. Kobt. <mark>T</mark>. Hub bard. Hon. E."}}, "highlights": [{"field": "text", "matched_tokens": ["T"], "snippet": "twelve .rars. Col. Kobt. <mark>T</mark>. Hub bard. Hon. E."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.24, 376.87, 2272.39, 1798.08], "bbox_id": "e318b342bb", "file": "AppomattoxNewspapers_1892-1898a_0111.pdf", "page": 1, "text": "F our M asked Men E n te r th e House of P leasant H endricks N ear Lynchburg, K nock H im In!the H ead and Set F ire to th e House. On Deo. 51st., on the Lynchburg and Durham railroad, about six miles from Lynqhburg, a terrible crime was committed. Some- three weeks prior to the tragedy, the young and attractive daughter of Mr. J. H. White, of Lynchburg, was married to Pleasant Hendricks, of Campbell co.unty. They made their home near Bocock Station shortly afterward, and livedhappily together. On the night of Dep. 21st. between 9 and 10 oclook, Mrs. Hendricks was sitting in her room reading The Chil dren of the Abbeyand Mr.Hendrioks was asleep. There was bnt little flip on the hearth. The door was bolted with an ordinary lock bolt. All at once it was broken down and four masked men rushed into the room. One of them held an axe in bis hand, and rushing to the bed struck Hendricks on the head with the sharp edge. Mrs. Hendricks, over come by the right fainted, and when she became conscious was lying on a hastily improvised- pallet out in the yard, where she supposed she had been taken by the murderers. Thie house was enveloped iiyflames. Many of the neighbors were attracted by the light, but arrived too late to ex tinguish the Are or to rescue the body. er trunk had also been refnpved and was placed so near the burning building that it caught on fire and was entirely consumed. While the crowd stood about the burning house it was whispered around that four negroes from Jaok- son Town, a small suburb of Lynofar burg, bad been seen hunting in the neighborhood. Suspicion being arous ed, parties were immediately dis- latohed to arrest them. A ndthis was accomplished before morningi hree of the negroes were arrested by officers, and the fourth one sur rendered himself. In the meantime, when the flames died down, a search wB instituted tot the murdered man, and after a long hunt they found what was left of the body. The heart, lungs and a few fragments of bones were all that remained of what a few hours before bad been a prosperous,happy human beidg. Mr. Hendricks was an industrious and well-to-do farmer of about forty-five years of age, ahd was not known to have bad an enemy. On the day before, however, be had brought home 200, He had given bis wife 15 and placing the remain der in an oil cloth sack had con cealed it in the bed.. It is thought, that, as Mr. Hendricks had been hauling posts to Jackson Town while he had this money in his pos session, the negroes must have dis covered the fact and planned the robbery. On Dec. 23rd an inquisition was held at the scene of the crime, anc. was adjoqrned to the 27th to the Law Building at Lynchburg. Mr. W. M. Murrell, assisted by Mr. Thos. Whitehead, Jr., conducted the exam ination for tbe commonwealth, while the prisoners were represented by Maj. T. J. Kirkpatrick, Judge H. M. Ford and Mr. James W. Wright. The only witness called was Mrs. Hendricks. She identified the fonr negroes as the persons who entered her house, bnt her testimony die i not 6onvince the coroners jury for they were divided in their opinions as to the guilt of the men arrested who were Commodore Johnson, Rob ert Smith, William Coghill and William Fields. The coroner, Mr. John W. Gills, and three of the jnrors declared the deed to have been perpetrated by tbe prisoners, while the remaining three decided that the fatal blow had been struck by parties unknown. The  murder continues to be the all-absorbing topic of conversation among the county people. Many now believe that the four negroes are the guilty parties, while many others do not think that the right men have been captured and, from the latest reports, we learn that considerable indignation is expressed at the unnecessary detention of the prisoners. ________________ Toga Notes. A gay crowd gathered at Toga,the attractive home of Mr. B. F, Spen cer, on the evening Of Tuesday the 26tb, ult. and were entertained most"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "made their home near <mark>Bocock</mark> Station shortly afterward, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "made their home near <mark>Bocock</mark> Station shortly afterward, and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1810.55, 948.91, 1972.3, 1451.86], "bbox_id": "83ceaf8674", "file": "AppomattoxNewspapers_1905-1912a_0473.pdf", "page": 1, "text": "ArcADuru. The Xmas week haa passed w ith the mud-king holding high carni val, hindering to a great extent the uj3ual neighborhood visiting. A few oc thoae-who were born and reared around hire ha be come back to the old homes for short visits, although hot as many as usual.  Bocock Spencer, wife nod two children from Mullins, W. Va., ore here. Millard Steger, wife end two ohildreu, of Amherst, - pent the week at the old Steger home, leav ing on Friday. Gaum Hebditch, from Newport News, spent the week nt his fathers. John Garnet and wife, nee Grace JSidhn, eame up from Onmberland to Nik Hall, her fathers home, to spend Xmas. W. C. Trents three daughters, Misses Graham, Jessie and Mattie, came home from their respective schools to spend the Christmas week.,  . Sorrow and suffering, twin visit ors to all ns poor mortals sooner or httet reigned in the homes of two neighbors, Mr. Bicbard Payne and Mrs. Ben Hooper. Their offerings are intense, alleviated in o far aa possible by competent physicians and loving ministrations of kindred and friend the happy thought be ing that .should the portals of death and not recovery be theirs co enter, each one Can echo David  solace,  l will fear no evil for Thou art with me Thy rod and T by stiff t hey comfort me"}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "as many as usual.  <mark>Bocock</mark> Spencer, wife nod two"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "as many as usual.  <mark>Bocock</mark> Spencer, wife nod two"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
