{"document": {"bbox": [443.33, 474.53, 763.06, 576.23], "bbox_id": "3b2e79ca73", "file": "AppomattoxNewspapers_1898-1902a_0667.pdf", "page": 1, "text": "Workman are giving the handsome residence of Dr. Julian H. Abbitt ken To TRer N orth- the finihjn touche8. vest. April 30th, 1902. I Mr. Martin Hancock and wife, of r.,  Western Railway j Christiansburg, are guests of their  P m  tMontan.u Wbo. j son, Mr. Walter Hancock. V Wasmngton, and Coast j Points at exceeding low rates from i Mrs. Annie Bledsoe came up from all stations. It is possible that rates i Norfork Tuesday to spend a few"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "handsome residence of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> ken To TRer N"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "handsome residence of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> ken To TRer N"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [445.45, 476.64, 766.65, 667.42], "bbox_id": "7910f30a76", "file": "AppomattoxNewspapers_1898-1902a_0666.pdf", "page": 1, "text": "Workman are giving the handsome --------------- residence of Dr. Julian H. Abbitt s To Tle North- the fini,hing touche8. West. April 30th, 1902.1 Mr. Martin Hancock and wife, of Western Railway j Christiansbuig, are guests of their  .Montano, Idaho, j 80 Mr. Walter Hancock. -MWaamrgton, and Coast I Points at exceeding low rates from i Mrs. Annie Bledsoe came up from 11 Stations. It is possible t hat rates  Norfork Tuesday to speud a few  ever be, 80  e.aP  days with her daughter, Mrs. A. II. ftgtUO J w ic e of three routes. Write for rates and schedules, say to what point yon ire going and your nearest station to this line N.  W. By. or W. B. Bevill M. F. Bragg, Gem Pass Agt. Trav. Pass. Agt. K Roanoke, Va."}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "handsome --------------- residence of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> s To Tle North-"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "handsome --------------- residence of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> s To Tle North-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.3, 1316.64, 1487.55, 1609.61], "bbox_id": "70a4cd8904", "file": "AppomattoxNewspapers_1926-1933a_0166.pdf", "page": 1, "text": "ober of teachers end stu- ipent the holidays withj iwple. Miss Mildred Me-j T, Eddie Babcock, of V. I Twyman, of Univer-I ferine Gills, of Rich-1 Thomas and Alfred Ab-1 f Bluefield, W. Va. y-Dark Jersey heifer, I  weight about 660 lbs. sway three weeks ago. W. j. L e G r a n d , 4 Appomattox, Va, j  ind Mrs. E. T. Barnes, of   C., announce the en- st of their daughter, Liz-  to Edward Ballou Ab- 1 of Mrs Julian H. and  Mr. Julian H. Abbitt of Pomattox. The wedding I place December 27th. Weiolidky gifts for every ot the family also ladies  t e r"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Julian H. and  Mr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> of Pomattox. The wedding"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Julian H. and  Mr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> of Pomattox. The wedding"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [308.89, 794.79, 478.78, 934.89], "bbox_id": "988103af7b", "file": "AppomattoxNewspapers_1939-1943a_0443.pdf", "page": 1, "text": "Mrs Julian H. Abbitt, of Hender- 4 n N.C., will arrive Saturday to  end several weeks in the home of - r.and iMrs. J.A.Burke. Mr.and Mrs. J. A. Burke, Jr., of R.chmond spent the week-end here. Choose To Live, a short subject v ill be shown at the Lee Theatre rich evening, beginning Monday, Ap- TT18, through Thursday, April 1 Vhe public is urged to see this show, -JL onsored by the Virginia Cancer a . dundatiom"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Mrs <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark>, of Hender- 4 n"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Mrs <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark>, of Hender- 4 n"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [553.69, 800.76, 707.02, 965.4], "bbox_id": "090ad2cfba", "file": "AppomattoxNewspapers_1918-1922a_0335.pdf", "page": 1, "text": "Mr. H. M. Hurt, wife and sis ter, of Biackstone, are guests at the home of Mr Robert Irby Mr Jas. Browning, of Rock bridge county, is visiting at the home of Mr K. A. Hamilton. Mr. and Mrs. John Rose, of N C , are visiting at the home of Mrs. Julian H. Abbitt here. Our printer left us without thi week. We are doing our best to get the paper out on time."}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.89, 870.98, 1766.49, 904.98], "bbox_id": "8ef66c301d", "file": "AppomattoxNewspapers_1918-1922a_0334.pdf", "page": 1, "text": "Mr. and Mrs. John Rose, of N. C , are vieiting at the home of Mrs. Julian H. Abbitt here."}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Mr. and Mrs. John Rose, of N. C , are vieiting at the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "Mr. and Mrs. John Rose, of N. C , are vieiting at the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.31, 697.7, 1772.75, 980.85], "bbox_id": "590b1f3e77", "file": "AppomattoxNewspapers_1918-1922a_0208.pdf", "page": 1, "text": "Miss Lillie Thornhill is visit ing at the home of Mr. G. O. Thornhill in Stonewall. Mr.and Mrs. Upton, of W.Va. have been visiting the formetk brother here this week. It is said that Mr. Tiiomab Babcock hat bought a lot in town and will build at onoe Mr. H. m . Hurt, wife and sis ter, of Biackstone, are guests at the home oi Mr. Hubert Irbj Mr Jas. Browning, of Rock bridge county, is visiting at the home of Mr K. A. Hamilton. Mr. and Mrs. John Rose, of N. G , are visiting at the home of Mrs. Julian H. Abbitt here. Our printer left us without this week We are doing our best to get the paper out on time."}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.94, 1620.7, 1961.97, 1737.83], "bbox_id": "5dc7583001", "file": "AppomattoxNewspapers_1902-1905a_0169.pdf", "page": 1, "text": "desire to express our deepest grati tude for the loving deeds of kind- I ness bv the many hands that mini stered. Much more than we can ex-  press is due the skill and careful- j ness of Dr. Julian H. Abbitt ati-i tbe well trained nurse, Miss Bessie li bears. May the blessings of God attend them both, and give them nealt.ii and long life, as a blessing to humanity. H. W. D unkley . Septem her 23, 1903."}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "j ness of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> ati-i tbe well trained"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "j ness of Dr. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> ati-i tbe well trained"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.44, 751.63, 1079.2, 1254.43], "bbox_id": "bae555c092", "file": "AppomattoxNewspapers_1918-1922a_0209.pdf", "page": 1, "text": "covoanies at best rate Mr. and Mrs have been visiting the formert brother here this week. It is said that Mr. Thomas Babcock has bought a lot in town and will build at once Mr. H. M. Hurt, wife and siB ter, of Btackstone, are guests at the home ol Mr. Robert Irb Mr Jas. Browning, of Rock bridge county, is visiting at the home of Mr R. A. Hamilton. Mr. and Mrs. John Rose, of N. 0 , are visiting at the home of Mrs. Julian H. Abbitt here. Our printer left us without this week We are doing our best to get the paper out on time. Mr. A. B. Abbitt, of Newport News, was up this week to in spect his new home just com pleted at Vera. It is said that Mr. Ed Jamer- son has sold his farm Jno Inge place near Evergreen to a man from Arkansas. Mr. John Murphy, of Lynch burg, was a visitor here Sunday at the home of his sister, Mrs L F. Callaham. Mr. and Mrs. H. D. Flood are at Eldon Farm for the summer. Mrs. Marcia MacClennan ac companied them. The young people enjoyed a dance at the hall here Monday Lynchburg furnished"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "the home of Mrs. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark> here. Our printer left"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1346.9, 527.9, 1513.16, 1497.67], "bbox_id": "b97d95d155", "file": "AppomattoxNewspapers_1918-1922a_0115.pdf", "page": 1, "text": "A n ice plant is greatly need ed at Appomattox Mr. W illiam Hubbard is out again after a long spell. We have no printer and ask tho indulgence of patrons until we can fiDd one. Mr. Henry Sheltoi East has returned to Virginia Medical College. Misses Grace and Beatrice East have returned to Virginia In Vermont College. Mr. Justin Burkey, of Canal Z.ne, U. 8. A., is spending a vacation here with bis parents Mr. P. W. Ricamore, of Berry- ville, Va., after spending a few days at Baptist parsonage has returned to V. P.,1. Mr. Clark Caldwell returned to Richmond College Monday afior spending the holidays with his home people. r. T. F. Covington, who has been confined to his room for several weaks with a sprain ed ankle is out again. Tbe postoffice and etoie be longing to Charlee Harvey, of Spring Mills, was completely destroyed by fire on Sunday night. The fire is of undeter mined origin. The friends of Messrs. Thomas and Holcombe Harvey are un easy about their condition They are both ill at their home near Rose Bower. Messrs. Richard Smith aud Chas. Hanenkrat left for Texas where they go to engage in the truck business. Best wishes of our people follow them. Mr. Sam Gunter, of Roanoke, returned after a visit to his home people. His father, Mr W. T. Gunter, has bought the Ragland Featberston farm, near Liberty Chapel, at 4,000. Services at Liberty next Sun day at the usual hour. At th. close of the morning servic the Lords Supper will be ob served. Miss Dorothy Fox,of Emporia, after spending a few da s at the Baptist parsonage, has re turned to Virginia Intermont College. Julian H. Abbitt, who is stationed at the Naval Train ing school at Hampton Rboads has returned after a visit to his mother, Mrs. Julian H. Abbitt. Mr. Raymond Caldwell and .sifters, Misses Eltba and Stella, of Bedford, spant the past week ati the home of Mr. and Mrs J1 W. Jenkins, Jr. They Ire accompanied home the laiit of the week by rB. Jen kb D t R. H. Bennett, who was ccsneMtRd with the Centenary Fond  f i l l speak at Liberty BaptistVetiurch next Tuesday"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "to Virginia Intermont College. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark>, who is stationed at"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "to Virginia Intermont College. <mark>Julian</mark> <mark>H</mark>. <mark>Abbitt</mark>, who is stationed at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1809.86, 254.42, 1989.01, 1143.76], "bbox_id": "34407d8374", "file": "AppomattoxNewspapers_1892-1898a_0207.pdf", "page": 1, "text": "M agnificent Reception. Court view, the handsome reside nee of Mr. and Mrs. C. W. Hunter jr, was the sene of a most cujoyable and entertaining reception and dance on Christmas night. The spacious parlors were fulled by nine, and by ten the dancing, which lasted until 2 oclock was begun after which time he guests took a reluctant leave of their hostess crying with them many pleasant reccollections of the Christmas night of 1894. The halls and large danceing rooms were ar tistically decorated with American beauties and evergreen. The Parlors were very beautiful clothed in mistletoe and Marschal Neils The dining hall was attractively trimmed in cedar and La France Roses. Mrs. Hunter the handsome hostest was assisted in receiving by Miss Georgie Morgan of Lynchburg and Misses Anna and Nina Jones of Appomattox. At 11 oclock the danceing was interrupted for a while by a magniflicent snpper served in manner agreeable toall. We notice a few of the numerous guests whose names and costumes we give alone. Mrs. C. W. Hunter. Blue satin, duchess lace and diamonds, Miss Georgie Morgan, of Lynchburg white satin and diamonds, Miss Anna Jones, cream silk and point lace, Miss Nina Jones. Lemon .ilk lace, pearls. Miss Eddie Hardy, cream heneretta, lace and natural flowers, Miss Maggie Smith, helietrope ere pon, lace and natural flowers, Miss Carrie Smith, helitrope crepon, lace and natural flowers, Miss Lacy Caldwal, garnet silk and rubbies Miss Lena Collins, of Lynchburg, yellow satin and diamonds, Mrs. Collins, of Lynchburg, Black silk and lace, Miss Lizzie Davidson of Bedford City, pink henereatta, lace and diamond, MissElma Shearer of Spout Springs white heneretta and lace, Miss Viola Shearer, of Spout springs, Blue crepon and lace Miss Susie Jones, of Spout Spring, blue albotrosa, Mrs. M. L. Harvey, cream brocaded satin, lace, diamond? aud flowers. Among the gentlemen were notie ed Dr. Julian Abbitt. Hon. H. ! Flood. Col. R. B Poore. Messrs R. C. Harvey, I. C- Hunt, W. A. Moses F. W. McKiney, Len Line Hun ter Smith, J. C. Jones, Messrs Collier and W. J. Trent, Messrs, Morrman, Vest, Walkers, Chalkley and Roach of Lynchburg and Mosley, Arthur and Burkes of Bedford city. Mrs. T. A. Smith, brown satin,dia monds, presided over the chocalate urn assisted by Mrs. N. H. Gregory, Mrs. Chap Jones, black silk, super intended the coffee were assisted by Mrs. Chas Hancock and Mrs. Jones of Texas. ____"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt", "H"], "snippet": "were notie ed Dr. <mark>Julian</mark> <mark>Abbitt</mark>. Hon. <mark>H</mark>. ! Flood. Col. R. B"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt", "H"], "snippet": "were notie ed Dr. <mark>Julian</mark> <mark>Abbitt</mark>. Hon. <mark>H</mark>. ! Flood. Col. R. B"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1742.33, 264.64, 1904.56, 1796.27], "bbox_id": "a034ecb80e", "file": "AppomattoxNewspapers_1892-1898a_0069.pdf", "page": 1, "text": "Hop  and Supper at H otel A ppom attox. On the evening of July 27th there occurred an event which, for the en joyment of the moment and for the pleasant memories engendered,stands conspicuously eminent in the social annals of Appomattox. It was a hop given by the yonng men of our town. Concdrd, Spout Spring, Campbell, Prince Edward and Appo mattox furnished delegations of the most beautiful, and toilets of ex quisite and artistic taste. There was a lovely night with the fu ll moon shedding its mellow light, there were the sweet strains of music with the rythmic shuffling of dancing feet, and there was the merry talk and laughter of the gay participants, all combining to render the occasion pe culiarly enjoyable and a pronounced success. The future can contain nothing pleasanter than a repetition, and Appomattox may well say that for her to undertake is to succeed. The young ladies present and their toilets were as follows. Miss M. Anna Jones, lemon silk, trimmed in Irish point lace, passe menterie, no ornaments. Miss Nannie Wharton, white silk, lace trimmings. Miss Susie Jones, white crape, lace and diamonds. Miss Maggie Bevely, pink silk and natural flowers. Mrs. C. W. Hunter, black silk and white mulL Miss Slate OConner, albatross and point lace. Miss Nina Jones, orange silk,black point lace and diamonds. Miss Susie Evans, pink m ail, point lace and diamonds. Miss Sallie Arrington, cream silk and point lace. Miss Elma Shearer, white silk m all, and pearls. Miss Lula Peers, blue m ull, black lace, natural flowers, and diamonds. Miss Agnes Wooten, pink silk, natural flowers, and lace. Miss Erie Jones, white albatross, lace, and pearls. Miss Lucy Smith, blue mull,natu ral flowers. Miss Lina Davidson, white mnll and natural flowers. Mrs. Martin Harvey, white m ail, lace, and natural flowers. Miss Mattie Tweedy, pink lawn and point lace. Miss- Sallie Bnrke, white mull, natural flowers, and diamonds. Miss Maggie Smith, N ile green, natnriir flowers, no ornaments. Miss Lizzie Davidson, bine silk, natural flowers, no ornaments. Mrs. J. R. Atwood, black satin, point lace, and diamonds. Mrs. Lena Smith, white mnlL Miss Polly Main, black lace, rib bons, and natural flowers. Miss Florrie Arrington, cream silk, natural flowers, and point lace. Miss Viola Shearer, white alba tross, lace, and diamonds. Miss Sallie Ballou, white m ull and lace trimmings. Miss Phinizy Abbitt, white silk and lace t rim m ing. Miss Carrie Lee Davis, yellow crepon and rubies. The following ggbtlemen were present J. H. Bailey, Ewen Davidson, A. Dunn, H. G. Smith, Jno. Robertson, Edmund Miles, Frank McKinney, Clem Coleman, Taylor, W. W. Statham, Irby, J. Robertson, W. E. Doss, Wm. J. Trent, Collier Trent, G. W. Chockley, R. C. Harvey, Chap Jones, Wm. Moses, Boht. Watkins, Jno. M. Miles, Overton Nowlin, S. L. Ferguson, Dr. Julian Abbitt, Senator H. D. Flood. The gratitude of every one is due to qur kind host and hostess, Mr. and Mrs. Smith, who extended to the yonng people the well-known hospi talities of Hotel Appomattox, and who by their untiring efforts con tributed largely to the charming sncce88 of the occasion. Pam plin City B udget. The Baptists commenced a series of meetings at Hixbnrg on Sunday last. They are largely attended. Rev. Dr. Bagby, of Farmville, is as sisting the pastor, Rev. J. H. Conch, in the meetings. Misses Virginia Gilliam, and An nie McCraw, of Buckingham, are visiting at Mr. H. E. Gilliams. Rev. E. M. Craig returned to his charge at this place on the 31st nit., after a vacation of a month. Mr. C. S. McDearmon, night ope rator at yonr place, was in town to day. Mrs. Chancy, of Sntherlin, Va., is visiting at Mr. W. BL Rices. Mr. R. B. Green, of Richmond, is in town. P. H. E. Pkmplin City, Aug. 2."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt", "H"], "snippet": "S. L. Ferguson, Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Senator <mark>H</mark>. D. Flood. The gratitude"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt", "H"], "snippet": "S. L. Ferguson, Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Senator <mark>H</mark>. D. Flood. The gratitude"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1103.75, 201.73, 1258.11, 300.58], "bbox_id": "7b40556dab", "file": "AppomattoxNewspapers_1918-1922a_0165.pdf", "page": 1, "text": "Julian H lnm -r Abbitt, of Appomattox, is one of tbe ten men at the top of the class now taking the course at the Y o man School at the Naval Training Statior, Hampton Roads, Va This school is really a business school, and fits its graduates for g neral office work. Abbitt is at pres"}, "highlight": {"text": {"matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "<mark>Julian</mark> <mark>H</mark> lnm -r <mark>Abbitt</mark>, of Appomattox, is one"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H", "Abbitt"], "snippet": "<mark>Julian</mark> <mark>H</mark> lnm -r <mark>Abbitt</mark>, of Appomattox, is one"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.86, 336.88, 1646.34, 1318.86], "bbox_id": "f3f6cd8af2", "file": "AppomattoxNewspapers_1922-1923a_0351.pdf", "page": 1, "text": "D ies Sud d en ly a t H is H om e H ere Thursday. Dr. Julian Hamner Abbitt passed away at his residence here early Thursday morning, , suddenly. He bad been attending to bis profes sional duties all day, and was chat ting pleasantly with his family un til bed-time Wednesday night. About, midnight he compl-iined of feeling badly and bis wife and nephew attended him, and thought his c mdition satisfactory about 2 a. m. Thursday he was seized with a violent attack of indigestion and heart trouble and passed peacefully away in a short while. Thursday morning the news of his eath soon entered the homes of our people and without an ex ception the sorrow and gloom were perceptible everywhere. Business was suspended and sorrowing friends mingled their tears with the afflicted family around the lifeless body of tbeir physician aud friend. The deceased was in the 88 h year of his agein the prime of his life and was a splendid speci men of vigoroas manhood. He was a skilled physician, a friend to the poor, and a comfort to the afflicted and suffering. His practice was heavy, yet his love and devotion for -bis profession caused him to endnre many hardships and to work too hardtruly he died with his boots on, The rich and well-to-do will miss him, the afflicted poor sustains an irreparable loss, and the connty an upright, Christian gentleman. The deceased leaves to mourn his sadden death, besides his widow, who was Miss Sallie M. Ballou, of Halifax, aud four small children Frances, Edward, Juliau and Wil liam llenry, his aged father, Dr. W. H. Abbitt., and brothers. A. W. Ablnu, of Lynchburg, Bev. Geo. G. Abbitt, of Kentucky, JoUn D. Ab- biir, or Franklin, Va., E. R Abbitt and Dr J B. Abbitt of Appomat tox, and sistersMrs. G. A. Gole- mau and Miss Annie Abbitt of Appo attox. His body was prepared for burial and the funeral services were an- n u ced for Saturday iu order lo give relatives and friends from a distance an opportunity to attend. On.lurday evening tbe funeral took place from Liberty church, where be hud been a consistent member tor years aud was conduct ed by his pastor, Kev. Geo. Kenaard, assisted by Hevs, Hugh C. Smith, his former pastor, of Emporia, Va. H. T. Allison aud W. L. Murphy. The interrmeut was made at Liber ty cemetsry. A select choir from Lynchburg, assisted by local tilcut sang sweetly aud tenderly The Uhrisltaus Good Night aud Ab de wi ll Me. Tbe remarks of the pastors bearing upon the life of the deceased were tender and consoling to the bereaved audience. 7he family selected the follow ing pali-beurers and flower dealers"}, "highlight": {"text": {"matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "is H om e <mark>H</mark> ere Thursday. Dr. <mark>Julian</mark> Hamner <mark>Abbitt</mark> passed away at his"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "is H om e <mark>H</mark> ere Thursday. Dr. <mark>Julian</mark> Hamner <mark>Abbitt</mark> passed away at his"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.55, 690.45, 1645.42, 747.95], "bbox_id": "daed49c273", "file": "AppomattoxNewspapers_1892-1898a_0362.pdf", "page": 1, "text": "Messrs. J. K. Hannah, C. H Chilton, present incumbent, and Dr. Julian Abbitt are candidates for the appointment of school superin tendent for this county."}, "highlight": {"text": {"matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "Messrs. J. K. Hannah, C. <mark>H</mark> Chilton, present incumbent, and Dr. <mark>Julian</mark> <mark>Abbitt</mark> are candidates for the appointment of school superin tendent for this county."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "Messrs. J. K. Hannah, C. <mark>H</mark> Chilton, present incumbent, and Dr. <mark>Julian</mark> <mark>Abbitt</mark> are candidates for the appointment of school superin tendent for this county."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.48, 1015.2, 1667.13, 1086.15], "bbox_id": "aa5ba87e16", "file": "AppomattoxNewspapers_1892-1898a_0401.pdf", "page": 1, "text": "Dr. Julian Abbitt assisted by Dr. Dew, W. H. and J. B. Abbitt operated on Mrs. Thornes Cole man Tuesday and removed a very large wen. She is doing as well as could be expected."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt", "H", "Abbitt"], "snippet": "Dr. <mark>Julian</mark> <mark>Abbitt</mark> assisted by Dr. Dew, W. <mark>H</mark>. and J. B. <mark>Abbitt</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt", "H", "Abbitt"], "snippet": "Dr. <mark>Julian</mark> <mark>Abbitt</mark> assisted by Dr. Dew, W. <mark>H</mark>. and J. B. <mark>Abbitt</mark>"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1628.4, 736.12, 1797.95, 1699.33], "bbox_id": "341a11fd88", "file": "AppomattoxNewspapers_1902-1905a_0104.pdf", "page": 1, "text": "C h ild ren s H om e Society V irg in ia . The Childrens Home Society has been at work about 20 years. It was organized in Virginia only two years ago. In this comparatively short time many children have been rescued from a wretched fate, fittéd out in decent apparel and are now doing well in approved family home3. .The aim of the Society is 1. To find and obtain legal guar dianship of homeless children in Virginia. 2. To place these children in good family homes. 3. To see that the children thus, placed are not neglected or abused. 4. To save these children from pauperism aud crime, aud thus save the State from the grievous burden of taxation for their future care, aud from the danger of debased cit izenship arising from neglected childhood. The special features are 1. Systematic search for homes. 2. Constant outlook for depend ent and abused children, orphans, half orphans and worse than or phans. Many institutions do not take any but full orphans. 3. The Society has by law the gbt, with the sanction of the courts, to take children away from rossly cruel aud immoral parents. 4. Thorough organization, exten sive correspondence, distribution of literature, public addresses. 5. Strict economy, no costly build ings. Our aim is to place the child in a home with the least possible delay, in the meantime boarding them with some existing institution Rev. Wm. J. Maybee, the State Superintendent, was in West Appo mattox Sunday. He preached at the Methodist church in the morn ing and at Liberty Baptist at night. On this occasion there was a union service. All the pastors were pres ent. Mr. Maybee presented the claims and a local society was or ganized. Local Advisory Boards are organ ized in the centres of population to look after the interests of the Society in their respective communities, and report homeless children, and pass upon the character, social standing and financial ability of families in their neighborhood applying for children. The following were elected as our local board Messrs. S. L. Ferguson, A. H. Clement, J.R. Horsley and Dr. Julian Abbitt and Mesdames J. W. Flood, T. A. Smith and Ernest Gills. Miss Frances E. Willard, the philanthropist, said It is like all great discoveries, simple, practical, just the thing. We wonder where our wits were that we did not think of such a plan long ago. Persis tently followed out on a large scale, it will change the face of civiliza tion, cure poverty, kill out crime and bring forth the millenium. The work of the Society is pure charity. No charge is made for re ceiving a child or placing one in a family. All contributions are voluntary. All persons knowing of homeless or grossly abused children, and all persons who wish to take such children into their homes, should address Rev. Wm. J. Maybee, State Superintendent, Box 635, Richmond, Va., or see some member of the local board. The local organization o"}, "highlight": {"text": {"matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "S. L. Ferguson, A. <mark>H</mark>. Clement, J.R. Horsley and Dr. <mark>Julian</mark> <mark>Abbitt</mark> and Mesdames J. W."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "S. L. Ferguson, A. <mark>H</mark>. Clement, J.R. Horsley and Dr. <mark>Julian</mark> <mark>Abbitt</mark> and Mesdames J. W."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.03, 730.26, 1594.8, 776.26], "bbox_id": "fad0d43718", "file": "AppomattoxNewspapers_1902-1905a_0153.pdf", "page": 1, "text": "Mrs. Dr. Julian Abbitt and child ren, who have been .visiting h er parents jn Halifax county, returned home yesterday."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt", "h"], "snippet": "Mrs. Dr. <mark>Julian</mark> <mark>Abbitt</mark> and child ren, who have been .visiting <mark>h</mark> er parents jn Halifax county, returned home yesterday."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt", "h"], "snippet": "Mrs. Dr. <mark>Julian</mark> <mark>Abbitt</mark> and child ren, who have been .visiting <mark>h</mark> er parents jn Halifax county, returned home yesterday."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1522.98, 793.35, 1842.6, 1252.85], "bbox_id": "6c6628ac38", "file": "AppomattoxNewspapers_1892-1898a_0444.pdf", "page": 1, "text": "tried.  There was a large crowd in attend ance Monday and hard cider and negro fights were enjoyed by many. Mayor Pearson presides with great dignity and dispenses justice to the offenders. Messrs. W. A. Moses, W. J. Trent, and Dr. Julian Abbitt represented I he Misses Boberts, of Lynchburg I jonroe jjdge o Masons, who met who have been the guest of Miss I a delegation from Andersonville Annie McCraw have returned home. I Lodge at the courthouse, where a Mr. Monroe Flood is quite ill a tI love feast and reunion is said to have his home near here. I een enj 0 yed, and everything here After the 2nd buuday there will I roay he said to be O. K. on the be prayer meeting at Bethel church I gqUare every Wednesday night. We will be Hon Wm. M. Cabell, H. D. glad to see any who wish to join. Ploodj Frank iow and a . H. Mr. Floyd Wheeler is expected I dem ent, attorneys were in attend- over Saturday. j ance fr0m a distance. is an abundance of apples, I The citizens are anxious for the this summer, but the people Hve I railroad to come up to the court- changed and even let the apples I house, and if they fail in this an ef- waste on the ground rather than sell I oi.j. wm he made to move thecourt- them for some purposes. house to White Hall it is said. Mrs. E. Van Anderson anddaugh-1 qhe Democrats will hold a mass- have returned home after visiting I meeting at the ooarthouse next her old home near Centenary. I Tuesday. Sept. 21st, at 1 oclock to Contributions shall be sent more ejec 2 1 delegates to tbe convention regular from this place in the fu  which meets at Cumberland court house Sept. 30th, for the purpose of nominating a candidate for the House of Delegates, Democrats are urged to attend. _ The continued drought is drying up streams and rendering pastures useless. I- Z. Ye editor has just return from"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "J. Trent, and Dr. <mark>Julian</mark> <mark>Abbitt</mark> represented I he Misses"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "J. Trent, and Dr. <mark>Julian</mark> <mark>Abbitt</mark> represented I he Misses"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [598.53, 720.79, 760.88, 1087.25], "bbox_id": "4d6c78811c", "file": "AppomattoxNewspapers_1892-1898a_0529.pdf", "page": 1, "text": "The Mathematics Medal, offered by Dr. Julian Abbitt for proficiency in Mathematics, was delivered bv Rev. Patrick Warren to Miss Lilly Hancock. After the medals were awarded all of the contestants were addressed by Hon. H. D. Flood. Then the entire school was ad dressed by Dr. Taylor. I 11 addition to the-, above men tioned speakers. Superintendent J. K. Hannah, and Trustee J. F. Dickerson were on the stand, who made brief speeches endorsing and praisipg the progress made in the school. They expressed themselves g8 being highly satisfied .with the work aud to all appearances they were as full of the commeucement as one o fjh e ndalista.  Mrs. J. R. Atwood presided at the organ, and direcred the music dur ing the exercises. The Concord String Baud, composed of Mess4. S. Hoffman Fisher, William Steele and Haunah Evans, entertained the audience with sweet music from popular selections. PICIMARY DEPARTMENT,"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Medal, offered by Dr. <mark>Julian</mark> <mark>Abbitt</mark> for proficiency in Mathematics,"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Medal, offered by Dr. <mark>Julian</mark> <mark>Abbitt</mark> for proficiency in Mathematics,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [923.99, 342.76, 1093.04, 1043.0], "bbox_id": "81e934b0b8", "file": "AppomattoxNewspapers_1898-1902a_0006.pdf", "page": 1, "text": "The Concord uud W. Appomattox aorcgation appeared on the diamond for the first tijne this season iu practice game with Rustburg team last Saturday. Although the man ager of the home team was forced to appear against this up-to-date team with one scraped up anywhere he could get them, the Bustbnrg hoys didnt have t he cherry pie that they imagined. Chamberlayne te turned only that morning sick and broken down and was in no condi tion lo pitch, and he missed his last years catcher, Mr. Lee, who is now doing the tight rope and wire act in the Moore Family Indian show The Yellow Ball predominated throughout the game, and with  complete battery md regular pract ice the home team will lie more than h match for Rusthnrg or anv team on this road. The game was urn pired Ly Messrs. Fisher aud Reed The onlv accident was the hiltin of Mr. Winston McKinney of von town, who had been plaving gilt edged ball up to that time, but was compelled to retire from the game. The score stood 14 to 6 in favor of Rustbnrg. The mauager is taking steps to perfect the organization and strengthen the home earn before another game. The small pox scare was a false alarm, and there is not a case or suspect iu this connty, if there is a veritable one in the country. Dr. W. F. Fisher returned to Portsmouth last Friday. The condition of Rev. Wm. Fishei is slightly improved, but is still very weak. Mr. Jos. Farrar of Nashville Tenn. was in town one day last week. Messrs. W. A. Moses, R. C. Har- vev, Farrar, W. H. Burke, W. D. Browning, Winston McKinney and others of your town were here Sat urday. Mr. Linthicnm. of Blue Ridge Springs was visiting friends here Sunday. Misses Lee Steele aud Annie Staples went to Lynchburg, Tues day. Dr. Julian Abbitt was in town Saturday. Q uid VUNO."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Lynchburg, Tues day. Dr. <mark>Julian</mark> <mark>Abbitt</mark> was in town Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Lynchburg, Tues day. Dr. <mark>Julian</mark> <mark>Abbitt</mark> was in town Saturday."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1847.28, 332.14, 2002.64, 515.49], "bbox_id": "0cf6c64ea8", "file": "AppomattoxNewspapers_1915-1918a_0332.pdf", "page": 1, "text": "SundayForeign and Indian ChildrenBy Y. W. A. and Sunbeams. MondayHome Mission As setsBy Miss Eddie Hardy. TuesdayChurch Extension By Mrs. Atwood, Mrs. Julian Abbitt and Mn. Lindsay Craw ley. Wednesday  M o u n t a i n SchoolsBy Mrs. W. P. Gills. T h u r s d i yFrom Port to PlainBy Mrs Bledsoe. FridayOur Outlying Oppor tunities--By Mrs. 0. W. McEl roy."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "By Mrs. Atwood, Mrs. <mark>Julian</mark> <mark>Abbitt</mark> and Mn. Lindsay Craw"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "By Mrs. Atwood, Mrs. <mark>Julian</mark> <mark>Abbitt</mark> and Mn. Lindsay Craw"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.29, 337.9, 1962.03, 735.1], "bbox_id": "3f151af64c", "file": "AppomattoxNewspapers_1908-1909a_0336.pdf", "page": 1, "text": "STONEWALL j Bra are bus sowing I j eek I wheat. I1 Mr. and Mrs, Bert D. Strata Mrs. C. W. Potts, of Lynch- and children are moving J urg, is spending several days to Concord this week and will lis week at Allendale and at- oc.upy the J. P. Scruggs resi- mding the Appomattox Fair. L ence Mr. and Mrs. Julian H. Hill! Mr. and Mrs. Clayton T.j nd children, Jane and Hutapn, Drinkard and F. E. Jennings, pent Saturday night and Sun. I Jr. and Mrs. W. H. Drinkardl a the home of Mr. W. W. visited Rev. A. I. Caudle and JBrien family in Dillwyn Sunday. I Mrs. Jennie Bondurant, Miss Miss Grace Burnett served Eieanor an Malcolm, of Lynch i delightful dinner party last L urf Mr and F. E j enJ Jaturday evening in honor jnings and children were Sun- diss Hallie Burnett and young ly . guests of W. H. Drinkard. -riends of Lynchburg. Miss I priends of John Laughorn  Phoebe OBrien was also  U ji be glad to  ar he Is do!ng ues- Inicely at Lynchburg hospital, Miss Elizabeth Abbitt and I after being in a wreck Wednes- parents and Mrs. Evrod Connor day night and haring hia col- of Appomattox spent Sunday lar bone and hip broken and in Vera at the home of Mr. other minor injuries. Geo. F. Abbitt.     ------- I T he Fair The three banking institu-1  1 tions of the county have reports Great crowds are visiting the published in this issue. It is 1 Fair and the attractions are gratifying to observe that aN I unusually interesting. Fine"}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "ence Mr. and Mrs. <mark>Julian</mark> <mark>H</mark>. Hill! Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "ence Mr. and Mrs. <mark>Julian</mark> <mark>H</mark>. Hill! Mr. and Mrs."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2075.7, 378.47, 2237.14, 753.52], "bbox_id": "3ed4340ce9", "file": "AppomattoxNewspapers_1902-1905a_0235.pdf", "page": 1, "text": "Mrs. Sam Farrar, of Tuggles, was called to the bedsde of he. brother, Mr. James Paris, of Titus, last week but found him much improved. He had been suffering with rheumatism. She has returned home accompanied by her husbands little uieoe, Miss Earl Farrar, of this place. Mr. F. H. Thorntons on, Bas- j come, is very ill. W-- hope he uiuy soon be out again. Mrs. E . H. Cuwihoru is improving, muclYto the delight of her many friends. , Mrs. W. W. Raglands little son, Hallie has been sick for several days. Dr, Julian Abbitt was called In see him Sunday, He is improving. Dr. Abbitt also lanced a boil on little Acree Southalls neck while here. We were glad to see the Dootor so much improved. Miss Willie Wooldridge visited her grandparents at West Appomat tox last week. We are sorry that yonr Sonthside correspondent has been sick. We miss her interesting tetters. There is a large orowd of colored men leaving here today for the West to work in the coal fields. January 18, 1904."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "for several days. Dr, <mark>Julian</mark> <mark>Abbitt</mark> was called In see"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "for several days. Dr, <mark>Julian</mark> <mark>Abbitt</mark> was called In see"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [370.56, 519.36, 530.07, 1237.78], "bbox_id": "78b1b37ff8", "file": "AppomattoxNewspapers_1918-1922a_0540.pdf", "page": 1, "text": "Mrs. Julian Abbitt and son, Julian, are visiting relatives here for a few day. By land Mann, who has been indisposed for a few days it no back at work. Fr the common everyday ilL 01 mankind there is nothing to equal Taaluc. Chas. F. James. Miss Eloise Atwood is home from Hollins College on ac count of sickness indidnately. Mrs. LeRoy Smith leaves to gpjml Thanksgiving with her mothtrin Halifax to-day. Mies Sailio Jones, one of the valued teachers in our school here left to day to spend her Holidays in Richmond. . Mr. M. W. Cheatham, of Boanoke, paid this office a pleasant visit Saturday and renewed his subscription. Airs. T. T. Roberts and son, Henry, are visiting her daugh ter, in Columbus, Ouio, for 10 days. Mr. Luther McKinney, of Lynchburg, Va., is visiting his brother, Winston, and en- I jviug a hunt. Mrs. L. D. Puckette spent the week-end with her sister, Mrs. W. S. Bryant, near Holly wood. Mr. Jim Chenault wife and children and mother motored from Lynchburg Sunday to the home of Urs J. J. Fore. W. U. T. U. will meet Friday alternoon at the home of Mrs L E. Smith. A il members are urged to be present. Remember the Red Cross Leies and join the Appomat tox organization to help the neady of our county. Charksgiviag to - morrow ihursday and the business of the town wiii ba generally suspended. Our market has opened for Buie of tobacco. Top prices and good service guaranteed. F akmebs T obacco a . H . C o . I nc . 11-2-41"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt", "Julian"], "snippet": "Mrs. <mark>Julian</mark> <mark>Abbitt</mark> and son, <mark>Julian</mark>, are"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt", "Julian"], "snippet": "Mrs. <mark>Julian</mark> <mark>Abbitt</mark> and son, <mark>Julian</mark>, are"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1969.69, 1173.76, 2132.24, 1521.45], "bbox_id": "e4d2088f35", "file": "AppomattoxNewspapers_1902-1905a_0055.pdf", "page": 1, "text": "Mrs. Jim Me Dear mob is slowly improving from her recent illness. Mr. J. W. Ransou was at Pumpliu last week very sick, but is now well enough to commence work.  Mr. Hector Cawthorn retarded to his place of business in Portsmouth, Ohio, last Wednesday, much to the regret of bis many frifepds. Miss Maud Ragland and little brothers, Huilie Flood and Harry Tucker, spent Sunday the 1st with Mrs. Dr. E. E. Walker, bf Pampliti City. While there they had the pleasure of meeting many old friends A little stranger came to the home of Mr. H. Almonds on Wednesday last. Its a wee little boy! Mr. Bam Fergnson, With his little daughter, visited his parents not long sinoe. Mr. Leslie Mann has aocepted work in the Hill City. Dr. Julian Abbitt was in our vil lage every day last week, exospt Friday. Mrs. W. E. Akers is now the guest of her parents near here. New Light school, taught by Miss Bertha Woolridge, will soon close, but she will begin a private school at the close of the session. We are so glad to have her among us, and will miss her so much when she has to leave, bat hope it wont be soon."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "the Hill City. Dr. <mark>Julian</mark> <mark>Abbitt</mark> was in our vil"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "the Hill City. Dr. <mark>Julian</mark> <mark>Abbitt</mark> was in our vil"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.63, 262.72, 1869.06, 322.12], "bbox_id": "833539d741", "file": "AppomattoxNewspapers_1902-1905a_0138.pdf", "page": 1, "text": "Mrs. Frank Browning is visitii at the home of Mr. R. H. Browning. Mrs. Ballowe, of Halifax, wai last week the guest of her daughter Mrs. Julian Abbitt here."}, "highlight": {"text": {"matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "Mrs. Frank Browning is visitii at the home of Mr. R. <mark>H</mark>. Browning. Mrs. Ballowe, of Halifax, wai last week the guest of her daughter Mrs. <mark>Julian</mark> <mark>Abbitt</mark> here."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian", "Abbitt"], "snippet": "Mrs. Frank Browning is visitii at the home of Mr. R. <mark>H</mark>. Browning. Mrs. Ballowe, of Halifax, wai last week the guest of her daughter Mrs. <mark>Julian</mark> <mark>Abbitt</mark> here."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1715.47, 953.05, 1854.77, 1367.73], "bbox_id": "075e03cf93", "file": "AppomattoxNewspapers_1918-1922a_0311.pdf", "page": 1, "text": "Mr. W. H. Burks, wife children, of Roanoke, are ing in the home of Col. Burke There will be a regular d ing of tbe Eastern 8 ar Fq night, the 2ad, at 730 Mrs. L. E Smith,j Mr. Berkley Woolridge sister, Odelle, of Lynchbl spent Sunday with thein rents, Mr. and Mrs, Vil Woolridge. Mrs. Julian Abbitt, whe been visiting her daughtJ North Carolina, catne hi vesterdav, and is reported covet her with her sod , Bui, Misses Caroline Hunter Grace Adams, of Lynchb are house guests at tne cou home of Miss Dean Johns i here. Mr. W. T. Coleman and fi ly were in twn Satan Bnscom, his son, of Bluefi W. Va , is spendiog his lion at nome. Mr. Hunter Smith and dat ter, Miss Josephine, retui to Fayetteville, N C , last w atter a visit to friends and r lives here, t accompanied Miss Margaret Hancock. For KentGood tobacco f one mile from station, sc! and church in Appomattox .For information, address O er, 310 Campbell Ave., H.r Roanoke, Va. 0 3J"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Mrs, Vil Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, whe been visiting her"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Mrs, Vil Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, whe been visiting her"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1572.5, 956.07, 1728.31, 1366.62], "bbox_id": "06382eb904", "file": "AppomattoxNewspapers_1918-1922a_0186.pdf", "page": 1, "text": "Mr. W. H. Burk, wife and children, of Roanokt, are visit iDg in tbe home of Col. R F. Burke There will be a regular meet ing of the Eastern H ar Friday night, the 2od, at 730 Mrs. id. E omith, Sio Mr. Perkley Woolridge und sister, Odelle, of Lynchburg, spent Sunday with their pa rents, Mr. and Mrs. W. 8 Woolridge. Mrs. Julian Abbitt, who bas been visiting her daughter in Alortb Carolina, came home yesterday, and is reported sick together with her son, Billy Misses Caroline Hunter aud Grace Adams, of Lynchburg, are bouse guests at tno country home of Miss Dean Johns near here. Mr. W. T. Coleman and mii ly were in town Saturday. Bascom, his son, of. Bluefield, W. Va , is spending bis vaca lion at noma Mr. Hunter Hnith and daugh ter, Miss Josephine, returned to Kayetteville, N C , last week alter a visit to friends and rela tives here, accompanied by Miss Margaret Hancock. For KentGood tobacco farm one mile from station, school and church in Appomattox Co For information, address Own er, 316 Campbt.il Ave., 8. W , Roanofc, Va. C 30 2w"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "W. 8 Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who bas been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "W. 8 Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who bas been visiting"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1599.65, 912.08, 1762.29, 1724.21], "bbox_id": "3585402078", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "Mr. Russell Prilliman, after rusticating in Franxlin county for two weeks, has resumed his duties with Appomattox Hard ware Co. Strayed or stolen from Pur- dum pasture, last Sunday, red cow with white spots, Bhort horns, one noticeably short test. Notify Mrs. J. 0. Hundley, Ap pomattox. Mr. and Mrs.. W. H. Burke and two children and Miss Jo sephine Brown, of Roanoke, and Mr. and Mrs. B. F. Oden are visiting in the home of R. F. Burke this week. Mr. and Mrs. W. F. Wood, Mrs. Jesse Wood, Mrs. Dan Ev ans and Wm. Burke left this a. m. for a visit to relatives in Buckingham and Cumberland counties. Rev. J. C. Leps, who has been in - deolining health for the past two months, is now at The Healing Springe. He was unable to fill his appointment here on last second Sunday. Miss Thelma Phelps, who has been visiting her aunt, Mrs. Harvey Rodgers, returned to her home in Lynchburg Friday, accompanied by her cousin, Miss Bettie Lee Rodgers. Mr. W. E. Smith, wife and son are now busy with they cannery. We predict for this young enterprise a big thing, as it is bound to grow in the hands of these experts. Clean liness and Godliness make .the best of canned goods. Mrs. Julian Abbitt has pur chased of Mrs. Elliott the lot adjoining the Methodist church and will build at once.. The church should have bought this lot long ago, as a building there will greatly circumscribe the church-going people. Miss Gladys Bingham, an Appomattox High School girl is the guest this week of Miss Odelle Woolridge and attend ing the meeting at Liberty church. Miss Bingham has many friends here who always welcome her to our town. Section Foreman Gahliar is visiting his brother-in-law, E R. Primm, in Nottoway this week. Mr. Primm has pur ohased the old R. N. Woolridge estate and will work Mt. View farm for A. H. Clement next year."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "of canned goods. Mrs. <mark>Julian</mark> <mark>Abbitt</mark> has pur chased of"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "of canned goods. Mrs. <mark>Julian</mark> <mark>Abbitt</mark> has pur chased of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1389.57, 315.76, 1721.04, 491.76], "bbox_id": "469d63dc23", "file": "AppomattoxNewspapers_1912-1915a_0486.pdf", "page": 1, "text": "Mr. Leonard Gregory, of Ports mouth, Ohio, visited his parents here Xmas. Mrs. Julian Abbitt, of Oxford N. 0., has returned, after a visit to relatives here. Mr. Jmie Gills left last week FOB It BHTX will rent my Mt, View farm two miles south of Appomattox, tor lio C ity Point, where he has a c Ao. A line I Ji tW- -  h 7 c LEM ENT, Appomattox, I Mallard ducks, implementa mu a   . , ... opening for th right man with foyoenough  cepted a position, to work it.  flg     RB  Va. Justloe of the Peace can secure ufvUiburg, w a, a Visitor St warrants here at SI per 100. These warrants1 have return for officer, Judgment and exe cution attached. It la a good and useful form and ail Justices should have a supply. TlMBB-VIUGIN1AN. tt"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "parents here Xmas. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, of Oxford N. 0.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "parents here Xmas. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, of Oxford N. 0.,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.06, 448.51, 1809.39, 886.5], "bbox_id": "f91279f139", "file": "AppomattoxNewspapers_1926-1933a_0336.pdf", "page": 1, "text": "Mr. and Mrs. Julian H. Hill and children, Jane and Hutson,  spent Saturday night and Sun. in the home of Mr. W. W. OBrien. Miss Grace Burnett served a delightful dinner party last Saturday evening in honor of Miss Hallie Burnett and young friends of Lynchburg. Missi Phoebe OBrien was also a I guest. Miss Elizabeth Abbitt and parents and Mrs. Evrod Connor of Appomattox spent Sunday In Vera at the home of Mr. Geo. F. Abbitt. The three banking institu tions of the county have reports published in this issue. It is gratifying to observe that all they reports are favorable and that Appomattox enjoys such ably managed financial insti tutions. Mr. and Mrs. Ellis Wilson and Mr. and Mrs. L. C. Bur- chinal and their two boys, Regihall and Charles, all of West Va., were visitors in the home of Mr. and Mrs. G. W. Lewis recently."}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "Mr. and Mrs. <mark>Julian</mark> <mark>H</mark>. Hill and children, Jane"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "Mr. and Mrs. <mark>Julian</mark> <mark>H</mark>. Hill and children, Jane"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.7, 280.28, 1820.98, 1193.92], "bbox_id": "1fb13e4515", "file": "AppomattoxNewspapers_1918-1922a_0081.pdf", "page": 1, "text": "Misses Grace and Thelma Evans, of Alabama, are visit ing at the home of Mr. W. L Brown. Mr. and Mrs. D. R Green, of Raleigh, N C , after spend ing some time with relatives here, returned home today. Mr. Julian Abbitt, after spending some time in Norfolk with his uncle, is now at home. Ford for SaleI will sell my car, in perfect condition, used very little, cheap for cash Henry A. Oder, Appox, Va. Miss Mildred Martin,of Farm- ville, has been on a visit to Misses Rachael Ferguson and Ruth Clement this week. We are glad to note the im proved condition of Mr. W. A. Moon, of Spout Spring, who has been suffering from pneu monia for the past two weeks. Prof. Betts, of Chicago, head of the department of music at Elon College, was a guest of H. Babcock for several days last week. There will be political speak ing at Pamplin on Thursday night at 8 oclock. Messrs. Courtney Franklin and Havilah Babcock, speakers. The stork has been visiting our homes since our last issue. John E. Sears, another daugh ter Lloyd Nash, a boy Hon.R L. Burke, a boy. Much sympathy is expressed for Mr. and Mrs. R. A Jones in the loss of their 13 months- old baby, which died last week. The baby was one of a set of t wins and the other baby is ill. Rev. P. H. East is conduct ing a aeries of m 36tings a t Lib erty charch this week, which are drawing large crowds. Mr. East is preaching strong ser mons and much interest is be ing manifested Trial of the tour Prohibition laspjctors for the murder of two alleged bootleggers in Shen andoah county several months ago is in progress and is at tracting quite a deal of atten tion in all parte of this State as well as in sotne of the border states. Our tobacco warehouses will open tomorrow for the sale of primings. T h e buyers and warehousemen are already coming in and a real lively to bacco market is predicted for Appomattox. Farmers are urg ed to bring iu primings prompt ly. Sales in Lynchburg aver aged 8 60 per 100 poundsthe highest being 17."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "returned home today. Mr. <mark>Julian</mark> <mark>Abbitt</mark>, after spending some time"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "returned home today. Mr. <mark>Julian</mark> <mark>Abbitt</mark>, after spending some time"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1455.76, 847.79, 1796.45, 1067.29], "bbox_id": "36aff5fe12", "file": "AppomattoxNewspapers_1922-1923a_0355.pdf", "page": 1, "text": "M iss Mary Adams a t Mr. J. W. MRS. G. A. COLEMAv , between Mt. Cut Martins Saturday and Sunday. and Appomattox Depot.  1 vi oa I Dr. W. H. ABBITT, one m.le east of Ap Mrs S. A. Scruggs and Miss ..  .a. - te pomattox Depot. W illie Bell spent a week at the c _ 8 CAWTHORN, 4 miles south of home of Mr. Hamersley at Mauteo. I Evergreen, Va- lhough th e trib u te i i your jiaper Other names will be added to this list and , , n . t 1  .. i l l . printed throughout the hunting seasop for to the lamented Dr. Julian A b b ut   was complete, beautiful, yet 1 feel that I tinier. -dd a few lines to ex- pres.- tuy appreciation and admi- ratiou for himv He was brave, true ir r r x T ir   1 ssisr Bids! named him but to praise. A noble 1 f l j  1 Appomattox manly life is euded. Hi- devoted!   . j . wtfe and affectionate children have 916 invited to C0m6 t he love aud sympathy of the writ er.   q May they all be reunited in tbe"}, "highlight": {"text": {"matched_tokens": ["H", "ABBITT"], "snippet": "oa I Dr. W. <mark>H</mark>. <mark>ABBITT</mark>, one m.le east of"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "ABBITT"], "snippet": "oa I Dr. W. <mark>H</mark>. <mark>ABBITT</mark>, one m.le east of"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.62, 509.02, 1763.93, 790.67], "bbox_id": "6758908106", "file": "AppomattoxNewspapers_1892-1898a_0096.pdf", "page": 1, "text": "lowing couples Miss Rosalie Wheeler and Hon. E W. Hu bard, Miss Anna Jones and Dr. Julian Abbitt, Miss Carrie Smith and Mr. Wm. A. Moses, Miss Lucy Abbitt and Mr. James Paris, Miss Sallie Burke mid Hon. H. D. Flood, Miss Lizzie Davidson and Mr. J 03 , Button, Miss Nina Jobes and Mr, Joel Flood Taylor -Miss Erie Jones and Mr. R. C. Harvey, Miss Loulie Peers and Mr. W. J. Trent, Miss Ed die Hardy and Mr. P. A. Grigg, Miss Annie Fleshman and Mr. H. S. Coleman, Miss Dell Jackson ad Mr. Len Lyne, Mr. and Mrs. I. 6, Abbitt, Miss Maggie Smith and Mr. C. N. Abbitt, Mrs. Len Smith and Mr R. W, Smith, Miss Lucy Smith and Mr. G. G. Coleman, Miss Sallie Wheeler Jones and Mr. J Mahone Miles. The chaperons were Mrs. T. A. Smith and Mffl. Gem T. Peers."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Anna Jones and Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Miss Carrie Smith and"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Anna Jones and Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Miss Carrie Smith and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.3, 1021.45, 1636.68, 1811.94], "bbox_id": "c343032447", "file": "AppomattoxNewspapers_1918-1922a_0058.pdf", "page": 1, "text": "LeGrande Local, F. E.  C U , will bold a business and so cial meeting Friday night, June 20, at the home of Mr. R. C. W agner. Regular Kervices at Memorial Sunday Sunday school 10 a. m. and preaching 11 a m and 830 p. m. Special muic by choir. Everybody invited. Foreman Edwin OBrien is rushing work on the Farmers Tobacco Warehouse and prom ises to have it ready for hand ling the biggest crop of tobacco ever handled at Appomattox. Miss Nellie Coleman and her brother, Frank, who have been on a visit to Mrs. F. L. Martin and attended the finals of A. A. H. S.j have returned to their home at Toga, accompanied by Miss Beulah Martin. Mr. J o h n Cunningham, 8 candidate for the ministry iD West Hanover Presbytery and assistant to Rev. J. C. Leps, will preach at the Presbyterian church 8unday a. m. 11 oclock. Come and hear a good address A mass meeting is called for Saturday, 21st, to consider fur ther the road question in Ap pomattox county. If you are interested in good roads, better give the day and come out. Highway Commissioner Cole man is expected here. Several untaggedand seem ingly worthless  hound doge have been seen roaming around town right recently. The law says the tax must be paid on them or they must be killed July 1st is the last day of grace allowed their dogships. Mr. Edward Abbitt left today for Richmond, from whence he will go to China,xwhere he has accepted a position with the Export Tobacco Co. He will be gone four years. Edward is the oldest son of the late Dr Julian Abbitt of this place. The  song of the cradle and the reaper is heard on every side now and a generous whea crop is promised. The returned soldiers to the farms lessened the shortage of labor, and w p have heard ot no complaint due to labor shortage, which war not th e case last year."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "of the late Dr <mark>Julian</mark> <mark>Abbitt</mark> of this place. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "of the late Dr <mark>Julian</mark> <mark>Abbitt</mark> of this place. The"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [611.98, 264.2, 789.22, 976.73], "bbox_id": "cffa392fbf", "file": "AppomattoxNewspapers_1922-1923a_0141.pdf", "page": 1, "text": "I d M em ortani FRANCES BRANSFOBD ABBITT ROSE j ust at daws of September nineteenth, uinteen hundred and twenty-two, tne spirit of Frances Brauaford Abbitt Rose took its flight trom its earthly abode to her heavenly home, at St. Lukes hospital, Richmond, Va , where she had been ill foi a month. Frances Abbitt Rose was the only daughter of toe late Dr Julian Hamner Abbiti of Appomattox, Va , and Bailie Ballou Abbitt, who survives her, also two brothers Edwaid Ballou Abbitt, of Shangha, China, and Julian Abbitt, of U. a N In August, nineteen eigi teen, Frances was marneo to Mr. John Daniels Rose, oi Henderson, N. C., who surviv es her with three small children. Of a bright and happy dispo sitiOD, she easily made friends and was greatly beloved by a large circle of relatives and friends. She was so fair and young, do happy in ministering to ih- needs of her husband aud chil dren, so contented in her home, always counting it her greatest joy to be with her little family, that her seemingly untimely yassing cast a gloom over the entire community in which she lived Sue was a faithful and oyai member of t h e Episcopal church and ever ready to do what she could to further its interests. Truly, her sorrowing loved ones feelthat to Frances there was one clear call as she  put out to sea aDd mat her Filot face to face. Her body was brought to Henderson and tenderly bom by those near and dear to her was laid to rest under a bank of flowers. yAs the wotds of the burial service, so full of significance, read by Dr. Housfeld, fell upon the .ears of the grief-stricken husband and relatives they said iu their hearts  Behold, she is n jt here she is risen. She is with the redeemed, with love ones gone before,and lives, as we love to believe, to be still a ministering spirit.  Father in Thy gracious keep- ing, Leave we now our Frances sleeping. One Who Loved Her."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "of Shangha, China, and <mark>Julian</mark> <mark>Abbitt</mark>, of U. a N"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "of Shangha, China, and <mark>Julian</mark> <mark>Abbitt</mark>, of U. a N"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.46, 1553.45, 1650.15, 1808.17], "bbox_id": "1bb2e55b80", "file": "AppomattoxNewspapers_1922-1923a_0351.pdf", "page": 1, "text": "HONORARY PALL BEARERS Maj. J. W. Flood, Geo. T. Peers, T. A. Caldwell, J. T. Cawthorn J. L. Chernault and N. H, Gieg ory. The vast andience wept like children, aud all seemed to realize tbe loss of a dear friend, a noble and sweet-spirited man. The deceased was a prominent MasoD and tbe Hill City Lodge of Mason had ebarge of the fuuer al and conducted it at the grave assisted by the local Masons a ministers. The procession to the cemetery was tbe longest and the croad lai- gest ever seen at a funeral here. Julian Abbitt bad friends wherever  known. The flora! offering were ! beautiful and literally coveted the"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "at a funeral here. <mark>Julian</mark> <mark>Abbitt</mark> bad friends wherever  known."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "at a funeral here. <mark>Julian</mark> <mark>Abbitt</mark> bad friends wherever  known."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.24, 203.13, 811.47, 1366.09], "bbox_id": "900b191afe", "file": "AppomattoxNewspapers_1918-1922a_0187.pdf", "page": 1, "text": "Good growing weather. J. A. Burke is in Norfolk for treatm ent at a hospital. Clarence and Richard Hund ley are at home here Work on the new Appomat tox tobacco factory is progress ing satisfactorily. Mr. and Mrs. T. 8. Bridges, of Crewe, spent the week end in the home of Capt. GahHar. Miss E la Porter, of Lynch burg, is visiting her cousin, Miss Elizabeth Smith. Mrs Sarah E Collins, of Danville, is visiting Mrs. J. T. Cola Connie Odor, of Lynchburg, was visiting his brothers here last week. Miss Maymne CHockl toe, of Lynchbu-g, spent SToday with Miss Ilene Smith. Mr. Havilah Babcock is at tending summer school work at University of Virginia. Mrs. Leland Morris and chil dren, of Richmond, are visiting relatives here. Mrp. li H Gregory is on a visit to her soa, Leonard, in Portsmouth, Ohio. Mr. and Mrs. A H. Gregory are on an extended trip to Cal ifornia. Miss Vara Sales, of Norfolk, Va., is the guest of Miss Rheda Drinkard this week Miss Eva Woolridge has re turned home after a visit to relatives in Lynchburg. Mr. A E. Jones, of Lynch burar, was a visitor here this week to his family. Mr. King David Beasley was in this town Monday He is now living in Amherst county Miss Ilene Smith is visiting her aunt, M th . W. J. Walton at Bent Creek, Va Misses Gladys Smith and Pearl Caldwell left last week for Harrisonburg,to attend sum mer norml. tM isses Fmra and Ruby Will iams, of Pamolin, spent the week end with Miss Gladys Smith. Mr A. Burl bb to, of New port. News, is buil iiug a nice residence at Vera, his old home. Mr. W. B. Harvey is here to day making arrangements with field secretary for the County Sunday-school convention Mrs. A. B. Reynolds and children, of Louisville, Miss , are visiting Mrs. C. F James here. Mr. W. H. Burke, wife and children, of Roanoke, are visit ing in the home of Col. R F. Burke There will be a regular meet iug of the Eastern S ar Friday oigtit, the 2ad, at 73U. Mrs. L. E Smith, Sic Mr. Berkley Woolridge and sister, Odelle, of Lynchburg, spent Sunday with their pa rents, Mr. and Mrs. W. S Woolridge. Mrs. Julian Abbitt, who has been visiting her daughter in North Carolina, came home yesterday, and is reported sick together witu her son, Billy Misses Caroline Hunter and Grace Adams, of Lynchburg, are house guests at ttie country home of Miss Dean Johns near here. Mr. W. T. Coleman and femi ly were in town Saturday. Bascom, his son, of Hluefiel d, W. Va , is spending his vaca Lion at oomn. Mr. Hunter Smith and daugh ter, Miss Josephine, returned to Fayetteville, N C , last week after a visit to friends and rela tives here, accompanied by Miss Margaret Hancock, For KentGood tobacco farm one mile from station, school and church in Appomattox Co For information, address Own er, 316 Campbell Ave., S. W , Roanokf, Va. 6 30 2w"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "W. S Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who has been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "W. S Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who has been visiting"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [550.15, 206.75, 711.15, 1368.52], "bbox_id": "c36bf55679", "file": "AppomattoxNewspapers_1918-1922a_0312.pdf", "page": 1, "text": "Good growing weather. J. A. Burke is in Norfolk for treatm ent at a hospital. Clarence and Richard Hand- ley are at home here. Work on the new Appomat tox tobacco factory is progress ing satisfactorily. Mr. and Mrs. T. 8. Bridges, of Crewe, spent the week end in the home of Capt. Gahliar. Mias E la Porter, of Lynch burg, is visiting her cousin, Miss Elizabeth Smith. Mrs Sarah E Collins, of Danville, is visiting Mrs. J. T. Cola Counie Odor, of Lynchburg, was visiting his brothers here last week Miss Maymee Chockl tte, of Lvnchbug, spent Sunday with Miss Ilene Smith. Mr Havilah Babcock is at tending summer school work at University of Virginia. Mrs. Leland Morris and chil dren, of Richmond, are visiting relatives here. Mr.. N H Gregory is on a visit to her son, Leonard, in Portsmouth, Ohio. Mr. and Mrs A H. Gregory are on an extended trip to Cal ifornia. Miss Vara Silas, of Norfolk, Va.. is the guest of Mies Rheda Drinkard this week  Miss Eva Woolridge has re turned home after a visit to relatives in Lynchburg. Mr. A E. Jones, of Lynch Imrg, was a visitor here this week to his family. Mr. King David Beasley was in this town Monday He is now living in Amherst county Miss Ilene Smith is visiting her aunt, Mrs. W. J. Walton at Rent Creek, Va. Misses Gladys-- Smith and Pearl Caldwell left last week for Harrisonburg,to attend sum mer normal. Misses Flora and Ruby Will iam, of ram plin, spent the week end with Miss Gladys Smith. Mr A. Burl abb tt, of New port News, is bail ling a nice residence at Vera, his old home. Mr W. B. Harvey is here to day making arrangements with field secretary for the County Sunday-school convention Mrs. A. B. Reynolds and children, of Louisville, Miss , are visiting Mrs. C. F. James here. Mr. W. H. Burke, wife and children, of Roanoke, are visit ing in the home of Col. R F. Burke There will be a regular meet ing of the Eastern S ar Friday night, the 2ad, at 730 Mrs. Li. E Smith, S bc Mr. Berkley Woolridge and sister, Odelle, of Lynchburg, spent Sunday with their pa rents, Mr. and Mrs. W. S Woolridge. Mrs. Julian Abbitt, who has been visiting her daughter in North Carolina, came home v e e t e r d a v , and is reported sick together with her son, Billy Misses Caroline Hunter and Grace Adams, of Lynchburg, are house guests at tne country home of Miss Dean Johns near here. Mr. W. T. Coleman and fami ly were in town Saturday. Bascom, his s o d , of Bluafield, W. Va , is spending his vaca tion at nome. Mr. Hunter Smith and daugh ter, Miss Josephine, returned to Fayetteville, N C , last week after a visit to friends and rela tives here ,  accompanied by Miss Margaret Hancock. For KentGood tobacco farm one mile from station, school and church in Appomattox Co ,For information, address Own er, 316 Campbell Ave., S. W , Roanoke, Va. 6 30 2w"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "W. S Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who has been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "W. S Woolridge. Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, who has been visiting"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1933.86, 518.91, 2094.31, 1340.82], "bbox_id": "3f145178e4", "file": "AppomattoxNewspapers_1902-1905a_0275.pdf", "page": 1, "text": "Glenfall. The birds have begun to sing, the frogs to croak, flowers are bloom ing, grass is growing, consequently we are encouraged to think that the Winter of our discontent isover, and very gladly do we weioome the approach cf spring. Mr. Orman Jones visisted his aunts near here recently, and invested extensively in jewelry at Mr. J. W. Harveys store. Miss Verona Bell has gone to Prospect to visit Mr. and Mrs. Broadus Scruggs, who have been ill with pneumonia. Mr. Herny Hamersley, who has been very sick, is now much better. Dr. Julian Abbitt attended him. MissWillie Bell is visiting relatives and freinds near Carsons Mill. Ae o.ir pastor was providentially absent at Mt. Comfort the first 3uuday, we looked forward with much eagerness to his coming on third Sabbath, anu though it was an ideal day, we were doomed to dis appointment, as he said March was winter month, and he was not expected. There is danger of our going into a state of heathenism, as there have been no pastors at the Baptist and Pres, churches, and now two months will intervene between the.services at Mt. Comfort. Mr. S. G. Payne visited his wife and son near here recently. Frequent rains have greatly retard ed farm worksowing oats and clover seed will now be in order, though some were fortunate to get their clover seed in before the fre quent showers. Wheat looks wtll and clover and timothy are growing rapidly. Hauling of ties has been suspended owing to the callin. of a halt by tb- N.  W. Ry. Your readers were delighted that the Audersouvilie correspondent has awakened from his Rip Van Winkle sleep, and now we hope that some thing, even if it be a broom stick will keep him awake and thereby brighten your columns more fre quently. Misses Ida and Neal Jones are vis iting their brotuer near Spout Spring. Master Mosby H. Payne sold Lis crop of tobacco in Lynchburg last week. It was his first crop and as it brought so little, he seems thor oughly discouraged, nod will not at tempt another crop of the trouble some weed. When this reaches your sanctum it may bi snowing. This latter paragraph may be hatd on the mail service.E d ."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "now much better. Dr. <mark>Julian</mark> <mark>Abbitt</mark> attended him. MissWillie Bell"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "now much better. Dr. <mark>Julian</mark> <mark>Abbitt</mark> attended him. MissWillie Bell"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [791.28, 248.4, 952.38, 1564.92], "bbox_id": "f61f56741f", "file": "AppomattoxNewspapers_1898-1902a_0509.pdf", "page": 1, "text": "from the observation either of his own family or of persons who might pass along the road. Mrs. Nowlin went out on the porch and gave the alarm, and requested Constable N. W. Owen to arrest Mr. Nowlin, say ing that be had twice shot at her. Heury, a sou of Mr. Nowlin, came up, and went in search of his lather. He found him behind an outhouse. Mr. Nowlin said to him  Get my horse. I want you to carry me to Spout Spring. He spoke so ration ally that the young mau left him to go to the field and take a horse from the plow for bis fathers use in go ing to Spout Spring. Before leav ing his father, Heury tequested him to give up the pistol which he had concealed on his person. Mr. Now lin was searched, but no pistol was found. His son had proceeded ouly a few steps when Mr. Nowlin sent u bullet through his own brain. He eeled aud fell, and died within 30 minutes. The bullet entered his left temple and came out just above his right car. Diligent inquiry has not developed any cause whatever for the rasl. act of Mr. Nowlin, and, al though he was of a despondent dis position and very high-tempered, he had never had an attack that made him the mudmau he was on Friday. Those nearest to him claim that he was evidently cruzy, aud that is the general verdict of the people. He nad for years beeen a great sufferer from ueuralgia and his bodily health was generally rather infirm. Borne reports say that Mr. Nowlin became enraged at a negro servant on the place, and had no occasion to be an gry with his wife, who is one of the best ladies in our county. It is one of the saddest affairs that ever hap pened in this county, as the family upon both sides is well known and highly connected. The deceased was born about 62 years ago in the house in which he was piepared for burial. He was not a member of any church. While he was high-tempered and courageous, he had a warm heart, full of sympathy. He had beeu a merchant and postmaster at Oak ville most of his life, but was engaged in farming at the. time of his death. Besides his wife, who was a Miss Woodson, Mr. Now lin leaves six children. He is also survived by two brothers and two sisters Mr. S. Walker Nowlin, of Lynchburg Mr. William S. Nowlin, of Spout Spring Mrs. Samuel H. Overton, of Spout Spring and Mrs. John Hughes, of Oakville. His burial took place on Saturday even ing, at the family burying ground on the place, and was quite largely attended by friends of the family. Evergreen. We have had another fine rain. Crops are looking very well. The wheat is very good all through this part of the county. There is some complaint about the oats turning yellow in some places. The tobacco crop in general is rather small, but is growing well, and nearly every body has a good stand. The corn is looking green and is growing well. The crops of clover and grass are not of much account There are about 75 railroad men now at work here. - Alost of t.heni spend their nights in our village, anu it is something of a sight to see them come in at night. The mer chants report good sales now, espe cially of cider. They cant keep a supply of that equal to the demand. We are sorry to learn that little Gerard Davis is still very ill. Drs. Julian Abbitt and Walker are both attending him. Mr. Walter Davis has again been called to his bedside. Mrs. Sue Harvey continues very ill at her home near this place. Mrs. Ed. Hamilton has been call ed home in great haste to attend her husband, who is very ill of fever. Mrs. Nat. Gregory last week spent several days visiting her husband in and around this place. She won many friends by her pleasant man ners and sweet ways. We heartily hope that she had a pleasant visit, and that she will come again. Mr. N. H. Gregory left on Mon day for the Hill City. Mr. Geo. Carter, of High Bridge, was in our town on Monday. Mr. James Suliivan and his little daughter Eliza spent several days in Lynchburg last week."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "still very ill. Drs. <mark>Julian</mark> <mark>Abbitt</mark> and Walker are both"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "still very ill. Drs. <mark>Julian</mark> <mark>Abbitt</mark> and Walker are both"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1357.87, 641.47, 1528.67, 1330.25], "bbox_id": "a003750a51", "file": "AppomattoxNewspapers_1926-1933a_0373.pdf", "page": 1, "text": "For SaleOne good as new lichmond Made Range at a rgain. M rs . G. L. D oss . Mrs. Julian Abbitt, of Oxford, C., was a visitor to friends re this week. Dr. and Mrs. Havilah Babcock University of South Carolina, e home for the summer. Miss Nina Jones, who has en in Roanoke for ten days, turns home to-day. U. D. C. will meet with Miss ouise Gills Tuesday, June 18th I 330 p. m.,. for election of fficers. We are showing new patterns Celonaise voiles, this week. INGES NOVELTY SHOPPE. Mrs. J. R. Carter, of Warren- n, is spending this week with er friend, Mrs. Kate E. Holtz- jlaw, at the home of Mr. and rs. L. Crawley. For Sale1 Hot Point two late Electric Stove. Apply -6-2t M rs . L. R. G ills . Announcement is made of the arriage of the Hon. H. St. eorge Tucker to Miss Mary ane Williams of Culpeper, on the 26th June. The religious denominations re playing ball at Appomattox, ethodist and Baptist are in a ie and the Presbyterians are at ottom. Mr. and Mrs. M. C. Caldwell eceived a message announcing he arrival of another grandson lark Caldwell Eversole. Button Holes worked by ma- hine 12c dozen for medium size oles. M rs . W. E. S mith . A playHearts and Diamonds ill be given at Stonewall next Saturday night, b y Concorc alent. Benefit of Bethleham church. Republican mass-meeting will be held at courthouse here Sat urday the 15th, at 2 p. m., to elect delegates to State Conven tion."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "L. D oss . Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, of Oxford, C., was"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "L. D oss . Mrs. <mark>Julian</mark> <mark>Abbitt</mark>, of Oxford, C., was"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [893.09, 271.9, 1054.44, 767.87], "bbox_id": "e1bb6afae0", "file": "AppomattoxNewspapers_1898-1902a_0368.pdf", "page": 1, "text": "Evergreen. There is a scarcity of news this week. We have damn weather a plenty but not much rain as yet. The workmen are busy engaged in finishing up the tank. - The picnic at the Rocks was a grand succcess. There was a plenty to take home after leeding the larg- crowd ever seen theie on such The recitations were splendid, couldnt have been better. The manner in which the children were trained reflects great credit on he young ladies, Misses Carrie Caw- thorn and Lillie Dawson. The protracted meeting is iu pro gress at Rocks. Rev. P. T. Warren, the prstor, assisted by Rev. Luther Warren. The weather is so threat ening that the crowds are small. We wish them much success in their meeting. Messrs. Norman Dawson and Payne, of Pampliu City, are in our village this a. m. Miss Elma McDe,rmou left this place to-day for Burkville, where she will atteod school. She is a sweet little girl and we hate to give her up. She has our best wishes. Mr. Bennie Inge, of Roanoke, is at home this week attending the Rocks meeting. We are always glad to have him with us. Mrs. Ed. Bates and Miss Alice Whitaker, of Spout Spring were among those that attended the Rocks picnic Saturday. Bennie Rakes, of Farmville, is here relieving Mr. H. C. Farrar who is attending the Rock meeting this week. Dr. Julian Abbitt operated ott Mrs. Joe Inges foot to-day. She is resting very quietly. We wish her a speedy recovery. Willie McDearmon is this week the guest of his brother, Mr. Lucy McDearmon of Burkeville."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "meeting this week. Dr. <mark>Julian</mark> <mark>Abbitt</mark> operated ott Mrs. Joe"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "meeting this week. Dr. <mark>Julian</mark> <mark>Abbitt</mark> operated ott Mrs. Joe"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2324.64, 384.65, 2490.79, 1074.88], "bbox_id": "179e48ac2c", "file": "AppomattoxNewspapers_1902-1905a_0179.pdf", "page": 1, "text": "Evergreen.  during the high wind that lasted for three days last week mnch for-  ago which had been stacked up was blown down. Rev. Wm, L. Bediuger filled his appointment here on Snnday night. There was not a large congregation. Mr. Staples still conducts prayer meeting on every Wednesday night, and will be glad to see as many pre sent as can possibly come. Do not stay away just because the weather is getting cool, as there are two good stoves in the church. We regret to say that Mr. George Glover is again worse. He has been ill for five long weeks. Mrs. Hunter Martin has for three wei-ks been suffieeing severely from,a joint-felon on her right hand. Dr. W. H. Abbitt Is attending her. Mr. Joe Inge is this week some what better. He has for several days been very ill from stomach trouble. Dr. E. E. Walker, of Pamplin City, was called to attend him. Mrs. Deloca Cheatham, of Bartow, Florida, left to-day, after a stay qf about four months. She aud her three bright boyst will be greatly missed. Cards are ont for the marriage of Mr. Thomas Cheatham, of Miami, Florida, to take place on October 28. We wish for this noble young man a long life of prosperity and happi ness, even if he did forget to send us a bid. Mr. 0. S. McDerrmon will in the near future enlarge his store so that he can handle dry goods. Lumber for the work is now in place. Mr. iawson Wooldrige, of Bine lidge Springs, was in oar town on Sunday, and looking as handsome as vèr, so one of his best girls said, 1 Mr. John Jennings has gone back o bis work. We hope that ho will continue to improve. Miss Marjory Meadernach has re turned to her home in Danville. She left some sad hearts and long faces n old Appomattox. Miss Maude Ragland has returned to ber home, after a pleasant visit of several weeks in Nelson county, etc. She is looking well. Mrs. Hunter Glenn and her bro- her, Mr. Bennie Inge, of Roanoke, who have lately been with their sick father, have returned to their home. Bennie left bis fine horse and buggy with his father. We are grieved to learn of the ill- nous of Dr. Julian Abbitt. Wé earn- ly pray that God in His goodness wtil spare him, aud that he -may soph recover. October 13, 1903."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "right hand. Dr. W. <mark>H</mark>. <mark>Abbitt</mark> Is attending her. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "right hand. Dr. W. <mark>H</mark>. <mark>Abbitt</mark> Is attending her. Mr."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1667.97, 783.43, 1828.79, 1185.25], "bbox_id": "3380d36d7a", "file": "AppomattoxNewspapers_1892-1898a_0438.pdf", "page": 1, "text": "Evergreen. - Died at the home of his adopted parents, Mr. Satnl and Sackey Dickerson, near old Rocks church August 16th, C h a r l ie M c R o y . For eight days he was a great suf ferer, dying with that awful disease diptheria. No human ever suf fered moredeath was a great re liefpoor little orphan, we hope he is safe in heaven with his mother who died when he was a babe. Saml McDearmon, a worthy ool- ored man of our vicinity had the misfoi tune to have his house burned down on last Friday night vyith all its contents. No one can tell the origin of the fire unless a lamp ex ploded that was left burning when the family left to visit a sick friend. Daniel has the sympathy of white and colored in his loss. We are glad to learn that Mr. Col lier Trent has rented Mr. Davis store and will open lip in the near future. We all extend our best wishes to him and we will be glad to welcome such a popular young merchant iu our town, Miss Carrie Cawthorn who has been very ill for two weeks is rap- dly improving under the skillfull treatment of Dr. Julian Abbitt."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "skillfull treatment of Dr. <mark>Julian</mark> <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "skillfull treatment of Dr. <mark>Julian</mark> <mark>Abbitt</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2132.12, 524.79, 2308.5, 1286.68], "bbox_id": "a335635dbc", "file": "AppomattoxNewspapers_1902-1905a_0047.pdf", "page": 1, "text": "E v erg reen . Only a little to let tbe A. aud B. T imes see that I am as deeply inter ested in the paper as ever, only I cant always find time to write, though dont guess my uninteresting letter is missed much. The Club last Saturday uight qt the home of Mr. W. J. McDearmon was well attended, and all present. seemed to have a good time. It was invited to meet at the home of Mr. E. H. Cawthorn next Saturday night. There is lots of sickness in our village nowsome one sick at most every house in the place. Among those sick are Mr. W. 0. Farrar, Mr. Jim Hamilton, Mr. Basoom Thorn ton, aud Wiley Hauoook, a colored boy lrom West Va. Dr. Julian. Ab- bitt is- attending them, and theii many friends hope to soou see then, out again. .  Mr. Hector O hw tie rn, of iortf mouth, Ohio, who is visiting his pu rents here, left for Ienipliu Git, yesterday to see his best girl, accbm panied by bis chanting sister, Misr Ella. - Messrs. Nathan and Lawson Wool-  dridge visited the Hill City Iasi  week. There have been nine cases of pueuuionia in our village since the first of.last fall, and the doctors lost only oue casethat of Mr. Ragland. We are glad to say Mr. Barrel! Gralle was not seriously injured by the ruuaway horse last week. Al of his brothers hastened to his side and found him better, and went back to their work happy. Mr. E. H. Cawthorn made a busi ness trip to Lynchburg aud Roanoke last week. Little Harry Rtigland is much better, we are glad to say. Miss Willie Wool ridge is now suf fering with some disease of the throat. Her many friends hope it is nothing serious. Many a prayer is being made for the recovery of Mr. Jim Hamilton, he lies dangerously ill at bis store hers. His mother, relatives and friends are at his bed-side, and Dr. JuHan Abbitt sees him daily. Remember prayer meeting every Wednesday night 715. We hopeal the Christians will come forward  and help in this noble cause, and that Dr. W. H. Abbitt will also help us again"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "and that Dr. W. <mark>H</mark>. <mark>Abbitt</mark> will also help us"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "and that Dr. W. <mark>H</mark>. <mark>Abbitt</mark> will also help us"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2133.85, 1465.03, 2295.2, 1781.26], "bbox_id": "5a5297f08d", "file": "AppomattoxNewspapers_1902-1905a_0263.pdf", "page": 1, "text": "E v e rg re e n . I Prayer meeting was conducted by Dr. W. H. Abbitt last Wednesday and was well attended, i Rev. Wm. Warien filled Lis ap pointment at Rocks Sunday morning  a thoronhhly consecrated man. We are sorry to hear that Miss Bessie Foster, of Campbell, who is at her uncle Bob Jennings, is sick with typhoid fever. Mr. and Mrs. Sam Fortor, parents of the sick one are with her. Dr. Julian Abbitt is attending her. The family moved from this county about four years ago. Mrs. Joe Inge continues sick. Mr. Jack Staples is again well enough to resume his duties as clerk for C. W. Tucker  Company. Mr. Jack Ranson was in the vil lage Sunday. Mr. W. E. Wooldiige will be out in a few days. Mr. Luther Southall and his littej son, Acree, and Mr. Clifton Paulett j spent Sunday in Prospect visitingj"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "conducted by Dr. W. <mark>H</mark>. <mark>Abbitt</mark> last Wednesday and was"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "conducted by Dr. W. <mark>H</mark>. <mark>Abbitt</mark> last Wednesday and was"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [74.89, 725.41, 597.08, 1077.96], "bbox_id": "9a52b8b830", "file": "AppomattoxNewspapers_1892-1898a_0529.pdf", "page": 1, "text": "district delegates, J. C. . ,, , Everett, F. A. Williams..!. II. Wood, I U,leman greeted with loud ap- J. W. Foster and Howell Lewis  al- ,laU8e and h,hy Pra,8ed by the ternates, H. P. Peebles. J. E. Gan- committee, E. A. Rice, J. R. Horslev, tiaway, P. II. Wood, P. A. Ball, and  S. C. Starton. on her original diction,  choice rhetoric and perfect orthog raphy. Then Miss Alice Burke was introduced as the elocution medalist. Miss Burke, who is one of the young est students in the High School, completely captured the audience with her recitation. Kentucky Philosophy and demonstrated that she possessed unusual elocutionary talents, and that the committee of the previous evening, composed of Rev. J. C. Lepps, Dr. Julian Abbitt and Mr. E. W. Taylor, were right in awarding her the medal. Mr. W. D. Browning was then in troduced as the winner of the decla mation me!!. Mi. BroWfhug in _   unit TEL 8 , wat . was ht entitled to a mber of illing for the same . . . . o . W . C O L E , as taken on the de  vision and at this  N o . S 04 M ah rS 8 Gie said .John  ___ the chair, left the JV- wo ahandoiipd the mass"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "J. C. Lepps, Dr. <mark>Julian</mark> <mark>Abbitt</mark> and Mr. E. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "J. C. Lepps, Dr. <mark>Julian</mark> <mark>Abbitt</mark> and Mr. E. W."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.29, 186.01, 1780.64, 726.45], "bbox_id": "0b5c6fc853", "file": "AppomattoxNewspapers_1915-1918a_0537.pdf", "page": 1, "text": "Chat. F. James, druggist, has anew ad this week. Read. it. Mr. Walter Scott is at home from the Army on a crop fur lough. Mr. Julian Abbitt, of North Carolina, is on a visit to his mother, Mrs. J. H. Abbitt. Mr. T. J. Spradlin has return ed to Camp Lee,, after spending the week end at home. Miss Viola Rollings was call ed home last week by the ill ness of her father A. T. Inge tells you in his ad on page 4 some of the reasons why you should buy tne Pied mont car. L. E Smith just received an up to dote line of Childrens Suits. Gome and see them be fore tbey are picked over 24 2 Mr. Dnval Hunter is witb Hanoook  Pettyjohn at Pen a!man, near Yorktown. 11c likes his position and the his toric country. Mrs E R Abbitt received a message this week informing her of the death of her brother in-law, Mr. Robert Phillips, of Sacramento, California. Quite a number of soldier boys were up Sunday from Camp Lee on furlough. There are many applications pending ior furloughs for farmer boys. The W. O ,T. U. has post poned its meeting with Mrs. 0 W, Hunter until its regular meeting io May, so that all oan attend ihe Libert? Loan dam onstration on Friday, 26 h."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "crop fur lough. Mr. <mark>Julian</mark> <mark>Abbitt</mark>, of North Carolina, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "crop fur lough. Mr. <mark>Julian</mark> <mark>Abbitt</mark>, of North Carolina, is"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [785.99, 1085.44, 947.6, 1504.99], "bbox_id": "d39ec52532", "file": "AppomattoxNewspapers_1898-1902a_0457.pdf", "page": 1, "text": "Appomattox High School, Roll of honor for 5th month end ing March 4th, 1901.Lucy Flesh- man, Cleveland Inge, Mattie Flesh- man, Ethel Fleshman, Evant Hun ter, Fred Drinkard, Harry Han-1 cock, Eula M Burke, Mary Hancock, Mary L. Browning, Bessie Coleman, Rebecca Purdum, Hattie Drinkard, Nannie Abbitt, Helen Gregory, Henry Gills, Lula G. Irby, Mary Irby, Wallace Gilliam, Harry Gil liam, She don Ferguson, Robert Ferguson, Bettie Burke, aud Melvin Worley. Requirements 95 per cent on general average for the mouth. Prof. Fisher has arranged to have a course of lectures to be delivered before the students of the high- school during the remainder of this session. The series will include lec tures by Hon. H. D. Blood, Dr. Geo. B. Taylor, Dr. Julian H. Abb.tt, aud Messrs. Samuel Bergu son, Frank Saunders and J. P. L. Bleshmau. The first of the series was delivered at the high school building Briday afternoon, 15th inst. at 230 p. m. by Mr. Samuel Bergusou, hia sub ject being state government. Pin other lectures will be regularly an nounced, aud will be open to pa trons and the public. J. G. F ish er , Principal."}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "Geo. B. Taylor, Dr. <mark>Julian</mark> <mark>H</mark>. Abb.tt, aud Messrs. Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "Geo. B. Taylor, Dr. <mark>Julian</mark> <mark>H</mark>. Abb.tt, aud Messrs. Samuel"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1907.06, 278.9, 2068.28, 1153.8], "bbox_id": "7d13b83925", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "And Cotillion Party at Concord Depot. The Editor of jhis paper, in com pany with others, left on the 4i08 N . A W. train yesterday for Concord, where they had been previously in vited to participate in a sociable at thè most hospitable residence of xrs. X. Wharton. A t 7.30 oclock p. m., the company, numbering in all about thirty ladies and gentlemen Repaired to the spacious dining-room, where a sumptuous repast was partaken of and enjoyed by all present. The hostess, Mrs. Wharton, received the well-deserved credit from all who partook of the bountiful supply with which the table was heavily ladened. THE HOP. The young men after consultation among themselves, decided to have a social hop, and after securing the services of Prof. Steele the party repaired to the hall where they tripped the light fantastic toe to the sweet music discoursed by the above- named gentleman, till the wee sma hours of the morn, when each par ticipant took leave for their respect ive homes, feeling perfectly satisfied with the evenings entertainment. Following are the names of the ladies and gentlemen who partici pated in the dance Miss Lola Elliott, Lynchburg, Va. 6 Muriah Shanks, Salem, Va.  Lelia Shanks,    Nannie Wharton, CopooriL  E. P. Abbott,    Katie Carson, y   Della Stacie,   Annie Steele   Lee Steely   Bailie Arrington,   Bailie Gross,   Florae Arrington,   Annie Carr, Crewe, Va.  Bailie Balleu, South Boston.  Annie Norwood,   Nettie Briley, Jeters ville, Va.  Gertie Wood, Amherst, Va. Messrs. W illie Steele, Concord.  ------ Baity,   Eugene Cross,   0 . Thomas,   J. G. Fisher,   George Cross,   ------ Wharton,   ------ Abbitt,   T. H. Fisher,   R. Lee Wood, Amherst, Va.  George Kent, Lynohburg.  ------ Gorman,   C. A. Pate,   W illie E. Elliott,  Dr. Julian Abbitt, Appomattox. Mr. W. E. Doss,  Above we give the names of all those in attendance on this occasion, as far as known, and if any are omit ted it w ill be an error of the head and not of the heart."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "illie E. Elliott,  Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Appomattox. Mr. W. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "illie E. Elliott,  Dr. <mark>Julian</mark> <mark>Abbitt</mark>, Appomattox. Mr. W. E."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.34, 380.57, 1789.59, 779.37], "bbox_id": "49222dbcea", "file": "AppomattoxNewspapers_1892-1898a_0105.pdf", "page": 1, "text": "A Delightful Dance. The Tepsichorean Club, composed bf the young ladies of the town, gave one of their charming dances at Hotel Appomattox on Tuesday night. Owing to the inclemency of the weather, thè attendance was smaller than was expected, but those who were so fortunate as to be pres ent will not soon forget it. .The dancing commenced about 9 oclock and continued until some time after midnight. There waB an intermis sion, during which, those in attend ance partook of a delightful. repast. The consensus of opinion was that it was a decided success and will hear repetition. Following are the names of those present Misses Anna Jones, Rosa Wheeler, Sallie Burke, Carrie Smith, Polly Main, Eddie Hardy, Lucy Smith, Maggie Smith and Emma Smith. Mesdames I. O. Abbitt, W. J. Knight T. A. Smith and C. H. Hunter. Messrs. I. O. Abbitt, W. A. Moses, Richard Burke, W. J. Trent, Joseph Button, R. B. Poore, Julian Abbitt, Joel Taylor, G. C. Coleman, W. E. Doss, Ewen Davidson and John Stokes, of Farmville  B. N. Young and W. Hallie Burke, of Burk ville. H ER E AND THERE."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Button, R. B. Poore, <mark>Julian</mark> <mark>Abbitt</mark>, Joel Taylor, G. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Button, R. B. Poore, <mark>Julian</mark> <mark>Abbitt</mark>, Joel Taylor, G. C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1987.4, 341.69, 2419.13, 604.18], "bbox_id": "7fc4cad0dc", "file": "AppomattoxNewspapers_1915-1918a_0115.pdf", "page": 1, "text": ".  aw V r.  xtegeiutiong oi Kcspect. SeH Help Education attox A gricultural! W hereas, the M aster has Two hundred and fifty men I for January.  jseen fit to remove from our at th  i . . rRobt. Thornhill, I midst ou. balov d sister and co r  Univer9lty of Virginia oe, Robt. W ingfield, h orke J ? nie Mo88 Walton.the rPrted the amounts E Roach Wavlahd I . wbom we keenly feel,  earned by them for the purpose their w  o u g h I Be it hereby resolved that, we amount rMerle Davis, M e- tbe members of-tiberty Ghnpel ar.ned by beBe men before en- , Lila Robertson. G u y IW 8 deader to the sor e n8 the University was 47,- Reetor Ruth Allan Irowtng.. .amy oup tenderest after entering, the am onnt r  , h  mP !thiG8 aQvf commo d them was 41,052 This makes the noook, Ethel Jam er-jto the consoling grace of a surprising total of 88 892 n  McDearman, Har-  merciful Heavenly Father, too 4aKO  82 an ii, Julian Abbitt. f   e to err, too roeroiful to be a mf 5. 362 86 foe eaoh man- r Joe Imre R P rill.I   . The stak in g foot is th a t the otw eii r  I t further resvolved that I students who have so far re- le ll AnhvL v ? !E lT bete w?1 beispread up- ported have tarnedfor the pur- ell, A ubrey Wehh, j on tm r rarautes, axwpjrsent the p08e of getting an education n. tnv I family and a copy given o tttl-Iiii-. i ouuuauon, Lewie Doss, Mat- PubBcaion. nearly nine thousand dollars i. Jessie Paris. Brax-I R specttuily snbm itt d, Imore thn the total state ap- Mre. A. B. Thornhill I propriation for the mainte Mrs. C. A. Anderson Inance of the University, ex- Miss Fannie Dixons I eluding the funds iet aside for"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "4aKO  82 an ii, <mark>Julian</mark> <mark>Abbitt</mark>. f   e to err,"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "4aKO  82 an ii, <mark>Julian</mark> <mark>Abbitt</mark>. f   e to err,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1327.9, 412.81, 1798.47, 590.35], "bbox_id": "f851237188", "file": "AppomattoxNewspapers_1912-1915a_0395.pdf", "page": 1, "text": "the peace can secure drill daughter, Miss Gatheran, are visit-1 MessrB. Russell Abbitt and Julian befn?offlcer, judament and exe-lmg relatives here.  iGilU are delegates to the SiTnbeam iwrBu it it is a good and useful I I  justioes shouiu n ave a supply.  Miss Anna Jones will visit her I fitMowation which meets at Hix brother, Dr. H. K. Jones, of Boa-  bnr8 the 29th nd 30th- Mi EUa PIJBISOTOKY. I noke, this week. j Dnnkard is attending as a delegate  T. a, tt n ... . lof the Womans Missionary Society. Dr. R. H. Bennett, Missionary I   t u o i. rvihb-.vA. j Secretary, preuohed at Memorial l Liberty Church eleoted the fol- L,lpirst day Of April, June I Church here Sunday. I lowing delegates to the Association PyjjSnrt. mJanuary. March I u   , . I which meets with Bnlah Ohuroh in i S i g S i r f   , .  T     C  Pb.ll O oant,  A agu.t 18 ih. btownry. 4 Prii. September and I Lynchburg hospital for an opera-1 igth Qd goth T. A. Caldwell J. Un f aPfend,0,ti8  R. Caldwell and Jas. T. Cheatham. Mr. B. F. Burke has installed an I Mr Eagene Morria, who has  ucmn  - am .  . jaceteleyne light plant and water been m for m0QthB died"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Julian"], "snippet": "are visit-1 MessrB. Russell <mark>Abbitt</mark> and <mark>Julian</mark> befn?offlcer, judament and exe-lmg"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Julian"], "snippet": "are visit-1 MessrB. Russell <mark>Abbitt</mark> and <mark>Julian</mark> befn?offlcer, judament and exe-lmg"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1416.68, 701.05, 1498.88, 934.24], "bbox_id": "feaeaf5b26", "file": "AppomattoxNewspapers_1960-1962b_0504.pdf", "page": 1, "text": "The object of this sj partition of the real 5 which Sailie Inge Cji ed by one of the meda by Jaiw, said real at shown on the land 1 ing 53 acres -  acta acres in Southside trict of Appomattox, And it appearing bfi ed that Melba Inge R Inge, Lucy Inge Bf Inge Johnson, Julian Clarence Inge, Mrs. 1, Corrice M. Potter and burg are not residents they are -hereby reqnif within ten dap after lication of this is necessary to protedj esta. Teste C. W. H George Abbitt, Jr., p  12-21-4tc"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "esta. Teste C. W. <mark>H</mark> George <mark>Abbitt</mark>, Jr., p  12-21-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "esta. Teste C. W. <mark>H</mark> George <mark>Abbitt</mark>, Jr., p  12-21-4tc"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.14, 806.4, 1656.83, 1198.99], "bbox_id": "834150c251", "file": "AppomattoxNewspapers_1908-1909a_0435.pdf", "page": 1, "text": "Celebrating the tenth anni versary of the signing of the armistice which virtually brought to a close the great World War, Rev. W. M. Thompson will preach a special patriotic sermon i at Liberty Baptist church Sun day, November 11th, at 8 p. m. Patriotic hymns will be sung and a special number will be rendered by a mixed quartet. The follow ing names of men who served their country during the World War are found on the Liberty Church Honor Roll W. Ernest Abbitt, Russell Abbitt, Thos. H. Agee, Clarence Agee, W. Patt Coleman. John - Garter, J Oscar Cole, Thos. E. Caldwell, Richard Caldwell, Walter E. Durham, Terry C. Durham, G. Lewis Doss. Albert H. Ferguson, Thos. J- Ferguson, Kenneth Furbush, Leonard N. Gregory, Lloyd F. Goin, L. Harry Goin, James P. Gills, Julian Gills, C. Evant Hunter, Willis E. Inge, Joe Inge, Don Moses, W. Tunstall Morgan, Walter W Scott, William A. Walton, W. Berkley Woolridge. The subject for thle morning ser mon will be The Christians Armor ."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.23, 825.81, 1660.86, 1218.85], "bbox_id": "7f2879575e", "file": "AppomattoxNewspapers_1926-1933a_0435.pdf", "page": 1, "text": "Celebrating the tenth anni versary of the signing of the armistice which virtually brought to a close the great World War, Rev. W. M. Thompson will  preach a special patriotic sermon at Liberty Baptist church Sun day, November 11th, at 8 p. m. Patriotic hymns will be sung and a special number will be rendered by a mixed quartet. The follow ing names of men who served their country during the World War are found on the Liberty Church Honor Roll W. Ernest Abbitt, Russell Abbitt, Thos. H. Agee, Clarence Agee, W. Patt Coleman. John Garter, J. Oscar Cole, Thos. E. Caldwell, Richard Caldwell, Walter E. Durham, Terry C. Durham, G. Lewis Doss. Albert H. Ferguson, Thos. J. Ferguson, Kenneth Furbush, Leonard N. Gregory, Lloyd F. Goin, L. Harry Goin, James P. Gills, Julian Gills, C. Evant Hunter, Willis E. Inge, Joe Inge, Don Moses, W. Tunstall Morgan, Walter W Scott, William A. Walton, W. Berkley Woolridge. The subject for the morning ser mon will be The Christians Armor ."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [566.86, 557.18, 717.29, 979.97], "bbox_id": "f1a7f0b533", "file": "TimesVirginian_1976_0417.pdf", "page": 1, "text": "spent Saturday in the Woodall home. Mr. and Mrs. Richard Webb visited Mrs. Robert Morris and family, of Buckingham, Sunday afternoon. Mr. and Mrs. L. L- Webb and family visited Mr. J. H. Webb one day last week. Mr. and Mrs. L. H. Watson, Jr. and family, of Alexander, spent the week end with Mr. Watsons parents, Mr. and Mrs. L. H. Watson, Sr. Mrs. Kenneth Deaner visited in the homes of Mrs. Mary Bagby and Mr. and Mrs. W. H. Wingfield and family Saturday evening. Mr. and Mrs. Richard Jenkins, daughter and grand daughter, of Baltimore, visited Mr. Jenkins brother, Mr. H. W. Jenkins Sunday. They visited his mother - and sister, Mrs. Addie Jenkins and Mrs. Francis Abbitt and Mrs. Julian Jenkins, of Lynchburg, Sunday evening. Mr. and Mrs. J. A. Woodalls children gave them a surprised 37th anniversary dinner Sun-  day. Mr. and Mrs, J. A. Woodall and Mr. Jackie Woodall spent Saturday wiih Mr. and Mrs. I James Woodall, of Richmond. Mrs. Raymond Franklin 1 called in- -the home of Mary i- Bagby oneworning last week."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Julian"], "snippet": "Jenkins and Mrs. Francis <mark>Abbitt</mark> and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, Sunday"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Julian"], "snippet": "Jenkins and Mrs. Francis <mark>Abbitt</mark> and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, Sunday"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1388.67, 796.56, 1456.16, 933.95], "bbox_id": "453ccc92d9", "file": "AppomattoxNewspapers_1962-1965a_0515.pdf", "page": 1, "text": "extend a hearty hr. and Mrs. Frank have recently mov- pmunity. s. Julian Jenkins,  visited his mother Iks. Addie Jenkins Wes Abbitt, last bt. H. Garrett and L- Jthe week end in Id., with her son f-in-law and family, Spencer Garrett,"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Iks. Addie Jenkins Wes <mark>Abbitt</mark>, last bt. <mark>H</mark>. Garrett and L- Jthe"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Iks. Addie Jenkins Wes <mark>Abbitt</mark>, last bt. <mark>H</mark>. Garrett and L- Jthe"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1038.0, 1305.94, 1236.77, 1797.25], "bbox_id": "f950c9842c", "file": "AppomattoxNewspapers_1912-1915a_0261.pdf", "page": 1, "text": "To W. C. Nowlinfor supplies ........................... To Ferguson  Smithfor supplies. . ............... To Standard Oil Co.for supplies .................... To J. F. Purdumfor supplies ........................... To S. W. Alvisfor bridge.......... . ..................... To Gus Farrarfor labor.................................... . To J. S. Plunkettfor labor ...... . . .................. ... To J. S. Plunkettfor mess bill. ..................... . To J. T. Wooldridgefor labor. . ......................... To A. F. Godseyfor labor ........... ..................... To W. W. Dossfor labor ................................... To Travis Wooldridgefor labor ........................ To Sam Hollinfor labor ............................ To S. J. Leefor half salary............................. To W. A. Mosesfor half salary ....................... To J. R. Atwoods Est.for quarter salary ....... To L. E. Smithfor quarter salary ................... To Appox. Hdw. Co.1-3 on engine ................. To Appox. Hdw.Co.supplies........................... To R. T. Leefor hay . . . ..................................... To Ferguson  Smithdr supplies ................. To R. E. Caldwellfor supplies ...... . ................. To Harvey  Torianfor supplies ................... To W. T. Nashfor labor.- .................................. To Bob Tibbsfor labor...................................... To N. A. Tannerfor labor ................................ To Standard Oil Co.for gasoline ..................... To Geo. Alvisfor labor., .................................. To A. H. Leefor labor ........... . ...................... . To W. F. Pughfor labor .......... . ........................ J o J. S. Plunkettfor labor. . ............................. To J. S. Plunkettfor mess bill......................... To A. F. Godseyfor labor. ........... . ................. To Floyd Harveyfor labor .............................. To Wm. Simmonsfor labor .............................. To Henderson Hancockfor labor ................... To Appox. Hdw. Co.for supplies ....... . . .......... To Austin Western Co.for road machine.. - To G. T. Farrarfor labor .................................. To Appox. Hdw. Co.for supplies ..................... To F. T. Puckettfor labor ................................ To J. P. Bell Co.for supplies......................... To Ferguson  Smithfor supplies ................. To T. A. Smithfor pair lin e s .................. . To J. S. Plunkettfor labor ............................. . To R. I. Orangefor labor .................................. To A. H. Leefor labor................................... To Julian Pughfor labor................................. To S. J. Leefor half salary............................. To W. A. Moses for half salary ..................... To W. A. Moses for postage, etc ..................... T o L E . Smithfor half salary ....................... To Ernest Abbitt for labor ......................... To J. S. Plunkettfor labor ............................. To Wm. Childressfor labor. . .......................... To H. C. Babcockfor supplies...................... To Laborfor labor ............ .......................... . To Bob Tibbsfor labor ........ - .......... . To W. W. Marthaior labor...  To Purdum  Caldwril tor labor order...-"}, "highlight": {"text": {"matched_tokens": ["H", "Julian"], "snippet": "Orangefor labor .................................. To A. <mark>H</mark>. Leefor labor................................... To <mark>Julian</mark> Pughfor labor................................. To S."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian"], "snippet": "Orangefor labor .................................. To A. <mark>H</mark>. Leefor labor................................... To <mark>Julian</mark> Pughfor labor................................. To S."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1419.37, 374.25, 1585.2, 1615.54], "bbox_id": "3e8c30fbc6", "file": "AppomattoxNewspapers_1926-1933a_0043.pdf", "page": 1, "text": "Th-i county fair three weeks off a for it? The white schools are all open in running order. Mrs. J. W. Carter, has the Wildway to Liberty Chapel school wagon again this yearThornton Car ter has the one from Wildway to Vera. Julian Grow, who has been working in Lynchburg all mer, is back home. Mrs. Grow, of Roanoke, visiting her horne people. Messrs. Jeff Kinney and R. A. Steffans who went through the terrible storm at Miami, Fla., and escaped unharmed, are visit ing their parents, Mr. and Mrs. H. W. Kinney, for a few days, while conditions are improving in that water-soaked country they tell some thrilling incidents of what occured during those twelve long hours of howling wind and driving rain. Miss Susie and Olivia Booker, who have been visiting their parents, Mr. and Mrs. John Booker, at Tower Hill, have re turned to Richmond. George Booker, of Tower Hill, is attending school at Pamplin. Mr. John Beale, who was car ried to a Lynchburg hospital, was brought back last week. We are sorry to learn Mr. Beale is not improving as his friends would wish. Mrs. Lou Ferguson who has been an invalid for more than a year had a bad spell Saturday but is better at this writing. Mr. John Everette Childers, who has been suffering from an infected hand is improving right along, now, we are glad- to re port. Mrs. Jerome Menefee left for Richmond Saturday, to spend the winter With her son, J. T. Menefee and family. Miss Christine Garrett is at tending school at Harrisonburg. Messrs. Watkins and George Abbitt haver gone to Richmond to attend college, and Miss Dora Abbitt is attending A. A. H. S. at Appomattox Mrs. Mayne, who has visiting relatives here, left for Washing ton last week. The farmers are busy cutting and housing tobaccothey are antic pating a visit from Jack Frost in the near future. Sir Leon Levison, president of the International Christian He brew Alliance, in a speech in Toronto, declared that in Hun gary, there are at least forty thousand Jews, who believe in Christ in Poland, thirty-five thousand awhile in Norway, Den mark and Sweeden, fully four- fifths of the entire Jewish popu lation believe in Him. Mr. Stanley Baldwin, Prime Minister of Britain, said recent lyMany forces of good and of evil were loosed in 1914, forces that were not bound at the time of the Armistice and there is a strange leaven at work, today, among all the nations of the world. The Gentile Times ended in 1914. Mr. Baldwin is beginning to see some of the signs of the new dispensation Christs kindom now being ush ered in. Mr. and Mrs. J. R. Booker announce the marriage of their daughter, Marie Susie to Mr- William Dinguid Christian, on Saturday, September 25th, at Washington, D. C- These young people were born and raised in this neighborhood and have a host of friends who wish them God Speed, blessings and happi ness through life. They will be at home at 80 Ridgeway Terrace, Cumberland, Md."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "college, and Miss Dora <mark>Abbitt</mark> is attending A. A. <mark>H</mark>. S. at Appomattox Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "college, and Miss Dora <mark>Abbitt</mark> is attending A. A. <mark>H</mark>. S. at Appomattox Mrs."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.98, 1075.45, 1478.01, 1262.59], "bbox_id": "b2649c9c03", "file": "AppomattoxNewspapers_1974-1975a_0279.pdf", "page": 1, "text": "rs. Rufus Wing- oke, spent a few k in the W. H. e. Mrs. Richard altimore, visited rs. Addie Jenkins , Ber Abbitt, at House and his Julian Jenkins at ospital in Lynch- eek. They also and Mrs. H. W. ra. Covington spent a week in Richmond and Mrs. Charles nd Mr. and Mrs."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Julian"], "snippet": "rs. Addie Jenkins , Ber <mark>Abbitt</mark>, at House and his <mark>Julian</mark> Jenkins at ospital in"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Julian"], "snippet": "rs. Addie Jenkins , Ber <mark>Abbitt</mark>, at House and his <mark>Julian</mark> Jenkins at ospital in"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1910.8, 587.65, 2060.95, 902.23], "bbox_id": "8586e2a17c", "file": "AppomattoxNewspapers_1952-1954a_0576.pdf", "page": 1, "text": "Mr. Rolfe Allen Garrett, May 3. Mr. H. Spencer Garrett, May 8. Mrs. Martha Moore, May 11. Mrs. Elliott Nash, May 8. Miss Lenda Nash, May 7. Doris Jerlene Thomas, May 15. Eugene Grishaw, May 21. Mrs. John Gunter, May 24. Mrs. Joel Guill, May 21. Mrs. Floyd Mitchell, May 2. Mrs. Hester Witt, May 27. Eddie Guill, May 1. Taylor Guill, May 4. Julian Guill, May 4. Mrs. H. B. Pack, May 10. Mrs. Mitchell Lewis, May 21. Rep. W. M. Abbitt, May 21. Major Charles Abbitt, May 25. Jack Lawson, May 10. Mrs. Wesley Stanley, May 14. Holmesly .Stanley, May 13. .Samuel Stanley, May 31. Mrs. Gilbert Crews, May 13. Keith Belcher, May 1. Charles Richardson, May 3. Alice Faye Almond, May 16. Don Greene, May 23. Gilbert Gobble, May 19. Bobby Lawson, May 15. Mrs. Cecil Bailey, May 19. Mrs. Elsie Lucado, May 21. Mrs. Carroll Smith, May 23."}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "Taylor Guill, May 4. <mark>Julian</mark> Guill, May 4. Mrs. <mark>H</mark>. B. Pack, May 10."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "Taylor Guill, May 4. <mark>Julian</mark> Guill, May 4. Mrs. <mark>H</mark>. B. Pack, May 10."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.74, 362.2, 620.74, 1795.51], "bbox_id": "c22bc15a56", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "By order of the Electorial Board of Appomattox County, all Regis tration Books in Southside District shall be purged as of October 4 1954. The names listed below have been removed from the Registration Books, Courthouse Precinct, South- side District, Appomattox County Virginia for reasons of death transferred or moved. This action is provided for and ordered under Sec tions 24-94 through 24-107 of the Virginia Election Laws as amend ed. Any one who can prove conclus ively that any of the names listed below have a right to be on the Registration Books of said County of said district, they shall make such information available to the undersigned registrar. JAMES H. LUCADO REGISTRAR. E. B. Abbitt W. A. Agee A. W. Almond Henry C. Almond Leonard Anderson T. F. Akers C. N. Abbitt J. Russell Abbitt J. R. Adams R. M. Almond T. Dyer Almond Daniel Almond Mrs. Patricia Almond Helen West Alvis Vergie L. Almond Mrs. W. M. Almond Mrs. R. F. Akers W. W. Brown J. W. Blackwell F. B. Blackwell Homer W. Blackwell John A. Booth K. V. Barlow H. H. Bazemore Harold W. Babcock George W. .Bass Alfred Bryant D. J. Berger L. I. Bryant Henry H. Beale William Boyce Alfred L. Barlow R. W. Burkey W. L. Brown H. M. Burge George P. Blackwell J. O. Babcock R. H. Bates O. S. Burnett Jerry A. Burke, Jr. P. M. Burton R. F. Burke, II F. E. Babcock R. H. Baber R. B. Boney, Sr. Berkley Brown H. 0. Blackard Jennie L. Blackwell Eula M. Burke Mrs. Myrna S. Bingham Mrs. Sallie Binkley Mrs. Julia A. Burton Mrs. Jessie Fitzgerald Baird Pearl E. Berger Mildred Babcock Mrs. K. V. Barlow Dorothy Buchanan Mrs. Nannie V. Blackwell Mrs. Ila Jean Buettner Miss Ila V. Buchanan Majorie B. Bailey Mrs. Martha A. Baber Mrs. Bertha L. Baber Addie Bates Mrs. Thelma L. Bazemore Katherine Burge Sara Beasley Mrs. Stanley Blystone Mrs. Mozell D. Boyce Mrs. R. B. Boney, Sr. J. W. Baber W. C. Chilton, Jr. Julian M. Campbell William A. Clark Tucker Cheatham J. W. Cawthorn, Jr. J. H. Cheatham L. Crawley J. B. Chilton J. T. Cole J. S. Cyrus E. P. Carson W. P. Coleman James L. Caldwell J. W. Caldwell J. T. Coleman J. M. Clapp Harvey A. Caldwell Wiley Coleman M. Earl Carson T. L. Christian R. L. Carter Archer A. Caldwell N. H. Cheatham E. H. Cawthorn Wilson R. Cole T. A. Clark S. H. Collins Twyman Conner R. E. Clapp Harry P. Clark W. Twyman Coleman P. W. Coleman W. A. Coleman W. W. Carter John L. Cates, Jr. G. A. Chocolate Enid M. Clapp Robert Cawthorn W. L. Coleman H. S. Coleman E. G. Cheatham T. E. Childress J. R. Conner John R. Cheatham Roy Conner D. L. Cawthorn F. T. Cawthorn, Jr. C. C. Cawthorn J. D. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "the undersigned registrar. JAMES <mark>H</mark>. LUCADO REGISTRAR. E. B. <mark>Abbitt</mark> W. A. Agee A."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "the undersigned registrar. JAMES <mark>H</mark>. LUCADO REGISTRAR. E. B. <mark>Abbitt</mark> W. A. Agee A."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1167.07, 192.66, 1314.46, 738.38], "bbox_id": "19e8f882f7", "file": "AppomattoxNewspapers_1971-1973a_0526.pdf", "page": 1, "text": "and Mr. and Mrs. Monroe Webb Sunday afternoon. We are sorry to hear Rev. and Mrs. Otis Smith are on the sick list but hope they may soon be well. Dinner guest Saturday of Mrs. Charlie Bagby were Mr. and Mrs. James Woodall. Mrs. Twyman Baldwin, Clem Wood- all, Mr. Clarence Coffey, Thomas Woodall, Mr. and Mrs. W. H. Wingfield and Miss Julia Wingfield. We were very sorry to hear of the deaths last week of Mrs. Alvin Hamilton and Miss Mattie Moss. Deepest sym pathy is extended their families. Mr. Richard Jenkins of Baltimore spent Tuesday night with Mr. and Mrs. Julian Jenkins of Lynchburg. He spent a few days with his mother, Mrs. Addie Jenkins, Mrs. Ber Abbitt and Mr. and Mrs. H. W. Jenkins last week. Mr. and Mrs. James Wald ron of Bedford, Mr. and Mrs. Bill Watson and William were guest Sunday of Mr. and Mrs. W. H. Wingfield and family. The L. L. Webbs visited Mr. Sam Coleman Sunday after noon. Mrs. Claude Hamlett and daughter, Brenda and Mr. Grover Beasley Jr., visited their mother, Mrs. Grover Beasley, Sr. last week. Mr. and Mrs. Daniel Repass and daughter, Sherri were visitors Sunday of Mr. and Mrs. R. M. Webb and Mr. Walker Webb. Mr. and Mrs. Grover Smith of Baltimore visited Mrs. Smiths mother, Mrs. C. R."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark> and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark> and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1846.09, 463.27, 2180.95, 526.7], "bbox_id": "1407d70b8d", "file": "AppomattoxNewspapers_1949-1952a_0502.pdf", "page": 1, "text": "A native of Appomattox County, ington, Robert Covington, he was a son of the late Jpel W. Covington, H arry Jenkins, _______ and Eunice Shields Cheadle Jenkins. Jenkins, Julian Jenkins, Mrs. A. B. Abbitt, Jr., Mrs. Colyer Parks, Mrs. Ray Young, Mrs. Estelle Rosser, Mrs. Annie Nowlin. He came to Newport 1921, when he became with the furniture firm."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Shields Cheadle Jenkins. Jenkins, <mark>Julian</mark> Jenkins, Mrs. A. B. <mark>Abbitt</mark>, Jr., Mrs. Colyer Parks,"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Shields Cheadle Jenkins. Jenkins, <mark>Julian</mark> Jenkins, Mrs. A. B. <mark>Abbitt</mark>, Jr., Mrs. Colyer Parks,"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.31, 209.11, 1817.82, 711.93], "bbox_id": "9c7cb1b622", "file": "AppomattoxNewspapers_1905-1912a_0475.pdf", "page": 1, "text": "B oll of Honor Honof oil for D um ber for potnattog HfgjBchopl I 4 h YearLobelia D tinkard, Walter Durham, .Robert Walton, Wilmer Smith. 3rd Yeai--rAshton Harrison, Su sie Hancock.  2i-.d YeafMannie Inge, Etta Turtles. .  iet YearLucile Guthrie, Emma Harris, Virginia fergnson, Mildred OBrien, Della Inge, Alice Cheat ham, Pierce Odor, Alfred OBrien, Royall Hancock, B rkerley Woold-j ridge. 7th GradeNettie Drinkard, Louise Plunkett, Susie Caldwell, Charlie MoseB. 6th GradeFranoes McDearmon, Russel Abbitt, Meta Coleman, Tho.  Caldwell, Jimmie Doss, Adam Cle ment.  5 th GradeKate, QBrien, Rich ard Smith, Julian Gills, Goss Turn?, Thos- Tames. 4th GradeMildred McDearmon, Elizabeth Wagner, Virgie Inge, Ura Harris, Henry Odor, Thomas Ab bitt 3rd GradeGessalyn Hancock, I Georgie Walton, John Cheatham, Harry Plunkett, Walton Jamersoo. I 2nd GradeLee Giles, Eloise At-1 I wood, Alma Plankett, Eva Woold ridge, Verta Smith, Lucile OBrien,j Julian Morris, Annie Pnrdnm. 1st GradeElizabeth Abbitt, Mary Taylor GUIs, Nancy E- Cald well, Luoy Fore, Vet a Morris, Clemniy Gunter, Nettie May Moses, Elsie Haga, Otway OBiieh."}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Verta Smith, Lucile OBrien,j <mark>Julian</mark> Morris, Annie Pnrdnm. 1st GradeElizabeth <mark>Abbitt</mark>, Mary Taylor GUIs, Nancy"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Verta Smith, Lucile OBrien,j <mark>Julian</mark> Morris, Annie Pnrdnm. 1st GradeElizabeth <mark>Abbitt</mark>, Mary Taylor GUIs, Nancy"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.95, 1148.9, 2235.48, 1399.64], "bbox_id": "6755bc6586", "file": "AppomattoxNewspapers_1908-1909a_0563.pdf", "page": 1, "text": "spent Friday night and Satur day at his old home here. Misses Mary Thornhill and . , , __ . ___ Katie Reynolds spent the week  , A number of teachers from orwi riffe Mr  rid Mr. .Tnfen thls county attended the teach- ers meeting held at Lexington Saturday. Mieses Jane Abbitt end with Mr. a n d Mrs. John Thornhill. Miss Florence Grow is not so well at this time. Seay and Clarence Beale, of Buckingham were recent guest of Mr. and Mrs. Willie Beale. Those visiting in the home of Mr. and Mrs. S. T. Megginson Sunday were Mr. and Mrs. Vinston Thornhill, Mrs. . Ida Beale, L. N. Drinkacd, Ben Megginson, Julian Grow, Wal ker Beale, Bob Megginson, H. D. Reynolds .and son. Mr. and Mrs. Frank Wool- Liberty Cemetery drige spent last week-end in  Mrs. Pretlow is survived by the home of J. A. Martin. Mrs. tiie following children Sarah Wooldrige remained and will Frances and Joshua one-sis-. . , ,. ... . spent this week in this home, ter, Mrs. Eleanor Coleman, of several days recently with re B. C. Sims spent a few days  Norfolk, one brother, Emmett i,atlves in Lynchburg, last week with his wife m the Abbitt, of Marion and a num- L. J- and L. C. Hatcher and"}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "N. Drinkacd, Ben Megginson, <mark>Julian</mark> Grow, Wal ker Beale, Bob Megginson, <mark>H</mark>. D. Reynolds .and son."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "N. Drinkacd, Ben Megginson, <mark>Julian</mark> Grow, Wal ker Beale, Bob Megginson, <mark>H</mark>. D. Reynolds .and son."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2069.67, 346.21, 2244.4, 1486.63], "bbox_id": "9c6a1e62c3", "file": "AppomattoxNewspapers_1915-1918a_0585.pdf", "page": 1, "text": "Rjssell Thomas, Evergreen 762 Willie Evergreen 763 Eldridge Grover Cheat ham, Spout Spring I 764 Gideon Houl Haar, Appo mattox 765 Floyd EIay Wooldridge, Appomattox r f d 1 766 Rosser Gawthon Wool dridge, Appomatrx r f d l 767 Everett Ray Ferguson, Appomattox 768 John Daniel Mann, Ap pomattox 769 Anthony Reed, Evergreen 770 James Leonard Bolden, Appomattox r f d l 771 Alexander Harvey, Appo mattox K 772 George Washington Har vey, Appomattox j I 773 Loyd Flemming Jennings,  I Evergreen j I 774 Peroy L o y d Harvey, I Evergreen 775 Benjamin Philip Lee, Appomattox r f d l 776 Henry Loyd Marshall,! Appomattox r f d l j 777 Edd Eames, Evergreen r f d 1 778 Gus Hancock, Appomat tox r f d l 779 Glover Rivelev, Spout Spring 780 Sam Wheeler, Evergreen 781 Winston Thornton Brog- don, Appomattox r f d l 782 Walter H h - Harvey, Ap pomattox r f d l  783 Robert Reed, Evergreen r f d l j 784 John Thomas Scruggs, Appomattox r f d 2 785 Willie Edward Doss, Ap pomattox r f d 8 786 Robert Braxton Gilbert. I Appomattox r f d 3 787 William ThomiBTorrenoe  Appomaitox r f d 3 788 Dawey Ferguson, Appo- mattox f I 789 Harry Thomas Ferguson,  Appomattox i 790 John Andrew Sell, Appo- mattox I I 791 Elliott Cheatham, Appo-1 mattox  792 Allen Miles Bryant, Vera j 793 Robert Julian Jenkins,  Appomattox  I 794 Alfred Bernard Abbitt, Vera  795 James Braneford Lucado, Appomattox 796 Robert Bingham, Vera 797 Josiah Bernard Ioge, Ap pomattox 798 Joe Berkley Inge, Appo mattox 799 Sampson Dewey Caw- thon, Vera 800 Wyrt William Mann, Ap pomattox 801 Charles Roland Smith, Appomat x 802 Howard Maurice Gilbert, Appomattox 803 Shatter Cannon Drink- ard, Appomattox 804 Vernon Bliss Townsend, Vera 805 Gilbert Vera j 806 Robert 807 Wihie Appomattox 808 Fred wood 809 Herbert Colemaa Bagby. Hollywood 810 Lemuel Coffee Mitchell, Appomattox I 811 Robert Washington Bab cock, Appomattox 812 John Allen Tweedy, Ap pomattox 813 James Harvey Stephen son, Appomattox 814 Willie Robert Lee OBrien, Appomattox 815 John Edward Childress, jr., Vera 816 The mas Edw. Morgan, Vera 817 Littleton Lucado, Appo mattox 818 Carl Nicholas Scheffler, Appomattox 8J9 Oscar Fitzdaniel Gallier, Hollywood 820 James Arthur Turnes,Ap pomattox 821 Robert Hurley Ferguson, Appomattox"}, "highlight": {"text": {"matched_tokens": ["Julian", "Abbitt"], "snippet": "Vera j 793 Robert <mark>Julian</mark> Jenkins,  Appomattox  I 794 Alfred Bernard <mark>Abbitt</mark>, Vera  795 James Braneford"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "Abbitt"], "snippet": "Vera j 793 Robert <mark>Julian</mark> Jenkins,  Appomattox  I 794 Alfred Bernard <mark>Abbitt</mark>, Vera  795 James Braneford"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1535.74, 1196.68, 1714.19, 1563.58], "bbox_id": "74e3af589d", "file": "AppomattoxNewspapers_1939-1943a_0024.pdf", "page": 1, "text": "I Vera, Miss Edfna Chermault is spending the holidays with her par ents. Mr. and Mrs. R H. Coleman spent Monday with Mr. and Mrs. Leslie Turnes, of Prospect. Mr. and Mrs. W J . Covington, Alise and Thelma, spent the week end at Mrs. D . N . Robertsons . Mrs. W .J,. Covington, Mr. iand Mrs. D .N . Roberison and children visited Mrs. T . H . Robertson Mon day afternoon Mrs. Maude Abbitt will spend a few days in Vinton with Mrs, W .J . Covington. Julian J inkms and son spent the holidays with his sister, Mrs. A.B Abbitt, at Vera. Miss Daisy Robertson, of Lynch burg spent Christmas day witbher parents, Mr and Mrs ertson, M r. and M rs. J . J . Chemault, and Edna Chemault sp4nt Wednesday at Chestnut Grove visiting M r.and Mrs R .L . Harris. Mr. and Mrs. Spencer Garrett Jr. spent Sunday with Mrs. T. P . Rob ertson.  _ , . Mr and Mrs. T .P . Robertson visited M rs. Emma Coleman Christr mas day. . ,. .. Miss Ola Carter is spending the holidays with her parents. Miss Irene Garrett is spending tne holidays with her parents, Mr Mrs. Spencer Garrett"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "children visited Mrs. T . <mark>H</mark> . Robertson Mon day afternoon Mrs. Maude <mark>Abbitt</mark> will spend a few"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "children visited Mrs. T . <mark>H</mark> . Robertson Mon day afternoon Mrs. Maude <mark>Abbitt</mark> will spend a few"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [832.29, 161.08, 986.25, 418.11], "bbox_id": "9a4d7814d3", "file": "AppomattoxNewspapers_1918-1922a_0430.pdf", "page": 1, "text": "am able young woman Our svmpatby goes out in deepest sorrow for her young and devoted husband. Just one year ago, death, in a few hours notice claimed this young mans father, who for years was his onlv companion. The blending of their lives was something remarkable May our gracious Heavenly Father comfoit and sustain this he reaved husband, who is now broken hearted Mrs Jenkins was in her 27th year. The pall bearers were Messrs. Tommie, Martin and Joel Cov. ington, Julian and Harry Jen kins and Paul Cawtborn The flower bearers yvere Misses Mary Covington, Eula M. Burke, Helen Covington, Lilly M Wbitehoad, J ouise Whitehead, Gladys Smith, Laura Abbitt, Mary L Bryant and Crystal Turnes H"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Whitehead, Gladys Smith, Laura <mark>Abbitt</mark>, Mary L Bryant and Crystal Turnes <mark>H</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Whitehead, Gladys Smith, Laura <mark>Abbitt</mark>, Mary L Bryant and Crystal Turnes <mark>H</mark>"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1814.39, 684.73, 1954.19, 788.32], "bbox_id": "99266843c3", "file": "AppomattoxNewspapers_1974-1975a_0260.pdf", "page": 1, "text": "of Vernon Hill, spent Sunday with Mr. and Mrs. L. H. Watson. Mr. H. W. Jenkins went to see his mother, Mrs. Addie Jenkins and sister, Mrs. Ber Abbitt, at the Liberty Home and his brother, Julian Jenkins at Virginia Baptist Hospital Saturday. They all remain very"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Julian"], "snippet": "and sister, Mrs. Ber <mark>Abbitt</mark>, at the Liberty Home and his brother, <mark>Julian</mark> Jenkins at Virginia Baptist"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Julian"], "snippet": "and sister, Mrs. Ber <mark>Abbitt</mark>, at the Liberty Home and his brother, <mark>Julian</mark> Jenkins at Virginia Baptist"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [341.29, 527.59, 483.19, 1073.7], "bbox_id": "0e2226081f", "file": "AppomattoxNewspapers_1971-1973a_0097.pdf", "page": 1, "text": "HOLLYWOOD Mr. and Mrs. Robert Cole man and Rev. and Mrs. Otis Smith spent Tuesday in Roa- I noke with the Rev. and Mrs. Marvin Jacobs and family. Mrs. James Conner and Mrs. W. T. Covington visited Mrs. Bill Lewis, Mrs. Sadie Crute, Mr. Oscar Turns and Mr. Al ton Turns in Farmville Sun-  day afternoon. Mr. and Mrs. Clem Woodall and Susan spent Saturday with Mrs. M. L. Covington, Mr. and Mrs. Walter Wingfield called in this home Sunday. Mr. and Mrs. Garland Jen nings and family of Richmond and Mr. and Mrs. Alfred Jam- erson and family visited Mr. and Mrs. A. G. Hancock and family during the week end. Mrs. A. W. Slider visited Mrs. L . H. Watson last week. Mr. and Mrs. Rufus Wing field and son, Kenneth were week end guest i n the house of Mr. and Mrs. W. H. Wing field and family. Mr. and Mrs. Julian Jenkins visited his mother and sister, Mrs. Addie Jenkins and Mrs. Ber Abbitt Sunday. Mrs. Char lie Bagby were among others visiting in this home Sunday. Visitors in the home of Mrs. C. R. Banton Sunday were Mrs. Peggy Hartners and Mrs. Mar tha Banton of Phenix, Mrs. Maude Deaver of Lynchburg and Mrs. Eamma Lemon. Mr. and Mrs. L. H. Watson, Susan and Jewel Irby w e r e visitors Sunday afternoon of Mr. W. B. Disrumke of Scottsburg. Mr. and Mrs. Kenneth Bald win and family visited h is grandparents, Mr. and Mrs. H. W. Jenkins Sunday night. Mrs. Charlie Bagby called in"}, "highlight": {"text": {"matched_tokens": ["H", "Julian"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Wing field and family. Mr. and Mrs. <mark>Julian</mark> Jenkins visited his mother"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Wing field and family. Mr. and Mrs. <mark>Julian</mark> Jenkins visited his mother"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.63, 615.88, 2030.98, 941.97], "bbox_id": "25dc4bcb96", "file": "AppomattoxNewspapers_1955-1957a_0521.pdf", "page": 1, "text": "Funeral services for Joel Thomas Morris, 68year-old farmer of Route 2, Concord, killed in a traffic acci dent near Beckham last Thursday, were conducted from the Hebron Baptist Church Saturday at 3 P. M. Mr. Moris is survived by his wife, Mrs. Ghessie Wright Morris two sons, J. J. Morris arid Robert Mor ris, both of Appomattox four daughters, Mrs. Winston Martin, Mrs. T. R. Martin and Mrs. Evans Ferguson, all of Appomattox, and Mrs. Marvin Martin, of Lynchburg. Also by two brothers, R. B. Mor ris and J. H. Morris, both of Lynchburg four sisters, Mrs. J-ulian McFadden and Mrs. Willie Hamilton of Lynchburg Mrs. Janie Frazier, of Washington, D. C., and Mrs. Thornton Carter, of Appomattox 17 grandchildren and four great grand children. Funeral services were conducted by his pastor, the Rev. Colie Rock, assisted by the Reverends A. D. Smith, Fi-oy Cox and Charles Ad dington. Interment was in the church cemetery. Pallbearers were Robert Morris, Raymond Morris, Charlie Carter, Edwin Carter, David Carter, Maplewood Cemetery. Born in Appomattox, Va., the son . of Martha West Jones Abbitt and, Bob Steppe, Jerry Smith and Her- William Chatham Abbitt, Mr. Ab- j bent McFadden."}, "highlight": {"text": {"matched_tokens": ["H", "J-ulian"], "snippet": "Mor ris and J. <mark>H</mark>. Morris, both of Lynchburg four sisters, Mrs. <mark>J-ulian</mark> McFadden and Mrs. Willie"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "J-ulian"], "snippet": "Mor ris and J. <mark>H</mark>. Morris, both of Lynchburg four sisters, Mrs. <mark>J-ulian</mark> McFadden and Mrs. Willie"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [561.86, 609.49, 772.04, 815.83], "bbox_id": "4b2cd0aecf", "file": "AppomattoxNewspapers_1943-1947a_0533.pdf", "page": 1, "text": "Among those planning to ma j the V.M.I., V.P.I. football game in prum Roanoke today are Mr. and Mrs. roo n V. W. Ford, Jr., Miss Rosetta Stan- A lev. Miss Jenny Watson, H- H- , Caldwell, Russell Ridgeway, Mr.and Mrs. P. W. George, Julian Gum, Miss Hersel Brumfield, Mr. and 1  Mrs J B. Seignious, Johnnie L.  Pi and Eddie S. Cates, George Cale. took Mr and Mr. Llovd Hudson and ton, i Miss LaFerne Doss. for t Among those from here attend- medic in- the University of Richmond ys. 0f St wtlliam and Mary game today m Richmond are Dr. C. F. James, R M Mann, J. C. Caldwell, C. R. M1 Hunter, Mr. and Mrs. C. H. Robin- son, Mr. and Mrs W. M Abbitt, M Mi-ses Kate Woodson and Rosa eellan Mat, ooldridge James Guill and"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Mr. and Mrs. C. <mark>H</mark>. Robin- son, Mr. and Mrs W. M <mark>Abbitt</mark>, M Mi-ses Kate Woodson"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Mr. and Mrs. C. <mark>H</mark>. Robin- son, Mr. and Mrs W. M <mark>Abbitt</mark>, M Mi-ses Kate Woodson"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [870.95, 206.26, 1020.72, 975.38], "bbox_id": "56e781e7e6", "file": "AppomattoxNewspapers_1974-1975a_0516.pdf", "page": 1, "text": "Our pastor Rev. Paul Balthaser delivered a fine message Sunday morning at Hollywood. Mr. H. W. Jenkins visited his mother, Mrs. Addie Jenkins, and sister, Mrs. Ber Abbitt, at the Liberty Nursing Home in Lynchburg Sunday. Mr. and Mrs. Richard Jenkins, of Baltimore, visited them last week. Relatives and friends are very sorry to hear Mr. Arnold Childers is a patient in the Lynchburg General Hospital. We pray he may soon be better. Mr. and Mrs. Lawrence H. Watson, Jr. and family, of Alexandra, were week end guests of Mr. and Mrs. L. H. Watson, Sr. Week end guests of Mr. and Mrs. Thomas Woodall and family were Mrs. Woodalls parents, Mr. and Mrs. Clarence Coffey, of Covington. Mrs. Kenneth Deaner and daughters spent the week end in Newport News with Mrs. loan Mayberry, Mr. and Mrs. Ryland Mayberry and Mrs. Lucy Deaner. Mrs. Deaner returned home with them for a visit. Mr. and Mrs. W. H. Wingfield and Miss Julia Wingfield were week end guests of Mr. and Mrs. Rufus Wingfield and family, of Roanoke. Mrs. Shirley Franklin and Mrs. Mary Bagby called in the homes of Mr. and Mrs. Donald Webb and family, Mr. and Mrs. George Jennings and family, Mr. and Mrs. J. C. Jennings and family and Mr. and Mrs. Curtis Scruggs and family Thursday. Mr. and Mrs. Richard Jenkins, of Maryland, visited Mrs. Julian Jenkins of Lynch burg, and Mr. and Mrs. H. W. Jenkins last week. Mr. and Mrs. J. L. Torrence, Mrs. W. T. Covington and Mrs. James Conner visited Mrs. A. E. Covington Monday evening. Mr. and Mrs. Edwin Ander son and Andy and Mr. and Mrs. Scott Sheets were among others visiting Mr. and Mrs. L. L. Webb and family last week. Mr. and Mrs. Bennett Gilliam, of Farmville, spent a few days last week with Mrs. W. T. Covington and other relatives. Mr. and Mrs. Frank Hancock and children, of Richmond, spent the week end with Mr. and Mrs. J. L. Torrence, Sr. A large crowd attended the"}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "of Maryland, visited Mrs. <mark>Julian</mark> Jenkins of Lynch burg, and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "of Maryland, visited Mrs. <mark>Julian</mark> Jenkins of Lynch burg, and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1409.06, 988.66, 1575.46, 1132.55], "bbox_id": "4087137345", "file": "AppomattoxNewspapers_1936-1939a_0020.pdf", "page": 1, "text": "1924- 1925 F i o n  Catkins Abbitt, S r nkai d Tei Gi,la Menard Gills, Julian Grow, Richard Harvey. Howard Inge Richard Lawson, Ro- bert Lucado, Randolph OBrien, Ho ward Rogers, Fred Twyman, Clar ence Brown, Hunter Walker, Livye Lucy Chick, Katye Dillon, pi S Icke.rson H a Belle Evans, Gladys Jennings, Ethelyn Lee, Edith i obinson. Lola Smith, Violetieed, B dle Snead, Vivian, Woolridge, Bessie Gunter. 1925-1926"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Julian"], "snippet": "i o n  Catkins <mark>Abbitt</mark>, S r nkai d Tei Gi,la Menard Gills, <mark>Julian</mark> Grow, Richard Harvey. Howard"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Julian"], "snippet": "i o n  Catkins <mark>Abbitt</mark>, S r nkai d Tei Gi,la Menard Gills, <mark>Julian</mark> Grow, Richard Harvey. Howard"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1602.66, 1255.61, 2083.99, 1440.4], "bbox_id": "249d68653a", "file": "AppomattoxNewspapers_1926-1933a_0563.pdf", "page": 1, "text": ", Mrs. Annie Abbitt Pretlow, Rexford Martin and Miss widow of the late T. B. Pret- Thelma Webb visited Mr. and iow died at her home here Mrs. Collier Marshall last Sat- Tuesday evening, following a Saturday evening. lingering ilness. Funeral ser- Mrs. Emma Martin returned viCes were held Wednesday to her home in-Roanoke last.afternoon from the home, con- week after spending some time ducted by the Rev. W. M. Thompson. Interment was in . Megnson, Julian Gro, Wal- Liberty Cemetery. ker geaie B0b Megginson, H. Mrs. Pretlow is survived by n nnri nn the home of J. A. Martin. Mrs.tlie following children Sarah1 Wooidrige remained and will j Frances and Joshua one sis- . , ,. ... spent this week in this home, ter, Mrs. Eleanor Coleman, of several days recently with re- B. C. Sims spent a few days Norfolk, one brother, Emmett ,atlves m Lynchburg, last week with his wife in the j Abbitt, of Marion and a num-j L- J- and L- c - Hatcher and 1 her of nieces and nephews. I Marguerite made a business She was a faithful member trip to Lynchburg last Satur-"}, "highlight": {"text": {"matched_tokens": ["Julian", "H"], "snippet": "Interment was in . Megnson, <mark>Julian</mark> Gro, Wal- Liberty Cemetery. ker geaie B0b Megginson, <mark>H</mark>. Mrs. Pretlow is survived"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian", "H"], "snippet": "Interment was in . Megnson, <mark>Julian</mark> Gro, Wal- Liberty Cemetery. ker geaie B0b Megginson, <mark>H</mark>. Mrs. Pretlow is survived"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2023.65, 1208.99, 2193.9, 1586.68], "bbox_id": "2ada59835f", "file": "AppomattoxNewspapers_1954-1955a_0431.pdf", "page": 1, "text": "The new Elementary School at Ap pomattox will be formally dedicated Sunday afternoon, with ceremonies beginning at 230 oclock. Dr. Dowell Howard, Superintendent of Public Instruction in Virginia, will be the guest speaker.He will be introduced by Division Superintendent J. A. Burke. The sehool will he open fo r tour at 130, and again after the pro gram. The following will serve as hos tesses, two to each room MeBdames G. W. Almond, A. JB. Evans, H. L. Mays, C. T. Moses Jr., Carter Mar tin, Julian Guill, Byron Cole, T. E. LeGrand, Kenneth Coleman, Char lie Carter, G. F. Abbitt Jr., M. D. Gilbert, C. F. P. Crawley, T. M. Rich ardson, C, G. OBrien, H. A. Gur ney, Ivey Holland, C. J. Hunter, H. T. Barger, R. Ferguson, C. S. Booth, O. C. Hall, W. D. Morris, John Cole, Clarence Guthrie, J. W. Watson, W. S. Gills, W. M. Abbitt, Waverley Brown, Vernon Torrence Mitchell Lewis, Etnaline Chandler, L. W. Moore R. N. Ashworth, Jacob Lewis, Virginia Rosser, Frank Dress er and R. H. Drew. Girl Scouts and members of the safety patrol will serve as guides. The public is invited to attend this ceremony."}, "highlight": {"text": {"matched_tokens": ["H", "Julian"], "snippet": "Almond, A. JB. Evans, <mark>H</mark>. L. Mays, C. T. Moses Jr., Carter Mar tin, <mark>Julian</mark> Guill, Byron Cole, T."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Julian"], "snippet": "Almond, A. JB. Evans, <mark>H</mark>. L. Mays, C. T. Moses Jr., Carter Mar tin, <mark>Julian</mark> Guill, Byron Cole, T."}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.49, 1474.28, 1789.67, 1754.77], "bbox_id": "8d9a70ded2", "file": "AppomattoxNewspapers_1926-1933a_0138.pdf", "page": 1, "text": "We are glad to know . t0 theaudienCe as they go Walter ADbitt, Jr., has returned in u lo home from the hospital very  much improved. . Mrs. Fannie Buford, of Mont- Ivale, was called here on account of the illness of her sister, Mrs- George R. Abbitt. Mrs. George R. Abbitts con- I dition is serious- We are glad to hear Mr. W. J  Wooten is getting better. Mrs. B- L. Megginson, of I Lynchburg, is visiting her sister,  Mrs. C. A. Anderson. Mr. and Mrs. T. H . Robertson land Mr. Tyler Coleman spent I Sunday in Lynchburg. This community was shockec I to hear of the sudden death of Mr. Julian Ferguson. We ex tend our sympathy to the bereav ed family-"}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "sister, Mrs- George R. <mark>Abbitt</mark>. Mrs. George R. Abbitts"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "sister, Mrs- George R. <mark>Abbitt</mark>. Mrs. George R. Abbitts"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.79, 326.85, 1956.54, 785.42], "bbox_id": "e156f80128", "file": "AppomattoxNewspapers_1915-1918a_0563.pdf", "page": 1, "text": "very gratifying. Mrs. Robert H. Coleman has gone to Charlotte for a weeks visit to her cousin Miss Sadie Turnes. Mr. and Mni T. H. Morris, of Hopewell visiting the form ers grandparents, Mr. and Mrs Thomas Harvey at Rose Bower. Miss Ethel Covington who has been spending a few days with relatives hpre has return ed to her hoafo in liHottoway. I Mr. and Mrs. R. W. Abbitt spent hunday at the home of Mrs. T. fit. Robertson. Mrs. D M. Davidson and daughter, are M ending a few weelm with B, David son near bore. Mr. Edward McGinnis who has been quite itík at his home is now muoh improved and is able to be ont again. Mr. Diugttid bhristian, o f Richmond, is visiting his broth er, Dr. D. A. Obristun at his home here.   Mrs. B. W. Morns has return ed home after spipding a week in Lynchburg, t Misses Ada Patteson a n d Raohel Coleman, of Richmond, are visiting StMr. SamMeggin- sons. Messrs. Julian  n d Harry Jenkins were visitors a t thé home of Miss Eva HarVey Sun- A y ."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "very gratifying. Mrs. Robert <mark>H</mark>. Coleman has gone to"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "very gratifying. Mrs. Robert <mark>H</mark>. Coleman has gone to"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2346.49, 385.34, 2522.87, 738.78], "bbox_id": "345caecbf5", "file": "AppomattoxNewspapers_1939-1943a_0066.pdf", "page": 1, "text": "Ven, March SO.- Mrs, Walks? Garneflx an ,4Mrs, J . J . ChernauM spent Sunday afternoon with Hasal Coleman, who continues sick. Mrs. Kieth Marshall, of Ljrnch burg is spending a few days with her sister, Hazel Coleman, Miss Edna Chernault has. returned home after spending two weeks in North Carolina. Mrs. T. H, Robertson, and E dtt Chernault spent Monday with Mrs J. J. Chernault. Julian Jenkins, of Lynchburg pant the week with his sister, Mrs. A B. Abbitt. Mrs. Addie Jenkins sister, Mis., Wilkeroon, is spending a few day i the same home. Mr. and Mrs. Benjamin Snead, of Lynchburg, spent the week-end with Mr. and Mrs. George Abbitt. Miss Annie Robertson motored to Lynchburg Saturday afternoon. T. F. Coleman spent the week end with Mrs. Maude E.Abbitt. Mr. and Mrs, Tom Harvey, of Richmond spent the weex-end with T. C, Harvey. Mr. and Mrs,Aubrey Seay meat Sunday with her parents, Mr. and Mrs. Fletcher Garrett, i Evelyn Chernault spent Monday l with her sister atVera."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "North Carolina. Mrs. T. <mark>H</mark>, Robertson, and E dtt"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "North Carolina. Mrs. T. <mark>H</mark>, Robertson, and E dtt"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [905.31, 236.75, 1064.74, 699.58], "bbox_id": "23b6321a2c", "file": "AppomattoxNewspapers_1915-1918a_0594.pdf", "page": 1, "text": "V era We believe te  flu in this community is decidedly on the decrease, but it is not yet con sidered safe to open the schools and churches. However, we hope the flu, as well as the war, will soon be over. From the reports that are coming from over there, it seemi that the Kaisers resources ar about spent and t?-e struggle nearly over but, girls, we stil have to say, My sweetheart u somewhere in Fiance. Mrs. B W. Morris, who ha been visiting her son in H p well, has returned to her hom here Mr. and Mrs Russell Turi.ee who have been extremely ill o pneumonia, n now improving. We wish for them both a spied recovery. Mrs M F. Kvle, is visitinp her daughter, Mrs. Abbitt Wool ridge, in Lynchburg Mr. T. J. Harvey was thi guest of Mr. Lewis Coleman aBt Sunday. Mr. Frank Gilliam, of Hix- burg, Mr A E Welch, of Bed ford, Mr. Julian Jenkins a d Miss Eva Harvey spent Sundaj with Miss Helen Morris at he home at Rose Bower. Mr. J. W. Jenkins, sr., is quite sick with flu at tab home near Hollywood."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "visiting her son in <mark>H</mark> p well, has returned"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "visiting her son in <mark>H</mark> p well, has returned"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [614.62, 378.05, 754.99, 1075.66], "bbox_id": "80d82269ff", "file": "AppomattoxNewspapers_1974-1975a_0006.pdf", "page": 1, "text": "The WMU of Hollywood Church will observe their State Mission program at the church Wednesday night September 254th at 7 oclock. The Acteens of Hollywood will have their State Mission Program Thursday night, Sept. 26th at 7 oclock in the home of Miss Julia Wingfield, the Acteen leader. Everyone enjoyed the Sun day School picnic Saturday evening at Holiday Lake. Mr. and Mrs. R. A. Coving ton, Jr. of Wilmington, Del., visited Mrs. Mary Bagby and Mr. and Mrs. W. H. Wingfield Thursday. Mrs. Thomas Woodall and Lisa spent the week end in Covington. We were very sorry to hear of the death last week of Mr. Mike Schajers grandmother. Our sympathy is extended her loved ones. Walker and Monroe Webb visited Mrs. Robert Morris and son, Bruce, Sunday afternoon. Mr. and Mrs. Bennett Gil liam, Rev. and Mrs. Otis Smith, Mr. and Mrs. Robert Coleman, Mr. and Mrs. Calvin Smith and family and Mrs. W. T. Covington recently were sup per guest of Mr. and Mrs. J. L. Torrence. Mr. and Mrs. Shafter Drinkard visited in this home recently. Mr. and Mrs. Beryal Stanley, of Madison Heights and Mr. and Mrs. R. G. Austin and Tom visited Mrs. C. R. Banton Thursday. Mr. Richard Jenkins, of Baltimore, visited his mother and sister, Mrs. Addie Jenkins and Mrs. Ber Abbitt at the Liberty Home in Lynchburg last week. He also visited his brothers, Julian and Harry Jenkins and their families while here. Mr. and Mrs. R. M. Webb were visitors Sunday afternoon of Mrs C. R. Banton. Mrs. Robert Morris and Bruce spent last Thursday with Mr. and Mrs. L. L. Webb and family. Mr. and Mrs. Jack Reed and daughter, of Lynchburg, visit ed Mr. and Mrs. Kenneth Deaner and family Sunday. They and the Deaner family were guest Sunday night of Mr."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Wingfield Thursday. Mrs. Thomas"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Wingfield Thursday. Mrs. Thomas"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1020.26, 366.66, 1196.86, 999.45], "bbox_id": "f888e59bf3", "file": "AppomattoxNewspapers_1960-1962b_0517.pdf", "page": 1, "text": "tax County, on the 16th. day December, 1961. THOMAS C. INGE 731 Walnut Drive Euclid 32, Ohio. Plaontaff Against Mrs. Pearl Cyrus 6005 Westwood Street Richmond, Virginia Melba Inge Freed 1010 Paul Street Apt. 2 A. Baltimore, Maryland. Harry Inge 1816 Poole Road Raleigh, North Carolina. Lucy Inge Beasley R. F. D. No. 1 EasH Palatka, Florida. Lottie Inge Johnson Route 1 Reedy Greek Road Cary, North Carolina. Julian W. Inge 1401 Ingriahun St., N. W. Washington, D. C. Clarence Inge 749 Siligo Avenue Silver Spring, Maryland. Mis. Patsy Simms 104 E. Street Corbin, Kentucky Corrice M. Potter Morrisville, North Carolina. Route 1, Box 245 Alma Thornburg, Rt. 1 Mabane, North Carolina, and Others, and all of the unknown heirs, devisees and successors in title of Sallie Inge Cyr3 widow, and heir of Daniel H. Cyrus, de ceased, who ar made parties de fendant by the general description of parities unknown Defendants. The object of this suit is to have partition of the real estate of which Sallie Ing Cyrus died seiz ed by one of the modes prescribed by tow, saiid real. rebate being shown on the land book as contain ing 53 acres - 6 acres and 50 acres in Southside Magisterial Dis trict of Appomattox, Virginia. And it appearing by affidavit fil ed that Melba Inge Freed, Harry Inge, Lucy Inge Beasley, Lottie Inge Johnson, Julian W. Inge, Clarence Inge, Mrs. Patsy Simms, Corrice M. Potter and Alma Thorn, burg are not residents of Virginia, they are hereby required to appear within iepar days after the due pub lication of this order and do what is necessary to protect their inter ests. Teste C. W. Smith. Clerk. George Abbitt, Jr., p. q."}, "highlight": {"text": {"matched_tokens": ["Julian"], "snippet": "Road Cary, North Carolina. <mark>Julian</mark> W. Inge 1401 Ingriahun"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian"], "snippet": "Road Cary, North Carolina. <mark>Julian</mark> W. Inge 1401 Ingriahun"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [515.96, 172.1, 690.05, 1391.91], "bbox_id": "8d1a5f00be", "file": "AppomattoxNewspapers_1918-1922a_0551.pdf", "page": 1, "text": "son, 8 L. Ferguson, Wm. A. Gleason, Jr , W. T. Harrison, Thomas F. Ryan, R. F. Burke, J. T Fitzpatrick, Joseph But ton, Oscar Portner, E W. Hub  bard, W. F. Tinsley, Joseph F I Lowman, A. 0- Portner, Dr. E I A. Alderman, Claude F.itcheu, jE. Lee Trinkle, Wm F Rhet., j Dr Thomas Nelson Page, R. L Burke, Alfred P Thom, Wm H Manu, Breckinridge Long. Ken neth cKellar, Joseph T. Rob inson, Oscar W. Ufiderwood, Judge Henry T. Wickham, Dr A. 8. Priddy, Joseph M Bauser man, Judge 8 C. Graham. James Hay,Joseph A Glasgow, Dr James Abbitt, W. W. Sale, Robert Lansing,Henry 0 Stuart , Geo. Peary, C. Lee Moore, John R. Saunders, Julian Gunn, J D. Hank, J. E West, N. R Feath erston, Judge Goe. J. Hunk ley, S. C. Stratton, F. C. Moon, Bland Massif, M. B. Booker, C J. Campbell, Clyde 8aunders, W E. Carson, E. V. Barley, A. H. Williams. Our special Washington cor respondent says of him The death of Flood is directly due to his fine devotion to his State and partv When tbs Republicans gave it out that they were going to break into the solid South and that Vir ginia was to be the gateway, everyone knew that it meant another loosening of the strings of the long purse that poured out millions and millions for the election of Harrison, Me Kinley, Roosevelt, Taft and Hardingthe long purse of privilege. The Virginia leaders looked over the field and could see no one but Flood to lea the fight to prevent the Repub licans again getting a foothold in the State that was still re- membring painfully the days of the carpet baggers So Flood wae drafted for the iob, though already Chairman of the Demo cratic Congressional Commit tee, he went into it like he went into every other fight with every ounce of force there was in him Of course he wod , aud the Democrats carried Vir ginia by the biggest majority ever known, but Flood came back to Washington and took to hi bed, never to leave it. Of him it can be truly said  He died with the harness on, the broad sword leaping, the wild fight surging fast  Rich as the party is in leadership, Democracy can ill spare him, this proud Virginian, proud of his clean hands, his clean pub tic record, Lis clean profession al career and his spotless personal character. It is re membered of bim that when he first came t j Congress, defeat ing Jacob Yost, a Republican, the result was very close ano he was offered the certificate of election on. a technicality, wbereu ton be refused to accept it, preferring to stand aside until the status of every ques cioned ba lot wae determined, be knew he might lose by so doing, but be preferred it that way. The folio wiug tribute paid our distinguished countyman by a life-long friend is worthy of both men Nobody seems to be able to realize chat Hal Flood, of Ap pomattox, is dead. We cannot grasp the fact that the mao of vigor and force and activity upon wuern we Had learned to rely, and under whose devoted watch care we had learned to feel secure has been suddenly called from his earthly duties, ank that our friend is no more. Mr. Floods great abilities and worth in public life were uaiversaly recognized. But to the people of Appomattox nr was held in esteem as nowhere else, because it was here that tiis worth in private life was best known. Many years"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Alfred P Thom, Wm <mark>H</mark> Manu, Breckinridge Long. Ken"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Alfred P Thom, Wm <mark>H</mark> Manu, Breckinridge Long. Ken"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.99, 207.3, 1741.02, 595.46], "bbox_id": "696731830d", "file": "AppomattoxNewspapers_1912-1915a_0110.pdf", "page": 1, "text": "S o il o f H onor. Honor roll of Appomattox School for Fel roary 4th YearAlice Drinkard, Moses, Kathleen Drinkard. 3rd YearMargaret Littell, fred Tweedy, Fannie Woolfolk. 2nd YearLucile Guthrie, Al fred OBrien, Alice Cheathanr., Hannah Littell, Florence E. Cald well, Glenn Beagle, Ernest Har wood, Kendall Hunter, Odella Woolridge. 1st YearAnna Hancock, Nita Marshall, Charles Moses, Clarence Pordum, Havilah Babcock 7th GradeBussell Ferguson, Frances McDearmon.Bttssell Abbitt 3th GradeDewey Agee, Bernice Clayton, Nellie Pnrijlnm, Rnsie Pur- dum, Luoile Caldwell, Margaret Agee, Macie Inge, Julian Gills, Mil dred Trent, Katy OBrien. 5th GradeChas. Stevens, Bed- ingo MorriB, Virginia Hancock, Mil dred McDeaimon, Marguret Corbett. 4th GradeElaine McDearmon, Estelle Gilbert, Nannie Morris, Varo Blackwell, Geo. Austin, Bransford Dave, Frank Inge. 3rd GradeNettie Moses, Gallic Babcock, Reggie Stanley, Len M it"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "o il o f <mark>H</mark> onor. Honor roll of"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "o il o f <mark>H</mark> onor. Honor roll of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.75, 268.8, 1852.06, 1396.16], "bbox_id": "ec72b8e466", "file": "AppomattoxNewspapers_1912-1915a_0451.pdf", "page": 1, "text": "R o ll o f H o n o r . The following ie a liât of thorn who are on the honor roll nt the Appomattox Agricultural School let YearJulian Gills, Jean Lit tell, Ruth Caldwell ribbon, Mar gftret Agee, Kathleen Rucker . rib bon, Kate OBrien, Ellen Rodger. 2nd YearBussell Abbitt  rib- ion, Lilt Robertson, Rath Alien, Annie Carson, Clara MoDearmon, Francos MoDearmon, Adam Cle ment ribbon, Rebecca Baboook ribbon, Mary Bjugham ribbon. 3rd Year  Annie Hancock, Emise Plankett, Annie Oder rib- lion, Susie Caldwell ribbon, Em ma Walton ribbon, Joe Leps rib- ion, Robert Wingfield ribbon, Valter Rinq ribbon. 4th YearB ie Stratton rib- 1 ion, Lacie Jameraon ribbon, fiorance E. Caldwell ribbon, Vir- i inia  Ferguson ribbon, Mande Drinkard ribbon, Bessie Thorn ton ribbon, Alfred OBrien rib- ion, Alice Cheatham ribbon, Dry Moaes ribbon, Mildred OBrien ribbon, Havilah Baboook ribbon, Hannah Littell Odelle 1 Foolridge. 5th GradeNettie Mooes, Oallie tabcock, Eva Woolridge, Otway JBrien, Margaret Lepa, Joel Hub ard, John Curtis Caldwell, Julian Morris, Lewis Ferguson, Erie Gal- liher, Reggie Stanley. 6tb GradePrank Inge, Frances Smith, Gladys Agee, Bennie Fer guson, Cornelia Gills, Bheda Drink ard, Eloise Atwood, Betty Morris,. lUcile OBrien, Edward Bates, Fannie Morris, Mattie Shepherd, jizzie Shepherd, Clara Blackwell George Austin, Annie Purdum, 7th GradeEmma Littell, Vir- gie Inge, Gladys Patterson. Mar- aret Corbett, Jessolyn Hancock, faorgie Walton, Suaie Purdum,, ary D. Ferguson, Odelle Morria, Slizabeth Wagner, Mildred Trent, ildred MoDearmon,. Gracie Cold- well, Nellie Pnrdnm, Virginia Han cock, Nellie Robertson. 3rd GradeCrystal Tamer, Myr- tie Smith, Nannie Carter, Baxter Karlin, Both Geissen, Hollie Mit chell, Nannie Caldwell, Loniae Ran some, Ada Patterson. 4th GradeVera Morris, Mattie Gontor, Ruby Walton, Jerry Black well, Olenny Gunter, Evie Lena Caldwell, Ruth Clement, Linwooc Godsey, Verna Harris, Elizabeth Trent, Nannie E. Caldwell, Lanra Mann, Elizabeth Abbitt, Lncy Fore, Elmer Smith, Cbas. Geissen, Ro bert Turner, William Burke, By land Mann, Annie Tomer, David Caldwell, Burke Steele and Ned flanoook. 2nd GradeJohn Carroll Stanley,, Bessie V. Harwood, Virginia Leps, Dnnkley Ganter, Mattie Lena Mitchell, Rachel Sheppard, Vir ginia Smitn, Wellington Conner, Marion Wagner, Sears Booth, Flood Drinkwd, Jimmie Wooldridge, Otho Godaey, Arthur Robertson, Lewie McDearmon, Lyle McDear- mon, Joe Ferguson, Mamie Layne, Vivian Wooldridge, Willie Hester Dafidaon, Ollie Baber, Frances Up ton, Rnby Turner. First Grade Pauline Rucker, Louise Maya, Carrie Giles, Alice Patterson, Margaret Farbnsh, Baby Caldwell, Lee Martin, Marshall Galliher, Walker Btepp, Bebekah Martin, Harry Godaey, Biobard Plankett."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> o n o r"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> o n o r"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [717.61, 299.93, 865.45, 1390.12], "bbox_id": "e8f017221d", "file": "AppomattoxNewspapers_1962-1965a_0458.pdf", "page": 1, "text": "Mrs. Lovella McGuire and daughter, Betty Dale, and Mrs. Sallie Minchner, of Richmond, spent Sunday with their brother, G. B. Buchanan and Mrs. Bucha nan. The Buchanans took their guests on a tour of the National Park Area and then had picnic lunch at the Memorial Bridge.    Mrs. Shearer Robertson, Mrs. Ann Davis and Mr. W. H. Ro bertson returned last week from Tennessee. Mrs. Robertson and Mrs. Davis motored to Missouri and Arkansas while there.    Lt. and Mrs. G. Moses Din kins spent a few days with his parents, Mr. and Mrs. Gilbert Dinkins. Lt. Dinkins was en route from Texas to Fort Mead, Md., where he will be stationed.    Mrs. W a t k i ns Abbitt and daughters, Rinne, and Mrs. Sami Kerr, of Richmond, are spend- j ing this week at Virginia Beach.    Miss Dot Sears joined friends from Petersburg Wednesday for a trip to Nova Scotia.    Mr. and Mrs. Preston Coleman visited his sisters, Mrs. R. N. Spiggle, Mrs. Irvin C. Moses and Miss Kate Coleman Monday afternoon.    Mrs. Julian Guill and daugh-1 ter, Julia Ann, are visiting re-1 latives in Philadelphia.   m Mrs. Charlie Page visited her i sisters, Mr. Irvin C. Moses and Miss Kate Coleman on Monday, j July 20th.    Judge and Mrs. George Abbitt,  Jr. and daughter, Nancy R ep.! and Mrs. Watkins M. Abbitt and  daughter, Rinne, and Mr. and j Mrs. Ed Cawthorne attended the  annual meeting of the Common wealths Attorney association at the Cavalier Hotel in Virginia Beach over the week end.    Mrs. William B. Brown and children have returned to their home in Cincinnati after a two weeks vacation with Mr s . Browns mother, Mrs. Sue G. Johnston.    Mrs. Sue G. Johnston has re turned home after spending a week with her daughter and family, Mrs. W. A. Hickman, De catur, Illinois.    Recent guests of Mr. and Mrs. J. R. Shuford have been many of Mr. Shufords relatives of Florida. Also friends Mr. and Mrs. Carl Carter and Mr. and Mrs. Hermie Kelly also of Starke Fla.    Mr. and Mrs. Paul Bugg, Hugh and Nadine spent a recent week end visiting in Richmond.    Mr. and Mrs. R. G. Holt, Mrs. W. R. Holt, of Pamplin, Mrs. Wm C. Gaines, of Detroit, Mich., Mrs. J. R. Shuford and Mrs. Murrell Ferguson attended the funeral of Mr. Thomas Price Samuel in Petersburg Monday morning, July 20th. Mr. Samuel is Mrs. W. R. Holts brother-in- law.    Mrs. J. R. Shuford and Mrs. William C. Gaines attended the  dedication services of the new Patrick Henry Boys Cottage at Red Hill, Charlotte C o u n t y , Thursday afternoon, July 23.    Mr. and Mrs. Virgil Carson, Mr. and Mrs. Tommie Carson and family, and Mrs. Hazel Wertz, all of Roanoke, visited Mrs. David W. Smith and moth er, Mrs. J. O. Robertson, last week.    Mr. and Mrs. H. C. Thornhill, who have been making their home in Norfolk have moved to Brooklyn, N.Y. En route to New York they visited relatives in the county several days.    J. O. Robertson is recovering nicely in the Virginia Baptist Hospital where he underwent surgery."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Davis and Mr. W. <mark>H</mark>. Ro bertson returned last"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Davis and Mr. W. <mark>H</mark>. Ro bertson returned last"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.99, 311.25, 1815.71, 933.08], "bbox_id": "01323f6577", "file": "AppomattoxNewspapers_1908-1909a_0530.pdf", "page": 1, "text": "Miss Mary Taylop Gills, who is teaching at Bedford, was home to spend the week-end with her parents, Mr. and Mrs W. P. Gills. Mrs. R G. Harper and moth er, Mrs. J. D. Ponton have re turned to Martinsburg, W. Va. after visiting their aunt, Mrs. W H. Wright.   Mrs. G. A. WUlton and daughter, Emmie and Mrs, vj  Elliott and children, of Bm-ke- ville, spent Thursday m  the home of J. F. Purdum Mr. and Mrs. S. L, Ferguson, Jr., Willie Smith, Watt Abbitt, Col Joel Flood and Dr. Chas. F. James are attending the Richmond-William and Mary football game today. Eddie Moore, of Northfork,! W Vu. whi has been visiting his moSier, Mrs Mollie Moore, returned home Saturday ac companied by Bradley Ba cock, c Messrs. Eddie H. Moore, Tdm Hamilton, Jessie James, Wil liam Berry and J. J Huddlesr ton, of Algoma, W. Va., were visitors last week in the home of MoHiWL,. Moore. Mr. and Mrs W. T. Wright have returned home after spending several days in Lynch burg with the latter s mother, MnSU. L Fulks. They accompanied back borpe by Mrs. Wrights sister, Miss Theima Fulks. Mrs. R. C. Wagner, accomp anied by her daughter, Eliza beth, hasAeenion a visit to re latives in Elmira, N. Y, Jftey returned by way of Washrng- tfm D C., andVisited another of Mrs. Wagners daughters. Mrs. Julian Abbh and grand-daughter, Miss Billy Rose aAwi and daughter- L la w fS T a n d Mr Edwwd Abbitt arrived Friday to spend the week-end in the home of J. A. Burke."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "their aunt, Mrs. W <mark>H</mark>. Wright.   Mrs. G. A."}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "their aunt, Mrs. W <mark>H</mark>. Wright.   Mrs. G. A."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [667.51, 273.44, 807.99, 510.27], "bbox_id": "72b1f0f1d6", "file": "AppomattoxNewspapers_1962-1965a_0136.pdf", "page": 1, "text": "March 28  Miss Jean Brown is home from Averett College for the Spring, semester. David Austin returned home last week from the hospital. We hope he may soon be well. Little Denise Webb spent the week end with her grandparents Mr. and Mrs. Monroe Webb. Mr. and Mrs. Julian Jenkins, of Lynchburg, spent Saturday with his mother, Mrs. Addie Jen kins and sister, Mrs. Ber Abbitt. We are so glad Mrs. Jenkins is better. Mr. and Mrs. Grover Beasley returned home Friday. He is im proving nicely. Mr. and Mrs. Bob Jenkins and Cynthia were dinner guests Sun day of Mrs. C. E. Franklin. Rev. W. H. Elder, Mr. and Mrs L. L. Webb, Miss Odelle Webb, Mrs. Emma Lemon, Mrs. Alfred Almond, Hazel Almond, Mr. and"}, "highlight": {"text": {"matched_tokens": ["Julian"], "snippet": "Webb. Mr. and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian"], "snippet": "Webb. Mr. and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, spent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.55, 296.51, 1815.77, 1281.87], "bbox_id": "d0aef819ca", "file": "AppomattoxNewspapers_1939-1943a_0118.pdf", "page": 1, "text": "jrouch, Mr. and Mrs. C.C.Cralle, Lawrence Moore and W .E.Ferrell. Mrs. Jennie Johnson is spending his week in Roanoke. Miss Emily Featherston is visit- Mrs W A. njhornhill. o f Blue- field. Mr and Mrs. Jerry Allen Burke, Jr of New York will arrive this week-end to visit his parents. Mr. and Mrs. Burke spent this week at Nantucket. Mr. and Mrs. M. T . Parrish and daughter will spend the week end in Richmopd. Mrs. Parrish and daughter will motor to Charlottes ville Sunday to spend next week. Mr and Mrs. W. F . Woolfork and son. Billy, of Petersburg are visiting in the home of her mother Mrs. W. M. Hancock. Mrs. Florence Carson. Mr. and Mrs Earl Carson of Steelton. Pa. are visiting relatives here , Mesdames Dora Randolph. D.E. Caldwell and R. W. Stanley havel returned after a ten-day trip to New York. Pennsylvania and West Vir- giiria i Misses Lucille Moon and Avis God sey left Sunday for Elizabeth City, N J. where they have accepted positions. Misa Doris Mann of Crewe is visiting Miss Hilda Mitchell. Lawson Lee is sick in Richmond. Miss Claire Browning, of Rich mond is- visiting Mrs. R . N. Daw son, Herman Lee is visiting in Roan- ok. 1 Mr. and Mrs. W. E. Kemp, of Radford were week-end guests of Mr. and Mrs. W.M. Morris. Mrs. J. W. St Clair, of Roan oke is spending this week with Mrs.  R. T. Lee. jke Abbitt. of Roxboro is visiting his brother, C. N. Abbitt. Mr. and Mrs.Wrrren Hamlet and Miss Margaret Parker, of Halifax, spent Sunday with Mr. and Mrs. W H . Lucado,.  Misses Helen Mitchell and Doris Guill are visiting in Bedford. Mrs. Houston Crqwder, of Rich mond is visiting her parent. Mr. and Mrs. Jessie Harvey. Lt Eames A. Powers, of Rich mond, spent the week-end in the home of J. E. Sears. Mrs. C W. Potts of Richmond spent Sunday with her aunt. Mrs. Lottie Bledsoe. j Mr. and Mrs. LeRoy Smith and family spent Sunday in Halifax. Mr and Mrs. Julian Grow and daughter, of Roanoke are visiting in the county. Mavor C S McDearmon plans to a l n d the N. W. Veterans convention in Raonoke next week. t s Greenlee, of Washington recently visited Dr. D. N. Twy- man, who continues sick. Mr. and Mrs. W. L . Fa rm er spent the week-end at Wyliesburg. iTflie contract bridge club will meet tomorrow evening with Mrs. Calvin Robinson. Miss Elaine McDearmon and H. Y Spencer spent today in Lexing ton. Miss Marian June Evans.is visit ing in Baltimore. Mrs. Dorothy Davis, of Lynch-1 burg renently visited Mrs. U. - G a y l e . ____ _______ _"}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "R. T. Lee. jke <mark>Abbitt</mark>. of Roxboro is visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "R. T. Lee. jke <mark>Abbitt</mark>. of Roxboro is visiting"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1698.25, 1103.22, 2354.29, 1414.19], "bbox_id": "caf883da47", "file": "AppomattoxNewspapers_1905-1912a_0445.pdf", "page": 1, "text": "Joe Smith has moved in Mr.  .  ----- - .Smalls house and Mr. Wm. operated on at the Johnston -1 ville District, Forest Guthrie I chernault hag moved to the 1 W illis hospital for an old trou- 190 . For Supervisor in M anhall I We con understand tbe ease with  oM Woolridge home, ble with which she has suffer -1 District, J. B. Hanes 166 . Fori whioh a fool and bit money are There io no school over this ed for a long time. While  Supervisor in Slate River Dist -1 parted, bnt what ponies Ufe is howwa_ M ye there is always hope, much  riot, M. L. Layne 71 . There the fool got the money to pert with.  We are sorry to note the ill- anxiety is felt among her rela-lwere a few scattering votes . . . . f , ness of Mrs. J. R Caldwell and tives lest the operation does  cast for other candidates, a few  There ie uttledanger frentfi cold j yym Abbitt. Mrs. Oald- not prove very beneficial to I of such were cast for G. J lrheaUowed by pneumomaod I well has been suffering with Mrs. Morgan. jRixey. I this never happens when Chamber-a felon on one of her fingers. Miss Bessie Rice continues to Mr. John Eldridge had  e  iins Cough Remedy is used. This Mrs. J. T. Cole has returned slowly improve. She is now misfortune to lose a valuable remedy has won it. grrat reputation  rom  pleaMDt trip to relatives .ble to .it up. It hM not yet her the p u t week. It w bJP Drllle and Pttt.ylT.uia. been announced when she willl thought the horse ate too free y I npon wjti, implicit confident e.  The young folks had a most be taken to Richmond to under- J s o m e damaged pea nay- I por n e Bn dealers. . enjoyable time at Mountain go the operation the physicians I Several calves have died of I  ------- I View last Saturday evening. think will be necessary ere she I black leg of late this disease j por the year ending in September Mr. Julian Coleman, the in permanently restored toll 8a.id to be caused by  e the crop of sagar cane in Cuba x-baby of the homealas a health. calves fattening too rapidly  ded 1 , 469,000 tons.  baby no longercelebrated his Circuit Court convenes here 1 fresh grass, and the diaaaae a ------   -------- .. I birthday. Amnsing games and on the morrow. Many iieoplel001111 1 thmk to attle noti J. 8 . 8 ims, of Ardmore, Oklahiyeiy conversation made the were under the impression thatolder than on yea.r . . . ed 41 probably tbe smallest mani10ttra pass all too swiftly. Nice Circuit Cburt came off in Oc- The new phne line is DeingJjn the State, being only fonr fet refre8hments were served.    H  ........... Nov. 6 . Be could not be announced that 560 anu  1D JWTO  w was Duriea in a enua s casket.  Hollywood."}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "frentfi cold j yym <mark>Abbitt</mark>. Mrs. Oald- not prove"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "frentfi cold j yym <mark>Abbitt</mark>. Mrs. Oald- not prove"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.0, 1536.96, 1608.6, 1733.26], "bbox_id": "8b72a36d1e", "file": "AppomattoxNewspapers_1908-1909a_0138.pdf", "page": 1, "text": "George R. Abbitt. Mrs. George E. Abbitts con dition is serious. We are glad to hear Mr, W. J. j  Wooten is getting better. Mrs. B . L. Megginson, of I Lynchburg, is visiting her sister, I Mrs. C, A. Anderson.  M l and Mis. T. H. Robertson Itnd iMr, Tyler Coleman spent j Sunday in Lynchburg. This community was shocked I to hear of the sudden death of Mr. Julian Ferguson. We ex tend our sympathy to foe bereav ed family."}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "George R. <mark>Abbitt</mark>. Mrs. George E. Abbitts"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "George R. <mark>Abbitt</mark>. Mrs. George E. Abbitts"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1127.29, 872.73, 1266.54, 1123.46], "bbox_id": "6f26f89163", "file": "AppomattoxNewspapers_1962-1965a_0108.pdf", "page": 1, "text": "Feb. 14  Mr. and Mrs. Julian Jenkins, of Lynchburg, visited his mother and sister, Mrs. Addie Jenkins and Mrs. Ber Abbitt, Saturday. We are so glad Mrs. Jenkins is some better at this writing. Mr. D. L. Smith is on the sick list. We missed him at Holly wood, Sunday. Mr. Joe Slough was brought home from the hospital, Sunday afternoon. We all wish for him a speedy recovery. His daughter, Mrs. Edith Soudens, of Balti more, is spending a few days with her parents. Howard Smith is on the sick list. We hope he may soon be well again. Mr. and Mrs. R. H. Coleman called in the C. J. Bagby home, Friday afternoon. Mrs. Ralph Robinson visited Mr. and Mrs. L. H. Watson and girls, Tuesday night. Mir. Wat son isnt well at this writing. Wie"}, "highlight": {"text": {"matched_tokens": ["Julian"], "snippet": "14  Mr. and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Julian"], "snippet": "14  Mr. and Mrs. <mark>Julian</mark> Jenkins, of Lynchburg, visited"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [405.56, 675.56, 539.6, 1007.0], "bbox_id": "7a8b11df8c", "file": "AppomattoxNewspapers_1922-1923a_0045.pdf", "page": 1, "text": "Deb Babcock who confined for several days orted much better. Russell Abbitt, of Blacks L spent the week-end with lives here. L c. J. App and daughter, lyDcbburg, have been visit die. H. W. Kinney, at Vera, Several days. fts. Sallie Wingfield and 1 ate Franklin,of Lynch b.Bpent Sunday with her r, of Spout Spring, Mrs. .Perdue and Mrs. L. M, leu. here will be a community ket picnic near Apppmattox jluly 4 th under tbs atttpice j New Comers Association la will be announced later. r. Julian Martin, of Lynch- spent Sunday with his ber, Mrs. Julia A. Martin, inasbeen ill for some time. I is reported a little better."}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "orted much better. Russell <mark>Abbitt</mark>, of Blacks L spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "orted much better. Russell <mark>Abbitt</mark>, of Blacks L spent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1831.8, 1246.61, 2153.15, 1551.56], "bbox_id": "7ed89de972", "file": "AppomattoxNewspapers_1926-1933a_0201.pdf", "page": 1, "text": "Chilton, Ossie Carson, Alma T j .. ... ha. rfl. Jarson, Eloise Abbitt, Tom   aif  jtratton, Rolfe Stratton, Scott U r a e d  m a to h e r cou- Ara Tames OBrien I iin, Mrs. Robert Carter, who Sixth GradeJBessie Chris-  HI at her home in Richmond aan, Minnie Crooks, Mary Da-1 g u a Burke, of Boftnoke idson, Heneretta Davidson, I nf the Misses Vera and Ann. ..a mine Franklin, Lucille Fer- J Abbitt of Norfolk, were week- Juson, Virginia Hall,  e lm a I jnd guests of Miss JSula Mai ..mg, Caroline Moses, Eunice They were joined Sun- .mith, Frances Thomas, Can I j ay by Richard Francis Burkc i _,vans, Marvin Godsey, Win-1 nj j amea Brown, of Roanoke Lton Godsey, Calhoun Moore,! ________ _ ________ 1 koshua Pretlow, Alfred Tor- Average rainfall throughout ence. _ , _ 1 Virginia for 1930 showed a de Y Fifth GradeLeshe Gordon  1674 inches pr 4 c -daunce Gordon, Cawthorn I ceBt  1 , accord kohnson, Wylie R ichardao,! to  compiled by tht ixlene United States weather auth ri lraile, Beatnce Godsey, rnyi-i . .s Godsey, Carrie GuUl, D ornr . Lucado, Marie Mays, Rache! 1 .oon, Lou Edith Smith.  w _ a R. 4 A, Gladys Da 1 Fourth G r a deRichara I !  1 jurke, Julian Guill, Jack Caw- j j  Grade Harry Burge horn, Charlie Seay, I Robert Allan Sears, France ..ans, Virginia Moses, Haa Mayberry, Bfllie Moses, Alic 1 agers, Kathenne Burge, Maxi Yed Hsnenkrat, Bill! I .ie Gienn, Katherine Jones"}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "ha. rfl. Jarson, Eloise <mark>Abbitt</mark>, Tom   aif  jtratton, Rolfe"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "ha. rfl. Jarson, Eloise <mark>Abbitt</mark>, Tom   aif  jtratton, Rolfe"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [436.29, 607.27, 614.24, 1808.6], "bbox_id": "36a11ee64b", "file": "AppomattoxNewspapers_1954-1955a_0095.pdf", "page": 1, "text": "By order of the Electoral Board of Appomattox County, Virginia, all Registration Books in Stonewall Dis trict shall be purged as of October 4, 1954. The names as listed below have been removed from the Regis tration Books, Stonewall Precinct, Stonewall District, Appomattox County, Virginia for reasons of death, transferred or moved. This action is provided for and ordered under Sections 24-94 through 24- 107 of the Virginia Election Laws as amended. Any one who can prove conclus ively that any of the names listed below have a right to be on the Re gistration Books of said county of said district, they shall make such information available to the under signed registrar. J. OWEN CARSON, REGISTRAR. Abbitt, W. F. Akers, Mrs. Pearl R. Alvis, J. P. Sr. Alvis, Mrs. Lucy W. Alvis, J. K. Alvis, W. S. Anderson, S. E. Alvis, Virginia Bagby, S. P. Barnard, B. S. Blankenship, J. B. Blackwell, Mrs. Mattie B. Brown, W. W. Burnett, J. R. Button, Jos. Button, Mrs. Anna D. Blankenship, J. P. Caldwell, Doris Cardwell, C. W. Cardwell, W. L. , Cardwell, C. E. Carson, E. H. Carson, Mrs. Sallie L. Carson, Mrs. Sara E. Cabell, Guy Sr. Cheatham, Geo. W. Cheatham, Mrs. Ruth D. Carwile, Arthur Christian, Mrs. Agnes Christian, Miss Agnes Crews, J. W. .. Crews, Charlie . . Crews, W. J. . Cyrus, G. P. w Cox, Mrs. Agnes Caldwell, Elvin ... Carson, J. E. Jr. Campbell, Harold E. Drinkard, C. W. Sr.  Drinkard, C. W. Jr. Drinkard, H. A. Drinkard, C. M. Drinkard, E. C. Drinkard, G. P. Drinkard, M. M. Drinkard, W. E. Drinkard, Mrs. Lillie E. Drinkard,-Willie M. Drinkard, Evie Drinkard, Colenna Drinkard, Susie M. Davidson, Mrs. Minnie Dunn, L. D. Drinkard, Fleming Eagle, David Eagle, R. G. Eagle, Mrs. Lula Eagle, Mrs. T. E. Eagle, Cleveland Eagle, Richard Jr. Eagle, Walter L. Eagle, Russell H. Eagle, Coles Fracker, D. G. Fracker, N. K. Fracker, Mrs. Susie Ferguson, O. W. Ferguson, Tony Ferguson, J. R. Franklin, Joe Fisher, John G. Foster, Eddie S. Fulcher, J. G. Foster, David Green, W. L. Green, Mrs. iSallie E. Goodman, R. J. Gunter, R. D. Garner, J. C. Garrett, William S. Gunter, Eddie Grow, Mrs. Alice Grow, Julian B. Horsley, J. R. Horsley, Mrs. Annie D. Harding, C. J. Harding, C. W. Harding, Lyle Harding, Mrs. Mary J. Harding, Mrs. C. W. Harding, Miss Verna W. Hamilton, B. W. Hamilton, Mrs. Ruby Hawes, Mrs. Bessie Hawes, Miss Harriet A. Hamilton, Elkin R. Hamilton, Frances B. Hughes, Geo. E. -j"}, "highlight": {"text": {"matched_tokens": ["Abbitt"], "snippet": "J. OWEN CARSON, REGISTRAR. <mark>Abbitt</mark>, W. F. Akers, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt"], "snippet": "J. OWEN CARSON, REGISTRAR. <mark>Abbitt</mark>, W. F. Akers, Mrs."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [201.09, 1077.09, 686.63, 1366.04], "bbox_id": "4ce2513ef8", "file": "AppomattoxNewspapers_1926-1933a_0519.pdf", "page": 1, "text": "brtt, former Comm sa passing of several forged Revenue, of A p p o m a t t o x c h e c k s froin one of the Farm- ty? now at Manon, V ., ti I ville tobacco warehouses Mon-  AB Pretlow  p  day night was rePorted tht folk, Mrs. T. B. Fret  P j ames carter had made out pomattox. and many p - jchese checks for his warehouse and meces- I the night before to be ready to ----------------- -- ,, Dr. Abbitt was the y g l.use n payment for tobacco man, who is said to have told of seven sons born to ijt .  purchased from farmers. The a brother of the dead man that liam. H. and bara ra 8 thief got hold of these checks Ithey were responsible Plunkett Abbitt, on their plan- L d p S8ed them on to severai ------------- o -------- tatioh one mile east of App - merchants Tuesday morning, mrnttox, and was educated at  , , ,, Suffolk and Glade Spring Mili- Up last night the passer tary Academy, and M e d ic a l I f the checks hd not been ap- College of Virginia. He prac- prehended, it was reported ticed at Appomattox with his here. One alleged suspect was brother, Dr Julian Hamner Ab- questioned, but was released bitt and later at Beckham, but when merchants failed to i his brother died while Dr.Identify him- James Abbitt was on his bridal tour, and on his return he re sumed practice at Appomattox and remained here until 1918  Vn he moved to Norfolk and i, -ed there until his death. Dr rgeon for N.  W.,  QOliVeR- R. f o r many"}, "highlight": {"text": {"matched_tokens": ["h"], "snippet": "t o x c <mark>h</mark> e c k s"}}, "highlights": [{"field": "text", "matched_tokens": ["h"], "snippet": "t o x c <mark>h</mark> e c k s"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
