{"document": {"bbox": [1435.77, 1473.49, 1779.33, 1774.48], "bbox_id": "1fd7cfd8c0", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "uents. One of these stops was at the Court House. During he year 1851 or 1852, the Atlantic, Mississippi  Ohio Railroad vas constructed through the County. The first passenger train roing through to Roanoke was in November, 1852. This, of ourse, was a great boon to the transportation and development lf the County. At that time the engines were fired with wood cut, hauled and stacked along the track. I The New Constitution above referred to, provided for the election of officers by a vote of the people, rather than by ap- Pointment, and in May of that year the first election was held.  1 I860 Geo. T. Peers became the County Clerk, Wilson BHix, Sheriff, Samuel J. Walker Commissioner of the Revenue, l and L. D. Isbell, Commonwealth Attorney. It was a time marked by great national issues and fateful  visions. Two conceptions of Government were clashing, one, the South adhered to States Rights, and followed the poli-  ical philosophy of Thomas Jefferson the otherthe North,  avored Centralized Government, and adopted the principles  f Government of Alexander Hamilton. Questions of Slavery  States Rights were major topics. Excitement reached a cli-  uiax in the Presidential election of 1860, when Abraham Lin-  Coln Was elected President.  ttc, APPmattox County sent Lewis D. Isbell, an announced"}, "highlight": {"text": {"matched_tokens": ["L", "D", "Isbell"], "snippet": "the Revenue, l and <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark>, Commonwealth Attorney. It was"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D", "Isbell"], "snippet": "the Revenue, l and <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark>, Commonwealth Attorney. It was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["L", "D", "Isbell"], "snippet": "COMMONWEALTHS ATTORNEYSThos. S. Bocock, <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark>, Crawford Jones, Edward Woodson,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D", "Isbell"], "snippet": "COMMONWEALTHS ATTORNEYSThos. S. Bocock, <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark>, Crawford Jones, Edward Woodson,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1204.05, 155.75, 1371.65, 562.68], "bbox_id": "60c0f05074", "file": "AppomattoxNewspapers_1974-1975a_0207.pdf", "page": 1, "text": "quired this historic tract of land in April, 1937 from the Flood and Ferguson interests. To follow in the footsteps of those who have played major roles in our countrys history is a dream of most Americans. At Grants Headquarters, one may literally do so today.    Next week Lees Headquart ers.    LOOKING BA CK ... 1. Which Appomattox home was used as a Union signal station? a. Webb b. Coleman c. Tibbs d. McDearmon 2. New Hope Baptist Church was once named a. Wolf Creek b. Vera c. Piney Mt. d. Bethel 3. Appomattoxs delegate to the Secession Convention in 1861 was a. J. W. Flood b. L. D. Isbell c. John Rosser d. Wm. Macintosh 4. The Historical Parks first superintendent was a. Grover Steele b. Art Miller c.  Hugh Gurney d. Ralph Happell 5. Which town agency was established in 1927? a. Volunteer Fire Dept, b. Health Dept, c. Tag Agency d.  Circuit Court"}, "highlight": {"text": {"matched_tokens": ["L", "D", "Isbell", "d"], "snippet": "J. W. Flood b. <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark> c. John Rosser <mark>d</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D", "Isbell", "d"], "snippet": "J. W. Flood b. <mark>L</mark>. <mark>D</mark>. <mark>Isbell</mark> c. John Rosser <mark>d</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.82, 539.54, 1750.92, 686.59], "bbox_id": "b23ccffbbd", "file": "AppomattoxNewspapers_1902-1905a_0297.pdf", "page": 1, "text": "Mr. A-. T. Isbell,, this morning received the news of the death of his grandmother Mrs. C. A- Isbel, at the home of her son Mr. L. D, Isbell, in Huntington, W. Va. Deceased was a widow of the late John H. Isbell and was 94 years of age. She was born iti Appomattox county, and lived there most of her life removing to Huntington about a quarter of a century ago. She is survived by two sons, Mr. L. D. I-j- bell, of Huntington, and Mr. John H. Isbell, of Arkansas.Lynchburg Advance, Tuesday,"}, "highlight": {"text": {"matched_tokens": ["L", "D", "Isbell"], "snippet": "of her son Mr. <mark>L</mark>. <mark>D</mark>, <mark>Isbell</mark>, in Huntington, W. Va."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D", "Isbell"], "snippet": "of her son Mr. <mark>L</mark>. <mark>D</mark>, <mark>Isbell</mark>, in Huntington, W. Va."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.4, 1057.86, 1941.45, 1071.61], "bbox_id": "7a592a1389", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": "Isbell, L. D., Tr. for Ju d ith Foro. Irvine, E. ... ........................................."}, "highlight": {"text": {"matched_tokens": ["Isbell", "L", "D", "d"], "snippet": "<mark>Isbell</mark>, <mark>L</mark>. <mark>D</mark>., Tr. for Ju <mark>d</mark> ith Foro. Irvine, E. ... ........................................."}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "L", "D", "d"], "snippet": "<mark>Isbell</mark>, <mark>L</mark>. <mark>D</mark>., Tr. for Ju <mark>d</mark> ith Foro. Irvine, E. ... ........................................."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [238.79, 1953.21, 373.87, 1984.21], "bbox_id": "b9d1b66251", "file": "AppomattoxNewspapers_1898-1902a_0422.pdf", "page": 1, "text": "Mll-on Isbell, a- P a tte d J L. T. Williams. f u Stanley I A. H. Clement. J- it- Kobt. Irby, H. C. Babcock, B, V Taylor."}, "highlight": {"text": {"matched_tokens": ["Isbell", "d", "L"], "snippet": "Mll-on <mark>Isbell</mark>, a- P a tte <mark>d</mark> J <mark>L</mark>. T. Williams. f u Stanley I A. H. Clement. J- it- Kobt. Irby, H. C. Babcock, B, V Taylor."}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "d", "L"], "snippet": "Mll-on <mark>Isbell</mark>, a- P a tte <mark>d</mark> J <mark>L</mark>. T. Williams. f u Stanley I A. H. Clement. J- it- Kobt. Irby, H. C. Babcock, B, V Taylor."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [562.78, 666.24, 701.21, 864.18], "bbox_id": "8e05ccc3a8", "file": "AppomattoxNewspapers_1974-1975a_0311.pdf", "page": 1, "text": "T. Gills c. L. D. Guillaume 4. Thomas Lovell 2. Home at Historic park supposedly haunted a. Peers b. Meeks c. McLean d. Isbell 3. Author of My Health Is Better In November a. Havilah Babcock b. Albert Fratrick c. Eliz. Kinsey d. Josiah Megginson 4. Church moved to near Piney Mountain a. Liberty Chapel b. Hermon c. Wesley d. Bethel 5. Name of old stage road in county a. Concord b. Piney River c. Oakville d. Enonville"}, "highlight": {"text": {"matched_tokens": ["L", "D"], "snippet": "T. Gills c. <mark>L</mark>. <mark>D</mark>. Guillaume 4. Thomas Lovell"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D"], "snippet": "T. Gills c. <mark>L</mark>. <mark>D</mark>. Guillaume 4. Thomas Lovell"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1769.73, 174.66, 1935.78, 856.19], "bbox_id": "77861834c0", "file": "AppomattoxNewspapers_1905-1912a_0193.pdf", "page": 1, "text": "T eachers In A ppom attox Schools. Term 1910-11 opening Oct. 3rd. C lo v er H il l D is t r ic t . Pamplins Graded, T. W. White, Principal Maggie Ewing, lt As sistant Minnie Thornton, 2nd As sistant. Martins, Mary Baghy Evergre. n, Sallie B Hunte. Rocks, Mattie J. Drinkard Hixburg, Julia jjuck Hur sville, Hattie A. Drink- ard Gold Hill, Logan Gilliam Browns, Lelia Henley Hollywood, Clem Fergnson Rugby, Be Knick- rbocker Vermillion, Rochet Glenn Harmony. Bara Dawson Roadside, Wm. S. Ilix, Col. Piney Ridge, 0. VI. Hamlet, Col. S ouths  de D istrict . Spout Spring Grad, d Mit-s E z Andersen, Prii Ethel Abbitt, Ass  Reedy Spring, Mrs. Uhathm Fati ng Rive , Louise Serv enU Pettys Fork, Ada OBrien Marshalls, Mag gie V. Chilton Lmg Cri-ek, LZZe Harvey Ha veys Gate, Vlaiy Gi d- aey Bush Forest, Vi-nima S-an Cheathams Angl -, Mattie Caldwell. Appomattox. Maiy E. Patersun, Col Chap, Annie Isbell, Col. S t o n e w a l l D is t r ic t . Airy Hili, Ida May Powers Tower Hill, Mrs. Laura Dernier Liberty t.bappel, Miss Deloca Banton Bent Creek, Mrs. N. R. S. DeWitt James River, Mrs. Geo. Tyree M t, Comfort, Mary Abbiit Mt Zion, Lucy Patterson Hebron, N. I. Foster Stonewall High School, Prof. J. G. Fisher, Prin. Sallie B. Spencer, 1st Asst Kate Duke 2ud Asst Buck Greek, Mary S.eptoe Oakville Graded, M. Frances Moss, Prin Jamie F. Mess, 1st Asst Fannie Taylor, 2nd Assi Garret, Mr. R. H. Wheeler Red Oak, P. W. Callaham, Col. T enth C ongressional H igh school . Prof. L. Crawley, Prin. L na Reekes, 1st Asst. Ida Okesffee, 2nd Asst. Mrs. 8. B. Reynolds, 3rd Asst. Miss Mary Irby 4th Asst. Al i c e Hubbard, 5th Asst. Estelle Thornton, 6 h Asst. Kate Frnxlm, Music."}, "highlight": {"text": {"matched_tokens": ["l", "D"], "snippet": "v er H il <mark>l</mark> <mark>D</mark> is t r ic"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "D"], "snippet": "v er H il <mark>l</mark> <mark>D</mark> is t r ic"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1599.61, 390.25, 1849.53, 548.01], "bbox_id": "d98bd512e1", "file": "AppomattoxNewspapers_1898-1902a_0578.pdf", "page": 1, "text": "M ethodistRev. Robert N. H artness,  Pastor. F irs t S unday-M t. Comfort, 11 a. m. Trim - 1 ty, 330 p. m. Second SundayWesley Chapel. 11 a in. ! H erm on, 380 p. m. Appom attox Memorial. 800 P- m. rbird SundayTrinity, 11 a. m. Mt. Coin- to rt, 330 p . m. _ F o u rth Sunday-A ppom attox Memorial. II . p  T  ,. , . r I ti. m. Wesley Lhspei, 330 p. m. Hermon. 8 U 0    Hh, Ui I Ills I p . m. I -------------------------------- I Mrs. T. M. Taylor Presbyterian---Rev. W. L. Bedinger,! fort neighborhood, is Pastor. j i  r , , l F iratS u n d ay JATSlkers Church, 11 A. ,  ek in L jU c llb lirg w Second S u n d a y - ou thouscCh., 11 A. M- I ,, , Everkreciy,at 3 1. M. In . 1 llOIlit 11!, i1 T L jjn SundayStonewall, 11 A. M. . I jhuirth SundayUnion, at ll a . M. la n d so n , o f L y iie lib n ij Appomattox fligh School. I -r- Milton Isbell l"}, "highlight": {"text": {"matched_tokens": ["Isbell", "l"], "snippet": "School. I -r- Milton <mark>Isbell</mark> <mark>l</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "l"], "snippet": "School. I -r- Milton <mark>Isbell</mark> <mark>l</mark>"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2318.64, 1383.17, 2492.37, 1696.08], "bbox_id": "890d9a8668", "file": "AppomattoxNewspapers_1905-1912a_0288.pdf", "page": 1, "text": "IN THR CLEURS-OFFICE OF TH E CIB- 1 cu lt Court of th e County of A ppom attox on th e 15th day of February, 1911. Lacy D elaney an d D. B. Delaney, h er bna b an d . . . . ................................... ........ riainim , against Irene Isbell, w idow of th e late Lawson tt- bell, in her own right and as. A dm inistra trix ol Lawson Isbell, deceased, K ate O, i btepheus aud Paul Stephens, her husband, Alm a Walker and Josiah W alker, h er hus band, W illie Isbell, Otella W illiams and I Jam es W illiams, her huabuna. Ju lia Tan ner an d Claud Tanner. P eter L. lsbeU, I A nnaG . Chilton and John Chilton, her I husband. John 8. Isbell and Sidney Isbell, I th e la st nam ed being an In fan t under th e I age of 21 years, .................. .......... Defendants. I T h e object of th is su it is to p artitio n the 1 tra c t of Id acres of land situated about one- I naif a m ile from A ppom attox I north thereof, ofWhlch the late Lawson Is- 1 bell dred seised and possessed, by sale o r I otherw ise, am ong th e widow I said Lawson iBbeli- according t  .  J v r e - I SDectlve rights, and to have a t th e proper I tim e a settlem ent of the accounts ana tra n  s i t i o n of the said Irene Isbell. A d m in ister I trix of Lawson Isbell, deceased. I And an affidavit having been w ad e an d I filed th a t the defendants, K ate C. tPhens, I Paul Stephens,Alma Walker, Jnlh W alker, I Willie Isbell, Otella Williams, Jam es WU- llto n s . P eter L. Isbell, Ju lia T anner and I Claud T anner are n o t I th e sta te of Virginia, it is ordered th a t they I do aonear here w ithin fifteen days a fter due I nnhllcaUoii hereof, and do w hat m ay ba I necessary to protect th eir in terest in th is , J s u it A red it is further ordered th a t a copy 1 I hereof be published once a week for fo u r I weeks in the T imrs -V irginian , a n ew spaper I I nnlillshed in the County of A ppom attox, i I and th a t a copy be posted a t tb e M n t I I of th e court house of this county on th e 20th K I dav of February, 1911, th a t being th e n e x t I succeeding rule day after this order was en- I Itered. a copy-Teste J. B. HOBSLBY, Clerk.  I B. L. F ergdsoh . p. q. 8-16-"}, "highlight": {"text": {"matched_tokens": ["L", "Isbell"], "snippet": "n s . P eter <mark>L</mark>. <mark>Isbell</mark>, Ju lia T anner"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Isbell"], "snippet": "n s . P eter <mark>L</mark>. <mark>Isbell</mark>, Ju lia T anner"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [652.8, 1220.58, 821.91, 1533.58], "bbox_id": "e2f8a98011", "file": "AppomattoxNewspapers_1905-1912a_0284.pdf", "page": 1, "text": "IN THK CLERKS OFFICE OF THE CIR I cult Court of the County of Appom attox on the 15th lay of February, lull. Laoy D elaney and D. B. D elaney, her hus band........................................................Plaintiffs, against . , Irene Isbell, w idow of the late Lawson Is- Dell, in her own riGflii anrl as A. am in i s tr a- irix of Lawson Isbell, tieceas d, Kate C. Stephens and Paul Stephens, her husband. Alm a w alker and Joslati W alker, her hus band, W illie Ishc-ll. Oteliu W illiam s and Jam es w illiam s, her husbnno. Julia Tan ner and Claud Tanner, P eter L. Isbell, Anna O. Chilton and Jhn Chilton, her i unhand, John 8. Isbell and Sidney Isbell, the last nam ed being an in fan t under the e of 21 years,... ................ .......... Defendants. _ je object of th is su it is to partition the tract of 16 acres of land situated about one- half a m ile from A ppom attox station and north thereof, of which the late Lawson Is- 11 died seized and possessed, by sale or vherwise, am ong the widow and heirs 01 said Lawson Isbell according to their re spective rights, and to have a t th e propel tim e a settlem en t of the accounts and Iran saction o f the said Irene Isbell. A dm inistra trix ot Luw son Isbell, deceased. And an affidavit h avin g been m ade and tiled that the defendants. K ate C. Stepne Paul Stephens,A lm a w alker, Jusiah Walker, Willie Isbell, Oteila W illiam s, Jam es Wil liam s, P eter L. Isbell, Ju lia Tanner and Claud T-annr are n o t r e s i d e n t s or the State of V irginia, it Is ordered th a t thej do appear here w ithin fifteen days after due publication hereof, and do w h at m ay .b e necosbary to protect their Interest ln th is1 suit? And it Is further entered th a t a copy hereof be published once a w eek for tour weeks in th e T tmbb -V ikginian , a new spaper published In the County o f A ppom attox, and th at a copy he posted a t th e fron t dooi of the court house of this county on th e JOth day o f February. 1911, th a t being the n ext succeeding rule day after th is order was en  tered. A copyTeste J. R. HORSLEY, Clerk. 8. L. F erg u so n , p. q. 2 15 14"}, "highlight": {"text": {"matched_tokens": ["L", "Isbell"], "snippet": "Claud Tanner, P eter <mark>L</mark>. <mark>Isbell</mark>, Anna O. Chilton and"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Isbell"], "snippet": "Claud Tanner, P eter <mark>L</mark>. <mark>Isbell</mark>, Anna O. Chilton and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [677.75, 1080.14, 990.4, 1227.56], "bbox_id": "2d2bc03a42", "file": "AppomattoxNewspapers_1922-1923a_0041.pdf", "page": 1, "text": "Howerton, A. P. . . Howerton, S. D., discharged for dis ability. Hancock, D. B. Isbell, F. M. Isbell, Amsey. Isbell, Milton. ------- ,  _ I Jones, Thos. W. they could have made the score j ones j. j. larger had Had Houae oontieued J , F. the game after the winnirg run jerkins, E. H. b  baa. mada. Tba fa . . . of this game were the danoie j 0jnerf Luther, doubtful, plays of Gallier and the work  Kelly, L. D. of Pulliam in left field. Watts"}, "highlight": {"text": {"matched_tokens": ["L", "D"], "snippet": "and the work  Kelly, <mark>L</mark>. <mark>D</mark>. of Pulliam in left"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D"], "snippet": "and the work  Kelly, <mark>L</mark>. <mark>D</mark>. of Pulliam in left"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1293.59, 436.94, 1613.25, 526.64], "bbox_id": "37b31aea5e", "file": "AppomattoxNewspapers_1905-1912a_0233.pdf", "page": 1, "text": ".... Toiiet Set, betw een C ourt  d f f l d o n F a r m . F in d w please .eave i- ill. Jim Isbell, colored, died at his I ___  termers I borne near .Oakvihe last Saturday T n TBDOne or mbre wortogtarmers  -1 Kttuo00- WANTBD-ner mor Buckingham I n  _ u e P8onjGs!NGITONllGG8, Lynch-1 8- jSg.vV - ------ 1 Mr. Sammie Williamson left list  w ú w  r í  rtoeí1n dta  ior Lynchbnrg. where he  prtperty of ail I wilt go into the floral business."}, "highlight": {"text": {"matched_tokens": ["l", "d"], "snippet": "ourt  d f f <mark>l</mark> <mark>d</mark> o n F a"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "d"], "snippet": "ourt  d f f <mark>l</mark> <mark>d</mark> o n F a"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1629.3, 1519.04, 1821.11, 1661.34], "bbox_id": "141732edc3", "file": "AppomattoxNewspapers_1922-1923a_0618.pdf", "page": 1, "text": "Miss Anna Isbell died a t t h e home of her brothers near S t a p l e ton in this county Shinday. S h ? was a member of T rinity c h u r c h and was greatlv esteemed by a w i d e circle of friends. Miss Isb e ll  a s 75 years of age, and is s u r v i v e d b v two sisters, Misses N annie a n d Laura Isbell, and by three b r o t h e r s , Mr. David Isbell, of L y n ch b u rg a n d Messrs. William, Robert and M i l t o n Isbell, of this county."}, "highlight": {"text": {"matched_tokens": ["d", "Isbell"], "snippet": "N annie a n <mark>d</mark> Laura <mark>Isbell</mark>, and by three b"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "Isbell"], "snippet": "N annie a n <mark>d</mark> Laura <mark>Isbell</mark>, and by three b"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [610.53, 572.66, 768.96, 1808.57], "bbox_id": "18f078c1bc", "file": "AppomattoxNewspapers_1954-1955a_0095.pdf", "page": 1, "text": "Hughes, Mrs. Frances Isbell, Donald Irvin, Mrs. Ethel S. Irvin, Willard A. Jennings, Mrs. Mary N. Jennings, Alma V. Jones, Geo. L. Johnson, D. B. Jennings, Minnie May Johnson, Mrs. V. L. Johnson, James H. Johnson, Eppes . Johnson, Annie Cardwell King, Floyd R. King, E. Z. King, T. A. King, Jackson F. Lee, Mrs. Anna L. Laughon, Theodore Laughon, J. D. Laughon, K. O. Laughon, R. S. Laughon, Landis L. Moore, R. L. Moore, F. E. Moore, J. I. Moore, Miss Alva Moore, Miss Lois  Moore, Miss Elizabeth Martin, Tom H. Martin, T. M. Martin, Ural McHargue, J. C. Mays, B. W. Mays, R. L. Marshall, Wm. B. Mayberry, Newton D. Mayberry, W. W. McCormick, Lewis Jr. Mayberry, J. H. Neighbors, J. W. Jr. Patterson, IS. H. Perdue, Geo. E. Powell, Mrs. Lillie Perdieu, E. A. Perdieu, E. Mott Powell, N. D. Pankey, Leslie I. Routon, R. H. Rosser, Geo. W. Rogers, John H. Routon, Mrs. Delilah F. Roberts, Eugene C. Routon, Mrs. L. A. Robertson, D. T. Stratton, E. M. Stratton, J. A. Stratton, Mrs. Bessie L. Stratton, Miss Delia Spencer, R. S. Stern, W. H. Simmons, J. W. Simmons, Mrs. Frances B. Stratton, Miss Elva Stanley, Kemper W. Stanley, Mrs. Lettie H. Scruggs, Mrs. Rosa B. Smith, S. P. Smith, H. A. Stratton, W. R. Shirey, Louise B. Shirey, Betty Shirey, H. W. Shirey, R. P. Shirey, Mrs. Edythe H. Shirey, Mrs. Marie S. Spain, C. E. Smith, E. F. Smith, Mabel E. Stratton, Margaret B. Smith, Guy E. Smith, Harvey A. Jr. Turnes, T. E. Thornhill, R. H. Tanner, Mattie J. Tanner, Sue B. Tanner, Etna P. Tyree, R. M. Tyree, Mrs. Lily B. Tyree, H. S. Tinnell, F. A. Tinnell, Sidney Tinnell, G. W. Thompson, T. J. Turnes, Nellie Moore Thomas, Faye S. Tweedy, Robert W.  Thornhill, Martha Watkins Trent, C. F. Taylor, Hazel Ann Weakley, R. A. Thomas, Dan T. Thomas, Mrs. Pauline Wharton Wright, T. H. Wright, J. E. Whitehead, J. B. Woodson, C. N. Whitten, J. T. Whitten, F. D. Wharton, Mrs. F. L. Wharton, Dick Wooten, E. P. Wright, Mrs. Susie Wright, W. Harlow Wheeler, Ben D. Wheeler, Robert Irby Wheeler, Max L. Wilkerson, Hubert L. Colored Abbitt, Joe M. Ferguson, J. P. Ferguson, Hudson Ferguson, W. J. Hix, Leman ,c"}, "highlight": {"text": {"matched_tokens": ["L", "D"], "snippet": "Alma V. Jones, Geo. <mark>L</mark>. Johnson, <mark>D</mark>. B. Jennings, Minnie May"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D"], "snippet": "Alma V. Jones, Geo. <mark>L</mark>. Johnson, <mark>D</mark>. B. Jennings, Minnie May"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [718.05, 1102.43, 872.9, 1181.2], "bbox_id": "d9f7439026", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "STONEWALL PRECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, T. W. Tuggle, W. D. Saudidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. S. Thorn hill, T. A.. Drinkard, Milton Isbell, VV. S. Taylor, itr. J. B. Abbitt."}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "W. D. Saudidge, J. <mark>D</mark>. Martin, P. <mark>L</mark>. Stratton, C. M. Stratton,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "W. D. Saudidge, J. <mark>D</mark>. Martin, P. <mark>L</mark>. Stratton, C. M. Stratton,"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2160.94, 1209.6, 2327.74, 1827.11], "bbox_id": "2531268dc4", "file": "AppomattoxNewspapers_1922-1923a_0249.pdf", "page": 1, "text": "S tapleton. 1 must be like some of your corre spondents from other sections. They write so seldom I feel their excuse must be similar to mine. They just put off writing so they may find something good enough for your paper. But like myself they must make the attempt even if some of our letters are less interesting than others. Mrs. Eldridge Martin and daugh ter Ersie are visiting her brother, Mr. Charles Grow, of Wtldway. Be fore her return home she expects to visit friends at West Appomattox and her brother, V. B. Grow, of ynchburg. Mr. Milton Isbell is treating bis residence to a new coat of paint, which will add very much to its already attractive appearance. Mrs. John Burge is visiting her daughter. Mrs. Masou, of Clifton orge. We think Mr. John Whitehead should wear the blue ribbon. Last Saturday be was fortunate enough o l a n d a German carp which weighed 26i lbs. Just before that he hooked another and had his hands on it, one hand in its mouth and one in its gills, and then it contrived to slip back into the water. I should think he must have been reminded that a bird in the hand was worth two in the bush. On Friday a small colored boy caught a German that weighed 10 lbs. Miss Annie Martin, who has been suffering very much for the past two weeks with a rising jaw, is better. Miss Pearl Grow, who spent sev eral weeks in the Wildway neigh borhood, returned home Saturday evening, accompanied by her broth er, Mr. Chas. Grow and wife, and Mr. Thomas Megginson. Mrs. W. S. Taylor and little Sears"}, "highlight": {"text": {"matched_tokens": ["l", "d"], "snippet": "was fortunate enough o <mark>l</mark> a n <mark>d</mark> a German carp which"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "d"], "snippet": "was fortunate enough o <mark>l</mark> a n <mark>d</mark> a German carp which"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [739.91, 1572.38, 897.46, 2008.5], "bbox_id": "97f4fa7344", "file": "AppomattoxNewspapers_1898-1902a_0383.pdf", "page": 1, "text": "HIXBURG PRECINCT. W. H. Ligon, chairman J. W. Wright, J. F. Lee, E. P. Sears, F. W. Coleman, Joel Watkins, F. B. Forbes, W. B. Ford, B. W. Bristow, A. A. Baldwin, Jno. W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, Thomas Dickerson. CLOVER HILL PRECINCT. .W. J. Trent, Chairman, E. E. Chism, D. P. Ferguson, H. C. Fer guson, A. B. Franklm, M. E. Agee, E. H. Lucado, J. W. Flood, J. W. Cawthorn, Jr., B. A. OBrien, C. M. Drinkard.. J. B. Hamilton, H. B. Pitmau, E. B. Abbitt, P. J. Shep- perd. AGEE PRECINCT, A. B. Thornhill, Chairman, T. J. Gooding, N. B. Featherstone, 8 . P. Taylor, W. D. Woodson, A. E. Milt- imore, J. H. Wood, C. A. Horsley, T. J. Megginson, D. M. Anderson, J. B. Childress, M. F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Cole man. OAKVILLE PRECINCT W. C. Abbitt, Chairman, T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Field Smith. C. H. Coleman, C. E. Carson, T. M, Tay lor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, B. T, Moss, J. D. Haiftersley. STONEWALL PRECINCT. S. C. Stratton, Chairman, M. W. Carson, J. C. Shearer,.S. E. Ander, son, T. C. Stratton, T. W. Tnggle, W. D. Sandidge, J. D. Martin, P. L. Stratton, C. M. Stratton, J. 8 , Thornhill, T. A. Driukartl, MtlUj Isbell, W. 8 . Taylor."}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "W. D. Sandidge, J. <mark>D</mark>. Martin, P. <mark>L</mark>. Stratton, C. M. Stratton,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "W. D. Sandidge, J. <mark>D</mark>. Martin, P. <mark>L</mark>. Stratton, C. M. Stratton,"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [856.79, 319.17, 1020.45, 691.06], "bbox_id": "8c9796de10", "file": "AppomattoxNewspapers_1922-1923a_0015.pdf", "page": 1, "text": "follow ing child ren  Mrs. I. R Scruggs, Mrs. Allen H. C hick, Van O D rinkard, Miss M. Lucy D rinkard, T aylor S. D rinkard, Jo h n B. D rin k ard , and Miss L au ra V. D rio k ard , all of L ynchburg. S urviving siste rt and brothers are Mrs Laura 1 Isbell, W ashington, and Miss Dela S tratto n and E M , 0 M , J. A . and H H. S tratto n , Ap pom attox county. F uneral services w ere con ducted by Rev. D r. P ow hatan W. Jam es from Hebron B aptist church Sunday, lhe p allb ear ers w ere Olay ton D rinkard, Bert S tratto n , E arl D rinkard, H arry Isbell, C laud D rinkard and Robert S tratto n , all ne phew s of the deceased. The fiow erbearers were Mrs. Clay ton D rinkard, Miss Sue Taylor, Miss M argaret K ent, Mrs H b, Jennings, Misses Isa and F an  nie LoG rand, E lv a and Ruth StrattOD, Mrs. Irvin Chick,M iss Dorothy Isbell, Mrs. H enry R outon, Mrs. Clarence Price, Misses Rosalie and Thelm a D rinkard, A nna LeGrand and Mrs. Corbin S tratton."}, "highlight": {"text": {"matched_tokens": ["Isbell", "D"], "snippet": "D rinkard, H arry <mark>Isbell</mark>, C laud <mark>D</mark> rinkard and Robert S"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "D"], "snippet": "D rinkard, H arry <mark>Isbell</mark>, C laud <mark>D</mark> rinkard and Robert S"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [460.1, 589.22, 620.14, 1732.51], "bbox_id": "3a986625a3", "file": "AppomattoxNewspapers_1915-1918a_0583.pdf", "page": 1, "text": "262 Benjamin Ather Mann, Evergreen 263 Havilah Babcock, Appo mattox 264 Joseph McElroy Leps,Ap pomattox 265 Ernist Gills Johnson, Ap pomattox 266 Harrington Stanley, Ap pomattox r t d 4 267 Beverley Flouny Cole man, Appomattox 268 Washington Hoe Stanley, Appomattox 269 Thomas Willie L o y d Johns, Appomattox 270 Willie W right, Appomat tox r f d 3 271 Joseph Ottay OBrien, Appomattox 272 Howard Blanton Mar shall, Appomattox 273 Leslie Flintroy Oallaham, Appomattox 274 Earl Holmes Patterson, Appomattox 275 John Wesley Martin, Ap pomattox 276 Aroher Alexander Le- Grand, Evergreen 277 George Robert Collins, Bpont Spring 278 Alexander W ashington Jones, Spout Spring 279 Harvey John Wentworth, Appomattox 280 James McFadden, Spout Spring 281 Bennett Chapman Simms. Appomattox 282 Clement Archer Han cock, Appomattox 283 Braxton LeGrand Han oock, Appomattox 284 William David Robert son, Spout Spring 285 William Edward Dicker- son, Spont Spring 286 Taylor Vermont Godsey, Appomattox 287 John Sam Martin, Appo mattox 288 William Benjamin Cald well, Appomattox 289 Willie Thomas Wells, Ap pomattox 290 Doctor Julian Franklin, Appomattox 291 Guy Eldridge Rice, Ap pomattox 292 Elliott Roland Jones, 8pout Spring 293 William Mayberry, Appo mattox 294 Frank Orman Jones, Spout Spring .295 Richard Appomattox 296 James Daniel Spout Spring 297 Luther Jackson Morris, Appomattox 298 Fred Isbell, Appomattox 299 Andrew Jackson Martin, Appomattox 300 James Dillard Morris, Ap pomattox 301 Thomas Walker Moses, Appomattox 302 Wiley Win ton Osborn, Appomattox 303 Lee Watson, Appomattox 304 William Saunders, Appo mattox 805 John Willie Godsey, Ap pomattox 306 Tas Statham, Appomatox 307 William Hunter, Vera 308 James Henry Smith,Bent Greek 309 Wilbon Fistol Wooldrige, Appomattox 310 Waverly Thomas Foster, Pamplin 311 James Raymond Wili ams, Appomattox 312 Hector Phelps Caw thorn,"}, "highlight": {"text": {"matched_tokens": ["L", "d"], "snippet": "Appomattox 269 Thomas Willie <mark>L</mark> o y <mark>d</mark> Johns, Appomattox 270 Willie"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "d"], "snippet": "Appomattox 269 Thomas Willie <mark>L</mark> o y <mark>d</mark> Johns, Appomattox 270 Willie"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [783.08, 393.96, 1098.14, 1143.82], "bbox_id": "f6ae5b0652", "file": "AppomattoxNewspapers_1918-1922a_0191.pdf", "page": 1, "text": "100 Reward, 100 The readers of this paper wUl be pleased to learn that there Is at laast one dreaded. disease that science has been able to cure in all its states and that la catarrh. Catarrh being greatly influenced by censtitutlonal conditions requires constitutional treatment. Halls Catarrh Medicine is taken internally and sets thru the Blood on the Mucous Sur faces of the System thereby destroying Xfi T a i I the foundation of the disease, giving the Messrs, iii. I . i rice, o . d . p e l t s patient strength by building up the con stitution and assisting nature in doing its work. The proprietors have so much faith in the curative power of Halls Catarrh Medicine that they offer One Hundred Dollars for any case that it faHs te cure. Send for list of testimonials. Address F. J. GHENET tb CO., Toledo, Ohio. Sold by all Druggists, 15c. Our shipment of paper failed to arrive on time this week, consequently we are a little late in issuing our paper. Mrs. Thos. Hancock and daughter, Mrs. G. V. Campbell, are visiting Royal Hancock, in Norfolk. Messrs. R. F. and R. L. Burke and wife and son motored to Walkers Ford and spent the fifth with Col. Joe Buttons people. Mrs. R. E. Caldwell, Jr, ran her new car into a concrete bridge at the corner on church St. last week here and damag ed it considerably. On the 5th the harness races at the Appomattox Fair grounds were poorly attended. Pau line, the fast trotter of Mr. E M. Drink ard, was the favorite in every heat. This evening a serious acci dent was narrowly averted at the very dangerous corner in our streets at McKinneys stable. A car driven by a colored boy who drives for Mr Milton Isbell collided with a car of Mr. Harrv Johnsons on the corner. Both cars were considerably damaged Just whose fault it was has not been established. Fortunate drivers who escaped without injury. Little nine year-old Neil Har vey, sod of Mr. R C. Harvey, died at his home near hete Fn day of blood poison. His re mains were interred Saturday at Liberty cemetery. The lit tie fellow was apparently in good health up to the time of his death, though was suffer ing some from a slight wpand on his foot. His death was sud den and quite a shock to his parents."}, "highlight": {"text": {"matched_tokens": ["d", "l"], "snippet": "I . i rice, o . <mark>d</mark> . p e <mark>l</mark> t s patient strength"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "l"], "snippet": "I . i rice, o . <mark>d</mark> . p e <mark>l</mark> t s patient strength"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [220.59, 1126.79, 380.18, 1616.68], "bbox_id": "0f9298c854", "file": "AppomattoxNewspapers_1898-1902a_0134.pdf", "page": 1, "text": "vote.1 l reg istered on a paper to be contain the name of a voter in inn, and the names of the officers to- r at the head of separate columns and  the name of each candidate voted for kil shiilJ be made to indicate the per- oted for, for each office. That three s shall be selected for each voting place, hall keep the list of votes, and count LTtiiy the result, and seal and send the to the courthouse, where the whole be opened and counted by the Executive nitittee and the result declared by them  ami the candidate for each office securing the highest number of votes at said prim ary shall be declared to be the Democratic candidate fur said office to be voted for at the general election. The papers or polls to be prepared by the Executive Committee for the several candidate who des res to do so shall lie perm itted to have a representa tive at each precinct to look after his interest but no questions shad be propounded to voters as to their intentions this action to be taken us his declaration to vote the ticket, unless his vote shall be challenged, when, after the explanation of the voter, the judges shall de tenninc as to his right to vote. The records of the votes to be headed,  We the white Democratic voters of Appomattox county v. ho participate in the primary elec tion to be held April 29th, 1899, agree, by our action to support the ticket nominated by said primary. The following judges were recommended to be appointed for the various voting places, viz Court HouseC. N. Abbitt, J. B. Abbittand J. P. L. Flesliman. hap M. P, Lee, E. G. Harvey and J. T. Moses. CheatwoodA. H Howerton, Saml W. Cheatham and A. A. Sweeney. Clover HillRo. A. OBrien, E. E. Chism and W. p Gills. W alkers ChurchTh s. Marshall, E. P. Sear and Ii. N. Ligon. Pampliim-J.- Wv. Clark, W. T. Johnson and J. P. Thornton. StonewallM. W. Carson, H. D. LeGrand. and Milton Isbell. OakvilleW. C. Abbitt, N. W. Owen, and R. D. Hughes. Megginsons MillM. F. Kyle, O. E. Lewis, and A. B. Thornhill. The expenses of the primary are to be paid by the candidates t least by next court, Feb ruary 9th, each candidate paying his propor tion thereof to S. L. Ferguson, chairman."}, "highlight": {"text": {"matched_tokens": ["D", "Isbell"], "snippet": "StonewallM. W. Carson, H. <mark>D</mark>. LeGrand. and Milton <mark>Isbell</mark>. OakvilleW. C. Abbitt, N."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Isbell"], "snippet": "StonewallM. W. Carson, H. <mark>D</mark>. LeGrand. and Milton <mark>Isbell</mark>. OakvilleW. C. Abbitt, N."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2286.96, 1033.09, 2460.92, 1210.63], "bbox_id": "f749008b2d", "file": "AppomattoxNewspapers_1943-1947a_0210.pdf", "page": 1, "text": "N. R. Feather.tcn announced this week that pictures at- former com monwealth attorneys would be pre sented to the county at exercizes beginning at 12 oclock, June 1st., in the commonwealth attorneys office at the court no use. County Clerk C. W. Smith will preside and N. R. Featherston will present the pictures, which will be accepted for the county by W. M. Abbitt. Pictures to -be pres anted include those ol Thos. S. Boeock, Lewis Daniel Isbell, Crawford Jones, Ed win R. Woodson, Thos. J. Thorn hill, David A. Carif-tiu-v W. Court ney Franklin, Hal D Flood, Sam uel L. Ferguson ana Joel W.Flood."}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "Court ney Franklin, Hal <mark>D</mark> Flood, Sam uel <mark>L</mark>. Ferguson ana Joel W.Flood."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "Court ney Franklin, Hal <mark>D</mark> Flood, Sam uel <mark>L</mark>. Ferguson ana Joel W.Flood."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2335.69, 1396.2, 2504.0, 1489.94], "bbox_id": "7ebb8e0572", "file": "AppomattoxNewspapers_1905-1912a_0298.pdf", "page": 1, "text": "I  v THI5 CLERKS OFFICE OF THE .CIH  Ncun Courtotthe County of Appomattox 1 on the lBttiday of February. Mil. Lacy Delaney and D. B. M to lW M g  I baud . . ................................. I . . nixirinw nf the late Lawson la- I owu rlgUt and as Aamlntotrg- l trlv of Lawson Isbell, deceased, Kate C. I and Paul Stephens, her husband, I AriSft walker audJoslah Walker, her hue- I bind, T m ie lsbeU, Otella Wllliams and_ I James Williams, her imsbano. Julia Tj K n  r j o K n f h i t o"}, "highlight": {"text": {"matched_tokens": ["l", "Isbell"], "snippet": "rlgUt and as Aamlntotrg- <mark>l</mark> trlv of Lawson <mark>Isbell</mark>, deceased, Kate C. I"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "Isbell"], "snippet": "rlgUt and as Aamlntotrg- <mark>l</mark> trlv of Lawson <mark>Isbell</mark>, deceased, Kate C. I"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [747.61, 929.23, 928.78, 1234.55], "bbox_id": "04d491f436", "file": "AppomattoxNewspapers_1918-1922a_0080.pdf", "page": 1, "text": "B P Sears ............................. ....................  300 J T H lx ......................................................... 2 00 Rocks Preo.W T Johnson .............. . 3 00 6 H Ransom .............................. . ........... g 00 E E Chism ................................................... 2 50 W c G arrett ....................... r. ..................... 2 09 G T M arsh ............ ................................... 2 00 Old C. H. Prec,F A Obrien ............... 3 00 D A C onner ............................ 210 L E Morris ............................................ 4 30 S A Ferguson............................................. .. 2 60 R H Browning ................... ................ . g 00 Agee Prec.J W Davidson .................. 5 00 R A Anderson............................................. 2 00 F 8 Thornhill............................... . ............ . g 00 R E Megginson................... ......... .............. 2 00 O W T hornhill.................... ........ ................ 2 00 Oakville P re c .-J C Davidson ............. .. 4 80 J f C M artin..................... ...................... .. 2 00 C B Carson ........ . .............................  ......... g m J B Taylor..................................... . ........ .. g 00 Stonewall Preo.T B Carson ............... 7 60 J P Alvls....................................................... g go G B Drinkard..................... ................... .... g no w T Caldwell ..................... ....................... g 00 Cnmrs other than above- Milton Isbell................. .. . ....... ... ............. . 2 00 F  H annah ................. ............................... g 00 W H Ligon .................................................. 5 20 g i_  .... .................................   R F Burke................................................ ia 48 C W s m ith ................................................... 9 65 W. U. Ligon and L. E. Smith, collars, of thia Board to go be fore the Buckingham Board and lay before it the proposition of a joint poor house for Appo mattox and adjoining counties, reported that they went before the Buckingham Board on the 4th day of Aug. and that the Buckingham Board seemed ery much interested in the"}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "A Obrien ............... 3 00 <mark>D</mark> A C onner ............................ 210 <mark>L</mark> E Morris ............................................ 4 30"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "A Obrien ............... 3 00 <mark>D</mark> A C onner ............................ 210 <mark>L</mark> E Morris ............................................ 4 30"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [802.32, 563.52, 959.17, 1275.27], "bbox_id": "1eb4d3c22e", "file": "AppomattoxNewspapers_1898-1902a_0580.pdf", "page": 1, "text": "CHEATWOOD PEECINCT. B. N. Tanner, chairman A. H. Howerton. J. W. Powell, C. F. Rob ertson, W. D. Doss, T. H. A. Cheat ham, C. A. Cardwell, L. T. Morris, Robert B. Poore, Hansford Card- well, W. G. Coleman, W. F. Johnson, J. D. Cheatham, A. C. Cheatham, Samuel Cheatham. CHAP PEECINCT. S. J. Lee, chai.inau S. G. Harvey, C. H. Godsey, W. H. Childress, C. H. Lee, J. C. Martin, J. T. Cawthorn, W. H. Lewis, R. W. Fleshman, E. C. Marshall, 0. S. Cawthorn, J. Baxter Marshall, W. P. Godsey, J. C. Wol- ridge, J. L. Woodson. PAMPLIN PEECINCT. J. W. Clark, chairmau, L. W. Thornton, P. M. Hannah, R. D. Baldwin, Geo. F. Farrar, John H. Davis, Dr. C. S. Morton, Dr. E. E. Walker, J. A. Oaks, L. W. Gilliam, R. li. Davis, E. F. Glover, E. F.Wil Hams, W. A. Womack, Jno. Warner. OAKVILLE PEECINCT. W. C. Abbitt, chairman T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Fields Smith, C. II. Coleman, C. E. Carsou, T. M. Taylor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, R. T. Moss, T. W. Trent. HIXBUEG PEECINCT. W. H. Ligon, chairman K. M. Garrett, C. B. Gilliam, E. P. Sears. P. W. Coleman, Joel Watkins, W. B. Forbes, W. B. Ford, R. W. Bristow, A. A. Baldwin, John W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, T. E. Paulette. CLOVEB HILL PEECINCT. W. P. Gills, chairman E. E. Chism, D. P. Ferguson, H. C. Ferguson, A. B Franklin, M. E. Agee, E. H.-Luc- ado, J. W. Flood, J. W. Tweedy, R A. OBrien, C. M. Drinkard, J. R. Hamilton, H. R. Pitman, E. R. Ab bitt, P. J. Sheppaid, R. H. Brown ing, II. C. Babcock, W. F. Wright, J. W. Wright. STONEWALL PEECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, 1. W. Tuggle, W. D. Sandidge, J. I. Martin, P. L Stratton, C. M. Stratton, J. S. Thorn hill, T. A. Drinkard, Milton Isbell, W. S. Taylor, Ur. J, B. Abbitt. AGEE PEECINCT. A. B. Thornhill, chairman T. J. Gooding. N. R. Featherston, S. P. Taylor, W. D. Woodson, A. E. Mil- timore, J. H. Wood, J. D. Hamers- ley, T, J. Megginson, D. M. Ander son. J. D. Childress, M, F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Coleman."}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "1. W. Tuggle, W. <mark>D</mark>. Sandidge, J. I. Martin, P. <mark>L</mark> Stratton, C. M. Stratton,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "1. W. Tuggle, W. <mark>D</mark>. Sandidge, J. I. Martin, P. <mark>L</mark> Stratton, C. M. Stratton,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [355.7, 944.9, 682.9, 2013.26], "bbox_id": "e39a44cec5", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "a boys feelings. Going back to the old faipiljes, 1 recall the Adams familythe indus trious father and good Christian mother of Duval, Holcombe and Dick, and of Mrs. John W. Carroll, Mrs. Adams was a sister of the late Governor Duval of Florida, who pent much of the latier part of his d Miss Jennie was terribly afraid  jjfg aj. ber home near the old Court-  ! lightning. She occupied a short j douge writing a history of. Florida, sura with Isbell. At a loud clap of l djed before completing it, Some thunder and a vivid flash of lightn-, y6ars ag 0 j wrote a little piece about Dig, she involuntarily sprang nearer Lj,js most remarkable aud adventur- tu Isbell, wheu with his character -1 uj 0 jd governor, which the News i t ic humor he said, Set up close!  stick close to me, Miss Jennie,! Im the best lightning rod you! ever saw. Isbell went West and! I do not know if he is living  if so he is it is ou  borrowed i time, long past his three score and j leu. How well 1 recall his paro dies. One lie often repeated to the j girie- The girls are all deceitful show For mans deception given, Their s-iniles of joy and tears of woe. Deceitful shine, deceitful flow, Tljeie aint one true in Teven. BUCK TRENTS ANSWER. What would Appomattox be with out Buck Trent? Genial, jolly, fat Duck Trent. i liaye already alluded to the bos pitalityof Major West and his in- aristocratic tace terrestiug family, yet 1 must recur to it aguiu. 1 am debtor for some oi the happiest hours of my life to those good people. They hau then four grown daughters,, aud with liieLr numerous pretty cousiuE who visited the place, twas of course the reso t of we youug meu. It was approached by two roads meeting at right angles at the horse rack. How ofteu as Jim Robertson and myself would strike the clearing on one road, would we see Dauiel Isbell, Buck Trent and Crawford Jones approacuing on the other, when we would all dismount in a group at the gate.. On one occasion Christmas night the Major gave an oyster supper. Among the guests were the old people of the neighborhood m the private part of the mansion and enough of us younger ones to nearly fill the parlor. As the wee sma hours of the night approached, the older people came into the parlor as they dotted their wraps for the night ride home. For a moment there was a scarcity of seats, and while the small butler, Archer was bring ing in chairs, the old Major thought to fill in the time with a little trick for the boys. His plan was to place a lighted candle on the table, blind fold a boy, make him turn three times and approach the candle to blow it out. Bob West was a very bashful boy. He had a hen-house and was fond of chickens, and had been after his father fora few pul lets he had bought for the table. To induce him to try the candle the Major said, Come, Bob, if you will blow it out 111 give you two of my pullets. Buck Trent, who had 1 . ig had a weakness for one of the Majors pretty daughters, jumped up, and with that brass that only Buck could show, said, Major, if youll just give me one of your pul- lets Ill blow it out. Of course the room roared, and the Major had to give attention to Archer and the chairs. A little northwest of the Court house lived Dr. Palmer, au educated, refined, accomplished old Virginian gentleman. Like Doc Sifeis, he tramped tnose roads and forded those streamsor swum umfor two generations. I cau remember when he kept three horsfts, aud kept them all busy, too. He must have bad an iron constitution. His practice em braced Appomattox, a portion of Campbell and Buckingham and of ten over into Amherst. Who can tell the joy of the grieved mother and anxious father as they watched the fevered brow of u loved child, to see the Dr. ride up .on old Lion"}, "highlight": {"text": {"matched_tokens": ["Isbell", "l"], "snippet": "of. Florida, sura with <mark>Isbell</mark>. At a loud clap of <mark>l</mark> djed before completing it,"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "l"], "snippet": "of. Florida, sura with <mark>Isbell</mark>. At a loud clap of <mark>l</mark> djed before completing it,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.09, 916.91, 1826.99, 1693.66], "bbox_id": "bb8a18e0a0", "file": "AppomattoxNewspapers_1892-1898a_0071.pdf", "page": 1, "text": ", Dem ocratic Mass-Meeting. A t the mass-meeting of the County Democracy,the 11 delegates,to which number the county is entitled were instructed for Tyler and Blackstone. They were as follows Sputh Side DistrictJ. C. Jones, S. P. Coleman, J. H. Abbitt. Cloven Hill DistrictS. D. Sears, W. H. Ligon, W. D. Thornton, Jos. Button. Stonewall DistrictMilton Isbell, Dr. A. A. Rice. At LargeH. D. Flood and D. A. Christian. The following resolutions were then unanimously adopted Resolved, That recognizing the ability of Hon. Jno. W. G. Black- stone, of Accomac, and his eminent fitness for the position of Attorney General, and the fact that the large portion of the State east of Rich mond should have recognition of the Democratic State ticket, we, the Democratic party, in mass meeting assembled, do hereby request our delegates to support Mr. Blackstone as long as his name is before the convention. Resolved, That we instruct our delegates to the State Democratic Convention, which meets in Rich mond the 17th of August, 1893, to endeavor to have incorporated in the Democratic platform a plank to pro hibit any trust from doing business in the State. When these proceedings were com pleted some of the members present endeavored to have, without consid eration, delegates appointed to the Rustburg convention, bat on motion of Senator Flood, the meeting ad journed at 1 oclock. At 2 oclock the mass meeting re assembled to disenss the advisability of electing delegates to the said con vention, and the decision being fa vorable the following delegates were selected At LargeW. J. Trent and W. D. Thornton. StoneWall DistrictJudge D. A. Christian and Jos. Button. Clover Hill DistrictJoel Wat kins and Dr. Jno. M. Hamlett. South Side DistrictS. L. Fergu son and J. J. Durrum. It was then moved and carried, that these delegates appoint alter nates and that any part of the dele gation be authorized to cast the whole vote. The motion for adjournment then"}, "highlight": {"text": {"matched_tokens": ["D", "Isbell"], "snippet": "W. H. Ligon, W. <mark>D</mark>. Thornton, Jos. Button. Stonewall DistrictMilton <mark>Isbell</mark>, Dr. A. A. Rice."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Isbell"], "snippet": "W. H. Ligon, W. <mark>D</mark>. Thornton, Jos. Button. Stonewall DistrictMilton <mark>Isbell</mark>, Dr. A. A. Rice."}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1768.1, 630.97, 1931.39, 1749.55], "bbox_id": "448885dc7c", "file": "AppomattoxNewspapers_1926-1933a_0538.pdf", "page": 1, "text": "newall Some farmers are busy threshing wheat this week. A big crop made thru this section, only 50 cents per bushel- What will become of the poor farmers? We have nice rains every few days and corn and tobacco are looking fine. Veg etables are plentiful. Miss Virginia Carson of Ap pomattox visited Miss Ethel Al- vis for the week-end. John Alvis, Jr., of Blacks burg, was home for the week end. Miss Elsie Lowry Christian, of Covington is spending some time with her grandmother, Mrs. C. E- Carson. Mr. and Mrs. Keeling Sissin and children of Richmond, were guests of Mr. and Mrs. Parks Jennings last week, hav ing been called here by the death of Judge Christian. Mr. and Mrs. Frank C. Drinkard a n d Frances, spent the week with Mrs- Drinkards mother, Mrs. W. H. Drinkard, and attended the Drinkard and Chick reunion Sunday at Mr. A. F. Drinkards. Elkton Hamilton of Chicago, is the guest of his parents, Mr. and Mrs. B. H- Hamilton- Supervisor S. E. Anderson and family and Mr. O. R. Turnes and family returned Wednesday from a trip to Nor folk, Va. Beach and other cities. Mrs- Alice Jacobs and little daughters, Bettie and Dot, John Howard Elder, Jr-, a n d Mary Cornelia Elder, of Rich mond, are spending this week with Mrs. C. M. Stratton, Jr. Tilden Lee, of Ohio is visit ing his mother, Mrs. Anna Lee- Miss Elva Stratton, of Uni versity of Va-, is expected home for the week-end. The revival begins at Tririi- ty Ghurch 4th Sunday, conduct ed by the pastor, Mr. Lewis. Mrs. J. P. Alvis, Miss -Annie Alvis and Miss Lizzie Rice are on a motor trip to West Vir ginia and. Tennessee. Miss Sue Taylor a n d Mrs. Elizabeth Snavely, of Lynch burg visited Mrs- Parks Jen nings last Sunday. Quite a number of friends and relatives of Lynchburg and other places visited in this home and attend ed the funeral of Judge Chris tian- Mr. O. R. Turnes has a new Chevrolet. ------------ o- ----------- Honorary Pall Bearers The following were named honorary pallbearers for th e late Judge D. A. Christian, the first 14 being confederate com rades of the deceased R. E. Caldwell, C. H. Cole man, D- P. Ferguson, C. C. Ferguson, J. W. Perdue, Appo mattox G. W. Cheatham, Spout Spring, R. H. Thornhill, Spout Spring, Milton Isbell, Lynchburg, J. B. Nowlin, Lynchburg, S. T- Marsh, Oak ville, J- F. Connelly, Pamplin, S. M. Ranson, Pamplin, C. E. Cardwell, Concord Depot, J. C. Whitaker, Crewe. George Diuguid, Lynchburg, B- P. Thornhill, Lynchburg, Robert Thornhill, Lynchburg, Dr. W. B. Thornhill, Lynch burg, George M. Tarry, Rich mond, Dr. Paul Redd, Rich mond, Dr. Manfred Call, Rich mond, A. R, Harwood, Appo mattox, Col. Joel Flood, Appo mattox, Hon. S- L. Ferguson. ------------ o ------------ Memorial Methodist Church G. D. Coffey, Minister. Sabbath School9 30 A. M. Morning service1030 A. M."}, "highlight": {"text": {"matched_tokens": ["L", "D"], "snippet": "Appo mattox, Hon. S- <mark>L</mark>. Ferguson. ------------ o ------------ Memorial Methodist Church G. <mark>D</mark>. Coffey, Minister. Sabbath School9"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D"], "snippet": "Appo mattox, Hon. S- <mark>L</mark>. Ferguson. ------------ o ------------ Memorial Methodist Church G. <mark>D</mark>. Coffey, Minister. Sabbath School9"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [530.65, 1727.32, 690.8, 1773.57], "bbox_id": "a199891497", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "J. S . T h o r n h i l l , C a p t a i n . W H H Walker, J W Wilkerson, W D Sandidge, S E Anderson, Mil- ton Isbell, W S Taylor, W B Taylor,"}, "highlight": {"text": {"matched_tokens": ["D", "Isbell"], "snippet": "J W Wilkerson, W <mark>D</mark> Sandidge, S E Anderson, Mil- ton <mark>Isbell</mark>, W S Taylor, W"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Isbell"], "snippet": "J W Wilkerson, W <mark>D</mark> Sandidge, S E Anderson, Mil- ton <mark>Isbell</mark>, W S Taylor, W"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1788.7, 827.01, 1946.94, 990.45], "bbox_id": "0ce3c08568", "file": "AppomattoxNewspapers_1918-1922a_0003.pdf", "page": 1, "text": "W C Garrett, oik ..... . . O T Marsh, clerk ....... Old Courthouae F A OBrien, jud ge.... ....... ... goo L E Morris, judge, rec Sc ret... ........ . 4  D A Conner, judge.... ............................. 8  H H Browning, elk  ......................... . ago 8 A Ferguson, elk .................................... .. 2 oo Auee Pre -lnct J w Davidson, judge, reg, e t c .......... 8 T Megginson, ju d g e .......... H C Doss, judge..... .............. - - 1 R B Megglns-n. oik .....   ................ J w Davidson, Jr, oik ........................... Stonewall Preoinot T R Carson, judge, rec sc ret A oomr. J P Alvis, Judge li reg . .............  . ....... S E Arderaon. judge ............... w T Caldwell, elk .... .............. .. ................. - QeoB Drinkard. oik   ......... . Oakville Preoinot   4 O E Carson elk ........ ..Jr.. ... ____ ....S 8 00 J B Taylor, elk .......... .. ....................  uo 8 1  heeler, judge, rec A ret ...... - .......  00 J W O Martin, judge ............ . ................... g ft, O H Coleman, r e g ............. . ..................... e 0 Milton Isbell, oomr ....... . ................. 8 00"}, "highlight": {"text": {"matched_tokens": ["L", "D"], "snippet": "OBrien, jud ge.... ....... ... goo <mark>L</mark> E Morris, judge, rec Sc ret... ........ . 4  <mark>D</mark> A Conner, judge.... ............................. 8"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "D"], "snippet": "OBrien, jud ge.... ....... ... goo <mark>L</mark> E Morris, judge, rec Sc ret... ........ . 4  <mark>D</mark> A Conner, judge.... ............................. 8"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2116.33, 443.27, 2317.29, 1327.93], "bbox_id": "1e559f89ec", "file": "AppomattoxNewspapers_1905-1912a_0300.pdf", "page": 1, "text": "S tapleton,. I The heavy mantle of snow which I covered the ground last woik has I disappeared as if by magic. Gentle I  Spring seems to be creeping on ns I rapidly. Vegetation is taking on I new life, and croaking of frogs and I chirp of little chickens all tell ns I that winter will soon be a thing of I the past and another season has I taken its-place. 11 On Friday night, Maroh 10th, 1 1 there was a box p irtv at the - home! I of Mr. A. F. Drinkard, given under! I the auspices of the Ladies Aid So-11 loiety to raise money for benefit ou church. Everybody I  box ooncainmg enough I  provisions for two, which were Soldi foi 50 C u etcu. The boy ur.-wl slips of paper wi h niue ot lady I whose box he had pureuast.-d, 1 n y  paired off iu following manne  A.I F. Drinkard wiin Mri. Geneva! Reoker Tip Mart u, L ll an How-1 enon Go i ad Moire, Olvd Belll clarence Dnnkad, Susie Mooiil ISiduey G ow, Lucy Patterson Mui-I vin Dnukard, Vere Drinkard Waid Orews, IdaGiow Jun Mooie, Mrs. Mai lie Martin Raymond Bell, Er-! mt Drinkard Earl Drinkard, An ni s W. Martin E. W. Marks, Irbie  M oie A. A Bell, Myitle Martin! Monday Moore, Annie D inkard!  Kugeue Drinkard, Lillian Drinkard,! 1 Milton Isbell Vermout Burge J.-P.l IGrow, Mrs. A. F. Drinkard, Torn! I Marcum, Ru b Drinkard Herman Moore. Mrs. T. M. Martin. Mrs. W.l W. Mason. Proceeds from boxes and etc. amounted to 10.30, In connection with tho box partv there was a very interesting entertain- Iment given for the pleasure of the andienoe. Mr. 8. R Martin, who has been sick with pneumonia, is improving las fast as could be expected. Me I has been missed very mnch at Sun-  1 day School and we hope he will soon be well enough to resume bis duties as Superintendent which po sition he eo ably fills. The Sunday j School at Trinity was never morel interesting than at the present time. I The register last Sunday repored 152 present against 87 one year ago I 182 collection and 35 oents one  year ago. Grip prevented a good I many regular attendants from be ing present We extend a cordial weloome Mr. Otho Martin and family, who  have located in onr midst and will assist his uncle, S. R. Martin, his shop. Mr. Herman Harding has been I confined to the house with sickness I for past six weeks and is being at- te ded by Dr. Watts, of Biversville. Last report, he was improving very rapidly."}, "highlight": {"text": {"matched_tokens": ["D", "Isbell"], "snippet": "Martin! Monday Moore, Annie <mark>D</mark> inkard!  Kugeue Drinkard, Lillian Drinkard,! 1 Milton <mark>Isbell</mark> Vermout Burge J.-P.l IGrow,"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Isbell"], "snippet": "Martin! Monday Moore, Annie <mark>D</mark> inkard!  Kugeue Drinkard, Lillian Drinkard,! 1 Milton <mark>Isbell</mark> Vermout Burge J.-P.l IGrow,"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1667.97, 1366.61, 1833.79, 1717.07], "bbox_id": "85a05ffca3", "file": "AppomattoxNewspapers_1922-1923a_0316.pdf", "page": 1, "text": "Popular Prices Write for Illustrated-Catalogue. Isbell, Bowman  Go Lynchburg, Va. GLAD MS FOB ALL. D. W. M yers , Lynchburgs leading mens and boys out fitter has on account of other interest decided to make complete change in his busi ness. T his means 58D 0D ?0D stock of the best all wool cloth ing ever known to be dis posed of for cash at less thal co?t- Nothing reserved ex cept Wilson collars and cuffs we have promised not to cut them. t h i s WrTT bg th S s t a t i s t s   oF s o o g c u o fH  E S ev e icnow n ?rj L ynch- b b fg  WATCH the papers"}, "highlight": {"text": {"matched_tokens": ["Isbell", "D"], "snippet": "Prices Write for Illustrated-Catalogue. <mark>Isbell</mark>, Bowman  Go Lynchburg, Va. GLAD MS FOB ALL. <mark>D</mark>. W. M yers , Lynchburgs"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "D"], "snippet": "Prices Write for Illustrated-Catalogue. <mark>Isbell</mark>, Bowman  Go Lynchburg, Va. GLAD MS FOB ALL. <mark>D</mark>. W. M yers , Lynchburgs"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2360.63, 1099.84, 2522.05, 1574.76], "bbox_id": "0c69b610c8", "file": "AppomattoxNewspapers_1933-1936a_0012.pdf", "page": 1, "text": "Mrs. E. Marshall Strstton, 68 , formerly Miss Bruce Rob ertson, of Nottoway county, died suddenly at her home near Stonewall, Appomattox county, Sunday immediately after returning from church. She had not been well, but had seemed much better and her condition was not considered serious. She was born in Nrittoway county, March 4,1870. Her parents were Caswell and Wil lie Quisenbery Robertson, and she was married to E. M. Strat ton, of Appomattox county De cember 16, 1897.  She had long been a mem ber of Hebron Baptist church, of which her husband is an of ficer. Besides her husband, E. M. Stratton, she is survived by three sons and two daughters P. B., W. R., and E. M. Strat- ,ton, Jr., and Mrs. Ruth Cheat ham and Miss Elva Stratton two granddaughters, Margaret B. Stratton and Nancy Patricia Cheatham one brother, How ard Robertson, of Johnson City Tenn., and two half brothers, Hogue Robertson a n d James Robertson, of Spout Spring. Active pallbearers were -Charles Stratton, Bert Strat ton, Vann Drinkard, Marvin Taylor, Harry Isbell, Francis Hamilton, Hansford Cardwell and A ubrey Thomas. Honorary pallbearers were r T,. D  g . I  Ttr rr !-  Kli L.aid tuTOSa, vv , l . Lnris- tian. G. P. Jennings, C. E. Car-"}, "highlight": {"text": {"matched_tokens": ["D", "l"], "snippet": "pallbearers were r T,. <mark>D</mark>  g . I  Ttr rr !-  Kli L.aid tuTOSa, vv , <mark>l</mark> . Lnris- tian. G. P."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "l"], "snippet": "pallbearers were r T,. <mark>D</mark>  g . I  Ttr rr !-  Kli L.aid tuTOSa, vv , <mark>l</mark> . Lnris- tian. G. P."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [678.23, 263.82, 1002.4, 617.28], "bbox_id": "c1eb47ae7d", "file": "AppomattoxNewspapers_1892-1898a_0306.pdf", "page": 1, "text": "Lieut D. J . Evans 2nd Lieut,Jno. P. Harvey 3rd Lieut, C. W. Hun ter 1st Sergt., W. J. Colima  2nd Sergt, W. E. Isbell 3rd Sergt, J S. H unter 4th Sergt,E. W. Walker 5th Sergt, H. D. LeGrand 1st.  _ Corpl., T. J . Stratton 2nd Corpl., o f l 4 by,oronbehah _ _ __ 7 . _  _ I or, toe plaintiff, to ascertain in what onuntv T. D. Evans 3rd Corpl, G. S. Jones 4th Corpl., J. P. Br anch I P a t s e y Femju Musicians, E. G. Jenkins and T. M. ?J ut?irrV nd  ciarithe iaat  i dec years of age who are heirs at Turner. Il?w . .iS11 M. Johnson and necestary par ties to this -suit, reside without effect that p u iv u r s l Pf??!88.,118 heen sent to various counties and EK1 AXES. I corporation against them and returned non a h it - t  . T, , r I residents and that their piaces ot residence Allen, . R ., Anderson, D. M ., I re unknown, it is ordered that they do at- . . . .  t -r, t , . I herp within tlfteen days after due publi- Aydlott, W. D., Bass, W. R., Bates, I cation of this order and do what may be nee l i t ! n - l. n -m I ciwary to protect their interest In the prem- Boaz, J. D. B in g h a m , G. W. I And that a copy of this order be pub- n  i i . m  n n , I  ,d once a week rorfour successive weeks Oralle, I. L. Collins, E. r . Carson, I n the Appomattox and Buckingham Times, a  newspaper published in the State of Virginia and nriGtod mo tlw, a t _ _ a .  J. M. Carson, W. H. Cardwell, C. W. Cum by, F. W. Cheatham, T. H A. Christian, H. B. Dickey, J. S. Davidson, 8. S. Drinkard, Wm. I Evans, D. E. Eisman, M. Furbush, I C. H. Foster, W. T. Fleshman, J. P. L. Grow, J. P. C. Grow, W. B. Glover, J. H. Garland, B. C. Harris, T. Harris, W. M. Howard, W. D. Howerton, A. P. Hundley, J. R. Hunter, R. P. Hendrick, G. Isbell, M. Isbell, A. J. Jones, T. W. Jones,  F. B. Jones, II. C. Jones, J. J. John-"}, "highlight": {"text": {"matched_tokens": ["d", "L"], "snippet": "m  n n , I  ,<mark>d</mark> once a week rorfour successive weeks Oralle, I. <mark>L</mark>. Collins, E. r . Carson,"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "L"], "snippet": "m  n n , I  ,<mark>d</mark> once a week rorfour successive weeks Oralle, I. <mark>L</mark>. Collins, E. r . Carson,"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [922.3, 1143.57, 1008.25, 1337.86], "bbox_id": "d21e2b3a6d", "file": "AppomattoxNewspapers_1933-1936a_0379.pdf", "page": 1, "text": "Cliff Godsey I Lem Mitchell j Lester Wingfield j Moody Wood John D. McCraw Jim Watson I Letcher Preston E. G. Blackwell Fred Isbell j R. E. OBrien j Floyd Woolridge C. C. Cavlthon j J. D. Cawthon I I ves-so n Smith Charlie Seay L. E. Smith W. W. Davis A . P . Martin T . A . Smith A Hudson Morgan J . H. VanHoy IA . P . Montague"}, "highlight": {"text": {"matched_tokens": ["D", "L"], "snippet": "C. Cavlthon j J. <mark>D</mark>. Cawthon I I ves-so n Smith Charlie Seay <mark>L</mark>. E. Smith W. W."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "L"], "snippet": "C. Cavlthon j J. <mark>D</mark>. Cawthon I I ves-so n Smith Charlie Seay <mark>L</mark>. E. Smith W. W."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [771.36, 1552.93, 972.22, 1962.8], "bbox_id": "11f58e05f9", "file": "AppomattoxNewspapers_1898-1902a_0030.pdf", "page": 1, "text": "Spanish Oaks, T he T imes Mr. Peter Wingfield had a nat row escape at Isbells Ferry a few days ago with Mr. D. A. Lang- horns team as he was returning from Lynchburg. He went in the station at Stapleton and left the team a moment on coming out he found it had gone and tracked it into the river at the ferry landing. After some search be found the horses with the running gear of the wagon trying to land some yards below the ferry. The horses were nearly un der water but with the timely assist ance of the Isbells and their boats they were gotten out without cutting a string. The wagon body had floated Jeveral hundred yards below but nothing was lost ont of it. The ladies realized about 25 by the ent rtainment at Dr. Rices last Friday evening. The entertainment was a great success in every wav, Long Tow Miss Daisy Bell of Lynchburg and tentioas to re,g Rosamond Johnson of Amherst creased by the war16 guests of Miss Minnie out the wishes of tz this week, expected that a similar  d l . m . ., ed by all of the other e  Shearer of Trinity nffeeted. One of the flrstnchbiirg is taking his va- the Navy Department Is the , . fleet of auxiliary vessels. are nnnecessaty but are owndd of Richmond and IZZTo the A  k e r of Kedlncky be Navy Department w"}, "highlight": {"text": {"matched_tokens": ["d", "l"], "snippet": "expected that a similar  <mark>d</mark> <mark>l</mark> . m . ., ed by all"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "l"], "snippet": "expected that a similar  <mark>d</mark> <mark>l</mark> . m . ., ed by all"}], "text_match": 1733920985477808249, "text_match_info": {"best_field_score": "2216176058368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985477808249", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [499.44, 563.84, 732.95, 1158.95], "bbox_id": "3c1f42519d", "file": "AppomattoxNewspapers_1918-1922a_0232.pdf", "page": 1, "text": "Disbursements. W. A. MosesSy. as Clerk Old Rd. Bd.................................. L. E. SmithSy. as Chm. Clerk and Present Rd. Bd ........... J. O. OBrienSy. as Rd. Comr. and Agent Rd. Bd............. R. E. CaldwellWork on Road...................................... . Daniel JohnsonWorking Roads ....................................... .. . Edgar ChiltonL ab o r.................................... . ........................ D. B. ThomasLabor............................................................... Andy ColemanLabor ............................................................ J. R. PoeRepairing Bridge.................................................... W. L. FordLabor .................................................. . .............. J. h. DriskiNWork on Bridge............................................... R. F. JameraonWork on Road ............................................ Appox. Hdw. Co.Supplies...,............................................... Cbas. PattersonLabor .......................................................... C. W. SmithSy. as Clk. Rd. Bd............................................. L. F. FergusonStamped Envelopes ..................................... T. S. McNallyFeeding Mules, Etc ...................................... Ottle DavidsonCleaning Out-Pipe ....................................... T. B. Scruggs  Co.Mdse...................................................... H. M. BurgeFeed and Supplies............................................. J. J. ForeFeeding Males ........................................................ L. E. Smith  Bro.Feed . ....................................................... W. A. MosesSurveying Road............................................... Barker Jennings Hdw. Co.Drag Scrapers .......................... C. B. GodseyOpening Jamerson Rd., Etc............................ J. A. FarisMules..................................................................... D. R. PuckettBlacksmith Work.......................................... R. F. JamersonLabor and Lumber on New R d. ............. S. L. MayberryLabor ........................ . ................................. H. B. MarshallWork on New Road ..................................... H. C. BabcockFee ..........  ............ . ........................................ L. L. FergusonLabor............................................................. Sam FergusonLabor ..................... . ................................... . S. B. DoveLabor..................................................................... Dewey FergusonLabor ........................ ................................. Andrew PillowLabor ............................ .. .........................   T. S. McNalleySy. as Foreman .......................................... L. T. MorrisWork on Roads................................................. Jno. J. FarrarWork on Roads............................................... I. H. WillDragging Road ...................................................... Buck DossLabor ................................................................... Buck WellsLabor ................................................................. Mrs. T. S. McNallyCooking for Rd. Fee .............................. J. J. JenningsDragging Road............. ................................. W. S. GobbleRepairing Saddle.. ......................................... Appox. GarageRoad Ditcher. . .............................................. Calion Iron Works  Mfg. CoRd. Mcb. and Supplies... Buck GodseyLabor ................................................................ Wm. GarrettLabor ............................................................... T. S. McNallyIncidental Expenses ..................................... W. H. LigonHalf Expenses to Purchase Mules ................. Ernest FergusonLabor ................................. . .................... Hall BryantLabor ................................................................. Charlie HornLabor .......................................................... .. Edner MannLabor ................................................................ Jim HillCooking ................................................................... Fred IsbellLabor ................................................................... Bill TurnerLabor ................................................................ . C. A. FlowersBlacksmith Work........................................... W. E. DickersonFencing Wire and Staples....................... Sam Mayberry  BoysLabor ........................ , ..................... J. F. JenningsDragging Roads............................................. J. W. Cawthon. Jr., Hay.......................................................... T. W. OdorWork on Road .................................................... Fred DooleyL abor................................................................. O. W. WatsonBlacksmith Acct ........... . ............................. W. E. Jones and J. R. Roe-Lumber ..................................... R. S. WheelerLum ber.... .................................................... Evergreen Supply Co.Feed.................................... . ............ J. A. Sears, AgentFreight ...................................................."}, "highlight": {"text": {"matched_tokens": ["d", "L"], "snippet": "Lumber on New R <mark>d</mark>. ............. S. <mark>L</mark>. MayberryLabor ........................ . ................................. H. B. MarshallWork"}}, "highlights": [{"field": "text", "matched_tokens": ["d", "L"], "snippet": "Lumber on New R <mark>d</mark>. ............. S. <mark>L</mark>. MayberryLabor ........................ . ................................. H. B. MarshallWork"}], "text_match": 1733920985343590521, "text_match_info": {"best_field_score": "2216175992832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985343590521", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [1325.31, 1169.07, 1464.61, 1687.67], "bbox_id": "51ff270e42", "file": "AppomattoxNewspapers_1892-1898a_0329.pdf", "page": 1, "text": "In  lii in. ,iiwl litirn n t .l r 9 -M a  I  ai I ilnl lal.i- a liiuit here it an isliuui iiiiiitH w i!H4cifi of a ii,. iiii r which is M il  hcatl of lire nav- Sim. The custom is to pireh np the island, and then drop t.own river with the tide by the moon- ht ami the soft melody of the le, with which harmonizes the mof confidential voices as they the out the inspiration of the dreams. t Tuesday evening the moon to shnie, bnt the fire-flies M through the darkness and the htning played incessantly upon waters, lighting up the scenery th most beautiful effect, and the t boat-ride of the season was a ccess. The boat-ride was gotten up by  Woodsoff, of Amherst, in or of her lady guests, Miss Pat- n f hvnchhurg,Miss Woodsoff, Pedlar and Misses Chappilier, of uqnier. Several of them bad rerbeen with a boating party we, and were doubtly delighted the novelty of the occasion. After tbe boating the whole party dedon Appomattox soil and called 11 Mils Myrtle Isbell,who served em refreshments and entertain d with music delightfully con- oding a mo8 enjoyable evening. ss Bessie and Miss Flarance rostt, of Ronoke City, spent last Wk Wlth Mrs. S. C. Startton, They Jed havoc with the hoys hearts He they stayed Miss Lula Wigg, eskft s visiting Miss Lizzie, Ifat ton."}, "highlight": {"text": {"matched_tokens": ["Isbell", "d"], "snippet": "called 11 Mils Myrtle <mark>Isbell</mark>,who served em refreshments and entertain <mark>d</mark> with music delightfully con-"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell", "d"], "snippet": "called 11 Mils Myrtle <mark>Isbell</mark>,who served em refreshments and entertain <mark>d</mark> with music delightfully con-"}], "text_match": 1733920984806719609, "text_match_info": {"best_field_score": "2216175730688", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920984806719609", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [537.1, 765.58, 699.27, 1430.67], "bbox_id": "397427260a", "file": "AppomattoxNewspapers_1926-1933a_0463.pdf", "page": 1, "text": "The Ladies Aid Society of Trinity church met with a picnic dinner at the home of Mr. J. B. Whitehead on Saturday, August 4tli, and celebrated his mother, Mrs. Lucy A. Whiteheads 92nd birthday. There were 66 pres ent and four generations were represented in two families. In the afternoon there was much music and singing, which was greatly enjoyed by all, especial ly the older ones, who are not able to get around much. The many friends of Mr. S. R. Martin will be glad to know that he attended Sunday School Sun day for the first time since his illness and operation. We are glad to report that Mrs. T. M. Taylor is much im proved and attended the revival at Trinity one night also picnic at Mrs. Whiteheads. Mrs. A. F. Drinkard and daughter, Louise, were over this week to see Miss Lina Carson, who has been quite sick. They report she is much better. Messrs. A. B. and E. L. Chick lad as their guests this week their sister, Mrs. A. F. Drink ard and daughter, Louise. The revival recently held at Trinity church, conducted by Rev. D. G. Trent, of Appomat tox, was much enjoyed and we feel the community as weH as the church was benefited by the sermons so ably delivered. An Epworth League has re cently been organized at Trinity church which we hope will be a great help to the community. Mr. T. M. Martin accompan ied some of his friends to Nor folk last week-end. Mr. Milton Isbell looks quite sporty driving around in his new Dodge. There will be a lawn party at Trinity church Saturday, August 18th, beginning at 5 oclock. Dont forget the date. Every- body invited. ------------ o ------------"}, "highlight": {"text": {"matched_tokens": ["L"], "snippet": "A. B. and E. <mark>L</mark>. Chick lad as their"}}, "highlights": [{"field": "text", "matched_tokens": ["L"], "snippet": "A. B. and E. <mark>L</mark>. Chick lad as their"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [303.11, 189.47, 469.28, 1020.76], "bbox_id": "de235c9fe9", "file": "AppomattoxNewspapers_1912-1915a_0241.pdf", "page": 1, "text": "Ribbon, R F Spradlin Red R ib bon, W W M artin GEAHD PRIZES L ynchburg Foundry Co., one 11 Boltless Plow for best 10 lbs tobacco to W alker OBrien. L ynchburg W arehouse Co, 5 for 2nd best tobacco, to J W G race, 8tapleton, V a E L Upton, 3 for best 1 bus hel of w heat to D E Caldwell W B Caldwell, one pair 5 Bostonian Shoes for best 3 year old  standard bred, to Joe O OBrien. 4 pair Bostonian Shoes for best 2 y e a r old 1 standard bred, to Jo e O OBrien Inge  M orris, 5 lb box of candy for best piece of em  broidery by g irl under 15 years, to Miss V irgie Inge Inge  Morris, 25 lb pail Poul try Food for best chicken ex hibit, to Tbos Babcock Inge  M orris,25 lb pail Stock Hood, for champion hoe, to H B Jennings Lynchburg Mfg Co, Banner for best one room school exhi bit, to Petty Fork School taught by Miss Jennie Purdum Blankenship F urniture Co, Parlor Lamp for best piece of embroidery, to Miss Lizzie Irby Sm ith  Ferguson, i ton 3-8- i Fertilizer for best farm ex hibit, to M C Sm ith Lynchburg Cham bers of Commerce, 10 for best 7 vege tables, to Elm a Sm ith W ills  Camp, suit of clothes for 10 ears corn, to Alfred OBrien L ynchburg Cream ery Co, 10 for best dairy cow, to Joe O OBrien Peoples Drug Store, 5 lbs of candy for best 1 tb assorted candy, to Lucile OBrien Carroll Hotel, 5 for best hand m ade quip, to Mrs L H Crawley Harris-W oodson Co, 5 lbs of candy for best exhibit of pot flowers, to Mrs L Crawley. 2 lbs candy, second best, to Miss Pauline Clement. 3 lbs candy for best exhibit of cut flowers, to Miss Berta Cralle L E Smith, 1 barrel flour for best 10 ears of corn, to M F Davidson Inge  M orris, 1 barrel Pils- bury Elour, to Mrs M F Taylor, for best loaf of bread Isbell Bowman Co, 1 pair 4 shoes for G irls C anning Club, to Mies Georgia W alton"}, "highlight": {"text": {"matched_tokens": ["L"], "snippet": "M artin GEAHD PRIZES <mark>L</mark> ynchburg Foundry Co., one"}}, "highlights": [{"field": "text", "matched_tokens": ["L"], "snippet": "M artin GEAHD PRIZES <mark>L</mark> ynchburg Foundry Co., one"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.39, 1428.06, 1546.88, 1695.1], "bbox_id": "c069722134", "file": "AppomattoxNewspapers_1912-1915a_0568.pdf", "page": 1, "text": "ng is a list of the Con eterans who are attend- union in Richmond this T. Cawthorn, T. B P- Grow, R B. Isbell e-ffimun, R. E Caldwell Martin, P. h . Wool-  burrum, 8 T. Marsh uson, B B. Garrett, H  P A. Tames, O. A r 0. Whitaker, E A W. pUgh Danief P c - Turned, F. H  H. Goosey, Jennings  b. Davidson, F. G  D- Loss, R. A. Cheat Jnnes, Wm Rosser, W.  8. R. Franklin, T. G. , M- Eaaeom, J.-D allas J P- Ocmnally, W L, P- Pore, Don A. P f der. P. A. Pugh, w"}, "highlight": {"text": {"matched_tokens": ["Isbell"], "snippet": "P- Grow, R B. <mark>Isbell</mark> e-ffimun, R. E Caldwell"}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell"], "snippet": "P- Grow, R B. <mark>Isbell</mark> e-ffimun, R. E Caldwell"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [446.4, 485.45, 609.7, 656.62], "bbox_id": "f6fe56fc67", "file": "AppomattoxNewspapers_1898-1902a_0229.pdf", "page": 1, "text": "Delegates to Senatorial Convention. Editor Times l would be obliged if you would publish the following list of delegates, whom I have up pointed t the Convention of the Eighteenth Senatorial district, which convenes at liuck- ingham C. H. Monday, Sept. 11th, at 12oclock. Sonthsidc district  11. S. Coleman, J. II. Robertson,T. W. Moses,S. L. Ferguson, 8. M. bee,  s. Robertson and A. H. Clement. Clover llill district J. W. Clark, K. i. Scais, Joel W. Watkins, W.J. Trent, E. K. Cliisin, U N. big II and W. E. Wriglit. Stonewall districtJohn W, Davidson, A. 11. Thornhill, A. A. White, Eugene Chick. Wilbur Stratton. Milton Isbell and J. H. Horseley. The delegates are authorized to appoint their own alternates if they cannot attend th  convention. , If. D. Fi.oou."}, "highlight": {"text": {"matched_tokens": ["l"], "snippet": "Senatorial Convention. Editor Times <mark>l</mark> would be obliged if"}}, "highlights": [{"field": "text", "matched_tokens": ["l"], "snippet": "Senatorial Convention. Editor Times <mark>l</mark> would be obliged if"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.43, 251.29, 1810.57, 1761.2], "bbox_id": "fed85ccf8c", "file": "AppomattoxNewspapers_1922-1923a_0360.pdf", "page": 1, "text": "A. H . C lem ent Is fined 10O . Circuit Court adjourned Thurs day evening after a busy term. The following grand jury attend ed Milton Isbell, J. R. Atwood, VV. H. Childress, J. W. Durrum, J. A. Stratton, N. R. Feathgrstone, H. G. Harding. J. D. Bondurant, C. H. Coleman, E. E. Cbisiii and T. Q, Davidson. The following indict ments were returned A. H. Clement, felony true bill. James McCoy, felonious shooting true bill. Alex. Sammons, felonious assault true bill. . Alex. Semmons, felonious cutting true bill. All of the cases were contmhed except that of A. H. Clement, who asked for an immediate trial. The following cases were also continued Wilbur, James and Dave McCoy, James Hancock and Hornsey Lewis. Com. vs Douglas Mason, appeal from Mayors decision of,. Pamplin Cityj dismissed bn groundsbfun constitutionality of charter of said town. Chas. Hindley took out noterali- zation papers.    Court refused to grant petition of Mrs. Lula Hunter for reduction of tbe assessment of her land in the village. Later the order was set aside and the application con tinued to next court. The court appoints Dr. J. B Abbitt a member of tbe county medical board. Com. vs A. H. Clement? first in dictment with drawn. Grand jury resumed session and reported true bill for felonious shooting with in tent to kill. Also indicted J. C. Beckham on nine indictments for selling liquor, and Wiflie White, one indictment for selling liquor. Joseph R. Case was relieved from the payment of taxes erroneously assessed against him. Haden vs Cardwell, appeal from Justice Moses Attachment quash ed and Cardwell given possession of mule. Muster Roll of Company H. 22nd Va. Cavalry ordered recorded. Walter Payne and W. J. Paris were appointed special policemen the former for Pamplins and tbe latter for Appomattox. The following jury was empan elled to-try tbe case against A. H. Clement W. T. Caldwell, L, R-. Richard son, J. R. Lee, Otis M. Gilliam, G. E. Drinkavd, T. A. Caldwell, Wm. E. Dickerson. J. N. Woolridge, R. E. Whitaker, Geo. D. Wiikerson. E M. Drinkard and Walker Harvey. Mr. A. E. Strode, who appeared for Mf, -0lement took- the grouqd that hejiad been tried and fined for the offe tree Cob nt over ruled and exceptions noted.--Judge Wqfee Smith, of Cumbriftnd and Co gressman H. D. Flood prosecute the acoused vigorously. The Con gressman1appearing as a witness on ihe stand,.adviser, and finally closT ing,the - argument. Mr. Hubbard, wfio prosecuted at the  Magistrates court was detained. at home by the illness of ills wife. . ,  The witnesses for the Common wealth appeared to be as follows R. E Hags, T. B. Carson, J. R Horsleyi T, J. Stratton, 3 . P. Alvis, S. L, Ferguson,-VI?..  Wright, O. fj. Haga, J. J  Durrum, W. A. Moses, R. Ci Mann,. J. C .Jones and Tom Ferguson. . 5 .    Witnesses for, the defence were Ellis Simms, Robt. Furbush, Raleigh. CKiltop and Ffank Jones. The accused has never denied the shooting and stated.then, and does Isb.jjow that if ever a man had a right-to shpot another he- Clement had the. right to shoot Ferguson. 8-. Ii. Ferguson testified substantially as follows. W ejU C. has been living in house 1 purchased. Moses,., Flood . and myself bought house. I ktterWardS- bought it. 1 de cjdqd to movedown this fall to-village. Cs time was out - by -contract on last day of September. 1 let-him Know that I intended to move down and wanted to make repairs. 1 asked privilege of looking through house Mr. and. Mrs. C. did not respond very gracious ly. About i p.-m. Hagacame aud we went over to bouse. Went through front office to back room and were talking about putting in bay window. C. came down stairs and said he had a box of glass on hand which would fit the windows and if you will take it you will save me trouble.of seud-ng it back. -Ill take it, tbere is one out I have had to put iu several times saiu C. Haga remarks there are two others broken. I asked Haga if it was not a stiff proposition for him to offer to sell pe glass that .lie C. had broken out. I was in good humor, yy-hen C. returns from.up stairs wbere.be went to getbill of glass. 1 said, Buck dont you think it a stiff proposition to want to sell me glass you have broken out? He threw his head back and said, np Im leaving bouse in a better condition than I found it. 1 said I think I could make you by law replace this glass you have broken. C, replied be-would line-to see me make, him do something. Tbe glass was sitting by me well, I think 1 will make you do it this way. Ill takethis box of glass and let Mr. Haga put ip tbose you have broken out. I know -I was deliberate, not fretted, or serious, took glass m my hand and Was talking. 0. followed me up anu took hold of my coat or sleeve and said, let that glass alone aqd get out of here I turned and took hold of his lapel and said, suppose you get out of here your time is out. I pressed him along towards tbe front door."}, "highlight": {"text": {"matched_tokens": ["Isbell"], "snippet": "jury attend ed Milton <mark>Isbell</mark>, J. R. Atwood, VV."}}, "highlights": [{"field": "text", "matched_tokens": ["Isbell"], "snippet": "jury attend ed Milton <mark>Isbell</mark>, J. R. Atwood, VV."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2261.31, 1022.17, 2363.99, 1131.72], "bbox_id": "92d06a0f4f", "file": "AppomattoxNewspapers_1915-1918a_0072.pdf", "page": 1, "text": "! Adeibert i Ferguson  Smith, fertiliser i fur M F Davidson...... L M Mitchell, building abed I and oorn home.. ............. Appomattox Hardware Co.  galvlnlsed iron, fencing  wire and merohandlse ..... M F Davids -n. clearing i hedge, fencing, fte ....... 8U L ane, sp re ad ln s lim e...... T w Wood and sou, crimson V clover s e e d ............................. .. GeorgwHewitt, lumber.... H I Orange, shoeing and  s m ith w o rk .................. ........... Fred Isbell, tabor"}, "highlight": {"text": {"matched_tokens": ["L"], "snippet": "fur M F Davidson...... <mark>L</mark> M Mitchell, building abed"}}, "highlights": [{"field": "text", "matched_tokens": ["L"], "snippet": "fur M F Davidson...... <mark>L</mark> M Mitchell, building abed"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
