{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Chick, W. L. Brown, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, O P. Farrar, J."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Chick, W. L. Brown, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, O P. Farrar, J."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1771.68, 518.61, 1929.44, 837.06], "bbox_id": "490087de49", "file": "AppomattoxNewspapers_1915-1918a_0474.pdf", "page": 1, "text": "where Mr. Vnod was a valued employee of C. W. Hancock  Son. The details at this time are not obtainable, but it is said Mr. Wood was walking along the R. R. track when struck and his body badly mangled by a train. He was a son of Mr. W. F. W o o d , of Spring Mills, and was a popu lar young man. Quite a company of young people are invited to supper at the New Appomattox this eve ning. We understand it to be Halloween and entirely a so cial affair. Those invited are Miss Madalyne Sears and Fon- nie W oolfolk, Miss Alice Prof fitt and Guy Smith, Mies Kath leen Rucker and Sam Ferguson, jr., Mise Jennie Godwin and Charlie Moses, Miss Virginia V. Ferguson and W illis Inge. Chaperone, Mrs. Geneva Ruck er L. F. Ferguson and Mrs. J. B. Peacock."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mrs. Geneva Ruck er <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> and Mrs. J. B."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mrs. Geneva Ruck er <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> and Mrs. J. B."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1650.7, 657.07, 1822.77, 1001.6], "bbox_id": "af675db289", "file": "AppomattoxNewspapers_1939-1943a_0147.pdf", "page": 1, "text": "WEDNESDAY SEPTEMBER 18 , 1940, all of the following described property, to-wit I A certain tract of land, containing 1.36 acres, situated in the Town of Appomattox, in Appomattox County, Virginia, about one-half mile North of the Court House, on East Side of concrete road No. 131, running by same, adjoining the lands of H W McKnney and Mrs. Adelia C. Fer guson, and being the same tract of land conveyed to James M. Flood by Albert Walker, by deed dated on the 18th day of February, 1919, and of record in the Clerks Office of. Appomattox County, in Deed Book No. 19, at page 36, a plot of said land recorded in said D .B .at page 37, to which reference is here made. Lhe above described tract of land will be cut up into lots and sold by lots first, and then as a whole tract of lan, whichever may be to the best merest of all parties interest ed. This property is located in a de sirable part of the Town and faces State Highway Route No. 460 on East side and No. 121 on West side and is a desirable place for dwellings and business sites. TERMS OF SALE CASH. L. F. FERGUSON, Trustee 8-15-4te"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "TERMS OF SALE CASH. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Trustee 8-15-4te"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "TERMS OF SALE CASH. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Trustee 8-15-4te"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.83, 1721.32, 1699.28, 1781.97], "bbox_id": "205cbaadb6", "file": "AppomattoxNewspapers_1905-1912a_0439.pdf", "page": 1, "text": "We have increased onr stock of building material and cn supply yon with flooring, ceiling, siding mouldings, lime, cement, bricks, ftc. Call to see na. L. F. Ferguson ft Bra. 9-4-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see na. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bra. 9-4-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see na. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bra. 9-4-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1743.36, 1724.79, 1904.37, 1786.38], "bbox_id": "46b418fa37", "file": "AppomattoxNewspapers_1905-1912a_0431.pdf", "page": 1, "text": "We have increased onr stock of building material and can supply yon with flooring, ceiling, aiding, mouldings, lime, cement, bricks, fte Coil to see us. L. F. Ferguson ft Bra. f-f-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Coil to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bra. f-f-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Coil to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bra. f-f-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1579.75, 1745.9, 1740.02, 1786.9], "bbox_id": "265696659b", "file": "AppomattoxNewspapers_1905-1912a_0431.pdf", "page": 1, "text": "We are waiting to fill your orders for Raw Bone Meal and Fertilisers of all kinds far wheat aad oats. L. F. Ferguson- ft Bra 9-4-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "We are waiting to fill your orders for Raw Bone Meal and Fertilisers of all kinds far wheat aad oats. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>- ft Bra 9-4-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "We are waiting to fill your orders for Raw Bone Meal and Fertilisers of all kinds far wheat aad oats. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>- ft Bra 9-4-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.88, 1662.32, 1684.44, 1702.82], "bbox_id": "b31b549e76", "file": "AppomattoxNewspapers_1905-1912a_0443.pdf", "page": 1, "text": "We are waiting to fill yonr orders for Raw Bone Meal and Fertilisers of all kinds for wheat and oats. L. F. Ferguson A B ra 7 9-4-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "We are waiting to fill yonr orders for Raw Bone Meal and Fertilisers of all kinds for wheat and oats. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> A B ra 7 9-4-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "We are waiting to fill yonr orders for Raw Bone Meal and Fertilisers of all kinds for wheat and oats. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> A B ra 7 9-4-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1571.54, 1108.52, 1744.51, 1777.13], "bbox_id": "a608498ab6", "file": "AppomattoxNewspapers_1905-1912a_0593.pdf", "page": 1, "text": "W ilson- M arshall-Flood Club. At the Court Houie Saturday night a Wilson-Marshall-Flooc Democratic Club was organized by electing Mr. L. F. Ferguson President, and a full set of officers. The Club will meet in the Court House on tbe first Satur day night in each month. It will be the aim to have Club organized at each precinct in the County. The following resolution of fered by Mr. E. R. Abbitt was adopted Whereas, the work of the Baltimore Convention which met June 25th, .1912, has com pleted its work and adjourned, and the smoke from the skir mishes and battles which punc tured the proceedings  of that notable body, and at times threatened to pnnoture the de mocratic party, has cleared away from the political firma ment, with only here and there traces settling in the valleys of ds ontent tb obscure Sme of he belgerent spirits of the con vention and their sympathisers at humé and Whereas, regardless of the preference of delegates for the vaious dm inguished men, whose names were before the convention for the Presidential nomination, it is evidént that there is a general feeling amnng the masses of the demo crane vote-s that the conven tion ac ed wise y in the selec- ion of candidates, and Whereas, Wilson and Mar shall, for president and vice presidenr. and Flood for Con gress, are the nominees oi every good and egular democrat oi this Congressional District, ant Whereas, sp teful criticisms in the newspapers and else whe e of the performances of any of the delegates at the Bal more Convention in the advocacy of their preferences for the presidenial nomination because they did not support the preference of the would-be critic is out of place and could have no worthy purpose now, and could have bad no worthy purpose at any ti r e since the Baltimore convention adjourn -"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "organized by electing Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> President, and a full"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "organized by electing Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> President, and a full"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1538.14, 1321.29, 1698.34, 1380.69], "bbox_id": "4e88bfec69", "file": "AppomattoxNewspapers_1905-1912a_0451.pdf", "page": 1, "text": "W e have increased our stock of building material aud can supply you with flooring, ceiling, siding, mouldings, lime, cement, bricks, o. Call to see us. L. F. Ferguson ft Bro. - 9 4-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bro. - 9 4-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> ft Bro. - 9 4-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [329.74, 211.71, 507.78, 1639.39], "bbox_id": "d71d014c3c", "file": "AppomattoxNewspapers_1912-1915a_0471.pdf", "page": 1, "text": "W B Harrison 8 00 1 Mrs W B H arrison 2 00 W C H arvey 5 00 Mrs J R Atwood 50 00 Mrs Annie Pretlow and S S class l 45 E E Gills 50 R L Burke 96 J T Mann 50 J W Caldwell l 00 W P Gills 5 00 T H Hancock l 00 Russell A bbitt 50 Cleveland Fore 25 Lynolee Atwoods class 75 Len Caldwell 1 00 Berkley W oolridge 1 50 Lloyd Goin 1 00 Mrs Lillie Gregory 5 00 Miss Jacqueline Atwood 1 00 Miss Louise Gills 50 Miss May W alton and class 3 46 C W Hancock 50 00 Miss Ella D rinkard 2 00 Womans M issionary So ciety of Liberty chureh 10 00 W T Davidson 2 00 Miss Odelle Woolridge 25 Mrs W S W oolridge 25 M C Caldwell 2 00 Miss jC V H ardy 1 00 W illis Inge 50 M L Erm an l 00 irs W alker Patterson 25 Mrs C A Hancock 1 00 tfiss Myrtle Inge 1 00 Hiss Maggie Flesbm an 26 R F Jam erson 1 60 tfyrtle Smith 10 Margaret Smith 10 Elizabeth Smith 10 Caroline Smith 10 R F Burke 1 00 Jam ie Gills 60 C A Hancocks class 2 40 Florence Caldwell 26 Mattie 8eiirs 25 Della Inge 10 Mr and Mrs T A W alton 7 00 Mrs M E Walton 1 00 Mrs Sallie Cheatham 2 26 Cash 56 Mrs G A Walton 50 Vay Abbitt 26 Ver nia Oden 26 Eva Woolridge 26 Earl Patterson 06 Lynolee Atwood 1 0 Bessie, Alice and Eleanor Harwood 2  Eloise Atwood 21 Carrie Giles Oi Inge  Morris 3 04 W S Taylor  Son 1 21 S D Sears l 01 W alter W oolridge l 04 M C Smith  fam ily 10 04 Mrs J B A bbitt i 04 Ilene Smith 24 J R  Chas Caldwell 5 0i Ed Dinwiddie 2 0 J W Uurrum 1 0. Miss E M Burke l  S D Cheatham 5 0 L F Ferguson 2 O J R Horsley 2 O Mrs C H Allen l o Miss Lennis Inge l 0 Mrs T H Inge l o De.la Morris 2 Bennie Morris 0 W F Burge 1 0 J T Cawtbon 5 0 E R A bbitt i o C S McDearman 5 0 Ed Harvey i 5 Miss Ida Jones 5 0 Mrs A F D rinkard 3 2 F B Jones 5 0 Mrs E M Ford 1 0 Mrs W T Steele 1 0 W C Nowlin 1 0 R W Nowlin 1 0 Mrs R W Nowlin 1 0 Jas A Webb 1 0 Phil H Gilliam 6 0 Floyd A Gilliam 2 0 H ix Bros 10 0 John H M arshall 2 5 Mrs John H M arshall 1 0 Joel W Coleman 1 0 Wm L Ford 1 u Mr and Mrs H C W heeler 1 5 Elijah F Baldwin 7 Lloyd Coleman 1 0 Mr and Mrs J W Davis 1 5 J R Fore 51 W W Vaughn  Thos H Glenn 51 Robt Biglow 51 Geo R Johnson  Roberts  Anderson 4 O Ragland Featherston 1 01 Mrs W F D rinkard 1 Oi"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "D Cheatham 5 0 <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> 2 O J R"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "D Cheatham 5 0 <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> 2 O J R"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1841.98, 990.56, 2166.33, 1575.47], "bbox_id": "e32a6ce896", "file": "AppomattoxNewspapers_1908-1909a_0390.pdf", "page": 1, "text": "VP Annie H. King and others. Cpmmissioners Office, Appo mattox, Virginia, April 15th, 1929. T q  Joel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound mind, Grade H. Hubbard,Robert C. Hubbard, W. C. Hubbard, the last three being infants under 21 years of age, L. F. Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, and C. W. Smith, Admr. of W. C. Hubbard, Sr., de ceased plaintiff and defend ants in the above suit. You are hereby notified that I have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H.,. aa the place for taking the sever al accounts in the above1 styled suit, ordered by the decree therein of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to take said account said Commission er shall give notice to all par ties to this suit of the time and place Of taking said account by publication thereof for four iamfejie-wgpap er juh Appumattex county, W hich n frffia ahnll -h-aqfrgo- M f C iim K i S v ic io f .eh  - - - notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery. 4-18-4t ENOS PAIN IN 3 MINUTES"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.3, 529.7, 1558.44, 559.15], "bbox_id": "17eb149381", "file": "AppomattoxNewspapers_1922-1923a_0594.pdf", "page": 1, "text": "von want something good for t beds call on L. F. ,Ferguson ro at Appomattox, Ya. l-15-3w"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "von want something good for t beds call on <mark>L</mark>. <mark>F</mark>. ,<mark>Ferguson</mark> ro at Appomattox, Ya. l-15-3w"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "von want something good for t beds call on <mark>L</mark>. <mark>F</mark>. ,<mark>Ferguson</mark> ro at Appomattox, Ya. l-15-3w"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.85, 987.48, 2184.0, 1196.23], "bbox_id": "5caf17e72f", "file": "AppomattoxNewspapers_1939-1943a_0053.pdf", "page": 1, "text": "VIRGINIA lift the Clerks Office of the Cir cuit Court of Appomattox County, on the 8th day of February 1940 Margaret Kinney Foster, Plaintiff Against Harley B. Foster, Defendant. , The object of this suit is to ob tain a divorce, avinculo matrimonii, on the grounds of desertion. And it appearing by affidavit filed that Harley B. Foster, is not a res ident of the State of Virginia, he is hereby required o appear with in ten days after the due publica tion of this order and do what is necessary to protect his interests. Teste C W Smith, Clerk. L F. Ferguson, p.q. 2-15-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C W Smith, Clerk. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-15-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C W Smith, Clerk. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-15-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [697.21, 690.9, 864.5, 898.38], "bbox_id": "d8b3bce807", "file": "AppomattoxNewspapers_1939-1943a_0060.pdf", "page": 1, "text": "VIRGINIA In the Clerics Office of the Cir cuit Court of Appomattox County, on the 8 th day of February 1940. Margaret Kinney Foster, Plaintiff Against Harley B. Foster, Defendant, The object of this suit is to ob tain a divorce, avincnlo matrimonii, on the grounds of desertion. And it appearing by affidavit filed that Harley B. Foster, is not a res ident of the State of Virginia, he is hereby required o appear with in tan days after the due publica tion of this order and do what is necessary to protect his interests. Teste C. W. Smith, Clerk. L. F. Ferguson, p.n. 2-15-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p.n. 2-15-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p.n. 2-15-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [727.88, 1230.96, 894.08, 1507.61], "bbox_id": "57159e8f3e", "file": "AppomattoxNewspapers_1936-1939a_0039.pdf", "page": 1, "text": "VIRGINIA , the Clerks Office of the Cir cuit Court of Appomattox County, on the 10th day of October 1939, Mrs Adelia C. Ferguson, Plain tiff Against , _ William M. Farrar, Gordon Far rar, James Ri Farrar, and the Un known Heirs of James R . Farrar, Defendants. The object of this suit is to par tition three small tracts or parcels of land in Appomattox County, Vir ginia. , .. , And it appearing by affidavit filed that James R. Farrar and his Un know,, Heirs whose names are un known, and whose whereabouts are unknown, are not residents of Vir ginia, or if residents their where abouts and names are Unknown, they are hereby required to appear with in ten days after the due publica tion of this order and do _ what is necessary to protect their mttrests. Teste , . C. W . Smith, Clerk. L . F . Ferguson and W . M. Abbitt, p. q. 10-l2-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W . Smith, Clerk. <mark>L</mark> . <mark>F</mark> . <mark>Ferguson</mark> and W . M. Abbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W . Smith, Clerk. <mark>L</mark> . <mark>F</mark> . <mark>Ferguson</mark> and W . M. Abbitt,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [172.55, 1172.79, 397.52, 1326.6], "bbox_id": "17851c12bd", "file": "AppomattoxNewspapers_1939-1943a_0577.pdf", "page": 1, "text": "ver V. H. Meadows fount Joe Meàdows ...... Unto Dr. Hamlett ............ . die Pete Shelton . . . . klllec ,o in Ranson . . . . . . . two George Sizemore . . . , gunn the h Post Office. Collection Robert Harris . . . . Thi Tucker Cheatham .. agair W. S. Taylor . ......... Jap L. C. Hatcher .......... jflanki J. M. Rosser . . . . . . . prote r Th Benton . ..  .......... Mis. C. E. McClenny ble  coun N. R. Featherstone . C. F. P. Crawley ... L. F. Ferguson . . . ."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. F. P. Crawley ... <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> . . . ."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. F. P. Crawley ... <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> . . . ."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.5, 1549.72, 1961.12, 1807.12], "bbox_id": "00aea36394", "file": "AppomattoxNewspapers_1892-1898a_0292.pdf", "page": 1, "text": "Ü í FBBGUbON. p q 4-9-41. V IRGINIA, Appomattox Couny Before B. B. Poore Special Commissioner of said County to restore lost records. E. M. Noel and Comma his wife and Datls and Tempy his wife. vs., petition, Jno B. Dickerson, Charles J. Dickenson, Fannie Fore. Beaugard Dickerson, Queen Price Leila Mann, Gilliam Mann, Bora Wil- kereon. John Wllkerson, ttobt. Dickerson, James Dickerson, Mollle Dickerson, Nannie Dickerson, Jno B. Terry W i 1 liam Terry, James Glover. Sam. Glover. Baby Glover, Aggls Glove, Sami. H. Wooldridge, Joel L. Wool dridge, and David Shields. Affidavit having been made before me B. B. Poore pedal Commissioner as aforesaid that Bobt Dickerson, James Dickerson, Mollle Dickerson, Nannie Diekerson William Terry, James Glove, ami Glover, Baby Glover, Aggie Glover, Sami. H. Wooldridge, Joel L. Wooldridge and David Shields are non resi dents of V irginla It Is ordered that raid non rest ients appear before me at my office at West Appomattox on May the lth 1896 to de fend their Interest In this suit. B. B. POORS. Special Commissioner, MEMO The object of this proceeding Is to restore to record a deed to900 acres ot land situated In raid County which was conveyed by proper deed by Henry D. Dickerson Ad ministrator, C. T. A. of David Diekerson de ceased, to Joseph Dickerson. The raid deed and record of the samo having been destroyed by fire on tbe 2nd dav of Feb. 1892. B. B. POORB. Special Commissioner, H. D. FLOOD l n n 8. L. FERGUSON, f pq 4 4t"}, "highlight": {"text": {"matched_tokens": ["L", "FERGUSON", "f"], "snippet": "l n n 8. <mark>L</mark>. <mark>FERGUSON</mark>, <mark>f</mark> pq 4 4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "FERGUSON", "f"], "snippet": "l n n 8. <mark>L</mark>. <mark>FERGUSON</mark>, <mark>f</mark> pq 4 4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2085.14, 1483.27, 2251.09, 1538.12], "bbox_id": "2ad53884e7", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "Two Negro boys have been char ged with petty larceny as a result of theft of several hundred pounds of sugar from a local store late last month. The case will be heard this week before judge L. F. Ferguson."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "this week before judge <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "this week before judge <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2041.4, 778.45, 2210.34, 955.99], "bbox_id": "4692b5807b", "file": "AppomattoxNewspapers_1954-1955a_0012.pdf", "page": 1, "text": "Two appointments were made by Circuit Court Judge Joel F. Flood, as of July 1. Charles F. P. Crawley was named for a new four-year term asTrial Justice of Appomattox County. This will be Judge Crawleys second four year term. He also served out the unexpired term of the late L. F. Ferguson. J. S. Kinney was appointed to a two-year term as a member of the Board of Public Welfare of Ap pomattox County. He had been serv- out the term of the late Frank Smith. Other members of the board are F. A. OBrien, chairman, and L. J. Morris."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "term of the late <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. J. S. Kinney was"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "term of the late <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. J. S. Kinney was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.18, 591.31, 2204.56, 814.91], "bbox_id": "646d0ee21e", "file": "AppomattoxNewspapers_1939-1943a_0525.pdf", "page": 1, "text": "Trial Justice L. F. Ferguson said ysterday that the officers had al- dy brought eight or ten motorists his court on charges of viola- i.g the new State 35 mile per hour speed limit. Motorists are urged to observe the new lowered speed law not only for the sake of avoiding arrest, but because lowered speed and careful driving will add to the length of their tires and cars. From Richmond it was stated by the State Police that slower driving in Virginia had already been credit ed with saving 73 lives during the first four months of enforcement. In the period beginning May 1 and ending August 31 there were 342 rural traffic deaths in 1941 and only 141 in -1942. . nis was accompanied by a 35.6 reduction in traffic which would account of 122 fewer deaths, leaving 79 to be-credited to the re duction in speed."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Trial Justice <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> said ysterday that the"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Trial Justice <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> said ysterday that the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1852.27, 636.27, 2024.96, 928.06], "bbox_id": "3304ff75d8", "file": "AppomattoxNewspapers_1939-1943a_0166.pdf", "page": 1, "text": "Trial justice L. F. Ferguson, had a very, viery busy day Wednesday, when some 31 warrants Came before his court. His docket was filleed in part due to recent activités of state, federal and local officials in enforce ment of liquor laws. The docket Jasper Lambeth, Negro, for illegal sale intoxicants, 4 months in jail and 50 fine. Eugene Stephens, Negro, for illeg al possession whiskey, 4 months in jail and 50 fine. Thomas Prekion, Negro, fobillegal sale 4 months in jail and 50 fine. Garrison Humbles, Negro, illegal sale, 4 months in jail and 50 fine. Sidney Johns, Negro, 4 warranto for illegal sale, 4 months in jail and 50 fine on each warrant. Richard Walker,. Negro, two war ranto illegal sale, 4 months m jail and 50 fine on each warrant. Paul Wade, Negro, 3 warrants for selling whiskey, 4 months and 50 finé on each warrant. Wortley Abbit  Negro 8 warranto for illegal sale, 4 months and 50 fine on each. Clarence Johns, 1 warrant, trans porting, 4 mon .is and 60 fine . Cases aganso Sam Turner, Aileen"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Trial justice <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, had a very, viery"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Trial justice <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, had a very, viery"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1691.25, 1141.46, 1869.45, 1787.3], "bbox_id": "3e15b3d139", "file": "AppomattoxNewspapers_1943-1947a_0158.pdf", "page": 1, "text": "To Tho, Voters of Appomattox County Governor Darden, at the direc tion. of the legislature, has fixed MaNffi. 6, 1945, as the, date to hav a Special election in ..Virginia, up on the question of whether or not the members of our armed force shall be allowed to vpte without pqying a polf .tax or Registering. hp regular Vdifing places will be open as uspal from sunrise to sun set. . As you know there are nearly 109 boys and girls in the armed ,t,rCSpram Appomattox County. Many of them are serving across he ocean thousands of mile- from vie. A number of them will nev- -?.r return. Some are already sleep- ? in lonely graves without a single loved one near to place flowers upon their grave. Others e rsking their lives daily that we might remain at home with our loved ones. Still others have lost their sight, lost arms, legs and other injuries too horrible to men tion. All in the service have gone where they were directed to go and served where told to serve whether on this side of the ocean  or on the other side. They are all doing their duty as commanded. The question is shall we allow these who are fighting and dying for us the privilege to vote or whether we will refuse them this privilege. It is not a question of whether they desire to vote. It is a question of whether they shall have the right to vote if they so desire. We do not believe that any patriotic citizen of Appomattox County, knowing the facts, would intentionally deprive our boys and girls of this great privilege. .veryone who was eligible tt ote last November in the Presi dential election is eligible to vote March 61 In addition all those who have paid 1942, 1943 and 1944 taxes by December 12, 1944 are also eligible to vote taking tax receipts with them to the polls o show election judges. We ear- .estly request every qualified vot er to go to your voting precinct and vote on March 6, 1945, and back our boys and girls. Let them know that we in Appomattox County are behind them in every way............ Signed W. M. Abbitt, George bbitt, Jr., Mrs. S. L. Ferguson, L. F. Ferguson, G. B. Buchanan, R. L. Burke, David T. Robertson. H. W. McKinney, Mrs. Calvin H. Robinson, D. A. Conner Chas. T. Moses."}, "highlight": {"text": {"matched_tokens": ["Ferguson", "L", "F", "Ferguson"], "snippet": "Jr., Mrs. S. L. <mark>Ferguson</mark>, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, G. B. Buchanan,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ferguson", "L", "F", "Ferguson"], "snippet": "Jr., Mrs. S. L. <mark>Ferguson</mark>, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, G. B. Buchanan,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1692.44, 1142.3, 1869.91, 1750.89], "bbox_id": "e1efc49882", "file": "AppomattoxNewspapers_1943-1947a_0157.pdf", "page": 1, "text": "To Th Voters of Appomattox County?  Governor Darden, at the Erec tion of the legislature, has fixed MjitfCh 6, 1945, as thet date to hav a -special election in -.yirgiiiia, up on the question of whether or not the members of our armecPforce shall be allowed to vqie without paying a poltlfex or Registering. hg regular vdSfing places will be open as usual from sunrise to sun set  As you know there are nearly 1OOO boys and girls in the armed W-S-fram Appomattox County. Many of them are serving across he ocean thousands of mile,from rne. A number of them will nev- jr return. Some are already sleep- in lonely graves without a single loved one near to place flowers upon their grave. Others risking their lives daily that we might remain at horns with our Joved ones. Still others have lost their sight, lost arms, legs and other injuries too horribla to men tion. All in the service have gone I where they were directed to go and served whqre told to serve whether on this side of the ocean I or on th other side. They are all doing their duty as commanded. The question is shall we allow these who are fighting and dying for us the privilege to vote or whether we will refuse them this privilege. It is not a question of whether they desire to vote. It is a question of whether they shal have the right to vote if they so desire. We do not believe that any patriotic citizen of Appomattox County, knowing the facts, would intentionally deprive our boys and girls of this great privilege. .veryone who was eligible t ote last November in the Presi dential election is eligible to vote March 6L In addition all those who have paid 1942, 1943 and 1944 taxes by December 12, 1944 are also eligible to vote taking tax receipts with them to the polls o show election judges. We ear- lestly request every qualified vot er to go to your voting precinct and vote on March 6, 1945, and back our boys and girls. Let them know that we in Appomattox County are behind them in every way ........... Signed W. M. Abbitt, George Abbitt, Jr., Mrs. S. L. Ferguson, F. Ferguson, G. B. Buchanan,"}, "highlight": {"text": {"matched_tokens": ["L", "Ferguson", "F", "Ferguson"], "snippet": "Abbitt, Jr., Mrs. S. <mark>L</mark>. <mark>Ferguson</mark>, <mark>F</mark>. <mark>Ferguson</mark>, G. B. Buchanan,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Ferguson", "F", "Ferguson"], "snippet": "Abbitt, Jr., Mrs. S. <mark>L</mark>. <mark>Ferguson</mark>, <mark>F</mark>. <mark>Ferguson</mark>, G. B. Buchanan,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [431.26, 850.92, 598.73, 961.32], "bbox_id": "b4171e99f8", "file": "AppomattoxNewspapers_1954-1955a_0203.pdf", "page": 1, "text": "this paper. T. W. Moses  Co. had an ad on their tobacco warehouse. L. F. Ferguson was selling fertili zer, and Purdum  Caldwell were leading merchants. We are fortunate to have files of this paper, extending back to the first issue, January 6, 1892. But it is always a pleasure to have someone unearth an old copy and bring it in to us."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "on their tobacco warehouse. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> was selling fertili zer,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "on their tobacco warehouse. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> was selling fertili zer,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1457.49, 1535.66, 1621.42, 1679.11], "bbox_id": "5b7670ffc8", "file": "AppomattoxNewspapers_1912-1915a_0335.pdf", "page": 1, "text": "There will be held in the Court House here next Saturday a Civil Service Examination by Postmaster L. F. Ferguson, to fill a Vacancy in the Rural Route from this office, caused by the deatb of Mr. John W right. It is said Carrier Pitz Martin will take Wrights Route No. 1, and the examination will be held for Mr. Martins Route No. 4 There are several gentlemen who will take the examination."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Service Examination by Postmaster <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, to fill a Vacancy"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Service Examination by Postmaster <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, to fill a Vacancy"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [424.87, 972.18, 589.27, 1065.43], "bbox_id": "b885623a9a", "file": "AppomattoxNewspapers_1952-1954a_0085.pdf", "page": 1, "text": "There are many other names asso ciated with the Bank cf Appomattox. Attorneys for the bank have includ ed B. L, Ferguson, Col. Joel Flood, and L. F. Ferguson. L. E. Smith was a vice president and director. Direc tors have also included H. C. Bab cock, J. A. Sears, J. E. Sears, W. L. Brown and H. W. McKinney."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson", "L"], "snippet": "Col. Joel Flood, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. <mark>L</mark>. E. Smith was"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson", "L"], "snippet": "Col. Joel Flood, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. <mark>L</mark>. E. Smith was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1467.34, 724.03, 1619.03, 1154.21], "bbox_id": "aa242aee7c", "file": "AppomattoxNewspapers_1918-1922a_0142.pdf", "page": 1, "text": "The most delightful social event ot the Easter simian was that of the dance FriJej night given by the membejreof the Appomattox Count!y iiub at their club rooms. fUilendtd music was furnished ji Spen cers J.- zz Orchestra, ofLynoh- burg, and a most pioyable tim e was had until ih wee sm a hours . Those piient in eluded Mr. and Mrs. W. B. C.ldwell, Dr. and Mrs. C F. Jabs, Mi. and Mrs. R E. CaldvKl, Mrs R. L. Burke, Mrs J Rfiwood, Mr. aDd Mrs. 8 W. Sn, Mrs. Thos. Jones, Mrs. Jetfalmer, Mrs. L. W. ThrockmoAci, Mrs. C. T. Moses, Mr. Masiif New- bill. Misses Eloise At woe, Vir ginia H ancock, MatgeSears, Eula May Burke, ElyaVIcore, Roanoke Miss Gayn-eGlilies- pie, Bedford City tbleen Rucker, Oallye Babcock Meesrs. Joel Flooi Eddie Moore, Bradley abcofkBrax- toa Hancock, Harold fe n c e r Hunter Moses, W altirScott, W. O. Moss, CookeGrreit, Jack Moore, Ed win L a m s , L. F. Ferguson, J  n J u rtis Caldwell, Ryland Mini Dr D M. TwymaD, Dr L sLiayle, ----- Stewart"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "L a m s , <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, J  n J u"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "L a m s , <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, J  n J u"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [672.94, 285.13, 829.29, 380.08], "bbox_id": "f70faee2b8", "file": "AppomattoxNewspapers_1918-1922a_0612.pdf", "page": 1, "text": "The delegates to the StauDtor- Convention left Sunday and M onday. M. L Furm an, L F. Ferguson and A H Clemen? constitute the delegation from Appom attox It is expected th at Mr. Tucker will be nomi hated on the first ballot."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "M. L Furm an, <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> and A H Clemen?"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "M. L Furm an, <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> and A H Clemen?"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [760.79, 989.83, 920.79, 1027.68], "bbox_id": "7877140145", "file": "AppomattoxNewspapers_1943-1947a_0309.pdf", "page": 1, "text": "Teste C. W. Smith, Clerk. L. F. Ferguson, p. q. 10-18-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 10-18-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 10-18-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1587.09, 653.44, 1926.46, 691.79], "bbox_id": "45f773f063", "file": "AppomattoxNewspapers_1943-1947a_0301.pdf", "page": 1, "text": "Teste ! C. W. Smith, Clerk. L. F. Ferguson p. q. 10-18-4tc Thomas"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste ! C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> p. q. 10-18-4tc Thomas"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste ! C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> p. q. 10-18-4tc Thomas"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2023.41, 1007.88, 2190.46, 1087.78], "bbox_id": "791fe9fbfc", "file": "AppomattoxNewspapers_1943-1947a_0116.pdf", "page": 1, "text": "Terms of Sale Cash. Place, Appo mattox Court House, Virginia Time Saturday, ,December 18, 1943, ten oclock A. M. L. F. FERGUSON W.M. ABBITT Special ComYnis.Voners. 12-2-2 tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "Terms of Sale Cash. Place, Appo mattox Court House, Virginia Time Saturday, ,December 18, 1943, ten oclock A. M. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark> W.M. ABBITT Special ComYnis.Voners. 12-2-2 tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "Terms of Sale Cash. Place, Appo mattox Court House, Virginia Time Saturday, ,December 18, 1943, ten oclock A. M. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark> W.M. ABBITT Special ComYnis.Voners. 12-2-2 tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2266.62, 944.03, 2435.08, 1109.82], "bbox_id": "28b23b26c7", "file": "AppomattoxNewspapers_1949-1952a_0092.pdf", "page": 1, "text": "tate that thony Hancock by Spot Cheatham and wife by a Deed dated May 27, 1921 and of record in the Clerks Office in Appomattox County in Deed Book No. 21 at page 421 and being adjoined by the lands of Hen ry Petty and the lands now or for. merly owned by Spot Cheatham and others. There is a large dwelling house on the above lot of land and said lot fronts on a hard-surfaced road. Charles F. P. Crawley, Admin istrator of L F. Ferguson, de ceased, Trusee, Acting under Provisions f Virginia Code"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Crawley, Admin istrator of <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, de ceased, Trusee, Acting"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Crawley, Admin istrator of <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, de ceased, Trusee, Acting"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.01, 1112.67, 1697.36, 1307.27], "bbox_id": "d7dcc451dd", "file": "AppomattoxNewspapers_1905-1912a_0451.pdf", "page": 1, "text": "Superintendent Hannah has just completed his first rounds of the schools and reports that thsy are doing well with two exceptions, one of these is the Bent Greek school, to which school a teacher was contract W. Kenny, Post- d with but she failed to secure board, and resigned. The other place is in Southside, at Marshall school, for which there is a gooci u o r-J . b . Hanea, postofflee Diuwyn  prospect of securing a teacher at an omtu I early date t ol the PeaceC. J. Nuckois, post-1 kola. pot1 We are waiting to fill your orders foi Raw Bone Meal and Fertilizers of all kinds for wheat and oats. L F. Ferguson ft Bro. 9-4 tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "for wheat and oats. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> ft Bro. 9-4 tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "for wheat and oats. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> ft Bro. 9-4 tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1501.43, 503.47, 1707.93, 768.11], "bbox_id": "6998328287", "file": "AppomattoxNewspapers_1971-1973a_0404.pdf", "page": 1, "text": "Star Team of the Minor League has won the Dis- mnionship trophy in tournament play recently com- n their first tourney game, Appomattox won over ton by a score of 6-0 the second game played Kustburg ended with Appomattox defeating them 16-2 L won their third game with Charlotte Court House -re of i2-5 the fourth game ended with Appomattox Halifax 9-1 and in the game played for the Champ- rophy, Appomattox again beat Charlotte Court House re of 13-3 to win the District title. IStar Team, pictured above from left to right,are - Mark Pierce, D a rre ll Schrock, Ronnie Robinson, Iton, Tony Ferguson, Greg Cheatham, Jeff Moore bert Totty on the second row from the left are Steve yron Roach, Tim D avidson, Kenny Burke, Frank S, L. Ferguson, F ran k ie McCormick, Terry Woods dDoss. Standing behind th e team is Bobby Stewart, team. Other coach es are Sam Ferguson and iayberry. ng to Coach Bobby Stewart, on the night of the last de Austin, District Director of the Dixie Youth lion, announced over the P A System that this was st Minor League team he had ever seen in his 13 1th the Association. will be displayed at one of the local banks."}, "highlight": {"text": {"matched_tokens": ["L", "Ferguson", "F"], "snippet": "Kenny Burke, Frank S, <mark>L</mark>. <mark>Ferguson</mark>, <mark>F</mark> ran k ie McCormick,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Ferguson", "F"], "snippet": "Kenny Burke, Frank S, <mark>L</mark>. <mark>Ferguson</mark>, <mark>F</mark> ran k ie McCormick,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2276.15, 685.72, 2454.6, 890.41], "bbox_id": "5ba7538b9d", "file": "AppomattoxNewspapers_1943-1947a_0482.pdf", "page": 1, "text": "Smith, N. H. W. McKinney, . C K. Hunter, D. A. J. JI. OBrien, Eula May  F. J. Smith, it r PllI1.  F. Abbitt, Jr., W OBriin m T HTarryr Willim8 W , L. Lewis, P. B. Stratton, C. Roland Smith, Grover RohSlflth ? T Robertsoii, J. O. Robertson, J. A. Bingham, C. F. P. Crawley, George Buchanan, H. G. Johnson, R. M. Mann, C. iCRobin- son, W M. Abbitt, Mrs. S i f Fir- Eanlf s A. Powers Mrs. J. W. Flood, E. J. Marsh, Mrs. F. C. Dresser, W A. Woodson, J. C. Hudgms, W F. Woolf oik, H. Y Spencer, Dr. F. H. Lukin, J. A. Martin, J Rufus Burnette, J. A. Burke, L. F. Ferguson, T. Hunter Dickerson, J. M. Cobb."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Burnette, J. A. Burke, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, T. Hunter Dickerson, J."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Burnette, J. A. Burke, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, T. Hunter Dickerson, J."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [301.19, 556.09, 505.29, 1792.27], "bbox_id": "92ebb039d2", "file": "AppomattoxNewspapers_1926-1933a_0183.pdf", "page": 1, "text": "Sixty-four delegates, with a fourth of a vote each, were elect ed to attend the state democratic convention in Roanoke on June 21, Governor Byrds program, including the proposed amend ments to the constitution, was endorsed and achievements of Senator S. L. Ferguson and Dele gate Albert Terrell in the Gener al Assembly were commended at a mass meeting of democratic voters last Friday. Don Moses, chairman of the county democratic committee called the meeting to order anc Senator Ferguson was elected chairman of the meeting while C. W. Spnith was chosen as its secretary. A resolution proposed by Mr. Smith and unanimously adopted provided that 64 delegates with a fourth vote vote each be sent to Roanoke that the chairman of the meeting appoint a com mittee of three, one from each magisterial district, to nominate these delegates that the dele gates from the county vote as a unit at the convention easting their ballots as a majority of them might determine and that those present at the convention cast the entire vote of the dele gation. Joel Flood introduced a reso lution expressing appreciation of the able representation given the county in the house of delegates by Colonel Terrell and commend ing him particularly for his ad vocacy of a change in the  nieth- od of gasolene tax distribution which would be more fair to the poorer counties in the state than the method now in use. J. R. Horsley introduced a resolution in which he praised Senator Ferguson for his activi ties representing the county in the state senate and both of these resolutions were unanimously adopted. , Senator Ferguson introduced following resolutions Whereas, the voters of Ap pomattox county are happy to have with us to-day, Governor Byrd, who will explain to the voters of. our county, the consti tutional amendments, to be voted on at the special election, to be held on June 19. Now, Therefore, Be It Re solved That we commend the fair and forceful campaign our governor is making, for which too much praise and commenda tion cannot be given. His high character and ability has reflected itself in his splendid administra tion. In a word, he has proven himself to be a great Virginian, and a matchless leader. Be it further resolved That we are in thorough accord with the far-sighted, broad-minded progessive and economic policies which he has advocated, and which have been written into the law of our state, which now stands in the front rank of the Union. Delegates to the Roanoke con vention were chosen from the various precincts as follows and the report of the nominating committee was adopted without a dissenting vote Courthouse S. L. Ferguson, R.L. Burke, H. W. McKinney J. A. Bingham, Charles F. Han- enkrat, W. F. Woolf oik, H. L. Spencer, B. W. Babcock, L. F. Ferguson, S. L. Ferguson, Jr., C. T. Moses, N. A. Wagers, W L. Brown, E LeRoy Smith, W L. Ould, J. E. Sears, N. B Featherston, Don Moses, H. G Johnson, C. T. Evans, D. A Connor, H. 8. Coleman, W W Woodson. R. F. J amer son."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson", "L", "Ferguson"], "snippet": "Spencer, B. W. Babcock, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, S. <mark>L</mark>. <mark>Ferguson</mark>, Jr.,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson", "L", "Ferguson"], "snippet": "Spencer, B. W. Babcock, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, S. <mark>L</mark>. <mark>Ferguson</mark>, Jr.,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "JUSTICEST. R. Horseley and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. COUNTY CLERKSJohn T. Bocock,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "JUSTICEST. R. Horseley and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>. COUNTY CLERKSJohn T. Bocock,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1425.1, 992.22, 1553.6, 1131.07], "bbox_id": "e88a91a64b", "file": "AppomattoxNewspapers_1939-1943a_0088.pdf", "page": 1, "text": "ry docket cases was tried  K a l justice court, omposed of casés involving The cases j.fendants were heard  triaSusvlce Charles H M É h defendant was.  L . F . Ferguson, acquitad. The he éeees drew sentences of and fin as of One defen- W KKÊSÊtk five counts, and      re n ty months in 2 6 0 p  K e s , appealed the"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "É h defendant was.  <mark>L</mark> . <mark>F</mark> . <mark>Ferguson</mark>, acquitad. The he éeees"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "É h defendant was.  <mark>L</mark> . <mark>F</mark> . <mark>Ferguson</mark>, acquitad. The he éeees"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2131.19, 1497.25, 2265.15, 1714.63], "bbox_id": "ad6b2cb673", "file": "AppomattoxNewspapers_1905-1912a_0183.pdf", "page": 1, "text": "Randall Goode,  J B Hamilton, suppllea  Rrergroen apply Co,   L F Ferguson  Bro,   LB Smith,   W B Ford,   H B Pittm an, salary..... M CM Drinkard,  .........  F A OBrian,  ...........  FA OBrien.  .........  f Jeff Pauiett, lum ber . ....... Oct 2, Oeearffweeny, labor... ....... O ct6, Branch Ferguson, labor.... Nov 10, P J Sheppard, supplies....  John Bryant, shoeing m ale Now U, W M Rosser, repairing - wagon ............. ..........  Jim Parrs, n u tting tree ont road .........  ...........  Reuben Almond, fixing bridge . ....... . ....................  L B Smith, supplies ........  B A Jenkins, cutting tree out road.......... . ............... Nov 24, W D Hlx, Supplies. . ............ - W L Turnes. lum bar ........... Dec U. S A Ferguson, tabor.. .......... J 1910 I Jan 11. 8 A Ferguson, labor .-. . . ........ 1 F eb, Gny Smith,  ...........  BA Ferguson,  ........... B B Chism, fixing bridge ....... W alter Pollard, ...................... Feb Z .J A Stepp, labor. . .... ............ . - -------- -nuns, catting tree out"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "suppllea  Rrergroen apply Co,   <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>  Bro,   LB Smith,   W"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "suppllea  Rrergroen apply Co,   <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>  Bro,   LB Smith,   W"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [469.7, 766.0, 600.59, 847.43], "bbox_id": "a36123d2b2", "file": "AppomattoxNewspapers_1905-1912a_0185.pdf", "page": 1, "text": "R L Poore, repairs to road.. J W Carter, putting In cul vert ........... ................ . April 9. J O OBrien, 4 1-5 months care m ules .................... A H Lee, labor ........ Jno T Wooldridge,  ...... Adams Bros Paynes Co, supplies ............................. L F Ferguson A Bro, supplies May 6, C 8 Cawthorn, repairs ........ _ April JS, Freight on blades paid by Treasurer .........................."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Bros Paynes Co, supplies ............................. <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> A Bro, supplies May"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Bros Paynes Co, supplies ............................. <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> A Bro, supplies May"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [401.73, 757.38, 549.84, 801.92], "bbox_id": "68493aedf6", "file": "AppomattoxNewspapers_1922-1923a_0015.pdf", "page": 1, "text": "pring- .  Mr. L. F. Ferguson heMT the light key to the k i t c h  cabi - 1 bet given aw ay by  t o w n  j"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "pring- .  Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> heMT the light key to the k i t c h  cabi - 1 bet given aw ay by  t o w n  j"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "pring- .  Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> heMT the light key to the k i t c h  cabi - 1 bet given aw ay by  t o w n  j"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.91, 529.12, 1988.68, 811.68], "bbox_id": "999170bb7c", "file": "AppomattoxNewspapers_1915-1918a_0580.pdf", "page": 1, "text": "P a trio tic R e g istra rs List of Registrars in Appo mattox County, Virginia, who served without compensation, in Third Registratipn, on Sep tember 12th, 1918 A. T. Inge, L F. Callabam, E. T. Price, H. W. McKinney, E. R. Abbitt, A. H. Howerton, J. L. Lewis, Ohas. T. Moses, W. R Brightwell, V. P. Paulett, P. Sears, H. M. Marshall, L. F. Ferguson, D. A. Conner, O. W. Smith, Miss Mildred OBrien, Mias Mollie Dnnkard, N R. Feathers ton, J. K. MegginsoD, B. G. Anderson, L. B. Harvey, J. R. Horsley, J. P. Alvis, W. i. Fracker. A total registration of 975 persons242 m e n under 21 years of age 232 between 21 and 36 years of age 501 over 36 years of age."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Sears, H. M. Marshall, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, D. A. Conner, O."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Sears, H. M. Marshall, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, D. A. Conner, O."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [904.11, 1372.13, 1066.4, 1594.27], "bbox_id": "3be1233347", "file": "AppomattoxNewspapers_1936-1939a_0052.pdf", "page": 1, "text": "ORDER OF PUBLICATION VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 38th day o 1 Or .hc- 193J. John Thomas Scruggs, ___ Plaintiff Against Bettie Scruggs, .......... Defendant. The object of this suit is to -ob tain a divorce a vinculo matrimonii from Bettie Scruggs on grounds of desertion. And it appearing by affidavit fil ed that Bettie Scruggs, is not a resident of Virginia, due diligence having been used to locate her with out success, she is hereby required to appear within ten days after the due publication of this order and do what is necessary to protect her interests. Teste C. W. Smith, Clerk. L. F. Ferguson, p. q. ll-2 4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. ll-2 4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. ll-2 4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1125.34, 462.86, 1296.46, 683.56], "bbox_id": "0ea8f13d3e", "file": "AppomattoxNewspapers_1939-1943a_0006.pdf", "page": 1, "text": "of the Cir cuit Court of Appomatox County, on the JSth day oi Or he- 1 yjj. John Thomas Scruggs, . . . . Plaintiff Against Bettie Scruggs, . . . . . . Defendant. The object of this suit is to ob tain a divorce a vinculo matrimonii from Bettie Scruggs on grounds of desertion. And it appearing by affidavit fil ed that Bettie Scuuggs, is not a resident of Virginia, due diligence having been used to locate her with out success, she is hereby required to appear within ten days after the due publication of this order and do what is necessary to protect her interests. Teste C. W. Smith, Clerk. L. F. Ferguson, p. q. ll-2-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. ll-2-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. ll-2-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [295.23, 1211.22, 458.48, 1459.42], "bbox_id": "36ffe875fd", "file": "AppomattoxNewspapers_1912-1915a_0213.pdf", "page": 1, "text": "OF A Good Form in Apoomattox Co Pursuant to a Decree o l tb e Ciro nit Court o f tbe County or A ppom attox, entered a i its June Term. 1918, In tue uusnoery uau.e eu titled u . H ie r a t tersoli, o. vs. Minute Ulubardsou and Others, i shun off. r lo r sale on Saturday, Auguat m e loth , 1913, at, 3 ocluck p. tu. a t bite trout uoor ot .vppontat- lox Court H ouse, a tract of land uumaiulng tllM acres, us show n oy plot ot actual sur vey made oy w . A. M ses, ou veyor ot Appo m attox cou u ty. situated m oloueWuil Dist rict ot We cou n ty ut appom attox, Va.,utout client miles nortu ot tue Court H ouse, ad Joiuintf tue lands or J. B c o n io n , tì. H. Uor aou, t. a . Ham ilton, w . H. o. Barlow ana W. o. ....w iiit. said tract o l land is a pur Lot tbe old Perkins N owiiu tract, and is  e l. water ed and tunoered, uysleves dnu rolling about elg a t acres ut open i laud, rest in timber. Xbis tract Is conveniently located m a g.,ou ueiguboruood, and win m ake auyoue a trood ratio. tjbiiM oi-U ue-.hird cash, tb e balance on L-reuii or one and two years tim e, w ith in terest Horn uute ui sale, to be secured by bonds ot the purchaser, and retention ui tltie to We property. L ,. I-. P G f t O L J S O N , Commissioner. Tbe bond required by tb e above decree uas been executed by L. F, Ferguson, Com mlssioner, with sufficient security, leste J . it. H lib a i.UiV, clerk, A nyone desiring to see W e prem ises t call uu L. f . ruixusuu, A ppom attox, V u., v. o. Nowjin on tue prem ises. Appom attox, Va.. July w, 1913,"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "uas been executed by <mark>L</mark>. <mark>F</mark>, <mark>Ferguson</mark>, Com mlssioner, with sufficient"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "uas been executed by <mark>L</mark>. <mark>F</mark>, <mark>Ferguson</mark>, Com mlssioner, with sufficient"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.09, 1409.57, 1911.35, 1661.3], "bbox_id": "4c081facf4", "file": "AppomattoxNewspapers_1912-1915a_0221.pdf", "page": 1, "text": "OF A Good Farm in Apoomattox Co. P ursuant to a decree ot the Giro a lt Court o f the County of A ppom attox, entered a t its Ju n e Term, 1918, lu the chaneery cause en - titled B ettie P atterson, Ac. vs. Minnie Richardson and O thers, i shall offer for sale on Saturday, August ths 16th, 1913, a t S o, lock p. m. a t tn e front door of A ppom at tox C ourt House, a trac t of land containing 141 acres, as show n by plot of actual su r vey made by W. A. Muses, suveyor of Appo m attox County, situated In atouew all Dist rict of tb e C ounty of Appomattox, Va., about eight miles no rth of the C ourt House, ad joining the lands o t J . E. Gordon, 8. H. Gor don, R. A. H am ilton, W. H. e. Hhrlowand W. O. Mowlin. bald tra c t of land la a p art of the old Perkins Nowlin tract, and is well w ater ed and tim bered, lays level and rolling about eigbt acres of open laud, re st in tim ber This tract la conveniently located in a good neighborhood, and will m ake anyone a good farm . TERMSO ne-third cash, th e balance on a credit of one an d two years time, with in terest from data of sale, to be secured by bonds of the purchaser, and retention of title to the property .  L.. I7. P B R G U S O N , Commissioner. The bond required by th e above decree has been executed by L. F. Ferguson, Com missioner, w ith sufficient security- Teste J . R. HORSLEY, Clerk. Anyone desiring to see tbe premises will call on L. F . Ferguson, Appom attox, Va., o r W. C- Nowlin on th e premises. Appomattox, Va., July v, 1913."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "has been executed by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Com missioner, w ith"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "has been executed by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Com missioner, w ith"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2106.0, 1330.48, 2273.05, 1431.93], "bbox_id": "cc78ce3f75", "file": "AppomattoxNewspapers_1947-1949a_0167.pdf", "page": 1, "text": "OBrien, John Megginson, W. Agee W. W. Adams Martin, Joe A. Woodson. Oakville L. F. Ferguson, Roland Smith, Bennett Harding, F. J. Smith, W. S. Walton, Stonewall J. P. Alvis, Jr., P. Stratton, J Rufus Burnette, Irby Wheeler."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Joe A. Woodson. Oakville <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Roland Smith, Bennett Harding,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Joe A. Woodson. Oakville <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Roland Smith, Bennett Harding,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [785.47, 1463.41, 893.24, 1745.81], "bbox_id": "16ecc5164b", "file": "AppomattoxNewspapers_1943-1947a_0462.pdf", "page": 1, "text": "-nrs. . L,. rerguson R. L. Burke Mrs. Calvin H. Robi J. H. OBrien J. A. Burke N. R. Featherston C. W. Smith W. M. Abbitt H. W. McKinney D. A. Corner G. F. Abbitt, Jr. L. F. Ferguson F. J. Smith N. E. Farrar F. A. OBrien Moses Motor Co. Hi-Way Service Stati L. S. McCormick Larry Young Poe Hardware Co. David T. Robertson J. W. Martin Mrs. Mary L. Murphv R. E. Wilbun H. C. Pulliam H. G. Johnson R. W, Moore R. C. M oore E. T. Guill Percy L. Thompson"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson", "F"], "snippet": "G. F. Abbitt, Jr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> <mark>F</mark>. J. Smith N."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson", "F"], "snippet": "G. F. Abbitt, Jr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> <mark>F</mark>. J. Smith N."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [570.7, 297.87, 736.4, 495.82], "bbox_id": "cc4fe83105", "file": "AppomattoxNewspapers_1936-1939a_0046.pdf", "page": 1, "text": "nown Heirs of James R, Farrar, Defendants. VThe object of this suit is to par tition three small tracts or parcels of land i Appomattox County, Vir ginia. And it appearing by affidavit filed that James R. Farrar and his Un known Heirs whose names are un known, and whose whereabouts are unknown, are not residents of Vir ginia, or if residents their where abouts and names are Unknown, they are hereby required to appear with in ten days after the due publica tion of this order and do what is necessary to protect their inttrests. Teste C. W. Smith, Clerk. L. F . Ferguson and W. M. Abbitt, p. q. 10-12-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark> . <mark>Ferguson</mark> and W. M. Abbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W. Smith, Clerk. <mark>L</mark>. <mark>F</mark> . <mark>Ferguson</mark> and W. M. Abbitt,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1241.04, 1337.76, 1383.27, 1685.87], "bbox_id": "7fbc096e00", "file": "AppomattoxNewspapers_1912-1915a_0539.pdf", "page": 1, "text": "NOTICE f OMMISSIONEHS OFFICE, w A ppom attox, Va A pril 6 th, 1915. A. T. Inge, Exor. of N. A.. Fuqua, vs T S. Inge and Others.  . ToE, 8. Inge, J. Si Inge, S. J. luge, cKlnney, fcherifiaud A dinr. ot C. W iioc d. Geo. W. Inge. Z. T. Inge, Howf Inge, H erbert W. Lnge, Edna May ing iige, Marion E. Inge, Jos. L. Inge, luge, Euward B Inge, Evelyn luge, n n e ln g e , widow of W alter G .lnge  inge, Lockie r uqua Spencer and O. S. .cr5 L tr Uusband AllC Kobertson,  right. O. C. W ngnt, W. 1. W right, eaee C. Atwood, in her own right 8 hxecutrix of J. K. Atwood Dee d. cm ith, H. D. Flood, 8  L.  ergusuu au Lammie W right, of whom Helen Inj ward B. Inge, Evelyn Inge and a e infants under the age of twet y -iars, and L. F. Ferguson, Guardian u 1 SrviVr..8aii int a n t defendants, ai WUM IT MAY CONCERN, plaintiffs and defendants in tire suit You are hereby notified th at I have ipon Monday, the 17th day ofM ay. 19i5 tim e, and mv office a A ppom attox C. if 16 Piace f r taking th e several acooi tne above styled sju.t, ordered by the tHerein b t A pril Term , l,9f6. of the  Court of A ppom attox, to-w it tirtit To whom and in w hat propt au sums Che funds seated in said bill m the hands of A. T. Inge, Executoi T f. PWceeds of th e said house and lot, nTiiecteu. shall be distrib u ted and ial Second Ail th e transao ions, acts a lugs of the said A. T, Inge, Kxecu aforesaid, and show ing all th e assets c a which have come in to the hat and w hat disposition l m ade thereof, a n d w hat assets of tb e.iu.te now rem ain in his hands and o i 8 nd liabilities, if any, are again th e said N. A. Fuqua. ? lrr- Showing any o ther m atters ea p ertin en t by th e Commissioner, ai by any of th e parties interested 8 tSied aBd reported on. ten 1 611 unor hand th e date above"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "twet y -iars, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Guardian u 1 SrviVr..8aii"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "twet y -iars, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Guardian u 1 SrviVr..8aii"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1266.27, 1350.7, 1406.82, 1715.99], "bbox_id": "0a49df270c", "file": "AppomattoxNewspapers_1912-1915a_0547.pdf", "page": 1, "text": "NOTICE C OMMISSIONERS OFFICE, J Appomattox, Va., April 6th,li A. T. luge, Exor. of N. A. Fuqua V8 T S. Inge and Others. To T. 8. Inge, J. S. Inge, S. J. McKinney, bUerifl and Adwr. Decd. Geo. W. Inge, Z. T. Inge luge, Herbert W.-fnge, Kdna May Inge, Marion E. Inge, Jos. L. lug, ,H o 5 luga ii.ge, Edward B luge, Lvclyu lng_ riueinge, widow of Walter G.Ing6.  Inge, Lockie ruqua Spencer anu U WL oor, tr husband Alice Robert, jj Wright. C. C. Wright, W. li. ence C. Atwood, in her own rigM _? Executrix of J. K. Atwood, Dee a,A Smith, H. D.Flood, S. L. eergusuaauy Cammie Wright, of whom Helen 1OT ward B. Inge, Evelyn Inge and  -3 are infants under the age ol years, and L. F. Ferguson, Huarou tern for said .iniant defendants,  WHOM IT MAY CONOBKH, . . Plaintiffs and defendants in te suit You are hereby notified that Ijjj, ipon Monday, the 17th day of MayjS time, and mvoffice at Appomattox.  the place, for taking the several tom the above styled suit, ordered by therein of April Term, 1815. of tne Court of Appomattox, to-wit First To whom and in what and sums the funds stated insai bi the bands of A. T. Inge, Exeou. t the proceeds of the said house ana w.. collected, shall be dlstrinuted and Secohd Ail the transac ions, act ingsof the said A. T, Inge, 01 aforesaid, and showing all the assew  estate which have come into the said Executor, and what disposition made thereof, and what assets o i. estate now remain in his hanas j debts and liabilities. If any, are ag said estate of the said N. A. r uiina.  Third Showing any other mauenjj ed pertinaat by the Commissioner,-., quired by any of the parties interest stated and reported on. . x Given nnder my hand the date so ten- C.W.SM1IL 4-7-4t Commissioner tt w"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "age ol years, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Huarou tern for said"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "age ol years, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Huarou tern for said"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2080.74, 862.39, 2246.69, 1190.89], "bbox_id": "b2b13a4369", "file": "AppomattoxNewspapers_1912-1915a_0308.pdf", "page": 1, "text": "nest team here this year that we aave ever had. Tbe following peo ple have helped us to get a good team viiaa Russell Fcrgnson 1.00 3 L. Ferguson  2.50 L. F. Ferguson 1.00 don. H. D. Flood 2.50 i. W. Fiood, Jr. 1.58 J. R. Horsley . .50 J. W. Smith 1.00 Jon Moses 2.00 Or. J. B. Abbitt 5 00 it. L. Burke .25 .Peoples Drug Store 1.00 d. H. Walter .25 J. L. Ohernault .25 Lnnstall Morgan 1.00 Hi. R. Feathers ton .50 d. M. Burge 4.00 Arthur Johnson St Co., Newark, N. J., oue third of every uollar spent srith hi.n. We appreciate these gifts very much and are sore th at there are juhers who will help us. F rank B lackw ell , Mgr."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "3 L. Ferguson  2.50 <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> 1.00 don. H. D."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "3 L. Ferguson  2.50 <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> 1.00 don. H. D."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [736.5, 163.44, 894.56, 550.08], "bbox_id": "c82455e62e", "file": "AppomattoxNewspapers_1918-1922a_0450.pdf", "page": 1, "text": "need-for such an organization, and we believe that with-a united effort on the part of the tobacco growers of this county and the other, counties of the Commonwealth, and the other states who are joining ia this battle for their rightq, that great good can and will be ao complished, and we trust that all the tobacco growers may not become tired, weary, or impatient,uutil the object of the organization is fully accom plished. Respectfully, W. O. Moss, E LeRoy Smith, T. AN Smith  Co., A. R Har wood, E. R Abbitt, Jerry A. Burke, J. D. Moses, H. C Pul Hum, L J. Morris, A H. Clem ant, C. T Moses, J W. ITloodj Robert Irby, S L Ferguso J. O OBrien, R L Burke, R F. Burke. L. F Ferguson, Cbas F. James, H C Babcock, . W. VI. Hancock, J W. CawthoD, H. M. Burg-, Pat Chandler, W J LeGrande, J. D. Morris, S W. Sears, L E hmitb, J. R Burnett, Ed McGinaiss,.. Clyde Carson, J D. Moses, T. M. King, R. W. Bricoe, T L Dose. T. L Christian, H. F Martin, L. F. Caldwell, Ernest Fergu son, J. W. Harvey, W. T. Din kins, T. H. Ford, Z M. Jones, J B. Ford, L. G.. Harvey and Clinton Megginson."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson", "F"], "snippet": "Burke, R F. Burke. <mark>L</mark>. <mark>F</mark> <mark>Ferguson</mark>, Cbas <mark>F</mark>. James, H"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson", "F"], "snippet": "Burke, R F. Burke. <mark>L</mark>. <mark>F</mark> <mark>Ferguson</mark>, Cbas <mark>F</mark>. James, H"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.95, 704.61, 2319.3, 800.51], "bbox_id": "586593fe11", "file": "AppomattoxNewspapers_1933-1936a_0302.pdf", "page": 1, "text": "nd sentenced to six months. Burrell Pettty was indicted for assault but the case was continued. These three, cases comprised the criminal docket of the court. A number of civil matters were disposed of. L. F, Ferguson was confirmed as trial justice to fill out   1 i __ _  T Ll U AMaaltf second. Loniurneu a tai juovv -u  - 7 - Best white rose. Mr,. W. M the unexpired term of J. R. Horsely Caldwell first Mrs N. H. Cheatham  _ ____ n.. oppmint of second."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "matters were disposed of. <mark>L</mark>. <mark>F</mark>, <mark>Ferguson</mark> was confirmed as trial"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "matters were disposed of. <mark>L</mark>. <mark>F</mark>, <mark>Ferguson</mark> was confirmed as trial"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [689.05, 417.49, 859.79, 613.99], "bbox_id": "3fc81d9ce9", "file": "AppomattoxNewspapers_1939-1943a_0050.pdf", "page": 1, "text": "n tf.e .rx cu t Court of Appomebtox County, 1  n the 8th day of February 1940. I Margaret Kinney Foster, Plaintiff - Against Harley B. Foster, Defendant. The object of this suit is to ob- ain  divorce, a vinculo matrimonii, I on the grounds of desertion. And it appearing by affidavit filed that Harley B. Foster, is not a res ident of the State of Virginia, he s hereby required o appear with- i in ten days after the due publics- tion of this order and do what is necessary to protect his interest. Teste C. W Smith,Clerk. L F. Ferguson, p.q. 2-15-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste C. W Smith,Clerk. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-15-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Teste C. W Smith,Clerk. <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-15-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [288.95, 625.96, 420.25, 1082.73], "bbox_id": "65e17006e6", "file": "AppomattoxNewspapers_1915-1918a_0592.pdf", "page": 1, "text": "Mrs W T Coleman... ---- ... . ... 1 00 Mrs T R Hichtirdjoo ... . ......... ... to  H Clement .......... . ............    5 00 B R A bbitt ................... . ...........  00 c w Smith ............ ....................... __ 1 00 8 L Ferguson........................... .  too H W McKinney ----- ------------ to L F Ferguson... . . .. . ._ ..... 2 09 Harold Spencer.......................... ._ 1 00 L B Smith .......... . ........................ zoo J W Ham let............................... ... 1 00 A R Harwood...................... ....... __ 1 00 W C Hubbard ........................... ... 1 00 J O OBrien ................................ ... 1 00 Jam es Meredith- ...................... ... so M C Caldwell...................... . ... 1 00 J A B u rk e .................................. ... 50 B row n Smith.......................... .... 1 00 26 Mr Bessie Jam es.......................... I 00 Rev L F Callaham .....  .......... ... i on Tunstall Morgan ...................... ... 1 00 A T In g e ................  .............. ... 2 00 Eddie Moore- ........ . ................... 60 Richard Smith- .............. - ,,r- r 60 W alter Woolridge- .....  ........... to Miss Mary Babcock- ........ _..... ... 60 Miss Ruth Moore  to Douglas Puckett... ........... 60 Deb. Babcock .......... . ........ . ... to Chas F Jam es ............................. ... to Reggie Stanley .......................... a R L Burke. ................................ ... 1 00 R FBurke ...... . . ........................ 1 00 T W Moses- ................................ ... 100 Henry Doherty ..................... . ... 25 Robert Irby .......... .. ........... ... ... 1 0 Miss Oretcben B ell.... ... to Milton Hayden .............. . 60 Mrs L A Melver....................... . ... 1 00 M P Wool folk ............. .. ........... 60 C B Davis ........... . ................ . w Lougenla P atteso n ...........  . ..... to Ruth Clement. .... . ............. . . . . be Mr  C Bledsoe ..... . ................ .... 1 00 Lieutenant A dam C Clement. .... 100 H 8 Wheeler- ............................. ... 100 J K Pulliam .......  .......... . 26 W F W right _______ __ _____ ... 26 B B Prlmm ............. ... 26 L J Morris ..... . ............................  to B W Babcock ............................. __ to Mrs. C T Moses. ....... ..... ........... 60 Mrs. D H Marshall ... ................ to J P L Fleshm an........................ 60 Elan tha D rinkard ................... ..... 1 00 Marye D rinkard ...................... ... 1 00 CL Tolley ................................... to"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "H W McKinney ----- ------------ to <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>... . . .. . ._ ..... 2 09 Harold Spencer.........................."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "H W McKinney ----- ------------ to <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>... . . .. . ._ ..... 2 09 Harold Spencer.........................."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1588.28, 235.83, 1749.54, 439.65], "bbox_id": "bcc7b94003", "file": "AppomattoxNewspapers_1912-1915a_0149.pdf", "page": 1, "text": "Mrs M F. Taylor is back after spending the winter in Norfolk and Richmond. Mrs. Dr. Fergnson, of Lynch burg, is visiting her brother, Dr. D. N. Twyman. L. E. Smith has on hand at all times Atlas. Portland Cement for sale. Adv. 4-30 4t Mrs. E. LeRoy Smith was called to her home in Halifax this week on account of the death of her brother. The appointment of Mr. L. F. Ferguson as postmaster for Appo mattox has been confirmed by tbe Senate for four years."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "The appointment of Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> as postmaster for Appo"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "The appointment of Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> as postmaster for Appo"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.88, 995.71, 1782.86, 1752.16], "bbox_id": "452157d939", "file": "AppomattoxNewspapers_1915-1918a_0598.pdf", "page": 1, "text": "Mr9. John Higginbotham re covers very slowly from her sickness and great sorrow of losing her little daughter is ex pressed. Her sickness afid sorrow has sorely taxed her strength. Jesse Martin Lee and Rosa May Baldwin were united in marriage by Rev. McEtroy at the Baptist parsonage on Tues day, 19th, at high noon Tbe happy couple left immediately for the grooms home near Ev ergreen. A telegram from Adjutant General informs Local Board that no more examinations will be held. The 18 to 36 year old registrants will he required to fill out and return Question iiaires the 36 45 registrants qrill return Questionnaires without filling out. On next Thursday, Novem ber 28cb, 11 a. m , all the people of Appomattox will unite in a Union Thanksgiving service at the Presbyterian church. Dr Green, of Lynchburg, will dc the preaching. Let all the people respond to the Presidents and Governors proclamations and give thanks. The young men of town have organized and rented the large hail over Atwood block for dancing and amusements. Now the girls are called upon to name he organization, and the girl who names it will be tieat ed to a handsome box of candy. Send in your suggested name to L F. Ferguson, Secy. D j it now. Big dance coming up for Thanksgiving evening. A very delightful entertain ment occurred at the school auditorium Monday night when the Camp Fire Girls presented to a good audience flag drill, choruses, etc. The music of Miss Virginia Hancock and her brother Braxton was much complimented. Tbe recitations of Misses Kathleen Rucker and Anna Vries were of a high or der. Mies Anna Jones and Mrs C. A. Hancock directed tbe af fair. After he entertainment the crowd went to the dance hall and enjoyed a short dance."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "your suggested name to <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, Secy. D j it"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "your suggested name to <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, Secy. D j it"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1422.72, 527.3, 1589.88, 1182.69], "bbox_id": "d23190df51", "file": "AppomattoxNewspapers_1905-1912a_0563.pdf", "page": 1, "text": "Mr. L. F. Ferguson returned to the University finals at Charlottes ville Saturday. Right much tobacco was planted in this county this week, though the season was light. Misses Grace Hancock and Willie Smith, of the Farmville Normal, are at home for vacation. Mr. W. B. Caldwell is in Rich- I mend attending the Grand Council  of the United Commercial Travelers Miss Carrie Hunter, who has been teaching at Fredericksburg, is spending her vacation at home here. Little Pearl, daughter of Mr. and Mrs. Ben Schaubach, of Nottoway, is very ill, but is thought to be im- proving. Mr. Jamie Gills, who was a stu dent at the University of Virginia during the past session, is at home, for vacation. Mr. aul MrB. J. Dallas Childress and Mr. N. H. Gregory attended the Memorial exercises in Farm ville last Friday. Mrs. Ava Schaubach, of Crewe, who has undergone an operation at a Richmond Sanitarium for appen dicitis, is reported as doing nicely. Mrs. J. T. Frazier, Jr., am child ren, of Chilhowie, Va., are visiting her parents, Mr. and Mrs. J. P. L. Flesh man, in he village this week. Mr. Elliott Tanner, accompanied by his little daughter. Alice, of Lyuchburg, visited nis parents, Mr and Mis. J. N. Tanner near here last Sumiay. Mr. 1. S Evan8 and Miss Mamie Dickerson will be married at old Concord Chu-ch this evening. This popular young couple have the best wishes of a h ist of friends. The Womans Missionary Society of Liberty Baptist Church, jvili give a LaWn Party on Friday, June 7th, commencing at 630 oclock at Liberty Gove. Come out and belj a good cause."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> returned to the University"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mr. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> returned to the University"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1979.04, 1152.88, 2152.99, 1562.92], "bbox_id": "5bbb0a234b", "file": "AppomattoxNewspapers_1939-1943a_0331.pdf", "page": 1, "text": "Mr. Calvin Robinson The Young Democratic Club of Appomattox county held its annual brunswick stew and business meet ing last Friday aftem ion at Holli day Lake. Hon. William M. Tucx, Democra tic nominee for v Lieutenant Govern or of Virginia, Was guest speaker. Watkins M. Abbitt, president for the past three year?, presided. At the business meeting the following officers were elected President, Mrs. Calvin Robinson Vice-presidents for Clover Hill district, N. E. Farm. for Southside disVict,. George F. Ablit-r, Jr., for Stonewall district, I.. F. Ferguson Secretary, Miss Carolyn Moses Treasurer, Miss Mary Trent. Delegates named fsr the state convention to be held this week-end in Roanoke L. T. Lucado, N. E. Farrar, J. M. Cobb, W. W. Carter, Miss Elaine McDearmon, Howard Williams, Mrs. J. W. Cobb, Miss Flora B. Williams, J. H. OBrien, Mrs. J. H. OBrien, Z. T. Moran, C. T. Moses, D. A. Conner, G E. Smith, Geo. Abbitt, Jr., C. H. Rob inson, Mrs. C. H. Robinson, W. M. Abbitt, Eula May Burke, Ryland M. Mann, S. L. Ferguson, Jr., J. A. Burke, Mary V. Trent, N. R. Feath erston, Caroline Moses, W. F. Wool- fork, Mrs. J. A. Burke, Dr. C. G. OBrien, H. Y. Spencer, H. C Pull- am, C. F. James, L. F. Ferguson, W. W. OBrien, P. B. Stratton, C. H Swing, C. Roland Smith, Miss Frankie McKinney."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "am, C. F. James, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, W. W. OBrien, P."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "am, C. F. James, <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, W. W. OBrien, P."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1869.6, 553.46, 2156.25, 962.85], "bbox_id": "ee7d134225", "file": "AppomattoxNewspapers_1908-1909a_0465.pdf", "page": 1, "text": "Momson, Miss Emma Reid, fit hi ? Jyner. W.L. Reid, JJ-W J - Gav. Mrs. H. J. È!aÌ drreyU N f r Reid Vida Re,d J- Reid, Cecil Reid,   ce Reid, Mrs. S.W. Torrent Mary Holt Reid, Charlie Reid. Mrs. Vaden Wyme, Mrs. G. F Crocker W. A. ViCk, Jame Harris, Alice Harris, Randolph Hatris, Reid Harris, Mrs. Liz. f j ggHfeyi Gs B. Dickerson, Jjlr.Dickerson, Mrs. Alice Pow-J Syr, Mrs. Lucy S. Haley, Mrs. j Mary A. Spencer, OscariiD.I Dickerson, Bolden C. Dicker-! son, Ralph W. Spencer, Flor.  Cnce Spencer, Rosalie Spencer,! Florence Yates, Tom Yates f David Dickerson, TLouis J M. Dickerson, Alex H. Dicker-1 son, Robert H. Cox, Geòrgie L, Cox, Mrs. Nannie Lee  Gregory, and L. F. Ferguson,  ira I D1  aFdian ad Litem- I Plaintiffs and Defendants in - the I above suit.  You are hereby notified that 1 1 fixed upon Thursday the! 16th day of August, 1928. a t lo f a. m., as the time, and my. office! at Appomattox C, H., Virginia, las the place for taking the several  accounts in the above styled suit I ordered by decree therein of the! June term, 1928, to-wit recommendations are dls-  Ist-All of the estate, real and j - j r - T h e de-  personal, of which Sarah F. Bald-1    J Win died,, seized and possessed. j . 2 nd-What liens,  any, exist! the real estate of Sarah F, I"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Nannie Lee  Gregory, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>,  ira I D1  aFdian"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Nannie Lee  Gregory, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>,  ira I D1  aFdian"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [543.59, 1208.55, 863.61, 1419.0], "bbox_id": "971e0931fc", "file": "AppomattoxNewspapers_1908-1909a_0381.pdf", "page": 1, "text": "Miss Mary Woodson visited entered,and that the Clerk friends id Charlotte last week-j mail a copy hereof to eaeh of end. the said defendants to the post Sunday visitors in the home ffice address given in the af- of C. R. Woodson were Misses a cer Cele-e Woodson Mi,dd and  Frances Marshall and Messrs.  CopyTeste Paul Woodson, Hermon Marshall C. W. SMITH, Clerk, and Houston Reams of Phenix, J. D. Easley   and Perrow Jonas and Mr. C a r- L. F. Ferguson, p. q. 5-9-4t wile of Lynchburg. Messrs Hugh Deaner and Eld Crawley of Madisonville, were visitors in the home of W. W. Woodson Sunday. Miss Catherine Caldwell and friend, Mr. Henry Coleman, of Lynchhnrg, motorod. h ome .io-"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mr. C a r- <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 5-9-4t wile"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Mr. C a r- <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 5-9-4t wile"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [542.41, 186.93, 703.82, 1090.71], "bbox_id": "b1d806a8c9", "file": "AppomattoxNewspapers_1922-1923a_0011.pdf", "page": 1, "text": "Miss Eula May Burke an nounces the agency of J. J Fallon, of Lynchburg, Va , for cut flowers, cossages etc , of all designs, for direct delivery Place your order now for Easter and Mothers day. These flowers are as near you as your tele phone. Phone No. 110 3 29-7w At the Methodist church Fri day evening an enjoyable affair took place, when the question Old Bachelors Should be Tax ed to support Old Maidswasup It was decided that old bache lore should not be disturbed in their already horrible estate and that old maids had no claim upon them. The subject was ably handled by both sides. The big reputation of Tanlac has been m tde by doing what other medicines failed to do Uhas. F James The old maids of the towD say they are not satisfied and want another chance at old bachelors  The Mens Bible class will entertain the youDg Mens Bible clasB at the C. O. A. Bldg. Friday, April 7oh. All mem bers of both classes are cordial ly invited to attend this enter tainment of the Methodist Sun day School. Miss Eula Burke announces to the public that by April 1st, 1922, she will be ready to dem onsirate Buick cars, for which she is dealer. She will give a special demonstration on Coart day. 3 29 2 Hon. R. L. Burke, C. W Smith and L F. Ferguson have received appointments from Governor Trinkle to represent the Commonwealth of Virgin ia at the Tenth Annual Con vention of the United States Good Roads Association which convenes at Phoenix, Arizona, April 24ih-29tb, 1922 - Some dealers are baiting with iut prices on acid phosphate Oar price on all grades is right When he says cheap acid, ask him for prices on high-grade goods and then tee us, we will get your business. F armers T obacco W. H. C o 3 29 3w On Saturday, April 8 th, the High School boy here will play the Burkeville High school on the grounds here. Every body come out and show these boys that the town stands be hind them. The boys have a good team and a very interest ing game is expected from the first. Admission 25c. For SaleOne Top Buggy and harness, also five passeng er Ford Oar. All in good con dition. L M. W ilkes , Appomattox, Va"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W Smith and <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> have received appointments from"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "C. W Smith and <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark> have received appointments from"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [955.9, 316.77, 1126.3, 670.16], "bbox_id": "1f1580c729", "file": "AppomattoxNewspapers_1949-1952a_0087.pdf", "page": 1, "text": "mattox County in the Town of Ap pomattox, Virginia on May 6, 1950, at 1000 A. M. the following property, to-wit That certain tract and parcel of land cont aining approximately six acres be the same more or less, however, with buildings and im provements thereon lying and be ing about five miles South of Appo mattox Court House immediately on the East Side of the Old Red House Road and being the same real es tate that was conveyed unto An thony Hancock by Spot Cheatham and wife by a Deed dated May 27, 1921 and of record in the Clerks Office in Appomattox County in Deed Book No. 21 at page 421 and being adjoined by the lands of Hen ry Petty and the lands now or for- merly owned by Spot Cheatham and others. There is a large dwelling house on the above lot of land and said  lot fronts on a hard-surfaced road. I Charles F. P. Crawley, Admin-1 istrator of L F. Ferguson, de-1 ceased, Trusee, Acting unde I Provisions of Virginia Code Section 26-51. Terms Cash. Date May 6, 1950 at 10.0 A. M .l Place In front of the Courthouse I of Appomattox County. 4-6-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Crawley, Admin-1 istrator of <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, de-1 ceased, Trusee, Acting"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Crawley, Admin-1 istrator of <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, de-1 ceased, Trusee, Acting"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1328.6, 1340.9, 2094.01, 1717.65], "bbox_id": "290b2dbc60", "file": "AppomattoxNewspapers_1912-1915a_0379.pdf", "page": 1, "text": "matbvillm distriot  Mies Mattie Barge, of Escondido, I Mr, and lira 0. L Spradlin and California, was s visitor last week I Miss Vivian Spradlin spent the .AitaveL06-0, 1,Taylor- po8t at the home of her uncle, Mr. I week end with Mr. R. F. .Spradlin, ot the Peaoe--B. a. Glover, j,jetcber Burge, and aunts, Mrs. jof Vera. Charlie Coleman and Mrs. Burge I Mrs. O. J. App, of Lynchburg, Moore, near Oakville. She will I is on  visit to her sister, Mrs. H. spend a while with friends inW. Kinney. Lynchburg and will go from there I ,Mrs. Rosa Megginson and son to Louisville and Bowling Green,land daughter, Mr. Terrell and Miss Ky. to visit her cousins, the Gre-1 Bsttie, also Mr. Gianville Webber gories, accompanied by her sister, jof Lynchburg, are visiting. Mr. Mrs. Emmett W. Coleman, of I Joseph Megginson. Stapleton. I Misses Mae and Irene Maast, of iambsbivbbdistrict . I Roanoke, are on an extended isitOlHAl N n w T h i s ofiftV w i l l IlO t MiM Etto     wb0 waB token to Miss Lucy Spradlin. W V d e Y JO W . 1I11S OUQT to a Lynchburg Hospital last week! Mi88 Minnie Smith, of Camber- for an operation for appndioitis, I ,andf i8 the gneBt 6f Miss Lillian died there yesterday. Her remains j Qarrett were brought here this morning I Mr. H. W. Kinney is spending a and taken to the Godsey burying I WQ ee8 yacatiorf at his home ground near Chap for interment. neat bere The deoeased was twenty years of  age and was assistant to Postmaster I Beware ot Ointments for t atarrh that L. F. Ferguson here. By her I Contain flercury, pleasing and oheerful manner she I had greatly endeared herself to a I facw! 8 ach articles.should aeveibeused ex-   ------------- wide circle of friends ere, who W t h f n S M o v ab le W ill Iwere hocked the Bad oew8 of her 1 death. She had been reared in the I takea latvnallr. acting rectly npon the blood I  _ _ , I aad Macons surfaces of the system. Ia baying home of Mr. 3. G. Harvey, her I Halls Catarrh Care be re you get the genn- 1  1 1 1  t la takan internally aad made ia Toledo t an OWo.by F. J- Cheney  Co. Textimoniale free"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "for t atarrh that <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> here. By her I"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "for t atarrh that <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> here. By her I"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.95, 492.51, 2185.01, 1174.92], "bbox_id": "9f2bfa0a50", "file": "AppomattoxNewspapers_1926-1933a_0464.pdf", "page": 1, "text": "M r it h  J yner W -L- Reid, Mrs-W . j- Gay, Mrs. H. J. ddrey N. L. Reid, Vida Re,d- J. D. Reid, Cecil Reid Bruce Reid Mrs. S. W. Torrent Mary Holt Reid, Charlie Reid, Mrs. Vaden Wyme, Mrs. G. F. Crocker W. A. Vick, James Harris, Alice Harris, Randolph Rari ,s,Re,d Harris, Mrs. Liz- zie BurWey, G. B. Dkkerson I,  Dickerson, Mrs. AWHpw- ell, Mrs. Lucv S. H alelfrs Mary A. Spender, Oscar AD Dickerson, Bolden C. Dicker son, Ralph W. Spencer, Flor ence Spencer. Rosalie Spencer, Florence Yates, Tom Yates King David Dickerson, Louis M. Dickerson, Alex H. Dicker- son, Robert H. Cox, Georgie L. Cox, Mrs. Nannie Lee Gregory, and L. F. Ferguson, Guardian ad Litem- laintiffs and Defendants in the above suit. You are hereby notified that I ,xed, upon Thursday the 16th day of August, 1928. at 10 a. m., as the time, and my otfice at Appomattox C, H-, Virginia, as the place for taking the several accounts in the above styled suit, ordered by decree therein of the June term, 1928, to-wit lst-All of the estate, real and personal, of which Sarah F. Bald- win died, seized and possessed, 2 nd- What liens, if any, exist against the real estate of Sarah F Baldwin. 3rd- Whether the real estate belonging to the estate of Sarah V Baldwin, deceased, could be devided in kind between her heirs at law, or whether it shall be sold and the proceeds distributed among the heirs at law. 4th- What are the distributive share or shares of each of the heirs at law of Sarah F. Baldwin, de  ceased and who they are, 5th- What would be a fair com pensation to be allowed to Coun sel for the Complainants out of proceeds of the sale of the land belonging to the estate of Sarah r . Baldwin, deceased, or to be paid to him by the parties to this suit if this real estate be divided in kind. 6 th- Any other matters especial ly deemed pertinent by himself or which may be required by any person interested to be so stated Given under my hand the date above. Ti n. c - w - S mith , Comr. in. 7-19-4t Chancery."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Nannie Lee Gregory, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Guardian ad Litem- laintiffs"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Nannie Lee Gregory, and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Guardian ad Litem- laintiffs"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [644.9, 416.55, 779.48, 573.93], "bbox_id": "eb258b9411", "file": "AppomattoxNewspapers_1912-1915a_0024.pdf", "page": 1, "text": "m ite . ............. HBIENEEI  Moore, supplies ............. L E Smith,   CM Stratton Sc Bro, lum ber  L F Ferguson Sc Bro, for corn  B H Woodson, blacksmith wk.  J a Hesson, team supplies......  A H Lee, am t. adv. for board of hands................. . ............-  A H Lee, salary toad foreman  J T Wooldridge, wages as d riv e r .......... . ..............  J C OBrien, labor  W W Doss  Chas Smith  Sam Hollins  Sidney H unter   J W Neighbors, supplies  c B Page, cutting trees out of road......................... Jnly 28, J R M arks Co. supplies....... Aug. 8, J W Neighbors, for dynam ite Aug. 21, W C G arrett, work on road  j w Harvey, lumber and w ork on road ............. Aug. 24, Va. Metal Sc C ulvert Co.,for"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Sc Bro, lum ber  <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> Sc Bro, for corn"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Sc Bro, lum ber  <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> Sc Bro, for corn"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [740.89, 644.86, 882.16, 691.06], "bbox_id": "d8366bd0ba", "file": "AppomattoxNewspapers_1926-1933a_0137.pdf", "page": 1, "text": "LUSLIB F. FERGUSON L ttorney at Law Ft  and Life Insurance Agent Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["F", "FERGUSON", "L"], "snippet": "LUSLIB <mark>F</mark>. <mark>FERGUSON</mark> <mark>L</mark> ttorney at Law Ft  and Life Insurance Agent Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["F", "FERGUSON", "L"], "snippet": "LUSLIB <mark>F</mark>. <mark>FERGUSON</mark> <mark>L</mark> ttorney at Law Ft  and Life Insurance Agent Appomattox, Va."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [742.11, 309.76, 883.2, 350.21], "bbox_id": "40ca265e03", "file": "AppomattoxNewspapers_1926-1933a_0123.pdf", "page": 1, "text": "LUSLIB F. FERGUSON l Borney at Law Fire and Life Insurance Agent Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["F", "FERGUSON", "l"], "snippet": "LUSLIB <mark>F</mark>. <mark>FERGUSON</mark> <mark>l</mark> Borney at Law Fire and Life Insurance Agent Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["F", "FERGUSON", "l"], "snippet": "LUSLIB <mark>F</mark>. <mark>FERGUSON</mark> <mark>l</mark> Borney at Law Fire and Life Insurance Agent Appomattox, Va."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [467.05, 503.96, 604.01, 551.61], "bbox_id": "a8fc837348", "file": "AppomattoxNewspapers_1926-1933a_0008.pdf", "page": 1, "text": "LUSL1E F. FERGUSON l t.orney it Law Appomattox, Va. Fire and Life Insurance Agent"}, "highlight": {"text": {"matched_tokens": ["F", "FERGUSON", "l"], "snippet": "LUSL1E <mark>F</mark>. <mark>FERGUSON</mark> <mark>l</mark> t.orney it Law Appomattox, Va. Fire and Life Insurance Agent"}}, "highlights": [{"field": "text", "matched_tokens": ["F", "FERGUSON", "l"], "snippet": "LUSL1E <mark>F</mark>. <mark>FERGUSON</mark> <mark>l</mark> t.orney it Law Appomattox, Va. Fire and Life Insurance Agent"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2015.24, 526.47, 2183.07, 961.01], "bbox_id": "ae8ed3e11f", "file": "AppomattoxNewspapers_1939-1943a_0585.pdf", "page": 1, "text": "lOMMONWEADTH OF VIRGINIA In the Clerks Office of the Cir- uit Court of the County of Appo mattox on the 20th day of Septem- eIT 1943. H. M. Burge, Plaintiff Against Mabel Johns McKinney, Sam D. Johns, Thomas Johns and Lelia Johns,  Defendants. The object of this suit is to 1 subject a 2 3-4 acre tract or land jwned by John A. Johns at time of is death to partition. 2J To sub ject said lands to liens held by H. M. Burge. And an affidavit having been made and filed that the defendants Sam D. Johns, Thomas Johns and Lelia Johns, are not resident of the State of Virginia, it is ordered that they do appear within ten days af ter due publication hereof, and do what may be necessary to protect their interests in this suit. And it is further ordered that a copy hereof be published once a week ior four successive weeks in the Times-Virginian, a newspaper pub lished in the County of Appomattox, -hat a copy be posted at the front door of the Courthouse of this County on or before the_4th day of October, 1943, that being the next succeeding Rule day after this order was entered, and that the Clerk mail a copy hereof to each cf the said defendants to the post office address given in the affidavit here in, and file a certificate of he fact in the papers of this case. A CopyTeste C. W. Smith, Clerk Geo. Abitt Jr. and L. F. Ferguson, p. q. 9-23-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Geo. Abitt Jr. and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 9-23-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Geo. Abitt Jr. and <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q. 9-23-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1401.85, 1504.63, 1827.5, 1559.48], "bbox_id": "a791c91cd3", "file": "AppomattoxNewspapers_1905-1912a_0447.pdf", "page": 1, "text": "lexrader Forbes poatofflee!fo ,with flooring, ceiling, .idmK creeks. Peace Loui. n.Jonea p o itlT if1?18 CeB,ent riCfiS, 4o congiat of th   P  t y  Call to see us. L. F. Ferguson  I  k bouse of to u r Bro. a a .room s in bad ,rfln   - - j -  v   tobacco barn, orchard"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  I  k bouse of"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Call to see us. <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  I  k bouse of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.87, 956.35, 1668.27, 1037.2], "bbox_id": "80b0affb76", "file": "AppomattoxNewspapers_1926-1933a_0429.pdf", "page": 1, "text": "Lewis Doss and wife, Samuel and Joe Ferguson have returned from an auto trip to Akron, Ohio, where they visited the formers brother, Clarence Doss. The party was accompanied home by L. F. Ferguson."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "was accompanied home by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "was accompanied home by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1503.82, 950.89, 1663.17, 1031.94], "bbox_id": "546622a1be", "file": "AppomattoxNewspapers_1908-1909a_0429.pdf", "page": 1, "text": "Lewis Doss and wife, Samuel and Joe Ferguson have returned from an auto trip to Akron, Ohio, where they visited the formers, brother, Clarence Doss. The party was accompanied borne by L. F. Ferguson."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "was accompanied borne by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "was accompanied borne by <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [572.16, 680.6, 727.35, 912.68], "bbox_id": "76503f3189", "file": "AppomattoxNewspapers_1918-1922a_0480.pdf", "page": 1, "text": "la tne Uuirict Court, of me United States for the Western Lhstric! of. Virginia. Ia tbe matter of  Hubert A. Jones, V In Bankruptcy Bankrupt  At Lynchburg in the said district on the 28th day of July, A D 1921, before K C Black ford, Ueferee in Bankruptcy. Mils being the day appointed by the court for the first meeting ot creditors, under the said bankruptcy, and of which due notice has been given in the TimesVirginian an by mail, 1, the undersigned Referee of the said court in Bankruptcy, set at the ttme and place above mentioned, puisuantto sueh notice, to take proof of df br and for the ctioicoof a Trustee under the said Bankrupt cy and I do hereby certify that the credi tors whose claims had been allowed ahd were present, were duly represented, failed to make choice of a Trustee of-the Bank rupts estate, and therefore I do hereby ap point L F Ferguson, of Appomattox in the county of Appomattox, State of Virginia, as Trustee of the same, r  R. C. BLACKFORD. Referee in Bankruptcy last Seashore EXCURSION"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "do hereby ap point <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>, of Appomattox in the"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "do hereby ap point <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark>, of Appomattox in the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [473.3, 1562.41, 630.35, 1708.76], "bbox_id": "dd9f67128c", "file": "AppomattoxNewspapers_1915-1918a_0384.pdf", "page": 1, "text": "L IS T O F R E G IS T R A T IO N O F - F IC IA L S  O R A P P O M A T  TO X C O U N T Y U N D E R S E  L E C T IV E D R A F T L A W . C ourt House Precinct A. T. Inge, R egistrar L. F. Ferguson, Asst. Registrar! E. T. Price, Asst. R egistrar Cheat wood Precinct A. H. H ow erton, R egistrar Chap P recinct 8. W. H arvey, R egistrar T. W. Moses, Asst. R egistrar"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "T. Inge, R egistrar <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Asst. Registrar! E. T."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "T. Inge, R egistrar <mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Asst. Registrar! E. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.92, 218.91, 1773.97, 240.5], "bbox_id": "e6c1390bde", "file": "AppomattoxNewspapers_1915-1918a_0121.pdf", "page": 1, "text": "L. F. Ferguson was a visitor to Richmond Friday."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> was a visitor to Richmond Friday."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> was a visitor to Richmond Friday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2169.33, 1322.76, 2339.34, 1414.61], "bbox_id": "3929fca025", "file": "AppomattoxNewspapers_1939-1943a_0334.pdf", "page": 1, "text": "L. F. Ferguson, trial justice of Appomattox county was elected one of three vice-chairmen at the Fourth District caucus of the Young Dem? ocr,tic Clubs of Virginia last Fri day night, during the annual con vention in Roanoke. Ibert Ran dolph Jones, of Powhatan was named district chairman to succeed Andrew Godsey, of Cumberland."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, trial justice of Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, trial justice of Appomattox"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1683.89, 1584.36, 1844.91, 1624.86], "bbox_id": "2309d7a397", "file": "AppomattoxNewspapers_1905-1912a_0354.pdf", "page": 1, "text": "L. F. Ferguson St Bro. have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> St Bro. have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark> St Bro. have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2151.09, 953.7, 2253.89, 973.55], "bbox_id": "4a1d926a98", "file": "AppomattoxNewspapers_1939-1943a_0056.pdf", "page": 1, "text": "L, F. Ferguson, p.q. 2-16-4tc"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>, <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-16-4tc"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>, <mark>F</mark>. <mark>Ferguson</mark>, p.q. 2-16-4tc"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [706.78, 1318.8, 810.61, 1329.8], "bbox_id": "9e45107b31", "file": "AppomattoxNewspapers_1908-1909a_0382.pdf", "page": 1, "text": "L. F. Ferguson, p. q,"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, p. q,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [893.51, 1821.18, 966.12, 1828.68], "bbox_id": "bcd5b5663e", "file": "AppomattoxNewspapers_1922-1923a_0126.pdf", "page": 1, "text": "L f Ferguson p Q"}, "highlight": {"text": {"matched_tokens": ["L", "f", "Ferguson"], "snippet": "<mark>L</mark> <mark>f</mark> <mark>Ferguson</mark> p Q"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "f", "Ferguson"], "snippet": "<mark>L</mark> <mark>f</mark> <mark>Ferguson</mark> p Q"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.76, 1774.45, 1902.75, 1783.45], "bbox_id": "eac7fcb932", "file": "AppomattoxNewspapers_1926-1933a_0085.pdf", "page": 1, "text": "L F. Ferguson, p j. ow oiart,"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p j. ow oiart,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, p j. ow oiart,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1409.35, 986.37, 1572.39, 1032.61], "bbox_id": "033a363d9f", "file": "AppomattoxNewspapers_1912-1915a_0217.pdf", "page": 1, "text": "L. F. Ferguson, Oomr., will sell at auction on Oct. 1st, 1913, the Nowlin property on Piney Moun tain."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Oomr., will sell at auction on Oct. 1st, 1913, the Nowlin property on Piney Moun tain."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>, Oomr., will sell at auction on Oct. 1st, 1913, the Nowlin property on Piney Moun tain."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.8, 1625.62, 1875.68, 1686.02], "bbox_id": "3d4fff4bdc", "file": "AppomattoxNewspapers_1905-1912a_0322.pdf", "page": 1, "text": "L. F. Ferguson  Bro. have in their cold storage honse plenty of fresh ice, and will have plenty on hand at. all times this summer, and at prices lower than yon can afforcl to gather it. It"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have in their"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have in their"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.97, 1525.57, 1842.2, 1566.07], "bbox_id": "0d26f0fe5e", "file": "AppomattoxNewspapers_1905-1912a_0346.pdf", "page": 1, "text": "L. F. Ferguson  Bro. have good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon bay. 4-19-"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon bay. 4-19-"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon bay. 4-19-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.66, 1601.86, 1855.94, 1642.66], "bbox_id": "bf7b98b8cb", "file": "AppomattoxNewspapers_1905-1912a_0342.pdf", "page": 1, "text": "L. F. Ferguson  Bro. have good supply of Raw Bone Meal, anci High Grade Fertilizers. Go to see them before you buy. 4-19-tif"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have good supply of Raw Bone Meal, anci High Grade Fertilizers. Go to see them before you buy. 4-19-tif"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have good supply of Raw Bone Meal, anci High Grade Fertilizers. Go to see them before you buy. 4-19-tif"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.79, 792.14, 1858.52, 832.88], "bbox_id": "a63bc28eba", "file": "AppomattoxNewspapers_1905-1912a_0338.pdf", "page": 1, "text": "L. F. Ferguson  Bro. have a good supply of Raw Bone M?al, and High Grade Fertilizers. Go to see them before you buy. 4-19-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have a good supply of Raw Bone M?al, and High Grade Fertilizers. Go to see them before you buy. 4-19-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have a good supply of Raw Bone M?al, and High Grade Fertilizers. Go to see them before you buy. 4-19-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1857.68, 749.37, 2019.29, 790.11], "bbox_id": "dbc5fd85f8", "file": "AppomattoxNewspapers_1905-1912a_0334.pdf", "page": 1, "text": "L. F. Ferguson  Bro. have a good supply of Baw Bone Meal, and .htigh Grade Fertilizers. Go to see them before yon bny. 4-19-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have a good supply of Baw Bone Meal, and .htigh Grade Fertilizers. Go to see them before yon bny. 4-19-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. have a good supply of Baw Bone Meal, and .htigh Grade Fertilizers. Go to see them before yon bny. 4-19-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1739.46, 1745.52, 1899.34, 1784.77], "bbox_id": "8772636f2c", "file": "AppomattoxNewspapers_1922-1923a_0588.pdf", "page": 1, "text": "L. F. Ferguson  Bro. carries a large sti ck ot the best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. carries a large sti ck ot the best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. carries a large sti ck ot the best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1746.95, 1747.96, 1905.74, 1787.46], "bbox_id": "1ce576f10a", "file": "AppomattoxNewspapers_1922-1923a_0589.pdf", "page": 1, "text": "L. F. Ferguson  Bro. carries a large sti ck ot .he best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. carries a large sti ck ot .he best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  Bro. carries a large sti ck ot .he best brands of ammoniated goods. Pure raw bon  meal a special. 1-15 3w"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1546.08, 1686.9, 1707.13, 1727.85], "bbox_id": "0143252b00", "file": "AppomattoxNewspapers_1905-1912a_0326.pdf", "page": 1, "text": "L. F. Ferguson  B ra have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  B ra have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  B ra have a good supply of Raw Bone Meal, and High Grade Fertilizers. Go to see them before yon buy. 4-19-tf"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.45, 537.69, 2361.2, 680.32], "bbox_id": "c7460c4831", "file": "AppomattoxNewspapers_1943-1947a_0305.pdf", "page": 1, "text": "L. F. Ferguson  10-18-4 tc Hr. and Mrs. R. N. Daw-! Mrs  Davi   and Mrs. Ed j  gar Martin and daughter Came  I Jane, Archer and Martin Luther incy Scott, of Lynchburg Webb, Henry Ferguson, Mr. and week-end here. i i,TU_ J B Chilton, Miss Ciarkie 1 Cheatham, Elliott a nd Aubrev Harvey is expected home Cheatham, from Fort Bragg, N. C., rning from overseas. i Mrs. W. P. Ferrell and Miss Beu- lah Ferrell .spent Sat vday in arguerite Gilliam spent Roanoke, where they visited Mrs. i Lynchburg. Ferrells mother, Mrs. Crouch, who! Mrs. W. L. Farmer are s - r in Lynchburg, where purchased a home."}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  10-18-4 tc Hr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "<mark>L</mark>. <mark>F</mark>. <mark>Ferguson</mark>  10-18-4 tc Hr. and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1958.4, 1230.54, 2117.85, 1289.78], "bbox_id": "a4b80d316e", "file": "AppomattoxNewspapers_1915-1918a_0535.pdf", "page": 1, "text": "l at u e n sv a p e s I-  - - - - - I pomattox. and that a copy he posted at the I front door of the courthouse oil this oounty on the ath day of May, W18. that hslng th next succeeding rule day after this order was catered. _ . A cojy-Teste s n nuBDuaij by O W Smith, DC L F Ferguson and r"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "O W Smith, DC <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> and r"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "O W Smith, DC <mark>L</mark> <mark>F</mark> <mark>Ferguson</mark> and r"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2411.99, 763.64, 2536.3, 1199.64], "bbox_id": "35a1ec6b2b", "file": "AppomattoxNewspapers_1939-1943a_0582.pdf", "page": 1, "text": "JOMMONWEAIiT In the Clerks uit Court of the lattox -on the 20t er. 1943.  H. M. Burge, gainst Mabel Johns McHE hns, Thomas Johitii hns, Defendaffl The object of this4! ibje.-t a 2 3-4 acrg rned by John A. Jptf 3 death to partitioim? ct said lands to itel . Burge. And an affidavit ide and filed that tS Sam D. Johns, Thoml Lelia Johns, are not rei State of Virginia, it is? they do appear within h ter duepublication he what may be neceasan their interests in this 1 i further ordered tha hreof be publiahed on for four aucoeaaiva wai Times-Virginlan, a near liahed in tne County of . that a copy b posted door of the Courthouse County on or before the j October, 1943, that beiiT succeeding Rule day aftei was entered, and that mail a copy hereof to  said defendants to the address given in the affll in and file a certificate  In the papers of this os A CopyiT.ite n W Smith, Geo. Abltt Jr. and L F. Ferguson, y 9-23-4te"}, "highlight": {"text": {"matched_tokens": ["L", "F", "Ferguson"], "snippet": "Geo. Abltt Jr. and <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, y 9-23-4te"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "Ferguson"], "snippet": "Geo. Abltt Jr. and <mark>L</mark> <mark>F</mark>. <mark>Ferguson</mark>, y 9-23-4te"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2010.94, 994.56, 2172.09, 1545.83], "bbox_id": "489aa09baf", "file": "AppomattoxNewspapers_1926-1933a_0390.pdf", "page": 1, "text": "Joel Hubbard vs Annie H. King and others. Commissioners Office, Appo mattox, Virginia, April 15th, 1929. ToJoel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound mind, Grade H. Hubbard. Robert C. Hubbard, W. C. Hubbard, the last three being infants under 21 years of age, L. F- Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, and C. W. Smith, Admr. of W. C. Hubbard, Sr., de ceased plaintiff and defend ants in the above suit. You are hereby notified that I have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H as the place for taking the sever al accounts in the above styled suit, ordered by the decree therein of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to take said account said Commission er shall give notice to all par ties to this suit of the time and place of faking said account by publication thereof for four weeks in some newspaper pub lished in Appomattox county, which notice shall be equiva lent to personal service of such notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery. 4-18-4t"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2328.03, 536.59, 2488.29, 1089.09], "bbox_id": "6dc9728f32", "file": "AppomattoxNewspapers_1926-1933a_0388.pdf", "page": 1, "text": "Joel Hubbard vs Annie H. King and others. Commissioners Office, Appo mattox, Virginia, April 15th, 1929. ToJoel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound mind, Grade H. Hubbard. Robert C. Hubbard, W. C. Hubbard, the ast three being infants under 21 years of age, L. F. Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, andiC. W. Smith, Admr. of W. C. Hubbard, Sr., de ceasedplaintiff and defend ants in the above suit. You are hereby notified that I have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H., as the place for taking the sever al accounts in the above styled suit, ordered by the decree therein of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to -take said account said,Commission er shall give notice to all par ties to this suit of the time and place of taking said account by publication thereof for four weeks in some newspaper pub lished in Appomattox county, which notice shall be equiva lent tp personal service of such notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery. 4-18-4t"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [874.09, 528.51, 1033.04, 1080.73], "bbox_id": "cd77f2832e", "file": "AppomattoxNewspapers_1926-1933a_0387.pdf", "page": 1, "text": "Joel Hubbard vs Annie H. King and others. Commissioners Office, Appo mattox, Virginia, April 15th, 1929. ToJoel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound mind, Grade H. Hubbard. Robert C. Hubbard, W. C. Hubbard, the ast three being infants under 21 years of age, L, F- Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, and C. W. Smith, Admr. of W. C. Hubbard, Sr., de ceasedplaintiff and defend ants in the above suit. You are hereby notified that I have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H., as the place for taking the sever al accounts in the above styled suit, ordered by the decree therein of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to take said account said Commission er shall give notice to all par ties to this suit of the time and place o f taking said account by publication thereof for four weeks in some newspaper pub lished in Appomattox county, which notice shall be equiva lent to personal service of such notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery. 4-18-4t"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [906.48, 762.19, 1063.59, 1312.41], "bbox_id": "0b77956d01", "file": "AppomattoxNewspapers_1926-1933a_0386.pdf", "page": 1, "text": "Joel Hubbard vs Annie H. King and others. Commissioners Office, Appo mattox, Virginia, April 15th, 1929 ToJoel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound mind, Gracie H. Hubbard. Robert C. Hubbard, W. C. Hubbard, the ast three being infants under 21 years of age, L. F- Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, and C. W. Smith, Admr. of W. C. Hubbard, Sr., de ceasedplaintiff and defend ants in the above suit. You are hereby notified that I have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H., as the place for taking the sever al aqcounts in the above styled suit, ordered by the decree therein of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to take said account said Commission- er shall give notice to all par ties to this suit of the time and place of taking said account by publication thereof for four weeks in some newspaper pub lished in Appomattox county, which notice shall be equiva lent to personal service of such notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery. 4-18-4t"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery. 4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [904.29, 739.21, 1061.65, 1288.73], "bbox_id": "76a5b85663", "file": "AppomattoxNewspapers_1908-1909a_0386.pdf", "page": 1, "text": "Joel Hubbard vs Annie H. King and others. Commissioners Office, Appo mattox, Virginia, April 15th, 1929 To Joel Hubbard ,Annie H. King, Dolly H. Downey, a person of unsound  mind, Gracie H. Hubbard. Robert C. Hubbard, W. C. Hubbard, the ast three being infants under 21 years of -age, L. F Fergu son, gurdian ad litem for said Dolly H. Downey and said in fants, and  . W. Smith, Admr. of W. C. Hubbard, Sr., de ceasedplaintiff and defend ants in the above suit. You are hereby notified that 1 have fixed upon Monday the 20 th day of May, 1929, at 9 a. m., as the time, and Clerks office at Appomattox C. H., as the place for taking the sever al accounts in the above styled suit, ordered by the  decree thereih of April term, 1929, to- wit FirstThe liens upon said real estate mentioned in these proceedings by whom held, their respective amounts and priorities. SecondSuch other mat ters, as any party in interest may require or to said Com missioner may deem pertinent. Before proceeding to take said account said Commission er shall give notice to all par ties to this suit of the time and place of taking said account by publication thereof for four weeks in some newspaper pub lished in Appomattox county, whiph notice shall be equiva lent to personal service of such notice. Given under my hand the date above. L. F. FERGUSON, Comr. in Chancery.  4-18-4t"}, "highlight": {"text": {"matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery.  4-18-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "F", "FERGUSON"], "snippet": "hand the date above. <mark>L</mark>. <mark>F</mark>. <mark>FERGUSON</mark>, Comr. in Chancery.  4-18-4t"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
