{"document": {"bbox": [1991.31, 744.63, 2485.56, 793.98], "bbox_id": "c8903b47c6", "file": "AppomattoxNewspapers_1939-1943a_0443.pdf", "page": 1, "text": "N. R. Featherston.  l , .? ? ?  ?  S t  ., daughboysTlp1  V 1  is take the chill off the A n t t S T V  want,nff a hu ot a Are to era Ireland, shows u f S sridierat thJaPhi taen somewhere in North- flll up their buckets. S3ia,cr- at be coal pile awaiting their turn to"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "l"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>.  <mark>l</mark> , .? ? ?  ?  S t  ., daughboysTlp1  V"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "l"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>.  <mark>l</mark> , .? ? ?  ?  S t  ., daughboysTlp1  V"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.54, 967.0, 1704.53, 1134.0], "bbox_id": "0a711d2c2e", "file": "AppomattoxNewspapers_1922-1923a_0110.pdf", "page": 1, "text": "Saturday the Appo- jjboya defeated their i Red Houne iu  one jiiD9 by score of 20 to 2 Hair grounds. Ill Turnes has just re- tin Hot Springs,V a., ie spent several days l brother. N. R Featherston .Wheeler left Tues  Covesvil.e, to attend lieauon of Presbytery"}, "highlight": {"text": {"matched_tokens": ["l", "N", "Featherston"], "snippet": "ie spent several days <mark>l</mark> brother. <mark>N</mark>. R <mark>Featherston</mark> .Wheeler left Tues  Covesvil.e,"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "N", "Featherston"], "snippet": "ie spent several days <mark>l</mark> brother. <mark>N</mark>. R <mark>Featherston</mark> .Wheeler left Tues  Covesvil.e,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [471.1, 303.17, 632.75, 570.47], "bbox_id": "8a808994b1", "file": "AppomattoxNewspapers_1933-1936a_0114.pdf", "page": 1, "text": "S. A. Ferguson, for many years a well known citizen of Appomatt ox, passed away Friday, August 24, at his home at the old court house. He was a son of. the late Jarrett and Judith Paris Ferguson. Funeral services were conducted from the family residence and were in charge of his pastor, the.Rev. W. M. Thompson, assisted by the Rev. C. W. McElroy, of Norton. Mr. Ferguson rail been a con sistent member of Liberty Baptist Church for some thirty years. The presence of a large number of fr iends and the many beautiful flow ers witnessed the high esteem in which he was held. He is survived by his widow, Mrs. Bc 3 sie Rosser Ferguson, and two daughters, Mrs. Charles Allen Cart er, of Tower Hill and Mrs. Guy L. Furr, of Bluefield, W. Va. The active pallbearers were Dan and Boyd Ford, James Hamilton, Cleveland Paulette, Edward Hamil ton and R. E. Fitzgerald. Honorary pallbearers were N. R. Featherston, R. L. Burke, Edward OBrien, Cabel Carter and R. H. Abbitt."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "Fitzgerald. Honorary pallbearers were <mark>N</mark>. R. <mark>Featherston</mark>, R. <mark>L</mark>. Burke, Edward OBrien, Cabel"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "Fitzgerald. Honorary pallbearers were <mark>N</mark>. R. <mark>Featherston</mark>, R. <mark>L</mark>. Burke, Edward OBrien, Cabel"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.59, 1521.01, 2049.55, 1688.71], "bbox_id": "513572331e", "file": "AppomattoxNewspapers_1943-1947a_0114.pdf", "page": 1, "text": "On December 4th, 1943, W. H. Ragland passed awigy in the 8Srd year of his age. Mr. Ragland spent his young days in the old Surren der House at Old Appomattox Court House. He went west in the SOs, living in Indian Territory, Texas, and Arkan s. His latter days were spent in Raleigh, North Carolina. He is survived by two sons, Edmund and Trent Ragland, of Raleigh, N. C., and one daughter, Mrs. Gregory of Little Rock, Arkansas two sis ters, Mrs. Mattie Troy, of Louis iana. and Mrs. Ella Leslie, of Tex as. He was the uncle of Misses Em ily and Pattie Feathersto l and N. R. Featherston, of Appomattox."}, "highlight": {"text": {"matched_tokens": ["l", "N", "Featherston"], "snippet": "ily and Pattie Feathersto <mark>l</mark> and <mark>N</mark>. R. <mark>Featherston</mark>, of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["l", "N", "Featherston"], "snippet": "ily and Pattie Feathersto <mark>l</mark> and <mark>N</mark>. R. <mark>Featherston</mark>, of Appomattox."}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1851.88, 528.74, 2023.83, 1017.53], "bbox_id": "66433a2a9c", "file": "AppomattoxNewspapers_1939-1943a_0422.pdf", "page": 1, "text": "He is survived by his widow, Mrs Ella Walton Jamerson, and the fol lowing children Mrs. E.S.Meanley, of Toana, Mrs. Thomas W. Fergu son, Mrs. Hugh Martin and Miss Mary Jamerson, of Appomattox, and R . W . Jamerson, J . E . Jamerson, and Raymond Jamerson,  f Appo mattox and W . Russell Jamerson, of Arlington, one brother, B .T . Jam erson, of Pamplin, and one sister, Mrs. McFadden, of Lynchburg Funeral services were conducted from, the home at 3 oclock Sunday afternoon, BY his pastbr,.the Rev, H. Frederick Jones, assisted by the Rev erends R . E . Redding, W . R . Reed, and W . M. Black. Interment was in Liberty Cemetery. Active pallbearers were Walton, Everett, Bussell and Raymond Jamerson, Tom Ferguson and Hugh Martin. Honorary pall bearers were B. G. Anderson, R. L. Burke, J . A. burke, Henry Ee-rd, J.A.Bingham, H .M.Burg, G. B . Buchanan, Leonard Carter, C. C. Cralle, J.. W. Cawthon, Dr. D. A. Christian, Elliott Cheatham, Wil lie Carter, W . B . Caldwell, Robert Dillon, J. C. Davidson, W.W.God- sey, Bernard Ferguson, L .F . F er guson, Lewis Ferguson, Ernest Fer guson, N. R. Featherston, Dr. L. L . Gayle, A . R . Harwood, C , C. H, rvey, Frank Irving, A. T. Inge, Ernest Jamerson, Dr. C.F.Jam es, W. J. LeGrand, C.S. T.IcDearmon, Wilbup McDearmon, Lewis Marlin, Bennie Massey, Don Moses, C. T7 Mos s, T. W. Moses, F .L . Martin, Gordon Millner, F .L . Murphy. 0 . W . Martin, W . T . Mayberry, J  H OBrien, T.W . Odor, II. C. Pulliam, C.H. Pulliam, J.K . Pulliam, R.F. Ramsey, Grover Smith, L..E. Smith, Guy Smith, C. W. Smith, LeRoy Smith, M .C. Smith, E. H. Smith, R . W. Stanley, D . E. Torrence, E. L. Upton, John Webb, C.E.W hit aker. We extend sympathy to the be-, reaved family."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L", "L"], "snippet": "Ferguson, Ernest Fer guson, <mark>N</mark>. R. <mark>Featherston</mark>, Dr. <mark>L</mark>. <mark>L</mark> . Gayle, A . R"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L", "L"], "snippet": "Ferguson, Ernest Fer guson, <mark>N</mark>. R. <mark>Featherston</mark>, Dr. <mark>L</mark>. <mark>L</mark> . Gayle, A . R"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [494.65, 711.82, 825.03, 829.43], "bbox_id": "75e9370c39", "file": "AppomattoxNewspapers_1933-1936a_0319.pdf", "page": 1, "text": "LARD dinner Tuesday evening in honof oi Mrs. Jennie Parrish, of Roanoke. Her guests included Misses Emily and Mary Featherston and N. R. Featherston. Lt. J. L. OBrien, of Marion, is spending his vacation with F. A. OBrien. Haddon Dudley, of Richmond will spend this week end here. Mrs. C. W. Potts, of Lynchburg, spent the week end with Mrs. Lottie"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "and Mary Featherston and <mark>N</mark>. R. <mark>Featherston</mark>. Lt. J. <mark>L</mark>. OBrien, of Marion, is"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "and Mary Featherston and <mark>N</mark>. R. <mark>Featherston</mark>. Lt. J. <mark>L</mark>. OBrien, of Marion, is"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1756.04, 1173.9, 1928.43, 1221.89], "bbox_id": "3c362d3e89", "file": "AppomattoxNewspapers_1943-1947a_0441.pdf", "page": 1, "text": "In addition to Mr. Abbitt, among hose attending from Appomattox p erL 5 ! ? at?r Chas T Mees, G. p TAb-bltt Jr-, Judge J. W. Flood, K. L. Burke and N. R. Featherston."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "J. W. Flood, K. <mark>L</mark>. Burke and <mark>N</mark>. R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "J. W. Flood, K. <mark>L</mark>. Burke and <mark>N</mark>. R. <mark>Featherston</mark>."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2142.45, 1051.39, 2312.7, 1215.24], "bbox_id": "a3fb68ee26", "file": "AppomattoxNewspapers_1939-1943a_0350.pdf", "page": 1, "text": "Honorary pallbearers were W. W. Thornhill, S. N. Thornhill, J. H. Rey nolds, J. P. Coleman, C. A. Carter and F. J. Smith, deacons of Liberty Chapel Baptist church and Lewis Morgan, John Morgan, Ernest Mor gan, A. T. Pearson, Rev. W. A. Haw ley, Rev. E. R. Ferguson, Rev. J. S. Rushing, Rev. J. S Cbb, Rev. T. P. Reynolds, Rev. W. M. Black, Judge Jo-1 Flood, R L. Burke, Jerry Burke, Dr. D. A. Christian, Dr. C. G. OBrien, T. H. Roberson, C. W. Smith, Dr. Chas. F. James, H. M. Burge, W. M. Morris, L. J. Morris, J. C. Lee, F. A. OBrien, C. L. Cole man, N. R. Featherston, Chas. T. Moses and E. LeRoy Smith."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "F. A. OBrien, C. <mark>L</mark>. Cole man, <mark>N</mark>. R. <mark>Featherston</mark>, Chas. T. Moses and"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "F. A. OBrien, C. <mark>L</mark>. Cole man, <mark>N</mark>. R. <mark>Featherston</mark>, Chas. T. Moses and"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [846.22, 543.35, 998.22, 576.15], "bbox_id": "d8e270a977", "file": "AppomattoxNewspapers_1915-1918a_0258.pdf", "page": 1, "text": "Best Gaited Saddle Horse 1st, Prof. L Crawley 2nd, N R Featherston 3rd, R L Burke."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston", "L"], "snippet": "Best Gaited Saddle Horse 1st, Prof. <mark>L</mark> Crawley 2nd, <mark>N</mark> R <mark>Featherston</mark> 3rd, R <mark>L</mark> Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston", "L"], "snippet": "Best Gaited Saddle Horse 1st, Prof. <mark>L</mark> Crawley 2nd, <mark>N</mark> R <mark>Featherston</mark> 3rd, R <mark>L</mark> Burke."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.53, 267.4, 1773.18, 1764.4], "bbox_id": "d1f7f47b98", "file": "AppomattoxNewspapers_1902-1905a_0454.pdf", "page": 1, "text": "acres, exchange. C. E. Lewis to,Nel8on Bocock 53 acres, exchange and 117. C. H. iSarkill, comr to Crawford H. Going, 280 acres, 240. R. B. Cralle c.. trustees to Farm ville Bldg.  Tr. Co., 26 acres, 125. Reuben Brown to J. B. Shearer, 12 acres, 250. E. W. Gilliam, c. to H. E. Gil liam, 319 acres, 10Q0. J W. Flood c. to T. B. Scruggs, 54 acres, 126. T. B. Scruggs to W. D. Sandidge, 202 acies, 600. W. J . Martin to T. W. Oder And Robt. Irvey, 3 acres, 135. Altert Thornhills Heirs to Thos. Chambers, 158 acres 400. Madison Cyrus to O. S. Cyrus, 101 acres, 400. Madison Cyrus to S. A. Cyrus. 50 acres, 500. Madison Cyrus to D. H. Cyrus, 50 acres, 500. J. M. Dnrphey to 8. E. J. Bur- ford, lot 11-16, 1625. Wm. W. Wright to Elizabeth S. Wright, 57 acres, 100. Annie H. Bocock to Ellen Morgan, 100 acres. 500. M. P. See c. to Flood and Fer guson 805 acre-, 800. Emeline Cheatham c. to T. S. Ferguson, 6 acres, 15. Etna Iron  M. Co. to E. M. Schaefer 115 acres, 2500. Wm. A. Miller to E. C. Marshall, 319 acres, 747.23. J. H. Robertson to Henry Jack- son, 5 acres, 150. J. M. Abbott to Henry Jackson, 5 acres, 1500. C. Wiley Tucker to E. E. Chism, 2 acres, 135. Jos. R. Abbitt to Obey Mann, 100 acres, 200. Robert Meadows to Marion Mose ley, 30 acres, 91.20. C. P. Marshall to C. H. See, 31 acres, 120. R. C. Maun to Z. N. Harris, 8 acres, 175. Saml Worley to Mary D. Worley, 11 acres. . aunders F. Wright to Fannie B. Wooldridge, 120 acres, 500. W. Q. Ligon to H. Ai. Marshall, 19 acres,1200. R. H. Purdum to Joel T. Caw- thorn, trustee for Liberty Church 3 acres, 93. Juo. W. Fvans to J. Hudson Cheatham, 11 acres, 200. Samuel A. Glover, c. to Thos. W. Moses, 4 acres, 40. J. R. Caldwell to Chas. Glover, 100 acres 280. F. C. Moon Comr to Eugene M. McCormick, 40 acres, 250. Farmers Exchauge to C. W. and C. A. Hancock, store and lot 2000. Nina E. Jones to J. C. Jones, 277 acres, 3000. J. C. Jones to Jno. Wilson Dur- rum, 277 3000. W. A. Durrum to Ann R, Dur- rum, 17 acres 207. W. E. Moo e to Peyton Vf. Calla- ham, 81J acres, 170. A. B. Scruggs to T. E. Fwen, 100 acres, 400. Sallie M. Featherson to H. R. Feathe stou, 305 acres, 1500. T. E. Oweus to L. S. and T. . Do s, 30 acres, 200 Lucv F. Caris to Jane E. Coleman, 75 acres, 375. Mattie W. Harvey to Ja-e E Coleman, 106 to 250.  - Jno. S. Davis to Jas. D. McDear- man Va a lot, 75. N. ii Featherston to Monroe L. Garrett, 201 acres, 900. J. A. Cheatham to School trustee South3ide and Court House,  acre, 37. H. F. Venable to School trustee Southside, 1 acre, 3. R. S. Burke to R. F. Burke acre iots, 595. Thos. H. Paris, trustee to Hun er M. Moore, 167 acres, 1400. C. S Morton, to S. W. Thornton 5 acres, 35. Flora E. and L, D. Th rntoir to S. W. Thorn cn, 39 acres aud 2 lots, Saml H. Gordou to W. Scott Thomas, 25 acres, 90. M. S. Davidson to D. T. Wool dridge, 50 acres, 350. T. W. Moses to D. T. Wooldridge 25 acres, 250 B. W. Bocock Comr io H. D. Johnson, lOaces, 78. Wm. Patteson to H. D. Johnson, 29 acres, 60. Jno. L. Davis and wife to W. E, Wooldridge c. 20 acres. Jno. L. Davis to Wesley Chapel Lruste l i acres, gift. A. B. Hoarman to J. W. Nash Jno. R. Phelps Heirs to 8. E and W. A. Wills, 50 acres, 100. A. A. White to Clifford Beck, 10 acres. 180. G. A. J. Pennell to Geo. W, Thomas, 19 acres, 200 G. W. W, Thomas to Oueida Lhomas 19 acres. Signora P. Fore to M. E. Agee 163 acres. S. S. and Elma Coleman c. to H. W. McKinney,  lot, 1200. J. R. Horsley Comr to Eliza Wright, 5 acres, 100.  E P. Evans Est. to N.  W. Ry. Co. 365-1000 acres, 260. A nna Staples Est. to N.  W. Ry. Co. 283-1000 acre, 100. B. W. Bocock Comr to D. M. Anderson 24 acres, 72. E. M. Schaefer to W. B. Sampso n 104 acres, 5. C. W. Hunter, Jr. trustee to N.  W. Ry. 17-100 acre, 15. N. C. Manson, Jr. Comr to Jos. O OBrien, 260 acres. 5455. John Reid to N.  W. R. R. Co. lot 1 acre, 400. C. W. Hunter to Sallie McKinnev"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "Va a lot, 75. <mark>N</mark>. ii <mark>Featherston</mark> to Monroe <mark>L</mark>. Garrett, 201 acres, 900."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "Va a lot, 75. <mark>N</mark>. ii <mark>Featherston</mark> to Monroe <mark>L</mark>. Garrett, 201 acres, 900."}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1210.95, 520.6, 1366.3, 1212.4], "bbox_id": "c3014b37d6", "file": "AppomattoxNewspapers_1918-1922a_0402.pdf", "page": 1, "text": "The State Board of Education an nounced the election of sixty-four di vision school superintendentsthese having no opposition. Elections were made for all the cities except Alex andria, Danville and Newport News. There is a single applicant for Dan ville, and the -passing of the city is a surprise. C. E. Crossland, president of Averett College, is understood to be the choice ot certain persons. Dr. Crossland and the trustees of his col lege are said to bare suffered a mis understanding over the question of dancing, and it is reported that he may resign. His friends are now urg ing that he be made superintendent of schools. Following aro the elections as an nounced Accomac, G. C. Joynes, Onancook Albemarle, A. L. Bennett, Charlottes ville Arlington, Fletcher Kemp, Rosslyn Alleghany, J. G. Jeter, Cov ington Amelia, W. R. Wrlggles- worth, Blackstone Amherst, W. L. Tucker, Amherst Appomattox, N. R. Featherston, Pamplin Augusta, F. M. Somerville, Staunton, R. F. D. 6 . Bedford, C. M. Abbot, Bellevue Botetourt, E. A. Fainter, Fincastle Brunswick, W. B. Balen tino, Raw lings Buchanan, M. L. Combs, Grundy. Charles City, Herman L. Harris, Toano Charlotte, E. H. Hall, Drakes Branch Clarke, L. D. Kline, Win chester. Dinwiddle, O. B. Zehmer, Dinwid dle. Elizabeth City, J. H. Brent, Hamp ton Essex, W. G. Rennolds, Center Cross. Fauquier, F. Osgood Smith, Wart renton Franklin, R. A. Prlllamn, Rocky Mount. Giles, R. H. Farrier, Newport Grayson, Lyle T. Cox, Independence. Halifax, H. J. Watkins, South Bos ton Hanover, J. Walton Hall, Ash land Henrico, A. C. Cooper, Rich mond, Henrico Courthouse Henry, W. B. Gates, Martinsville Highland, R. E. Mauzy, Hlghitown Isle of Wight, Gavin Rawls, Carrsville. Lancaster, Frank W. Lewis, Morat- tico Loudoun, O. L. Emerick, Pur- cellville. Mecklenburg, C. B. Green, Boyd ton. Nelson, W. E. Kidd, Lovingston Norfolk, James Hurst, Norfolk. Prince Edward, T. J. Mcllwaine, Hampden-Sidney Prince William, Woodstock -Smyth, B. E. Copenhaver, Pulaski, E. L. Darst, Dublin. Rappahannock, H. D. Hite, Front Royal Roanoke, R. E. Cook, Salem Rockbridge, R. M. Irby, Lexington Rockingham, John C. Myers, Harri sonburg Russell, R. N. Anderson, Le banon. Shenandoah, C. V. Shoemaker, Woodstock Smyth, B. E. Copenhaver, Marion Southampton, R. M. Newton,"}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "worth, Blackstone Amherst, W. <mark>L</mark>. Tucker, Amherst Appomattox, <mark>N</mark>. R. <mark>Featherston</mark>, Pamplin Augusta, F. M."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "worth, Blackstone Amherst, W. <mark>L</mark>. Tucker, Amherst Appomattox, <mark>N</mark>. R. <mark>Featherston</mark>, Pamplin Augusta, F. M."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [224.42, 376.99, 390.13, 754.53], "bbox_id": "8d4d541495", "file": "AppomattoxNewspapers_1933-1936a_0012.pdf", "page": 1, "text": "Mrs. Ida Morris is visiting her sister, Mrs. Lovella Morris.    W. T. Steele, of Farmville, spent the week-end at his home here. m   Miss Leila Inge who has been teaching at Appalachia, is spending her vacation here.    Harold Puckette,, of New port News, spent a few days with Robert Hubbard last week    Mrs. Helen Welch left yes terday to spend several days in Charlottesville.    Miss Mary Featherston has returned after visiting her aunt Miss Emily Featherston, in Roanoke.    Mrs. E. W. Gilliam, of Hix- burg, spent Monday with her sister, Mrs. N. R. Featherston.    Mr. and Mrs. L. D. Puckett, of Roxboro, N. C, are visiting relatives here this week.    Mrs. Troy, of Texas, spent the week-end in the home oi N. R. Featherton."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "with her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>.    Mr. and Mrs. <mark>L</mark>. D. Puckett, of Roxboro,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "with her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>.    Mr. and Mrs. <mark>L</mark>. D. Puckett, of Roxboro,"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [545.49, 192.88, 702.58, 357.73], "bbox_id": "68f43db40a", "file": "AppomattoxNewspapers_1918-1922a_0152.pdf", "page": 1, "text": "D. Flood, C. J . Harding, J . R. Horsley, Jos. Button, T. C_ Stratton, N. R. Featherston, D. A. Conner, L. F. Ferguson, W. B. Caldwell, C. W. 8mith, A. H. Clement, W. L. Brown, E L. Smith, R. L. Burke, F. L. Martin, B. W. Babcock, J A . Burke, 8. L. Ferguson, T. A Walton, L. F. Call-aham, J . W. Carter, E. P. Sears, L N Lig on, L. M. Drinkard, W. R Brightwell, E. E. Gills, J . K. Megginson, T. J. Hix."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "Button, T. C_ Stratton, <mark>N</mark>. R. <mark>Featherston</mark>, D. A. Conner, <mark>L</mark>. F. Ferguson, W. B."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "Button, T. C_ Stratton, <mark>N</mark>. R. <mark>Featherston</mark>, D. A. Conner, <mark>L</mark>. F. Ferguson, W. B."}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [301.19, 556.09, 505.29, 1792.27], "bbox_id": "92ebb039d2", "file": "AppomattoxNewspapers_1926-1933a_0183.pdf", "page": 1, "text": "Sixty-four delegates, with a fourth of a vote each, were elect ed to attend the state democratic convention in Roanoke on June 21, Governor Byrds program, including the proposed amend ments to the constitution, was endorsed and achievements of Senator S. L. Ferguson and Dele gate Albert Terrell in the Gener al Assembly were commended at a mass meeting of democratic voters last Friday. Don Moses, chairman of the county democratic committee called the meeting to order anc Senator Ferguson was elected chairman of the meeting while C. W. Spnith was chosen as its secretary. A resolution proposed by Mr. Smith and unanimously adopted provided that 64 delegates with a fourth vote vote each be sent to Roanoke that the chairman of the meeting appoint a com mittee of three, one from each magisterial district, to nominate these delegates that the dele gates from the county vote as a unit at the convention easting their ballots as a majority of them might determine and that those present at the convention cast the entire vote of the dele gation. Joel Flood introduced a reso lution expressing appreciation of the able representation given the county in the house of delegates by Colonel Terrell and commend ing him particularly for his ad vocacy of a change in the  nieth- od of gasolene tax distribution which would be more fair to the poorer counties in the state than the method now in use. J. R. Horsley introduced a resolution in which he praised Senator Ferguson for his activi ties representing the county in the state senate and both of these resolutions were unanimously adopted. , Senator Ferguson introduced following resolutions Whereas, the voters of Ap pomattox county are happy to have with us to-day, Governor Byrd, who will explain to the voters of. our county, the consti tutional amendments, to be voted on at the special election, to be held on June 19. Now, Therefore, Be It Re solved That we commend the fair and forceful campaign our governor is making, for which too much praise and commenda tion cannot be given. His high character and ability has reflected itself in his splendid administra tion. In a word, he has proven himself to be a great Virginian, and a matchless leader. Be it further resolved That we are in thorough accord with the far-sighted, broad-minded progessive and economic policies which he has advocated, and which have been written into the law of our state, which now stands in the front rank of the Union. Delegates to the Roanoke con vention were chosen from the various precincts as follows and the report of the nominating committee was adopted without a dissenting vote Courthouse S. L. Ferguson, R.L. Burke, H. W. McKinney J. A. Bingham, Charles F. Han- enkrat, W. F. Woolf oik, H. L. Spencer, B. W. Babcock, L. F. Ferguson, S. L. Ferguson, Jr., C. T. Moses, N. A. Wagers, W L. Brown, E LeRoy Smith, W L. Ould, J. E. Sears, N. B Featherston, Don Moses, H. G Johnson, C. T. Evans, D. A Connor, H. 8. Coleman, W W Woodson. R. F. J amer son."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "E LeRoy Smith, W <mark>L</mark>. Ould, J. E. Sears, <mark>N</mark>. B <mark>Featherston</mark>, Don Moses, H. G"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "E LeRoy Smith, W <mark>L</mark>. Ould, J. E. Sears, <mark>N</mark>. B <mark>Featherston</mark>, Don Moses, H. G"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2265.3, 1097.49, 2586.53, 1253.98], "bbox_id": "b330404af0", "file": "AppomattoxNewspapers_1908-1909a_0498.pdf", "page": 1, "text": "Ferguson, Jr., C. S. McDear- mon, J.- R. Horsley, Calvin H. Robinson, Joseph Button, L. F. Ferguson, W. L. Brown, W. T. Steele, N. JL Featherston, 3E- LeRoy Smith, G. F. Abbitt, Jr, H C. Pulliam, T, J. Ugon, J. A. Bingham, C. T, Moses R. F. CHAP, June 1.-Visitors inJjamerson, A. H._ClemenV Ry- ty. Sunday were, Mr. and Mrs. I Alfred fiOBrien, J. W. Caw- Wagner, of Appomattox, Mr8thorn, Jr, J. W. Carter, J. D. Bolly and little daughter. I Ferguson, D. A. Conner, R. H. Mrs. Luther Foster andwo Thornhill, Dr. D- A iaS sons, Bill and Lyle, spent Tues-IW. W. Carter, J. H. Elder, R."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "L. F. Ferguson, W. <mark>L</mark>. Brown, W. T. Steele, <mark>N</mark>. JL <mark>Featherston</mark>, 3E- LeRoy Smith, G."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "L. F. Ferguson, W. <mark>L</mark>. Brown, W. T. Steele, <mark>N</mark>. JL <mark>Featherston</mark>, 3E- LeRoy Smith, G."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2428.79, 476.14, 2622.26, 1474.23], "bbox_id": "616a35c329", "file": "AppomattoxNewspapers_1926-1933a_0498.pdf", "page": 1, "text": "Featured by a ringing en dorsement of former governor iarry Flood Byrd for the Dem- ocatic presidential nomination, and the mention of Senator lamuel L. Ferguson as an ideal candidate for the governorship of Virginia, Democrats of Ap pomattox county met here yes terday afternoon in annual mass meeting. Called to order by chairman Don Moses, the Democrats lost io time in getting down to bus- ness. Mr. Moses and C. W. hnith, secretary, were made lermanent officers. C. W. Imith introduced  motion as égards methods of selection of ounty delegates to thé state ionvention and a committee was named to present a list of nominations. -- Senator Ferguson was recog nized and read a resolution en dorsing Byrd for the presiden- - cy. The resolution was unani- , . mously adopted. Resolutions . were then presented commend ing the administration of Gov- arnor Pollard, the record of Senator Ferguson, of delegate A. J .Terrell, of the United States senators and represen- tlves of Virginia, and of the ounty officials of Appomattox. J. A. Burke added an aitiend-  ment to the resolution lauding. Senator Ferguson, to commend lim to the Democrats of Vir ginia as the ideal candidate for the governorship. Applause greeted this amendment and it was adopted by a standing vote, f. Ç. Cawthorn, Jr., added an amendment to t h e resolution ommending the county officers o include the splendid service of Judge Robert Hutchinson. The delegation to the state convention will consist of forty- sight, with one-fourth of a vote sach. They will vote as a unit. R. L. Burke was named chair man of the delegation, with Don Moses as assistant. The state convention meets June 9, in the Mosque, Richmond. The list of delegates follows S. L. Ferguson, J. W. Flood, R. L. Burke, H. W. McKinney, J. H. OBrien, C. W. Smith, J. A. Burke, W. M. Abbitt, S. L. Ferguson, Jr., C. S. McDear mon, J. R. Horsley, Calvin H. Robinson, Joseph Button, L. F. Ferguson, W. L. Brown, W. T. Steele, N. JR- Featherston, E- LeRoy Smith, G. F. Abbitt, Jr., H C. Pulliam, T. J. Ligon, J. A. Bingham, C. T. Moses R. F. J amers on, A. H. Clement, Ry- land M. Mann, F. T. Guill, R. Alfred fiOprien, J. W. Caw- Uhorn, Jr., J. W. Carter, J. D. erguson, D. A. Conner, R H. Thornhill, Dr. D. A. Christian, W. W. Carter, J. H. Elder, R. B. Steele, W. W. Scott, Don Moses, M. H. Marks, Miss M. Anna Jones, Mrs. Ned A. Wag ers, Miss Eula May Burke, Miss Cornelia K. Gills, Mrs. Frank Dreseer, Miss Earle Patteson Mrs. Anna P. Flood, Miss M. Virginia Smith. The resolutions endorsing Byrd, follow We, the Democrats of the county of Appomattox, in mass meeting assembled, embrace this occasion to voice our unit ed endorsement of Hon. Harry Flood Byrd, former Governor of Virginia, as stalndard bearer of the Democratic paty in the"}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "L. F. Ferguson, W. <mark>L</mark>. Brown, W. T. Steele, <mark>N</mark>. JR- <mark>Featherston</mark>, E- LeRoy Smith, G."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "L. F. Ferguson, W. <mark>L</mark>. Brown, W. T. Steele, <mark>N</mark>. JR- <mark>Featherston</mark>, E- LeRoy Smith, G."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [651.6, 599.94, 969.49, 726.95], "bbox_id": "51c1fa17a6", "file": "AppomattoxNewspapers_1926-1933a_0560.pdf", "page": 1, "text": "Are you a Yes Man ? Prof. Laird, Colgate University psy chologist. Explains Why Most Persons Are Susceptible to Sug gestions, in the American Weekly, the Magazine Distrib- HHH J I ________ uted with Next Sundays Wash- Rev. r ! E. Redding, 6 . L. Mar- ongton Herald. tin, N. R. Featherston, Grover _ --------- r ----------------- - ------ Beasley, J. W. Beasley, H. H.  Martin, D. A. Connor, C. H. Inge, A. W. Drinkard, Jr., D. j"}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "r ! E. Redding, 6 . <mark>L</mark>. Mar- ongton Herald. tin, <mark>N</mark>. R. <mark>Featherston</mark>, Grover _ --------- r ----------------- - ------ Beasley, J."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "r ! E. Redding, 6 . <mark>L</mark>. Mar- ongton Herald. tin, <mark>N</mark>. R. <mark>Featherston</mark>, Grover _ --------- r ----------------- - ------ Beasley, J."}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1089.34, 864.28, 1249.29, 990.19], "bbox_id": "b19b82ddd9", "file": "AppomattoxNewspapers_1933-1936a_0387.pdf", "page": 1, "text": "Among those from here attending the memorial services for the lute senator S. L .Ferguson Monday in Richmond were Mr. and Mrs. J D Ferguson and family, Mr. and Mrs. Joel W . Flood, Mr. and Mrs Calvin H . Robinson, Mesdames S L Ferguson, Alice Baram, J . R Lawson, F., C. Dresser, T. W Moses and N. R. Featherston, J A Burke, R. L. Burke. Evergreen"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "T. W Moses and <mark>N</mark>. R. <mark>Featherston</mark>, J A Burke, R. <mark>L</mark>. Burke. Evergreen"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "T. W Moses and <mark>N</mark>. R. <mark>Featherston</mark>, J A Burke, R. <mark>L</mark>. Burke. Evergreen"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.26, 682.16, 2394.6, 738.51], "bbox_id": "9855b01eee", "file": "AppomattoxNewspapers_1943-1947a_0482.pdf", "page": 1, "text": "N. E. Farrar, C. W, R. Featherston R. L. Burke, Conner Burke, C. T. F. A. OBrie"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "<mark>N</mark>. E. Farrar, C. W, R. <mark>Featherston</mark> R. <mark>L</mark>. Burke, Conner Burke, C. T. F. A. OBrie"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "<mark>N</mark>. E. Farrar, C. W, R. <mark>Featherston</mark> R. <mark>L</mark>. Burke, Conner Burke, C. T. F. A. OBrie"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.75, 332.78, 1378.29, 497.13], "bbox_id": "2e434f60f3", "file": "AppomattoxNewspapers_1943-1947a_0166.pdf", "page": 1, "text": "Cabell Breckinridge, Sec. of War. I Tee following is the historical program of the Appomattox Chap ter of U. D. C. for 1945 January Matthew M ontaine Maury, Mrs. L. Crawley. Thomas J. Jackson, Mr. N. R. Featherston. Col. Thomas S. Bocock, -Miss Jones read Mr. Feathemons contest pa per. Hostess Miss M. Anna Jones. j February Mesdames L. Crawley and C. F. James, hostesses. Lead- j Treasury, Mrs. Ola Patteson, lead-! ! ers- Mrs. R. C. Moore, Hon. Robt. er. George Wythe Randolph. Conf. i i Tombs, first Secretary of State,  Sec. of War, Mrs. W. P. Coleman, j I Confederate cabinet Mrs. J. A. leader. History of Appomattox j Burke, Alexander H. Stephens and j families who contributed to th e. Hampton Roads Conference, 1865.  civic, military, industrial and agri- j"}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "M ontaine Maury, Mrs. <mark>L</mark>. Crawley. Thomas J. Jackson, Mr. <mark>N</mark>. R. <mark>Featherston</mark>. Col. Thomas S. Bocock,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "M ontaine Maury, Mrs. <mark>L</mark>. Crawley. Thomas J. Jackson, Mr. <mark>N</mark>. R. <mark>Featherston</mark>. Col. Thomas S. Bocock,"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.8, 671.36, 2179.25, 769.73], "bbox_id": "4737ec378e", "file": "AppomattoxNewspapers_1918-1922a_0108.pdf", "page": 1, "text": "C W Smith, oounty olerk ....................... 260 00  clerk road bd.........................26 JO  clerk Bd.Sup ................... . 30 00 S L Ferguson, bulunoe as Corn. atty . ..... 60 00 Joel w Flood, t orn atty .......................... 160 no H W McKinney, sheriff...............................200 00  Jailor............- ...................... 14 00  probation oOloer ....... .100 00 N tt Featherston, sunt, schools............ 76 00 J L Martin. Janitor olerks office ............. 12 00 W H Ligon, supervisor. .......................... 52 0 L B Smith, sam e ........ - ........................ 86 90 S R Martin, same ...................... . ............. 48 20 d O Harvey, overseer poor. .... ... ............ 20 00 D P Ferguson same ..... . ......................... 30 on R T Phelps, sam e .......................... .. ........ 20 uO"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L"], "snippet": "probation oOloer ....... .100 00 <mark>N</mark> tt <mark>Featherston</mark>, sunt, schools............ 76 00 J <mark>L</mark> Martin. Janitor olerks office"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L"], "snippet": "probation oOloer ....... .100 00 <mark>N</mark> tt <mark>Featherston</mark>, sunt, schools............ 76 00 J <mark>L</mark> Martin. Janitor olerks office"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1230.95, 466.7, 1423.17, 704.94], "bbox_id": "1d09551e99", "file": "AppomattoxNewspapers_1939-1943a_0075.pdf", "page": 1, "text": "Liberty Chapel, March 26.- Not since 1915 have we had such a cold, snowy Taster. After attending Easter services Sunday morning at Centenary M. E. __ church in Lynchburg, Mrs. Amine thelBagby, Mr.and Mrs. Lyle Garrer.te, Mrs. P. E. Cline, Miss Christine Garrette and Mrs. Monroe Garrette visited Mrs. L. J . Hatcher at the Virginia Baptist Hospital. Others vis- initing her Sunday were L .J . Hat cher and son, Harold, Mrs. L. G. Hatcher, Mrs. Charles Scott and N. R. Featherston. W . P Bocock visited friends in this neighborhood Monday. Mr .and Mrs. J.K . Marshall vis ited Mr. and Mrs. John Scruggs Sunday afternoon. Friends of Miss Hazel Coleman are very sorry to hear of her ill ness."}, "highlight": {"text": {"matched_tokens": ["L", "N", "Featherston"], "snippet": "and son, Harold, Mrs. <mark>L</mark>. G. Hatcher, Mrs. Charles Scott and <mark>N</mark>. R. <mark>Featherston</mark>. W . P Bocock visited"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N", "Featherston"], "snippet": "and son, Harold, Mrs. <mark>L</mark>. G. Hatcher, Mrs. Charles Scott and <mark>N</mark>. R. <mark>Featherston</mark>. W . P Bocock visited"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2164.8, 681.88, 2334.35, 1327.17], "bbox_id": "2ddf13a69e", "file": "AppomattoxNewspapers_1933-1936a_0323.pdf", "page": 1, "text": "Appomattox voters will go to th poll next Tesday to castt thei ballots for the party nominees fog county odices and the primary nom inees for the state senate and the house of delegate! Local party leaders urge tha voters to come out in large nutuH ber and maintain ,he reputation of Appomattox as a stronghold ot Democratic loyalty in Virginia. Thia county has been viewed as sure to produle a vote of approval for the party nominees. The ticket, unopposed, follows For State Senator  l Charles T. Moses For House of Delegates John B, Boatwright For County Treasurer R. L. Burke  For Commonwealths Attorney W. M. Abhitt For County Clerk C. W. Smith . , For Sheriff H. W. McKinney For Commissioner of Reyenu0 i J. H. OBrien For fuperviior Stonewall Distinct T. E Owen For Supervisor Southside District Don Moses For Supervisor Clover Hill District F. A. OBrien v , Polls will be open from sun up to unset. The following judges and election officials have  been utH nounced Court House precinct N. R. Featherston, J. W. Durrum, T ff, Odor1, G. L. Doss, G. L Ferguson. Cheatwood precinct J O. Rob ertson, A, H. Howerton, O. G Cheat ham, 3. P. Coleman, J. E, Dick erson Chap precinct J. L. Lewis, C. C Harvey, J. L Driscoll, D  Pugh, F E Woolridge. Rocks precinct G. T, Marsh, 9! A Garrett, A. W. Paclett, A A Baldwin, J W Warriner, Walkers Church precinct J. B. Wilson, W. T. Marshall,! Tl f f t Roberts, J D Ford, Jesse H. Hurt. Pamplyi precinct jL, H. Fears, T. M. Fore, C E Peterson, How ard Williams, T R Pugh. Clover Iflij vrecnct Jas. 1W. Childers, S. Guy Smith, M. L. Cov GUIs. . Agee precinct Wialker W. O Brien, J. W. Carter, ,Robert Spig ?le, L. C. Hatcher, T. J. Megginsoa Oakville precinct J c Davidson, I D. Davidson, R, B. Martin, E. H Smith, Jno. Walton. Sttonewall precinct J, P. Alvia, B. W. Hamilton, T M. Martin, T A King, W T. Caldwell. In- each case above, the last tWOi n o a r e clerk- and the first hree judges"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston", "L", "L"], "snippet": "nounced Court House precinct <mark>N</mark>. R. <mark>Featherston</mark>, J. W. Durrum, T ff, Odor1, G. <mark>L</mark>. Doss, G. <mark>L</mark> Ferguson."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston", "L", "L"], "snippet": "nounced Court House precinct <mark>N</mark>. R. <mark>Featherston</mark>, J. W. Durrum, T ff, Odor1, G. <mark>L</mark>. Doss, G. <mark>L</mark> Ferguson."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.01, 1022.35, 1850.52, 1303.39], "bbox_id": "111634da01", "file": "AppomattoxNewspapers_1908-1909a_0298.pdf", "page": 1, "text": "The club entertained the J patrons of the school and the I B ladies of the community at a I Mrs. H. G. John- Silver Colonial Tea, at the Slaughter, Rebec- practice cottage on Friday af- Mrs. L. E Morris ternoon, February 21, 1930 wall Connor were from 3 to- 5 oclock. Abou e home of Mr. and fifty guests were present. The cottage was tastefully . decorated with spring flowers ! h a. m.. fke brok and white taper,. . arm oi Senate, A mualcal P  a m of old frpLTZni ,r  ss  Corporate limit, ol were  A minuet by Mi Mary  y - c Featherston, Piano solos by l om , Miss Catherine Gills and Man- llT e S S  S d dann eta by Mita- L rs ,evel dwell-  McKe Uh,n N l 0 B   ,, 4 , low and Beatrice and Bernice I wou n . . . Woodson, Readings by Misses P  o, yhtam McKie Lansban and Iueillelham, Appomattox,"}, "highlight": {"text": {"matched_tokens": ["N", "l"], "snippet": "evel dwell-  McKe Uh,n <mark>N</mark> <mark>l</mark> 0 B   ,, 4 , low"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "l"], "snippet": "evel dwell-  McKe Uh,n <mark>N</mark> <mark>l</mark> 0 B   ,, 4 , low"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2323.44, 1393.09, 2494.97, 1629.43], "bbox_id": "3a74a6d6be", "file": "AppomattoxNewspapers_1939-1943a_0346.pdf", "page": 1, "text": "The Appomattox Chapter of the U. D. C. is deeply grateful to the following contributors to the Lee Chapel and Mausoleum Endowment Fund N. R. Featherston, W. C, Franklin, Judge J. W. Flood, II. C, Pulliam, N. E. Farrar, C. K. Hunt er, Mrs. Dora Randolph, B. G. An derson, A. R. Harwood, R. L. Burke, Mrs, H. F. Jones, Jerry A. Burke, T W. Moses, R. E. Smith, C. W. Smith, A. R. Harwood, Jr., C. H. Robinson, Dr. F. H. Lukin, L. N. Ligon, J. D. McDearmon, Mrs. F. C. Dt-esser, Mrs. S. L. Ferguson, Mrs. D. E. Caldwell, Jr, Larry A. Young, Mr. and Mrs. F. L. Murphy, Mesdames Lillie Gregory, T. M. Trent, Emma Young Hunter, W. M. Abbitt, Judge L. F. herguson, C. S. McDearmon, C. T. Moses, Dr. C. F. James, G. B. Buchanan, Mrs. H. P. Davis, IMieses Naomi Hancock, Elva Stratton, Kate M. Franklin, and Elaine McDearmon, and W. E. Han cock."}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "Dr. F. H. Lukin, <mark>L</mark>. <mark>N</mark>. Ligon, J. D. McDearmon,"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "Dr. F. H. Lukin, <mark>L</mark>. <mark>N</mark>. Ligon, J. D. McDearmon,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1984.79, 1046.82, 2150.06, 1810.03], "bbox_id": "70b87a6f1f", "file": "AppomattoxNewspapers_1912-1915a_0465.pdf", "page": 1, "text": "STONEWALL DISTRICT N. R. Featherston Vera. Miss Ida Jones Oakville. Mrs. Lillie E. Dri kard, Stapleton Mrs W. T. Steele, Spout Spring Mrs. J. W. Neighbors, Concort I will from time to time name other members of my commit tee, and I hereby authorize and request that the members above named will get every in dividual possible to co-operate in this great work, and I wouk like to see a thorough canvas made of the entire county, ant give every individual an op portunity to contribute, let it be little or much, to this fund. I have made storage arrange ments with Mr. R. W. Nowlin at Spout Springs, Mr. E. Le- Roy Smith, and 1 will look af ter it at Appumattox, Mr. C. S. McDearmon at Evergreen, and Mr. L. N. Ligon, at Pamplin, and I hope that every indivi dual of the county will make a contribution to this fund, and carry whatever they wish to donate, whether cash, food stuff or clothing, to these par ties for storage and safe keep ing until orders are given for shipment. We hope the canvas and con tribution may be made and stored at once, as we are ex pecting a call for the shipment to be made between now and the holidays. I might say, that transportation will be free, and Virginia, is expect ed to fill one of her great steamers, with food and cloth ing for those suffering people, and for it to be carried to them in a Virginia ship, sailing un der the U. a. Flag. Any kind of clothing, whet her second-hand or not, and any kind of provisions which will be capable of easy hand ling and bear transportation, will be gladly accepted, and no one can have any excuse for failing to contribute at least something o this fund. I ex pect a liberal contribution from our County and believe that whatever anyone does in this cause will be a labor of love to"}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "at Evergreen, and Mr. <mark>L</mark>. <mark>N</mark>. Ligon, at Pamplin, and"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "at Evergreen, and Mr. <mark>L</mark>. <mark>N</mark>. Ligon, at Pamplin, and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.5, 381.74, 1931.22, 572.26], "bbox_id": "0c6cef447b", "file": "AppomattoxNewspapers_1939-1943a_0397.pdf", "page": 1, "text": "Norman H Cheatham Mr and Mrs Carroll Smith Dr C. G. OBrien B G Anderson  W S Taylor Obey Ferguson C L Johnson L N Herncall H B Martin J P Taylor Bank of Appomattox N R Featherston J W McDearmon St. Paul Baptist Chureti Farmers National Bank Mr and Mrs L J Morris E W Smith 7drs Adelia C Ferguson and Lawson family Mrs Jennie Johnson TOTAL ................................"}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "Ferguson C L Johnson <mark>L</mark> <mark>N</mark> Herncall H B Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "Ferguson C L Johnson <mark>L</mark> <mark>N</mark> Herncall H B Martin"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [514.28, 784.11, 982.38, 922.26], "bbox_id": "48b156b764", "file": "AppomattoxNewspapers_1933-1936a_0130.pdf", "page": 1, "text": "Miss Dorothy Evans, of Richmond! pent the week end in the home of I Mrs. C. W. Smith. I m P l. Featherston and daughter, ! and Miss Emily Featherston I he week end in Roanoke. i John Harvey, of Richmond, visiting relatives here. Marshall Good, of California rs. Mayo Bass, of Lynchburg in the hohe of Mrs. Norman am this week.    Mrs. D. A. Connor entertained luesday evening at a shov  p- , , honor of Miss Eloise OBrien of Richmond useful presents were rece n the home of I"}, "highlight": {"text": {"matched_tokens": ["l", "Featherston"], "snippet": "Smith. I m P <mark>l</mark>. <mark>Featherston</mark> and daughter, ! and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "Featherston"], "snippet": "Smith. I m P <mark>l</mark>. <mark>Featherston</mark> and daughter, ! and Miss"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2087.04, 430.24, 2402.33, 766.39], "bbox_id": "a77fcd492e", "file": "AppomattoxNewspapers_1915-1918a_0500.pdf", "page": 1, "text": "m attox County, Va ed from loss of fifty character 8 . L. Ferguson, Ippomaitox. Even should théCertificate be B G. Anderson, Appomattox. J burned, he would still he fully protected. Owners of Oertlfloates are expected to hold  their Stamps and Oertlfloates for five years, as they will m ature on January l, 1933.. In order to meet an emergen cy, the owner may . realise on his Certificates and 8 tam ps at A. E Henry, Hebron Church.any time, It is specially pro- N. R. Featherston. Agee. yided by law th at the etamps, F it A. OBrien, Old C o u r t  or Certificates, be redeemed at HousA Jauy postoffioe, or, if regietered, H. Morton Marhll, -H ix-jattbm post offloe where regie- burg. y Ae tod. Ten  days notice mqst Thomas Hix H itburg. ,  b e given by the owner of his L. N. Ltgon, Pamplin. .  intention to ask a refund. It . W. R Bright well, Pamplin. will be paid him plus 8 perosnt Samuel D. Cheatham, near interest , The Stamps fiad Cor ti flcites w ere put on sale thi month aud may be bought at any time during the eauingvar Their object is twofold The Treasu ry Departm ent ex oecw to real lie 3,000,000,000 from the sale"}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "the owner of his <mark>L</mark>. <mark>N</mark>. Ltgon, Pamplin. .  intention to"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "the owner of his <mark>L</mark>. <mark>N</mark>. Ltgon, Pamplin. .  intention to"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.55, 296.51, 1815.77, 1281.87], "bbox_id": "d0aef819ca", "file": "AppomattoxNewspapers_1939-1943a_0118.pdf", "page": 1, "text": "jrouch, Mr. and Mrs. C.C.Cralle, Lawrence Moore and W .E.Ferrell. Mrs. Jennie Johnson is spending his week in Roanoke. Miss Emily Featherston is visit- Mrs W A. njhornhill. o f Blue- field. Mr and Mrs. Jerry Allen Burke, Jr of New York will arrive this week-end to visit his parents. Mr. and Mrs. Burke spent this week at Nantucket. Mr. and Mrs. M. T . Parrish and daughter will spend the week end in Richmopd. Mrs. Parrish and daughter will motor to Charlottes ville Sunday to spend next week. Mr and Mrs. W. F . Woolfork and son. Billy, of Petersburg are visiting in the home of her mother Mrs. W. M. Hancock. Mrs. Florence Carson. Mr. and Mrs Earl Carson of Steelton. Pa. are visiting relatives here , Mesdames Dora Randolph. D.E. Caldwell and R. W. Stanley havel returned after a ten-day trip to New York. Pennsylvania and West Vir- giiria i Misses Lucille Moon and Avis God sey left Sunday for Elizabeth City, N J. where they have accepted positions. Misa Doris Mann of Crewe is visiting Miss Hilda Mitchell. Lawson Lee is sick in Richmond. Miss Claire Browning, of Rich mond is- visiting Mrs. R . N. Daw son, Herman Lee is visiting in Roan- ok. 1 Mr. and Mrs. W. E. Kemp, of Radford were week-end guests of Mr. and Mrs. W.M. Morris. Mrs. J. W. St Clair, of Roan oke is spending this week with Mrs.  R. T. Lee. jke Abbitt. of Roxboro is visiting his brother, C. N. Abbitt. Mr. and Mrs.Wrrren Hamlet and Miss Margaret Parker, of Halifax, spent Sunday with Mr. and Mrs. W H . Lucado,.  Misses Helen Mitchell and Doris Guill are visiting in Bedford. Mrs. Houston Crqwder, of Rich mond is visiting her parent. Mr. and Mrs. Jessie Harvey. Lt Eames A. Powers, of Rich mond, spent the week-end in the home of J. E. Sears. Mrs. C W. Potts of Richmond spent Sunday with her aunt. Mrs. Lottie Bledsoe. j Mr. and Mrs. LeRoy Smith and family spent Sunday in Halifax. Mr and Mrs. Julian Grow and daughter, of Roanoke are visiting in the county. Mavor C S McDearmon plans to a l n d the N. W. Veterans convention in Raonoke next week. t s Greenlee, of Washington recently visited Dr. D. N. Twy- man, who continues sick. Mr. and Mrs. W. L . Fa rm er spent the week-end at Wyliesburg. iTflie contract bridge club will meet tomorrow evening with Mrs. Calvin Robinson. Miss Elaine McDearmon and H. Y Spencer spent today in Lexing ton. Miss Marian June Evans.is visit ing in Baltimore. Mrs. Dorothy Davis, of Lynch-1 burg renently visited Mrs. U. - G a y l e . ____ _______ _"}, "highlight": {"text": {"matched_tokens": ["l", "n", "N"], "snippet": "McDearmon plans to a <mark>l</mark> <mark>n</mark> d the <mark>N</mark>. W."}}, "highlights": [{"field": "text", "matched_tokens": ["l", "n", "N"], "snippet": "McDearmon plans to a <mark>l</mark> <mark>n</mark> d the <mark>N</mark>. W."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1848.0, 736.67, 2012.15, 1609.54], "bbox_id": "23a7c5adf2", "file": "AppomattoxNewspapers_1939-1943a_0404.pdf", "page": 1, "text": "JRAND TOTAL turned in to War Fund Treasurer as of 5 P. M. January 7, .......... 962.77 LReported last week F L Murphy  10.00 .. O. Paulette 5.00 Mrs Carolyn Cates 1.00 Mrs Lillia H Gregory 20.00 iiss Naomi Hancock 5.00 ppomr.ttor Garment Co. 19.00 note Garment Factory employees gave 52.00 in Roll Call drive, and plan to makè their contribution one hundred per cent. C L Cash 1.0C G. B. Buchanan 4.0C Rev H F Jones 20.00 R C Hubbard 1.00 Chas. F James 25.00 Mrs T H Unge 5.00 Mrs J B Abbitt 1.00 J T Irby 1.00 H. M. Burge Cd. and Employees 60.00 Moses Motor Co. 50.00 Southern Battery Co. and Employees 50.00 J.E . Sears Co. and Employees 50.00 Hunter Lumber Co and Employees Ix M J. W Durham 1.00 Miss Ecla May Eurke 10.00 Central Vr.. Electric Cooperative Company 10.00 George D Coleman 1.00 Joel W. Flood 25.00 Norman H Cheatham 1.00 Mr and Mrs Carroll Smith 10.00 Dr C. G. OBrien 15.00 B G Anderson 10.00 W S Taylor 10.00 Obey Ferguson 1.00 C L Johnson 1.00 L N Herncall 1.00 H B Martin 1.50 J P Taylor 10.00 Bank of Appomattox 50.00 N R Featherston 1.00 J W McDearmon 1.00 St. Paul Baptist Churcn 2.50 Farmers National Bank 50.00 Mr and Mrs L J Morris 5.00 E W Smith 5.00 Mrs Adelia G Ferguson and Lawson family 25.00 Mrs Jennie Johnson 1.00 TOTAL ................................ 591.00 J . W . Cawthon 2.50 Mrs. G. R. Purdum 5.00 Mrs. Clara Davis 2 00 W. D Morris 2.60 J . D Morris 2.50 Cash 2 00 Calvin H. Robinson 5.00 L. M. Wilkes 2.00 Oscsr Scheffler 1.00 C. W. Smith 10.00 Eastern Star 5.00 Lester Harvey 2 00 W. E. Hancock 5.00 E . W , Morris 1.00 Mrs. M H . Lawson 1.0C R . L. Burke 10.00 Mr. and Mrs. W P Ferrell 5.00 H. W. McKinney 5.00 C. S McDearmon 5.00 Mr. and Mrs. G. M. Dixon 2.00 Miss B. Ligon 1.00 Rev. W . R Reed 5.00 A Friend 1.00 Mrs. Virginia Marks 2.0Ò C S. Jenkins 5.00 Mrs. W. M Hancock 5.00 Miss Frankie McKinney 1.00 Mrs, Watt Stanley 1.00 Clarence Gobble 1.00 G. W. B ess 1.00 Miss Cornelia Gills 1.00 A. R Harwood 5.00 Appomattox Hardware Co. and employees 50.00 G. F. Abbitt, Jr. 15.00 R.B. Haley 3.00 J . C Hudgins 20.00 W. M Abbitt 15.00 Don Moses 5.00"}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "C L Johnson 1.00 <mark>L</mark> <mark>N</mark> Herncall 1.00 H B"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "C L Johnson 1.00 <mark>L</mark> <mark>N</mark> Herncall 1.00 H B"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [576.49, 793.34, 912.89, 901.04], "bbox_id": "0411c216da", "file": "AppomattoxNewspapers_1939-1943a_0215.pdf", "page": 1, "text": "in Lynchburg. R . E , Baldwin, of Richmond spent  last Thursday night with N. R. Featherston. First Lieutenant Henry Peck, 1 - ft ?TUIda QW a .earS td rtyA n l h, T    Searsandson, Scott, Mrs. United States Army at Fort Banks,  Marshall Mr and Mrs. Bar- near Boston, Massachussets.-  de Dakl and, Mr. and Mrs. J.C. H. G. Johnson, who was a pa-1 Crldwell, and son, Jack. tient several days this week in the"}, "highlight": {"text": {"matched_tokens": ["n", "l"], "snippet": "a .earS td rtyA <mark>n</mark> <mark>l</mark> h, T    Searsandson, Scott,"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "l"], "snippet": "a .earS td rtyA <mark>n</mark> <mark>l</mark> h, T    Searsandson, Scott,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [650.91, 1049.45, 810.59, 1491.48], "bbox_id": "e9caa90ac2", "file": "AppomattoxNewspapers_1926-1933a_0212.pdf", "page": 1, "text": "Harvey, E. Larkin, Harvey, Z. V. , Jennings, Jesse T., Craw ley, L., Woolridge, G. W-, Pearce C. C-, Dameron, G. D. Lewis, Olive W., Dickerson, Mrs. W. E-, Smith, Miss Emma, Goin, Nathan, McDearmon, C. S., McKinney, Miss Janie, Scott, W. W-, Featherston, N. R. , Steele, R. F. B., Redding, Mrs. R. E., Redding, Rev. R. E, Bledsoe, M rs. Lottie, Patter son, Eula May colored, Har wood, A. R., Caldwell, Henry, Babcock, H. C., Pulliam, H- C., Walton, Mrs. T. A., Burke, Eu la May, Moses, Don, Smith, L- E. Jr., Odor, W- Pierce, Clem ent, A. H., Sears, S. W., Scott, Mrs. J- W., Scott, Mr. J. W., Walton, T. A., Murphy, F. L., Gills, Miss Louise, Thompson, Rev. W. M-, Ferguson, Joe D-, Smith, C. W., Ferguson, Msr. S. L., McGill, W- C-, James, Chas. F., Glenn, R. A., Hawley, F. H-, Ferguson, Sen- S. L., Bab cock, Bradley W., Smith, Mr. W. T., Hancock, Ned, Burke, Mrs. R. L, Johns Miss A Deane Gregory, Mrs. A. H., Brown, M. Avis, Plunkett, Dave, Durham, ham, Walter E., Walker, Jas- E- colored, Sears, Leonard L., Burke, J. A., Ferguson, Mrs. Tom. Stonewall District Smith, Frank J., Henderson, Rev- W- T. , OBrien, Miss Phoebe, Thornhill,. W. W., Marks, Mrs. Ida F., Davidson, J. 0-, David son, J. C."}, "highlight": {"text": {"matched_tokens": ["Featherston", "N"], "snippet": "Janie, Scott, W. W-, <mark>Featherston</mark>, <mark>N</mark>. R. , Steele, R. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "N"], "snippet": "Janie, Scott, W. W-, <mark>Featherston</mark>, <mark>N</mark>. R. , Steele, R. F."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [650.14, 1029.08, 832.02, 1397.71], "bbox_id": "2ede74c628", "file": "AppomattoxNewspapers_1908-1909a_0212.pdf", "page": 1, "text": "Harvey, E. Larkin, Harvey, Z. V. , Jennings, Jesse T., Craw ley, L., Woolridge, G. W-, Pearce C. C-, Dameron, C. D, Lewis, Olive W, Dickerson, Mra. w. E, Smith, Miss Emma, Goin, Nathan, McDearmon, C. S., McKinney, Miss Janie, Scott, W. W-, Featherston, N. R. , Steele, R. F. B., Redding, Mrs. R. E Redding, Rev, R. E, Bledsoe, M r s. Lottie, Patter son, Eula May colored, Har wood, A. R-, Caldwell, Henry, Babcock, H. C., Pulliam, H- C Walton, Mrs. T. A., Burke, Eu la May, Moses, Don, Smith, L E. Jr., Odor, W Pierce, Clem ent, A. H. Sears, S. W Scott, Mrs. J. W. Scott, Mr. J. W. Walton, iT. A., Murphy, F. L., Gills, Miss Louise, Thompson, Rev. W. M-, Ferguson, Joe D-, Smith, C. W., Ferguson, Msr. S. L., McGill, W. C, James, Chae. F., Glenn, R. A., Hawley, F. H , Ferguson, Sen. S. L., Bab cock, Bradley W., Smith, Mr. W. T., Hancock, Ned, Burke, Mrs. R. L-, Johns Miss A Deane Gregory, Mrs. A. H., Brown, M. Avis, Plunkett, Dave Durham, ham, Walter E., Walker, Jas E colored, Sears, Leonard L., Burke, J. A., Fergus, Mrs."}, "highlight": {"text": {"matched_tokens": ["Featherston", "N"], "snippet": "Janie, Scott, W. W-, <mark>Featherston</mark>, <mark>N</mark>. R. , Steele, R. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "N"], "snippet": "Janie, Scott, W. W-, <mark>Featherston</mark>, <mark>N</mark>. R. , Steele, R. F."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1124.63, 550.21, 1310.62, 1805.77], "bbox_id": "c2c08d1a8e", "file": "AppomattoxNewspapers_1954-1955a_0075.pdf", "page": 1, "text": "Coleman, S. J. Transferred to Buck ingham. Childress, Lewis B. Transferred to Roanoke. Carter, Aubrey R. Transferred to Lynchburg. Carter, Mrs. Laura J. Dead. Carter, Tudor. Transferred to Lynchburg. Carter, Estelle. Transferred to Lynchburg. Carter, Charlie M. Transferred to Court House. Childress, Marshall. Transferred to Amherst. Coleman, L. Kyle. Transferred to Clover Hill. Childress, L. H. Transferred to Clov er Hill. Coleman, D. C. Transferred to Buck ingham Co. Coleman, Roberta R. Transferred to Clover Hill. Coleman, Raymond A. Transferred to Clover Hill. Collins, S. H. Transferred to Rich mond. Childress, Lawrence E. Transferred to Richmond. Doss, H. C. Dead. Davidson, Sr., J. W. Dead. Dickerson, J, F. Dead. Doss, Harvey L. Transferred to Clover Hill. Durie, W. S. Transferred to Oak ville. . Durie, Mrs. Dora. Transferred to Oakville. Davidson Jr. J. W. Transferred to Neuf Canton. Dixon, Mrs. G. M. Transferred to Court House. Doss, W yatt W. Dead. Dixon, W. A. Transferred to Buck ingham. Franklin, Abdalla. Dead. Franklin Jr. Cliff E. Transferred to Clover Hill. Franklin, Florence Watson. Trans ferred to Clover Hill. Featherston, N. R. Dead. Garrett, J. H. Dead. Gooding, J. H. Transferred to Oak ville. Grow, C. E. Dead. Garrett, M. L. Dead. Garrett, W. C. Dead. Garrett, W. F. Transferred to Oak ville. Garrett, Lewis W. Transferred to Stonewall. Garrett, Mrs. Norman L. Transfer red to Court House. Grow, Mrs. Alice. Transferred to Stonewall. Garrett, W. S. Transferred to Clov er Hill. Garrett, Mrs. Addie. Dead. Garrett, Willie B. Transferred to Prospect. Gooding, J. H. Dead. Grow, J. B. Transferred to Roan oke. Gunter, Elizabeth. Transferred to Court House. Garrett, Alfred. Transferred to Clover Hill. Garrett, Christine. Transferred to Campbell Co. Garrett, Joseph N. Dead. Garrett, Lyle N. Transferred tc Concord. Garrett, Nathan. Transferred to Oak ville. Garrett, Garland B. Transferred to Court House. Harris, J. C. Dead. Harvey, Thos. Dead. Harvey, H. P. Dead. Harvey, Curtis W. Transferred to Clover Hill. Jamerson, D. W. Dead. Jones, C. C. Dead. Jamerson, T. M. Dead. Kyle, M. F. Dead. Kenney, H. W. Dead. Luckado, R. M. Transferred to Walkers Church. Lither, W. J. Transferred to Maysville. Luckado, E. L. Transferred to Oak ville. Lither, Lorena. Transferred to Rich mond. Megginson, S. T. Dead. Megginson, B. E. Dead. Megginson, J. C. Dead. Megginson, T. J. Dead. Megginson, R. E. Dead. Megginson, J. K. Dead. Martin, R. M. Transferred to Oak ville. Martin, T. H. Transferred to Louisa County. Moses, R. L. Dead. Megginson, S. T. Transferred to Walkers Church. Marks, W. D. Dead. Megginson, Jno. W. Transferred to Lynchburg. Martin, J. Graydon. Transferred to Oakville. Morris, Louella. Dead. Megginson, Mrs. Virgie. Transferred to Walkers Ch."}, "highlight": {"text": {"matched_tokens": ["Featherston", "N"], "snippet": "ferred to Clover Hill. <mark>Featherston</mark>, <mark>N</mark>. R. Dead. Garrett, J."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "N"], "snippet": "ferred to Clover Hill. <mark>Featherston</mark>, <mark>N</mark>. R. Dead. Garrett, J."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [620.64, 313.41, 759.94, 1794.56], "bbox_id": "55c6b738b3", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "A. T. Coleman T. J. Conner D. W. Cawthorn James J. Case Jannie B. Caldwell Mrs. Bessie S. Christian Mrs. Nultie Cawthorn Mrs. Sallie B. Conner Helen F. Coleman Helen A. Coleman Florence W. Carson Mrs. W. L. Coleman Mildred Collier Christian Virginia Christian Mrs. Catherine C. Christian Mrs. Verna F. Conner Mrs. Cha8. F. P. Crawley Mrs. Harry Clark Mrs. Richard E. Clapp Catherine C. Carter Mrs. Madge Dudley Clark Harriett A. Chilton Mrs. Elizabeth G. Covington Mrs. E. G. Cheatham Mrs. Jemima Sue Chilton Mary C. Coleman Mrs. Mary T. Childress Mrs. M. E. Cheatham Mrs. Mary E. Cawthorne Mrs. Etta Carter Frances Mae Cralle Leonard F. Doss Walter C. Doss James R. Davis R. N. Dawson Twyman Dinkins G. M. Dixon Nevel Dinkins Chas. D. Doss W. T. Davidson F. C. Dresser Terry C. Durham W. E. Dickerson, Jr. Walter E. Durham Gilbert Dinkins Otis P. Dewberry Mrs. Grace B. Dawson Mrs. Otis P. Dewberry Miss Evelyn Dickerson Mrs. W. W. Driskill Nannie Lucille Doss Mrs. Margaret Emrick M. L. Earman C. T. Evans Lewis T. Evans Warren Emerick Meredith Evans Christine Eddins C. M. Evans N. R. Featherston G. T. Farrar Edward Ferguson W. W. Fleshman George W. Farrar James H. Ferguson Willie W. Farrar W. L. Farmer J. D. Ferrell George E. Frasier Harry D. Ferguson Lester C. Furney Sam S. Ferguson G. D. Farrar Morris Ferguson W. P. Ferrell Harpson S. Fleshman Horace Price Ferrell E. H. Ferris James M. Fulcher Mrs. Oreanna D. Farmer Mrs. Sarah T. Ferguson Mrs. Mamie Flowers Mrs. Lucy L. Furney Mrs. M. L. Ferguson Elizabeth Smith Ford Mrs. W. W. Ford, Jr. W W.. Ford, Jr. Lizzie Maude Godsey Ida L. Guill Clyde B. Godsey G. D. Gordon A. M. Goodman Robert Gills Erie R. Glenn A. Z. Gunter A. R, Gobble Chap R. Garrett Clarence H. Gobble D. H. Goin C. F. Gilley A. F. Godsey J. G. Gentry Harry B. Giles James H. Garrett Raymond Godsey James M. Garrett Raymond C. Garrett W. W. Godsey John E. Guthrie J. R. Gunter C. T. Gunter John S. Guill H. W. Guill Otha Godsey Clifford L. Godsey John D. Guill Havilah L. Guill S. L. Gobble H. W. Gallier Joe C. Gallier Herbert L. Godsey Theodore Gilbert James B. Goin Charles N. Gregory Wallace B. Gordon Richard Godsey Mrs. Jennie James Gordon Mrs. Lily C. Gilliam Miss Frances Gordon Margaret Goble Mrs. Carrie G. Gobble Mrs. Clara F. Garrett L. C. Godsey W. L. Godsey Warren Guill R. T. Holycross C. A. Hancock A. R. Harwood L. B. Harvey J. R. Hamilton E. W. Harris Jessie H. Hamlett W. C. Hamlet Frank Hanenkrat, Jr. John T. Hunter L. N. Herncall R. P. Harvey William R. Herndon"}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "Jr. John T. Hunter <mark>L</mark>. <mark>N</mark>. Herncall R. P. Harvey"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "Jr. John T. Hunter <mark>L</mark>. <mark>N</mark>. Herncall R. P. Harvey"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "J. C David son, <mark>N</mark> R. <mark>Featherston</mark>, B. G. An derson,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "J. C David son, <mark>N</mark> R. <mark>Featherston</mark>, B. G. An derson,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.07, 729.53, 1951.02, 910.68], "bbox_id": "2778bacd56", "file": "AppomattoxNewspapers_1926-1933a_0107.pdf", "page": 1, "text": "W. T. Marshall, G. O. Thorn hill and E. LeRoy Smiththe Electoral Board met last Friday. Following judges and clerks were appointed to conduct primary election Aug. 2, 1927 C. H. R. F. Jamerson, N. R. Featherston, W. M. Hancock Lewis Doss and Lewis Ferguson, Clerks. Cheat woodJ. O. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, Cawthorn, T. H. Ford. E. W."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "H. R. F. Jamerson, <mark>N</mark>. R. <mark>Featherston</mark>, W. M. Hancock Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "H. R. F. Jamerson, <mark>N</mark>. R. <mark>Featherston</mark>, W. M. Hancock Lewis"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.53, 720.68, 1942.25, 901.13], "bbox_id": "0d6f67f31e", "file": "AppomattoxNewspapers_1908-1909a_0107.pdf", "page": 1, "text": "W. T. Marshall. G. 0. Thorn hill and E. LeRoy Smiththe Electoral B6ard met last Friday. Following judges and clerks were appointed to conduct primary .election Aug. 2,1927 C. H.R. F. Jamerson, N. R. Featherston, W. M. Hancock- Lewis Doss and Lewis Ferguson, Clerks. CheatwoodJ. 0. Robertson, A H. Howerton and J. E. Dick erson. ChapJ. L. Lewis, E. W. Cawthorn, T. H. Ford-"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "C. H.R. F. Jamerson, <mark>N</mark>. R. <mark>Featherston</mark>, W. M. Hancock- Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "C. H.R. F. Jamerson, <mark>N</mark>. R. <mark>Featherston</mark>, W. M. Hancock- Lewis"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [590.65, 742.57, 747.45, 841.08], "bbox_id": "015f691787", "file": "AppomattoxNewspapers_1918-1922a_0181.pdf", "page": 1, "text": "W Smith, county clerk ................ .. .......... 6C3 CC C W Smith, clerk road board . ............. .. 25 U C W Smith, clerk board supervisors... 80 00 Joel W Flood, com. attorney ................. SCO O H W McKinney, sheriff ................................ 300 00 H vv McKinney, sheriff and jailer.... 14 00 N R Featherston, supt. of schools.... 75 00 W H Ligon, member board super visors 1C meetings ................................... 72 00 g B Anderson same9 meetings .......... 61 80 L E Smith, same9 meetings.................... 54 80 D L Martin, janitor service..................... 12 00"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "and jailer.... 14 00 <mark>N</mark> R <mark>Featherston</mark>, supt. of schools.... 75"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "and jailer.... 14 00 <mark>N</mark> R <mark>Featherston</mark>, supt. of schools.... 75"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [618.93, 309.59, 771.8, 437.45], "bbox_id": "ffa92fb507", "file": "AppomattoxNewspapers_1915-1918a_0384.pdf", "page": 1, "text": "W a lk ers C hurch P r e c in c t E P. Sears, Registrar W .T. Marshall, Asst. R egistrar Old Court House Precinct L E. Morris, R egistrar C. W. Smith, Aset. R egistrar W. I Sm ith, Asst. R egistrar Agee Precinct Jno. W. Davidson, R egistrar N. R. Featherston, Asst. Regis trar"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "W. Davidson, R egistrar <mark>N</mark>. R. <mark>Featherston</mark>, Asst. Regis trar"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "W. Davidson, R egistrar <mark>N</mark>. R. <mark>Featherston</mark>, Asst. Regis trar"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1952.16, 503.39, 2123.49, 709.49], "bbox_id": "786538b44d", "file": "AppomattoxNewspapers_1943-1947a_0417.pdf", "page": 1, "text": "Those from this community who attended Mrs. Harry Gilliams fu neral in Lynchbuig Monday A. M. were Mr. and Mrs. Rercy Sears, airs. Morton Marshall, Mrs. E. W. Gilliam and Lester Seirs. Herbert Gilliam and Mr. and Mrs. L. K. Griffith, of Statesville, N. C., were with Mr, Sears and Mrs. H. M- Marshall over the week-end and attended Mrs. Hairy Gilliams funeral in Lynchburg. N. R. Featherston, Mr. and Mrs. J. B. Terry visited in the home of Mrs. H. M. Marshall on Sunday afternoon. John Wilson Hix has received his call from the local draft board and will leave for an induction center Monday, May 20."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Gilliams funeral in Lynchburg. <mark>N</mark>. R. <mark>Featherston</mark>, Mr. and Mrs. J."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Gilliams funeral in Lynchburg. <mark>N</mark>. R. <mark>Featherston</mark>, Mr. and Mrs. J."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.39, 1109.63, 1681.7, 1423.77], "bbox_id": "3194ed52dd", "file": "AppomattoxNewspapers_1943-1947a_0145.pdf", "page": 1, "text": "The January meeting of the Ap- pomattox Chapter U. D. C., wich Miss M. Anna Jones as hostess, was well attended. Mrs. L. Crawley ser ved her first time as ti-easurer, suc cessor to Mrs. L, J. Morris, resign ed.  There was a splendid business session and several visitors and honorary members were present. . Mrs. L. Crawley gave an interest- paper on Matthew Fontaine Siflpiry and Mr. N. R. Featherston, county historian, gave a full paper onGen. Stonewall Jackson and his political history of Col. Thos. S. Bocock, speaker of the Confederate House for four years, was read by the president, who is emphasizing the local history of the Confeder- asy. Mrs. S. M. Thornton will give in the future a sketch of the Mc- Dearmon family Mrs. Ola Patte- son will give the part the Torrences andtPattesons played in the mak- ingpf Appomattox County. The February meeting will be held the third Thursday, at 330 P. M. Mesdames C. F. James and L. Crawley will be hostesses. Leaders of the program Mrs. R. C. Moore, the Cabinet Mrs. J. A. Burke, Dip lomatic History of the Confederate States Alexander Stephens and the Hampton Roads Conference, 1865."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Fontaine Siflpiry and Mr. <mark>N</mark>. R. <mark>Featherston</mark>, county historian, gave a"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Fontaine Siflpiry and Mr. <mark>N</mark>. R. <mark>Featherston</mark>, county historian, gave a"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [204.66, 424.3, 525.41, 900.44], "bbox_id": "885659c82c", "file": "AppomattoxNewspapers_1926-1933a_0573.pdf", "page": 1, "text": "the first of January, is able to be out again.   Miss Evelyn .Hawthorne is visiting her sister, Mrs. F. H. Hawley.    Mrs. N. R. Featherston spent Sunday with her sister, Miss Jane Marshall, at Hixburg.    Miss Lena Stratton, of Wil liamsburg, will spend Easter with Miss Thelma Morris.   m Mrs. W. D. Griggs and chil dren of Hopewell visited her brothers, S. J. and C. M. Evans, last week.    Mr. and Mrs. B. H. Coleman and family and Miss Kathleen Coleman, of Mount Hope, W. Va., spent several days in the home of Mrs. E. R. Gleen last week.    Mr. and Mrs. T. J, Harvey, John Harvey, and Norvell Woodson, of Richmond spent Sunday in the home of Mrs. Helen Welch.   Misses Frances Spencer and Virginia Lee Thompson, of Randolph-M a eon College, Lynchburg, will spend the Eas- Miss Betty McGill, of Nor- j R  W  M h  m e  f the. folk, is spending this week in  W M Thompson. the home of R. L. Burke. m . t r   Mr. and Mrs. J. W. Meggin- Charles A. Truax will spend Kn and !c  ? illy of Lynch- thi, week-end with 7redTat  s T Mr and Pamplin. S T Me8gmson, near    here."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "F. H. Hawley.    Mrs. <mark>N</mark>. R. <mark>Featherston</mark> spent Sunday with her"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "F. H. Hawley.    Mrs. <mark>N</mark>. R. <mark>Featherston</mark> spent Sunday with her"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Bristow, J. K. Hannah, <mark>N</mark>. R. <mark>Featherston</mark> and J. A. Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Bristow, J. K. Hannah, <mark>N</mark>. R. <mark>Featherston</mark> and J. A. Burke."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [506.18, 327.81, 668.41, 577.01], "bbox_id": "9c61446b51", "file": "AppomattoxNewspapers_1933-1936a_0115.pdf", "page": 1, "text": "S. A. Ferguson, for many years a well known citizen of Appomatt ox, passed away Friday, August 24, at his home at the old court house. He wag a son of fhe late Jarrett and Judith Parfe Ferguson. Funeral services were conducted from the family residence and were in charge of his pastor, the.Rev. W. M. Thompson, assisted by the Rev. C. W. McElroy, of Norton. Mr. Ferguson rad been ta con sistent member of Liberty Baptist church for some thirty years. The presence of a large number of fr iends and the many beautiful flow ers witnessed the high esteem in which he was held. He is survived by his widow, Mrs. Bessie Rosser Ferguson, and two daughters, Mrs. Charles Allen Cart er, of Tower Hill and Mrs. Guy L. Furr, of Bluefield, W. Va. The active pallbearers were Dan and Boyd Ford, James Hamilton, Cleveland Paulette, Edward Hamil ton and R. E. Fitzgerald. Honorary pallbearers were N. R. Featherston."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Fitzgerald. Honorary pallbearers were <mark>N</mark>. R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Fitzgerald. Honorary pallbearers were <mark>N</mark>. R. <mark>Featherston</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2334.04, 255.25, 2481.58, 1236.74], "bbox_id": "7cdaa51b7a", "file": "AppomattoxNewspapers_1962-1965a_0371.pdf", "page": 1, "text": "pomastox system1 been in the caliber of men who have filled - the office of superintendent. The fact that only five men filled this position in almost a century attests to their dedication and excellent accomplishments. In addition to those superintend ents already mentioned may be added these Mr. J. Kirk Hannah 1889-1912 who served as a board member, before becoming superintendent Mi N. R. Featherston 1913- 1926 who was the son of the first public school teacher of the county and a teacher himself. Mr. J. A. Burke 1926-19621 who was a graduate of Appomat tox High School as well as a teacher there. The following statistics will il lustrate in a small way the re sults of Mr. Burkes foresight and leadership No. of white schools. 1926.1962 One-teacher 16 0 Two-teacher 3 1 Three-teacher 5 1 Four-teacher 2 2 Seven-teacher 0 1 Nineteen-teacher 0 I High School 2 l No. of Negro Schools One-teacher 13 1 Two-teacher 4 1 Sixteen-teacher 0 1 High School 0 1 Total Value of school property 1926  196,800 1962!2,119,414 In 1962 Mr. Earl J. Smith, Jr. was appointed to succeed Mr, Burke. No history of a rural school system of by-gone days is com plete that does not mention the place of the school as a com munity center and the teacher as the leader in the community. Appomattox is no exception. Be cause the school was usually near the center of the communi ty  therefore, in walking dis tance or later driving distance it was used for religious meet ings, especially for Sunday School for those too far to go to churoh, the Grange and other farm organizations. How many people have enjoyed the fellow ship of each other while plann ing and executing box parties, pie suppers, sings, oyster supp ers and bazaars to make money for the school, but at the same time have a little fun along with it. The teachers visit in the home was once a great occasion to teacher, pupil and! parents. Her visit warded off trouble with Johnny as he great to know her as an individual. She could know Johnny better as she saw him in his natural surroundings. After she had spent the night in ihis home she was usually his friend. The teacher was able to introduce new ideas into the home since she usually was one of the most respected individuals of the com munity. She taught Sunday School, played the organ, may be .got up a play or Christmas program at church or school. Unconsciously she was molding opinions. Sometimes she capti vated the heart of a young swain who saw to it that she remained in the community where she reared a family and in turn be came .a patron yes, a better patron than some she had had. As schools grew and roads im proved the whole faculty was invited to supper in a number of the homes. There good food and good fellowship were in such abundance that each person pre sent felt inspired to return to his job and do a better piece of work. To the unknown teacher be longs much of the credit for the progress of the system."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "before becoming superintendent Mi <mark>N</mark>. R. <mark>Featherston</mark> 1913- 1926 who was"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "before becoming superintendent Mi <mark>N</mark>. R. <mark>Featherston</mark> 1913- 1926 who was"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.44, 777.85, 1756.93, 1282.96], "bbox_id": "d4121384f7", "file": "AppomattoxNewspapers_1926-1933a_0584.pdf", "page": 1, "text": "PERSONAL MENTION Miss Ruby Upton is visiting friends in Washington, D. C., this week. burg, spent Sunday in the burf, spent Sunday in the home of W. R. Reynolds. Mrs. W. T. Steele spent the week-end in Lynchburg with relatives. T. H. Morris, of Richmond, visited his mother, Mrs. Lovel ls Morris, here last night. E. W. Taylor and J. A. Burke spent Saturday in Char lottesville. Mrs. Jimmy Carter is spend ing several days in Peters burg. Mrs. Luther Carwile, of Dar lington Heights, spent the week-end in the home of J. M. Rosser. W. F. Woolfork and family, of Petersburg,  spent the week-end in the home of W. M. Hancock. Mrs. Ellen Chambers, of Staunton, visited her sister, Mrs. N. R. Featherston, Fri day.  Charles James, of Richmond Medical College, spent the week-end with his parents, Dr. and Mrs. C. F. James. Mrs. A. B. White, of Lynch burg, is spending this week with her parents, Mr. and Mrs. L. E. Smith.  Misses Emma Smith and Lucye CaldweH spent the week-end in the home of Hun ter Smith, in Fayettville, N. C. Dr. and Mrs. D. E. Caldwell, Jr., have returned from a two weeks visit through Georgia and the Carolinas."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "visited her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>, Fri day.  Charles James,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "visited her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>, Fri day.  Charles James,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [785.47, 1463.41, 893.24, 1745.81], "bbox_id": "16ecc5164b", "file": "AppomattoxNewspapers_1943-1947a_0462.pdf", "page": 1, "text": "-nrs. . L,. rerguson R. L. Burke Mrs. Calvin H. Robi J. H. OBrien J. A. Burke N. R. Featherston C. W. Smith W. M. Abbitt H. W. McKinney D. A. Corner G. F. Abbitt, Jr. L. F. Ferguson F. J. Smith N. E. Farrar F. A. OBrien Moses Motor Co. Hi-Way Service Stati L. S. McCormick Larry Young Poe Hardware Co. David T. Robertson J. W. Martin Mrs. Mary L. Murphv R. E. Wilbun H. C. Pulliam H. G. Johnson R. W, Moore R. C. M oore E. T. Guill Percy L. Thompson"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "OBrien J. A. Burke <mark>N</mark>. R. <mark>Featherston</mark> C. W. Smith W."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "OBrien J. A. Burke <mark>N</mark>. R. <mark>Featherston</mark> C. W. Smith W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [371.49, 597.17, 532.9, 1159.17], "bbox_id": "b0829cc83d", "file": "AppomattoxNewspapers_1933-1936a_0264.pdf", "page": 1, "text": "Neld LeGrande spent the week end in Roxboro N. C. a a a Miss Anna Lee Fireman is visiting relatives in Watsika 111.   9  Miss Emily Featherston is visit ing in Bon Air this week. 0 0 0 Miss Telma Morris spent the week end in Lynchburg.   a Mrs. L. D. Puckett and daughter, Virginia, of Roxboro, N. C. are visit ing relatives heer.    MLss Patty Featherston of Roanoke is spending this wqsk with her bro ther N. R. Featherston. 0 0 Mr.and Mrs.Jones Caldwtell of Lynchburg visited his mother, Mrs. M C. Caldwell last week.    Mrs. Allen Carter, of Gladston is visiting her mother, Mrs. S. A Ferguson. ............    W. G. Moose of Fieldale spent the weekend in th home of Mrs. H. C. Babcock a a a Mrs. Louella Morris and Mrs. Helen Welch spent the weekesnd in Lynch burg.    Garland Plunkett has .returned from a six week stay at Fort Wash ington, Maryland. a a a Mr. and Mrg, Lewis B. Winters of here are visiting relatives in Lancas ter, Pa. a a a Mr. and Mrs. Harold Stosscl and son of Front Royal, are visiting Mr. and Mrs. Ed Purdum. a a a Clyde OBrien and Miss Cecil Con ner have returned from a visit in Wheeling, West Virginia. a a a Mrs. F. L. Murphy has returned from the Hospital in Lynchburg and is getting along nicely.  a a Bertrand Lee left Thursday for Langley Field where he has enlisted in the Air Service of the United States Army, .. . . Maa,a"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "with her bro ther <mark>N</mark>. R. <mark>Featherston</mark>. 0 0 Mr.and Mrs.Jones"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "with her bro ther <mark>N</mark>. R. <mark>Featherston</mark>. 0 0 Mr.and Mrs.Jones"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2286.96, 1033.09, 2460.92, 1210.63], "bbox_id": "f749008b2d", "file": "AppomattoxNewspapers_1943-1947a_0210.pdf", "page": 1, "text": "N. R. Feather.tcn announced this week that pictures at- former com monwealth attorneys would be pre sented to the county at exercizes beginning at 12 oclock, June 1st., in the commonwealth attorneys office at the court no use. County Clerk C. W. Smith will preside and N. R. Featherston will present the pictures, which will be accepted for the county by W. M. Abbitt. Pictures to -be pres anted include those ol Thos. S. Boeock, Lewis Daniel Isbell, Crawford Jones, Ed win R. Woodson, Thos. J. Thorn hill, David A. Carif-tiu-v W. Court ney Franklin, Hal D Flood, Sam uel L. Ferguson ana Joel W.Flood."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Smith will preside and <mark>N</mark>. R. <mark>Featherston</mark> will present the pictures,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Smith will preside and <mark>N</mark>. R. <mark>Featherston</mark> will present the pictures,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1783.23, 462.44, 1947.36, 730.14], "bbox_id": "b588dff114", "file": "AppomattoxNewspapers_1915-1918a_0173.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vera A. V. Inge, Appomattox J. K. Hamilton, Evergreen P. W. Colfeman, Pamplin . T. Ligon, Pamplin C. E. Lewis, ara J. P. Alvis, Spout Spring J. Davidson, Appomattox F. A. Obrien, Appomattojc. Southside District. Supervisor, L. E. Smith, Appomat tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, W. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts. Appomattox. Clover Hill District Supervisor, W. H. Ligon, Pamplin, Constable, E. M. Drinkard, Appomat tox Road Commissioner, S. A. Fer guson, Appomattox Justice of the Peace, T. T. Hardy, Pamplin L. M. Southall, Evergreen and F. A. OBri an, Appomattox. Overseer Poor, D.  P. Ferguson. Stonewall District  Supervisor, S. R. Martin, Stapelton  Constable, E. A. Walton, Bent Creek  Road Commissioner, H. G. Harding,  Oakville Justices of the Peace, Chas. F. Button. Walkers Ford F. G. Thorp, Oakville Overseer Poor, R. T. Phelps. BUCKINGHAM."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. V."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. V."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1476.0, 593.83, 1680.83, 674.38], "bbox_id": "0c138adb58", "file": "AppomattoxNewspapers_1915-1918a_0210.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vera A T Inge. Appomattox J. R. Hamilton, I J u ly 19th Evergreen P- W. Coleman, Pamplin  J T Ligon, Pamplin C. E. Lewis, Vera J. P. Alvis, Spout Spnnjg J. Davidson, Appomattox F. A. O. _ o brien, Appomattox. Southside District. Supervisor, L. E. Smith, Appomat tox. Constable, R. C. Mann, Appo-"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A T"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A T"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.46, 602.74, 1635.45, 855.59], "bbox_id": "0b75eba042", "file": "AppomattoxNewspapers_1915-1918a_0230.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vera A T. Inge, Appomattox J. R. Hamilton, Evergreen P. W. Coleman, Pamplin J. T. Ligon, Pamplin C. E. Lewis, Vera J. P. Alvis, Spout Spring J. O. Davidson, Appomattox F. A- Obrien, Appomattox. Southside District.  Supervisor, L. E. Smith, Appomat- tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, w. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts. Appomattox. Clover Hill District Supervisor, W. H. Ligon, Pamplin, Constable, E. M. Drinkard, Appomat tox Road Commissioner, S. A. Fer guson, Appomattox Justice of the Peace, T. T. Hardy, Pamplin L. M. Southall, Evergreen and F. A. OBri an, Appomattox. Overseer Poor, D.  P. Ferguson. Stonewall District Supervisor, S. R. Martin, Stapelton Constable, E. A. Walton, Bent Creek Road Commissioner, H. G. Harding, Oakville Justices of the Peace, Chas. F. Button. Walkers Ford F. G. Thorp, j Oakville Overseer Poor, R. T. Phelps."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A T."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A T."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.02, 388.89, 1677.47, 649.89], "bbox_id": "531e588056", "file": "AppomattoxNewspapers_1915-1918a_0250.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vera A. T. Inge, Appomattox J. R. Hamilton, Evergreen P. W. Coleman, Pamplin J. T. Ligon, Pamplin C. E. Lewis, Vera J. P. Alvis, Spout Spring j. O. Davidson, Appomattox F. A. Obrien, Appomattox. Southside D istrict. Supervisor, L. E . Smith, Appomat tox. Constable, R. C. M, Appo mattox. Road Commissioner, W. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts. Appomattox. Clover Hill D istrict Supervisor, W. H. Ligon, Pamplin, Constable, J3. M. Drinkard, Appomat tox Road Commissioner, S. K. Fer guson, Appomattox Justice of the Peace, T. T. Hardy, Pamplin L. M. Southall, Evergreen and F. A. OBri-l an, Appomattox.-  Overseer Poor, D. P. Ferguson. I Stonewall D istrict j Supervisor, S. R. M artin, Stapelton Constable, E. A. W alton, Bent Creek I Road Commissioner, H. G. Harding,! Oakville Justices of the Peace, Chm  F. Button. Walkers Ford F. G. Thorp,  Oakville Overseer Poor, R. Phelps. BUCKINGHAM.  f t"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. T."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. T."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1499.32, 388.44, 1656.09, 649.67], "bbox_id": "c65178f84b", "file": "AppomattoxNewspapers_1915-1918a_0254.pdf", "page": 1, "text": "N. R. Featherston, Supt, Vera A. T. Inge, Appomattox J. R. Hamilton, Evergreen P. W. Coleman, Pamplin J. T. Ligón, Pamplin C. E. Lewis, Vera J. P. Alvis, Spout Spring j. 0. Davidson, Appomattox F. A. Obrien, Appomattox. Southside District. Supervisor, L. E. Smith, Appomat-1 tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, W. 11. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox I. W. Moses, Appomattox J. M. Knott. Appomattox. Clover Hill District Supervisor, W. H. Ligón, Pamplin, Constable, E. M. Drinkard, Appomat  tox Road Commissioner, S. A. Per guson, Appomattox Justice of the Peace, T. T . Hardy, Pamplin L. M. Southall, Evergreen and F. A. OBri an, Appomattox. Overseer Poor, D. P. Ferguson. Stonewall District Supervisor, S. R. Martin, Stapelton Constable, E. A. Walton, Bent Creek Road Commissioner, H. G. Harding, Oakville Justices of the Peace, Chas. F. Button. Walkers Ford F. G. Thorp, Oakville Overseer Poor, R. T. Phelps. BUCKINGHAM."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt, Vera A. T."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt, Vera A. T."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.71, 609.22, 1605.21, 877.62], "bbox_id": "54edb9c786", "file": "AppomattoxNewspapers_1915-1918a_0193.pdf", "page": 1, "text": "N. R- Featherston, Supt., Vera A T Inge, Appomattox J. K. Hamilton, Evergreen P. W. Coleman, Pamplin J T. Ligon, Pamplin C. E. Lewis, Vera J. P. Alvis, Spout Spring J. O. Davidson, Appomattox F. A. O brien, Appomattox. Southside District. Supervisor, L. E. Smith, Appomat tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, W. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts. Appomattox. Clover Hill District Supervisor, W. H. Ligon, Pamplin, Constable, E. M. Drinkard, Appomat tox Road Commissioner, S. A. Fer guson, Appomattox Justice of the Peace, T. X. Hardy, Pamplin L. M. Southall, Evergreen and F. A OBri an, Appomattox. Overseer Poor, D. P. Ferguson. Stonewall District Supervisor, S. R. Martin, Stapedton Constable, E. A. Walton, Bent Creek Koad Commissioner, H. G. Harding, Oakville Justices of the Peace, Chas. F. Button. Walkers Ford F. G. Thorp, Oakville Overseer Poor, R. T. Phelps. BUCKINGHAM."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R- <mark>Featherston</mark>, Supt., Vera A T"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R- <mark>Featherston</mark>, Supt., Vera A T"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.14, 599.85, 1605.73, 868.54], "bbox_id": "911005aae1", "file": "AppomattoxNewspapers_1915-1918a_0201.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vera A. T Imre. Appomattox J. It. Hamilton, Evenneen P. W. Coleman, Pamplin j T Ligon, Pamplin C. E. Lewis, Vera Ahns, Spout Spring J. O. Davidson, Appomattox, F. A. Obrien, Appomattox. . Southside D istrict. Supervisor, L. E. Smith, Appomat tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, W. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts. Appomattox. __ Clover Hill D istrict Supervisor, W. H. Ligon, Pamplin, Constable, E. M. Drinkard, Appomat tox Road Commissioner, S. A. Fer guson, Appomattox Justice of the Peace, T. T. Hardy, Pamplin L. M. Southall, Evergreen.and F. A. O Bri an, Appomattox. Overseer Poor, D. P. Ferguson.  . Stonewall D istrict Supervisor, S. R. M artin, Stapelton Constable, E. A. Walton, Bent Creek Road Commissioner, H. G. Harding, Oakville Justices of the Peace, Chas. F. Button. Walkers Ford F. G. Thorp, Oakville Overseer Poor. R. T. Phelps. BUCKINGHAM."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. T"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vera A. T"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1472.98, 383.25, 1623.45, 494.95], "bbox_id": "2536c2e488", "file": "AppomattoxNewspapers_1915-1918a_0262.pdf", "page": 1, "text": "N. R. Featherston, Supt, Vera A t Imre. Appomattox J. i t Hamilton, Evergreen P. W. Coleman, Pamplin j TLteon, Pamplin C. E. Lewis,  Vera J. P- Alvis, Spout Spring j. 0. Davidson, Appomattox F. A. O brien, Appomattox. Southards D istrict. Supervisor, L. K Smith, Appomat tox. Constable, R. C. Mann, Appo mattox. Road Commissioner, W. H. Lewis, Appomattox. Justice of the Peace, W. L. Brown, Appomattox T. W. Moses, Appomattox J. M. Knotts."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt, Vera A t"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt, Vera A t"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.69, 602.41, 1635.23, 858.24], "bbox_id": "8468e0a319", "file": "AppomattoxNewspapers_1915-1918a_0234.pdf", "page": 1, "text": "N. R. Featherston, Supt., Vara A. Inge, Appomattox J. R. Hamilton, vergreen P. W. Coleman, Pampjin T. Ligon, Pamplin C. E. Lewis, era J. P. Alvis, Spout Spring J. . Davidson, Appomattox FT A brien, Appomattox. Southside District. Supervisor, L. E. Smith, Appomat- x. Constable, R. C. Mann, Appo- attox. Road Commissioner, W. H. wis, Appomattox. Justice of the eace, W. L. Brown, Appomattox T. , Moses, Appomattox J. M. Knotts, ppomattox. Clover Hill District Supervisor, W. H. Ligon, Pamplin, nstable, E. M. Drinkard, Appomat- Road Commissioner, S. A. Fer- son, Appomattox Justice of toe eace, T. T. Hardy, Pamplin Appc r. T. Hardy, Pamplin L. M. uthall, Evergreen and F. A. OBri- Appomattox. Overseer Poor, D. Ferguson. Stonewall District upervisor, S. R. Martin, Stapelton nstable, E. A. Walton, Bent Creek pad Commissioner, H. G. Harding, akville Justices of the Peace, Chas. , Button. Walkers Ford F. G. Thorp, akville Overseer Poor, R. T. helps."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vara A. Inge,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, Supt., Vara A. Inge,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.14, 602.98, 1772.24, 685.21], "bbox_id": "dfa7e62e3f", "file": "AppomattoxNewspapers_1915-1918a_0185.pdf", "page": 1, "text": "N. R. Featherston, SupL, Vera A .. ----- --------   T. Inge, Appomattox J. R. Hamilton, I and children and Mrs. J L Fos- Evergreen P. W. Coleman, Pam plinL D    r o s J. T. Ligon, Pamplin C. E. Lewis, I e r v ere thff guests at the home Vera J. P. Alvm, Spout Spring J.lof Mr. and Mrs. J P L Flemh- 0. Davidson, Appomattox i? A.T Jile8 O brien, Appomattox. sman, Sunday. Southside District.  . B n n , Supervisor, L. E. Smith, Appomat- M r   G ofer, re tu rn e d tox. Constable, R. c. Mann, A ppo-to B luefield, W. Va., M onday"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, SupL, Vera A .. ----- --------   T."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark>, SupL, Vera A .. ----- --------   T."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [344.91, 560.64, 664.2, 789.83], "bbox_id": "33bda621c5", "file": "AppomattoxNewspapers_1908-1909a_0498.pdf", "page": 1, "text": "N. R. Featherston on a tour pay in person to the deputies, through southwest Virginia last R. L. Burke, Treas. Appo- week. m att ox County. A. J. Harlow and,, family, of 2t Jun 2 Orange, were recérit visitors at . __. the Appomattox hotel.  A  tt and son, John, Misses Catherine and Virginia  my.,v wprft Irby, of Farmville are visiting week-end at T.JL. V in the home of J. E. Sears. Miss Maud Mellen, who has Miss . ri k been visiting Mrs. C. F. James, oke 8. H. Collins, of Frederick has returned to Alabama. Md., Miss Eleano , Mr. and Mrs. C. E. Beale, Of Montgomery, Ala, and Miss Co- Morristown, ,Tenn, have been rme Collins, of visiting Mr. Beals sister, Mrs.U-. are visiting Mrs. F. E. Bab- W. D. Patterson.  .cock. 3  . . Fred Thompson, recent grad- Mr. and Mrs. E. L. Wmgo uate of Wake Forest, has been and Mrs. E. H. Wmgo of Wash- visiting his brother. Rev. W. M. lington, D. C., spent thei week- Thompson. -.end with Mr. and Mrs. T. S. Mrs. G. R. Gimbert, of WestMcNally. Virginia, spent several days Mr. and Mrs. James Evans,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark> on a tour pay"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "<mark>N</mark>. R. <mark>Featherston</mark> on a tour pay"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [150.52, 468.17, 473.43, 1029.75], "bbox_id": "360678ee46", "file": "AppomattoxNewspapers_1908-1909a_0514.pdf", "page": 1, "text": "Mrs. W V. Gills is back from Mr. and Mrs. J. R. Thomas, a recent visit in Lynchburg. of Lynchburg, were the week- Mr. Woodrow Woolridge has. end guests of Miss Bertha Tor- ben sick but is improving now. rence. Alfred OBrien is home from I Jones Caldwell is spending a visit in Roanoke. his vacation here at the Home A. W. Almond is very sick of his parents, Mr. and Mrs. M. with flu at his home here. 1C. Caldwell. - - Miss Florence Gregory Bpent Mr. and Mrs. W. T. Wright Sunday at home. of Lynchburg, were the guests Mrs. William Marshall, of in the home of Mr. and Mrs. W. j Roanoke, has been visiting Mr. H. Wright recently and Mrs. R. E. Caldwell, Sr. I Mrs. Paul Ferguson, of Sta- Miss Mamie Inge, of Red pleton, is visiting her mother, House, visited at home this Mrs. A. H. Gregory, afld ceje- week-end. brating her first wedding an- Ground is broken for the new niversary.  home of Mr. and Mrs. T. W. Jesse Tumee home burned Ferguson, on Lee-Grant Ave. Friday while he was in Lynch- Miss Gracie Hubbard, w ho burg with his wife, who is in has been cik with flu is out again. .  Miss Margaret Pittman, of Richmond, visited friends at Evergreen last week-end. Dick Smith, of Lynchburg, paid a brief visit to relatives here Wednesday. Jack Scott is up again, after being in bed several days with a severalcase of flu. Mr. and Mrs. T. A. Walton left Monday to visit their daugh ter in Disputanta. Mrs. W. M. Thompson spent several days last week with her sister, Mrs. L. L Gayle., Thomas Marks,!, of Lynch burg, has been visiting James Langran. Mr. and Mrs. S. A. Ferguson returned Tuesday from a trip to West Virginia. Mrs. W. R. Reynolds and daughter, Hazel, drove to Rich- , mond Tuesday.  Mrs. Mattie Rudd Harwood visited Mrs. N. R. Featherston a while Monday. Miss Mabel Dulta, of Pamp- lin, visited in the home of Miss Mary Trent last week-end. Senator S. L. Ferguson and Col, Joel W. Flood motored to"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Rudd Harwood visited Mrs. <mark>N</mark>. R. <mark>Featherston</mark> a while Monday. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Rudd Harwood visited Mrs. <mark>N</mark>. R. <mark>Featherston</mark> a while Monday. Miss"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [359.5, 342.4, 522.91, 829.08], "bbox_id": "5469154017", "file": "AppomattoxNewspapers_1926-1933a_0498.pdf", "page": 1, "text": "Mrs. Ruth Spelman and son, Richard, of Miami, Fla., are guests of Mrs. W. M. Morris. Mrs. Bettie Dunahoe, of Blacksburg, is a guest in the homes of Mrs. J. D. and Mrs. Wiley Morris. Richard McDearmon was at home Tuesday, en route to Roanoke, where he will take State Bar examination. Col. J. W. Flood attended court at Lunenburg Tuesday. S. L. Ferguson and wife have returned from a yisit in Rich mond. Miss Mary T. Gills is home for the summer. Miss Virginia Thompson is home from R.M.W.C. George M. Goodridge of Richmond, visited Miss Avis Brown Monday. W. R. Reynolds accompanied N. R. Featherston on a tour through southwest Virginia last week. A. J. Harlow and family, of Orange, were recent visitors at the Appomattox hotel. Misses Catherine and Virginia Irby, of Farmville are visiting n the home of J. E. Sears. Miss Maud Mellen, who has been visiting Mrs. C. F. James, has returned to Alabama. Mr. and Mrs. C. E. Beale, of Morristown, ,Tenn, have been visiting Mr. Beals sister, Mrs. W. D. Patterson. Fred Thompson, recent grad uate of Wake Forest, has been visiting his brother, Rev. W. M. Thompson. Mrs. G. R. Gimbert, of West Virginia, spent several days last week in the home of S. A."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "W. R. Reynolds accompanied <mark>N</mark>. R. <mark>Featherston</mark> on a tour through"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "W. R. Reynolds accompanied <mark>N</mark>. R. <mark>Featherston</mark> on a tour through"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1246.49, 840.98, 1416.54, 1037.43], "bbox_id": "cd6edceabe", "file": "AppomattoxNewspapers_1947-1949a_0255.pdf", "page": 1, "text": "Mrs. Price. acknowledges the following contributions to the fall and spring building drive Bank of Appomattox 25.00 Moses Mo ses Motor Co. 25.00 R. L Burke 10.00 J. C. Davidson, 10.00 Mr. and Mrs. F. L MurpKy 25.00 Mr. C. S. Jenkins 10.00 Mr. A. R. Harwood, Sr. 10.00 Mr. C. S. Jenkins 10.00 Hunter Lumber Co. .50 Mr. N. R. Featherston 5.00 Mrs W P Gills 5.00 Mr. C W. Cawthorn, Mr. W. M. Abbitt 20.- 00 i iMjr. Lester Harvey 10.00 Mrs. Don Moses 1.00 Mr. J. W. Martin 1.00 Mr. and Mrs. A- T. Inge 10.00 Miss Alice Harwood 5.00 Mr. A. R. Harwood 10.00."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Lumber Co. .50 Mr. <mark>N</mark>. R. <mark>Featherston</mark> 5.00 Mrs W P"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Lumber Co. .50 Mr. <mark>N</mark>. R. <mark>Featherston</mark> 5.00 Mrs W P"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1853.05, 367.98, 2046.61, 1304.61], "bbox_id": "589fe555d5", "file": "AppomattoxNewspapers_1939-1943a_0216.pdf", "page": 1, "text": "Mrs. L. D. Puckett, of Roxboro, and Mrs. W. S. Bryant, of Cullen spent the week-end with their sis ter, Mrs. Ola Patteson. They were dinner guesis Sunday of Mrs. T. U . Conner. M r. and Mrs. D. A . Conner en tertained their children and a few other guests for Christmas dinner. Guests included Sam Conner, oi Pascagoula, Mississippi Mr. ana Mrs. Ray Houchens and son, Jerry, of Petersburg Mrs. Lucy Conner, of Appomattox Mr. and Mrs. P. W. Coleman, of Evergreen j Mr. and Mrs. L. V. Allen and Dorothy Allen, of Pile nix. The table deco rations were of Christmas green and .white flowers. Mrs. W . H . Miller, of Massa chusetts, will arrive next week to visit M r. and Mrs. George F . Lan- gran. Floyd Mitchell is recovering from i recent tonsil operation. Bolly Conner spent the holidays at Vera. Dr. find Mrs.James Edward Piyot of Baltimore, returned home Sun day after visiting M r. and Mrs. S. S. Coffman. Dr. and Mrs S. S. Shouse, of New York, have been spending sev eral days at Eldon Farm . Joel Guill has returned to his home after receiving treatment in a Lynchburg hospital. Miss Beulah Ferrell and Raymond fiamerson are spending today in Roanoke. Mr. and Mr3. Emery CundUT, of Al avist?. and Mi s Nancy Cundiff, pent Sunday with Mr. and Mrs. George F. Abbitt, Jr. F . B Porter will return tonight after visiting in Petersburg. Mr. and Mrs. Robert Lynch yerc visitors this week in Lawrence- ille. Miss Myrtle Williams and Joe vYilliams, of Lexington were guests f Miss Clara Whitney Moses Tues- iay night. I The contract bridge club will meet Friday evening with Mrs. L. L. Gayle. We qre glad to hear that Mrs. H. P.. Davis is recovering from a recent illness. N. R Featherston and Miss Em ily Featherston visited Miss Patty Featherston in Roanoke one day last week. Willie Smith is working in Ports mouth . L. E. Morris, of Richmond spent Christmas at his home here. Mr. and Mrs. D. B. Henderson, and daughter, Peggy, of Richmond, visited her mother, Mrs. S.L .F er guson . Braxton L. Hancock was a visi- I tor in Appom-attpx this week. I Mrs. Henry B. Pack is spending I some time with Misses Emma and Lucy Smith. Mrs. C. C. Pierce and daughter returned to their horns in Farmville Wednesday after visiting her father 1. Lloyd Lewis. Miss Catherine Burge, of Farm- ille S .T .C ., has been spending the holidays here with her parents. Dr. and Mrs. Havilah Babcocki , and son have returned to Colum-1 bia, S .C ., after spending the holi-1 days with Mr. and Mrs. I. H . I I Cheatham at Hotel Appomattox. j"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "from a recent illness. <mark>N</mark>. R <mark>Featherston</mark> and Miss Em ily"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "from a recent illness. <mark>N</mark>. R <mark>Featherston</mark> and Miss Em ily"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [151.45, 307.66, 468.3, 1097.47], "bbox_id": "c165702e26", "file": "AppomattoxNewspapers_1926-1933a_0536.pdf", "page": 1, "text": "Mrs. IS. E. Torrence recently. Miss Eula Howerton is visit ing her sister, Mrs. H. H. Cald well. Hubert Caldwell is getting on nicely at Virginia Baptist hospital. H. C. Pulliam spent last week-end with friends at Rap- pahanock. Agricultural boys are spon soring a square dance at the hall Friday night. Miss Ocie Hutton, of Lynch- E. A. Cole spent Friday and burg, sent the week-end with Sa-nrday in Roar.vAe. Mrs. W. P. Gills is back from a recent visit in Lynchburg. Mr. Woodrow Wooiridge has been sick but is improving now. Alfred OBrien is home from I a visit in Roanoke. j A. W. Almond is very sick with flu at his home here. Miss Florence Gregory spent Sunday at home. Mrs. William Marshall, of Roanoke, has been visiting Mr. and Mrs. R. E. Caldwell, Sr.  Miss Mamie Inge, of Red House, visited at home this week-end. Ground is broken for the new home of Mr. and Mrs. T. W. Ferguson, on Lee-Grant Ave. Miss Graqie Hubbard, w ho has been cik with flu is out again. Miss Margaret Pittman, of Richmond, visited friends at Evergreen last week-end. Dick Smith, of Lynchburg, paid a brief visit to relatives here Wednesday. Jack Scott is up again, after being in bed several days with a severalcase of flu. Mr. and Mrs. T. A. Walton left Monday to visit their daugh ter in Disputanta. Mrs. W. M. Thompson spent several days last week with her sister, Mrs. L. L. Gayle. Thomas Marks, of Lynch burg, has been visiting James Langran. Mr. and Mrs. S. A. Ferguson returned Tuesday from a trip to West Virginia. Mrs. W. R. Reynolds and daughter, Hazel, drove to Rich mond Tuesday. Mrs. Mattie Rudd Harwood visited Mrs. N. R. Featherston a while Monday. Miss Mabel Duliil, of Pamp- lin, visited in the home of Miss Mary Trent last week-end. Senator S. L. Ferguson and Col, Joel W. Flood motored to Richmond Tuesday. Adfleld McCain, of Lynch burg, was a visitor here Tues day.Miss Phoebe OBrien spent last week-end with her sister,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Rudd Harwood visited Mrs. <mark>N</mark>. R. <mark>Featherston</mark> a while Monday. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Rudd Harwood visited Mrs. <mark>N</mark>. R. <mark>Featherston</mark> a while Monday. Miss"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1661.1, 488.21, 1834.0, 629.96], "bbox_id": "44ef6bd9ff", "file": "AppomattoxNewspapers_1939-1943a_0194.pdf", "page": 1, "text": "Mrs Elizabeth Eakin and Mrs. M T Parrish and daughter, Bar bara lEakin, of Lexvng dn, spent several days this week in the home of Mrs. G. L. Doss. Mr  nd Mrs. R E Baldwin, of Richmond, and Miss Patty Feather -ton. of Roanok? were visitors in he home of N. R. Feat-herston during the hoi.days. I Miss Mildred McDearmon. of Col-  vmbia, S.C. and Miss Elizabeth McDearmon and R chard McDeai mon. of Richftiond, spent Thanks-"}, "highlight": {"text": {"matched_tokens": ["N", "Feat-herston"], "snippet": "in he home of <mark>N</mark>. R. <mark>Feat-herston</mark> during the hoi.days. I"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Feat-herston"], "snippet": "in he home of <mark>N</mark>. R. <mark>Feat-herston</mark> during the hoi.days. I"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.97, 781.11, 1755.16, 1259.38], "bbox_id": "30f5102d43", "file": "AppomattoxNewspapers_1908-1909a_0584.pdf", "page": 1, "text": "Miss Ruby Upton is visiting friends in Washington, D. C., this week. burg, spent Sunday in the burf, spent Sunday in the home of W. R. Reynolds. Mrs. W. T. Steele spent the week-end in Lynchburg with relatives. T. H.. Morris, of Richmond, visited his mother, Mrs. Lovel ls Moms, here last night. E. W. Taylor and J. A. Burke spent Saturday in Char lottesville. Mrs. Jimmy Carter is spend ing several days in Peters burg. Mrs. Luther Carwile, of Dar lington Heights, -spent the week-end in the. home of J. M. Rosser. W. F. Woolf ork and family, of Petersburg,  spent the w.eek-end in the home of W. M. Hancock. Mrs. Ellen Chambers, of Staunton, visited her sister, Mrs. N. R. Featherston, Fri- day. .  Charles James, of Richmond Medical .College, . spent the week-end with his parents, Dr. and Mrs. C F, James. Mrs. A. B. White, of Lynch burg, is spendirig this week with her parents, Mr. and Mrs. L. E. Smith. Misses Emma Smith and Lucye CaldweH spent the week-end in the home of Hun ter Smith, in Fayettville, N. C. Dr. and Mrs. D. E. Caldwell, Jr., have returned from a two weeks visit through Georgia and the Carolinas."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "visited her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>, Fri- day. .  Charles James,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "visited her sister, Mrs. <mark>N</mark>. R. <mark>Featherston</mark>, Fri- day. .  Charles James,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "Inge, J. W. Flood, <mark>N</mark>. R. <mark>Featherston</mark>, H. Y. Spencer, H."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "Inge, J. W. Flood, <mark>N</mark>. R. <mark>Featherston</mark>, H. Y. Spencer, H."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.86, 655.04, 1664.79, 1190.17], "bbox_id": "223417bed0", "file": "AppomattoxNewspapers_1943-1947a_0126.pdf", "page": 1, "text": "Miss  Sis! home. Mr. and Mrs. E. A. Covington r erg.,recent guests of Mr. and Mrs. E. H Rogers. Mr. and Mrs. Wilbur McDearmon spent the week-end at her home at Ivor. Mrs. Paul Drinkard is reported Wetter after an attack of flu. J A. Bingham, of Richmond, spent the holidays at his home here. Mr. and Mrs. Lyle Rollins, of j Danville visited Mr. and Mrs. B. C.f Cole during the week-end. ....  , Mr. and Mrs. G.- L Dose anil daughter, LeFern, of Portsmouth -pent several days this week with Mr. and Mrs. Calvin Robinson. . Miss Mary Ferguson is out after having flu... Friends are- glad to see Mrs. Caro line Cates and son, Johnnie, out, af ter having fib. Guests of Mr. and Mrs. L. E. Smith Christmas day were Mr. and Mrs. A. B White, of Lynchburg, Mrs J H. OBrien and sons, Mr. and Mrs. R. W Stanley, and Robert Lea, of the U. S. Navy. John Goin has the flu. We wish him a speedy recovery. Miss Betty Parriott, of Farmville spent several days this week with Miss Virginia Bingham. Mr and Mrs. Harry Hunt and daughter, of Raleigh, N. C., and Mr. and Mrs. Lloyd Bldley  Richmond spent the week-end with Mrs. W, R. Reynolds L. E. Smith is out after a recent illness. A.F. Godsey and Jack Davis spent the holiday at their home here. N. R. Featherston, who has had . the flu, is better. who"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "at their home here. <mark>N</mark>. R. <mark>Featherston</mark>, who has had . the"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "at their home here. <mark>N</mark>. R. <mark>Featherston</mark>, who has had . the"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.6, 325.59, 1713.31, 1757.36], "bbox_id": "a0f700b8d7", "file": "AppomattoxNewspapers_1939-1943a_0249.pdf", "page": 1, "text": "Migs Sarah Brickhouse, ot mond spent the week-end with r8- I R. C. Moore. t I Joe Buckley, of Whington, C., is visiting Lawrence Moore tins week.   The Young Peoples D irim e n t of the Memorial Methodist .church will have a social M o n d a y ipght, March 17, at 730, All m em b ers urged to attend a n d bring a friend Lt. and M ts . J. A. Bingham spent the week-end in Harrisonburg with his sister, Mrs. Wilber Higgins.  Lt. Dale Honeycutt is out after a recent illness.. H. A. Gurney spent Friday in Richmond. Miss llene Smith spent last week in Lynchburg. Mrs. S. L. Ferguson, ho Ünder- went aft operótion .SáturdOy ait the Memorial hospital, is improving. . Vincent CollinB, of the Univer sity of Richmond, was home last week-end.- Miss Edythe OBrien, of Norfolk spent the week-end with Mr. and j Mrs. F. A. OBrien. Kenneth Barlow, who is working at Radford, spent the week-end at his home here. W, B. Caldwell had the misfor-1 tune to fall Sunday and sprain his ankle. . Mr. and MrS. Barry Dahl wHl spend the weefc-end in Richmond. . Miss Cornelia Gills will visit re latives iii Richmond this week-end. Miss Emily Featherston and N. R. Feathertonvisited fnends m Lynchburg-Sunday- Miss Emily Featherston left to day to visit her sister, Mrs. K L. BaldWHf itfRiimond, who is re covering from á recent illness. Mr. and Mis G L Doss and daugh ter and Mrs. Ola Patteson spent Sunday ih Lynchburg W W Burke was home for the week-end. Miss Elaine McDearmon will en tertain the contract bridge club on Friday evening at her home in Paraplin- 5 Ned LeGrande, who has been working m Maryland, spent several days this week at his home here. He left for military training camp this morning. I Mr. and Mrs. D. E Caldwell Jr.  spent Sunday in Lawrenceville. Mr. and , Mrs. Jim Stanley and daughter, Ann, of Richmond, were dinner guests Thursday of Mr. and Mrs. R. W. Stanley. Mr R W Stanley was hostess to three tables of bridge on Tuesday afternoon, Prizes went to Miss Frankie McKinney, Mrs. W. M. Ab- bitt and Mrs. C G. O Brien. Miss Frances Gordon, o f Rich mond spent a few days hm week with her  parents, Mr and  Mrs. G. O. Gordon. Friends here are sorry to hear of the illness o f. tibe Rev. A- . Caudle, who is a patient at the Virginia Baptist Hospital, Lynch burg, Rev jCaudle is a former pas tor of Hebron Bgptist church. Mi. and Mrs. R. LXrouch and daughter, Bebe, a n d Mrs. L B Crouch, of Roanoke, were I líq week in the home of Mr. and Mrs. W. P. FerrelL Mr and Mrs Crouch w ere . called due to the ill ness of their daughter, Virginia. Branch X. Spaulding, of the Nat ional Park Service, was in Appomat tox Wednesday. Mrs. F. B. Fitzgerald, of Pamp- lin, was a dinner guest of her daughter, Mrs. Albert Baird, last evening. John Curtis Caldwell was taken  to the Virginia Baptist hospital yesterday. We wish for him a speed- y recovery. Mrs. Albert Baird spent last night in Buckingham. lira. Elsie Lucado visited Mrs S. J. Evans in Lynchburg last week. u  Chaile Hanenkrat and fam- ibMmoved today. H. L Ligón and family will mob6 into tc Hancn krat residence Friday. A.- F. Godsey, of Portsmouth, is home this week. Norman L Ferguson, of Fort Story, spent the week-end with his j parents. Mr. and Mrs. Marshall Fcr Kuson. He was accompanied by Har py Cumby. Other guests in thesamo home were. Mr. and Mrs. Curtis Ferguson and small son. Friends here are sorry to hear of the illness of Walter Rosser, who is a patient in the Virginia Baptist MPtial. The county board of supervisors was in session yesterday. Highway employees held a safety meeting at the court house Monday night. There will be a point meeting of the Lions Club and the American Legion tonight, with a patriotic program. Mrs. S. J. Evans and daughter, Ann, Mrs. Cliff Thomas and child ren, of Lynehburg, spent Tuesday in"}, "highlight": {"text": {"matched_tokens": ["Featherston", "N"], "snippet": "this week-end. Miss Emily <mark>Featherston</mark> and <mark>N</mark>. R. Feathertonvisited fnends m"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "N"], "snippet": "this week-end. Miss Emily <mark>Featherston</mark> and <mark>N</mark>. R. Feathertonvisited fnends m"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.32, 228.38, 1788.6, 1407.54], "bbox_id": "9d4e3b576a", "file": "AppomattoxNewspapers_1926-1933a_0262.pdf", "page": 1, "text": "Mesdames W. M. Thbi son, L. E. Smith, L. Crawley, E. E. Gills and others attended the Baptist W. M. U. Conven tion in Farmville Wednesday. Just to remind you again of the lawn party at Liberty Chapel, Saturday, July 5th, be ginning at 6 oclock p. m. Pep tomist 4-H. Club. Miss Flora Lawson was a re cent guest of her brother Har ry Lawson, in Bluefield, West Virginia, where she was enter tained at the Country Club. Misses Lucy and Dot Evans, of Richmond, were week-end visitors in the home of C. W. Smith. They had as their guest Miss Dorothy Doane, of Richmond. Mrs. Helen Gunter and Mrs. Lewis Herncall, of Lynchburg, are spending a few days with their mother, Mrs. W. H. S. Barlow here Miss Mary Featherston visi ted her aunt, Mrs. Joel .Wat kins, in Farmville last week and is now spending some time visiting relatives at Hix- burg. Mr. and Mrs. J. P. Gills and son, Julian, of Bluefield, are visiting Mrs. E. E. Gills. Mr. Gills is beginning the study of a special bourse at Harvard this week.  The public will have a hance to bid on school trucks his time. See Supt. Burkes notice in this issue. Great cart hold be observed in awarding contracts especially with ref erence to drivers. Mr. and Mrs. W. L. William- ipn and family, Mr. and Mrs. Claud Jennings and family, Mr. and Mrs. R. A. Wootton and ion, Williamson, father, grand father, and great grand father, W. H. Williamson, motored to Farmville Sunday to see their sick aunt, Mrs. W. P. Man. Mrs. Schuyler Marshall and sons, Douglas Madison and Benjamin Hunter, of Charles ton, W. Va., are here to spend a while with the formers pa rents, Mr. and Mrs. M. C. Cald well. They are accompanied by Mrs. B, H. White and daughter, Mijs Evelyn, also of Charleston. Miss Elizabeth Mctjearmon entertained at Bridge .Wednes day afternoon in honor of Mrs. ?errow Harvey, of Oblin, O. Among those present beside the guest of honor jwere Mes dames L. L. Gayle N. A. Wa gers, Oscar Cole, Jacquelin Newbill of Richmond, and Misses Eleanor Harwood and iSmily Harvey, The sympathy of the entire ommunity goes out to Mr. and Mrs. Delbert Gordon in the sudden death of their!daugh ter, Virginia. The child had been sick only a few hours and died Tuesday night, following several convulsions. Interment Thursday at Gilbert Cemetery. Mrs. G. W. Smith entertained the Womans  Missionary So ciety of the Methodist Church yesterday. Good stuff was plentiful. By the way the la dies have given the handsome parsonage a new dress, every room papered, curtained and floors covered and Madam Cof fey is all smiles. ------- -  _o ---------------- Miss Nannie T. Moseley The body of Miss Nannie Trent Moseley who ieeently died in Florida was cremated and theashes brought to her old home at Wheatland and buried in the old family bury ing ground in Buckingham Ernald Moseley of Miami, Flor ida was present at the burial."}, "highlight": {"text": {"matched_tokens": ["L", "N"], "snippet": "jwere Mes dames L. <mark>L</mark>. Gayle <mark>N</mark>. A. Wa gers, Oscar"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "N"], "snippet": "jwere Mes dames L. <mark>L</mark>. Gayle <mark>N</mark>. A. Wa gers, Oscar"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.28, 904.67, 2036.46, 1130.49], "bbox_id": "3bbf404413", "file": "AppomattoxNewspapers_1943-1947a_0010.pdf", "page": 1, "text": "legginson, Alice Booker, Peggy Jhristian, Margaret Turpin, Doris Hatcher, Rachel Coleman and Ola ternesi kind of training, which in-1 Carter and Mesdames Malcolm volved 15,000 miles of practice .i0oke- Carl Martin, Russell Mar- __ _ . . . . . . combat flying, these graduates are j tjn Martin Coleman, Lyle Davidson James O Brien, of the Navy spent qualified to navigate giant Allied! atKi Marvin Reynolds, se.eral days this week with hi ! bombers to Axis targets any place! ... n  f ther, J. H. OBrien. on .he globe. i Honcrary pallbearers w e r e C T  ----- t J The Honda and an Marcos grad-! R Burke W M. Agbit Cpl. Malcolm Jones has returned uates now await assignments. Many  N. R. Featherston, Dr. D.A. Chnst- t his post at Fort McClennan, Ala., wiU j0jn tactical units, where they ian J 0 Rne Jseph Meggin- sriter an eight-day leave, due to wjl Jbe members of one of Uncle  n, Wal et Beale. Harry TujPUi- t!e illness of his first- cousin, Jam- SamV c, mbat teams of navigaui,  al.ke. Camefix, L. H. Hichaw, . - Robert McDaniel, seaman first pilo,t and bombardier. The naviga- rel ,ober on,v ci-ss, who has accidently shot at for charts the course to the target  n v  Chlllers, Buster i-ort Everglades, Ta. and return. The pilot follows the Carter, Dr. C. F. --------- ,  course so that the bombardier can w  JL k i w  rv, u Pvt. Alfred LeGrand, son of Mr. drop the bombs of liberation on the ma W,n   5  rnhSi and Mrs. W. J. LeGrand, is now 0gjective. Its a championship team era G- D Cbllerf Fle he L tioned at Camp Stoneman, Calif. 0f All-Americans . rett, T. H. Robertson, E. K. Mar- M - i Other graduates from the AAF cin and Frank Henry- Pic, George Koos, of Md., spent Coast Training Centers two We extend deepest sympathy to week-end m the home of Dr. lue aerial navigation schools will the bereaved family. D, A. Chris!lan. I ..onAmo inslTjipf.Ars phAr9P. d with i"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "now await assignments. Many  <mark>N</mark>. R. <mark>Featherston</mark>, Dr. D.A. Chnst- t"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "now await assignments. Many  <mark>N</mark>. R. <mark>Featherston</mark>, Dr. D.A. Chnst- t"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.96, 1079.05, 1745.2, 1291.54], "bbox_id": "9b9c6ac06a", "file": "AppomattoxNewspapers_1943-1947a_0508.pdf", "page": 1, "text": "j N. R. Featherston, who is pre-  paring a book on Appomattox his- l tory, this week appealed to the public for information and family data. He said  I have several times requested through the columns of j this paper and with circulars through the schools for the follow ing information- Name Year born died Married . Daughter of She born died The above information to .b e used in my Appomattox history. While a good many responded, there are many not m yet I am going to com pile it to be printed in the near future, and would not like to have to omit any family. See me at your earliest convenience."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "j <mark>N</mark>. R. <mark>Featherston</mark>, who is pre-  paring"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "j <mark>N</mark>. R. <mark>Featherston</mark>, who is pre-  paring"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.12, 527.67, 1831.72, 1818.6], "bbox_id": "325f423179", "file": "AppomattoxNewspapers_1926-1933a_0456.pdf", "page": 1, "text": "I u- er ae Her seven living j children, thirteen grandchildren, brother, sister and many inti- I mate friends were in her home when the end came. The deceased was a descend-1 ant of prominent pioneer families   of Campbell and Appomattox Counties and inherited their sterling qualities, gentleness of spirit and disposition, and talents of a home-maker. Being a child of the Reconstruction period, and the eldest daughter of a widowed mother, she learned economic independence early in life that gave her a broad under-  standing, general sympathy, and a prophetic vision of changing conditions. She joined New Hope Baptist Church in early girlhood and after her marriage to Mr. Burke, May 27, 1874, she became a con sistent member of Liberty Bap tist Church. Her love and  . thoughtful care were the inspir ation of her husband, her relig ious ideas and progressive ideas sent into the world eight leaders in church and secular activities, and her lavish hospitality en deared her and her family to a host of friends. Her influence for good was recognized through out the county, and having been next one to the longest residents of Appomattox she was beloved by distinguished and humble, rich and poor, young and old, white and colored. She knew i the joys and trials of youth, and all who had temporary homes with her spoke of her as their ! second mother, who exercised unselfishness, patience, and abil ity to draw out the best in those who came in touch with her. No word of adverse criticism passed her lips. She lived on a lofty, intellectual plane that ele vated those under her watch- care.  Truly a mother in Israel has , gone to her reward. Hers was no bland piety, but her life was ! a living epistle of her Saviors j teachings, and her children rise up and call her blessed. She embodied the finer traditions of  the past, and was conversant I with all developments of the present, and her full mind was I a beacon unto loved ones and I acquaintances. Hundreds of callers, numerous I telegrams from different states, many floral tributes attested for her wide popularity and general esteem. She is survived by the follow- j ing children Mrs. Walter C. Me- Gill, of Greensboro, N. C., Mr. W. H. Burke, of Roanoke, Va.,j Mr. R. L. Burke, Mr. J. A. Burke and Miss Eula M. Burke, of Appomattox, Mrs. W. T. Steele, of Spout Springs, Va.r l and Mrs. Jas. B. Abbitt, of Nor folk, Va, thirteen grandchild ren, one sister, Mrs. B. S. Barn-1 ard, of Lynchburg, and one I brother, Mr. J. E. Sears, of  Winston-Salem, N. C., and seven nieces and nephews. Funeral services in Liberty Baptist Church by her pastor, Rev. W. M. Thompson, assisted by the former pastors, Dr. George Braxton Taylor, Rev. H. P. East, and Rev. W. S. Royail. Mrs. Bessie James was director of music at church assisted by the following Don Moses W. W. Scott, Mrs. John A. Sears, Mrs. David Plunkett, Mrs. L. E. Smith and Mrs. W. B. Caldwell. Interment was in Liberty Bap tist cemetery at four-thirty! Monday afternoon, August 27, 1928. The following w e r e pall-1 bearers Her sons, W. H. Burke, I R. L. Burke, Jerry A. Burke, I I and sons-in-law, W. C. McGuill, Dr. jas. B. Abbitt, W, T. Steele and B. F. Odea. The honorary pallbearers were 1 N. R. Featherston, J. R. Hors-j!"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "honorary pallbearers were 1 <mark>N</mark>. R. <mark>Featherston</mark>, J. R. Hors-j!"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "honorary pallbearers were 1 <mark>N</mark>. R. <mark>Featherston</mark>, J. R. Hors-j!"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1461.11, 643.59, 1981.39, 742.11], "bbox_id": "fe4447f4b7", "file": "AppomattoxNewspapers_1915-1918a_0093.pdf", "page": 1, "text": "i m a fr m v r w n a i d n t i n n a f I d  iia p r v p n n n I .  ! , l 1 _  L . I  spent several i-B. F. Burke, Appomattox , - . n _ - wVMcKinney, A upom aitox. I m., at my residence at Evergreen bueritr -H. W. McKinney. Appo-I gjy PlTKA JOHNSON.  b . Horsely, Appc m attox. f y tor Common weal tn  b . l . F e r -i StrayedFrom m y p i e r  a Kevenues. k . A b b itt.ls h pberu dog, when last en was purveyorw, a . Mooes, Appomat-1 near Pamplin. Any ir  ormation I liberally rewarded. W. ii. Wilson, school OFMOBUS. I Evergreen, Va. adv Featherston, 8upt., Vera J . C  - awn?  b verg reenfj v.  The Thursday night service at"}, "highlight": {"text": {"matched_tokens": ["n", "l", "L"], "snippet": "v p n n <mark>n</mark> I .  ! , <mark>l</mark> 1 _  <mark>L</mark> . I  spent"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "l", "L"], "snippet": "v p n n <mark>n</mark> I .  ! , <mark>l</mark> 1 _  <mark>L</mark> . I  spent"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1231.92, 263.94, 1399.84, 456.69], "bbox_id": "5a20f66c35", "file": "AppomattoxNewspapers_1926-1933a_0588.pdf", "page": 1, "text": "Funeral services were held at the home at 4 P. M., May 26, conducted by her pastor, Rev. W. M. Thompson, of Lib erty Baptist church, assisted by Rev. R. E. Redding, of the Presbyterian church. The ac tive pallbearers were F. A. OBrien, R. L. Burke, Don Mos es, L. J. Morris, Jesse Turnes, and Grover Beasley. The hon- ?rary pallbearers were, S. L. Ferguson, J. A. Burke, F. L. Murphv, Dr. D. N. Twyman, R. E. OB ien, W. P. Gills, Thom as A. Inge, Sylvester Beasley, Dr. D. A. Christian, H. W. Mc Kinney, N. R. Featherston,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1228.09, 253.49, 1386.11, 444.35], "bbox_id": "e47618145a", "file": "AppomattoxNewspapers_1908-1909a_0588.pdf", "page": 1, "text": "Funeral Services were held at the home at 4 P. M., May 26, conducted by her pastor, Rev W. M. Thompson, of Lib erty Baptist church, assisted by Rev. R. E. Redding, of the Presbyterian church. The ac tive pallbearers w ere F. A. OBrien, R. L. Burke, Don Mos-  L. J. Morris, Jesse Turnes, and Grover Beasley. The hon- 7rary pallbearers were, S. L. Ferguson, J. A. Burke, F. L. Murphy, Dr. D. N. Twyman, R. E. OBrien, W. P. Gills, Thom as A. Inge, Sylvester Beasley, Da. D. A. Christian, H. W. Mc Kinney, N. . R. Featherston,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. . R. <mark>Featherston</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. . R. <mark>Featherston</mark>,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1239.59, 249.36, 1398.3, 441.3], "bbox_id": "b64883db20", "file": "AppomattoxNewspapers_1908-1909a_0587.pdf", "page": 1, "text": "Funeral services were held at the home at 4 P. M., May 26, conducted by her pastor Rev. W. M. Thompson, of L ib erty Baptist church, assisted by Rev. R. E. Redding, of the Presbyterian church. The ac tive pallbearers were F. A. OBrien, R. L. Burke, Don Mos es, L. J. Morris, Jesse Turnes and Grover Beasley. The hon orary pallbearers were, S. L. Ferguson, J. A. Burke, F. l ! Murphy, Dr. D. N. Twyman, R E. OBrien, W. P. Gills, Thom as A. Inge, Sylvester Beasley Dr. D. A. Christian, H. W. Mc Kinney, N. R. Featherston"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [418.79, 199.67, 589.56, 1559.51], "bbox_id": "defb8d84d3", "file": "AppomattoxNewspapers_1912-1915a_0581.pdf", "page": 1, "text": "Democratic Nominees. A t a meeting of the Demo cratic committee for Appomat tox county, held at the court house w ith J. R. Horsley, ohairman S. G. H arvey, L. F. Ferguson, E. E. Chism, G. O. Thornhill and C. W. Smith present, the following state ment was issued The notices of candidates were canvassed and it appear ing to the committee, that there is no opposition to any candidate for the following named offices county or dis trict, the following persons who have duly filed tie ir notices according to law, are duly declared to be the nomi nee of the Democratic party for the respective offices as fol lows FOR COUNTY OFFICERS For House of DelegatesR L. Burke. For Commonweath Attorney 8. L Ferguson. For County TreasurerR. F. lurke. For Commissioner of the RevenueE. R. Abbitt. For SheriffF. W. McKin ney. DISTRICT OFFICERS Southside District For Su pervisorL. E. Smith. For ConstableR C. Mann. For Justices of the Peace W. Moses and W. L Brown. For overseer of the Poor8 G. Harvey. For precinct committeemen C Harvey, A. H Howertown, F. Ferguson. CLOVER HILL DISTRICT For SupervisorC. M. Drink- ard. For Road CommissionerS. A. Ferguson. For ConstableE. M. Drink- ard. For Overseer of the poorD. Ferguson. For Justice of the PeaceR. A. OBrien. For CommitteemenP, M. ian n ah , W. T. Marshall, E. E. Chism, C. W. Smith. . STONEWALL DISTRICT For SupervisorM. W . C ar ton. For Road CommissionerH. G. Harding. For Overseer of the PoorR T. Phelps For Justice of the peaceF. C. Thorpe, Chas. F. Button. For Constable ------------ For Precinct Committeemen D E. W alton, G. O. Thorn hill, N. E. Featherston. It appearing to the com mittee th at there is no opposi tion to any of the candidates for any offices, county or dis trict, to be voted for in the pri mary, to be held on the 3rd day of August, 1915, except for the office of road commissioner in Southside disrict therefore be it resolved, that no primary will be held in the county of Appomattox for any of the aforesaid offices except in Southside district, which will be to determine the issue be tween the candidates for road commissioner more than one candidate having filed notice of his candidacy for said office and th at on the 3rd day of August 1915, a prim ary be and is hereby ordered for Southside district of Appomat tox county, to determine the nominee of the Democratic party for the office of road commissioner of Southside dis trict. The candidates for Road commissioner are W. H. Lewis and S. J. Lee. Politics for Appomattox at least are very tam e and there is not spice enough to get out a vote. The question arises whether or not we should have a prim ary for local offices and throw the field open for the general election"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "G. O. Thorn hill, <mark>N</mark>. E. <mark>Featherston</mark>. It appearing to the"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "G. O. Thorn hill, <mark>N</mark>. E. <mark>Featherston</mark>. It appearing to the"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [802.32, 563.52, 959.17, 1275.27], "bbox_id": "1eb4d3c22e", "file": "AppomattoxNewspapers_1898-1902a_0580.pdf", "page": 1, "text": "CHEATWOOD PEECINCT. B. N. Tanner, chairman A. H. Howerton. J. W. Powell, C. F. Rob ertson, W. D. Doss, T. H. A. Cheat ham, C. A. Cardwell, L. T. Morris, Robert B. Poore, Hansford Card- well, W. G. Coleman, W. F. Johnson, J. D. Cheatham, A. C. Cheatham, Samuel Cheatham. CHAP PEECINCT. S. J. Lee, chai.inau S. G. Harvey, C. H. Godsey, W. H. Childress, C. H. Lee, J. C. Martin, J. T. Cawthorn, W. H. Lewis, R. W. Fleshman, E. C. Marshall, 0. S. Cawthorn, J. Baxter Marshall, W. P. Godsey, J. C. Wol- ridge, J. L. Woodson. PAMPLIN PEECINCT. J. W. Clark, chairmau, L. W. Thornton, P. M. Hannah, R. D. Baldwin, Geo. F. Farrar, John H. Davis, Dr. C. S. Morton, Dr. E. E. Walker, J. A. Oaks, L. W. Gilliam, R. li. Davis, E. F. Glover, E. F.Wil Hams, W. A. Womack, Jno. Warner. OAKVILLE PEECINCT. W. C. Abbitt, chairman T. E. Owen, W. M. Stratton, J. E. Chick, E. B. Chick, Fields Smith, C. II. Coleman, C. E. Carsou, T. M. Taylor, H. G. Harding, J. P. Hughes, Geo. L. Ferguson, A. P. White, R. T. Moss, T. W. Trent. HIXBUEG PEECINCT. W. H. Ligon, chairman K. M. Garrett, C. B. Gilliam, E. P. Sears. P. W. Coleman, Joel Watkins, W. B. Forbes, W. B. Ford, R. W. Bristow, A. A. Baldwin, John W. Webb, W. J. Paulette, W. T. Marshall, F. T. Marshall, T. E. Paulette. CLOVEB HILL PEECINCT. W. P. Gills, chairman E. E. Chism, D. P. Ferguson, H. C. Ferguson, A. B Franklin, M. E. Agee, E. H.-Luc- ado, J. W. Flood, J. W. Tweedy, R A. OBrien, C. M. Drinkard, J. R. Hamilton, H. R. Pitman, E. R. Ab bitt, P. J. Sheppaid, R. H. Brown ing, II. C. Babcock, W. F. Wright, J. W. Wright. STONEWALL PEECINCT. S. C. Stratton, chairman M. W. Carson, J. C. Shearer, S. E. Ander son, T. C. Stratton, 1. W. Tuggle, W. D. Sandidge, J. I. Martin, P. L Stratton, C. M. Stratton, J. S. Thorn hill, T. A. Drinkard, Milton Isbell, W. S. Taylor, Ur. J, B. Abbitt. AGEE PEECINCT. A. B. Thornhill, chairman T. J. Gooding. N. R. Featherston, S. P. Taylor, W. D. Woodson, A. E. Mil- timore, J. H. Wood, J. D. Hamers- ley, T, J. Megginson, D. M. Ander son. J. D. Childress, M, F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Coleman."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "chairman T. J. Gooding. <mark>N</mark>. R. <mark>Featherston</mark>, S. P. Taylor, W."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "chairman T. J. Gooding. <mark>N</mark>. R. <mark>Featherston</mark>, S. P. Taylor, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [927.35, 1641.56, 1075.09, 1769.81], "bbox_id": "5de2804062", "file": "AppomattoxNewspapers_1943-1947a_0457.pdf", "page": 1, "text": "C. T. Moses Eula Mae Burke Mrs. S. L. Ferguson R. L. Burke Mrs. Calvin H. Robinson J. H. OBrien J. A- Burke N. R. Featherston"}, "highlight": {"text": {"matched_tokens": ["L", "L", "N", "Featherston"], "snippet": "C. T. Moses Eula Mae Burke Mrs. S. <mark>L</mark>. Ferguson R. <mark>L</mark>. Burke Mrs. Calvin H. Robinson J. H. OBrien J. A- Burke <mark>N</mark>. R. <mark>Featherston</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "L", "N", "Featherston"], "snippet": "C. T. Moses Eula Mae Burke Mrs. S. <mark>L</mark>. Ferguson R. <mark>L</mark>. Burke Mrs. Calvin H. Robinson J. H. OBrien J. A- Burke <mark>N</mark>. R. <mark>Featherston</mark>"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [904.58, 255.83, 1068.9, 916.29], "bbox_id": "8ec42ff9ef", "file": "AppomattoxNewspapers_1918-1922a_0038.pdf", "page": 1, "text": "C ircuit Court Judge Hundley opened court on time and had a busy term he Judge was looking well and appeared as vigorous as ever-.  E M. Drinkaru resigned as Constable of Clover Bill Dis trict and upon his recommen dation Mr. R. H. Browning was appointed for the unexpired term. H. L. Canady, c., vs. N.  W. ..Ry. Co. Upon a trial of the case the jury rendered a verdict of 5,000 for the said Canady, and 725 for the bene fit of The Insurance Company of State of Pennsylvania. These verdicts are subject to the upin ion of the Court on demurrer of evidence argument on said demurrer will be heard in armville on May 21st. The Grand Jury W. H. Lig- on, N. R Featherston, J. H. OBrien, W. C. Garrett, E R. Abbitt, W. B. Davidson, R A Hamilton, D. P. Ferguson, A H. Howerton. True bills were found against John Collins, John Lewis, Thomas Turner and Charlie atteson. John Collins and John Tur uer were given an additional year each in the penitentiary ior attempting to escape. The jury in the case of C. E. Lewis vs. Lee O.Rhodes award ed the defendant a judgment l for 789.52. Upon motion of defendant to set verdict aside the Court put plaintiff on terms to accept 500 or the Court would set the verdict aside. The plaintiff excepted and the verdict of the jury was set aside. We understand that the m atter has been settled by the parties. Commonwealth vs. D. A.Con ner Attorney for Common wealth agreed not to prosecute. J. E. Dickerson vs W.D. Rob-"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "W. H. Lig- on, <mark>N</mark>. R <mark>Featherston</mark>, J. H. OBrien, W."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "W. H. Lig- on, <mark>N</mark>. R <mark>Featherston</mark>, J. H. OBrien, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2192.66, 1218.34, 2360.08, 1404.24], "bbox_id": "c727dc9958", "file": "AppomattoxNewspapers_1933-1936a_0242.pdf", "page": 1, "text": "Burke, C. F JiameaiH. M Burge, N . R. Featherston H. W McKinney, S V. Munsey, M. C. Smith, R, S. Wheeler E. LeRoy Smith F L Mur phy and C S. McDearmon. Flowers which were beautiful and profiwe were carried by her intimate fmanda. N R. Morgan sang Face to Face and the choir, Rock of Ages. In terment took place in Liberty cem etery. I The deceased was before her m ar riage, Bessie Royster, daughter of V. L. and Susan Parke Royster and was born in Richmond, Member of i prominent Richmond family, her treat uncle, Dr. Robert Lee Bohanan founded the Medical College of Virginia, and her aunt, Elmira Bpy ter was immortalized as the ooy -.ood sweetheart of Edgar Allen Dp"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "F JiameaiH. M Burge, <mark>N</mark> . R. <mark>Featherston</mark> H. W McKinney, S"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "F JiameaiH. M Burge, <mark>N</mark> . R. <mark>Featherston</mark> H. W McKinney, S"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.78, 534.9, 1592.63, 704.75], "bbox_id": "b6f908c423", "file": "AppomattoxNewspapers_1933-1936a_0454.pdf", "page": 1, "text": "btiho c ttlS N . R  Featherston flH five yaars in a miUtaSBcompany and as ed to X l l all manner of S jO B S T . birthdays are   ÀvfflBaldwin and for C a   H .-W a tt Abbitts g haifStopsem in the Burkey served ay ijHuama during the W .lpynolds favorites and Abner.. K igh top shoes recently wrote f Fiaan Byrd as beiing rom flfj6t Virginia . . . . l Walter and scallions, ition ofU oniething lacking to tdHancing on the"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "btiho c ttlS <mark>N</mark> . R  <mark>Featherston</mark> flH five yaars in"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "btiho c ttlS <mark>N</mark> . R  <mark>Featherston</mark> flH five yaars in"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [896.16, 332.22, 1061.41, 585.07], "bbox_id": "31ddaa4243", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "Appomattox, Va., September 13, 1939 Editor Times Virginian, Dear Sir, On August 27, 1939, when our Heavenly Father called to His eter nal home His faithful servant, J. H. Thornhill, there was sadness in the hearts of his many friends, but they were thankful that one so up right, frank, but courteous in all his dealings with his fellowman, had . een spared to the community for 7 y-Mrs. Mr. Thornhill lived a quiet life, but lived it well raised a large family of children and raised them well and they can feel proud of the example he set. A man who lived to the age of 87 years and lived the upright life that he lived deser ves special mention wnen he has passed away. I knew Mr. Thornhill all my life, and consider It a priv ilege to have had in him a dear l friend, and his passing caused me great sorrow. N. R. Featherston."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "caused me great sorrow. <mark>N</mark>. R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "caused me great sorrow. <mark>N</mark>. R. <mark>Featherston</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1137.8, 285.64, 1300.35, 406.11], "bbox_id": "7370512115", "file": "AppomattoxNewspapers_1898-1902a_0287.pdf", "page": 1, "text": "Appomattox Democrats. A mass-meeting of the Democratic j voters of this county was held here on Thursday last, oouuty court day. County chairman Saml L Ferguson called the meetiug to order. Dr. T. R. Rucker was chosen as permanent j chairman, and Mr. N. R. Featherston was made Secretary. Senator H. D. j Flood addressed the meeting in an"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "j chairman, and Mr. <mark>N</mark>. R. <mark>Featherston</mark> was made Secretary. Senator"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "j chairman, and Mr. <mark>N</mark>. R. <mark>Featherston</mark> was made Secretary. Senator"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [716.85, 1185.93, 872.69, 1327.02], "bbox_id": "3aabb8b052", "file": "AppomattoxNewspapers_1898-1902a_0582.pdf", "page": 1, "text": "AGEE PRECINCT. A. B. Thornhill, chairman T. J. Gooding. N. R. Featherston, S. P. Taylor, W. 1. Woodson, A. E. Mil- timore, J. H. Wood, J. D. Hamers- iey, T, J. Megginson, D. M. Ander son. J. D. Childress, M. F. Kyle, J. W. Davidson, C. E. Lewis, C. L. Coleman. Lazy liver"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "chairman T. J. Gooding. <mark>N</mark>. R. <mark>Featherston</mark>, S. P. Taylor, W."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "chairman T. J. Gooding. <mark>N</mark>. R. <mark>Featherston</mark>, S. P. Taylor, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [502.08, 1148.53, 670.78, 1680.77], "bbox_id": "16c43e452d", "file": "AppomattoxNewspapers_1939-1943a_0574.pdf", "page": 1, "text": "A special service honoring those in the armed forces was held last Sunday at the local Presbyterian Church. A plaque containing names of those in the service was present ed in a patriotic program. N. R. Featherston, in making the presen tation said I a mgrateful to you for the honor you have conferred upon me, and my regret is I have not the ability to measure up to this occa sion. We have gathered here today to honor our boys and girls who have gone out to fight for us, for their country and, we believe, for their God. These boys and girls should have, and I feel sure they have, the prayers of the folks back home. But you mu. t remember we do not have to wai for the assem bling at c.iureh to offer our pray ers. The Lord will hear the pray ers of his pqople at any moment, day or night, they are offered. 1 firmly believe that if every person in America who professes to be a follower oi the Lord and Savior would live up to.the standards of Christianity, all the mighty hosts of the enemy, with their immense war machinery would crumble before that body of Christians. It is our prayer that as our soldiers will march successfully, following the Star Spangled Banner of our coun try, they may not forget that sin gle star that guided the wise men to Bethlehem, and in winning this war they may win a lasting peace for this world, and we should strive to reach their goal, and in present ing to this church this plaque with the following names Jerry A Burke, Jr., Jennings W. Conner, Carl E. Evans, Harry B. Giles, Robert Pol lard Kinney, C. William Redding, Richard Floyd Burke, TH, Sidnor A. Conner, William L. Evans, Charles F. James, Jr., Douglas S. McKen zie, and last, but far from least, Miss W. Rebecca Harvey, we sin cerely wish, after a great victory is won, for the safe return of all these noble boys and girls, The plaqce was accepted for the church by J. A. Burke, whose re marks were timely and in keeping with the occasion."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "in a patriotic program. <mark>N</mark>. R. <mark>Featherston</mark>, in making the presen"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "in a patriotic program. <mark>N</mark>. R. <mark>Featherston</mark>, in making the presen"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1244.86, 272.8, 1400.22, 451.66], "bbox_id": "df151e790d", "file": "AppomattoxNewspapers_1926-1933a_0587.pdf", "page": 1, "text": "A  lviay 26, conducted by her pastor Rev. W. M. Thompson, of Lib erty Baptist church, assisted by Rev. R. E. Redding, of the Presbyterian church. The ac tive pallbearers were F. A. OBrien, R. L. Burke, Don Mos es, L. J. Morris, Jesse Turnes and Grover Beasley. The hon orary pallbearers were, S. L. Ferguson, J. A. Burke, F. L Murphy, Dr. D. N. Twyman, R E. OB ien, W. P. Gills, Thom as A. Inge, Sylvester Beasley Dr. D. A. Christian, H. W. Mc Kinney, N. R. Featherston,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "H. W. Mc Kinney, <mark>N</mark>. R. <mark>Featherston</mark>,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.65, 360.14, 1824.89, 562.69], "bbox_id": "0a8afbf76e", "file": "AppomattoxNewspapers_1939-1943a_0063.pdf", "page": 1, "text": "4 Among those who motored to  w W. Burke spent the week-end 7  l l chbu?r Saturday to hear the con here. He and Mrs. Burke were in APPort by Jeannette MacDonald, were Blackstone Monday.  .odae and  s. J.W.Flood, Miss es viiM y Trentt Mr and Mrs E. I. N. R. Featherston and Misses MMendice,  Miss Violet Ramsey, EmUy and Mary Featherston motor- tigs imcille Cralle and Mias Beulah ed to Richmond Friday, returning on goc,rreQ Sunday. u M.! Avis Brown, of Char  _ en  B H L t the week-end with - Candy Easter Eggs at JENKINS! ThiTparents p e re . reJ Barbara Ekin Parrish is sick at I Mr and Mrs. Ben Newman and  family have moved to Appomattox r  from Williamsburg. They are occu-  NotJSftrSa Giles Engledove, of Rich- pying an apartment in the W. L.  streti H p tv e d today to spend the Ould residence. week with her  j r anj Mrs. Ford Freeman and CasS daughter, Wilda Anne, of Greens mT 5 .Sf 8 e  d v a n s , of Richmond, was boro, were the week-end guests of entionre 3St jBSvreek-end. Mr. and Mrs V . W. Hanenkrat,"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "and Mrs E. I. <mark>N</mark>. R. <mark>Featherston</mark> and Misses MMendice,  Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "and Mrs E. I. <mark>N</mark>. R. <mark>Featherston</mark> and Misses MMendice,  Miss"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2191.2, 414.84, 2363.88, 787.91], "bbox_id": "9d1b54818a", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "1866 1945 On Saturday, February 10th. 1945, the passing of this splendid citizen of the Stonewall neighbor hood, caused deep sorrow in the hearts not only of his family and loved ones, hut of all his numer- nur friends. He was the son of Peter L. and Betty LeGrand Strat ton, whose families were piominent and influencial citizens, and had a leading part in making that section of Appomattox County one of its best sections, and th j subject of this sketch, in his day, did his full part in tiiat splendid work. He was a man of the highest Christian character, always ready and eager to take a leading part in any movement for the good of his church, help for the poor and the advancement of mankind. The writer had known him for nearly half a century, and found him to be a man of the highest ideals, neV ev heard him join in any conversa tion that would not be entirely proper in the presence of ladies. He was laid to rest in the ceme tery of Hebron Baptist Church and the large crowd that gathered at the burial and the large quan tity of beautiful flowers attested to the high esteem in which he was held. In his passing the county has lost one of its valuable citizens, and the community and church one of its most useful members. N. R. Featherston."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "its most useful members. <mark>N</mark>. R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "its most useful members. <mark>N</mark>. R. <mark>Featherston</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1178.9, 346.68, 1357.99, 877.52], "bbox_id": "f4950d58ab", "file": "AppomattoxNewspapers_1943-1947a_0077.pdf", "page": 1, "text": "18611943 At 11 P. M. March 23, iIeiVy D. Jonnsun passed away at h iome near Wild way.  hl?n   o l d noth.r of the tew remain.! ,ime colored people- Henry Danl, is r.e was familiarly cal1 1 w- Very outstanding lead r pi the tol le d race in his neigloorhood. He Aas for a numb-r ot year, a dea jqn and leaaer in ths Cr 3t Churcn, and a member of that church since h. Was 13 yesrs cw. at is passing will be a roar loss to Jr.e church and to h.s host friends. H. was a consult _ reader A the Biole if yoa called t his .cm. cn a Sunday afternoon, you ovoJa find him with his Biole on S mp, and he would tla ntly quote you tortions of the scr.ptur.- t  os that the pr E 5 .it troubles of the world through watch wc Pi e risin g arc the fulfillment ol the Old Testament phpnee- s. lie w. ud say that Ac id ng to ie Scr i lur.s the Japs go get nero, 3 it taty ant go stay. He was fully .onvinced that the suffering and Hardships we art going through sre j d s punishment He is Sending us i fl count of our des.eration of the Sabbath day, and our forg.t- ting and ignoring of God s conv ,ands. Uncle H-nry was of a very appy dispostion, having in store an unusuri supply of wit. He was the center of attraction among th. -whites, who so much enjoyed his v.itty answers to the questions they were sure to put to him. With the passing of Uncle H .nry goes the last one of that family of servants who belonged to the fam ily of the writer, and Ii sinc-.rely mourn the pass ng of a true friend. Uncle H-.nry was very indus trious, thoroughly honest and sav- d up enough to buy himself a home, of which he was justly proud. In early life he marn-.d O th rine Branch, who, with one on, Willie Johnson, survive. He as laid to r.st in the colored fam- lv hurvne ground on the old Ag.e omestead where he was bom. __ N. R. Featherston."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "where he was bom. __ <mark>N</mark>. R. <mark>Featherston</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "where he was bom. __ <mark>N</mark>. R. <mark>Featherston</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [622.3, 686.17, 778.52, 785.91], "bbox_id": "73e586892f", "file": "AppomattoxNewspapers_1918-1922a_0306.pdf", "page": 1, "text": "0 W Smith, county clerk... ....... . ......... 3 qc C W Smith, clerk road board . ......... .. 25 03 C W Smith, clerk board supervisors... 80 00 Joel W Flood, com. attorney...............3C0 C3 H W McKinney, sheriff............................ 300 CO H W McKinney, sheriff and jailer.... It 00 N R Featherston, supt. of schools.... 76 C3 W H Ligon, member board super visors10 meetings . ........ ................ 72 00 S R Anderson same9 meetings ......... 64 80 L E Smith, same9 m eetings ................. 54 93 D L Martin, Janitor service.................. 12 00"}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "and jailer.... It 00 <mark>N</mark> R <mark>Featherston</mark>, supt. of schools.... 76"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "and jailer.... It 00 <mark>N</mark> R <mark>Featherston</mark>, supt. of schools.... 76"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [409.45, 575.75, 574.68, 1715.47], "bbox_id": "7fc9f2c521", "file": "AppomattoxNewspapers_1926-1933a_0272.pdf", "page": 1, "text": "The good rain came in such good time. Some of the farm ers have finished planting to bacco over the first time, but the weather keeps so cool real ly cold. Plenty frost first  second mornings in June, A rare thing. The wheat crop will soon be ready to harvest. It looks very good in the field. Prof. Wilkins and Mr. Hud gins are giving some splendid talks and information on agri culture at Pettys Fork School House e v e r y Wed. night Everybody should attend. Last Friday was a holiday but I guess the farmers had the hardest day as there was a to bacco season. Mr. G. P. Martin and his mother, Mrs. J. E. Martin, o Roanoke, motored to the home of J. A. Martin last Friday and stayed until I Saturday P. M Then they were accompanied to the home of A. S. Wool dridge by the latter who spent the afternoon. They returned to their home in Roanoke Sun day. Messes Marvin Moses and Ellis Martin, Mrs. ,Edd Moses and little son, Lyle, spent last Sunday in the home of George Thompson, in Campbell. Mr. and Mrs. B. C. Sims and two children, Mr. and Mis Harris Murphy, of Lynchburg spent Saturday night and Sun day in the home of R. W. Mar tin. Mr., and Mrs. W. C. Lee and little Catherine, Mr. and Mrs. W. L. Ford were visitors in this home on Sunday. Mr. B. C. Sims and son, Otis, visited in the home of J. A. Martin last Sunday. Master Thomas Odor left last Sunday morning for his annual visit to the home of his rand-father, T. W. Odor. ---------------------- o --------------- Honor Roll for May 4th. Year Ethel Alvis, John Hesson, Virginia Carson, Bertha Rog ers, Thelma Gunter, Mary Sears, Elizabeth Robertson, Lucile Bates, Alfred Harwood, Sarah Bates, Charles Crawley, Eunice McNally, Madaline Bingham, Nollie Lewis, Lottie Lucado, Annie Gilbert, Vir ginia Chich, Virginia Holt, Lu cy Smith, Henry Pack, Mary Featherston, Gladys I nge, Charles James, Frances Cole man. 3rd Year Mary L. Stratton, Winifred Harvey, George Langran, Sam uel Ford, Lucile Crawley, Jos- hephine LeGrande, Ruby Cole man, Addie Lena Ferguson. 2nd Year Garland Plunket, Ruth Morris, Mandane Anderson, Catherine Lucado, Carrington Beard, Chapman C h i l t o n , Hilda Moore, Weslene Young, Billy H u b b a r d , Lula Drinkard, Clarkie Evans, Christine Paul- et, Claudine OBrien. 1st Year Dojrothy Tweedy, L o u i s e Lewis, Catherine Irby, Eliza beth Crawley, Lynwood Paul ette, James Ford, Ruby- Cole, Herbert Abbitt, Verna Kern, Elliot Turnes, Leilas Davis. 7th Grade John Cole, James Dorton, Hayilah Guill, Jean Anderson, Edith Anderson, Edith Frank lin, Nixie Guill,, Christine Roberts, Manie Smith, Geneva Wingfield, Evelyn Martin, Eleanor Martin, Erna Dicker- son, Helen Marshall, Willie G. Anderson, Virginia Christian, 6th Grade Edith Cole, Hazel Chilton, Nellie Davidson, Ella Mae Dinkins, Marion Giles, Marga ret Gobble, Virginia Eppes Ir- Edith iUicado, Margaret"}, "highlight": {"text": {"matched_tokens": ["l", "n"], "snippet": "Chapman C h i <mark>l</mark> t o <mark>n</mark> , Hilda Moore, Weslene Young,"}}, "highlights": [{"field": "text", "matched_tokens": ["l", "n"], "snippet": "Chapman C h i <mark>l</mark> t o <mark>n</mark> , Hilda Moore, Weslene Young,"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2199.1, 462.91, 2372.75, 641.2], "bbox_id": "e27a272f9e", "file": "AppomattoxNewspapers_1933-1936a_0091.pdf", "page": 1, "text": "The angel of death moves sraft- iv Tuesday -mortung of th weex, i dwth entered one of Appomartox. most d eem ed families w d w tftiy took to eternal rest the Deioveu mother, Mrs. N- R- Mrs. Featherston wm found deua  in the home shortly after her deaUi bv a high school pupil, Polly Sish. She had apparently been in 1 good health when her husba d ir t I Monday on a bumness trip jo Sout I west Vuginia. The only W J iMarv wa-i at work at tre ocaii I f ERA office. The boJy was found l lying in the room.  V I I Bef re her marriage, Mrs. Fea I therstou was Miss Ann Bell M.ii I S d-ughter of th, late John R l MarshVI. Sr. She mu.r.t.l N."}, "highlight": {"text": {"matched_tokens": ["N", "Featherston"], "snippet": "the Deioveu mother, Mrs. <mark>N</mark>- R- Mrs. <mark>Featherston</mark> wm found deua  in"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Featherston"], "snippet": "the Deioveu mother, Mrs. <mark>N</mark>- R- Mrs. <mark>Featherston</mark> wm found deua  in"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [243.36, 472.56, 568.44, 669.1], "bbox_id": "2f412de5a9", "file": "AppomattoxNewspapers_1908-1909a_0473.pdf", "page": 1, "text": "othin8i n neertion anil fcc pur inch for each gubie-ljg gort, Gettysburg having tnent lnaertion. MOh I been established by local interests _______ I before bqjnx turned over to the goverment. Steps are being taken to ascer tain the attude of officials and  rrv r A. R., according t tnWinpl to fooling letters addressed by Start the year g y I Mr Featherston to G. L. Hawks the county paper. 1  acramento, Calif, - command- Senator Ferguson is one of the Ur-in-chief of the G A. R, Dear Sir  As chairman of a committee of the Lions Club of Lynchburg, appointed to make investigation and, if .deemed expedient, to"}, "highlight": {"text": {"matched_tokens": ["Featherston", "L"], "snippet": "g y I Mr <mark>Featherston</mark> to G. <mark>L</mark>. Hawks the county paper."}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "L"], "snippet": "g y I Mr <mark>Featherston</mark> to G. <mark>L</mark>. Hawks the county paper."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1337.3, 482.66, 1926.6, 798.46], "bbox_id": "8c091c78e5", "file": "AppomattoxNewspapers_1908-1909a_0162.pdf", "page": 1, "text": "N O T IC E I 5a cSton Planmt.jSwhatproyig11 i i v i i v u I tloc and fil an aooOant of loin anfl Drtori I tie tiiereof on tbs rePctiva bare of Utose who may bo decree! to hare in said monies F Honor Koll I who may be di -------- ---  The firm of Appomattox Auto I r1 iw A A lr tn v P a L o a K a a v i A t a a f h l t f A  i I  i  a t h a t Kg auu au aiiidavlVhavlDg been m ide and L Sled th at the defendant Mayo Cabell, Guy I . . v  I WreckingCo. has dissolved.  a I. ----. . 5-. Appomattox School for Septem-Ji will continue to operate filling I SbS jr, AikLcbeii aim1 Henry1,cabe3! her and October, 1927  station on Highway. Yourl .  1 r Fourth Y e a r  Katherine  Past patronage has been appre- w  jfourtn x e a r  xvaMienneit-rv5 ap   CHocklett Samantha Pippin, Ma t g iv e  f f l S trade for cattle two ry Jameraon, John Haryey, Lucy 1 ag n the p ast  1 t a G m ia J T n i i l g . S e m in n i. T ,ulft 111 7_Of .LeGrand, Louise Scruggs,, L. E. S mith , j gmfth, Floyd Dinkins, in Liberty Church I Third Y e a rLouise Weeks, as usual. The Dora A bhitt, Virginia Puckett, L redecorated, but Kathleen Paulett, Edith OBrien, interfere with ser-1 Virginia Thompson, Eleanor Har wood, Grace B urnett, Robert Storey, . Second ,Year--Mary Grey Sears, Lottie Lucado, John Hesson, Cluries Jriries, Alfred Harwood, Fay Babcock, Virginia Carson, vB  iNollie Lewis, Gladys Inge, Mary week-end Jguest I Woodson, Frances Coleman, Mary AD Featherston, B e r t h a Rogers, James M orris, , Virginia Holt, Gertrude Stewart, Charles Craw-"}, "highlight": {"text": {"matched_tokens": ["n", "l"], "snippet": "m ia J T <mark>n</mark> i i <mark>l</mark> g . S e m"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "l"], "snippet": "m ia J T <mark>n</mark> i i <mark>l</mark> g . S e m"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1405.88, 573.64, 1573.78, 1328.15], "bbox_id": "02e37733d3", "file": "AppomattoxNewspapers_1933-1936a_0014.pdf", "page": 1, "text": "Now it appears that they do, S e r e at Appomattox at a n y lirate. Ragland Featherston Bwas the first man to vote here Tuesday, casting his ballot in- to the virgin chasteness of a S e w ballot box at 515 A. M.    For years Joel W. Flood wa the first man to vote in the morning at each election at the S id court. House, but although he was on hand Tuesday dawn- ing, he stepped aside to allovi another that honor.   .  As for the Dark and Bright p e a f family, we trudged up a. the more reasonable hour o. i l l bells.   0 I Frankly, its not every Sun day that I keep up with th e Sunday School lesson. But his. Sunday I did. The lesson was about Gideon, an old-Testa- nnent hero who put a vast army to flight. Heres the way he did it with three hundred pick- ed men, he broke upon the ene- Brny in the dead of night w i t h auch war whoops that they thought the end of the world lhad come and fled post haste. Well, just about identically the i tame thing happened on Folly IlCreek in Accomack county in 1779. Gen. John Cropper was gproused from his bed by plund e r in g British buccaneers under  bold Scotchman named Kidd. His property was bespoiled and  he was bottled up in his room. Later the general clad in his bight clothes plunged over hit guards and fled in the mazes ol S i s gardens and traversed near by fields to round up his conti- nental neighbors. Coming Iback they sprang upon the Brit fish with such guffaws they thought all America was upor them and took to their boats and made away to the rendez- vous of their freebooter chief    Father Darkleaf still is of the iopinion that the view of the Jam es River from the Bent iCreek-Gladstone bridge is t h e most beautiful sight in Appo- mattox county. Funeral Of ! Mrs. Spencer"}, "highlight": {"text": {"matched_tokens": ["n", "Featherston"], "snippet": "at Appomattox at a <mark>n</mark> y lirate. Ragland <mark>Featherston</mark> Bwas the first man"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "Featherston"], "snippet": "at Appomattox at a <mark>n</mark> y lirate. Ragland <mark>Featherston</mark> Bwas the first man"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
