{"document": {"bbox": [1110.96, 856.68, 1302.15, 1189.77], "bbox_id": "24c75dbd41", "file": "TimesVirginian_1983a_0367.pdf", "page": 1, "text": "zone.  i 4 . Raider Coach Howard Clabough put- his second and third units ip the gamp  during the second half, following the  Raiders final score, a 35-yard run b y ! Patterson in the third quarter. Forest j scored twice on the Raider reserves in  the fourth period, for their 16 points in 1 the 48-16 Appomattox win. ! McCoy carried the ball three times  for 29 yards against Forest. and. Patterson had five carries for 96 yards. Fanney had 15 yards on five carries, , Motley had right yards oUutwo carries, and Chip Heraeall had four yards on two carries. The defense was led by Kettw Fanney, Keith Robinson, Daryl Hurt Gary Scruggs, Barry Phelps, Andre McCoy, Dwayne Patterson and Calvin Ligon, according to Coach Clabough,  It was one of those days when urn were playing very well, and the other team had a bad game, commented Clabough after the game.  Tomorrow Thursday, the jmrveei will square off against Brookville ai home. The Brookville game is alwayp a tough one for us, noted Clabough, The game will be played at Bragrii Stadium in Appomattox. Game time ifc 6 p.m. ?"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Dwayne Patterson and Calvin <mark>Ligon</mark>, according to Coach Clabough,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Dwayne Patterson and Calvin <mark>Ligon</mark>, according to Coach Clabough,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1667.27, 614.1, 1834.2, 666.09], "bbox_id": "7ac56e6c8a", "file": "AppomattoxNewspapers_1939-1943a_0531.pdf", "page": 1, "text": "Z. 7. Moran was a week-end visi tor cf relatives in Salem. Mrs. W. B. Brightwell is visiting her daughter. Mrs. W. D. Ligon, of Pi tsburgh."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Z. 7. Moran was a week-end visi tor cf relatives in Salem. Mrs. W. B. Brightwell is visiting her daughter. Mrs. W. D. <mark>Ligon</mark>, of Pi tsburgh."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Z. 7. Moran was a week-end visi tor cf relatives in Salem. Mrs. W. B. Brightwell is visiting her daughter. Mrs. W. D. <mark>Ligon</mark>, of Pi tsburgh."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1635.34, 1454.76, 1847.79, 1915.11], "bbox_id": "8618522487", "file": "AppomattoxNewspapers_1922-1923a_0145.pdf", "page": 1, "text": "Yesterday the two little chil- conclusio dren of Mr. Cuno, who lives no obstacl near Stonewall were sent out gontiuuou by their mother to pick up attainmei some sticks to make fire abou aonificatic noon. The childred were 4 anci dete and 6 years of age. The little hammere ones wondered off in the wood j hammered  and lost their way, and parents Gj8 inbu I becoming alarmed started uiigoaenti search for them , which result- mor ed in fiuding them, tired and qualitiee asleep in a barn more than two  death bis miles from home. When found I je88 activ each had its arm-full of sticks f0undati for m other. The night was j phenomi cold and both would have died I aQd stre from cold if not rescued, hj8 0arly doubtless.  Monday evening the Masons J These st Pamplin elected t h e follow- man y 9  ing officers for the ensuing enriched ! year C. H. McCall, W. M  L. and an N. Ligon, 8. W. Z T. Moran, Like am I J. W. 0. F. Harvey, treasurer cherishe I A. J . Ponton, secretary W. W. I Bookdr, S. D  S. P. Loving, J. P D. O. E. Peterson, chaplain  E. E. McClenny, tiler N. E.  Farrar and E. N. Cunningham, f stewards. An order was taken I to have the installation of if officers and a banquet on Tues-  day night, December 26th,  instead of Wednesday, the 27 th, because of a conflict with tbe Union prayer services."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "L. and an N. <mark>Ligon</mark>, 8. W. Z T."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "L. and an N. <mark>Ligon</mark>, 8. W. Z T."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1326.68, 378.07, 1451.21, 388.07], "bbox_id": "26629e8332", "file": "AppomattoxNewspapers_1892-1898a_0169.pdf", "page": 1, "text": "y r H. Ligon, of Hixbnrg, was"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "y r H. <mark>Ligon</mark>, of Hixbnrg, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "y r H. <mark>Ligon</mark>, of Hixbnrg, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1314.48, 1760.09, 1495.55, 1770.59], "bbox_id": "60dae99981", "file": "AppomattoxNewspapers_1905-1912a_0131.pdf", "page": 1, "text": "Y, H. LIGON, Pres. J. F. CONN ALL Y, V.-Fre"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "Y, H. <mark>LIGON</mark>, Pres. J. F. CONN ALL Y, V.-Fre"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "Y, H. <mark>LIGON</mark>, Pres. J. F. CONN ALL Y, V.-Fre"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.5, 674.22, 1753.57, 778.51], "bbox_id": "ac126f0bed", "file": "AppomattoxNewspapers_1915-1918a_0189.pdf", "page": 1, "text": "y . Constable, K. L.  ---- , attox. Road Commissioner, W. H wis. Appomattox. Justice of the ace, W.L. Brown, Appomattox T. Moses, Appomattia J. M. Knotts. ppomattox. qjq District itu.un,u..u, - ------   . Supervisor, W. H. Ligon, Panjplin, 1 Mr and Mrs. J. R. Caldwell, near onstable, E. M. Drinkard, Appomat-1  Road Commissioner, S. A. Fer-1 here. s?  T h SSz S S S itM Mr- R w-Abbltt-r poib, outhall, Evergreen and F. A OBn-jiar Vera postmaster, has just"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "itu.un,u..u, - ------   . Supervisor, W. H. <mark>Ligon</mark>, Panjplin, 1 Mr and"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "itu.un,u..u, - ------   . Supervisor, W. H. <mark>Ligon</mark>, Panjplin, 1 Mr and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.7, 360.45, 1839.69, 504.94], "bbox_id": "a93aad0ce4", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "XR OFFICERS. APPOMATTOX, OOUNTT OrriOIRS. Judge of Circuit CoimOeo. J, Hundley Courts, tin t day of April itnd October. Judge of County CourtD. A. Christian Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Iter. - a tto rn e y for CommonwealthH. D. Flood r-benffS- P. Coleman. TreasurerD. Mott Bvbertson. C om m issioner of Revenue-L. K. Smith. B oard of Supervisors W. h . Ligón, chair- man 8. C. Stratton and J. C. Jones. Board j m eats on Wednesday after first Monday In March, June, September, end December."}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "of Supervisors W. h . <mark>Ligón</mark>, chair- man 8. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "of Supervisors W. h . <mark>Ligón</mark>, chair- man 8. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [295.94, 1298.22, 614.78, 1799.96], "bbox_id": "2d18da4684", "file": "AppomattoxNewspapers_1918-1922a_0010.pdf", "page": 1, "text": "wood, in Appomattox. Mr. Sears Hix, of Badeo, N. 0., spent the Xmas with home folks. Mr. Nick Burrell has gone to Nashville, Tenn, where he will em bark aa a locomotive fireman on the LN. Ry. Misa Josephine Swan, of Blue- field, W. Va., is spending some time with relatives here. Miss Carrie Hix and facts should be presented along  Gilliam, of Richmond, w ith any estim ates and com - ! holidays here, parisons on a m ileage basis. The cost of road grading can not be figured in m iles but m ust be in term s of cubio yards of earth and stone to be moved. Now, after the lapse of about three years of his tenure of of fice, comes Mr. Ligon, chair m an of the Board of Supervis ors, in an article published Dec. 11, 1918, and raises the ques tion as to w hether we have got ten our m oneys w orth in road construction, in w hich he pre- aents figures of cost and m ile age constructed. We are unw illing to accept Mr. L igons deductions from w hich to draw conclusions ei th er as to w hether the cost of our roads has been excessive or as to a com parison of free labor w ork versus convict la bor, because he does not show th e am ount and character cf w ork involved in his m ileage, an d because he appears to have added to the money cos of the m ileage he states tb"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "of fice, comes Mr. <mark>Ligon</mark>, chair m an of"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "of fice, comes Mr. <mark>Ligon</mark>, chair m an of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1353.58, 997.8, 1486.55, 1526.54], "bbox_id": "67a089b7ba", "file": "TimesVirginian_1980a_0389.pdf", "page": 1, "text": "wonderful message. There was s large crowd at church. The Pastors Aid and Ladies Aid Club met in the home of Mr. and Mrs. William Ligon last Saturday. We made plans for our Christmas program. They will meet with Odell Chambers in December. We drew names. AIL of the members were not present. Mrs. Ligon served the group after the meeting. Everyone who attended enjoyed them selves. The Mens Club of Mt Pleasant  celebrated their fourth anniversary on Nov. 9 at 3 p.m. The Rev. William Watson of Madison Heights delivered the challenge message. His wife and three children accompanied him. The men had a wonderful program. We are very proud of them and the great work they have done for the church. President is Deacon St. Joseph Chambers, secre tary is Milton Clumbers, treasurer to Ray Walker other officers are Bennie Walker, Robert Walker, Eugene Chambers, Joseph. Chambers, Jr., Willie E. Chambers, John Bailey, Charles Bailey, Tony Base- more,, Allen Base more. Rev. John Edward, Mickle Jack- son, Robert Jackson, Calvin Basemore, Abraham Cham bers and Ernest Walker, Deacon Robert Chambers, Deacon Robert Thronton, Jr. Our hats go off the these young men. The club presented their Primary"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs. William <mark>Ligon</mark> last Saturday. We made"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs. William <mark>Ligon</mark> last Saturday. We made"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.74, 205.09, 1000.52, 444.58], "bbox_id": "640bcc5a5d", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "Wm. A. Moses true bill. Ann Maria Wheeler  true bill. Alexander Christian  not a true bill. Will of Mrs. L. A. Owen admitted to record. A. H. Clement on motion allowed  to practice the law in this court.  F. W. McKinney qualified as con stable for Clover Hill district, with J. W. McKinney. C. II. Sackett, and Geo. T. Peers as suretiesbond  2,000 D. P. Ferguson, Overseer Poor m Clover Hill district, qualified, with w S. L. Ferguson as surety, bond 500. Fnris, O. W. Blanton, ir., W. _. W. II. Ligon, Supervisor for  Jackson, B. A. Wilson, W. A. W Clover Hill district, qualified with S. C. Stratton as surety, bond 1,000. S. C. Stratton, Supervisor for"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "ir., W. _. W. II. <mark>Ligon</mark>, Supervisor for  Jackson, B."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "ir., W. _. W. II. <mark>Ligon</mark>, Supervisor for  Jackson, B."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2121.04, 822.39, 2292.79, 971.18], "bbox_id": "17c0d51cbd", "file": "AppomattoxNewspapers_1947-1949a_0506.pdf", "page": 1, "text": "With the retirement on July 31 of L. N. Ligon, Postmaster for 26 years at Pamplin, it wqs understood this week that an acting post master will be appointed by that time to serve until a permanen ap pointment is made. To select a per manent postmaster, civil service examinations will be held at a time and place to be announced. Patrons of the Pamplin postoffice will be eligible to take the examinations. Thlr permanent appointment will be made from among the top three in the civil service examination."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "31 of L. N. <mark>Ligon</mark>, Postmaster for 26 years"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "31 of L. N. <mark>Ligon</mark>, Postmaster for 26 years"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.14, 483.08, 1679.41, 1142.56], "bbox_id": "961fde4660", "file": "AppomattoxNewspapers_1926-1933a_0506.pdf", "page": 1, "text": "With several big property sales scheduled here Saturday, a large crowd is expected in town. Then i the afternoon a baseball game will be played between Appomattox and Clov er Hill district teams.    Mrs. Ida Marks, at Bent Crëek, observes that folks find money with which to buy gaso line. fts spring feyer Mrs. Marks, and they like 1 to go places.  4c  Altó, say, thats going to be a real bridge dpwn Bent Creek way when the highway forces finish. But what a lot of filling in to be done.   W. H. Ligón, Pamplin merch ant. can relate his own Believe It Or Not experience. Says that some time past, a one-foot-1 ed man came into his store and ordered a shoe just for the left foot. No sooner was the trans action completed than another  one-footed man came in and I ordered a shoe just for the I right footand both happened to wear the same size ! And the I men didnt know each other! J W   Father Darkleaf was onct a colHch-mate of Rev. R- T. Smith of Evergreen. So t other morning we sat us down in Hamiltons store and talked ot this and that and what, had happened to our friends of I school days. Didya ever do that?    Capt. Buck or A. H. Clem ent to you, took Father Parie- leaf out to see his applet bios-1 so ms last week, and my they were beautiful. But lo and be hold caterpillars were mating up everything, and Capt. Buck hast been on a spraying ramp age this week?   ft. Sheriff McKinney says one of the cleanest kitchens and din ing rooms hes ever been m is the one at the convict camp near Bent Creek. No man should try to escape from that place, he says."}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "be done.   W. H. <mark>Ligón</mark>, Pamplin merch ant. can"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "be done.   W. H. <mark>Ligón</mark>, Pamplin merch ant. can"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [842.88, 921.06, 2174.91, 1784.85], "bbox_id": "e941d7d1dc", "file": "AppomattoxNewspapers_1971-1973a_0244.pdf", "page": 1, "text": "WITH PURCHASE OF 4 LIGHT BULBS  Appomattox County supervis ors and officials of the Va. De partment of Highways, Appo mattox Residency, heard twen ty-two requests for 3.55 miles of new additions and 19.80 miles for improvements during a public hearing Friday morning, the regular meeting day for su pervisors and the date of the an nual road request meeting. Three requests for new addit ions were made from residents of Cloverhill district for a total length of 1.45 miles. Stonewall district also had three requests for additions for a total of 1.25 miles and Southside district, two requests for a total of .85 miles. Six requests for road im provements for a total length of eight miles came from Clo verhill district four requests from Stonewall for a total of 6.30 miles and four requests from Southside district for a total of 5.50 miles. In other action Friday super visors head from about 30 tax payers in person and 1,000 pet ition with regard to the recent reassessment of property. One individual, speaking dir ectly to the board, is concerned about an increase of 65 in his assessment and feels that his is unequal taxation in relation to property adjacent or close to his own in Pamplin. Walter Henry, farmer of Stonewall district, says he is concerned with land-use, and that farmers taxe s are out of proportion sometimes to tax as sessments for land which is going to be used for develop ment, other than farming. Supervisors also approved an ordinance which dissolves the former Finance Board of the county and transfers those dut ies to the board of supervisors. Supervisors devoted a good deal of time to the entire ques tion of taxation. The rate for taxation is set each April and the board talked about possibi lities of tax revenue from a bumper strip on each automo bile, a tax on public utilities or extra sales tax. Board mem bers stated that their effort in this line are directed to  spreading taxes among all the people - those who own pro perty and those who do not so that the burden of county gov ernment and schooling can be shared by all who benefit. Earlier inthemeetingattorn- ey Robert Carter said he spoke for the delegation present in the Court House asking for clari- ficiation of the recent reas sessment. He asked tha t the tax be lowered from the present 3.00 per hundred evaluation. Cecil Ligon, merchant of Pamplin, said that his mission was to seek equalization and"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "per hundred evaluation. Cecil <mark>Ligon</mark>, merchant of Pamplin, said"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "per hundred evaluation. Cecil <mark>Ligon</mark>, merchant of Pamplin, said"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1910.19, 911.32, 2080.68, 1354.27], "bbox_id": "bc09153800", "file": "AppomattoxNewspapers_1936-1939a_0027.pdf", "page": 1, "text": "With only one weeks practice be hind them, but with an impressive list of veteran players, the Appo mattox high school football team journeys to Bedford tomorrow after noon for the opening game on a difficult schedule. Coach Charles A. HHt indicated today that he would test out several combinations during the game, and hoped to make a creditable showing against the strong Bedford eleven. Although five lettermen from last years team are missing due to grad uation, Coach Hilt has enough vet eran material available to start a letter-winner at each position if he so desires. However, several of the new players are showing up so well in practice that several new men may be in the starting line-up. Captain Jack Turman and three other lettermen are available for baclcfield duty. The backfield candi dates include Captain Turman, Har ry Burge, Ivanhoe Bryant, David Christian, Billy Ould, Harold Caw- thorn, William Mitchell, Charles Bryant and James Garrett. At the end position, the coach has Guy Cabell, Buck Wallace, La- than Harvey, Julian Hesson, Her man Dee and Buck Smith. Tackle candidates are Tom Guill, Buster Moore, Robert AHjen Sears, and James Spiggle. At center, Chester Ligon and J. E. Carson Jr. are vieing for the starting nod. Guard aspirants are Sid Conner, Joe Ferrell, Roy Craw ley, Frank Miller, Pete -Evans and Andrew Paulette. New j era ays, helmets, shoes and pants have been purchased, and the blue and white team will have a snappy eappearance. The first home game will not be played until October 13. There is a, possibility that the home games may"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Spiggle. At center, Chester <mark>Ligon</mark> and J. E. Carson"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Spiggle. At center, Chester <mark>Ligon</mark> and J. E. Carson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [714.26, 1269.62, 1881.43, 1521.43], "bbox_id": "d75a3080ae", "file": "AppomattoxNewspapers_1939-1943a_0016.pdf", "page": 1, "text": "With allowances for tares and the location of the cotton, Commodity Credit Corporation loans on the Freshman New fr j .    .   y -  - T.y Hazel Schutt  The V reshmna Civics club held its monthly meeting on Friday, Dec- . ember i. , fThe Freshman Science class hffd a debate Resolved, That if. a tree fell a hundred milesaway and no living person was 4aiound, there  would be no sounds Thoseon  the  affirmative were Chaster Ligon, Mur iel Ferguson and Robert Seay. Those on tire negative were Audrey Pugh, Rebecca Johnson and Amy Thomp son. The affirmative won.  We wert all sorry to hear of the sudden death of Dr . MacLean. Sev- eral from the Freshman class attend ed., the funeral. The whole school bowed its head for three .minutes in iribute-to Dr.-MacLean.-"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "the  affirmative were Chaster <mark>Ligon</mark>, Mur iel Ferguson and"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "the  affirmative were Chaster <mark>Ligon</mark>, Mur iel Ferguson and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2085.08, 1298.93, 2232.08, 1389.07], "bbox_id": "5c417bd1e0", "file": "AppomattoxNewspapers_1933-1936a_0477.pdf", "page": 1, "text": "With a vote turn out a bare forty, citizens of Pamplin named a mayor and town council this Tuesday. Mayor F . H . Lukin was reelected without opposit ion. The following were named to the council W . R.Brightwell, W M Black, J. M. Inge T. C. Ligon, J. D. McDearmon and C. W . Slayton ."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "M. Inge T. C. <mark>Ligon</mark>, J. D. McDearmon and"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "M. Inge T. C. <mark>Ligon</mark>, J. D. McDearmon and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.64, 1684.24, 1774.32, 1770.09], "bbox_id": "158298cfb6", "file": "AppomattoxNewspapers_1905-1912a_0149.pdf", "page": 1, "text": "with a here, of which he is pastor, that it unite for the purpose of holding a could maintain a regular pastor, re- aeries of meetings, having secured tires with the good will of all, the the efficient help of Doctor Hamil- call to the chnrches having been I ton, of Lynchburg, pressed upon him, which the Doc- Mr. W. H. Ligon having re- tor could not accept.  modeled the old Dnrphey home here"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Doc- Mr. W. H. <mark>Ligon</mark> having re- tor could"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Doc- Mr. W. H. <mark>Ligon</mark> having re- tor could"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2154.93, 350.54, 2410.77, 399.44], "bbox_id": "d111630098", "file": "AppomattoxNewspapers_1949-1952a_0067.pdf", "page": 1, "text": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. Ligon. Oakville"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. <mark>Ligon</mark>. Oakville"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. <mark>Ligon</mark>. Oakville"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2152.29, 351.17, 2317.07, 399.59], "bbox_id": "3d8c399a7e", "file": "AppomattoxNewspapers_1949-1952a_0066.pdf", "page": 1, "text": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. Ligon."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. <mark>Ligon</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "with a good attendance. Mrs. Mil dred Alvis, of Appomattox, was the guest speaker. Other speakers were the Rev. T. L. Simpson and Mr. L. N. <mark>Ligon</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [204.23, 1443.6, 367.14, 1780.44], "bbox_id": "0f3389ffa7", "file": "AppomattoxNewspapers_1892-1898a_0433.pdf", "page": 1, "text": "Winginia. As 1 have not seen any news from our little village for so long, I will try to give you a few items. The crops are looking very well, considering we have had such a long drought. Mr. C. I. Johnson returned Sat urday after a months stay at the Hot Springs much improved in health. We wish him a speedy re covery. Mr. Robt. Saunders is ill. Mrs. Claud Camper, of Lynch burg, who has been visiting at this place left for Charlottesville Mon day. A Soapstone Quarry opened last week on the place of Mr. William Ligon, about seven miles from this place, it will give a great many meu employment and is being worked by a Northern firm. There has been a new post-offlce established in Nelson, at the place formerly kuown as Cash Corner, now Broaddus. Mr.xR. H. Saunders is postmaster."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "place of Mr. William <mark>Ligon</mark>, about seven miles from"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "place of Mr. William <mark>Ligon</mark>, about seven miles from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [357.86, 206.75, 838.87, 369.4], "bbox_id": "f711d1610e", "file": "AppomattoxNewspapers_1918-1922a_0228.pdf", "page": 1, "text": "willing to hazard a guess as to i Proceedings o f Board of Super- what prices will be next spring, visors lor Septem ber as the raw materials now being  At a meeting of Board of So purchased are for the fall out pervisors of Appomattox conn- put. If a general decline in ty h Id at the Clerks  ffic on irò again to King College, at  prices of everything takes place September 8presenf W. H. Bristol, Tenn. .before the spring materials  Ligon, I. ,E Smith and 8. E The Hoard of Supervisors are bought, prices to the farmer  Anderson, the following maims have decided to sell the countys may be lower in the spring, but 1 were presented to the Board there is no prospect at present -and xtmined and approved, of the general stabilization1 and warrants ordered drawn that will bring this about.  for their payment Th  advice of these men, ano i poor h o u se and pa u p e r s re- j it, is probably the bP 8 t w e h a v e j Qyy Watson, board and care of in- ! ts g o o d , ifl fo r t h e f a r m e r s j mates to Sept, is  soooo who exp C t to n e e f o r t ll Alice Ferguson 2 50"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "before the spring materials  <mark>Ligon</mark>, I. ,E Smith and"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "before the spring materials  <mark>Ligon</mark>, I. ,E Smith and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.05, 1217.36, 1768.16, 1768.8], "bbox_id": "aec200ed52", "file": "AppomattoxNewspapers_1943-1947a_0391.pdf", "page": 1, "text": "Willie Watson Ihos. and Herbei n Jamerson Mr. and Mrs. S. R. Woodson Jamerson and Garst J. S. Cole J. H. Tolley Annie Tolley Z. T. Moran W. R. Brightwell J. M. Lnge Dr. F. H. Lukin Mrs. R. C. Hughes Mrs. M. J. Williams E. L. Paulette  N E. Farrar Cash Mr. and Mrs. Clayton Beale H. T. Terry F. L. Adams Howard Williams Alvin Price Mr. and Mrs. T. C. Ligon W. C Franklin Miss .Wilsie Thornton Miss Mattie Thornton Mrs. Flossie Martin Mrs. Bessie Maddox Mrs. J. F. Conally Lacy Dickerson Miss Kate Franklin Mrs. Nellie McClenny Mr. and Mrs. E. F. Davis Mrs. O. B. Brooks F. B. Fitzgerald Jim Inge Williams Service Station Cash Mr. and Mrs. W. M. Black Mr. and Mrs. T. N. Kansone Leslie Pankey F. M. Irving Bennie Massie Glenn Gilliam KiurV St. John font- J. Ligon Pv It. Fore Sam Baldwin Mr. and Mrs. L. N. Ligon Mrs. Lizzie Robinson Pixie Southall J. S. Meadows Sadie Wooton Mamie Inge Mrs. Etta Cum by Mr., Mrs. T. D. Guthrie C. E. Ramsey Mrs. Ruby Clarke W H. Ligons Son Divlo Garrett"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "and Mrs. T. C. <mark>Ligon</mark> W. C Franklin Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "and Mrs. T. C. <mark>Ligon</mark> W. C Franklin Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. Smith, Leslie N. <mark>Ligon</mark>, L. E. Smith, C."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. Smith, Leslie N. <mark>Ligon</mark>, L. E. Smith, C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [830.39, 234.96, 1229.63, 354.91], "bbox_id": "6e5f6f5cc8", "file": "TimesVirginian_1980a_0366.pdf", "page": 1, "text": "William C. Dudley, who agriculture in the Appomat- J l S f S ï l i Î i Î has served as sssiaaat tox and Pampliii high 1978 the nationriorgoniz supervisor of agricultural schoola. where he taught tton of F  u r a m e ra of M htk to? Virginia until 1946. In April of 1946 AMrto awarded Wm He Department of Education he as appointed area highest honor, the Honrary since 1946, retired October supervisor of egriettfetfal American  armer u gro. H. education for Southside Dudley is married to the Virginia with headquarters former Margaret Ligon of Dudley. 6. a native of ta Appomattox. Appomattox gronty-They Montgomery County, has in 1967 he was named have one eon, W. C. Dudley, devoted his entire profess- Man of the Yéar in DI and one grandson, W. C. tonal career of 44 years to Forestry by the Virginia Dudley, IV,"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "with headquarters former Margaret <mark>Ligon</mark> of Dudley. 6. a"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "with headquarters former Margaret <mark>Ligon</mark> of Dudley. 6. a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1780.53, 1150.92, 2122.62, 1352.96], "bbox_id": "f9dd5ef2aa", "file": "AppomattoxNewspapers_1952-1954a_0508.pdf", "page": 1, "text": "WILLIAM A. HARRIS William Anderson Harris died un expectedly February 18 here. Born Nov. 12, 1925, he was the son ofjri Cecil Ligon, Pamplin Mr. Iveyj Harry Hudson Hams and Margaret Holland, Appomattox. Burge Harris, he was a timber work er and a member of the Red Oak Baptist Church. He is survived by his wife, Shirley Fay Doss Harris- two brothers, Robert Wallace Har ris and Ralph Lee Harris. Funeral services were held Satur day at 2 P. M. from the residence of his parents. Interment was in the family cemetery. Services were con ducted by the Rev. E. S. Priee. Active pallbearers were Edd Doss, Chippy Harris, Tom Childress, Thomas Hanenkrat, W. F. Burge, Jr Dick Burge."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "the son ofjri Cecil <mark>Ligon</mark>, Pamplin Mr. Iveyj Harry"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "the son ofjri Cecil <mark>Ligon</mark>, Pamplin Mr. Iveyj Harry"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.63, 769.13, 1986.15, 894.38], "bbox_id": "127bb94783", "file": "AppomattoxNewspapers_1926-1933a_0377.pdf", "page": 1, "text": "Willard Dupey Ligon, 1 am plin, is a candidate for bache lor of science degree in com mercial engineering at Virgin ia Polytechnic Institute. De gree will be awarded to suc cessful candidates at exercises to be held in the W ar Memor ial Hall at Blacksburg Tues day morning, June 11."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Willard Dupey <mark>Ligon</mark>, 1 am plin, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Willard Dupey <mark>Ligon</mark>, 1 am plin, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.13, 545.85, 1927.97, 1329.88], "bbox_id": "889303af49", "file": "AppomattoxNewspapers_1971-1973a_0573.pdf", "page": 1, "text": "Willard D. Ligon, a native of Appomattox County, general manager of the Bryant division of the Westinghouse Electric corporation, who will retire December 31, 1972, was honored on November 12th, at a reception in the Holiday Inn, Bridgeport, Connecticut. The December, 1972, issue Westinghouse New, Bryant division, was entirely dedicat ed to him and was headed The Ligon Years - A Lasting Legacy. Along side a large picture of Mr. Ligon on the front page of the company newspaper, was the following What A Way To Go - Flags flying, Bands playing and Bryant surpassing all expect- ions! Yes, the Ligon years have been a lasting legacy. A legacy of unparalleled growth and accomplishment. A period of years marked by continued employment and new product development. To Willard Du- puy Ligon, as a testimonial to your 43 year Westinghouse career and its spectacular conclusion at Bryant Electric, we dedicate this issue of the Westinghouse News. Ligon was appointed General Manager of the Bryant Divi sion of the Westinghouse Corporation in 1963, having joined the company in 1929, after graduating from Virginia Polytechnic Institute with a B.S. in industrial engineering. A native of Pamplin, Virginia, he graduated from Blackstone Military Institute prior to attending V.P.I., Blacksburg, Virginia. He is married to the former Mary Brightwell of Pamplin. His first Westinghouse as signment was as a foreman in the Motor Division at East Pittsburg, Pa. He rose to general foreman, assistant superintendent and superin tendent. While in this division, at the end of World War II, Mr. Ligon was moved to Buffalo, New York, along with the division, and served as resident manager and then was appointed manager of the Motor Division. He was named general works manager of the combined Motor and Control Divisions at Buffalo in 1950. In 1951, he moved to Sunnyvale, California, to become project manager at the Westinghouse plant in charge of building"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Willard D. <mark>Ligon</mark>, a native of Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Willard D. <mark>Ligon</mark>, a native of Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1473.87, 439.01, 1566.12, 458.61], "bbox_id": "03c3d64e40", "file": "AppomattoxNewspapers_1947-1949a_0378.pdf", "page": 1, "text": "will visit his parents, J. Ligón during"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "will visit his parents, J. <mark>Ligón</mark> during"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "will visit his parents, J. <mark>Ligón</mark> during"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [729.33, 183.13, 872.48, 565.36], "bbox_id": "c6cac3b4e8", "file": "AppomattoxNewspapers_1974-1975a_0485.pdf", "page": 1, "text": "will be the guest speaker. Regular preaching service was held at the Zion Baptist Church Sunday morning at lla.m. with the pastor, Rev. L. E. pnkins in charge. He was assisted in the morning worship by the Rev. Charlie Moore. Rev. Hankins preached a wonderful sermon. His text was taken from the 15th chapter of S t John. His subject was, Oh How I Love Jesus. All present enjoyed the message. Music was rendered by the Junior choir under the direction of Mrs. Grace Wormack. The offering was great We were happy to have many visitors to worship with us. At the close of the morning worship, the Lords supper was served. Deacon James Franklin was home for the week-end. Mrs. Dorothy Ligon is in the Lynchburg General-Marshall Lodge Hospital. The Iev. James Franklin has recovered from his recent illness. Mem bers and Mends are invited to attend the annual Womans Day program at the S t Luke Baptist Church this Sunday evening at 3 P.M. Our own Mrs. W. 0. Smith will be the guest speaker."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "the week-end. Mrs. Dorothy <mark>Ligon</mark> is in the Lynchburg"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "the week-end. Mrs. Dorothy <mark>Ligon</mark> is in the Lynchburg"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1728.22, 1560.06, 1895.82, 1630.3], "bbox_id": "633f85012d", "file": "AppomattoxNewspapers_1947-1949a_0058.pdf", "page": 1, "text": "Wilbur St. John, Wade Drinkard, Harry Lawson, Sam Ferguson,Rich ard Burton, D. B. Irby, Jr., Richard Mundy, Thomas Ligon, Jr., R. S. Baldwin, Jr., James Thomas War- field, Calvin Tanner, Edmund Teg- ethoff."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Jr., Richard Mundy, Thomas <mark>Ligon</mark>, Jr., R. S. Baldwin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Jr., Richard Mundy, Thomas <mark>Ligon</mark>, Jr., R. S. Baldwin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [81.08, 908.27, 388.14, 1147.2], "bbox_id": "f8b0987e08", "file": "AppomattoxNewspapers_1898-1902a_0488.pdf", "page": 1, "text": "Whitakers, N. C., Jan. 29 , 1901 .! Farm ville, V a., Jan. 16 , 1901 . M b . A i . r z . G h e e s , ! M r . J . W . W om ack , Whitakers, N. C. j Farm ville, Va. Dear SirI have been raising pea- Dear SirMy tobacco, which took thr nnta for twelve years, and have used! sweepstake premium at the Farmrilli plaster, limn and other fertilizers, and i Fair last Fall, was raised with AR- after using ARMOURS GENERAL, for MOL K S TOBACCO SPECIA L ferliliiw three years, bought of you, I unhesi- and BONE M E A L the land upon which tatinglv sav that it is the best gnan I ! this tobacco was raised bad no manat ever used.  upon it whatever. There wero more than Last year 1 1900  I grew on four acres j three hundred samples competing forth one hundred and twentv-five sacks, weigh-premium, and I consider your fertUin ing 90 pounds each.  i first-class, and expect to use them Yours truly. J . R. E th eridge . ciusively this season. Yours truly, E. C. S toïes . The above are copies of two letters received, one each from North Carolina and Virginia. These goo ds a re for sale by the fo llo w in g dealers in y o u r State FERGUSON  SMITH, West Appomattox, Va. R. G. ROBERTSON, of W. S. Fore  Co., Lynchburg, Va. W. H, LIGON, Pamplin, Va JEFF. DAVIS, Dillwyn, Va."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "Lynchburg, Va. W. H, <mark>LIGON</mark>, Pamplin, Va JEFF. DAVIS,"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "Lynchburg, Va. W. H, <mark>LIGON</mark>, Pamplin, Va JEFF. DAVIS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [504.48, 263.32, 835.41, 303.57], "bbox_id": "09bcd43290", "file": "AppomattoxNewspapers_1892-1898a_0425.pdf", "page": 1, "text": "When, i sci.it as the representative from f , , , , , .-Appomattox in the next general therefore, a large number of assembly, 1 notice uie name of Mr. democrats, together with the wives,! W II. Ligon as being in every sensei"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "the wives,! W II. <mark>Ligon</mark> as being in every"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "the wives,! W II. <mark>Ligon</mark> as being in every"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2363.26, 169.65, 2666.61, 213.5], "bbox_id": "7a01146530", "file": "AppomattoxNewspapers_1971-1973a_0570.pdf", "page": 1, "text": "were Mr. and Mrs. James G. and Mrs. L. Newton Ligon oi Ligon. J. G. Ligon, Jr.. Leslie F a-fmville, M r. and Mrs. W. H. N. Ligon. Ill and Miss Sandra i Ligon. II and Mr. Fred f Phelps of Raleigh, N. C., Mr.  Guthrie of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Ligon", "Ligon"], "snippet": "and Mrs. L. Newton <mark>Ligon</mark> oi <mark>Ligon</mark>. J. G."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon", "Ligon"], "snippet": "and Mrs. L. Newton <mark>Ligon</mark> oi <mark>Ligon</mark>. J. G."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [295.21, 1106.65, 457.8, 1405.65], "bbox_id": "9af79a8b51", "file": "AppomattoxNewspapers_1908-1909a_0188.pdf", "page": 1, "text": "Well the last monthof Spring most gone and fires and blank- tsffcre still very comfortable and ardens are very late. We hope the beet les will get impatient and move on. ML - Mr. Moody Woolridge, who has been very ill fxr some time improving abme, ijhia, friends lope to see him oat soon. - Mrs. W. B. Thomas, who has een .suffering with her eye for some time is in Lynchburg tak ing treatment under Dr. Walters. Mrs. S- J. Jennings, Mrs. Sam Staples, Miss Lonell Hamilton Mrs. J, J. Farrar visited the Jill City Monday. Mr. and Mrs. Archer Ligon aha -little daughter and Miss Vlargaret Pittman, of Richmond were the week-end guests of Mrs. 6. P. Farrar.  Revival services will begin at the Baptist Church here next"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs. Archer <mark>Ligon</mark> aha -little daughter and"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs. Archer <mark>Ligon</mark> aha -little daughter and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.44, 412.11, 1692.55, 951.3], "bbox_id": "0c09345b47", "file": "AppomattoxNewspapers_1926-1933a_0421.pdf", "page": 1, "text": "Well, the hohdays are gone, Christmas was quiet in Pamplin. The poor and needy were re membered here. Many baskets and contributions were sent them I by churches, organizations and j individuals. The Christ spirit was -xemplified in many ways. Rev. J. E. White preached ex cellent sermons on the fifth Sun day. His Xmas message was enjoyed by all. Many of our young people who spent the holidays at home.have returned. Misses Mary West Terry, Elizabeth Gilliam, Martha Hughes, Hilda Ligon and Mary Brightwell returned t o State Teachers College, January 1st.  Messrs. Jack Brightwell Kenneth j Farrar t o Hampden Sidney, Willard Ligon to V. P. I., Frank j I Lukin to Wm. and Mary and  Hamlet Franklin to Richmond College. Miss Kate Franklin spent Xmas in New York with her brother, Dr James H. Franklin. Miss Merle Davis accompanied her mother, Mrs. N. A. Davis to Richmond, where she spent the holidays. Miss Illene McClenny enter tained the young people on Sat urday night. They all reported a nice time. Mrs. H. T. Terry entertained at a dinner party on Monday, December gist. The guest list included Mrs. James McDearmon Mrs. Lillie Moses, Mrs Ed Car- wile, Mrs Frank Fitzgerald, Mrs. T. N. Ransom, Mrs. 0. E. Peterson and Miss Lee Rice.  Mrs. T. N. Ransom entertained"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Gilliam, Martha Hughes, Hilda <mark>Ligon</mark> and Mary Brightwell returned"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Gilliam, Martha Hughes, Hilda <mark>Ligon</mark> and Mary Brightwell returned"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.57, 1207.16, 1926.99, 1427.44], "bbox_id": "35f44623e5", "file": "AppomattoxNewspapers_1926-1933a_0209.pdf", "page": 1, "text": "well, of Farmville State Teach ers College Margaret Ligon of Virginia IntermontT College Bristol Miss Virginia Thorn ton, of William and Mary Ex ension School, Richmond Iamlet Franklin, of Richmonc Medical College Paul Hughes f Tri-State College, Frank Lu in, of Raleigh, N. C., Miss iilda Ligon, of Rustburg Miss izabeth Duling, of Chester nd Prof. Marion Duling, of illwyn. Mrss J- S. Dorsey has as her ..tests for the Christmas sea on her daughter, Virginia, of orth Carolina College for omen, Greensboro, her son, in ohn, and her sister, Mrs. G- .three hours- I. Strickland, of Monroe, N."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Teach ers College Margaret <mark>Ligon</mark> of Virginia IntermontT College"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Teach ers College Margaret <mark>Ligon</mark> of Virginia IntermontT College"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.87, 535.09, 2486.98, 945.68], "bbox_id": "65b1216912", "file": "AppomattoxNewspapers_1949-1952a_0580.pdf", "page": 1, "text": "weeks now Slates of delegates to district and state conventions were elected at a Democratic mass meeting last Fri day night at the court house. The meeting adopted two resolutions one endorsing Watkins M. Abbitt for renomination and re-election to Congress from the Fourth District, introduced by Calvin Robinson and one endorsing the record of United States Senator Harry F. Byrd, in troduced by C. W. Smith. Congressman W. M. Abbitt was present and addressed the meeting. Charles F. P. Crawley served as the presiding officer of the meeting and C. W. Smith served as secretary. The following delegates, instruct ed to vote as a unit, were named to the Fourth District Convention in Petersburg, May 24 J. A. Bingham, George Abbitt, Jr. G. T. Moses, Sr. G. B. Buchanan, J. H. OBrien, Wal lace E. Bondurant, John E. Burnett, Mrs. N. A. Wagers, N. E. Farrar, C. C. Harvey, Mrs. J. W. Flood, Mrs. Hazel R. Mann, Grover E. Smith, E. T. Guill, C. T. Moses, Jr. H. C. Pulliam, Mrs. Margaret Calcott, R. C. Hubbard, P. B. Stratton, Calvin H. Robinson, J. A. Burke, D. A. Conner, J. W. Cawthorn, F. J. Smith, Irby B. Wheeler, David T. Robertson, Chas. F. P. Crawley, T. C. Ligon, W. W. OBrien, Mrs! C. H. Robinson, Mrs. F. C. Dresser, J. W. Conner, Tobey E. Inge, Eula M. Burke, R. D. Robinson, W. D. Fer guson, H. A. Williams and John P."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "P. Crawley, T. C. <mark>Ligon</mark>, W. W. OBrien, Mrs!"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "P. Crawley, T. C. <mark>Ligon</mark>, W. W. OBrien, Mrs!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [753.59, 721.46, 922.89, 941.7], "bbox_id": "c7b99afe71", "file": "AppomattoxNewspapers_1954-1955a_0349.pdf", "page": 1, "text": "Week-end visitors in the home of Mr. and Mrs. E. B. Davis were Mr. and Mrs. W. S. Wayne, of Phenix, and Mrs. Sam Nash, of Williams burg. Mrs. J. W. D. Canada is visiting her sister, Mrs. W. T. Cocke, of Phenix. Miss Edna Mae Davis spent last week in the home of Mr. and Mrs. Harry Yeatts, of Farmville. Mrs. Bernard Carey has return ed to her home in Richmond, after spending some time with her sister, Mrs. T. J. Ligon. Mr. and Mrs. Clarence Pankey and children, of Roanoke are visiting relatives here. Mr. and Mrs. Harry Yeatts and children, of Farmville were week end visitors in the home of her parents, Mr. and Mrs. Tom Davis."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "sister, Mrs. T. J. <mark>Ligon</mark>. Mr. and Mrs. Clarence"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "sister, Mrs. T. J. <mark>Ligon</mark>. Mr. and Mrs. Clarence"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [455.99, 355.59, 621.14, 382.89], "bbox_id": "a5711c7cf6", "file": "AppomattoxNewspapers_1955-1957a_0128.pdf", "page": 1, "text": "week-end guests in the home of Mr. and Mrs. T. J. Ligon."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "week-end guests in the home of Mr. and Mrs. T. J. <mark>Ligon</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "week-end guests in the home of Mr. and Mrs. T. J. <mark>Ligon</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2368.31, 1540.87, 2539.31, 1715.03], "bbox_id": "f5b3cf2c47", "file": "AppomattoxNewspapers_1939-1943a_0061.pdf", "page": 1, "text": "Week ending March 9tb Team   Auto Service  Cassco -2 ia Pamplin H 2 Independents Hardware   Shoe Shop a   Ramsey  i , Moses _  ! . . r High team score, Cameo, 1M7 Individual high score, Jimmy Hea ding, 868. , , _ ____ . High scores made w the rubber duck pinj Ed    J 198 Pace Smith and Chuck Ligon 166 each Tonray Ferguson 15, Miss Lucy LaGrmnd 125 Mias Beu lah Ferrell 115."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Pace Smith and Chuck <mark>Ligon</mark> 166 each Tonray Ferguson"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Pace Smith and Chuck <mark>Ligon</mark> 166 each Tonray Ferguson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.05, 718.53, 2265.29, 865.13], "bbox_id": "11f18a6b58", "file": "AppomattoxNewspapers_1908-1909a_0251.pdf", "page": 1, "text": "Wednesday, Sept. 8, at Stonewall, 10 A. M. Thursday, Sept. 4th, at Ap pomattox C. H., 10 A. M. AJ1 land owners of Appo mattox County wishing to be heard in regard to Equalizing their assessments are request ed to appear before the Board at any of these meetings. Horsley, Chm. Lo cal Board, of Equalization of Assessments, L N. Ligon, Secy. 2t"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "of Assessments, L N. <mark>Ligon</mark>, Secy. 2t"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "of Assessments, L N. <mark>Ligon</mark>, Secy. 2t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1367.76, 924.63, 1521.69, 984.08], "bbox_id": "683883d435", "file": "AppomattoxNewspapers_1922-1923a_0518.pdf", "page": 1, "text": "We understand that Dr. C. S. Morton, of Pamplin, has sold his residence to Hon. W. H. Ligon, but that Jr. Morton will continue to occupy same."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "We understand that Dr. C. S. Morton, of Pamplin, has sold his residence to Hon. W. H. <mark>Ligon</mark>, but that Jr. Morton will continue to occupy same."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "We understand that Dr. C. S. Morton, of Pamplin, has sold his residence to Hon. W. H. <mark>Ligon</mark>, but that Jr. Morton will continue to occupy same."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.33, 204.88, 519.56, 1174.42], "bbox_id": "d1f676eab9", "file": "AppomattoxNewspapers_1892-1898a_0453.pdf", "page": 1, "text": "We publish an interview with Mr. Fleshman on this subject in another column and ask that the people be left to decide whether or not be intended becoming a candidate. Again where is the milk in this coooanutP Mr. Fleshman claims he conld have received the endorse ment of both the Republican and Popnlist partita, but he would not make the raceholding in his pocket the certificate, he suddenly throws up the sponge and leaves the field, realizing no doubt that it is better now than the returns would show, laving made the fight for offloe before, and going down under heavy majorities, we do not doubt our friends wisdom in making the wise decision he did. WM. DANIIL HIX. This candidate, who paraded his democracy before the people of this connty during the canvass for the primary nomination is the latest surprise the people have. Having submitted his claims to the primary and there suffering defeat he now has the egotism to come forth as an udependent Independent what Republican ? Surely there is not a democrat in the whole county who will now tnrn his back on the nom inee of his party and violate the ledge made in said primary to sup- ort its nominee. How any self- respecting man can violate snob a pledge is more than we can under stand. When Mr. Hix submitted iis claims to the primary he with every other honorable Democrat be came bound by its result. Had Mr, Hix received the nomination of that primary it would have been a pleas nre for all Democrats to have unite and given him their support, and he wonld have found us with all of Mr. Ligons friends fighting his battle as oar party nominee. Now the duty of every Democrat and every man who voted in that primary is plain. Theres no earthly excase for Hixs candidacy. He had his chance. He,lost. He now seeks office at the hands of those he de nounced. Republicans. The Re publicans will not support him ant the Democrats will oppose him, anc altogether Mr. Hix seems to have placed himself in a position from which it is useless for his friends to attempt his reformation. Democrats your duty is plain anc that yonr rebuke to bolters will severe no sane man doubts. Mr. Ligon, the Democratic nom inee is making a good canvass, spoke at Campbell court Monday, and that connty as well as Appo mattox will administer to Mr. Hix the greatest and, most crashing defeat of his life. Democrats the election is less than three weeks offtake nothing for granted, but go earnestly to work to give our nominee such a majority as will forever settle the indepen dents in this county. Make the vic tory a glorious one, the defeat cer tain. Work!"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "sane man doubts. Mr. <mark>Ligon</mark>, the Democratic nom inee"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "sane man doubts. Mr. <mark>Ligon</mark>, the Democratic nom inee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [598.83, 589.95, 755.88, 648.2], "bbox_id": "90ffa47aa1", "file": "AppomattoxNewspapers_1898-1902a_0571.pdf", "page": 1, "text": "We have been unable to get the in format ion asked for by Supervisor Ligon, hut will endeavor to do so for our next issue, when will make re ply to his communication."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "asked for by Supervisor <mark>Ligon</mark>, hut will endeavor to"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "asked for by Supervisor <mark>Ligon</mark>, hut will endeavor to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [650.87, 501.85, 817.52, 521.25], "bbox_id": "073148b514", "file": "AppomattoxNewspapers_1952-1954a_0562.pdf", "page": 1, "text": "We are sorry to hear Mrs. Cecil Ligon is in the hospital."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "We are sorry to hear Mrs. Cecil <mark>Ligon</mark> is in the hospital."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "We are sorry to hear Mrs. Cecil <mark>Ligon</mark> is in the hospital."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2199.79, 489.62, 2549.88, 999.8], "bbox_id": "6e7bb1ce20", "file": "AppomattoxNewspapers_1960-1962b_0317.pdf", "page": 1, "text": "Washington, D. C.  Manager Re-lph Houk, of the New York Yonkees, is In a hot seat as he begins the 1861 season. In the first place he follows a manager who was the most colorful, and popular,  in the game. If that were not enough he fol- r lows a manager who tang p a record of winning pennants which will be difficult for anyone to match and the Yankees start out this year as Ameraican League pennant winners of 1961, so in the seasons regular play they have nowhere to go but down. Add Do this the fact that Houk must deoil with players much eloser to his own age, while not - yet having earned the respect Casey Stengel had, and you can see that the new Yankee skipper has his work cut out  Just how strong the New York clnb will be this year is a good question. The strong hlfcting is considered certain - Mantle Maris, Berra, efc. The pitching, how ever, must hold up or the Yankees, with all their power tould be in trouble. It was pitching that almost cost the Yanks the pennant last year. That the strong point of the , challenging Baltimore Oriolee, who  made a fight of it down to Sep tember. Oriily two- tennis seem to much chanee of making a strong Mr. Tommy Ligon and Mias  nuflti onance or mami  a Nor.tan were week-end guests run for the pennant, along with the home of his parents, Mr. andjjfiw York. They are the Chicago Mrs. T. C. Ugon. I white Sox and the Baltimore Orl Miss Charlotte Hart, and Misaoles! Some believe the riole  Miarguerette Johnston, of Rich.f0de a bit this year, hat perhaps mond wer week-end guests in the ! Cleveland or Minnesota will gt home of Rev. and Mrs. J. L. Hart, into the pennant fimht. But at the outt the White Sox Mr. and Mrs. dairlton Wayne Orioles must be given the top and daughter joined ,her brothers  contending role. A1 Lopez is and sisters in,a family reunion  enough reason to put he White their old topme place Sunday. gox jn contention, end he has a"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "a strong Mr. Tommy <mark>Ligon</mark> and Mias  nuflti onance"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "a strong Mr. Tommy <mark>Ligon</mark> and Mias  nuflti onance"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.86, 228.71, 2111.48, 274.21], "bbox_id": "f05e32cb24", "file": "AppomattoxNewspapers_1918-1922a_0142.pdf", "page": 1, "text": "was approved and accepted. I8F Messrs J B Chilton and convict camp. On m otion W . B . Ligon isr essrs j a Chilton and R. continued as  d elegal e to th is Y s  ith appeared before the board to confer w ith tlie boards   a8ked for appoint"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "m otion W . B . <mark>Ligon</mark> isr essrs j a"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "m otion W . B . <mark>Ligon</mark> isr essrs j a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [353.74, 376.31, 684.1, 789.35], "bbox_id": "818d84f4d9", "file": "AppomattoxNewspapers_1908-1909a_0304.pdf", "page": 1, "text": "ward. His disease was cancer of the stomach. He had the very best of medical aid and loving hearts and willing hands were ever ready to do all that could be done, but alas he had lo answer when the summons erme. The family has the sympathy of a large circle of Mrs. O. C. Paulett visited friends, her people in Lynchburg last The death angel also visited week. the home of John Thomas Mc- Mrs. D. W. Dinkins and Gormick on February 2nd at 4 children spent Sunday with p. m., and took from that home Mr. and Mrs. Calvin Ranaon. che beloved Wife and mother Mr. Lacy Martin let a kitch- She had been in bad health for en cabinet fall on his foot and many months with brights dis broke several bones. ease and heart trouble, yet her Mrs. Hubert Martin spent death was a shock to those the week end with Mr. and arourd her. She leaves a hus- Mrs. W. F. Ranson. _ band and six children to mourn You are cordially invited to their loss. She had been mar- attend the services at Rocks lied twiee there were two church Sunday a. m. Sundayfthildren by the first marriage School at 10 a. m. and preach-Mrs. C. D. McCormick anc ing at 11 a. m. Harry Ledbetter and by the ast Union there are - four- Estelle, Edith, Catherine ana I William, all of Bent Creek .Burial took place Wednesday Rev. Gray L. Ligon conducting The pall-bear-"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Wednesday Rev. Gray L. <mark>Ligon</mark> conducting The pall-bear-"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Wednesday Rev. Gray L. <mark>Ligon</mark> conducting The pall-bear-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [852.49, 384.47, 1033.01, 1157.77], "bbox_id": "a8e9eb5f44", "file": "AppomattoxNewspapers_1915-1918a_0502.pdf", "page": 1, "text": "War Stamp Campaign Corn mitt Chairm an, L. Crawlay. Each m inister in county. Row. L. F. Gallaham, Appo m attox. Rev C. W. McElroy, Appo m attox. Rev. J . C. Lops, Appomattox. Rev. O. W. Taylor, Pamplin Rev. A. K. Lambdiu, Pam  plin. Rev. A. J . Ponton, Pamplin Rev. G.A. Chocolate, Phenix Rev. J . H. Gordon, Vera. Rev. O. R. James, Concord. Hon. 8. L. Ferguson, Appo m attox. Claude 8m ith, Appomattox. A. T. Inge, Appomattox. Don Moses, Appomattox. Prof. Bigley, Pamplin. Misa Jennie Godwin, Appo m attox. Hon. J . W. Cawthorn, Appo m attox.  P itser Gills, Appomattox. Hon. R. L. Burke, Appomat tox. 8. Pieree Loving, Pamplin. L.N. Ligon, postmaster,Pam plin. Hon. Willia Ligon, Pamplin. B. G. Anderson, Appomattox. Fenton Harvey, Pamplin. Boy ScoutsJ C. Leps, Ap pom attox. A. H. Clement, Appomattox Dr. D. A. Christian, Vera. Dr. H. 8. H art, Pamplin. Dr. Chap Jonee, Appomattox Dr. D. N. Twyman, Appo m attox. N. R. Feathereton, Vera. E. LeRoy Smith, Appomat tox. Robert Irby, Appomattox. Publicity CommitteeMinis ters of oonnty, A H. Clement L. Crawley. Committee On SchoolsEach teacher in county, and Super intendent of Schools N. R Feathereton. Personal Canvass  To be done by Scouts and sohool ohil dren. Womans OrganizationMrs R. O. W agner, Mrs. Pitzer Gills Mrs. 8. L. Ferguson, Miss Anna Jones, Miss Kate Franklin,Mrs. S. D. Cheatham, Miss Jacque line Atwood, Miss Enla May Burke, Miss M attie Sears, Mrs. John Sears. Mrs. W. T. Steele, 8pout"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Pieree Loving, Pamplin. L.N. <mark>Ligon</mark>, postmaster,Pam plin. Hon. Willia"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Pieree Loving, Pamplin. L.N. <mark>Ligon</mark>, postmaster,Pam plin. Hon. Willia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1125.8, 741.81, 1294.35, 813.26], "bbox_id": "77b12bacab", "file": "AppomattoxNewspapers_1952-1954a_0343.pdf", "page": 1, "text": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J. Ligon, Pamplin, Va. 8-13-3tp"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J. <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J. <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [793.94, 1629.16, 962.53, 1699.67], "bbox_id": "d78bfa8ea8", "file": "AppomattoxNewspapers_1952-1954a_0352.pdf", "page": 1, "text": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6  acre dark tobacco. Modern machinery. Write or see T. J. Ligon, Pamplin, Va. 8-13-3tp"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6  acre dark tobacco. Modern machinery. Write or see T. J. <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "WANTED Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6  acre dark tobacco. Modern machinery. Write or see T. J. <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1146.69, 1430.2, 1314.59, 1489.14], "bbox_id": "f2ee8624bb", "file": "AppomattoxNewspapers_1954-1955a_0027.pdf", "page": 1, "text": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. Ligon, Box 1234, Pamplin, Va. ltp"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. <mark>Ligon</mark>, Box 1234, Pamplin, Va. ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. <mark>Ligon</mark>, Box 1234, Pamplin, Va. ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1130.12, 1406.22, 1299.17, 1465.87], "bbox_id": "c701f62b25", "file": "AppomattoxNewspapers_1954-1955a_0033.pdf", "page": 1, "text": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. Ligon, Box 1234, Pamplin, Va. d tp"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. <mark>Ligon</mark>, Box 1234, Pamplin, Va. d tp"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "WANTED Tenant for my farm. General farm crops and dark-fired tobacco. Write to Mrs. L. N. <mark>Ligon</mark>, Box 1234, Pamplin, Va. d tp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.09, 421.83, 1830.26, 535.45], "bbox_id": "d8bbf9167b", "file": "AppomattoxNewspapers_1947-1949a_0254.pdf", "page": 1, "text": "WANTED A tenant to f l over a crop already started oerate fully equipped tfl and dairy farm. 4.2 acres t H land prepared and ready Plants ready to be set. 12 afl corn planted and growing.  to milk and feed. Apply qK us first for your gifts to a Graduate., Lovely watches L. N. LIGON,   H p b rn n d s  Birthstone Rings, Necklaces, Pei i of Pamplm, Va.     B a n d Buckle LSets. Compacts  and numerous ----- H   H th a t we guarantee to please in price and quality."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "Lovely watches L. N. <mark>LIGON</mark>,   H p b rn"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "Lovely watches L. N. <mark>LIGON</mark>,   H p b rn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.36, 333.27, 1777.84, 570.81], "bbox_id": "dc1b6229aa", "file": "AppomattoxNewspapers_1905-1912a_0512.pdf", "page": 1, "text": "Walter Anderson, colored, struck Capt. Ligon, freight conductor, in the face with a piece of ooal last Friday evmiug while the conductor was trying to put him off his train near Phoefea, and injured him slightly. A message was sent here for officers to met the train and capture bim When the train ar rived Anderson, with another negro who was riding with bim, saw the armed men and made a desperate ef fort to eecapj but failed. They were tried before Justice Moses Monday morning and Anderson was found guilty of bitting Capt. Ligon and sent on to the Grand Jury, while Scott was found guilty of stealing a ride and fined 10 and cost. Both were returned to jail."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Anderson, colored, struck Capt. <mark>Ligon</mark>, freight conductor, in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Anderson, colored, struck Capt. <mark>Ligon</mark>, freight conductor, in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1617.34, 330.9, 1778.71, 569.4], "bbox_id": "033f48a403", "file": "AppomattoxNewspapers_1905-1912a_0513.pdf", "page": 1, "text": "Walter Anderson, colored, struck Capt. Ligon, freight conductor, in the face with a piece of coal last Friday evining while the conductor was trying to put him off his train near Phoeba, and injured him slightly. A message was sent here for officers to nr et the train and capture him When the train ar rived Anderson, with another negro who was riding with him, saw tbe armed men and made a desperate ef fort to escape but failed. They were tried before Justice Moses Monday morning and Anderson was found guilty of bitting Gapt. Ligon and sent on to the Grand Jury, while Scott was found guilty of stealing a ride and fiaed 10 and cost. Both were returned to jail."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Anderson, colored, struck Capt. <mark>Ligon</mark>, freight conductor, in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Anderson, colored, struck Capt. <mark>Ligon</mark>, freight conductor, in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2233.15, 1194.18, 2400.18, 1284.82], "bbox_id": "3b6419eb5c", "file": "AppomattoxNewspapers_1943-1947a_0041.pdf", "page": 1, "text": "Walking some 21 miles without shoes our barefoot boy finished in a blaze of glory, weary of limb and leg perhaps, but hard as rock of foot. Asked for a statement at the end of his amazing trek, the Sgt., whose father is Peter Ligon, of Ap pomattox, Va., commented, Theres nothing like being a member of u mechanized division."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "whose father is Peter <mark>Ligon</mark>, of Ap pomattox, Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "whose father is Peter <mark>Ligon</mark>, of Ap pomattox, Va.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1927.44, 1189.85, 2086.32, 1347.94], "bbox_id": "af9bb2ef70", "file": "AppomattoxNewspapers_1915-1918a_0518.pdf", "page": 1, "text": "W. through Pamplin, is iH at his home is Roanoke Mr. Bennie Austin was d vis itor in Pamplin on Sunday Mr. Ben Rosser, who has been quite ill, is reported to be better. Mr. W. L. Womack, of near Hosmer, was a visitor in town Sunday night. Mr. Henry Booker, of Ligon  Sons, went to Farm yille Frl day for exam ination for w ar ser Ape."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Mr. Henry Booker, of <mark>Ligon</mark>  Sons, went to Farm"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Mr. Henry Booker, of <mark>Ligon</mark>  Sons, went to Farm"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [590.65, 742.57, 747.45, 841.08], "bbox_id": "015f691787", "file": "AppomattoxNewspapers_1918-1922a_0181.pdf", "page": 1, "text": "W Smith, county clerk ................ .. .......... 6C3 CC C W Smith, clerk road board . ............. .. 25 U C W Smith, clerk board supervisors... 80 00 Joel W Flood, com. attorney ................. SCO O H W McKinney, sheriff ................................ 300 00 H vv McKinney, sheriff and jailer.... 14 00 N R Featherston, supt. of schools.... 75 00 W H Ligon, member board super visors 1C meetings ................................... 72 00 g B Anderson same9 meetings .......... 61 80 L E Smith, same9 meetings.................... 54 80 D L Martin, janitor service..................... 12 00"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "75 00 W H <mark>Ligon</mark>, member board super visors"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "75 00 W H <mark>Ligon</mark>, member board super visors"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [760.78, 619.93, 907.23, 648.97], "bbox_id": "0292b910ed", "file": "AppomattoxNewspapers_1918-1922a_0486.pdf", "page": 1, "text": "W. S. LIGON Care Watts Bros. Lvnchburg, Ve."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. S. <mark>LIGON</mark> Care Watts Bros. Lvnchburg, Ve."}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. S. <mark>LIGON</mark> Care Watts Bros. Lvnchburg, Ve."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1766.07, 555.64, 2573.33, 723.19], "bbox_id": "2ba5173b8a", "file": "AppomattoxNewspapers_1962-1965a_0013.pdf", "page": 1, "text": "W. S. Gills Bill Hunter A. R. Harwood, Jr. John Cole Cecil Ligón Mrs. Carrie Gilbert DEVELOPMENT NOTE IF YOU ARE NOT CIVIC MINDED DO NOT READ THIS! This Is The Fifth In A Series Of Articles Concerning Appomatttox County And Its Rural Area Development Program"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "Jr. John Cole Cecil <mark>Ligón</mark> Mrs. Carrie Gilbert DEVELOPMENT"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "Jr. John Cole Cecil <mark>Ligón</mark> Mrs. Carrie Gilbert DEVELOPMENT"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.25, 571.46, 1480.26, 633.76], "bbox_id": "1d5f1215cb", "file": "AppomattoxNewspapers_1962-1965a_0026.pdf", "page": 1, "text": "W. S. Gills Bill Hunter A. R. Harwood, Jr. John Cole Cecil Ligon Mrs. Carrie Gilbert"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. S. Gills Bill Hunter A. R. Harwood, Jr. John Cole Cecil <mark>Ligon</mark> Mrs. Carrie Gilbert"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. S. Gills Bill Hunter A. R. Harwood, Jr. John Cole Cecil <mark>Ligon</mark> Mrs. Carrie Gilbert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1990.29, 735.82, 2141.21, 819.22], "bbox_id": "6d8dbfc0dd", "file": "AppomattoxNewspapers_1908-1909a_0435.pdf", "page": 1, "text": "W. R. BRIGHT WET .T., N. E. FARRAR, HOWARD WILLIAM, F. H. LUKIN. O. E. PETERSON, L. N. LIGON. Members voting against toe adoption of this ordinance None. Approved W. B. RICE, Mayor."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "E. PETERSON, L. N. <mark>LIGON</mark>. Members voting against toe"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "E. PETERSON, L. N. <mark>LIGON</mark>. Members voting against toe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [234.49, 286.88, 566.74, 722.12], "bbox_id": "c35f0b8dff", "file": "AppomattoxNewspapers_1908-1909a_0160.pdf", "page": 1, "text": "W M E S - V L R G I N L A N B W ilson, to d M . H . M arks  com m ittee to m ake th e noihina- tions, w ho rep o tted an d nom inat ed tb s follow ing slate w hich w as unanim ously elected. F or courthouse precinct, H . W. JcK iriney, J . A. B urke, Don loses, C. W . S m ith a n d J . A. Ingham . Cheatw ood precinct, Stephen A. C yrus C hap precinct, C ourtney C. H arvey Pam plin urecinct, T . J . L igon W alkers h u rch precinct, E . p . Sears lockB precict, J . A. G arrett C lover H ill precinct, Jo el W . Flood and G. ,D . G ordon A gee precinct, M onroe L . G a rre tt O ak ville precinct D allas E . W alton and H . E . Sm ith, and Stonew all precinct, C J . H ardig andG . 0 . Thornhill. R esolutions w ere offered and adopted, am ong them being one endorsing th e county adm inistra- t on and its officers, w hich w as offered by E . G. H arvey one en dorsing and com m ending Senator L. Ferguson, and his record in th e Senate of V irginia, offered by N . Ligon one endorsing C laude R . Wood, and his record n th e house, offered by Colonel W. Flood one endorsing Gov ern o r H. F. Byrd and his adm in i stratto n and policies, w hich w as O ffered hv C. W. S m ith,-and to e"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "irginia, offered by N . <mark>Ligon</mark> one endorsing C laude"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "irginia, offered by N . <mark>Ligon</mark> one endorsing C laude"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2380.8, 1664.36, 2539.65, 1718.96], "bbox_id": "7767fce7ad", "file": "AppomattoxNewspapers_1939-1943a_0471.pdf", "page": 1, "text": "W. M. Black, 39 Z. T. Moran, 39 i  J. W. Marsh, 36 0 W. R. Brightwell, 35 .  T. C. Ligón, 24 T T. Inge, 24"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "W. M. Black, 39 Z. T. Moran, 39 i  J. W. Marsh, 36 0 W. R. Brightwell, 35 .  T. C. <mark>Ligón</mark>, 24 T T. Inge, 24"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "W. M. Black, 39 Z. T. Moran, 39 i  J. W. Marsh, 36 0 W. R. Brightwell, 35 .  T. C. <mark>Ligón</mark>, 24 T T. Inge, 24"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1184.41, 885.04, 1638.22, 1000.86], "bbox_id": "ebff976ec1", "file": "AppomattoxNewspapers_1943-1947a_0356.pdf", "page": 1, "text": "W L Ligón paid us a surprise W lthis morning. He is just from the war and that means rtfr Africa, Italy, the Philippines 4iJapan. He is the son of Mr. Ligón, and brother of Har- and Chuck. We are told g a t Harmon recently married a as girl. Try a 1lassifi d Ad GM and Union fail to agree on oposal to. end .strike."}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "W L <mark>Ligón</mark> paid us a surprise"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "W L <mark>Ligón</mark> paid us a surprise"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [804.95, 536.79, 1585.41, 1010.99], "bbox_id": "22ae94220b", "file": "AppomattoxNewspapers_1943-1947a_0343.pdf", "page": 1, "text": "W. L. Farmer. Mrs. Flora Torn ton ed from a trip to Roanoke, sue visited her daughter, Reeves. Mr. and Mrs.-T. C. Ligon and family were Sunday guists. _ ,j?X. M s Kgon5?siste r, Mis. Bridge- forth, .of Kenbridge. Mr. and Mrs. Callahand and daughter, Helen, of Newark, N. J. snent Christmas holidays in the 1 nme of Mr. and Mrs. Clayton Beale. Mr. and Mrs. A. B. Chandler were recent guests in the home of the latters parents, Mr. and Mrs. H. T Terry. Eldridge Fitzgerald has taken a position with the Norfolk and Western Railway. He is located at Durham, N. C. Mr. and Mrs. Albert Baird and son and Mr. and Mrs. N. H. Spen cer and son, of Buckingham were recen, guhsts in the home of Mr. ! and Mrs. F. B. Fitzgerald. Bernard Richardson, of the U. i S. Navy recently visited his par- entfe, Mr. and Mrs. Wiley Rich- ardsoson. V. t. Brigrhtwell was a holiday  guest in, the home of his son, Jack Birightwell, .of Chrjstiansburg. Miss Ruth Swan and S. Brock- well were dinner guests in tin 1 ome of Mr. and I.Trs. R. E. Me i Clenny Tuesday. Mr. and Mrs. Carl Evans, and  Raymond Rosser, of Roanoke were r  iests in the home of Mrs. C. C Rosser during Christmas holidays Rev. J. G. Thompson visited hi? mother, of Halifax County, las week."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs.-T. C. <mark>Ligon</mark> and family were Sunday"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "Mr. and Mrs.-T. C. <mark>Ligon</mark> and family were Sunday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [570.25, 1813.74, 725.68, 1825.05], "bbox_id": "040e133bc7", "file": "AppomattoxNewspapers_1898-1902a_0648.pdf", "page": 1, "text": "W J . Ligon,  Famplin, Va."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W J . <mark>Ligon</mark>,  Famplin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W J . <mark>Ligon</mark>,  Famplin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1278.74, 817.09, 1586.79, 1056.38], "bbox_id": "33b7713ab2", "file": "AppomattoxNewspapers_1898-1902a_0479.pdf", "page": 1, "text": "W hitakers, N. C ., Jan. 29 , 1901 .  Farm ville, Va., Jon. 16 , IS M b . A lex . G b ee n , S M b . J. W . W omack , W hitakers, N. C . j Farm ville, Va. D ear Sir I have been raising pea- S Dear Sir My tobacco, which took thi j nuts for twelve years, and have used  sweepstake premium at the FarmriBs I plaster, lime and other fertilizers, and ! Fair last Fall, was raised with Alt after using ARM OURS G E N E R A L for  MOURS TO BA CC O SLECIALferiilix threo years, bought of you, I unhesi- i and BONE M EA L the land upon which tatingly say that it is the best guano I ! this tobacco was raised bad uo manun ever used. i upon it whatever. There wero moretbu Last year  1900  I grew on four acres j throe hundred samples competing forth one hundred and twenty-five sacks, weigh- j premium, and I consider your rertiUzx j ing 90 pounds each. ! first-class, and expect to use them ei Yours truly,  clusively this season. Yours truly, J . R . E theridge .  E- C. Slum. I The above are copies of two letters received, one each from North Carolina and Virginia. These goods are for sale by the following dealers in your State j FERGUSON  SMITH, West Appomattox, Va. R. G. ROGERTSON, of W. S. Fore  Co., Lynchburg, Va. W. H, LIGON, Pamplin, Va- JEFF. DAVIS, Dillwyn, Va."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "Lynchburg, Va. W. H, <mark>LIGON</mark>, Pamplin, Va- JEFF. DAVIS,"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "Lynchburg, Va. W. H, <mark>LIGON</mark>, Pamplin, Va- JEFF. DAVIS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [287.05, 511.67, 596.96, 609.48], "bbox_id": "221846bed0", "file": "AppomattoxNewspapers_1918-1922a_0356.pdf", "page": 1, "text": "W. H. LigonPer Diem and Mileage to Farmvllle in Interest of Joint Poor House, two T rip s ..,..................................... ............... . . . . . . . . .  16.00 J. H. WalkerCoffin for John Lee.............................................................! 12!50 Jas. W. ParisBoard of Paupers, etc......................................................... 129.05 Jas. W. ParisSy. as Superintendent ......................................................... 60.00 Jas. W. ParisSupplies for Poor House ..................................................... 41.32 W. H. Ligon SonsSupplies............................................................................. 28.04 C. F. JamesMedicines. T. C. LigonConveying Members Board to Poor H ouse... Mrs. J. W. ParisSewing for Inmates.................................... . G. W. WatsonClothes for Inm ates . ........................... . ........... Eugene HamiltonMoving Poor House Effects ......................"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>Per Diem and Mileage to"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>Per Diem and Mileage to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [360.28, 694.6, 520.23, 753.05], "bbox_id": "f5343105f7", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "W. H. Ligon, the true, consistent, regular nominee of Appomattox Democrats desires the support of every citizen who admires conserva tism, backbone and con victims."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, the true, consistent, regular nominee of Appomattox Democrats desires the support of every citizen who admires conserva tism, backbone and con victims."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, the true, consistent, regular nominee of Appomattox Democrats desires the support of every citizen who admires conserva tism, backbone and con victims."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1167.79, 1367.18, 1263.08, 1377.7], "bbox_id": "6ed7a089b2", "file": "AppomattoxNewspapers_1926-1933a_0513.pdf", "page": 1, "text": "W. H. LIGON SON"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark> SON"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark> SON"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2203.27, 1411.75, 2489.15, 1431.11], "bbox_id": "1ee411975e", "file": "AppomattoxNewspapers_1905-1912a_0051.pdf", "page": 1, "text": "W. H. LIGON, President. J. F. CONNALLY. Vic FraslAtuL L. M. WARREN, Cf shier."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, President. J. F. CONNALLY. Vic FraslAtuL L. M. WARREN, Cf shier."}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, President. J. F. CONNALLY. Vic FraslAtuL L. M. WARREN, Cf shier."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.46, 1236.02, 1589.97, 1244.52], "bbox_id": "afcce47489", "file": "AppomattoxNewspapers_1905-1912a_0207.pdf", "page": 1, "text": "W. H. LIGON, Pres. J. F. CONNALLV, V.-Pres. L. W. HOFFMAN. Cashier"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONNALLV, V.-Pres. L. W. HOFFMAN. Cashier"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONNALLV, V.-Pres. L. W. HOFFMAN. Cashier"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [957.64, 818.6, 1249.66, 827.1], "bbox_id": "2a6d41dfd4", "file": "AppomattoxNewspapers_1905-1912a_0127.pdf", "page": 1, "text": "W. H. LIGON, Pres. J. F. CONN ALLY. V.-Prea. L. W. HOFFMAN, Cuhier"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALLY. V.-Prea. L. W. HOFFMAN, Cuhier"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALLY. V.-Prea. L. W. HOFFMAN, Cuhier"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [977.06, 1273.34, 1268.96, 1281.38], "bbox_id": "ffd3069c86", "file": "AppomattoxNewspapers_1905-1912a_0108.pdf", "page": 1, "text": "W. H. LIGON, Pres. J. F. CONN ALLY, V.-Prea. L, w . HOFFMAN, CuU"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALLY, V.-Prea. L, w . HOFFMAN, CuU"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALLY, V.-Prea. L, w . HOFFMAN, CuU"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [974.42, 1273.59, 1271.78, 1296.79], "bbox_id": "ed13cd4412", "file": "AppomattoxNewspapers_1905-1912a_0100.pdf", "page": 1, "text": "W. H. LIGON, Pres. J. F. CONN ALL Y .-Pres. L. W. HOFFMAN, Cash! g g g j"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALL Y .-Pres. L. W. HOFFMAN, Cash! g g g j"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CONN ALL Y .-Pres. L. W. HOFFMAN, Cash! g g g j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [990.27, 1273.83, 1260.63, 1281.83], "bbox_id": "855bc2c85b", "file": "AppomattoxNewspapers_1905-1912a_0104.pdf", "page": 1, "text": "W. H. LIGON, Pres. J. F. CON NALLY, V.-Pree. L. W. HOFFMAN,"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CON NALLY, V.-Pree. L. W. HOFFMAN,"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J. F. CON NALLY, V.-Pree. L. W. HOFFMAN,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [301.13, 1589.36, 774.3, 1651.26], "bbox_id": "77c3152aac", "file": "AppomattoxNewspapers_1905-1912a_0121.pdf", "page": 1, "text": "W. H. LIGON, Pres. J . F. CONNALLY, V.-Pres. L. W. HOFFMAN, Caahlar CASTOR IA For Infants and Children. The Kind You Have Always Bought"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J . F. CONNALLY, V.-Pres. L. W. HOFFMAN, Caahlar CASTOR IA For Infants and Children. The Kind You Have Always Bought"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Pres. J . F. CONNALLY, V.-Pres. L. W. HOFFMAN, Caahlar CASTOR IA For Infants and Children. The Kind You Have Always Bought"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1308.95, 1328.19, 1624.18, 1443.18], "bbox_id": "bf8ea29e8f", "file": "AppomattoxNewspapers_1905-1912a_0147.pdf", "page": 1, "text": "W. H. LIGON, Prea. J. P. CONNALLY, V.-Pre. L. W. HOFFMAN, Oahlor Liberal Treatment and a Square Deal V -  Cant Afford It"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Prea. J. P. CONNALLY, V.-Pre. L. W. HOFFMAN, Oahlor Liberal Treatment and a Square Deal V -  Cant Afford It"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>, Prea. J. P. CONNALLY, V.-Pre. L. W. HOFFMAN, Oahlor Liberal Treatment and a Square Deal V -  Cant Afford It"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2171.29, 1117.22, 2471.37, 1128.1], "bbox_id": "0f0786f854", "file": "AppomattoxNewspapers_1905-1912a_0063.pdf", "page": 1, "text": "W. H. LIGON. Prca J. P. CCNN a I tv , V.-Fr. t. M. HOFFMAN. Caiblrr."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>. Prca J. P. CCNN a I tv , V.-Fr. t. M. HOFFMAN. Caiblrr."}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H. <mark>LIGON</mark>. Prca J. P. CCNN a I tv , V.-Fr. t. M. HOFFMAN. Caiblrr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [125.74, 785.35, 255.72, 796.2], "bbox_id": "a481093354", "file": "AppomattoxNewspapers_1898-1902a_0513.pdf", "page": 1, "text": "W. H, LIGON, Pamplin, Va."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H, <mark>LIGON</mark>, Pamplin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H, <mark>LIGON</mark>, Pamplin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1356.29, 1025.08, 1492.79, 1035.69], "bbox_id": "c53094f38b", "file": "AppomattoxNewspapers_1898-1902a_0463.pdf", "page": 1, "text": "W. H, LIGON, Pamplin, Va."}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W. H, <mark>LIGON</mark>, Pamplin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W. H, <mark>LIGON</mark>, Pamplin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [566.4, 967.03, 728.0, 1027.56], "bbox_id": "06cf4471a6", "file": "AppomattoxNewspapers_1902-1905a_0121.pdf", "page": 1, "text": "W. H. Ligón offered the following resolution One of the judges of election, who shall be designated by the other two judges shall uro- pound to every voter who offer- this prim ary the following YOU A PBMOOBAT ASD W1L ALL THE NOMINEES OF THIS TION V"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "W. H. <mark>Ligón</mark> offered the following resolution"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "W. H. <mark>Ligón</mark> offered the following resolution"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [522.92, 963.48, 684.2, 1167.93], "bbox_id": "bd4aef5c16", "file": "AppomattoxNewspapers_1892-1898a_0453.pdf", "page": 1, "text": "W. H. LIGON. Mr. W. H. Ligon, our nominee for the House of Delegates followed Mr. Flood in a few well-chosen words. Mr. Ligon, like the busiuess man he íb , told the people that if they should honor him with their confidence, the interests of the old Dominion and grand old Appomat tox should not suffer. While Mr. Ligon is not considered a fluant speaker, he expresses himself well aud his earnestness at once attracts the hearer. He will make us an able representative, reflecting credit opon his party and honor upon him self. Ligon is a winner by odds."}, "highlight": {"text": {"matched_tokens": ["LIGON", "Ligon"], "snippet": "W. H. <mark>LIGON</mark>. Mr. W. H. <mark>Ligon</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON", "Ligon"], "snippet": "W. H. <mark>LIGON</mark>. Mr. W. H. <mark>Ligon</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [783.34, 1316.91, 939.45, 1328.53], "bbox_id": "2aadde9e5a", "file": "AppomattoxNewspapers_1898-1902a_0642.pdf", "page": 1, "text": "W. H. Ligon, - Pamplin, Va."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, - Pamplin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, - Pamplin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [719.99, 1701.9, 1024.56, 1729.16], "bbox_id": "ec17983309", "file": "AppomattoxNewspapers_1898-1902a_0676.pdf", "page": 1, "text": "W. H. Ligon, - Pam plin, Va.  Cor. 9th and Commerce Sts.,"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, - Pam plin, Va.  Cor. 9th and Commerce Sts.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>, - Pam plin, Va.  Cor. 9th and Commerce Sts.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [740.7, 1542.18, 896.96, 1554.2], "bbox_id": "cf8f47e758", "file": "AppomattoxNewspapers_1898-1902a_0684.pdf", "page": 1, "text": "W. H. Ligon,  P am plin, Va."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>,  P am plin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark>,  P am plin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [234.25, 713.02, 388.09, 723.09], "bbox_id": "fdf01d678f", "file": "AppomattoxNewspapers_1892-1898a_0240.pdf", "page": 1, "text": "W. H. Ligon ................................ 511"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark> ................................ 511"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. H. <mark>Ligon</mark> ................................ 511"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.09, 412.91, 2064.01, 465.65], "bbox_id": "5721a7ea0d", "file": "AppomattoxNewspapers_1971-1973a_0573.pdf", "page": 1, "text": "W. Dupey Ligon is shown above with his wife, the former Mary Brightwell of Pamplin. They have been married for 41 years and are the parents of two sons. Ligon will retire on December 31,1972, after having serv ed the Bryant division of Westinghouse Electric for 43 years."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. Dupey <mark>Ligon</mark> is shown above with"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. Dupey <mark>Ligon</mark> is shown above with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.93, 411.4, 1487.83, 471.8], "bbox_id": "0d3c16e398", "file": "AppomattoxNewspapers_1955-1957a_0533.pdf", "page": 1, "text": "w. D. Logon and and Sammy, of Vteks- Sited relatives here Mr. Ligón and sons to their homes. Mrs.  ed for a longer visit."}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "w. D. Logon and and Sammy, of Vteks- Sited relatives here Mr. <mark>Ligón</mark> and sons to their homes. Mrs.  ed for a longer visit."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "w. D. Logon and and Sammy, of Vteks- Sited relatives here Mr. <mark>Ligón</mark> and sons to their homes. Mrs.  ed for a longer visit."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1787.74, 464.06, 2125.4, 594.31], "bbox_id": "42b52e7224", "file": "AppomattoxNewspapers_1949-1952a_0384.pdf", "page": 1, "text": "W. D. Ligon has been transferred from New York to California. He and his family are visiting in the from a visit with friends and rela- j home of Mr. and Mrs. T. J. Ligon tives at Harrisonburg and Richmond.  and Mr. and Mrs. W. R. Brightwell enrouto to California. Mr. and Mrs. Elbert Davis are j visiting relatives at Roanoke end, Marion. Mr. and Mrs. S. W. B rockwcll, of Newport News were the week-end guests of Mr. and Mrs. R. E. Mc Clenny.  The Rev."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W. D. <mark>Ligon</mark> has been transferred from"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W. D. <mark>Ligon</mark> has been transferred from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.0, 764.67, 1534.67, 794.87], "bbox_id": "eafca38b74", "file": "AppomattoxNewspapers_1952-1954a_0578.pdf", "page": 1, "text": "W. B. Allen and from South Boston, nd Mrs. Cecil Ligón"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "W. B. Allen and from South Boston, nd Mrs. Cecil <mark>Ligón</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "W. B. Allen and from South Boston, nd Mrs. Cecil <mark>Ligón</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [797.3, 1615.65, 962.93, 1684.4], "bbox_id": "834a420d96", "file": "AppomattoxNewspapers_1952-1954a_0348.pdf", "page": 1, "text": "W AN TED  Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J . Ligon, Pamplin, Va. 8-13-3tp"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W AN TED  Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J . <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W AN TED  Tenant to operate farm three miles from Pamplin ,on hard surfaced road 6 acre dark tobacco. Modern machinery. Write or see T. J . <mark>Ligon</mark>, Pamplin, Va. 8-13-3tp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.29, 369.4, 2394.08, 1454.83], "bbox_id": "c3f61a1dfb", "file": "AppomattoxNewspapers_1915-1918a_0216.pdf", "page": 1, "text": "W alter W. Scott, Appomat tox, 27879, P aige 25. W . L. Brow n, Appom attox, 27871, Ford 20. T. E. T urner, A ppom attox, 26563, Ford 20. A. B. T urner, Appomattox, 26983, Ford 20. E. T. Price, Appom attox, 27083, Ford 20. O. W. Hanoook, Appomattox, 25026, Ford 20. Appom attox Hdw. Co., A p pom attox, 25247, Ford 20. J. A. Burke, A ppom attox, 26Ò27, Ford 20. A. H. Clement,- Appom attox, 18860, Hudson 30. H enrietta E. Soott, Appom at tox, 18872, jN ational 30. C. W . Jones, Appom attox, 19074, O verland 35. 0 . A. Hancook, Appom attox, 20898, Ford 20. W. H. Turns, Appom attox, 21085, Ford 20. Jas. B. A bbitt, Appomattox, 21151, M axwell 25. W. W. Lee, Appomattox, 15580, Ford 20. 0 . A. Hancock, Appom attox, 18508, Cadillac 40, B. G. Anderson, Appom attox, 10560, Ford 10. Mrs J . R. Atwood, Appom at tox, 10958, Chalm ers 48. H. D. Flood, Appom attox, 6044, Hudson 60. B. F. Oden, Appomattox, 6045, Chalm ers 30. J . M- K notts, Appom attox, 9162, Ford 20. D. N. Tw ym an, Appomattox, 11461, O verland 30. J. R Horsley, Appomattox, 11573, Metz 20. Appomattox Hdw. Co., A p pom attox, 11870, Ford 20. H. W , M cKinney, Appom at tox, 12716, Ford 20. . S. L. Ferguson, Appomattox 1204, Overland 85.  M. L. K arm an, Appom attox, 23856, Ford 20. E. F. Pittenger, Pam plin, 4259, Ford 20. J . A. Y oung, Pam plin 4640, Tord 20. E. E. W alker, M. D , Pam  plin, 16714, Ford 20. J P. Maloney, Pam plin, 15620, Ford 20. L. N. Ligón, Pam plin, 15573, Overland 30. O. E. Peterson, Pam plin, 7029, Ford 20. L. W. Hoffman, Pamplin, 23558, O verland 86. E. F. Williams, Pam plin, 19251, Ford 20. Tom Baker, Pam plin, 17640, Ford 20. R. L. Franklin, - Pam plin, 17287, Dodge 25. J. D. C arter, Pam plin, 26491, Ford 20. T. C. Young, Pam plin, 27684, Ford. 20. W . D Rodgers, Pam plin, 23550, Ford 20. F. H. Lukin, Pam plin, 7423, Ford 20. D. A. C hristian, J r., Vera, 16643, Ford 20. J. K. Megginson, V era, 25072, Ford 20. C. Inge, S p o u t S p r i n g , 30303, Ford 20. W . D. Robertson, 8 p o u t Spring, 18491, Ford 20. C. Inge, Spout 8pring, 17404, Overland 30. 8. W . Alvis, Spout Spring 26004, Buick 30."}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "Ford 20. L. N. <mark>Ligón</mark>, Pam plin, 15573, Overland"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "Ford 20. L. N. <mark>Ligón</mark>, Pam plin, 15573, Overland"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1343.76, 763.88, 1583.46, 839.91], "bbox_id": "cc22f75063", "file": "AppomattoxNewspapers_1952-1954a_0030.pdf", "page": 1, "text": "W , W . W i l l i a m s , Merchant Dr. F. H. Lukin, Dentist Hunter R. Baldwin, Barb Rtngar. H. T. Terry, Merchant fef t r- i  , , erts 5  Ligon, Merchant BpapWwBgar and sugar T .J. Ligon, Merchant ce mad of one"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "r- i  , , erts 5  <mark>Ligon</mark>, Merchant BpapWwBgar and sugar"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "r- i  , , erts 5  <mark>Ligon</mark>, Merchant BpapWwBgar and sugar"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2258.08, 1162.17, 2545.32, 1212.58], "bbox_id": "2779b47039", "file": "AppomattoxNewspapers_1943-1947a_0036.pdf", "page": 1, "text": "W . H. Ligon s Sons Pamplin, Va."}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "W . H. <mark>Ligon</mark> s Sons Pamplin, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "W . H. <mark>Ligon</mark> s Sons Pamplin, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2146.82, 1118.28, 2445.76, 1127.15], "bbox_id": "591e53e384", "file": "AppomattoxNewspapers_1905-1912a_0075.pdf", "page": 1, "text": "W . H. LIGON , Pre. J. F. CONNALIY, V.-Pr. L. M. HOFFMAN. Caabtor"}, "highlight": {"text": {"matched_tokens": ["LIGON"], "snippet": "W . H. <mark>LIGON</mark> , Pre. J. F. CONNALIY, V.-Pr. L. M. HOFFMAN. Caabtor"}}, "highlights": [{"field": "text", "matched_tokens": ["LIGON"], "snippet": "W . H. <mark>LIGON</mark> , Pre. J. F. CONNALIY, V.-Pr. L. M. HOFFMAN. Caabtor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1432.8, 776.41, 1753.02, 794.96], "bbox_id": "9ddefcd08a", "file": "AppomattoxNewspapers_1922-1923a_0616.pdf", "page": 1, "text": "W . B. B l n f o .- a , D r C . S . Morton, J F Connaly, R. L, Franklin, L, N. Ligón, Dr F. H, Lukin, W. C .Franklin, G. W. Watstn, W, P. Venable, ____"}, "highlight": {"text": {"matched_tokens": ["Ligón"], "snippet": "L, Franklin, L, N. <mark>Ligón</mark>, Dr F. H, Lukin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligón"], "snippet": "L, Franklin, L, N. <mark>Ligón</mark>, Dr F. H, Lukin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.0, 1188.15, 1850.14, 1325.64], "bbox_id": "2a52ef663a", "file": "AppomattoxNewspapers_1908-1909a_0209.pdf", "page": 1, "text": "votes as she captivate, nrtrts well, of Farmville State Teach Monday night numbers era College Margaret Ligon of young people were enter- of Virginia Intermonf College mined at Silverwood, the Bristol Miss Virginia Thorn home of Mrs.Mac iver Among ton, of William and Mary Ex the guwts wero Vaughan Hort- ension School, Richmond ley, Herman Taylor, Malcolm Iamlet Franklin, of Richmont GSanaway, Miss Sally LeGrande Aedical College Paul Hughe! ofLynchburg, Mr Norman Tay A Tri-State College, Frank Lu lor of Norfolk, B Jennings,-of in, of Raleigh, N. C., Miss chmond College Delightful Iiida Ligon, of Rustburg Misi music on the violin was fprn- T.izabeth Duling, of Chester ied by Mr Ganaway and nd Prof. Maripn Duling, o"}, "highlight": {"text": {"matched_tokens": ["Ligon"], "snippet": "numbers era College Margaret <mark>Ligon</mark> of young people were"}}, "highlights": [{"field": "text", "matched_tokens": ["Ligon"], "snippet": "numbers era College Margaret <mark>Ligon</mark> of young people were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
