{"document": {"bbox": [1670.1, 1103.5, 1828.6, 1364.09], "bbox_id": "46932e1af9", "file": "AppomattoxNewspapers_1918-1922a_0048.pdf", "page": 1, "text": "Saturday was a gala day for Appomattox. Although the weather w a s threatening a large crowd came to town to help put oyer the Victory-Loan. Hon. H. D. Flood and Lieut. Luther Throckmorton, an over sea soldier, spoke in the Court house. A brass band from Camp Lee made music and the Victory Loaa went whizzing over the top. It is estimated by the banks that at least 20,- 000 more than our quota has been subscribed. Appomattox is t h e proud possessor of another flag and is again on the map in Royal Blue figures as going over the top. The Womens Committee pledged our quota long ago and they fully redeemed the pledge."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "D. Flood and Lieut. <mark>Luther</mark> <mark>Throckmorton</mark>, an over sea soldier,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "D. Flood and Lieut. <mark>Luther</mark> <mark>Throckmorton</mark>, an over sea soldier,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.09, 528.07, 1692.59, 564.47], "bbox_id": "55d09861a8", "file": "AppomattoxNewspapers_1939-1943a_0414.pdf", "page": 1, "text": "Mrs. Luther Throckmorton, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "Mrs. <mark>Luther</mark> <mark>Throckmorton</mark>, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "Mrs. <mark>Luther</mark> <mark>Throckmorton</mark>, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1562.38, 220.68, 1723.83, 995.21], "bbox_id": "f2ddd26b7b", "file": "AppomattoxNewspapers_1908-1909a_0240.pdf", "page": 1, "text": "Mr. Holcomb Caldwell re turned to his school duties at Ferrum yesterday. Captain and Mrs. Hunter Gallier, of Crewe, Va., were visitors here to the Fair. Mrs. L. A. Tweedy, who has been sick for somo time i is much improved. Wm. Wingfield and wife, re burned to Richmond today af- er a visit to his father, C. A. Wingfield. Mrs. Agnes Bobbitt, of Hope- veil, is on. a visit to her father, 3 . A. Wingfield. Mrs. J. F Harvey, who re cently underwent an opéra- ion at the Virginia Baptist hos pital in Lynchburg, is reported o be improviùg. Mrs. Lewis Doss, Mrs..Har ry Johnson, and Mrs. P. JJ Sheppards of Buckingham, visited in Roxboro, N. C. this week. Messrs. Charles James, Al fred Harwood, Jr., land Henry ?ack left this week for Blacks- urg, where they Wiir begin heir studies at V. P. I. Mr. H. F. Doelaman has re- urned to his home in Balti more, Md., after being the rucst of Mr. and Mrs. H. B. .Marshall recently. Mr. Sidney Tinnell, Natural bridge, spent the day Sunday vith his wife and children in he home of Mr. D. B. John- on, near Stonewall. ...... Mrs. T. C. Roberts and son, Varren, of ShipmuhifiF. and Ærs. Clarke W. Roberts, of Cul peper, were Sunday guests of. 1rs. Lottie Bledsoe here.. Miss Virgimaee Thompson eft this wek for Randolph 4 aeon College, Lynchburg, vhere she will begin hër stud- es as a sophmore. Miss Emtnfa Gregory, who las been spending some time n Roanoke as the guest of Miss Mildred Fitzgerald has re- urned home. Mrs. Alma Beatty leaves Saturday for her home in Wa- jo, Texas, after spending the jummer in Appomattox, visit ng relatives, and friends. Mrs. Luther Throckmorton and daughter, Miss Nancy, who have been spending the cummer in Appomattox, have eturned to New Haven, Conn"}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "relatives, and friends. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "relatives, and friends. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.41, 239.15, 1734.6, 1656.53], "bbox_id": "7f2684fa5f", "file": "AppomattoxNewspapers_1926-1933a_0240.pdf", "page": 1, "text": "Mr. Holcomb Caldwell re turned to his school duties at Ferrum yesterday. Captain and Mrs. Hunter Gallier, of Crewe, Va., were visitors here to the Fair. Mrs. L. A. Tweedy, who has been sick for some time is much improved. Wm. Wingfield and wife re turned to Richmond today af ter a visit to his father, C. A. Wingfield. Mrs. Agnes Bobbitt, of Hope- veil, is on. a visit to her father, 0. A. Wingfield. Mrs. J. F. Harvey, who re- ently underwent an opera- ion at the Virginia Baptist hos pital in Lynchburg, is reported o be improving. Mrs. Lewis Doss, Mrs. Har ry Johnson, and Mrs. P. J. Sheppards of Buckingham, visited in Roxboro, N. C. this week. Messrs. Charles James, Ai red Harwood, Jr., land Henry Pack left this week for Blacks- jurg, where they will begin heir studies at V. P. I. Mr. H. F. Doelaman has re- urned to his home in Balti more, Md., after being the uest of Mr. and Mrs. H. B. Marshall recently. Mr. Sidney iTinnell, Natural 3ridge, spent the day Sunday vith his wife and children in he home of Mr. D. B. John- on, near Stonewall. Mrs. T. C. Roberts and son, Varren, of Shipman, Mr. and Mrs. Clarke W. Roberts, of Cul- eper, were Sunday guests of Irs. Lottie Bledsoe here. Miss Virginia Lee Thompson eft this week for Randolph Macon College, Lynchburg, vhere she will begin her etud es as a sophmore. Miss Emmfa Gregory, who has been spending some time n Roanoke as the guest of Miss Mildred Fitzgerald has re mitted home. Mrs. Alma Beatty leaves Saturday for her home in Wa- zo, Texas, after spending the summer in Appomattox, visit ing relatives and friends. Mrs. Luther Throckmorton and daughter, Miss Nancy, who have been Spending the summer in Appomattox, have eturned to New Haven, Conn. Mr. and Mrs. Robert Malon- ijr and children, of Madison- ille, and Miss Frances Ander- ..on, of Lynchburg, were recent quests in the home of Mr. ,B. 1. Anderson. Miss Mary Trent, who has jeen on a visit to her sister, Mrs. Elizabeth Fox, at Drew- jyville, has taken up her dut- es as teacher in the Hixburg school. Mr. and Mrs. Russell Gim- jert and son are occupying the jummer residence of C. A. Hancock. Mr. Gimbert has accepted a position as manager of the Battery Factory. Mrs. Gatie Woolridge Eppes and small daughter, Frances Fletcher, of Roanoke, were guests last week at the home of Mrs. J. H. Stanley and Mrs. H. M. Burge. Mrs. W. F. Collins and Mrs. Paul Harris, of East Radford, Mrs. Ruth Spelman and Miss Mary Kemp, of Miami, Fla., spent a few .days this week vth .Mrs, J. I. Morris and Mrs. R. C. Moore. ,R. W. Wilkins, Agricultural instructor, will begin a series of weekly discussions dealing with local farm problems, at Pettys Fork school house on vVednesday, Sept. 24, at 745 p. M. Mr. Grubb, County Agent of Campbell County, will talk on Lespedeza. Farm- ors in that locality are urged to come out. Mrs. M. C. Caldwell and son, Hubert and Miss Grace Cald well motored to Roanoke for he weekend to visit friends and relatives, they were accom panied home by the laters mother, Mrs. R. E. Caldwell, Sr., who has been spending jome time with her daughters, Mrs. C. O. McCray and Mrs. W D. Marshall.  Mrs. Ellen Furbush also came with them to her daughters Mrs. H. S. Jones, of Spout Spring, where ihe will make her home."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "relatives and friends. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "relatives and friends. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1684.09, 357.83, 1845.48, 934.73], "bbox_id": "a737445953", "file": "AppomattoxNewspapers_1918-1922a_0046.pdf", "page": 1, "text": "Mr. Daniel Browning and family, of Richmond, were visiting Mr. R. H. Browning at the Old Court House last week. Mrs. Norman Cheatham and daughter, Miss Alice, of Lynch burg, have returned home after spending several days with Mr. and Mrs. J. H. Cheatham at the New Appomattox. Quite a crowd of our soldier boyawho have seen service in the Rainbow Division are ex pected home this evening at 437. A warm greeting awaits our heroes. Lieut. Luther Throckmorton came home last week with his discharge and saw his baby for the first time. He met Oaptian J ack Peters here also who ex changed greetings and said they last saw each other in France. Both of the gentlemen look good. Mr. John P. Rector had a se rious fire at his place of busi ness Monday night at Spout Spring The fire started in the store part of the building about 9 oclock p. m., the other part of the building being occupied by Mr. Holmesy Inge, as a res idence. Young Mr. Rector has only been in business a few months and is said to have been doing a good business, and many expressions of regret are heard of his misfortune. He was insured for 7,000 on stock and building, which will not cover his loss. Mr. Inge lost his household effects,with out insurance. Mr. Rector will rebuild and start business again."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "awaits our heroes. Lieut. <mark>Luther</mark> <mark>Throckmorton</mark> came home last week"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "awaits our heroes. Lieut. <mark>Luther</mark> <mark>Throckmorton</mark> came home last week"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.15, 602.59, 1603.92, 1045.89], "bbox_id": "49b3b51155", "file": "AppomattoxNewspapers_1908-1909a_0256.pdf", "page": 1, "text": "L. B. Pitman, of Riqh- nd is visiting at the home of F father, Mr. W. P Gills. rMrs. Redding-and soiuf háve - sen on a visit to her relatives P1 McClellansville, N- ,C. Luther Throckmorton and daughter, Miss Nancy, are l plaiting relatives here. f Rev. A. F. Barker, Of Men- sriota, was a recent guest of p iss Emma Gregory. Mr. Donald GSrson, of Pros- Dect, was a recent viutor to jss Cqieen Coleman, ---- - Í Mr. Lawrence Walker, of Lynchburg, is a guest of Mr. alvin Coleman.  Miss Mildred McDéarmón, he University summer school,, ppent the week-end at home. ? Miss Loveila Buchannan re cently underwent an opera ron at Memorial hospital, f Misses Emily - Harvey and erta Smith have retained rom a visit to Obfin, Ohio.  . Mrs. Eugene Walton ,of Bent Creek is visiting at the pome of Mr. L. E. Smith, Miss BesBie IZuhmerinan has Returned from a visit to Iiv- fngston, Ala. Miss Mattie, McCain is yisitr ng her sistei, Mrs. C.  F ames."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "P1 McClellansville, N- ,C. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "P1 McClellansville, N- ,C. <mark>Luther</mark> <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1431.57, 662.58, 1606.69, 1165.6], "bbox_id": "34c4641b47", "file": "AppomattoxNewspapers_1926-1933a_0256.pdf", "page": 1, "text": "k Mrs. Redding ,and sons have Ibeen on a visit to her relatives in McClellansville, N- C. Mrs. Luther Throckmorton apd daughter, Miss Nancy, are visiting relatives here. ! ev A. F. Barker, of Men- dota, was a recent guest of Miss Emma Gregory. Mr. Donald Carson, of Pros- pect, was a recent visitor to FMiss Coleen Coleman. I Mr. Lawrence Walker, of ILynchburg, is a guest of Mr. ICalvin Coleman.  Miss Mildred McDearmon, fthe University summer school, spent the week-end at home. J Miss Lovella Buchannan re- cer.tly underwent an opera- Iton at .Memorial hospital. I Misses Emily Harvey and lyerta Smith have returned from a visit to Oblin, Ohio. I Mrs. Eugene Walton ,of IBent Creek is visiting at the! home of Mr. L. E. Smith. , Miss Bessie Zimmerman has returned from a visit to Liv ingston, Ala. Miss Mattie McCain is visit ing her sister, Mrs. C. i F. James. I Mr. and Mrs. L. V. Allen and family, of Farmville, are visit- png Mrs. Allens parents, Mr. land Mrs. Witt Coleman. Mr. and Mrs. Harry Lawson have been on a visit to the Iformers mother, .Mrs. M. L. awsonw"}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "McClellansville, N- C. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> apd daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "McClellansville, N- C. Mrs. <mark>Luther</mark> <mark>Throckmorton</mark> apd daughter, Miss Nancy,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.35, 481.03, 1720.9, 826.23], "bbox_id": "a63f6f7057", "file": "AppomattoxNewspapers_1974-1975a_0007.pdf", "page": 1, "text": "Mrs. Ola A. Thorkmorton if  I -  Mrs. Ola Abbitt Throckmor ton, formerly, of Appomattox, died Monday in Bradenton, Florida. She was the widow of Luther Wright Throckmorton. Born in Appomattox, she was a daughter of the late Aurelius William Abbitt and the late Nancy Jane Tibbs. She was a graduate of State Normal School now Longwood College and taught in the Richmond City Schools. She is survived by a daughter, Mrs. Nan Thorck- morton Browning of Bradenton, Florida a sister Elanor Abbitt Scott of Appomattox two granddaughters, and a great grandson. Graveside services will be conducted at 11 a. m. Thursday in Liberty Cemetery, Appomat tox. The family suggests that those wishing to make contri butions consider their favorite charity.   if Robinson Funeral Home of Appomattox is in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "was the widow of <mark>Luther</mark> Wright <mark>Throckmorton</mark>. Born in Appomattox, she"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "was the widow of <mark>Luther</mark> Wright <mark>Throckmorton</mark>. Born in Appomattox, she"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [492.96, 1205.71, 602.18, 1215.21], "bbox_id": "e88031f62d", "file": "AppomattoxNewspapers_1971-1973a_0632.pdf", "page": 1, "text": "Luther W. Throckmorton"}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "<mark>Luther</mark> W. <mark>Throckmorton</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "<mark>Luther</mark> W. <mark>Throckmorton</mark>"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [474.26, 1227.31, 617.91, 1683.43], "bbox_id": "800370dc26", "file": "AppomattoxNewspapers_1971-1973a_0632.pdf", "page": 1, "text": "Florida - Mrs. Jerry A. Burke and Mrs. Abbitt Scott have received word that their brother-in-law, Luther Wright Throckmorton, 85, died in Bradenton, Florida, on Mon day, February 5. A native of Richmond he was the son of the late Charles W. Thorckmorton and Mary Anne Wright Throckmorton. He was educated in Richmond Public Schools, University of Rich mond, United States Naval Academy and University of Virginia Law School. He was a lieutenant in the heavy artillery in World War I and served in France for the duration of the war. For a number of years he was an attorney with the Bureau of Immigration and Nationaliza tion in New York City. He is survived by his wife, the former Ola Lee Abbitt, a daughter, Mrs. Thomas A. Browning, of B r a d e n t o n , Florida, two granddaughters, a great grandson a sister. Miss Lucy T. Throckmorton and a brother, Charles W. Throck morton, of Richmond a sister, Mrs. Lewis Taylor of Mech- anicsville, Virginia two nieces and a nephew. A graveside service will be  conducted on Thursday, eleven a.m., February 8, at Liberty  Baptist Cemetery by the Rev. Morey Peoples, Vicar of St. Annes Episcopal Church."}, "highlight": {"text": {"matched_tokens": ["Luther", "Throckmorton"], "snippet": "word that their brother-in-law, <mark>Luther</mark> Wright <mark>Throckmorton</mark>, 85, died in Bradenton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Luther", "Throckmorton"], "snippet": "word that their brother-in-law, <mark>Luther</mark> Wright <mark>Throckmorton</mark>, 85, died in Bradenton,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1041.58, 992.47, 1211.83, 1236.17], "bbox_id": "2cc6b230c2", "file": "AppomattoxNewspapers_1933-1936a_0518.pdf", "page": 1, "text": "To- Esther J. Smith, Etta Har ris and W .E. HarrisVI rs. Mar garet Brittian and Leslie Brittilan, her husband, Mrs. Grover C. Able, and Grover C. Able, T. W. Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie ,Gefnotte, J. S. . Lythgie and Sarah Lythgoe, W . J. Lythgoe and Lorena T. Lythgoe, Mrs. Vera Wall, James N.Lythgoe and Virginia Lythgoe, Russell Lyth goe, and Mrs. Belle Lythgoe, Lill ian Linden and Max F. Linden, Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheean and William Sheean, Clarence Lythgoe, Edward Lytthgoe and Vivian Lythgoe, Ray mond L. Lythgoe and Nora Lyth goe, D. E .. Lythgoe tend Mary Lythgoe, Vemard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank lin, Mrs. Ethel Harvey and Lucius Harvey, Evelyn Bayne, Dora Boltz and Myron E . Boltz, Berta A. Boltz, Mrs. Ellen R . Enrought and"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C. Able, T. W. <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C. Able, T. W. <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [915.31, 1469.26, 1085.41, 1809.46], "bbox_id": "3d78eaacb4", "file": "AppomattoxNewspapers_1933-1936a_0533.pdf", "page": 1, "text": "Order of Publication Esther J. Smith vs Etta Harris and Others Appomattox, Va., August 3rd 1936. To- Esther J . Smith, Etta Har ris and W.E.Harris Mrs. Mar garet Brittian and Leslie Brittiian, her husband, Mrs,. Grover C. Able, and Grover C . Able, T . W , Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie Genatte, J. S. Lythgie end Sarah Lythgoe, W . J. Lythgoe and Lorena T . Lythgoe Mrs. Vera Wall, James N . Lythgoe and Virginia Lythgoe, Russell Lyth- goe, and Mrs. Belle Lythgoe, Lill tan Linden and Max F . Linden Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheeen and William Sheean, Clarence Lythgoe, Edward Lytthgoe and Vivian Lythgoe, Ray mond L. Lythgoe and Nora Lyth goe, D. E.. Lythgoe and Mary Lythgoe, Vernard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank lin, Mrs. Ethel Harvey and Lucius Harvey, Evelyn Bayne, Dora Boltz and Myron E . Boltz, Berta A Boltz, Mrs. Ellen R. Enrought and William H. Enrought, Mrs. Mary E . Johnson and Robert W , John son,, Mary Boltz, M rs. Miriam Rhodes and Hugh C. Rhodes, Hilda E . Grant and Robert R . Granft,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C . Able, T . W , <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C . Able, T . W , <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.61, 457.04, 1180.21, 692.39], "bbox_id": "608a6942d7", "file": "AppomattoxNewspapers_1933-1936a_0528.pdf", "page": 1, "text": "Etta Harris and Others Appomattox, Va., August 3rd, 1936. To- Esther J . Smith, Etta Har ris and W.E.Harris .Mrs. Mar garet Brittian and Leslie Brittilan, her husband, Mrs. Grover C. Able, and Grover C. Able, T . W Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie Gcpnotte, J. S. Lythgie and Sarah Lythgoe, W .J. Lythgoe and Lorena T . Lythgoe, Mrs Vera Wall, James N. Lythgoe and Virginia Lythgoe, Russell Lyth goe, and Mrs. Belle Lythgoe, Lill ian Linden and Max F . Linden, Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheean and William Sheean, Clarence Lythgoe, Edward I.ytthgoi and Vivian Lythgoe, Ray mond L Lythgoe and Nori Lyth goe, D  E. Lythgoe and Miary Lythgoe, Vernard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank-"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
