{"document": {"bbox": [2372.6, 226.43, 2516.34, 957.37], "bbox_id": "27db21583e", "file": "AppomattoxNewspapers_1962-1965a_0088.pdf", "page": 1, "text": "with a Bill pf Complaint in a Chancery Suit in the style of Fannie Bigbie and others vs George C. Bigie and others, in the Circuit Gout of .the County of Appomattox, State of Virginia, which parcel of land is situated in Cloverhill Magisterial District of Appomattox County, Virginia and lies about four miles west of the village of Vera in the said County, and which parcel of land contains 132 acres. 3 rods and 20 poles and being the identical property that was deeded unto tlie said John R. Bingham by Thomas D. Christian, Commis sioner, by a deed dated Decem ber 7,1899 of record In the Clerks Office of theCircuit of Appomat tox County in Deed Book No. 5 at page 410 thereof. Reference is expressly made to the above mentioned plat of survy for a more complete and accurate de finition of the parcel of land hereby conveyed. SECOND All of that certain tract and parcel of land contain ing 147 acres, more or less with improvements thereon, which parcel of land is situated in Clov erhill Magisterial District of Ap pomattox County, Virginia and is situated about seven miles north east of the court house and ad joins the above described tract of land on which Morgan place and others, and being the same tract of land Hi which one A. S. Wingfield died and which the said A. S. Wingfield owned at the time of his death many years ago, and which was conveyed to the said A. S. Wingfield by A.H. Clement, Commisioner, and F. F. Atwood, by a deed dated Aug- gust 6, 1912 of record in the Clerks Of ice of Appomattox County in Deed Book No. 13 at page 452 and being the same parcel of land that was convey ed unto the said R. J. Bingham by H. B. Totty and others, by a deed dated September 14, 1921, of record in the Clerks Ofice of Appomattox County, Virginia in Deed Book No. 21 at page 435 thereof. Reference is expressly made of each instrument herein mentioned for a more complete and acurate definition of the 147 acres hereby conveyed. The two above described tracts being the real estate that was owned by the said J. R. Bing ham at the time of his death on June 1, 1938. The above described tracts of real estate each have situated thereon dwellings in good condit ion. Each of the said tracts have val uable Umber standing thereon. FOR INFORMATION AS TO HOW TO REACH THIS PRO PERTY, CONTACT GEORGE"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "is situated in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "is situated in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.4, 310.38, 1535.15, 1799.68], "bbox_id": "83d8116b03", "file": "TimesVirginian_1976_0435.pdf", "page": 1, "text": "VS.    i - . ORDER OF PUBLICATION ALL THAT CERTAIN TRACT OR PARCEL OF LAND I SITUATE IN STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX C O U N T Y . I VIRGINIA, AND BEING DES- i CRIBED AS FOLLOWS Being as shown on Sheet 3 of the plans for Route 615, State  Highway Project 0615-006-116,  C-501 and lying on the I southeast right side of the  survey centerline and adjacent  to the center of present Route  615, from a point in the lands of j the landowner at approximate  Station 145  00 to the lands  of Dave Ferguson Estate at I approximate Station 146 87, i and containing 0.11 acre, more j or less, land, of which 0.07 acre j is included in the existing right j of way and 0.04 acre, more or i less, is additional land together with the permanent right and easement to use the additional area shown as being required for the proper construction and maintenance of a ditch right of  approximate Station 14550 I and being a part of the same j property conveyed to Charles S. Lewis by deed from Berpice M. Harvey, single, et als, dated April 20,1948, and recorded on April 20, 1946, in the aforesaid Clerks Office in Deed Book 46 page 172. CASSIE R. LEWIS, widow New York, New York FLOSSIE RENEE LEWIS, an infant under the age of 18 years New York, New York VALERIE LEWIS, AN IN- fant under the age of 18 years New York, New York CHARLAYNE LEWIS, an infant under the age of 18 years New York, New York THE HEIRS AT LAW, DEVISEES, ASSIGN E E S . DISTRIBUTES AND SUC CESSORS IN TITLE OF CHARLES S. LEWIS, DE CEASED, WHO ARE MADE PARTIES DEFENDANT BY THE GENERAL DESCRIP TION UNKNOWN OWN ERS To Whom It May Concern Pursuant to order entered on the 16th day of November, 1976, this notice is hereby gwlh  r In this proceeding the petitioner seeks to acquire by condemnation fee simple title to a certain parcel of land and easement situate in Appomat tox County, Virginia, for the uses and purposes of the petitioner, all of which is more particularly described in thy petition and exhibits attached thereto on file in the Office of the Clerk of this Court, to which reference is hereby made for a full and accurate description thereof and for the appointment of commissioners to ascertain just compensation to the owners of any estate or interest in the property taken or affected as a result of the taking and use thereof by the Petitioner. For such purposes, the Petitioner will apply to the Court, sitting at Appomattox, Virginia, on the 5th day of April, 1977, at 930 A.M., or as soon thereafter as petitioner, may be heard, for the appointment of commissioners to ascertain just compensation as aforesaid. And it appearing by affidavit filed according to law that the following owners are not residents of the State of Virginia Cassie R. Lewis, widow, Flossie Renee Lewis, an infant, Valerie Lewis, an infant, and Charlayne Lewis, an infant, all of New York, New York. IT IS ORDERED that the aforesaid owners do appear within ten 10 days after due publication of this Order in the Clerks Office of the Circuit Court of Appomattox County and do what is necessary to protect their interests and it is further ORDERED that if any of the above named owners desire to assert any objection or defense to the taking or damaging of his property or to the jurisdiction of the Court to hear the case and to proceed ! with t h e  appointment of commissioners, he shall file his answer and grounds of defense designating the property in which he claims to be interested, the grounds of any objection or defense to the taking or damaging of his property or to the jurisdiction of the Court to hear the case and to proceed with the appointment of commissioners for the determination of just compensation. Should any such owner fail to file his answer and grounds of defense as Hereinabove provid ed such failure shall not preclude the owner from appearing on the date set for the appointment of commission"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "I SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "I SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [131.05, 222.89, 273.2, 881.12], "bbox_id": "e0b787e515", "file": "TimesVirginian_1976_0084.pdf", "page": 1, "text": "VIRGINIA la the Circuit Court of Appomattox County. EMMA JOHNSON, et als, Plaintiffs, vs. C. CLEWIS, et als, Defendants ORDER OF PUBLICATION The object of this suit is to effect partition among the owners by sale or otherwise of the real estate in Stonewall Magisterial District of Appo mattox County, Virginia, near Tower Hill, being shown on the land books of Appomattox County as Lot No. 2, containing 24.0 acres Lot No. 3, containing 21.0 acres and Lot No. 4, containing 33.0 acres, and partitioned to Abingdon Johnson, William Johnson and Calvin Johnson, by Decree of the Circuit Court of the Appomattox County, Virginia, dated October 4, 1923, and of record in Chancery Order Book 3 at page 16, and being the same real estate of which Abingdon Johnson died, seized and possessed. An affidavit having been made and filed that there are or may be persons interested in the subject to be divided whose names are unknown and making them parties defendant by the general description of PARTIES UNKNOWN, such unknown parties being the widows, widowers, heirs, de visees and successors in title of Mace Lewis, Dolly J. Harris, Maria Jackson, William John son and Lewis Johnson. It is ORDERED that the said Defendants, Mace Lewis, Dolly Harris, Maria Jackson, William JohnSen and Lewis Johnson, if living, and if they be dead, then their heirs, administrators, executors, devisees and assigns do appear within ten 10 days after due publication of this O der and do what is necessary to protect their interests. BARBARA R. WILLIAMS, fe  Clerk I ask for this Robert W. Carter, Attorney for Plaintiffs 2-26-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.1, 224.79, 1820.39, 1250.7], "bbox_id": "e171a807a9", "file": "TimesVirginian_1976_0428.pdf", "page": 1, "text": "VIRGINIA la the C ircuit Ceurt of Appomattox Ceuaty STATE HIGHWAY COMMIS SIONER OF VIRGINIA vs. ORDER OF PUBLICATION ALL THAT CERTAIN TRACT OR PARCEL OF LAND SITUATE IN STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX C O U N T Y , VIRGINIA, AND BEiNG DES CRIBED AS FOLLOWS Being as shown on Sheet 8 of the plans for Route 615, State Highway Project 0615-006-116, C-501 and lying on the southeast right side of the survey centerline and adjacent to the center of present Route 615, from a point in the lands of the landowner at approximate Station 145  00 to the lands of Dave Ferguson Estate at approximate Station 146 87, and containing 0.11 acre, more or less, land, of which 0.07 acre is included ib the existing right of way aqd 0.04 acre, more or ess, is additional land together with the permanent right and easement to pse the additional area shown as being required  or the proper construction and maintenance of a ditch right of approximate Station 14550 and being a part of thereame property conveyed to Charles 5. Lewis by deed from Bernice ! d. Harvey, single, et als, dated April 20,1946, and recorded on April 20, Î946, in the aforesaic Clerks Office in Deed Book 46 age 172.  ASSIE R. LEWIS, widow New York, New York FLOSSIE RENEE LEWIS, an infant  undefethe age of 18 years New York, New York VALERIE LEWIS, AN IN- fant under the age of 18 years New York, New York CHÀRLAYNE LEW IS, an infant under thefage of 18 years New York, New York THE HEIRS AT LAW, DEVISEES. ASSIGN E E S, DISTRIBUTES AND SUC CESSORS IN TITLE OF CHARLES S. LEWIS, DE CEASED, WHO ARE MADE PARTIES DEFENDANT BY THE GENERAL DESCRIP TION UNKNOWN OWN ERS To Whom It May Concern Pursuant to order entered on the 16th day of November, 1976, this notice is hereby given, .. -.f , . In thisT Ip T O  e d if f g ,  t h e J petitioner seeks to acquire by condemnation fee simple title to à certain parcel of land and easement situate in Appomat tox County, Virginia, for the uses and purposes of the petitioner, aU of which is more particularly described in the petition and exhibits attached thereto onfile in the Office of the Clerk of this Court, to which reference is hereby made for a full and accurate description thereof and for the appointment of conynissioners to ascertain just compensation to the owners of any estate or interest in the property taken or affected as a result of the taking and use thereof by the Petitioner. For such purposes, the Petitioner will apply to the"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1112.15, 401.44, 1262.38, 992.21], "bbox_id": "be62c6d111", "file": "TimesVirginian_1980a_0299.pdf", "page": 1, "text": "VIRGINIA In tlte Circuit Court of Appomattox County B raxton C h ristia n Garrett,Sr., Et Ala, Complainants, V. Mary Robertson Garrett, Et Als, Defendants. ORDER OF PUBLICATION The object of this suit is to partition the- following described real property located . in Appomattox, Virginia That certain tractor par cel of land, together with the buildings and improvements thereon, and the privileges and appurtenances thereun to belonging, Situate, lying and being in Stone Wall Magisterial District, Ap pomattox County, Virginia, on the Tower Hill Road, about 2Vi miles northwest of Rose Bower, and containing approximately 914 acres, and jnore particularly described according to a plat made for W. C. Garrett on February 4,1922, attached to and recorded with a certain deed of trust from W. C. Garrett and Maria Coleman Garrett, his wife, to the Federal Land Bank - of Baltimore, MD, dated1 February 25,1922, and recorded in the Clerks Of- fici of the Circuit Court of A ppom attox C ounty, Virginia,in Deed Book 22, e J97, as followslX inning in- Stony Point-  branch, thence along the Tower Hill and old road as they meander to Station 5, N. 45 15 W. 24 poles N. 48 30 W 14 poles, N. 56 15 W. 21.28 poles N, 54 45 W. 66.5 poles to rock pile iir old road at Station 5, corner with Mrs. Eulelta Carnefix, with her line to Station 7, S. 26 30 W. crossing Stray Point branch, l 56 poles to a stone and poin- feffoUhbog S. 83 K W."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in Stone Wall <mark>Magisterial</mark> <mark>District</mark>, Ap pomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in Stone Wall <mark>Magisterial</mark> <mark>District</mark>, Ap pomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2339.77, 937.31, 2517.57, 1795.8], "bbox_id": "50d2ad55c2", "file": "AppomattoxNewspapers_1939-1943a_0539.pdf", "page": 1, "text": "VIRGINIA In the Clerkss Office of the Circuit Court of Appomattox County, on the 8 rd day of Novem ber, 1942. Walker F. Martin .......... Plaintiff va James Carey Martin, Thomas Milton Estes, P. H. Estes, Junior, and P. H. Estes, Senior . . . . Defendants. The object of this suit is to have partition made in one of the modes prescribed by law of the following parcels of land.- 1- A lot or parcel of land situat ed in the Town of Pamplin, Clover Hill Magisterial District, Appomat tox County, Va., lying and being west of the Baptist Church and des ignated as Lots No. 8 and 8 -A in survey made by W. a . Moses, on which is located the residence of the late Ella V. Estes, and which was conveyed on Sept. 20th, 1928, to Ella V. Estes by Fannie A. Rosser, D. B. 28, page 433-34. 2- a. Four lots of land in the town of Pamplin, Appomattox Coun ty, Va., designated as Lots No. 6 and 6 -A and Lots No. 7 and 7-A on plat of the  Thornton Property, made by W. A. Moses. b. A certain lot or parcel of land in the County of Appomattox, p,, containing 14.3 acres, more or less, adjoining the four lots above men tioned, bounded by the lands of J T. Davis and R. R. Davis on the north and west Franklin Estate on the South and on the east by the above mentioned four lots of land which together with an outlet I t feet wide between the Dot No. t, and the property of J. T, Davis v n conveyed to Ella V. Estes on the 7th of November, 1923 by Allie Lukin et als D. B. 23, page 434. 3- A tract of land In Madison District, Charlotte County, Va., con taining 130 acres, more or less, a- bout one-half mile from Horsepen Mill and about four miles south of Pamplin City, bounded on east by the lands of Thomas Young on the South by the lands of Benjamin Marshall on the West by the lands of Luther Davis and on the North by the lands of George Young, which was conveyed to Ella V. Es tes on the 24th of March, 1915, by J. J. Franklin and wife, D. B. No. 65, page 268, in Clerks Office oT Charlotte County, Va., and conveyed on July 13, 1916, by E la V. Estes to P. H. Estes and Ella V. Estes, D. B. 67, page 2C9. 4. A tract of Ian t cnaining 107 acres., in Madison DisTict, Char lotte County, Virginia on both sides of the roiad from Horsepen Mill, bounded on East by Lyons South oy lands formerly owned by J. J. Franklin on West by the old Beale Tract, now owned by Gili and n North by Josiah Bindley, which as conveyed to P. H. Eses and .lla V. Estes on the 23rd of Aug ust, 1916, D. B. 67, page 263. And to settle trie e taie of the ate El a V. Estes. And it appearng by affidavit fil ed hat James Carey Martin, P. H. Estes, Jr., and Thomas Milton Estes,  are not residents of Virginia, they are hereby required to appear with in ten days af er due publication of I this order and do what is I necessary to protect their interests. I  Teste C. W. SMITH, Clerk. Brock and Rawley, p. q. ___ 1 ll-5-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "of Pamplin, Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "of Pamplin, Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Va.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [989.07, 313.59, 1159.25, 670.89], "bbox_id": "bd32e12287", "file": "AppomattoxNewspapers_1939-1943a_0537.pdf", "page": 1, "text": "VIRGINIA In the Clerkss Office of the Circuit Court of Appomattox County, on the 3rd day of Novem ber, 1942. Walker F. Martin .......... Plaintiff vs James Carey Martin, Thomas Milton Estes, P. H. Estes, Junior, and P. H. Estes, Senior . . . . - Defendants. The object of this suit is to have partition made in one of the modes prescribed by law of the following parcels of land. 1- A lot or parcel of land situat ed in the Town of Pamplin, Clover Hill Magisterial District, Appomat tox County, Va., lying and being west of the Baptist Church and des ignated as Lots No. 8 and 8-A in survey made by W. a . Moses, on which is located the residence of the late Ella V. Estes, and which was conveyed on Sept. 20th, 1923, to Ella V. Estes by Fannie A. Rosser, D. B. 23, page 433-34. 2- a. Four lota of land in the town of Pamplin, Appomattox Coun ty, Va., designated as Lots No. 6 and 6-A and Lots No. 7 and 7-A on plat of the Thornton Property, made by W. A. Moses. b. A certain lot or parcel of land in the County of Appomattox, Va., containing 14.3 acres, more or less, adjoining the four lots above men tioned, bounded by the lands of J. R. Davis on the"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "of Pamplin, Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "of Pamplin, Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Va.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1144.06, 466.26, 1284.31, 1044.79], "bbox_id": "1b437e390a", "file": "AppomattoxNewspapers_1974-1975a_0348.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox County, on the 27 day of Jane, 1975 THOMAS CARTER PANKEY and ESTELLE J. PANKEY, Plaintiffs vs. JOE DOE, if living, or if he be dead, his widow, successors in title and any other persons having an interest in the real estate subject to this suit who are made parties defendant under the general description of Parties Unknown and their heirs, devisees and assigns, Defendants ORDER OF PUBLICATION The object of this suit is to quiet the title to that certain tract or parcel of real estate, lying and being in Southside Magisterial District of,Appo mattox County, Virginia, con taining 30 acres, more or less, approximately two miles Nor theast of the Village of Red House, Virginia and now owned by your plaintiffs. And it appearing by affidavit filed that there are or may be persons interested in the subject matter of this suit whose names and addresses are unknown, and making them parties defendant by the general description of parties unknown, such unknown par ties being John Doe, if he be living, or if he be dead, his widow and heirs, devisees and successors in title, and they are hereby ordered to appear within ten days after the due publication of this order and do what is necessary to protect their interests. Teste BARBARA R. WILLIAMS. Clerk William S. Kerr, p.q. 7-3-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of,Appo mattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of,Appo mattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1103.04, 828.37, 1247.95, 1336.81], "bbox_id": "d394fd3087", "file": "AppomattoxNewspapers_1962-1965a_0197.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox Coun ty, on the 21 day of June, 1963. JOHN P. MARSHALL Plaintiff Against IRENE P. RICHERSON, et ate Defendants The object of this suit is to remove cloud from title on tract of land containing 60 acres more or less, about 5 miles South of Town of Appomattox, in South- side Magisterial District, of Ap pomattox County, Virginia, or to have partition of said tract of real estate, if cloud is not re moved. And it appearing by affidavit filed that Irene P. Richerson, Russell Jennings, Edward Jenn ings, Lloyd Jennings, Evelyn Jennings, Anderson Johnson, if livig, or if he be dead, then the widow and heirs, devisees and successors in title of Anderson Johnson, son of Burrell Johnson and Rachel Johnson, who are made Parties Defendant by the general description of Parties Unknown and Arneta Johnson Pettie, if living, or if she be dead, then the widower and heirs devisees and successors in title of Arneta Johnson Pettie, daugh ter of urrell Johnson and Ra chel Johnson, who are made Par ties Defendant by the General Deseripion of Paries Unknown and THE UNKNOWN HEIRS AT LAW of Anderson Johnson and Arnea Johnson Peittie who are1 made Parties Defendant by the general description of Parties Unknown, are not residents of Virginia, they are hereby re quired to appear within ten days after the due publication of this order and do what is necessary Ts C. W. SMITH, Clrk GEORGE ABBITT, JR., p.q. 7-4-4"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in South- side <mark>Magisterial</mark> <mark>District</mark>, of Ap pomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in South- side <mark>Magisterial</mark> <mark>District</mark>, of Ap pomattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.54, 501.97, 2059.04, 698.66], "bbox_id": "fd08cbaa39", "file": "AppomattoxNewspapers_1962-1965a_0213.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox Coun ty, on the 21 day of June, 1963. JOHN P. MARSHALL Plaintiff Against IRENE P. RICHERSON, et als Defendants The object of this suit is t,o remove cloud from title on tract of land containing 60 acres more or less, about 5 miles South of Town of Appomattox, In South- side Magisterial District, of Ap pomattox County, Virginia, or to have partition of said tract of real estate, if cloud is not re moved. And it appearing by affidavit filed that Irene P,"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, In South- side <mark>Magisterial</mark> <mark>District</mark>, of Ap pomattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, In South- side <mark>Magisterial</mark> <mark>District</mark>, of Ap pomattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1890.61, 743.81, 2032.26, 1426.76], "bbox_id": "34ec984e87", "file": "AppomattoxNewspapers_1962-1965a_0356.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit  Court. of Appomattox County, on the 25th day of February, 196.4, j. BOYD BAGBY, Complainant Against SAMUEL WALTER BAGBY 275 Burnside Avenue East Hartford, Conn. LESTER BETTS 1503 Haskins Mill .Road Bridge ville, Pa. SAMUEL WALTER BAGBY, above named, if living or if he be dead, then the widow and heirs, devisees and successors in title of Samuel Walker Bagby, a grandson of Elizabeth W. Bag by, deceased, who left his home in Virginia many years ago and has not been heard from since, who are made Parties Defendant by the general description of Parties Unknown. LESTER BETTS, above named, if living, or if he be dead, then the widow and heirs, devisees and successors in title of Lester Betts, a grandson of Thomas Anderson Wilkerson, deceased, who left his home in Virginia many years ago and has not been heard from since, who are made Parties Defendant by the general description of Parties Unknown. And all of the unknonw heirs at law, devisees, assignees and suc cessors in title of the said Sam uel Walter Bagby and the said Lester Betts, who are made par ties defendant by the général description of Parties Un known. Defendants The object of this suit is to have partition by one of the modes prescribed by law of the real estate of which J. William Webb died seized and possessed, situated about one mile East of the Court House of Appomattox County in Southside Magisterial District of Appomattox County, Virginia, and being lots number ed 153, 154, 155, 157, 158, 159 and 160, facing on Confederate Ave nue. And it appearing by affidavit filed that Samuel Walter Bagby and Lester Betts are not resi dents of Virginia, they are here by required to appear within ten days after the due publication of this order and do what is necess ary to protect their interests. Teste C. W- SMITH, Clerk. George Abbitt, Jr., p.q. 3-5-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox County in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox County in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [875.5, 638.79, 1022.64, 1119.42], "bbox_id": "bcbce7d6c0", "file": "TimesVirginian_1978_0444.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office for the Circuit Court of Appomattox County. Frank R. Crosby, et als. Plaintiffs ORDER OF PUBLICATION V. MARION Fullmer, et ala, Defendants The object of this suit is to effect partition, in one of the modes prescribed by law, of aU that certain tract or parcel of real estate in Southside Magisterial District, Appomat tox County, Virginia on Long Creek as is shown on a plat of survey made by William S. Cheatham, Deputy Surveyor, dated January 18, 1858, and containing 117Vt acres, and if such is impractical, that the property be sold by the Court and the proceeds be divided among , those entitled thereto. And it appearing by affidavit filed th at the D efendants, Marion Fullmer George Fos- sett, Jr. Robert Fossett Rose Fossett Kaye Crosby Coffee and Joyce Corosby Kwanza are , not residents of the State or Virginia, and that there may be persons whose names are unknown, interested in the subject to be divided or disposed of, it is ORDERED that the Defendants do appear on or before November 1,1978, and do what is necessary to protect their interests. Teste Barbara R. Williams, Thomas W. Lawson p.q. 9-21-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [881.73, 662.3, 1031.48, 1144.87], "bbox_id": "2fb847d675", "file": "TimesVirginian_1978_0429.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office for the Circuit Court of Appomattox County. Frank R. Crosby, et ala, P lain tiffs ORDER OF PUBLICATION V .- MARION Fullmer, et als, Defendants The object of this suit is to effect partition, in one of the modes prescribed by law, of all that certain tract or parcel of real estate in Southside Magisterial District, Appomat tox County, Virginia on Long Creek as is shown on a plat of survey made by William S. Cheatham, Deputy Surveyor, dated January 18, 1858, and containing 117 V acres, and if such is unpractical, that the property be sold by the Court and the proceeds be divided among those entitled thereto. And it appearing by affidavit filed th at the D efendants, Marion Fullmer George Fos- sett, Jr. Robert Fossett Rose fssett Kaye Crosby Coffee  and Joyce Corosby Kwanza are not residents of the State of Virginia, and that there may be persons whose names are unknown, interested in the subject to be divided or disposed of, it is ORDERED that tiie Defendants do appear on or before November 1,1978, and do what is necessary to protect their interests. Teste Barbara R. Williams, Thomas W. Lawson p.q. 9-21-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [889.46, 1325.19, 1037.53, 1809.29], "bbox_id": "efeb1ccf0b", "file": "TimesVirginian_1978_0418.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office for the Circuit Court of Appomattox County. Frank R. Crooby, et alo, Plaintiffs ORDER OF PUBLICATION V. MARION Fullmer, et als, Defendants The object of this suit is to effect partition, in one of the modes prescribed by tow, of all that certain tract or parcel of real estate in Southside Magisterial District, Appomat tox County, Virginia on Long Creek as is shown on a plat of survey made by, William S. Cheatham, Deputy Surveyor, dated January 18, 1858, and containing 117 V acres, and if such is impractical,,-that the property be sold by the Court and the proceeds be divided among those entitled thereto. . .And it appearing by affidavit filed th a t th e D efendants, Marion Fullmer George Fos se tt, Jr. Robert Foesett Rose Foeeett Kaye Crooby Coffee and Joyce Coroeby Kwanza are not residents of the State of Virginia, and that there may be persons whose nam es are unknown, interested in the subject to be divided or disposed of, it is ORDERED that the Defendants do appear on or before November 1,1978, and do what is necessary to protect their interests. Teste Barbara R. Williams, 1 h  ra W .l !n iiB  4 V 9-21-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [883.22, 364.93, 1028.16, 870.68], "bbox_id": "fafc4f8843", "file": "TimesVirginian_1978_0461.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office for the Circuit Coart of Appomattox County. Frank R. Crosby, et mb, Plaintiffs ORDER OF PUBLICATION V. MARION Fullmer, étais. Defendants The object of this suit is to effect partition, in one of the modes prescribed by law, of all that certain tract or parcel of real estate in Southside Magisterial District, Appomat tox County, Virginia on Long Creek as is shown on a plat of survey made by William S. Cheatham, Deputy Surveyor, dated January 18, 1858, and containing 117Vt acres, and if such is impractical, that the property be sold by the Court and the proceeds be divided among those entitled thereto. And it appearing by affidavit filed th a t the D efendants, Marion Fullmer George Fos- sett, Jr. Robert Fossett Rose Fossett Kaye Crosby Coffee and Joyce Corosby Kwanza are not residents of the State of Virginia, and that there may be persons whose names are unknown, interested in the subject to be divided or disposed of, it is ORDERED that the Defendants do appear on or before November 1,1978, and do what is necessary to protect their interests. Teste Barbara R. Williams, Thomas W. Lawson p.q. _ _______________ 9-21-4t Legal Notice"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Southside <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2323.86, 381.07, 2473.51, 1371.92], "bbox_id": "6c601a5332", "file": "AppomattoxNewspapers_1971-1973a_0257.pdf", "page": 1, "text": "VIRGINIA IN THE CIRCUIT COURT OF APPOMATTOX COUNTY. VINCENT PATTERSON, ALMETER P. FINLEY, Complainants, vs. COLLIER T. PATTERSON, et als. Defendants. ORDER OF PUBLICATION The object of this suit is to effect partition in one of the modes prescribed by law of cer tain parcels of real estate, be longing, lying and being in Clov- erhill Magisterial District and Southside Magisterial District of Appomattox County, Virginia, of which Hattie W. Patterson died, testate, seized and pos sessed thereof, being a3.0acre parcel in Cloverhfll District, adjoined by Norfolk  Western Railway, conveyed to Charles Patterson by Henrietta Wom ack, et als, by Deed dated 21 October, 1907, of record in the Clerks Office of this Court in Deed Book 10 at page 38 a 40-18 acre parcel and a 119.7 acre parcel, being contiguous tracts conveyed to Charlie Pat terson by two separate Deeds, the first dated 24 April, 1937,of record in the aforesaid Clerks Office in Deed Book 36 at page 324, and the second, dated 30 May, 1944, of record in the aforesaid Clerks Office in Deed Book 43 at page 25, lying in Cloverhill Magisterial District of Appomattox County, lying on both sides of the county road leading from Appomattox to Evergreen, LESS, HOWEVER, two off-conveyances being 5.0 acres each, devised under the last will and testament of Char les E. Patterson to Almeter P. Finley and Audrey Patterson, and a 1.0 acre parcel conveyed by Hattie W. Patterson, widow of Charles E. Patterson, to Wil liam P. Baker, et ux, by Deed dated 15 February, 1966, of re cord in the aforesaid Clerks Office in Deed Book 85 at page 566 and a 40 12 acre parcel, more or less. In Southside Mag- sterial District of Appomattox County, Virginia, situated on the Northeast side of Patrick Ann Lane in the Town of Appomat tox, being adjoined by the lands now or formerly owned by Lee Patterson, Estate ofH. D. FloocL and Adelia C. Ferguson, Lucy A. Cumby, Earl Patterson, Oc- tavia Caldwell, Jubber T. Mc- D a ni e l, et als, conveyed to Charlie E. Patterson by Deed dated 11 December, 1947, of re cord in the aforesaid Clerks Office in Deed Book 49 at page 205, and being the same pro perty of which Hattie W. Patt erson died, testate, seized and possessed thereof. An affidavit having been made and filed that Collier T. Patter son, Hubert J. Patterson, Gla dys T. Cheatham, Arnold Pat terson, Monroe P a t t e r s o n , Doris P. Wright, Olga P. Pratt, and Audrey Patterson, Defend ants, are not residents of the State of Virginia It is ORDERED that the non resident Defendants do appear within ten days afer due publication onis order and do what may be necessary to pro tect their Interests in this suit. Teste"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1223.27, 252.31, 1374.46, 1243.81], "bbox_id": "948ffecb58", "file": "AppomattoxNewspapers_1971-1973a_0242.pdf", "page": 1, "text": "VIRGINIA IN THE CIRCUIT COURT OF APPOMATTOX COUNTY. VINCENT PATTERSON, ALMETER P. FINLEY, Complainants, vs. COLLIER T. PATTERSON, et als, Defendants. ORDER OF PUBLICATION The object of this suit is to effect partition in one of the modes prescribed by law of cer tain parcels of real estate, be longing, lying and being in Clov- erhill Magisterial District and Southside Magisterial District of Appomattox County, Virginia, of which Hattie W. Patterson died, testate, seized and pos sessed thereof, being a 3.0 acre parcel in Cloverhill District, adjoined by Norfolk  Western Railway, conveyed to Charles. Patterson by Henrietta Wom ack, et als, by Deed dated 21 October, 1907, of record in the Clerks Office of this Court in Deed Book 10 at page 38 a 40-18 acre parcel and a 119.7 acre parcel, being contiguous tracts conveyed to Charlie Pat terson by two separate Deeds, the first dated 24 April, 1937,of record in the aforesaid Clerks Office in Deed Book 36 at page 324, and the second, dated 30 May, 1944, of record in the aforesaid Clerks Office in Deed Book 43 at page 25, lying in Cloverhill Magisterial District of Appomattox County, lying on both sides of the county road leading from Appomattox to Evergreen, LESS, HOWEVER, two off-conveyances being 5.0 acres each, devised under the last will and testament of Char les E. Patterson to Almeter P. Finley and Audrey Patterson, and a 1.0 acre parcel conveyed by Hattie W. Patterson, widow of Charles E. Patterson, to Wil liam P. Baker, et ux, by Deed dated 15 February, 1966, of re  cord in the aforesaid Clerks Office in Deed Book 85 at page 566 and a 40 12 acre parcel, more or less, in Southside Mag- sterial District of Appomattox County, Virginia, situated on the Northeast side of Patricia Ann Lane in the Town of Appomat tox, being adjoined by the lands now or formerly owned by Lee Patterson, Estate of H. D. Flood and Adelia C. Ferguson, Lucy A. Cumby, Earl Patterson, Oc- tavia Caldwell, Jubber T. Mc- D a n i e l , et als, conveyed to Charlie E. Patterson by Deed dated 11 December, 1947, of re  cord in the aforesaid Clerks Office in Deed Book 49 at page 205, and being the same pro. perty of which Hattie W. Patt erson died, testate, seized and possessed thereof. An affidavit having been made and filed that Collier T. Patter son, Hubert J. Patterson, Gla dys T. Cheatham, Arnold Pat terson, Monroe P a t t e r s o n , Doris P. Wright, Olga P. Pratt, and Audrey Patterson, Defend ants, are not residents of the State of Virginia It is ORDERED that the non resident Defendants do appear within ten AO days afer due publication oHfeis order and do what may be necessary to pro tect their interests in this suit. Teste"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2430.73, 359.51, 2582.66, 1418.51], "bbox_id": "9d81a87325", "file": "AppomattoxNewspapers_1971-1973a_0252.pdf", "page": 1, "text": "VIRGINIA IN THE CIRCUIT COURT OF APPOMATTOX COUNTY. VINCENT PATTERSON, ALMETER P. FINLEY, Complainants, vs. COLLIER T. PATTERSON, et als, Defendants. ORDER OF PUBLICATION The object of this suit is to effect partition in one of the modes prescribed by law of cer tain parcels of real estate, be longing, lying and being in Clov- erhill Magisterial District and Southside Magisterial District of Appomattox County, Virginia, of which Hattie W. Patterson died, testate, seized and pos sessed thereof, being a 3.0 acre parcel in Cloverhill District, adjoined by Norfolk  Western Railway, conveyed to Charles. Patterson by Henrietta Wom ack, et als, by Deed dated 21 October, 1907, of record in the Clerks Office of this Court in Deed Book 10 at page 38 a 40-18 acre parcel and a 119.7 acre parcel, being contiguous  tracts conveyed to Charlie Pat terson by two separate Deeds, the first dated 24 April, 1937,of record in the aforesaid Clerks Office in Deed Book 36 at page 324, and the second, dated 30 May, 1944, of record in the aforesaid Clerks Office in Deed Book 43 at page 25, lying in Cloverhill Magisterial District of Appomattox County, lying on both sides of the county road leading from Appomattox to Evergreen, LESS, HOWEVER, two off-conveyances being 5.0 acres each, devised under the last will and testament of Char les E. Patterson to Almeter P. Finley and Audrey Patterson, and a 1.0 acre parcel conveyed by Hattie W. Patterson, widow of Charles E. Patterson, to Wil liam p. Baker, et ux, by Deed dated 15 February, 1966, of re cord in the aforesaid Clerks Office in Deed Book 85 at page 566 and a 40 12 acre parcel, more or less, in Southside Magi sterial District of Appomattox County, Virginia, situated on thé Northeast side of Patricia Ann Lane in the Town of Appomat tox, being adjoined by the lands now or formerly owned by Lee Patterson, Estate ofH.D. Flood I and Adelia C. Ferguson, Lucy A. Cumby, Earl Patterson, Oc- tavia Caldwell, Jubber T. Mc- D a n ie l, et als, conveyed to Charlie E. Patterson by Deed dated 11 December, 1947, of re cord in the aforesaid Clerks Office in Deed Book 49 at page 205, and being the same pro perty of which Hattie W. Patt erson died, testate, seized and possessed thereof. An affidavit having been made and filed that Collier T. Patter son, Hubert J. Patterson, Gla dys T. Cheatham, Arnold Pat terson, Monroe P a t t e r s o n , Doris P. Wright, Olga P. Pratt, and Audrey Patterson, Defend ants, are not residents of the State of Virginia It is ORDERED that the non resident Defendants do appear within ten SO days afer due publication orStis order and do what may be necessary to pro tect their interests in this suit. Teste ALDAH B. GORDON,Clerk Robert W. Carter, p.q. Attorney for Complainants 203 N. Church Street Appomattox, Virginia. 3-2-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District", "Magisterial", "District"], "snippet": "being in Clov- erhill <mark>Magisterial</mark> <mark>District</mark> and Southside <mark>Magisterial</mark> <mark>District</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.11, 218.67, 1522.78, 1820.01], "bbox_id": "e9fd46451c", "file": "TimesVirginian_1976_0445.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court of Appomattox County STATE HIGHWAY COMMIS SIONER OF VIRGINIA va. 0 . 1 1  ORDÌ OF PUBLICATION AT.I.THAT CERTAIN TRACT OR PARCEL OF LAND SITUATE IN STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX C O U N T Y , VIRGINIA, AND BEING DES CRIBED AS FOLLOWS png as shown on Sheet 3 of the pinna for Route 615, State Highway Project 0615-006-116, C-501 and lying on the southeast right ride of the survey centerline and adjacent to the center of present Route 615, frbm.a point in the lands of the landowner at approximate Station 145  00 to the lands of Dave Ferguson Estate at approximate Station 146 87, and 0.11 acre, more or teas, land, of which 0.07 acre is includ4d ih the existing right .of way aqd 0.04 acre, more or leas, is additional land together with the permanent right and easement to use the additional area shown as being require for the proper construction ant maintenance of a ditch right o approximate Station 14550 and being a part of the same .property conveyed to Charles S. Lewis by deed from Bernice M. Harvey, single, et ala, dated April 20,1946, and recorded on April 20,1946, in the aforesaid Clerks Office in Deed Book 46, page 172. CASSIE R. LEWIS, widow New Yorki New York FLOSSIE RENEE LEWIS, an infant under the age of 18 years New York, New York VALERIE LEWIS, AN IN- f ant under the age of 18 years New York, New York CHARLAYNE LEW IS, an infant under thejage of 18 years New York, New York THE HEIRS AT LAW, DEVISEES, ASSIGN E E S , DISTRIBUTES AND SUC CESSORS IN TITLE OF CHARLES S. LEWIS, DE CEASED, WHO ARE MADE PARTIES DEFENDANT BY THE GENERAL DESCRIP TION UNKNOWN OWN ERS To Whom If May Concern Pursuant to order entered on the 16th day of November, 1978, this notice is hereby given  l n th is procedipg  thy petitioner series to acquire by condemnation fee simple title to a certain parcel of land and easement situate in Appomat tox County, Virginia, for the uses and purposes of the petitioner, all of which is more particularly described in the petition and exhibits attached thereto on file in the Office of the Clerk of this Court, to which reference is hereby made for  a full and accurate description thereof and for the appointment of commissioners to ascertain just compensation to the owners of any estate or interest in the property taken or affected as a result of the taking and use thereof by the Petitioner. For such purposes, the Petitioner will apply to the Court, sitting at Appomattox, Virginia, on the 5th day of April, 1977, at 930 A.M., or as soon thereafter as petitioner, may be heard, for the appointment of commissioners to ascertain just compensation as aforesaid. And it appearing by affidavit filed according to law that the following owners are not residents of the State of Virginia Cassie R. Lewis, widow, Flossie Renee Lewis, an infant, Valerie Lewis, an infant, and Charlayne Lewis, an infant, all of New York, New York. IT IS ORDERED that the aforesaid owners do appear within ten  10  days after due publication of this Order in the Clerks Office of the Circuit Court of Appomattox County and do what is necessary to protect their interests and it is further ORDERED that if any of the above named owners desire to assert any objection or defense to the taking or damaging of his property or to  thè jurisdiction of the Court to s hear the case and to proceed I w ith the appointm ent of  commissioners he shall file his  answer and grounds of defense I designating the property in  which he claims to be  interested, the grounds of any objection or defense to the  taking or damaging of his J property or to the jurisdiction  of the Court to hear the case  and to proceed w ith the t appointment of commissioners  for the determination of just  compensation.  Should any such owner fail to  file his answer and grounds of  defense as hereinabove provid-  ed such failure shall not  preclude the ow ner from J appearing on the date set for  the appointment r i commission-"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX C O U"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1951.18, 165.91, 2094.47, 825.33], "bbox_id": "7d6999afc2", "file": "TimesVirginian_1976_0077.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court of Appomattox County. EMMA JOHNSON, ot ris, Plaintiffs, vs. C. C. LEWIS, et als, Defendants ORDER OF PUBLICATION The object of this suit is to effect partition among the owners by sale or otherwise of the real estate in Stonewall Magisterial District of Appo mattox County, Virginia, near Tower Hill, being shown on the tend books of Appomattox County as Lot No. 2, containing 24.0 acres L o t. No. 3, containing 21.0 acres and Lot No. 4 , containing 83.0 acres, and partitioned to Abingdon Johnson, William Johnson and Calvin Johnson, by Decree of the Circuit C ourt of the Appomattox County, . Virginia, dated October 4, 1923, and of record in Chancery Order Book 3 at page 16, and being the same real estate of which Abingdon Johnson died, seised and possessed. An affidavit having been made and filed that there are or may be persons interested in the subject to be divided whose names are unknown and making them parties defendant by the general description of PARTIES UNKNOWN, such unknown parties bong the widows, widowers, heirs, de visees and successor in title of Mace Lewis, Dolly J. Harris, Maria Jackson, William.John son and Lewis Johnson. It is ORDERED that the said Defendants, Mace Lewis, Dolly Harris, Maria Jackson, William Johnson and Lewis Johnson, if living, and if they be dead then their heirs, adm inistrators executors, devteeea and assigns do appear within ten 10 days after due publication of this Order and do what is necessary to protect their interests. BARBARA R. WILLIAMS Clerk I ask for this Robert W. Carter, Attorney for Plaintiffs 2-26-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "real estate in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [962.9, 1489.31, 1097.25, 1817.1], "bbox_id": "b2969c6c53", "file": "TimesVirginian_1980a_0290.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court of Appomattox County B raxton C h ristia n Garrett.Sr.. Et Als, Complainants, V Mary Robertson Garrett, Et Als, Defendants. ORDER OF PUBLICATION The object of this suit is to partition the following described real property located in Appomattox, Virginia That certain tract or par cel of land, together with the buildings and improvements thereon, and the privileges and appurtenances thereun to belonging, Dittiate, lying and being in Stone Wall Magisterial District, Ap pomattox County, Virginia, on the Tower Hill Road, about 2W miles northwest of Rose Bower, and containing approximately 91 Vi acres, and more particularly described according to a plat made for W. C. Garrett on February 4,1922, attached to"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in Stone Wall <mark>Magisterial</mark> <mark>District</mark>, Ap pomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in Stone Wall <mark>Magisterial</mark> <mark>District</mark>, Ap pomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1822.73, 203.66, 1967.32, 1227.41], "bbox_id": "28c2f3c44a", "file": "TimesVirginian_1976_0419.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court of Appomattox Cocurty STATE HIGHWAY COMMIS SIONER OF VIRGINIA vs. ORDER OF PUBLICATION ALL THAT CERTAIN TRACT OR PARCEL OF LAND SITUATE IN STONEWALL MAGISTERIAL DISTRICT. APPOMATTOX C O U N T Y 1, VIRGINIA. AND BEING DES CRIBED AS FOLLOWS Being as shown on Sheet 3 of the plans for Route 615, State Highway Project 0615-006-116, C-501 and lying o n r the southeast right side of the survey centerline and adjacent to the center of present Route 615, from a point in the lands of the landowner at approximate Station 145  00 to the lands of Dave Ferguson Estate at approximate Station 146 87, and containing 0.11 acre, more or less, land, of which 0.07 acre is included in the existing right .of way aqd 0.04 acre, more or less, is additional land together with the permanent right and easement to fise the additional area shown as being required for the proper construction and maintenance of a ditch right pf approximate Station 14550 and being a part of the same property conveyed to Charles S. Lewis by deed from Bernice M. Harvey, single, et als, dated April 20,1946, and recorded on April 20,1946, in the aforesaid Clerks Office in Deed Book 46, page 172. CASSIE R. LEWIS, widow New York, New York FLOSSIE RENEE LEWIS, an infant under the age of 18 years New York, New York VALERIE LEWIS, AN IN- fant under the age of 18 years New York, New York CHARLAYNE LEWIS, an infant under thejage of 18 years New York, New York THE HEIRS AT LAW, DEVISEES, ASSIGN E E S , DISTRIBUTES AND SUC CESSORS IN TITLE OF CHARLES S. LEWIS, DE CEASED, WHO ARE MADE PARTIES DEFENDANT BY THE GENERAL DESCRIP TION UNKNOWN OWN ERS To Whom It May Concern Pursuant to order entered on the 16th day of November, 1976, this notice is hereby given In this proceeding the petitioner seeks to acquire by condemnation fee simple title to a certain parcel of land and easement situate in Appomat tox County, Virginia, for the uses and purposes of the petitioner, ail of which is more particularly described in the petition and exhibits attached thereto on file in the Office of the Clerk of this Court, to which reference is hereby made for a full and accurate description thereof and for the appointment of commissioners to ascertain just compensation to the owners of any estate or interest in the property taken or affected as a result of the taking and use thereof by the Petitioner. For such purposes, the Petitioner will apply to the"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>. APPOMATTOX C O U"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "LAND SITUATE IN STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>. APPOMATTOX C O U"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [709.69, 198.05, 852.71, 772.31], "bbox_id": "405c33802d", "file": "AppomattoxNewspapers_1974-1975a_0363.pdf", "page": 1, "text": "VIRGINIA hi the Clerk. Office el the drew C m  s i Appeaettem C s t y , aa the 27 day of Jaae. 197S THOMAS CARTES PANKEY m i ESTELLE J. PAN KEY. Plaintiff. vs. JOE DOE. if living. ar tf he be dead, his widew, sates sears in title and aay ether perseas having an interest in the real estate subject to this salt who are nude parties defendant under the general description of Parties Unknown and their heirs, devisees and assigns, Defendants ORDER OF PUBLICATION The object of this suit is to quiet the title to that certain tract or parcel of real estate, lying and being in Southside Magisterial District of Appo mattox County, Virginia, con taining 30 acres, more or less, approximately two miles Nor theast of the Village of Red House, Virginia and now owned by your plaintiffs. And it appearing by affidavit filed that there are or may be persons in tere ste d in the subject m atter of this suit whose names and addresses are unknown, and making them parties defendant by the general description of .parties unknown, such unknown par ties being John Doe, if he be living, or if he be dead, his widow and heirs, devisees and successors in title, and they are hereby ordered to appear within ten days after the due publication of this order and do what is necessary to protect their interests. Tcst8! BARBARA R. WILLIAMS, Clerk William S. Kerr, p.q. 7-3-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1229.49, 278.3, 1408.06, 896.36], "bbox_id": "718b4915e0", "file": "AppomattoxNewspapers_1960-1962b_0306.pdf", "page": 1, "text": "Under and by virtue of the power of sale contained in a deed of trust executed by Hubert Mclvor and Frances A. Molvor, has wife, dated the 23rd day of April, 1959, and re corded in the Clerks Office of the Circuit Court of Appomattox Coun ty, Va., in Deed Book 7, at page 173, the undersigned Trustee will of fer for sale at public auction to the highest bidder for CASH at the front entrance of the Circuit Court of Ap pomattox County, Virginia, at 400 P. M., on the 15th day of April, 1961, the property conveyed in said deed of trust, the same being more particaularly described as follows All that certain parcel of land sit uated in the Soubhside Magisterial District of Appoawatox Couny, Vir ginia about five males South of the Court House, lying on the Bast side of State Rolad No. 604 and contain ing 3,600 square yards in area, de scribed by metes and bounds as fol lows. BEGINNING at an iron pin at the Southeast corner of land con veyed by the said Dave and Ade line Cheatham, by deed to be re corded iamrediately ahead of this deed, and bearing even date there with, to William Hancock, Jr. and Thelma Hancock thence in a West erly direction, with the line of the said Hancock land a distance of ap proximately 60 yards to the center line of said State Road No. 604 crossing an iron pin at the edge of said State Road No. 664 thence in a Southerly direction along the cen ter line of said State Road No. 604 to a point where the said center line intersects a line parallel to the line between the arofesaid iron pins the Southern boundry of the said Haneock land thence along said parallel line in an Easterly direction to a point where send parallel line intersects a continuation of the East ern boundry line of the said Hancock land thence along the said continu ation to the point of BEGINNING enclosing 3,600 square yards. The -a. Band is being conveyed by the area and not by the boundry. This the 2nd day of March, 1961. M. D. Aldridge, Jr., Sole Acting Trustee. BL D. AMridge, Jr., Attorney At Law Hopewell, Virginia 8-16-5ftc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "uated in the Soubhside <mark>Magisterial</mark> <mark>District</mark> of Appoawatox Couny, Vir"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "uated in the Soubhside <mark>Magisterial</mark> <mark>District</mark> of Appoawatox Couny, Vir"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [802.28, 1118.49, 972.01, 1565.32], "bbox_id": "7f63d7a54b", "file": "AppomattoxNewspapers_1954-1955a_0311.pdf", "page": 1, "text": "Under and by virtue of authority vested in the undersigned Trustee, by that certain deed of trust dated the 6th day of May, 1948, and re corded in the Clerks Office of the Circuit Court of Fauquier County, Virginia, in Deed Book 166, at page 2, from Lena G. Mayberry, widow, to George Abbitt, Jr., Trustee, to secure the payment of a debt there in secured, default having been made in the payment of said debt, accord ing to the terms of said trust, and at the request of the holder of note secured therein, the undersigned will offer for sale at public auction, at the front door of the Court House, in the Town of Warrenton, Vir ginia, on Thursday, the 30th day of June, 1955, at twelve oclock Noon, the following described real-estate to-wit All of that certain tract or parcel of land, with the buildings and im provements thereon, and containing 22 acres and 20 square perches, by survey, and being situate in Centre Magisterial District, Fuarquier Coun ty, Virginia, about six miles from the town of Warrenton on State Highway No. 688, just off Highway No. 211, and being the same and identical property which was convey ed to Lena G. Mayberry, by W. B. Hiner and wife, by deed dated the 24th day of June, 1944, and record ed in said Clerks Office, in Deed Book 155, at page 321, and con taining by survey 22 acres and 20 perches. Terms of Sale Cash. George Abbitt, Jr. _ Trustee. Latham Shumate, Auctioneer. 6-3-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1148.1, 690.07, 1318.83, 1140.23], "bbox_id": "ea44876bb5", "file": "AppomattoxNewspapers_1954-1955a_0318.pdf", "page": 1, "text": "Under and by virtue of authority vested in the undersigned Trustee by that certain deed of trust dated the 6th day of May, 1948, and re corded in the Clerks Office of the Circuit Court of Fauquier County, Virginia, in Deed Book 166, at page 2, from Lena G. Mayberry, widow, to George Abbitt, Jr., Trustee, to secure the payment of a debt there in secured, default having been made in the payment of said debt, accord ing to the terms of said trust, and at the request o f the holder of note secured therein, the undersigned will offer for sale at public auction, at the front door of the Court House, in the Town of Warrenton, Vir ginia, on Thursday, the 30th day of June, 1955, at twelve oclock Noon, the following described real-estate to-wit All of that certain tract or parcel of land, with the buildings and im provements thereof, and containing 22 acres and 20 square perches, by survey, and being situate in Centre Magisterial District, Fuarquier Coun ty, Virginia, about six miles from the town of Warrenton, on State Highway No. 688, just off Highway No. 211, and being the same and identical property which was convey ed to Lena G. Mayberry, by W. B. Hiner and w ife, by deed dated the 24th day of June, 1944, and record ed in said Clerks Office, in Deed Book 155, at page 321, and con taining by survey 22 acres and 20 perches. Terms of Sale Cash. George Abbitt, Jr. Trustee. Latham Shumate, Auctioneer. 6-3-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1294.29, 703.27, 1372.24, 1118.86], "bbox_id": "fb9aeff359", "file": "AppomattoxNewspapers_1954-1955a_0325.pdf", "page": 1, "text": "Under and by v vested in the mi,- by that certain dtd 4 the 6 th day of Mq, corded in the Clerks Circuit Court of p. Virginia, in Deed Boot 2, from Leu Gut to George Abbitt, Jt, secure the payment tit in secured, default W in the payment of aii ing to the tenni of at the reqneit of  secured therein, the offer for sale at the front door ot th in the Town of Ir ginia, on Thundiy, tk June, 1955, at tweho the following deocrliti to-wh All of that certain of land, with the provements thereon, 22 acres and 20 apt survey, and being Magisterial District, ty, Virginia, about a the town of Vu Highway No. 988, at No. 211, and being identical property did ed to Lena G. N Hiner and wife, by 24th day of Jane, ed in said Clerks Book 155, at pep taming by surrey !2 perches. Terms of Sale Cab George"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "apt survey, and being <mark>Magisterial</mark> <mark>District</mark>, ty, Virginia, about a"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "apt survey, and being <mark>Magisterial</mark> <mark>District</mark>, ty, Virginia, about a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2333.25, 547.32, 2478.72, 1135.42], "bbox_id": "197467b4b5", "file": "AppomattoxNewspapers_1962-1965a_0110.pdf", "page": 1, "text": "Two engineering firms submitt ed estimates for the proposed sewage lagoon project at Town I Councils meeting Monday. Mayor S. R . Lawson said that Wiley I and Wilson, Lynchburg, ad Han-  kins and Anderson, Richmond,  had both sent letters giving es timated costs for their work to design and supervise the con struction. Present System Inadequate Mayor Lawson said that Ro bert Je kins, a representative bf the Water Control Board was  unaware as to wihat we were doing to provide more sewage facilities for the town. Lawson quoted Jenkins as saying that the Water Control Board was getting ready to put Appomattox on a  permit basis because the pre sent sewage system is overload ed. This would have meant that no other home or business place could tie in to the sewage sys tem without a state permit. Because of the plans to con- ! struct the sewage lagoon, how ever, Jenkins said the Water Control Board would probably shelve their plans to place Appo mattox on a restricted basis. Ivey Holland said,  I think we stand at a place where were going to have to take action. The Council then decided to let the Finance Committee plus the i Town Manager go to Farmville to check costs of a sewage la goon system there. New Voting Precinct The Mayor also reported that  we have people voting in town who do not live in town, and have never lived in town. Approximately 1200- vote in the Soubhside magisterial district ac- Loordipg j to Lawsons estimate, yrith bout 600 voting in town. We want people in town paying town taxes to be able to decide on town matters. , Council voted to request the Board of Supervisors to petition Circuit Court to create a separ ate voting precinct for the Town of Appomattox. Whether this would mean a new registration for voters could not be deter mined. Traffic Safety"}, "highlight": {"text": {"matched_tokens": ["magisterial", "district"], "snippet": "vote in the Soubhside <mark>magisterial</mark> <mark>district</mark> ac- Loordipg j to"}}, "highlights": [{"field": "text", "matched_tokens": ["magisterial", "district"], "snippet": "vote in the Soubhside <mark>magisterial</mark> <mark>district</mark> ac- Loordipg j to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1409.31, 751.87, 1653.84, 1072.16], "bbox_id": "b1aceaddb2", "file": "AppomattoxNewspapers_1962-1965a_0084.pdf", "page": 1, "text": "turn. Chinas trip to the m ts, by the above mentioned ed of power of attorney to vertisc and sell and convey ,to the highest bidder the re below described proper- 1, George Abbitt, Jr. as at- ney and agent for the above ntioned owners will sell ublic Auction to the Highest dder. Saturday, January 12, 1963. At 1000 a.m. ront of the Dwelling House the First Tract of Land De- ribed Below, the Following scribed Property. ST All of that certain tract parcel of land known as lot on the plat and map of the lie farm, which plat was le by W. S. Peet and filed a Bill of Complaint in a eery Suit in the style of me Bigbie and others vs ge C. Bigie and others, in Circuit Cout of the County jipomattox, state of Virginia, moon easily in less than ifh parcel of land is situated loverhill Magisterial District tppomattox County, Virginia lies about four miles west of village of Vera in the said nty, and which parcel of land ains 132 acres, 3 rods and"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "land is situated loverhill <mark>Magisterial</mark> <mark>District</mark> tppomattox County, Virginia lies"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "land is situated loverhill <mark>Magisterial</mark> <mark>District</mark> tppomattox County, Virginia lies"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [302.85, 1688.71, 796.22, 1999.46], "bbox_id": "ee8ce23b65", "file": "AppomattoxNewspapers_1892-1898a_0502.pdf", "page": 1, "text": "tures, West Appomattox, Va. T he T imes -We have met the enemy and they Ire ours, Rustburg Magisterial District captured by the drys, by a majority of 176, is the report that was flashed through Campbell county last Saturday. Concord precinct contributed 146 of this majority, and was largely due to the almost solid dry rotes ot the brethren in blacir, led by their ven erable and honorable shepherd, Rev. John Smith apd several of, his assist ants, Mr. William Steele, of this place, took Mrs. James Litchford to the Western Lunatic Asylum at Staun ton on the 12th inst, and returned Friday a. m., apcopipauied. by Miss Mattie Camdcrij Of the Plum Branch neighborhood, in this connty, tall restored, and honorably discharged. This young lady was conveyed there last Noyember, and he.r rapid restor ation speaks well for the treatm ut received by the inmates of that iu-"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "they Ire ours, Rustburg <mark>Magisterial</mark> <mark>District</mark> captured by the drys,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "they Ire ours, Rustburg <mark>Magisterial</mark> <mark>District</mark> captured by the drys,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1218.49, 832.63, 1314.48, 1283.47], "bbox_id": "b207fdc4d2", "file": "AppomattoxNewspapers_1955-1957a_0005.pdf", "page": 1, "text": "TRUSTEES SAT Pursuant to authority! the undersigned Trustee of that certain deed of July 29th., 1947, of reJ Clerks Office of the C of Appomattox County, D. B. 48, at Page 359, Norton J. Phelps, that fault having been made ment of the indebtedn secured, and upon reqo holder of said obligation trust be executed, and i ty with the terms ther lowing described real es offered for sale. DESCRIPTION That certain tract or! land with the improvem on, lying and being in Magisterial District of County, Virginia, about miles north of Appoint House, on the west sidej way No. 26, leading fr mattox to Bent Creek, V more particularly dear lows Beginning at a poi northwest side of High leading from Appomat  House to Bent Creek, V ner of Thomas R. Phel A. Booker thence noit along the line ot M. A. Walter Bergman to cot Walton at John Walton estimated distance of thence along Wiltons northeast diretefen to  of Thomas R. fWP distance of 175 yari east with other lands of Phelps for a distance ofj, yards at a corner with"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of County, Virginia, about"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of County, Virginia, about"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1710.23, 761.58, 1867.15, 1308.9], "bbox_id": "c4a89f24de", "file": "TimesVirginian_1981a_0341.pdf", "page": 1, "text": "TRUSTEES SALE VALUABLE REAL ESTATE Pursuant to a Deed of Trust from Arco Manufacturing Co mpany, a Pennsylvania Cor poration, to W. M. Abbitt and W. S. Kerr, Trustees, dated March 29,1979, and recorded in the Clerks Office of the Circuit Court of Appomattox County on April 24,1979, in Deed Book 141, Page 87, the hereinafter described real e sta te was conveyed in tru st to the aforem entioned T rustees to secure a Deed r i Trust Note r i even date and, the said Deed of Trust Note now being in default and, upon request of. the Noteholder, the Farm ers Na tional Bank, r i Appomattox,  Virginia,, t he undersigned Tr ustees shall offer for sale, on Saturday, October 17,1961, at 1100 a.m.. on the oremises, the  following described real estate All of tb it certain lot or parcel of land, lying and being in the Cloverhill Magisterial District of Appomattox County, Virginia, fronting on State Secondary Road 695, contain ing, 5.04 acres, more or less, this being a conveyance by the boundary and not by the acre, and shown on a plat of survey made by Ralph P. Hines, C.L.S., dated April 21, 1976, which plat is recorded in the Clerics Office r i the Circuit Court of Appomattox County in Deed Book 181, at Pige 487. Being the same real estate conveyed unto Areo, by deed bearing date on the 13th day r i March, 1979, which deed is recorded in the aforesaid Clerks Office in Deed Book 140, Page 657. TERMS OF SALE Ten Percent 10 as Bidders D eposit on Day of Sgle Balance in thirty 80 days from"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in the Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in the Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2185.35, 244.93, 2330.29, 868.91], "bbox_id": "cf8adaf846", "file": "AppomattoxNewspapers_1962-1965a_0380.pdf", "page": 1, "text": "TRUSTEES SALE Pursuant to authority vested in the undersigned Trustee by virtue of that certain Deed of Trust, dated November 10th, 19- 61, executed Oy Samuel R. Woodson and Mrs. Thelma G, Woodson, recorded on Novem ber 13th, !961, in the Clerks Of fice of the Circuit Count of Ap pomattox County, Va., in D. B. 75, at Page 88 that whereas default having been made In the payment of the indebtedness therein secured, and upon re quest by the holder of said obli gation that said trust be execut ed, and in conformity theneiwth, the following real estate will be offered for sale in compliance with the terms and conditions of the aforementioned instru ment Plae of Sale On The Premises Time of Sale 1030 a.m. Satur- D a y , April 25th, 1964 Terms of Sale Cash Auctioneer Percy W. George DESCRIPTION All of that certain lot and parcel of land situated about one and ore-half l2- miles Northwest of Appomattox Court House, in Southside Magisterial District of Appomattox County, a., front ing on Highway No. 460, con taining 1.543 acres, according to a certain plat thereof, of record wth a certain deed in D. B. 55, at Page 447, wherein said prop erty is further described as fol lows Beginning at a stake in the North Rt. Wy. line of Highway No .460 at a point where the West line of the 20 ft. Out-Let Road intersects same at Cor! 1 thence with said Qut-Let Road N. 3 Deg. 45 Min. W. 528 ft. to a stake in the Matthews line at Cor. 2 thence with him N. 89 Deg. 30 Min. W. 125 stake at Cor. 3 thence a new line S. 3 Deg. 45 Min. E. 577.7 ft. to a stake in Highway Rt. Wy. line at Cor. 4 thence with said Highway N. 77 Deg. 45 Min. E . 125 ft to the beginning, enclosing in all 1.543 Acres. This is very desirable resident ial property, subject to inspect ion by interested parties prior to said sale. Wm. W. Burke Trustee 3-26-5t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1897.51, 765.76, 2043.11, 1398.06], "bbox_id": "1e477a0ac4", "file": "AppomattoxNewspapers_1962-1965a_0371.pdf", "page": 1, "text": "TRUSTEES SALE Pursuant to authority vested in the undersigned Trustee by virtue of that certain Deed of Trust, dated November 10th, 19- 61, executed by Samuel R. Woodson and Mrs. Thelma G. Woodson, recorded on Novem ber 13th, 1961, in the Clerks Of fice of the Circuit Court of Ap pomattox County, Va., in D. B. 75, at Page 88 that whereas default having been made in the payment of the indebtedness therein secured, and upon re quest by the holder of said obli gation that said trust be execut ed, and in conformity thereiwth, the following real estate will be offered for sale in compliance with the terms and conditions of the aforementioned instru ment Plae of Sale On The Premises Time of Sale 1030 a.m. Satur- DAY, April 25th, 1964 Terms of Sale Cash Auctioneer Percy W. George DESCRIPTION All of that certain lot and parcel of land situated about one and one-half l !2- miles Northwest of Appomattox Court House, in Southside Magisterial District of Appomattox County, a., front ing on Highway No, 460, con taining 1.543 acres, according to .a certain plat thereof, of record with a certain deed in D. B. 55, at Page 447, wherein said prop erty is further described as fol lows Beginning at a stake in the North Rt. Wy. line of Highway No .460 at a point where the West line of the 20 ft. Out-Let Road .intersects same at Cor. 1 thence with said Out-Let Road N. 3 Deg. 45 Min. W. 528 ft. to a stake in the Matthews line at Cor. 2 thence with him 1J. 89 Deg. 30 Min. W. 125 feet to a stake at Cor. 3 thence a new line S. 3 Deg. 45 Min. E. 577.7 ft. to a stake in Highway Rt. Wy. line at Cor. 4 thence with said Highway N. 77 Deg. 45 Min. E. 125 ft to the beginning, enclosing in all 11.543 Acres. This is very desirable resident ial property, subject to inspect ion by interested parties prior to said sale. I Wm. W. Burke Trustee 3-26-."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [931.18, 756.14, 1106.61, 1540.85], "bbox_id": "1ff5ffe508", "file": "AppomattoxNewspapers_1960-1962b_0454.pdf", "page": 1, "text": "TRUSTEES SALE Pursuant to authority vested in the undersigned Trustee by vir- tune of that certàin Deed of Trust dated June 22, 1960, executed by Albert Franklin and Mrs. Ethel B. Franklin, of record or.. August 25, I960, in the Clerks Office of the Circuit Court of Appomattox Coun ty, Va., in D. B. 72, at Page 394 that whereas, default having been made in the payment of the in debtedness therein secured, ar.d in conformity therewih, the following real estate will be offered for sale in compliance with the terms and conditions of the above mention ed instrument. DESCRIPTION All of that certain tract and parcel of land situated in South- side Magisterial District of Appo mattox County, Virginia, and ly-. in between and in the  intersect ion of th Old Red House Road and the Spring Mill Road about three miles Southwest of the Town of Appomattox and beirg that identical property that was deed ed unto Irvin Hudson by deed, dat ed October 31, 1953, from Lena Arrington Stern and W. Ht. Sterne, her husband, of record in D. B. 59, at Page 360, adjoined by the real estate now or formerly owned by W. R. Arrington., Mrs. Adelia C. Ferguson, Walker Franklin, Russell Woodson and Major Rich ardson. It being that real estate that is shown on a plat of survey thereof, along with other real es tate, made by W. A. Moses, dated October 22, 1943, and being the part that is shown thereon that is situated on the Southwest sidp of the Red House Road adjoined on the North and West by the said Spring Mill Road, said plat beirg of record in said Clerks Office in D. B. 50, at Page 116, and being all of the land deeded unto the late Mrs. Mary Louise Franklin in te name of Mrs. J. W. Franklin ÉXECEPT, HOWE- EVER, the tract of land deeded unto Burke H. Franklin and wife, by deed dated December 4, 1959, of record in said Clerks Office. Itis thatidentical real estate that was deeded unto the said Al bert and Ehel B. Franklin, by deed dated, June 22nd. 19i60, from George Abbitt Jr., Special Commissioner, of record on August 25th., 1960, in D. B. 72, at Page 392. The purchaser shall have immed- iate possession. Current Taxes and Insurance to be pro-rated as of the date of sale. Place of Sale On The Premises Time of Sale 1000 A. M. Sat urday, November 18th., 1961  Terms f Sale Cash Auctioneer J. H. OBrien Trustee Wm. W. Burke. 10-19-2tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "situated in South- side <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "situated in South- side <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1369.91, 245.96, 1603.92, 650.5], "bbox_id": "dea3610a20", "file": "AppomattoxNewspapers_1962-1965a_0375.pdf", "page": 1, "text": "TRUSTEES SALE p . Beasley Sr. Pursuant to authority vested alti Beasley 9r., 72,  n the undersigned Trustee by ner, died at 715 virtue of that certain Deed of ay, in Lynchburg Trust, dated November 10th, 19- piial. He was born j 61 , executed by Samuel R. ttox County the son Woodson and Mrs. Thelma G. Wlalker and Isa-  Woodson, recorded on Novem- Beasley. He wasa ber 13  i if in ,the Clerks Of-  M!fice of the Circuit Court of Ap pomattox County, Va., in D. B. 75, at Page 88  that whereas Inge Beasley one default having been made in the Miss Dorothy D e e payment 0f the indebtedness Lynchburg t h r e e therein secured, and upon re- r p. Beasley, Jr-. I j Quest by the holder of said obli- Vernon H. Beas-igation that said trust be execut- bridge, and Thomas j ed, and in conformity thereiwth, asley, of Bedford the following real estate will be s, Prof. Titus Walker offered f0r sale in compliance Bolivar, Mo., and j vvith the terms and conditions tt Beasley, of Nor- j of the aforementioned instru- grandchildren and m ent andchild. Plae of Sale On The Premises -rvices were held at Time of Sale 1030 a.m. Satur- esday at Robinson, DAY, April 25th, 1964 e by the Revs. Win- Terms of Sale Cash and O. D. Moore. Auctioneer Percy W. George in the Beasley Pami- j DESCRIPTION Pallbearers were j All of that certain lot and parcel -nes, Richard Nash, j0f jaiK situated about one and i, Leslie Gordon, Jr.  one-half IMr miles Northwest Brien, Jack Arwood,. of Appomattox Court House, in   Southside Magisterial District of Appomattox County, a., fronit- T. P. Keesee ing on Highway No. 460, con- nda Sue Martin Kee-1 taining 1.543 acres, according to ow 0f Thomas Pierce !a certain plat thereof, of record at 8 p.m. Tuesday, I with a certain deed in D. B. 55, U her home. 1 at Page 447, wherein said prop- bom in Campbell arty is further described as fol lows Beginning"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in   Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Court House, in   Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, a.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1175.99, 1763.33, 1335.09, 1973.91], "bbox_id": "f569e576bf", "file": "AppomattoxNewspapers_1898-1902a_0149.pdf", "page": 1, "text": "TRUSTEES SALE oK VALUABLE REAL 1 ESTATE IN THE COUNTY OF BUCK INGHAM. TA. ------- By virtue of a certain d.ed of trust execut ed to me, tbe undersigned trustee, by M. E. Moss and P. li. Moss, her husband, on the 23d day of June, i89B, and recorded in tbe office of tbe clerk of the county court for the above county, in Deed-book No. 9, p. 496, at the re quest of the benetteiary named therein, de fault having been made in the paymdntof tbe debt therein secured, T Khali offer for sale, iu fnm tof tll Co,qfthoue, on MONDAY, MARCH 13,1899, at 12 oclock m ., the following property, to wit All that certain piece or -parcel of land situate, lying, and beingjn the county afore said, in the State Qt Virginia, containing 11SA acres, more, or less, in MaysviUe magisterial district, adjoining the lands of Glover Gough, William Moseley, C. I Taylor, and other it being the same tract of land that was con veyed to the grantors in said trust deed by j . B. Gilliam, special commissioner, by deed dated tbe 81st day of December, --- , recorded in Deed-book No. 9. page 367. T erms  Lash as to so much of the purchase price as may be necessary to pay the amount of money secured and costs of sale balance in one aud two years, secured by deed of trust. 8. P. VAN DEK8LICE, Trustee."}, "highlight": {"text": {"matched_tokens": ["magisterial", "district"], "snippet": "or less, in MaysviUe <mark>magisterial</mark> <mark>district</mark>, adjoining the lands of"}}, "highlights": [{"field": "text", "matched_tokens": ["magisterial", "district"], "snippet": "or less, in MaysviUe <mark>magisterial</mark> <mark>district</mark>, adjoining the lands of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [481.2, 852.6, 661.21, 1606.71], "bbox_id": "64bcddd93e", "file": "AppomattoxNewspapers_1960-1962b_0597.pdf", "page": 1, "text": "TRUSTEES SALE OF VALUABLE REAL ESTATE In execution of a deed of trust executed by Peter J. Jones, record ed in the Clerks Office of Circuit Court of Appomattox County, Vir ginia, in Deed Book 74, at page 389, the undersigned Trustees will offer for sale at public auction . . ON MAY 14, 1962 1200 OCLOCK NOON, EJ5.T. At Site of the Property DIRECTIONS TO PROPERTY  From Lynchburg, take Route No. 460 East to Appomattox. From Ap pomattox, take Route No. 460 East 5 miles. Turn right aft Davis Store on Route No. 630 Go 3 miles. Turn right on Road No. 636. Go 1 mile to lot on right. THE FOLLOWING REAL ES TATE All of that certain tract and -parcel of land, beginning at a point on Road 636 at the point of inter section of the common dividing line between Tom Jennings and Peter James Jones running thence along the said road in a Southerly direc tion 210 feet to a point and thence with this uniform width extending back in a Westerly direction 210 feet situated, lying and being in Southside Magisterial District of Appomattox County, Virginia, about ten 10 miles southeast of the Court House and being a part of the land lying on the west side of State Secondary Highway No 636, the original plat having been made by W. A. Moses, Surveyor, on AprH 5, 1912, and being of record in the Clerks Office of Appomattox Coun ty in Deed Book 13 a t page 307. It is a part of the same land that was conveyed to Glenn S. Martin by deed dated November 30, 1960 from Raymond W. Mohn, which is of record in the Clerks Office of Appomattox County in Deed Book 73 at Page 190, the land conveyed hereby is part of the land lying on the west side of State Secondary Highway No. 636, as indicated on the above mentioned plat, which has been shaded for the purposes of this transfer. Being a portion of .that property conveyed to Peter James Jones by deed dated February 3, 1961, and lof record in the Appomattox County Clerks Ofice in Deed Book 73, at Page 285. ATTRACTIVE TWO 2 BED ROOM HOME AND LOT. TERMS OF SALE 5 Down Ba lance thirty 30 days. Long Term Financing arranged on good credit references. Given under our hands this twenty-eight day of March 1962.  William A. Smith, Trustee and R. W. Gravely, Substitute Trustee 4,26,3ct"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [657.05, 861.93, 833.67, 1618.55], "bbox_id": "a7b2f42592", "file": "AppomattoxNewspapers_1960-1962b_0603.pdf", "page": 1, "text": "TRUSTEES SALE OF VALUABLE REAL ESTATE In execution of a deed of trust executed by Peter J. Jones, record ed in the Clerks Office of Circuit Court of Appomattox County, Vir ginia, in Deed Book 74,, at page 389, the undersigned Trustees will offer for sale at public auction . . , ON MAY 14, 1962 1200 OCLOCK NOON, EB.T. At Site of the Property DIRECTIONS TO PROPERTY  From Lynchburg, take Route No. 460 East to Appomattox. From Ap pomattox, take Route No. 460 East 5 miles. Turn right alb Uavis Store on Route Nd. 630 Go 3 miles. Turn right on Road No. 636. Go 1 mile to lot on right. THE FOLLOWING REAL ES TATE All of that certain tract and parcel of land, beginning at a point on Road 636 at the point of inter section of the common dividing line between Tom Jennings and Peter James Jones running thence along the said road in a Southerly direc tion 219 feet to a point and thence with  this uniform width extending back in a Westerly direction 210 feet situated, lying and being in Southride Magisterial District of Appomattox County, Virginia, about ten 10 miles southeast of the Court House and being a part of the land lying on the west ride of State Secondary Highway No 636, the original plat having been made by W. A. Moses, Surveyor, on April 5, 1912, and being of record in the Clerks Office of Appomattox Coun ty in Deed Book 13 at page 307. It is a part of the same land that was conveyed to Glenn S. Martin by deed dated November 30, 1960 from Raymond W. Mohn, which Is of record in the Clerks Office of Appomattox County in Deed Book 73 at Page 190, the land conveyed hereby is part of the land lying on the west ride of State Secondary Highway No. 636, as indicated on the above mentioned plat, which has been shaded for the purposes of this transfer. Being a portion of that property conveyed to Peter James Jones by deed dated Februbry 3, 1961, and of record in the Appomattox County Clerks Ofice in Deed Book _ 73, at Page 285. ATTRACTIVE TWO 2 BED ROOM HOME AND LOT. TERMS OF SALE 5. Down Ba lance thirty 30 days. Long Term Financing arranged on good credit references. Given under our hands this twenty-eight day of March 1962. William A. Smith, Trustee and R. W. Gravely, Substitute Trustee 1. 4,26,Set"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southride <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Southride <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [968.9, 710.68, 1137.8, 1179.55], "bbox_id": "64fe166dba", "file": "AppomattoxNewspapers_1954-1955a_0307.pdf", "page": 1, "text": "TRUSTEES SALE OF REAL ESTATE Under and by virtue of authority vested in the undersigned Trustee, by that certain deed 5f trust dated the 6th day of May, 1948, and re corded in the Clerks Office of the Circuit Court of Fauquier County, Virginia, in Deed Book 166, at page 2, from Lena G. Mayberry, widow, to George Abbitt, Jr., Trustee, to secure the payment-of a debt there in secured, default having been made in the payment of said debt, accord ing to the terms of said trust, and at the request of the holder of note secured therein, the undersigned will offer for sale at public auction, at the front door of the Court House, in the Town of Warrenton, Vir ginia, on Thursday, the 30th day of June, 1955, at twelve oclock Noon, the following described real-estate to-wit All of that certain tract or parcel of land, with the buildings and im provements thereon, and containing 22 acres and 20 square perches, by survey, and being situate in Centre Magisterial District, Fuarquier Coun ty, Virginia, about six miles from the town of Warrenton, on State Highway No. 688, just off Highway No. 211, and being the same and identical property which was convey ed to Lena G. Mayberry, by W. B. Hiner and wife, by deed dated the 24th day of June, 1944, and record ed in said Clerks Office, in Deed Book 155, at page 321, and con taining by survey 22 acres and 20 perches. Terms of Sale Cash. George Abbitt, Jr. Trustee. Latham Shumate, Auctioneer. 6-3-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being situate in Centre <mark>Magisterial</mark> <mark>District</mark>, Fuarquier Coun ty, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2187.09, 740.06, 2333.88, 1212.31], "bbox_id": "937ef93895", "file": "AppomattoxNewspapers_1962-1965a_0366.pdf", "page": 1, "text": "TRUSTEES SALE of Real Es tate, together with Improvement thereon, located in CloverhiU Magisterial District, Appomat tox County, Virginia. In execution of a certain deed of trust dated the 5th day of March, 1963, from Robert B. Smith and Rebecca Moore Smith husbard and wife, to Vernon L. Duncan and Wm. G. Talley, Trustees, either of whom may act, and recorded in the clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Book 73, at page 74, de fault having been made in the payment and being requested by the beneficiary thereunder to do so, the undersigned trustees will offer for sale at public auc tion the following real estate located in Appomattox County, Virginia, and more particularly described as follows All of that certain tract and parcel of land fronting on State Secondary Road No. 816 and lying about 4 Vi miles east of the Town of Appomattox in the Cloverhill Magisterial Dis trict and being fully shown and defined on the plat of sur- very thereafter dated January 8, 1960, made by W. W. Scott, C.L.S., and being designated on the said plat as Lewis C. and LaFern S. Tweddy, 1.- 158 acres. Adjoined on the North and on the East by the lands of one Harry W. Jenkins and on the South by the land of Joseph M. and Annie M. Slough and on the west by the above mentioned highway, said property being more par ticularly described in the above - referred to deed cf trust to which reference is made."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in CloverhiU <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in CloverhiU <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.93, 712.98, 2044.85, 1169.58], "bbox_id": "1de0b4f359", "file": "AppomattoxNewspapers_1962-1965a_0363.pdf", "page": 1, "text": "TRUSTEES SALE of Real Es tate, together with Improvement thereon, located in Cloverhill Magisterial District, Appomat tox County, Virginia. In execution of a certain deed of trust dated the 5th day of March, 1963, from Robert B. Smith and Rebecca Moore Smith husband and wife, to Vernon L. Duncan and Wm. G. Talley, Trustees, either of whom may act, and recorded in the clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Book 78, at page 74, de fault having been made in the payment and being requested by the beneficiary thereunder to do so, the undersigned trustees will offer for sale at public auc tion the following real estate located in Appomattox County, Virginia, and more particularly described as follows All of that certain tract and parcel of land fronting on State Secondary Road No. 616 and lying about 4 2 miles east of the Town of Appomattox in the Clovefmn Magisterial Dis trict and being fully shown and defined on the plat of sur- very thereafter dated January 8 , 1960, made by W. W. Scott, C.L.S., and being designated on the said plat as Lewis C. and LaFern S. Tweddy, 1.- 158 acres. Adjoined on the North and on the East by the lands of one Harry W. Jenkins I and on the South by the land of Joseph M. and Annie M. Slough and on the west by the above mentioned highway, said property being more par ticularly described in the above - referred to deed cf"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.74, 1683.39, 1890.49, 1796.79], "bbox_id": "061799157b", "file": "AppomattoxNewspapers_1962-1965a_0356.pdf", "page": 1, "text": "TRUSTEES SALE of Real Es tate, together with Improvement thereon, located in Cloverhill Magisterial District, Appomat tox County, Virginia. In execution of a certain deed of trust dated the 5th day of March, 1963, from Robert B. Smith and Rebecca Moore Smith husband and wife, to Vernon L. Duncan and Wm. G. Talley, Trustees, either of whom may"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "thereon, located in Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomat tox County, Virginia."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [278.14, 254.5, 424.06, 986.55], "bbox_id": "44d1c5a522", "file": "TimesVirginian_1976_0188.pdf", "page": 1, "text": "Trustees Sale of Property Lsrefti In CloverhOl Magister ial District of Appomattox County, Virginia  . In execution of s Deed, of Trust from Stephen D. Goode and Mable J. Goode, his wife dated June 15. 1973 and recorded that same day in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 112, Page 496, the undersigned Trustee or Substi tute Trustee will offer for sale at public auction at the Courthouse door in Appomat tox County, Virginia, on the 10th day of June, 1976, at 11 a.m., the property described in said Deed of Trust and being all of that certain lot or parcel of land located in Cloverhill Magisterial District of Appo-. mattox County, Virignia, as follows All of that certain tract or parcel of real estate, belonging, lying ad being in Cloverhill Magisterial District of Appo mattox County, Virginia, and being more particularly de scribed on a certain sub-divi sion plat of survey entitled Meadow Lark Sub-Division. made by Ralph P. Hines. C.LJS., dated February 14. 1972, revised March 28, 1972, and revised June 19, 1972 and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia in Plat Book 1, at pages 2 and 4, and being designated on the said plat of survey as Lot No. 17, to which plat reference is hereby made and the metes and bounds description is incorporated herein and made a part hereof for a more accurate description of the real estate hereby conveyed. Being the same real estate conveyed to the parties of the first part by a deed dated and to be recorded in the aforesaid Clerks Office just prior to this deed of trust to which reference is hereto made. TERMS Cash. Minimum of 10 of sale price on date of sale, balance within ten 10 days or upon delivery of the Deed. Title will be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER , ,  5-6-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo-. mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo-. mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.44, 223.98, 1800.47, 893.71], "bbox_id": "ba2867b643", "file": "TimesVirginian_1976_0172.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY located in Clover Hill Magisterial District of Appo mattox County, Virginia. In execution of a Deed of Trust from Elbert S. Presnell and Mary F. Presnell, his wife, dated July 2, 1974, and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Deed Book 118, page 232, the undersigned Trustees, will offer for sale at public auction on premises, on the 14th day of May, 1976, at 1200 noon, the property described in said deed of trust and being all of that certain lot or parcel of land, and the appurtenances thereunto belonging, located in Clover Hill Magisterial District, Appo mattox County Virginia, as follows All of that certain 2.33 acre tract being southwest of Pamplin City, and being bounded on the north by E. T. Davis, on the west by property now or formerly owned by R. R. Davis, on the south by W. J. Payne, on the east by Farrar and State Route 1104 it being more particularly described on a plat made by Ralph P. Hines, C. L.S., dated May 31,1974, and of record in the Clerks Office of the Circuit Court of Appomat tox County, Virginia and being the same property conveyed unto Elbert S. Presnell and Mary F. Presnell, his wife, by deed dated July 2, 1974 from Frederick A. Tanner and Eulda L. Tanner, and of record in the aforesaid Clerks Office in Deed Book 118, page 230. Sale is subject to easments, covenants, conditions and re strictions of record. TERMS CASH Minimum of 10 of sale price on date of sale, balance upon delivery of deed. Title will be conveyed by Trustees Deed upon payment of balance. William G. Whitter and Marshall L. Ellett, TRUSTEES 104A North Main Street Farmville, Virginia 23901 _ _______________ 4-22-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "located in Clover Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "located in Clover Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1967.74, 231.43, 2120.37, 1155.59], "bbox_id": "9f490121fd", "file": "TimesVirginian_1976_0428.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY LOCATED IN CLOV- ERHILL MAGISTERIAL DIS TRICT OF APPOMATTOX COUNTY, VIRGINIA  In execution of a Deed of Trust from Dorothy N. Austin, dated June 3, 1974, and recorded June 3, 1974, in the ClerkY Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 117, Page 442, the undersigned Trustee of Substitute Trustee will offer for sale at public auction at the Courthouse floor in Appomattox County, Vir ginia, on the 7th day of December, 1976, at 1100 A JI., the property described in said Deed of Trust and being all of that certain lot or parcel of land located in Cloverhill Magister ial District of Appomattox County, Virginia, as follows All that certain tract or parcel of real estate, belonging, lying and being in Cloverhill Magisterial District of Appo mattox County, Virginia, front ing on Steven Street, contain ing 0.50 acres, and designated as Lot No. 9 on a certain plat of subdivision entitled Meadow Lark Subdivision, made by Ralph P. Hines, C.L.S., dated February 14, 1972, and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Plat Book 1 at page 2, and being described thereon as follows Beginning at an iron marker on the West edge of Steven Street to corner with Lot No.  thence S. 50 50 W. 144.58 ft. to an iron marker thence S. 32 15 E. 99.16 ft. to an iron marker thence in the division line with Lot No. 10, No. 52 30 E. 155.09 ft to an iron marker on the South edge of Steven Street thence in an arc along Steven Street in a Northwest erly dirertion, for a distance of 102.97 ft. to an iron marker to corner with Lot No. 8, at the point of beginning. And being the same idential real estate conveyed to Dorothy N. Austin, single, be David S. Nash and Marion D. Nash, husband and wife, by Deed dated 24 May, 1974, to be recorded immediately preced ing the recording of this Deed of Trust. This conveyance is made subject to a right of way and easement granted to Virginia Electric  Power Company, of record in Deed Book 110 at page 133, and is further subject to a right of way and easement granted to the Commonwealth of Virginia, of record in Deed Book 107 at page 469. TERMS Cash Minimum of 10 of sale price on date of sale, balance within ten 10 days. Title will be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER Trustee ll-4-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1839.85, 256.67, 1989.29, 1182.53], "bbox_id": "70eecf9f13", "file": "TimesVirginian_1976_0399.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY LOCATED IN CLOV- ERHILL MAGISTERIAL DIS TRICT OF APPOMATTOX COUNTY, VIRGINIA - In execution of a Deed of Trust from Dorothy N. Austin, dated June 3, 1974, and recorded June 3. 1974, in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 117, Page 442, the undersigned Trustee of Substitute Trustee will offer for sale at pubUc auction at the Courthouse door in Appomattojy County, Vir ginia, on the 7th day of December, 1978, at 1100 AM., the property described in said Deed of Trust and being aU of that certain lot or parcel of land located in CloverhiU Magister ial District of Appomattox County, Virginia, as follows AU that certain tract or parcel of real estate, belonging, lying and being in CloverhiU Magisterial District of Appo mattox County, Virginia, front ing on Steven Street, contain ing 0.50 acres, and designated as Lot No. 9 on a certain plat of subdivision entitled Meadow Lark Subdivision, made by Ralph P. Hines, CJL.S., dated February 14, 1972, And recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Plat Book 1 at page 2, and being described thereon as foUows Beginning at an iron marker on the West edge of Steven Street to corner with Lot No. 8 thence S. 50 50 W, 144.58 ft. to an iron marker thence S. 32 15 E. 99.16 ft. to an iron marker thence in the division line with Lot No. 10, No. 52 30 E. 155.09 ft to an iron marker on the South edge of Steven Street thence in an arc along Steven Street in a Northwest erly direction, for a distance of 102.97 ft. to an iron marker to corner with Lot No. 8 , at the point of beginning. And being the same idential real estate conveyed to Dorothy N. Austin, single, be David S. Nash and Marion D. Nash, husband and wife, by Deed dated 24 May, 1974, to be recorded immediately preced ing the recording of this Deed of Trust. This conveyance is made shfyject to a right of way and easement granted to .Virginia Electric  Power Company, of record in Deed Book 110 at page 133, and is further subject to a right of way and easement granted to the Commonwealth of Virginia, of record in Deed Book 107 at page 469. TERMS Cash Minimum of 10  of sale price on date of sale, balance within ten  10  days. Title wUl be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER Trustee ll-4-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in CloverhiU <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in CloverhiU <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1031.41, 459.44, 1179.13, 1386.09], "bbox_id": "745e549d3e", "file": "TimesVirginian_1976_0419.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY LOCATED IN CLOV- ERHILL MAGISTERIAL DIS TRICT OF APPOMATTOX COUNTY, VIRGINIA -- In execution -of a Deed of Trust from Dorothy N. Austin, dated June 3, 1974, and recorded June 3, 1974, in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 117, Page 442, the undersigned Trustee of Substitute Trustée will offer for sale at public auction at the Courthouse door in Appomattox County, Vir ginia, on the 7th day of December, 1976, at 1100 A.M., the property described in said Deed , of Trust and being all of that certain lot or parcel of land located in Cloverhill Magister ial District of Appomattox County, Virginia, as follows All that certain tract or parcel of real estate, belonging, lying and being in Cloverhill Magisterial District of Appo mattox County, Virginia, front ing on Steven Street, contain ing 0.50 acres, and designated as Lot No. 9 on a certain plat of subdivision entitled Meadow Lark Subdivision, made by Ralph P. Hines, C.L.S., dated February 14, - 1972, and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Plat Book 1 at page 2, and being described thereon as follows Beginning at an iron marker on the West edge of Steven Street to corner with Lot No. 8 thence S. 50 50 W. 144.58 ft. to an iron marker thence S. 32 15 E. 99.16 ft. to an iron marker thence in the division line with Lot No. 10, No. 52 30 E. 155.09 ft to an iron marker on , thefSouth edge oi Steven Street thence in an arc along Steven Street in a Northwest erly direction, for a distance of 102.97 ft. to an iron marker to corner with Lot No. 8, at the point of beginning. And being the same idential real estate conveyed to Dorothy N. Austin, single, be David S. Nash and Marion D. Nash, husband and wife, by Deed dated 24 May, 1974, to be recorded immediately preced ing the recording of this Deed of Trust. This conveyance is made subject to a right of way and easement granted to Virginia Electric  Power Company, of record in Deed Book 110 at page 133, and is further subject to a right of way and easement granted to the Commonwealth ,of Virginia, of record in Deed Rook 107 at page 469. TERMS Cash Minimum of 10 of sale price on date of sale, balance within ten 10 days. Title will be conveyed by Trustees Deed upon payment of balance.  MARION V. BAKER Trustee ______ ll-4-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1337.76, 260.3, 1501.93, 1185.41], "bbox_id": "38290d33c4", "file": "TimesVirginian_1976_0410.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY LOCATED IN CLOV- ERHIi.l, MAGISTERIAL DIS TRICT OF APPOMATTOX COUNTY, VIRGINIA - In  execution of a Deed of Trust I gfrom Dorothy N. Austin, dated June 3, 1974, and recorded June 3, 1974, in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 117, Page 442, the undersigned Trustee of Substitute Trustee will offer for sale at public auction at thé Courthouse door in Appomattox County, Vir- ftginia, on the 7th day of December, 1976, at 1100 A.M., the property described in said Deed of Trust and being aU of that certain lot or parcel of land located in Cloverhill Magister ial District of Appomattox County, Virginia, as foHows All that certain tract or parcel of real estate, belonging, lying and being in Cloverhill b Magisterial District of Appo- 1 mattox County, Virginia, front ing on Steven Street, contain ing 0.50 acres, and designated as Lot No. 9 on a certain plat of subdivision entitled Meadow Lark Subdivision, made by Ralph P. Hines, C.L.S., dated February 14, 1972, and recorded in the Clerks Office of the Circuit Court of Appomat- ly tox County, Virginia, in Plat Book 1 at page 2, and being described thereon as follows Beginning at an iron marker on the West edge of Steven Street to corner with Lot No.  thence S. 50 50 W. 144.58 ft. to an iron marker thence S. 32 15 E. 99.16 ft. to an iron marker thence in the division line with Lot No. 10, No. 52 30 f E. 155.09 ft to an iron marker on the South edge of Steven Street thence in an are along Steven Street in a Northwest erly direction, for a distance of 102.97 ft. to an iron marker to corner with Lot No. 8, at the point of beginning. And being the same idential real estate conveyed to Dorothy N. Austin, single, be David S. Nash and Marion D. Nash, husband and wife, by Deed dated 24 May, 1974, to be recorded immediately preced ing the recording of this Deed of Trust. This conveyance is made subject 6 a right of way and easement granted to Virginia Electric  Power Company, of record in Deed Book 110 at page 133, and is further subject to a right of way and easement granted to the Commonwealth ,of Virginia, of record in Deed Book 107 at page 469. TERMS Cash Minimum of 10 of sale price on date of sale, balance within ten 10 days. Title will be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER Trustee ll-4-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in Cloverhill b <mark>Magisterial</mark> <mark>District</mark> of Appo- 1 mattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in Cloverhill b <mark>Magisterial</mark> <mark>District</mark> of Appo- 1 mattox"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.05, 214.4, 1658.07, 884.62], "bbox_id": "8473a2d614", "file": "TimesVirginian_1976_0160.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO PERTY locate in Clover Hill Magisterial District Off Appo mattox County, Virginia In execution of a Deed of Trust from Elbert S Presnell and Mary F- Presnell, his wife, dated July 2, 1974,- and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Deed Book 118, page 232, the undersigned T rustees, will offer for sale at public auction on premises, on the 14th day of May, 1976, at 1200 noon, the property described in said deed of trust and being all of that certain lot or parcel of land, and the appurtenances thereunto belonging, located in Clover Hill Magisterial District, Appo mattox County, Virginia, as follows All of that certain 2.33 acre tra c t being southw est of Pam plin City, and being bounded on the north by E. T. Davis, on the west by property now or formerly owned by R. R. Davis, on the south by W. J. Payne, on the east by Farrar and State Route 1104 it being more particularly described on a plat made by Ralph P. Hines, C. L.S., dated May 31,1974, and of rechrd in the Clerks Office Of the Circuit Court of Appomat tox County, Virginia and being the same property conveyed unto Elbert S.. Presnell and Mary F. Presnell, his wife, by. deed dated July 2, 1974 from Frederick A. Tanner and Eulda L. Tanner, and of record in the aforesaid Clerks Office in Deed Book 118, page 230. Siale is subject to easments, covenants, conditions and re strictions of record. TERMS CASH Minimum of 10 of sale price on date of sale, balance upon delivery of deed. Title wifi be conveyed by Trustees Deed upon payment of balance.   William G. W hitter and Marshall L. Ellett, TRUSTEES 104A North Main Street Farmville, Virginia 23901 4-22-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "locate in Clover Hill <mark>Magisterial</mark> <mark>District</mark> Off Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "locate in Clover Hill <mark>Magisterial</mark> <mark>District</mark> Off Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1345.43, 201.45, 1510.73, 711.57], "bbox_id": "226102665c", "file": "TimesVirginian_1976_0134.pdf", "page": 1, "text": "TRUSTEES SALE OF PRO- ItPERTY located in Clover Hill Magisterial District of Appo mattox County, Virginia. In execution of a Deed of Trust from Elbert S. PresneU and Mary F. Presnell, bis wife, dated July 2, 1974, and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Deed Book 118, page 232, the undersigned T rustees, will offer for sale at public auction on premises, on the 14th day of May, 1976, at 1200 noon, the  property described in said deed of trust and being all of that I certain lot or parcel of land, and the appurtenances thereunto belongings located in Clover Hill Magisterial District, Appo- w mattox County, Virginia, as Iwiollows t  All of that certain 2.33 acre trac t being southw est of Paifiplin City, and being bounded on the north by E. T. Davis, on the west by property now or formerly owned by R. R. Davis, on the south by W. J. I Payne, on the east by Farrar and State Route 1104 it being 1 more particularly described on 1 a plat made by Ralph P. Hines, C. L.S., dated May 31,1974, and of record in the Clerks Office of the Circuit Court of Appomat tox County, Virginia and being the sam property conveyed I unto Elbert S. Presnell and 5 Mary F. Presnell, his wife, by I"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "located in Clover Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "located in Clover Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [740.65, 495.98, 902.65, 1309.5], "bbox_id": "1c54f154d4", "file": "TimesVirginian_1978_0264.pdf", "page": 1, "text": "TRUSTEES SALE OF House and land, situated in the Southside Magisterial District, of Appomattox County, Vir ginia, and within the corporate lim its of the Town of Appomattox, located at the intersection of Court Street and Lee-Grant Avenue in said Town, being a portion of Lots, No. 3,4,5, and 6 of Section A, as shown on a plat of Subdivision of Hunter Addi tion to the Town of Appomat tox, and Lots No. 7 and 8 , respectively, containing 0.255 acres, as shown on a plat of Clement Subdivision, made by W.W. Scott, C.L.S., and being the same real estate conveyed to Richard L. Harrison and Mary G .Harrison, husband and wife, by deeds dated Septem ber 2,1975, by R. David Jones, et ox, et als, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Books 124 at page 56, and Deed Book 124 at page 58. In execution of Deeds of Trusts, Richard L. Harrison, Sr. and Mary C. Harrison, husband and wife, dated 25 August, 1975, and 29 July, 1977, respectively, and record ed in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Books 124 at page 60, and Deed Book 132 at page 436, respectively, the undersigned Trustee will offer for sale, at public auction, on the premises,, Sil , those parcels. iq f ,r a s L   .    buildings and improveiflents thereon, located within the corporate limits of the Town of Appomattox, at the intersec tion of Court S treet and Lee-Grant Avenue in said town, and being the same real estate conveyed to Richard L. Harrison and Mary C. Harrison, husband and wife, by deeds, dated September 2,1975, by R. David Jones, et ux, et als, and recorded in the aforesaid Clerks Office in Deed Books 124 at page 56, and Deed Book 124 at page 58, said property having tax map identification as 72LL 75M 62 and72LL 75MI 622. The real estate above described will be sold at public auction on Saturday, June 10, 1978 at 1000 A.M. Terms 10 down balance in cash upon delivery of deed. ROBERT W. CARTER, Trustee 203 N. Church Street Appomattox, Virginia 24522 Phone 804 352-7901"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Southside <mark>Magisterial</mark> <mark>District</mark>, of Appomattox County, Vir"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Southside <mark>Magisterial</mark> <mark>District</mark>, of Appomattox County, Vir"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1507.44, 179.89, 1661.51, 962.9], "bbox_id": "34311e8e40", "file": "TimesVirginian_1978_0231.pdf", "page": 1, "text": "TRUSTEES SALE OF Hnuae and laud, situated in the Sontiiride Magisterial District, of Appomattox County, Vir ginia, and within the corporate lim its of the Tow of Appomattox, located at the intersection of Court Street and Lee-Grant Avenue in said Town, being a portion of Lota, No. 3,4,5, and 6 of Section MA,W ns shown on n pint of Subdivision of Hunter Addi tion to the Town of Appomat tox, and Lots No. 7 and 8, respectively, containing 0.255 acres, as shown on a plat of Clement Subdivision, made by W.W. Scott, C.L.S., and being the same real estate conveyed to Richard L. Harrison and Mary G .Harrison, husband and wife, by deeds dated Septem ber 2, 1975, by R. David Jones, et ox, et als, and recorded in the Clerks Office sf the Circuit Court of Appomattox County, Virginia, in Deed Boohs 124 at page 56,and Deed Book 124 at page 58. In execution of Dfeeds of Trusts, Richard L. Harrison, Sr. and Mary C. Harrison, husband and wife, dated 25 August, 1975, and 29 July, 1977, respectively, and record ed in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Books 124 at page 60, and Deed Book 132 at page 436, respectively, the undersigned Trustee will offer for sale, at public auction, on the premises, all those parcels of real estate, including buildings and improvements thereon, located within the corporate limits of the Town of Appomattox, at the intersec tion of Court S treet and Lee-Grant Avenue in said town, and being the same real estate to Richard L. Harrison and Mary C. Harrison, husband and wife, by deeds, dated September 2,1975, by R. David Jones, et ux, et als, and recorded in the aforesaid Clerks Office in Deed Books 124 at page 56, and Deed Book 124 at page 58, said property having tax map identification as 72LL 75M 62 and72LL 75MI 622. The real estate above described will be sold at public auction on Saturday, June 10, 1978 at 1000 A.M. Twins 10 down balance in cash upon delivery of deed. ROBERT W. CARTER, __ , Trustee"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Sontiiride <mark>Magisterial</mark> <mark>District</mark>, of Appomattox County, Vir"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Sontiiride <mark>Magisterial</mark> <mark>District</mark>, of Appomattox County, Vir"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1335.78, 380.73, 1468.83, 482.68], "bbox_id": "4949942207", "file": "AppomattoxNewspapers_1971-1973a_0617.pdf", "page": 1, "text": "TRUSTEES SALE OF BRIcJ RESIDENTIAL DWELLIM AND 0.72 AND 0.53 ACRg PARCELS, T O W N OL P A M P L I N , CLOVERHILI MAGISTERIAL DISTRICT! APPOMATTOX COUNTY, Vi ON PREMISES FEBRli ARY 3, 1973 AT 12 NOON."}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "L I N , CLOVERHILI <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>! APPOMATTOX COUNTY, Vi ON"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "L I N , CLOVERHILI <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>! APPOMATTOX COUNTY, Vi ON"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1120.29, 986.94, 1285.52, 1080.43], "bbox_id": "c9d329965f", "file": "AppomattoxNewspapers_1912-1915a_0555.pdf", "page": 1, "text": "TRUSTEES SALE Of .a very valuable flour and corn mill, situa ted in Clover Hill Magisterial District, Ap- E omattox County, about four miles and a alf from Appomattox Depot, situated on a tract of land containing iai aeres, .more or less, known-as Andersons Mill. a . By virtue of a deed of trust .executed. to me as Trustee on the 1st day of January, 1907. by J. T. Turns, and recorded in Appo mattox Clerks Office in Deed Book No. 9, age 210 and being required so to do by .B."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "ted in Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Ap- E omattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "ted in Clover Hill <mark>Magisterial</mark> <mark>District</mark>, Ap- E omattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1989.6, 779.16, 2150.52, 1059.02], "bbox_id": "8ddf15500d", "file": "AppomattoxNewspapers_1908-1909a_0409.pdf", "page": 1, "text": "Trustees Sale l  As Trustee in a certain deed of truBt, of record in the Clerks Office of Appomattox County, in Deed Book 27, page 399, default having been made therein, and the beneficiary having requested the execution of the trust there in et out, I shall offer for sale, at public auction, at the front door of the Court House, at Ap pomattox, on Friday, February 8, 1929 at 4 P. M-, that farm, known as the old Haynes Place in South side Magisterial District, and containing 231 acres, more or ess. , Terms Purchaser to assume a Joan of about 1.000.00 to Feder al Land Bank of Baltimore, Md. balance cash. Taxes, insurance And rents pro-rated as of day of sale. LEON GOODMAN, Trustee- l-24-3t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Place in South side <mark>Magisterial</mark> <mark>District</mark>, and containing 231 acres,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Place in South side <mark>Magisterial</mark> <mark>District</mark>, and containing 231 acres,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2382.0, 924.66, 2546.41, 1216.41], "bbox_id": "656fa5c292", "file": "AppomattoxNewspapers_1962-1965a_0619.pdf", "page": 1, "text": "TRUSTEES SALE In execution of a deed of trust from Joseph D. Wright to Chas. F. P. Crawley, Trustee, of Ap pomattox, Virginia, dated 11- 27-63 - of record in the Clerks office of Appomattox County, Virginia, In Deed Book 80, at Page 160, conveying the prop perty hereinafter described, default having been made In the payment of the debt there by scured, and at the direct ion of the beneficiary there under, the undersigned will sell at PUBLIC AUCTION On The Stem of The Court Appomattox, Virginia, On April 16, 1965, at 10 00 a.m. All of that certain tract or par cel of real estate lying and being in Stonewall Magisterial District of Appomattox County, Virginia, located on the west side of Sec ondary Road lfp 613, about three 3 miles northwest of the Tc-wn of Appomattox, and ad joining the l a n d s V . L. and Con-1 John Gillette, Jarrihp Phillips, Walter Henry, W. L. Williamson,"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "and being in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "and being in Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.0, 261.65, 1664.34, 981.57], "bbox_id": "9b381f851f", "file": "TimesVirginian_1976_0183.pdf", "page": 1, "text": "Trustees Sale ef Property Located In Cloverhill Magister ial District ef AppnttfX County, Virginia In execution of a Deed o f Trust from Stephen D. Goode and M atte J. Goode, his wife dated Jim e 15, 1973 aifd recorded that same day in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 1Î2, Page 496, the undersigned Trustee or Substi tute Trustee will offer for sale at public auction a t the Courthouse door in Appomat tox County, Virginia, on the 10th day of June, 1976, at 11 a.m the property described in said Deed of Trust and being all of that certain lpt or parcel of land located in Cloverhill Magisterial District of Appo mattox County, Virignia, as follows All of that certain tract or parcel of real estate, belonging, lying and being in Cloverhill Magisterial District of Appo mattox County, Virginia, and being more particularly de scribed on a certain sub-divi sion plat of survey entitled Meadow Lark Sub-Division. made by Ralph P. Hines, C.L.S., dated February 14, 1972, revised March 2f 1972, and revised June 19, 1V?2 and recorded in the Clerks Office of the Circuit Court of Appomat tox County, v Virginia in Plat Book 1, at pages 2 and 4, and being designated on the said p u t of survey as Lot No. 17, to which plat reference is hereby made and the metes and bounds description is incorporated herein and made a part hereof for a more accurate description of the real estate hereby conveyed. Being the same real estate conveyed to the parties of the first part by a deed dated and to be recorded in the aforesaid Clerks Office just prior to this deed of trust to which reference is hereto made. TERMS Cash. Minimum 6f 10 of sale price on date of sale, balance within ten 10 days or upon delivery of the Deed. Title will be conveyed by Trustees Deed upon payment of balance.  MARION V. BAKER"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1814.89, 251.19, 1961.28, 984.57], "bbox_id": "082b6f8667", "file": "TimesVirginian_1976_0160.pdf", "page": 1, "text": "Trustees Sale 4 Property Located In Cloverhill Magister ial District of Appomattox County, Virginia- In execution of a. Deed of Trust from Stephen D. Goode and Mable J. Goode, his wife dated June 15, 1978 and recorded that same day in the Clerks Office of the Circuit C ourt for the County of Appomattox, Virginia, in Deed Book 112, Page 496, the undersigned Trustee or Substi tute Trustee will offpr for sale at public auction at the Courthouse door in Appomat tox County, Virginia, on the 10th day of June, 1976, at 11 a.m., the property described in said Deed of Trust and being all of that certain lot or parcel of land located in Cloverhill Magisterial District of Appo mattox County, Virignia, as follows All of that certain tract or parcel of real estate, belonging, lying and being in Cloverhill Magisterial District of Appo mattox County, Virginia, and being more particularly de scribed on a certain sub-divi sion plat of survey entitled  Meadow Lark Sub-Division made by Ralph P. Hines, C.L.S., dated February 14, 1972, revised March 28, 1972, and revised June 19, 1972 and recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia in Plat Book 1, at pages 2 and 4, and being designated on the said plat of survey as Lot No. 17, to which plat reference is hereby made and the metes and bounds description - is incorporated herein and made a part hereof for a more accurate description Of the real estate hereby conveyed. Being the same real estate conveyed to the parties of the first part by a deed dated and to be recorded in the aforesaid Clerks Office just prior to this deed of trust to which reference is hereto made. TERMS Cash. Minimum of 10 of sale price on date of sale, balance within ten 10 days or upon delivery of the Deed. Title wifi be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER 5-6-41"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "land located in Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1204.76, 522.47, 1348.17, 1100.34], "bbox_id": "dce7362e12", "file": "AppomattoxNewspapers_1974-1975a_0166.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT BUCKINGHAM COUNTY. VIRGINIA la rxerath of Deeds of Trust from Wtifam M. Mc Grath, HI aad Renee B. McGrath, hnsbaad aad wife, dated November 3. 1971. and recorded m the Clerks Offi of the Grant Court of Bodring- haa County. Virgasa, hi Deed Book 85 at page 306, and Deed of Trust dated November 3, 1971. and recorded in the aforesaid Clerks Office m Deed Book 85  page 306 aad Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerks O ffi in Deed Book 89 ri page 67, the undersigned Trustee, wB offer for safe ri pubfie ancrion aB that tract or parcel, mchuliwg- buildings and improvements thereon, lying aad being in James River Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and James River, and adjoining bwfe now or formerly owned by WiBiam M. Perkins E state, Harry Perkins, Gooch Farm, Wesley R-Johnson, et ais, containing 300.11. more or less, and being the same real estate conveyed to WiBiam M. McGrath, HI and Renee B. McGrath, husband and wife, by Deed dried March 13, 1965, and recorded in the rinreami Clerks O ffi in Deed Booh 73 ri page 462. LESS. HOWEVER.an off-conveyance of 96.2 acres, fay Deed dated November 10, 1969, and re corded in the aforesaid Clerks O ffi in Deed Book 82 at page 145. Safe to be held on the premises at Id p.m. on March 1, 1975. Terns 10 down balance in cash upon delivery of Deed. Robert W. Carter, Trustee, Appomattox. Virginia l-345t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [916.59, 189.74, 1053.24, 767.12], "bbox_id": "a22aa3bd7e", "file": "AppomattoxNewspapers_1974-1975a_0205.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT BUCKINGHAM COUNTY, VIRGINIA In execution of Dejeds of Trust from William M. Mc G rath, III and Renee B. McGrath, husband and wife, dated November 3, 1971, and recorded in the Clerks Office of the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November 3, 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerks Office in Deed Book 89 at page 67, the undersigned Trustee, will offer for sale at public auction all that tract or parcel, including buildings and improvements thereon, lying and being in James River Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and James River, and adjoining lands now or formerly owned by William M. Perkins Estate, Harry Perkins, Gooch Farm, Wesley R. Johnson, et als, containing 300.11, more or less, and being the same real estate conveyed to William M. McGrath, HI and Renee B. McGrath, husband and wife, by Deed dated March 13, 1965, and recorded in the aforesaid Clerks Office in Deed Book 73 at page 462, LESS, HOWEVER,an off-conveyance of 96.2 acres, by Deed dated November 10, 1969, and re corded in the aforesaid Clerks Office in Deed Book 82 at page 145. Sale to be held on the premises at 100 p.m. on March 8 , 1975. Terms 10 down balance in cash upon delivery of Deed. Robert W. Carter, Trustee, Appomattox, Virginia 2-13-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1241.05, 232.87, 1387.73, 811.39], "bbox_id": "6c45658e04", "file": "AppomattoxNewspapers_1974-1975a_0174.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT BUCKINGHAM COUNTY. VIRGINIA In execution of Deeds of Trust from William M. Mc Grath, III and Renee B. McGrath, husband and wife, dated November 3, 1971, and recorded in the Clerks Office of , the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November 3, 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4, 1973, and recorded in the aforesaid Clerks Office in Deed Book 89 at page 67, the undersigned Trustee, will offer for sale at public auction all that tract or parcel, including buildings and improvements thereon, lying land being in James River ! Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and Jam es l River, and adjoining lands now or formerly owned by William M. Perkins E state, Harry Perkins, Gooch Farm, Wesley R. Johnson, et als, containing 300.11, more or less, and being the same real estate conveyed to William M. McGrath, III and Renee B. McGrath, husband and wife, by Deed dated March 13, 1965, and recorded in the aforesaid Clerks Office in Deed Book 73 at page 462, LESS, HOWEVER,an off-conveyance of 96.2 acres, by Deed dated November 10, 1969, and re corded in the aforesaid Clerks Office in Deed Book 82 at page 145. Sale to be held on the premises at 100 p.m. on March 1, 1975. Terms 10 down balance in cash upon delivery of Deed. Robert W. Carter, Trustee, Appomattox, Virginia l-30-5t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in James River ! <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in James River ! <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [651.11, 202.8, 814.66, 665.18], "bbox_id": "226b4fd3a3", "file": "AppomattoxNewspapers_1974-1975a_0223.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT BUCKINGHAM COUNTY. VIRGINIA In execution of Deeds of Trust from William M. Mc Grath, III and Renee B. McGrath, husband and wife, dated November 3, 197 i, and te  recorded in the Clerks Office of the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November 3, 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerks Office in Deed Book 89 at page 67, the undersigned Trustee, will offer for sale at public auction all that tract or parcel. Including buildings and improvements thereon, lying and being ih James River Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and James River, and adjoining lands now or formerly owned by William M. Perkins E state, Harry Perkins, Gooch Farm, Wesley R. Johnson, et als, containing b00.ll, more or less, and being the same real estate conveyed to William M. McGrath, III and Renee B. McGrath, husband and wife, by Deed dated March 13, 1965, and recorded in the aforesaid Clerks Office in Deed Book 73 at page 462, LESS, HOWEVER,an off-conveyance of 96.2 acres, by Deed dated"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being ih James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being ih James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2447.5, 239.27, 2590.65, 813.49], "bbox_id": "ae60832b04", "file": "AppomattoxNewspapers_1974-1975a_0188.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT BUCKINGHAM COUNTY, VIRGINIA In execution of Deeds of Trust from William M. Mc G rath, III and Renee B. McGrath, husband and wife, dated November 3, 1971, and recorded in the Clerks Office of the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November 8 , 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerics Office in Deed Book 89 at page 67, the undersigned Trustee, will offer for safe at public auction til that tract or parcel, including buildings and improvements thereon, lying and being in James River Magisterial District of Bucking- ham County, Virginia, lying on Davids Creek and Jam el River, and adjoining lands now . or formerly owned by William M. Perkins E state, H arry Perkina, Gooch Farm, Wesley R. Johnson, et ala, containing 300.11, more or less, and being  the same real estate conveyed to William M. McGrath, IH and Renee B. McGrath, husband and wife, by Deed dated March 18, 1965, and recorded in the aforesaid Clerks Office in Deed Book 78 at page 462, LESS, HOWEVER,an off-conveyance of 96.2 acres, by Deed dated November 10, 1969, and re corded in the aforesaid Clerks Office in Deed Book 82 at pago 145. Safe to be held on tne premises at 100 p.m. on March 6, 1975.. Terms 10 down balance in cash upon delivery of Deed. Robert W. Carter, Trustee, Appomattox, Virginia 2-13-41"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking- ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking- ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2411.5, 201.43, 2552.8, 778.06], "bbox_id": "b3940f25f1", "file": "AppomattoxNewspapers_1974-1975a_0199.pdf", "page": 1, "text": "TRUSTEES SALE 300.0 ACRES JAMES RIVER DISTRICT. BUCKINGHAM COUNTY, I VIRGINIA In execution of Deeds of Trust from William M. Mc Grath, III and Renee B J McGrath, husband and wife, dated November 3, 1971, and recorded in the Clerks Office of the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November 3, 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerks Office in Deed Book 89 st page 67, the undersigned Trustee, will offer for sale at public auction all that tract or parcel, including buildings and improvements thereon, lying and being in James River Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and Jam es .River, and adjoining lands now or formerly owned by William M. Perkins Estate, H arry Perkins, Gooch Farm, Wesley R. Johnson, et als, containing 300.11, more or less, and being the same real estate conveyed to William M. McGrath, III and Renee B. McGrath, husband and wife, by Deed dated March 13, 1965, and recorded in the aforesaid Clerks Office in Deed Book 73 st page 462, LESS, HOWEVERan off-conveyance of 96.2 acres, by Deed dated November 10, 1969, and re corded in the aforesaid Clerks Office in Deed Book 82 at page 145. Sale to be held on the premises st 100 p.m. on March 8, 1975. Terms 10 down balance in cash upon delivery of Deed. Robert W. Carter, Trustee, Appomattox, Virginia 2-18-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in James River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.8, 982.47, 1194.5, 1596.99], "bbox_id": "4d4298d893", "file": "TimesVirginian_1981a_0030.pdf", "page": 1, "text": "TRUSTEES SALE 230.6 Acre Farm, Appomattox County ON SATURDAY  FEBRUARY 7,1981 AT 1100 AM. ONPREMISES All those tracts or parcels of real estate, located in Southside Magisterial District of Appo mattox County Virginia, lying approximately 5 miles South of . the Town of Appomattox containing 230.6 acres, more or less, in the aggregate, being adjoined by lands now or formerly owned by Joel Cawthorne Estate, J. L. Lewis, Moses Motor Company and C. T. Evans and being the same real estate conveyed to Harvey C. Crostic, Jr. and Deborah L. Crostic, husband and wife, by deed dated September 18,1978, from Clayton C. Bryant, et ux, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Book 138, at Page 280. In execution of a Deed of Trust, dated February 8, 1980, and - recorded in the Clerks Office of the Circuit Court of Appomat tox County, Virginia, in Deed Book 145, at Page 235, the undersigned Trustee will offer for sale at public auction the above described real estate, on premises, on the 7th day of February, 1981, at 1100 A.M., the property described in said Deed of Trust. TERMS Cash 10 down upon sale, balance upon closing. Robert W. Carter, p.q.. Trustee Attorney at Law Appomattox, Virginia 24522 Phone 804 352-7901 For Information contact, . Robert W. Carter, p.q.. Trustee P.O.Box 728 Appomattox, Virginia 24522 or Clayton C.- Bryant, beneficiary  P.O.Box 702  Appomattox, Virginia 24522 Phone804352-7119   80l-14-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "estate, located in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "estate, located in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [890.4, 762.38, 1041.1, 1164.96], "bbox_id": "3c0f02d18d", "file": "TimesVirginian_1981a_0015.pdf", "page": 1, "text": "TRUSTEES SALE 230.6 Acre Farm,  AppiSdiattox County ON SATURDAY FEBRUARY 7,1981 AT 1100 A.M. ONPREMISES All those tracts or parcels of real estate, located in Southside Magisterial District of Appo mattox County, Virginia, lying approximately 5 miles South of the- Town of Appom attox, containing 230.6 acres, more or less, in the aggregate, being adjoined by lands now or form erly owned by Joel Cawthorrfptate, J. L. Lewis, Moses Motor Company and C. T. Evans and befog the same., real estate conveyed to Harvey C. Crostic, . Jr. and Deborah L. Crostic, husband and wife, by deed dated September 18,1978,  from Clayton C. Bryant, et ux, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Book 138, at Page 280. Inexecution of a Deed of Trust, dated February 8, 1980, and recorded in the Clerks Office of thè Circuit Court of Appomgt- tox County, Virginia, in Deed Book 145, at Page 235, the undersigned Trustee Trill offer for sale at public auction the above described real estate, on"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "estate, located in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "estate, located in Southside <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1218.0, 843.51, 1326.48, 1530.3], "bbox_id": "77d8d4b550", "file": "AppomattoxNewspapers_1955-1957a_0011.pdf", "page": 1, "text": "TRUSTEES SAL Pursuant to authority the undersigned Trustee of that certain deed of tr July 29th., 1947, of race Clerks Office of the Cfrc of Appomattox County, Vt D. B. 48, at Page 359, ei Norton J. Phelps, that wh fault having been made in! ment of the indebtedness! secured, and upon request! holder of said obligation t trust be executed, and in ty with the terms thereof,! lowing described real estat offered for sale. DESCRIPTION  That certain tract qr p land with the improvemeni on, lying and being in Magisterial District of Ap County, Virginia, about de- miles north of Appomatto House, on the west side oj way No. 26, leading from mattox to Bent Creek, Vi more particularly describe lows Beginning at a point northwest side of Highway! leading from Appomattox House to Bent Creek, Vir ner of Thomas R. Phelps A. Booker thence north along the line of M. A. Be, Walter Bergman to come Walton at John Waltons  estimated distance of thence along Waltons line northeast diretciop to othe, of Thomas R. Phelps an distance of 175 yprds then, east with other lnds of It Phelps for a distance of a yards at a corner with Cal Phelps and Helen B. Phelps, southwest a new line par said Highway for a diataac, bout 80 yards thence so erly a new line parallel northeastern boundry line Garage Property for a dis about 60 yards thence a northeasterly parallel witn Highway to the origin eastern bounry line  j Property to distance o j yards thence southeasterly R. J. Wright 6.60 chs. to way thence with saw southw ard an estimated J 175 yards, containing be the sa being ! teen 13 acres, or less, as same B  the boundry and n 1 It is the residue   f real estate that was deeded Norton J. PM  from , Phelps and wife, by d"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of Ap County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of Ap County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.31, 258.6, 1650.91, 981.13], "bbox_id": "9e74267add", "file": "TimesVirginian_1976_0172.pdf", "page": 1, "text": "Trustees Saks ef Property Located In Cloverhill Magister ial District , of Appomattox County, Virginia- In execution of a Deed of Trust from Stephen D. Goode and Mable J. Goode, his wife dated June 15, 1973 and recorded that same day in the Clerks Office of the Circuit Court for the County of Appomattox, Virginia, in Deed Book 112, Page 496, the undersigned Trustee or Substi tute Trustee will offer for sale at public auction at the Courthouse door in Appomat tox County, Virginia, on the 10th day of June, 1976, at 11 a.m., the property described in said Deed of Trust and being all of that certain lot or parcel of land located id Cloverhill Magisterial District of Appo mattox County, Virignia, as follows All of that certain tract or parcel of real estate, belonging, lying and being in Cloverhill Magisterial District of Appo mattox County, Virginia, and being more particularly de scribed on a certain , sub-divi sion plat of survby entitled Meadow Lark Sub-Division. , made y Ralph P. Hines, C.L.S., dated February 14, 1972, revised March 28, 1972, and revised June 19, 1972 and recorded in the Clerks Office of the Circuit C6urt of Appomat tox County, Virginia in Plat Book i, at pages 2 and 4, and being designated on the said plat of survey as Lot No. 17, to which plat reference is hereby made and the metes and bounds description is incorporated herein and made a part hereof for a more accurate description of the real estate hereby conveyed. Being the same real estate conveyed to the parties of .the first part by a deed dated and to be recorded in the aforesaid Clerks Office just prior to this deed of trust to which reference, is hereto made. TERMS Cash. Minimum of 10 of sale price on date of sale, balance within ten 10 days or upon delivery of the Deed. Title will be conveyed by Trustees Deed upon payment of balance. MARION V. BAKER"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "land located id Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "land located id Cloverhill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1228.1, 783.18, 1332.6, 1347.32], "bbox_id": "653ad1d095", "file": "AppomattoxNewspapers_1955-1957a_0019.pdf", "page": 1, "text": "TRUSTEES SAf Pursuant to authority the undersigned Trustee! of that certain deed of July 29th., 1947, of re Clerks Office of the C of Appomattox County, D. B. 48, at Page 359, Norton J. Phelps, that fault having been made ment of the indebted! secured, and upon rep holder of said obligation trust be executed, and  ty with the terms the lowing described real  offered for sale. DESCRIPTION That certain tract or land with the improve on, lying and being in Magisterial District of County, Virginia, about miles north of Appom House, on the west sid way No. 26 leading 1 mattox to Bent Creek, more particularly desc lows Beginning at a P northwest side of High leading from Appomauj House to Bent Creek, VI ner of Thomas R. A. Booker thence nortt along the line of M. AI Walter Bergman Walton at John WaH estimated distsw j I thence along Walton sj northeast diretdjn M of Thomas R. iMf Jj 1 distance of 175 I east with other AmM Phelps for s di L yards at a corn  f  Phelps and HelenB.F 6 J southwest a new 1  said Highway for  1 bout 80 yards the I erly a new line lraljj northeastern  undJ 1 Garage Property J  about 60 yardsnl 2 S j northeasterly P 1 J J Highway to the eastern bounry ine  l"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of County, Virginia, about"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "lying and being in <mark>Magisterial</mark> <mark>District</mark> of County, Virginia, about"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1384.31, 205.32, 1547.56, 1026.04], "bbox_id": "e801dbebf3", "file": "TimesVirginian_1978_0222.pdf", "page": 1, "text": "TRUSTEES SA LE OF, House and land, situated in the Southside Magisterial District, si Appomattox County, Vir ginia, and within the corporate lim its of the Town of Appomattox, located at the I ntersection of Court Street and Lee-Grant Avenue in said Town, being a portion of Lots, No. 3,4,5, and 6 of Section A , as shown bn a plat of Subdivision of Hunter Addi tion to the Town of Appomat tox, and Lots No. 7 and 8, respectively, containing 0.255 acres, as shown on a plat of ClementSubdivision, made by W-W. Scott, C .L .S ., and being the same read estate conveyed to Richard L . Harrison and Mary G.Harrison, husband and wife, by deeds dated Septem ber 2,1975, by R . David Jones, et ux, et als, and recorded in the Clerks Office of the Circuit Court of Appomattox County, Virginia, in Deed Books 124 at page 56, and Deed Book 124 at page58.  In execution of Dheds of Trusts, Richard L . Harrison, Sr. and Mary C. Harrison, husband and wife, dated 25 August, 1975, and 29 July, 1977, respectively, and record ed in the Clerks Office of the Circuit Court of Appomattox County, Virginia in Deed Books 124 at page 60, and Deed Book 132 at page 436, respectively, the undersigned Trustee will offer for sale, at public auction, on the premises, all those j parcels of real estate, including buildings and improvements thereon, located within the corporate limits of the Town of Appomattox, at the intersec tion of Court Street and Lee-Grant Avenue in said town, and being the same real estate conveyed to Richard L . Harrison and Mary C. Harrison, husband and wife, by deeds,, dated September 2,1975, by R. David Jones, et ux, et als, and recorded in the aforesaid Clerks Office in Deed Books 124 at page 56, and Deed Book 124 at page 58, said property having tax map identification as 72LL 75M 62 and72LL 75MI 622. The real estate above described will be sold at public auction on Saturday, June 10, 1978 at 1000 A.M . Terms 10 down balance in cash upon delivery of ROBERT W. 4  Trustee 203 N . Church Street Appomattox, Virginia 24522 Phone 804 352-7901"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Southside <mark>Magisterial</mark> <mark>District</mark>, si Appomattox County, Vir"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "situated in the Southside <mark>Magisterial</mark> <mark>District</mark>, si Appomattox County, Vir"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2265.61, 352.83, 2407.86, 928.7], "bbox_id": "48d445890b", "file": "AppomattoxNewspapers_1974-1975a_0212.pdf", "page": 1, "text": "TRUSTEES SA LE 300.0 ACRES JA M E S RIVER DISTRICT BUCKINGHAM COUNTY, VIRGINIA In execution of Deeds of Trust from William M . Mc G rath, III and Renee B . McGrath, husband and  wife, dated November 3, 1971, and recorded in the Clerks Office of the Circuit Court of Bucking ham County, Virginia, in Deed Book 85 at page 305, and Deed of Trust dated November . 8 , 1971, and recorded in the aforesaid Clerks Office in Deed Book 85 at page 308 and Deed of Trust dated January 4,1973, and recorded in the aforesaid Clerks Office in Deed Book 89 at page 67, the undersigned Trustee, will offer for sale at public auction aD that tract or parcel, including buildings and improvements thereon, lying and being in Jam es River Magisterial District of Bucking ham County, Virginia, lying on Davids Creek and Jam es River, and adjoining lands now or formerly owned by William M . Perkins E state, H arry Perkins, Gooch Farm, Wesley R . Johnson, et als, containing 300.11, more or less, and being the same real estate conveyed to William M . McGrath, III and Renee B . McGrath, husband and wife, by Deed dated March 13, 1965, and recorded in the aforesaid Clerks Office in Deed Book 73 at page 462, L E SS, HOW EVER,an off-conveyance of 96.2 acres, by Deed dated November 10, 1969, and re corded in the aforesaid Clerks Office in Deed Book 82 at page 145. Sale to be held on the premises at 100 p.m. on March 8 , 1975. Terms 10  down balance in cash upon delivery of Deed. Robert W . Carter, Trustee, Appomattox, Virginia fe-18-4t"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "in Jam es River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "in Jam es River <mark>Magisterial</mark> <mark>District</mark> of Bucking ham County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1410.09, 238.55, 1557.1, 662.34], "bbox_id": "99ceb8d9b5", "file": "TimesVirginian_1981a_0316.pdf", "page": 1, "text": "TRUSTEES 8 ALE VALUABLE REAL ESTATE Pursuant to a Daed of Trust from Arco Manufacturing Co- I Pennsylvania Cor- to W. M. Abbitt and S. Kerr, Trustees, dated March 29,1979, and recorded in tha Cloth Office of the Circuit Couit of Appomattox County on April 24,1979, in Deed Book 141, rW 87, ten hereinafter described real astute eras conveyed in tru st to the aforementioned Trustees to some a Deed of Tust Noteef oven date and, the said Deed of Trust Note now being in default and, upon request of the Noteholder, the Fortners Na tional Bank, of Apranattoa, Virginia, the undersigned Tr ustees shall offer for sale, on 8atuiday, October 17,1981, at 11 a m nn tfin nromieen. the following described real eotatei All of that certain lot or panel of land, lying add being in the Clovwhill Magisterial District of Appomattox County, Virginia, fronting on State Secondly Hoad ,898. contain ing, 5.04 sens, more or less, tins being a conveyance by the boundary and not by the acre, and shown on a plat of surwty made Iff Ralph P. Hines, CJLS., dated April 21, 1978, which plat is recorded in the Clerics Office of the Circuit in"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in the Clovwhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in the Clovwhill <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.75, 1592.92, 1853.79, 1708.56], "bbox_id": "2a39c2a652", "file": "AppomattoxNewspapers_1933-1936a_0041.pdf", "page": 1, "text": "TRACT NO. 2 All thatjcertain tract or parcel of land lying and being in Clover Hill Magisterial District Appomattox Co. Va., containing 82-V2 acres and bounded as foJ?8to On the N. by the Public Rd. and the lands of one Kidd, on the E. by the land of the said Kidd and or Brooks, on the S. by the land of C. J- Walker and on the W. by the land of John Walker and the Public Rd. and being the same land conveyed to C. J. Walker by James V- Lews and wite by deed dated .March 31, li24 and registered in Book 24, Page 424 o-. th Appomattc  Co. Va. Registry."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in Clover Hill <mark>Magisterial</mark> <mark>District</mark> Appomattox Co. Va., containing"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in Clover Hill <mark>Magisterial</mark> <mark>District</mark> Appomattox Co. Va., containing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.68, 280.32, 1609.71, 777.92], "bbox_id": "7e31796320", "file": "AppomattoxNewspapers_1974-1975a_0482.pdf", "page": 1, "text": "TRACT 2, Asbestos shingle bungalow, 6 rooms and bath, part basem ent, hardwood floors, located on approximate ly 3.50 acres, more or less IN THE PATRICK HENRY MAGISTERIAL DISTRICT Campbell County, Virginia Offered separately or as a whole, at option 0f  apodal commissioner. at PUBLIC AUCTION, on the PREMISES, on SATURDAY, October 25,1975  1100 oclock A.M. This property has road frontage on State Route 605 and State Route 40. Tract 1 on which the store is located has road frontage on both State Route 605 and State Route 40. Tract 2 on which the dwelling is located has road frontage on State Route 40. TERMS Purchaser may, at his option, pay all cash, or ten per cent 10 down day of sale, with the balance due in 30 days from date of sale. Further information can be obtained from the undersigned Special Commissioner or the Auctioneer. RICHARD W. ELLIOTT Rustburg, Virginia Special Commissioner This is to certify that Richard W. Elliott, Special Commission er, has given bond as required by the aforementioned decree in this cause. H. E. Bennett, Clerk of the Circuit Court of Campbell Co. HOPKINS BROTHERS AUCTIONEERS 847-8838-Lynchburg, Virginia 10-910-23-2t i"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "IN THE PATRICK HENRY <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark> Campbell County, Virginia Offered"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "IN THE PATRICK HENRY <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark> Campbell County, Virginia Offered"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1172.89, 831.26, 1318.06, 1329.1], "bbox_id": "8c39dcc6b3", "file": "AppomattoxNewspapers_1974-1975a_0463.pdf", "page": 1, "text": "TRACT 2, Asbestos shingle bungalow, 0 rooms and bath, p a rt basem en t, hardw ood Boon, located on approximate ly 30 acres, more or less IN THE PATRICK HENRY MAGISTERIAL DISTRICT Campbell County, Virginia Offered separately or as a whole, at option of  special commissioner. at PUBLIC AUCTION, on tip PREMISES, on5 SATURDAY, October 25,1975 - ll0 0 o dock AM. This p ro p e rty has road frontage on State Route 605 and State Route 40. Tract 1 on which the store is located has road frontage on both State Route 605 and State Route 40. Tract 2 on which the dwelling is located has road frontage on State Route 40. TERMS Purchaser may, a t his option, pay all cash, or ten per cent 10 down day of sale, with the balance due in 30 days from date of sale. Further information can be obtained from the undersigned Special Commissioner or the Auctioneer. RICHARD W. ELLIOTT Rustburg, Virginia Special Commissioner This is to certify that Richard W. Elliott, Special Commission er, has given bond as required by the aforementioned decree in this cause. H. E. Bennett, Clerk of the Circuit Court of Campbell Co. HOPKINS BROTHERS AUCTIONEERS 847-8838-Lynchburg, Virginia  _______ 10-910-23-2t"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "IN THE PATRICK HENRY <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark> Campbell County, Virginia Offered"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "IN THE PATRICK HENRY <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark> Campbell County, Virginia Offered"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2171.3, 373.46, 2310.6, 404.86], "bbox_id": "e86ef41411", "file": "AppomattoxNewspapers_1974-1975a_0348.pdf", "page": 1, "text": "Town of Appomattox, Cloverhill Magisterial District, Appomattox County, Virginia"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Town of Appomattox, Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomattox County, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Town of Appomattox, Cloverhill <mark>Magisterial</mark> <mark>District</mark>, Appomattox County, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [624.7, 1431.28, 922.84, 1727.69], "bbox_id": "2c3950ff9d", "file": "TimesVirginian_1978_0346.pdf", "page": 1, "text": "TOWIT I All that certain parcel of realty located in the James j River Magisterial District, Buckingham County, Virginia,. containing seven 7 acres, more or less with provements. bounded on the North by State Highway 6071 I now relocated and on the South by U. S. Highway 60, It I I being the same property conveyed unto John M. Harris, f Sr., by deed of record In the Clerks Office of the Circuit  I Court of Buckingham County, Virginia, in Deed Book 49,1 I at page 566. This is level real property located about tw ol 1  2 miles West of the Intersection of State Route No. 241 I 1 and b. S. Route No. 60. and improved by 13-room 1 dwelling erected 1946 with substantial improvements!  1968, 10 rooms downstairs including 1 full bath and 2     baths, 3 rooms and full bath upstairs, hardwood floors,t ! full basement, enclosed side porch with slate floor and I partially enclosed bock porch with slate floor, dish-  washer in kitchen, well and pump enclosed in pump J house, septic tank and drain field, recent oil burner in I good repair, and outbuilding with concrete floor. Right of  I setoff reserved to Hen creditor, except as to ad-1  ministrative expense. The sole Is to be closed fifteen 15 f days after order of confirmation and taxes prorated a t   delivery of deed. , . .   For further information contact one of the undersigned j"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "the James j River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia,. containing"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "the James j River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia,. containing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1864.07, 1409.28, 2155.54, 1708.48], "bbox_id": "a2ae02c5bd", "file": "TimesVirginian_1978_0359.pdf", "page": 1, "text": "TOWIT  Ajl that certain parcel of realty located In the James j River Magisterial District, Buckingham County, Virginia, j containing seven 7 acres, more or less, with 1m- f provements, bounded on the North by State Highway 607 1 now relocated and on tho South by U. S. Highway 60, it. being the same property conveyed unto John M. Harris, f Sr., by deed of record in tho Clarks Office of tho Circuit Court of Buckingham County, Virginia, in Dead Book 49,  at page 566. This is level real property located about two? I 2 miles West of tho Intersection of State Route No. 24f i and U. S. Route No. 60. and improved by 13-room j 1 dwelling erected 1946 with substantial improvements! I 1968, 10 rooms downstairs including 1 full bath and 2Vi  l baths, 3 rooms and full bath upstairs, hardwood floors, j full basement, enclosed side porch with state floor and!  partially enclosed back porch with state floor, dish-  washer in kitchen, well and pump enclosed In pwmpj ! house, septic tank and drain field, recant oil burner in  good repair, and outbuilding with concrete floor. Right of  I setoff reserved to lien creditor, except as to ad-1  ministrative oxponto Tha sola Is to ba dosad fiftggn 15 j f days after order of confirmation and taxes prorated.  I I delivery of deed.   For further information contact one of the undersigned j"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "the James j River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia, j"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "the James j River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia, j"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1562.42, 1415.14, 1850.03, 1713.5], "bbox_id": "0bbdca4e59", "file": "TimesVirginian_1978_0322.pdf", "page": 1, "text": "TOW IT  All that certain parcel of realty located in the James  River Magisterial District, Buckingham County, Virginia,. containing seven 7 acres, more or leas, with im-f provements, bounded on the North by State Highway 6071 now relocated and on the South by!U. S. Highway 60, it j being the same property conveyed unto John M. Harris, V Sr., by deed of record in the Clerks Office of the Circuit J Court of Buckingham County, Virginia, in Deed Book 49,. at page 566. Thl 1 level real property locoted about two! 2 miles West of the interection of State Route No. 24 1 and U. S. Route No. 60, and improved by 13-room, dwelling erected 1946 with substantial improvements f 1968,10 rooms downstairs including -1 full both and 2V4 baths, 3 rooms and full bath upstairs, hardwood floors. full basement, enclosed side porch with slate floor and I partially enclosed bock porch with skrte floor, dish- washer in kitchen, well and pump enclosed in pump house, septic tank and drain field, recent oil burner in good repair, and outbuilding with concrete floor. Right of  setoff reserved to lien creditor, except as to ad -1 ministrative expense. The sole is to beclosed fifteen 15. days after order of confirmation and taxes prorated iOtf delivery of deed.  For further information contoct one of fhe undersigned"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "in the James  River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia,. containing"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "in the James  River <mark>Magisterial</mark> <mark>District</mark>, Buckingham County, Virginia,. containing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1391.3, 390.14, 1539.58, 1303.77], "bbox_id": "8cc6bda794", "file": "TimesVirginian_1978_0477.pdf", "page": 1, "text": "TO WHOM rr MAY CONCERN Pursuant to an order entered on the 6th day at October, 1978, this notice ia hereby given In .this proceeding the petitioner seeks to acquire by condemnation the fee simple interest and such temporary easements as may be necessary to a certain parcel of real estate and land, lying and being in the County of Appomattox, in the Stonewall Magisterial District thereof, for the uses and pur poses of the County of Appomat tox for the widening, im provement, paving, construc tion, alteration and reconstruc tion of State Route No. 663, all of which are described more par ticularly in the petition and exhibits attached thereto, on file in the Office of the Cleric of this Court, to which reference is hereby made for a full and ac curate description thereof and for the appointment of com missioners to ascertain just compensatimi to the owner of any estate or interest in the property to be taken or affected as a result of the taking and use thereof by the petitioner. For such purposes, the petitioner will apply to the Court, sitting at Appomattox, Virginia, on the 3rd day of November, 1978 at 930 A.M. or as soon thereafter as petitioner may be heard, for the appoin tment of commissioners to ascertain just compensation as aforesaid. And it appearing by affidavit filed according to law that the following owner is not a resident of the State of Virginia, it is ORDERED that the aforesaid owner do appear within ten 10 days after due publication of this order in the Clerks Office of the Circuit Court of Appomattox County and do what is necessary to protect her interests and it is further ORDERED that if the above named owner desires to assert any objection or defense to the taking or damaging of her property or to the jurisdiction of the Court to hear tin case and to proceed with the appointment of commissioners, she shall file her answer and grounds of defense designating the proper ty in which she claims to be in terested, the grounds of any ob jection or defense to the taking or damaging of her property or to the jurisdiction of the Court to hear the case and to proceed with the appointment of com missioners for the deter mination of just compensation, and to enter an order granting the petitioner the right of entry upon the land requested and described in the petition prior to the determination and deposit of the award of just compen satimi, pursuant to the provisions of Section 25-46.8, Code of Virginia, as amended. An extract, Teste Barbara R. Williams, Clerk W.S. Kerr, Attorney at Law Court Street Appomattox, Virginia 24522 10-l2-4tc PRECIPITATION Last Week -06 This Month 1.04 This Year 34.92"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.87, 908.68, 1851.04, 1776.47], "bbox_id": "a670d55125", "file": "TimesVirginian_1978_0461.pdf", "page": 1, "text": "TO WHOM IT MAY CONCERN Pursuant to an order entered on the 6th day of October, 1978, this notice is hereby given In this proceeding the petitioner seeks to acquire by condemnation tlm fee simple interest and such temporary easements as may be necessary to a certain parcel of real estate and land, lying and being in the County of Appomattox, in the Stonewall Magisterial District thereof, for the uses and pur poses of the County of Appomat tox for the widening, im provement, paving, construc tion, alteration and reconstruc tion of State Route No. 663, all of which are described more par ticularly in the petition and exhibits attached thereto, on file in the Office of the Clerk of this Court, to which reference is hereby made for a full and ac curate description thereof and for the appointment of com missioners to ascertain just compensation to the owner of any estate or interest in the property to be taken or affected as a result of the taking and use thereof by the petitioner. For such purposes, the petitioner will apply to the Court, sitting at Appomattox, Virginia, on the 3ra day of November, 1978 at 930 A.M. or as soon thereafter as petitioner may be heard, for the appoin tment of commissioners to ascertain just compensation as aforesaid. And it appearing by affidavit filed according to law that the following owner is not a resident of the State of Virginia, it is. ORDERED that the aforekhld owner do appear prithin ten 10 days aft due publication of this order in the Clerks Office of the Circuit Court of Appomattox County and do what is necessary to K ct her interests and it is er ORDERED that if the above named owner desires to assert any objection or defense to the taking or damaging of her property or to the jurisdiction of the Court to hear the case and to proceed with the appointment of commissioners, she shall file her answer and grounds of defense designating the proper ty in which she claims to be in terested, the grounds of any ob jection or defense to the taking or damaging of her property or . to the jurisdiction or the Court to hear the case and to proceed with the appointment of com missioners for he deter mination of just compensation, and to enter an order granting the petitioner the right of entry upon the land requested and describad in the petition prior to the determination and deposit of the award of just compen sation, pursuant to the provisions of Section 25-46.8, Code of Virginia, as amended. An extract, Teste Barbara R. Williams, Clerk W.S. Kerr, Attorney at Law CourtStreet Appomattox, Virgin!24522 10-12-4 tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.81, 331.54, 1684.78, 545.34], "bbox_id": "74f6d4c99b", "file": "TimesVirginian_1978_0472.pdf", "page": 1, "text": "TO WHOM IT MAY CONCERN Pursuant to an order entered mi the 6th day of October, 1978, this notice is hereby given In this proceeding the petitioner seeks to acquire by condemnation the fee simple interest and such temporary easements as may be necessary to a certain parcel of real estate and land, lying and being in the County of Appomattox, in the Stonewall Magisterial District thereof, for the uses and pur poses of the County of Appomat tox for the widening, im provement, paving, construc tion, alteration and reconstruc tion of State Route No. 663, all of which are described more par ticularly in the petition and exhibits attached thereto, on"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1402.58, 387.71, 1560.38, 1251.64], "bbox_id": "0e7f4f70f4", "file": "TimesVirginian_1978_0491.pdf", "page": 1, "text": "TO WHOM IT MAY CONCERN  Pursuant to an order entered on the 6th day of October, 1978, thto notice is hereby given  fin this proceeding the pÀitioner sew s to acquire by condemnation the fee simple interest and such temporary easements as may be necessary toa certain parcel of real estate and land, lying and being in the County of Appomattox, in the Stonewall Magisterial District thereof, for the uses and pur poses of the County of Appomat tox for the widening, im provement, paving, construc tion, alteratimi and reconstruc tion of State Route No. 663, all of which are described mm par ticularly in the petition and . exhibits attached thereto, on file in the Office of the Clerk of this Court, to which reference is hereby made for a full and ac curate description thereof and for the appointment of com missioners to ascertain just compensation to the owner of any estate or interest in the property to be taken or affected as a result of the taking and use thereof by the petitioner. For such purposes, the petitioner will apply to the Court, sitting at Appomattox, Virginia, on the 3rd day of November, 1978 at 930 A.M. or as soon thereafter as petitioner may be heard, for the appoin tment of commissioners to ascertain just compensation as aforesaid. And it appearing by affidavit filed according to law that the following owner is not a resident of the State of Virginia, it is ORDERED - that the aforesaid owner do appear within ten 10 days after due publication of this order in the Clerks Office of the Circuit Court of Appomattox County and do what is necessary to protect her interests and it is further ORDERED that if the above named owner desires to assert any objection or defense to the taking or damaging of her property or to the iurisdictwoiof the Court to hear tnefaaeand to proceed with the appointment of commissioners, she shall file her answer and grounds of defense designating the proper ty in which die claims to be in terested, the grounds of any ob jection or defense to the taking or damaging at her property or to the jurisdiction of the Court to hear the case and to proceed with the appointment of com missioners for the deter mination of just compensation, and to enter an order granting the petitioner the right of entry  upon the land requested and described in the petition prior to thè determination and deposit of the award of just compen sation, pursuant to the provisions of Section 25-46.8, Code of Virginia, as amended. Ah extract, Teste. Barbara R. Williams, Clerk W.S. Kerr, Attorney at Law Court Street Appomattox, Virginia 24522 10-12-4tc"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Appomattox, in the Stonewall <mark>Magisterial</mark> <mark>District</mark> thereof, for the uses"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [452.64, 939.53, 620.61, 1068.12], "bbox_id": "d1b938b69a", "file": "AppomattoxNewspapers_1954-1955a_0300.pdf", "page": 1, "text": "TO THE VOTERS OP STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people of the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OP STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OP STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [589.19, 835.8, 757.41, 976.14], "bbox_id": "9f562d05f6", "file": "AppomattoxNewspapers_1954-1955a_0252.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people of the district and county to thebest of my ability. Hubert B. Scruggs. 3-24-4tp 6-16-4tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [786.93, 916.84, 955.03, 1045.63], "bbox_id": "0fd9b85d82", "file": "AppomattoxNewspapers_1954-1955a_0338.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people of the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1141.19, 949.28, 1309.29, 1079.28], "bbox_id": "825a6026d5", "file": "AppomattoxNewspapers_1954-1955a_0307.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people of the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [452.13, 944.19, 619.73, 1072.53], "bbox_id": "87bee7eca2", "file": "AppomattoxNewspapers_1954-1955a_0294.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your voté and support. If elected I will serve the people of the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [614.4, 480.53, 783.45, 609.32], "bbox_id": "380aad93bd", "file": "AppomattoxNewspapers_1954-1955a_0332.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people of the district and county to the bast of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1141.43, 1176.98, 1310.12, 1307.48], "bbox_id": "8aeb9357a2", "file": "AppomattoxNewspapers_1954-1955a_0311.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the people ef the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [607.19, 506.91, 776.24, 635.71], "bbox_id": "a2a7d6b258", "file": "AppomattoxNewspapers_1954-1955a_0325.pdf", "page": 1, "text": "TO THE VOTERS OF STONEWALL MAGISTERIAL DISTRICT, APPOMATTOX CO. I will be a candidate in the Demo cratic Primary Election to be held July 12, 1955, for the office of Supervisor of Stonewall District. I will greatly appreciate your vote and support. If elected I will serve the peopia of the district and county to the best of my ability. Hubert B. Scruggs. 5-19-8 tp"}, "highlight": {"text": {"matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}}, "highlights": [{"field": "text", "matched_tokens": ["MAGISTERIAL", "DISTRICT"], "snippet": "THE VOTERS OF STONEWALL <mark>MAGISTERIAL</mark> <mark>DISTRICT</mark>, APPOMATTOX CO. I will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2201.98, 274.46, 2369.93, 403.51], "bbox_id": "a5f376d123", "file": "AppomattoxNewspapers_1943-1947a_0048.pdf", "page": 1, "text": "To the Voters of Stonewall Ma gisterial District I herewith an nounce my canlidacy as Supervisor of Stonewall Magisterial District of Appomattox County, subject to the Democratic Primay of August 3, 1943. Your vote and support will be greatly appreciated and if elect ed 1 pledge my active efforts in be half of the interest of the d-tnet and county. Respectfully, P. Brent Stratton."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "as Supervisor of Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, subject"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "as Supervisor of Stonewall <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, subject"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1846.11, 871.32, 2019.3, 981.67], "bbox_id": "fafb77f953", "file": "AppomattoxNewspapers_1943-1947a_0058.pdf", "page": 1, "text": "To The Voters of Stonewall Ma gisterial District I herewith an nounce my canlidacy as Supervisor I of Stonewall Magisterial District of ! Appomattox County, subject to the ! Democratic P imay of August 3, 1 1943. Your vote and support will be greatly appreciated and if elect ed 1 pledge my active efforts in be-  half of the interest of the district and? county. Respectful!,"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Supervisor I of Stonewall <mark>Magisterial</mark> <mark>District</mark> of ! Appomattox County, subject"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Supervisor I of Stonewall <mark>Magisterial</mark> <mark>District</mark> of ! Appomattox County, subject"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [548.89, 342.34, 711.19, 840.24], "bbox_id": "6002845151", "file": "AppomattoxNewspapers_1933-1936a_0152.pdf", "page": 1, "text": "TO ANNA VARGA The Guaranty Investment Company, an Ohio Corporation, of Cleveland, Ohio, Vincent Dudas, Atty. in Fact, Cleve land, Ohio. Ignace Gulyas, of Cleveland, Ohio A. M. Snow b lert Huszar Take notice, That the undersigned J. E. Sears, will on July 25, 1935, at 10 a. m., on said date apply to the Clerk of the Circuit Court of Appomattox, at his office jat Ap pomattox Court House, Va., for a tax Jeed, conveying to him that certain tract of land containing 575 acres, more or less, situated jn Clov- ei Hill Magisterial District of Appo mattox County, Va., on both sides of Burnetts Road, about 12 miles northeast of the Court House of said County, and adjoining the lands formerly owned by Dr. Richard H. Watkins, Luther Webbs Estate, Jno. W. Webb, S. V. Beasley, Jno. Lewis, F. W. Harvey, the S. W. Cawthorn Land and Others, unless the taxes paid by him and the costs cf this proceeding are paid before that date. Theundersigned J. E. Scars hav ing purchased said land from the Treasurer of Appomattox County, Va., at a delinquent tax sale on Jan. 5. 1931, at Appomattox Court House Va., for the taxes for the year 1929 for the sum of 142.00 which said said sale was duly reported and con firmed by the Court and ordered to be recorded. The undersigned has since .paid all taxes assessed again st said tract cf land, and is entitl ed to reimbursement for same with interest from the dates of payment, which amount, as of this date to 490.90, plus the cost of this pro ceeding. You are hereby notified that you have the right to redeem the same at any time before the execution of said deed by payment of the above mentioned taxes and costs of this proceeding. J. E SEARS, Appomattox, Va. W. M. Abbitt, p. q."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "jn Clov- ei Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "jn Clov- ei Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [695.95, 342.57, 857.8, 841.41], "bbox_id": "5702e8f2e1", "file": "AppomattoxNewspapers_1933-1936a_0161.pdf", "page": 1, "text": "TO ANNA VARGA The Guaranty Investment Company, an Ohio Corporation, of Cleveland, Ohio, Vincent Dudas, Atty. in Fact, Cleve land, Ohio. Ignace Gulyas, of Cleveland, Ohio A. M. Snow b lcrt Huszar Take notice, That the undersigned J. E. Sears, will on July 25, 1935, at 10 a. m., on said date apply to the Clerk of the Circuit Court of Appomattox, at his office ,at Apl- pomattox Court House, Va., for a tax i!eed, conveying to him that Certain tract of land containing 575 acres, more or less, situated in Clov- ei Hill Magisterial District of Appo mattox County, Va., on both sides of Burnetts Road, about 12 , miles northeast of the Court House of said County, and adjoining the lands formerly owned by Dr. Richard H. Watkins, Luther Webbs Estate, Jno. W. Webb, S. V. Beasley, Jno. Lewis, F. W. Harvey, the S. W. Cawthorn Land and Others, unless the taxes paid by him and the costs cf this proceeding are paid before that date. Theundersigned J. E. Sears hav ing purchased said land from the Treasurer of Appomattox County, Va., at a delinquent tax sale on Jan. 5. 1931, at Appomattox Court House Va., for the taxes for the year 1929 for the sum of 142.00 which said laid sale was duly reported and con firmed by the Court and ordered to be recorded. The undersigned has since paid all taxes assessed again st said tract cf land, and is entitl ed to reimbursement for same with interest from the dates of payment, which amount, as of this date to 490.90, plus the cost of this pro ceeding. You are hereby notified that you have the right to redeem the same at any time before the execution of said deed by payment of the above mentioned taxes and costs of this proceeding. J. E SEARS, Appomattox, Va. W. M. Abbitt, p. q."}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "in Clov- ei Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "in Clov- ei Hill <mark>Magisterial</mark> <mark>District</mark> of Appo mattox County,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1306.55, 715.52, 1506.06, 1114.76], "bbox_id": "6897256052", "file": "AppomattoxNewspapers_1962-1965a_0043.pdf", "page": 1, "text": "to a plat of survey thereof, be ing situated about four miles south of Appomattox C o u r t House near P r o m i s e Land Church in Southside Magisterial District of Appomattox County, on the Old Appomattox - Red House Road and being joined by the lands of W. R. Arrington and J. R. Poe and being a part of the George Chilton tract of land and beind described by metes and bounds as follows Beginning at a corner in the middle of the Red House Road at Point l as shown on plat of survey thereof thence S 8 Deg. 45 W 4 chns. and thence S 8 Deg. 15 E 6.60 chns. to point 2 thence near lines with Poe and rpcnmmpnHpi y Paulette due west 4.75 chns. to S T T S J point 3 and thence due north  gj.gajer producta 11.48 chns. to stake at W. R. Ar- ringtons line at point 4 thence with Arrington S 76 Deg. 30 E 4.58 chns. to point 1 at the be- The Indians j ginning. This being the same this one, but i l land conveyed to Walker and El- still works. SWl sie Franklin by deed from C. ing wet boots  Roger Norfleet and wife dated gadgets ... 4 December 8, 1956 and recorded verse vacuum I in the Clerks Office of Appo- bulb. But toil mattox County in Deed Book 65 in the woods at page 307. what does be  FOR INFORMATION AS TO Pt fuU al HOW TO REACH THIS PROP- Pms e  ERTY, CONTACT CHAS. F. waits until Bel P. CRAWLEY, SUBSTITUTE wet out. W J T R U S T E E , APPOMATTOX, plication. Tl"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "Land Church in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, on"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "Land Church in Southside <mark>Magisterial</mark> <mark>District</mark> of Appomattox County, on"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [636.92, 659.48, 846.43, 1030.93], "bbox_id": "1349dd1e3f", "file": "AppomattoxNewspapers_1915-1918a_0100.pdf", "page": 1, "text": "tion. By Mr. Barham8. B. No. 87, to provide for a temporary adequate ad ministration and government of the local affairs of the unincorporated community known as Hopewell and adjacent territory, now a portion of the Bland Magisterial District in the County of Prince George, until such time as it becomes a city. Referred to the Joint Committee on Special, Private and Local Legislation. By Mr. BarhamS. B. No. 88. to appropriate the sum of 50,000 for the proper administration of the affairs of that part of Bland Magisteral District, Prince George county, Va., known as Hopewell and its suburbs. Referred to the Committee on Finance. By Messrs. Davis, Goodloe and Webb S. B. No. 89, to amend and re-enact section 1433 of the Code in relation to the duties of the State Board of Edu cation. Referred to the Committee on Public Institutions and Education. By Mr. HeningS. B. No. 90, to au thorize the Board of Supervisors of Powhatan County to appropriate money to the Powhatan Chapter of the United Daughters of the Confederacy as part payment for a monument to Confederate soldiers at Huguenot Agriculture j gpi-ingg, in said county. Referred to the Committee on County, City and Town Organization. By Mr. MathewsS. B. No. 91, ro amend and re-enact section 11 of an act to provide for designation, by cities and towns of segregation districts for residents of white and colored per sons. Referred to the Committee on"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "portion of the Bland <mark>Magisterial</mark> <mark>District</mark> in the County of"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "portion of the Bland <mark>Magisterial</mark> <mark>District</mark> in the County of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [481.21, 1173.27, 828.35, 1235.77], "bbox_id": "f4f34a8855", "file": "AppomattoxNewspapers_1960-1962b_0591.pdf", "page": 1, "text": "t-ion 219 teet no a pun,    LEGAL NOTICE _____ _ with this uniform width extending j V1RGINIA IN  THE CIRCUIT l ack in a Westerly direction 210 COURT 0F APPOMATTOX COUN feet situated, lying and being in I Southede Magisterial District of   Appomattox County, Virginia, about Complainant,"}, "highlight": {"text": {"matched_tokens": ["Magisterial", "District"], "snippet": "being in I Southede <mark>Magisterial</mark> <mark>District</mark> of   Appomattox County, Virginia,"}}, "highlights": [{"field": "text", "matched_tokens": ["Magisterial", "District"], "snippet": "being in I Southede <mark>Magisterial</mark> <mark>District</mark> of   Appomattox County, Virginia,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2048.62, 346.79, 2213.39, 1769.71], "bbox_id": "dce212dacc", "file": "AppomattoxNewspapers_1905-1912a_0316.pdf", "page": 1, "text": "this led the wealthy, educated class to thinking they saw the great majority of children growing up in absolute ignor ance and patriotism, pride of country, and love of their fel low-man, constrained such to devise means to check this ever increasing horde of ignorance the only way to do so was to tax themselves and other pro perty owners to provide the funds necessary to pay teach ers to teach the children of their less fortunate fellow citizens. It was a heavenly-born ini- pulse, and a noble resolve, that actuated the promoters of the new departure, and the funda mental principle, motive and intent of their act, was to pro vide a common school educa tion, to give to every child in Virginia an opportunity to learn his  3 Rs at the public expense, so that the poorer children of Virginia may not continue to grow up in ignor ance as their ancestors had done, and the good work has gone on and thousands of Buckingham children during the past 30 years have availed themselveB of their oppor tunity, and have equipped themselves through the public funds with an education suf ficient to enable them to earr their living in the world and yet they have not all been reached. There are to-day manyhow many I cannot tell hut judging from this small magisterial district, there musi he some hundreds of children in the county who are cut off from all the benefits of the school fund by location and envirorment, and the craze for the  consolidated school is mainly responsible for the de privation of these back woods children of even the rudiments of an education This state of affairs ought not to be. It was never expected, or the thought conceived by the founders of the public school movement, that tbe taxes collected from a generous public to give the poor boy and girl of Bucking ham an elementary education should be diverted to pay a high priced teacher to polish up Mr. Nearby and Mr. Well- offs son or daughter in al gebra, music, latin and other trimmings, whilst the little bare-foot waif of the ridges and back woods had not even a chance to reach a school within 3, 4, or 5 miles. Such is the state of affairs in Buckingham County to-day, and if high officials and aspir ing teachers have their way. I fear it is to grow worse, and I call upon tbe Board of School Trustees to ponder well the condition and position of these outlying sections of our county, and not let the  High School at the Court House, or Arvon sweep them off their feet, but bark back to first principles and foster the Primary School first, and thus carry out the plans and intentions of the founders and the tax-payers. I am not an enemy to educa tion any more than I am to the automobile or the air-ship when a man is  fore handed, and owes no debts he may own and ride in his car or ship, but I do protest against a man cut ting such shines when he is still owing his grocer for sugar, coffee, c., or his tailor for the suit of clothes he is wearing and so with the classics and higher mathematics, the read ing and expounding of Virgil and Homer by teachers paid out of the public funds co sons and daughters of the well-to do and conveniently located whilst the poor mans child on the out-skirts of a school dist rict is shut out of distance and pecuniary famine from even acquiring at public expense even the rudiments of his mother tongue it is worse than an error, it is a crime.  Buckingham is a county of"}, "highlight": {"text": {"matched_tokens": ["magisterial", "district"], "snippet": "judging from this small <mark>magisterial</mark> <mark>district</mark>, there musi he some"}}, "highlights": [{"field": "text", "matched_tokens": ["magisterial", "district"], "snippet": "judging from this small <mark>magisterial</mark> <mark>district</mark>, there musi he some"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
