{"document": {"bbox": [2066.63, 832.47, 2243.07, 1399.52], "bbox_id": "c13fb941af", "file": "AppomattoxNewspapers_1939-1943a_0010.pdf", "page": 1, "text": "Martdn, Lucille McCormick, Mildred Cyrus, Virginia Almond. Ar Host Thalia Harvey, Irene Page. Dietirian- Hazel Cheatham, Jacquelin Alvis. Teaching Harriet Smith, Mary Helen Johnson, Eugenia Walton, Jean Akers, Bertis Cumby, Nadine Burnette, Mary Alice Paulette, Marian Drinkard, Helen Fay iTtrmes, Audrey Williamson, Nancy Dickerson, Lois Moss, Will iam McConnick, Majorie Bingham, Lily B. Davidson, Shirley Harding, ilris Jones, Lily Byrd Woody, Gene va Hudson, June Johnston, Estelle Lvne, Margaret Marshall, Barbara Caldwell, Bessie Cabiness, Violet Irby, Rosa Mae Reed, Gertrude Doss, Elizabeth Carter, Alpha Mae Turnes .Catherine Turnes, Louise Walton, Dorothy Ferguson, Virginia Coleman, Corine Reynolds, Virginia Louise Bergman, Rebecca Harvey, Eleanor Bolton. Journalism Frances Harvey. Housekeeping Dorothy Reynolds Thelma .Smith, Blanche McConchie. Beauty Culture Locki Mclfadderl, Ora -Paulette, Margaret Major, Vernelle Almond, Evelyn Martin, Lila Wilcox, Alta Mhompeon, Frances Smith, Hilda Diqkins, Christine Burks, Rachel Coleman, Catherine Coleman,. Lu cille Coleman, Alice Guill. Library Work Elvira Harvey, Constance Fuljp, Clara Whitney Moses, Doris Watson, Louise Carson, Rachel Chk, Ruth Moore, Edmonia Phelps, Euia M oj Carter, Ha Jean Carter, Dorothy Johnston, Emma Johnson. Seamstress Dora Smith.  Aviation- Ronald Webb, Charles Jones, Paul Childers, H. T. Harvey, Raymond Johnson, Marvin Martin, Frank Mil ler, Walter ITIyree, Shearer Weakley, Warren Hesson, Frank Dresser, Fred Godsey, Joe Ferrell, Bud Ould, Har ry Thornhill, Russell Moore, Roy Paulette, Charlie Wallace, Herman Lee, Elvin Caldwell, Baynlth Moore, Jade Tune man, Richard Roberts, Hope Christian, Lonnie Carey, Jam es Blackwell, G. D. Akers, Alfred Wallace, Gilbert Mays, Billy Child-"}, "highlight": {"text": {"matched_tokens": ["Paul", "Harvey"], "snippet": "Ronald Webb, Charles Jones, <mark>Paul</mark> Childers, H. T. <mark>Harvey</mark>, Raymond Johnson, Marvin Martin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Paul", "Harvey"], "snippet": "Ronald Webb, Charles Jones, <mark>Paul</mark> Childers, H. T. <mark>Harvey</mark>, Raymond Johnson, Marvin Martin,"}], "text_match": 2310390567831339129, "text_match_info": {"best_field_score": "2220487606272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567831339129", "tokens_matched": 4, "typo_prefix_score": 0}}
