{"document": {"bbox": [569.72, 388.55, 896.15, 1976.52], "bbox_id": "3ccd47a056", "file": "AppomattoxNewspapers_1898-1902a_0263.pdf", "page": 1, "text": "TO TRAP AGUINALDO. J. W. Stine, of York, Pa., shot Mrs. Harry Mundis and then killed himself because she refused to run away with him. Stine had a wife and five children living. The National Tinplate Company has been organized to develop In West Virginia the Rodgers patents, which, it is claimed, will revolutionize the tin business. The steamer Tallahassee collided with tho four-master Senator Sullivan, and both ves sels returned to New York badly damaged. Mrs. Warren, a Presbyterian missionary, arrived in New York with an East Iadlan whom she has adopted a3 her son. Hampton Roads is crowded with belated vessels which suffered more or less during tho recent hurricane. Four men were killed aud two seriously injured by a rush of dirt in a colliery near Mahanoy Place, Pa. The people of Bevier, Mo., have been ter rorized by gangs of negroes from the mine stockades. State Senator Phillips was arrested in Great Falls, Montana, on the charge of sheep stealing. Kennett McKee, a child of three years, died in Chicago, a victim of faith-cure. A destructive - fire burned out VC 00 ,000 worth of property in Kansas City, Mo. The new fortifications at Fort Caswell were damaged by the hurricane. Tho ship Charles E. Moody, long overdue, arrived at Honolulu. Admiral Schley, while traveling through Virginia toward Atlanta, was given an en thusiastic ovation at all stations, and at Lynchburg was officially received by tho Mayor and City Council. At Danville ho was joined by tho Atlanta committee. Many vessels were distressed by the storm on the Lakes. The yacht Chiquita was found ashore, and all on board have probably per ished. Jay H. Worst, of Berwyn, Pa., dashed vitriol into the face of Edward II. Platt, of Philadelphia, who wrote affectionate letters to Mrs. Worst. Adam Keener, of York, who confessed hav ing fired his place for the insurance pieuey, made restitution to the company. Oeorge W. Birchett, a colored porter, ad mitted stealing 6,009 in gold from the Adams Express Company in New York. Two men were killed by the explosion of a Lehigh Valley Railroad locomotive near Wyalusing, Pa. Tho girl strikers in the potterieB at East Liverpool, O., secured an advance of 2 14 cents a day. Nearly every business house in Thomas- ville, Ga., was destroyed by a flro raging there. Louis de Goesbriand, Catholic Bishop of the Diocese of Burlington, Vt., is dead. Mrs. Stonewall Jackson denies reports that she is penniless and hopelessly ill. The steamer Catherine Whiting was wrecked off Frying-Pan SI oals. The Southern Cotton Spinners Associa tion, at a meeting at Charlotte, N. C., adopt ed resolutions urging upon the President and CoDgrcss the adoption of measures for main tenance of an open-door policy in China, and vigorous prosecution of tho Philippine war to a conclusion. Adam H. Keener, nt a revival service in York, Pa., after professing conversion, made a confession before the entire congregation that he burned his property to get the insur ance on it. President Williams states that tho consoli dation of the Georgia and Alabama, tho Sea board Air Line and other lines will be ef fected about January 1. Frederick Hardy, Jr., of Mount Pleasant, Tenn., was robbed and murdered at Key- port, N. J., and his body was thrown into the bay. General Funston and the Twentieth Kan sas Volunteers were given a great reception on their return to Topeka, Ka3. Miss Mamie lteting shot and fatally wounded Edward Grafe in Cincinnati, who, she claimed, had betrayed her. A. A. Wilson, of Philadelphia, committed suicide at his sons grave at Barrietts Chapel, Del. The industrial carnival in Richmond, Va., closed with an elaborate display of fire works. The private bank of Woodbury  Moulton, in Portland, Me., failed. Andrew H. Patterson killed his wife and bimsolf in Chicago, III. It is said that General Funston has in structed lawyers in Topeka, Kansas, to sue Arohbishop Ireland and a Catholic paper, called the Monitor, of San Francisco, for saying, it is alleged, that Funston bad looted Catholic churches, in the Philippines. The Pennsylvania Railroad Company be gan to operate the Delaware River, the Bal timore, Chesapeake and Atlantio and the Cleveland, Akron and Columbus Railroads. Sir Thomas Lipton sailed from New York for England. He received a rousing send- off by thousands at New York. Mrs. Piligreo and her two children were burned to death by hot apple butter, in Mc Donald county, Mo. John Coleman killed Mrs. Dora Chambers, his sister-in-law, in Wilkes county, N. C., and then committed suicide. Mr. Nonemaker was accidentally shot by his own gun, whilo hunting rabbits, near New Freedom, Pa. Mrs. Mary K Williams, widow of the late Dr. 8. H. Williams, of Baltimore, died at Stephens City, Va. A six-story building collapsed in Chicago. One person was killed and three are missing. Edward Bricker, a telephone lineman, was kil ed near Mount Holly, Pa. Cadet C. 8. Nott, of Now Orleans, died at Lexington, Va., of typhoid fever. The International Commercial Congress adjourned, at Philadelphia. Vico President Hobart was reported to bo much improved. The National Glass Company began busi ness in Pittsburg.  The torpedo boat Shubrick was launched at Richmond. The President, many mem bers of his cabinet, and other noted men were present. The President made a timely speech and addressed crowds at various sta tions between Washington and Richmond. Darius Hinaut was seriously injured in Manchester. Va., by being thrown from a vehicle. His skull was fractured. A number of coastwise sailing vessels were driven ashore by the furious northeast gale along the New Jersey and Virginia coast. Tho meadows at Capo May and Atlantio City were overflowed, and the wind reached a velocity of sixty miles an hour. Tho storm also did great damage on the Carolina beaches. The battleship Kontucky was tried in the storm off the Capes, and made good time. The storm about Norfolk and off tho coast was very heavy, and much damage was done. Tho schooner Kate Darlington was wrecked off Oeean View.  Col. J. Battersly died at Clifton Springs, N. Y., aged eighty. The Pennsylvania Railroad Companys ferry-boat Chicago was cut down as the ves sel was crossing to tho east side of North River at New York, and sunk by the Savan nah line steamer City of Augusta. Several lives were lost. Vice President Hobarts condition was slightly improved, but his family gave out the statement that he will never be able to return to public life. He is suffering with heart disease. John Pretlow, aged seventy-six, died in Southampton county, and John C. Thomas, aged seventy-four, died in Isle of Wight county, Va. Charles E Parker, a snorting man, died of paralysis in Now Orleans."}, "highlight": {"text": {"matched_tokens": ["McKee"], "snippet": "of sheep stealing. Kennett <mark>McKee</mark>, a child of three"}}, "highlights": [{"field": "text", "matched_tokens": ["McKee"], "snippet": "of sheep stealing. Kennett <mark>McKee</mark>, a child of three"}], "text_match": 1155199603042156665, "text_match_info": {"best_field_score": "1112352751616", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199603042156665", "tokens_matched": 2, "typo_prefix_score": 2}}
{"document": {"bbox": [371.26, 223.19, 545.58, 1424.89], "bbox_id": "069512e863", "file": "AppomattoxNewspapers_1915-1918a_0072.pdf", "page": 1, "text": "FARM VlLIiifi. Rev. McLees, the blind pr?acher front Chatham, baa been preaohing twiee each day at Che Paesbyterian church for the past week and to th spiritual uplift of large and increas ing . congregations. Toe preacher reminds me of the late Dr. Broad as, .of he Baptist, church, who com manded large audience without lifting his voioe. The  still wmatl voice more effective than the one tbit tarts the air and makes the rafters ring. The rain oame in time and wheat and clover Are responding to its reviving touches. And the hnnter dj longer complain that the dogs cant locate the birds. Speaking ol hunters reminds me to say that I had rabtkt for breakfast and again for dinner tolar. Por a nonsportsman .thats doing well. Say to yonr Con- cord correspondent who egpi-essed an interest in my Thanksgiving ,-dinner that I have the promise of turkywndoranbery sauce, salsify, mashed potatoes, hominy, celery, plain pudding seasoned with vome- . things Chat the .- 0. T. Us dont approve of, atro  effte and a bit of ohee6 Hows tint for a dinner in qOtr times? nnnters are alo o boast of their ktilmbis season. Mr. Davie Morton shot eight times and bagged seven hints. 1 have known that beat bat in tygobe frays.  ifitjor Martin and Mr. W. J Barrow planted 20 bvsbela of Irsh potatoes on a lot recently b nght on thalerreli heights and have just dog hOO bushels of ohoioe potatoes, mosof them large, shapely and smooth. Oae of onr near by fanners is busy, hauling in wheat straw to the liven sta le and i j due time will take back wimble manure. And le is one of the moat successful farmers In ali this seetion. And no one ever demonstrated to him just bow to form, Hqn W. C. Franklin is here today sttemfing court and bearing hio defeat gracefully and cheerfully. Thockau ffragettei who got mad and aid niteful things be ottuse they were beuwiii - mom than on a of the States ahou d catch on to his fine example. A young mm of Mr. W. J. Hills- man esdiied wonderfally from sud den death when the horse he v a driving Tsnfookleasiy down Main treat. Fortunately the boy was thrown from the boggy in the begittfring of the run and only suf- fared slight biuises. The November term of the circuit court is on with lew visiting lawyer attending auBfot ranch of public interest on the docket. Office practice must be good as our lawyers ae fot, fine and faoinating. Another Star o curse at the Normal and lovers of mneiu went wild over the aingeis. Too high fly for mo and I have to take in the movies for diversion. Dr. Jaru an, Mayor Barrow, Jndge Orute anfr Mr, J. . Garland were lent as delegates from the Farmville Methodist, church to Cou erence. Every body expects Dr. Lambeth tò come back and oontinae to oome back until bis full teru has been ended. No pastor for ths Baptist churc as yet. An inviting field lor some man of God of that faith. Mr. John Lancaster, who lèi as fisherman .is now the only hnnter bringing in the turkeys. He kills only òlio a day as tie iaht anxious to tote two at a time Qf coarse he kills them on the Cumberland side where most-good things do grow. Speaking of fhht old coanty I am reinindedof Mr. Shannbu rho farmed there for some years and then went back West He ia now id Minneapolis end yesterday sent a paper from that city decribing a rat proof bag npon"}, "highlight": {"text": {"matched_tokens": ["McLees"], "snippet": "FARM VlLIiifi. Rev. <mark>McLees</mark>, the blind pr?acher front"}}, "highlights": [{"field": "text", "matched_tokens": ["McLees"], "snippet": "FARM VlLIiifi. Rev. <mark>McLees</mark>, the blind pr?acher front"}], "text_match": 1155199603042156665, "text_match_info": {"best_field_score": "1112352751616", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199603042156665", "tokens_matched": 2, "typo_prefix_score": 2}}
{"document": {"bbox": [1663.42, 481.1, 1844.57, 992.99], "bbox_id": "8d93ae595e", "file": "AppomattoxNewspapers_1939-1943a_0187.pdf", "page": 1, "text": "Dr tnd Mrs John S. McKeee and son, of Morganton, N .C ., Were recent visitors in the Burke home here. Miss Bess Christian, of the Med ical College of Virginia, Richmond, and David Christian, of Hampden- Sydney College, spent the week-end with their parents, Dr. and Mrs. D. A. Christian, Mr. and Mrs. Russell Jamerson, of Arlington, were visitors hare last week-end. William iand Calhoun Moore, of  Richmond, were home last, week-  end.,  Miss Katherine Burge, of S . T . C .  I Farmville, spent the week-end with her parents, Mr., and Mrs. H. M.  1 Burge.  I  Judge and Mrs. Joel W . Flood-  and Mr and Mrs. Calvin H. Rob-  inson attended the University of i R chmond, Universi y of North Caro-  lina football game in Richmond last I, Saturday. !j Miss Kate OBrien will be hostess ,to the contract brdge club Friday evening in Farmville. i 1 Mr. and Mrs. B. F. Schaubach and family, of  Crewe, spent, the 1 wek-end with her mother, Mrs. R. j Blanch Caldwell, who has been sick. Mrs. Robert Lynch is visiting re- I lativcs in Lawrenceville. 1 Miss Janie McKinney, who has I been sck ir.i the home of her sister, Mrs. Pcnnick, in Lynchburg, will return o her home here Saturday. Friends are glad to hear that M .S 3 McKinney is improving. Misses Frankie McKinney and Elaine McDearmon, Dr. C.H.Swing and H. Y. Spencer motored to Richmond Sunday. Mids Elizabeth McDearmon and Rchard McDdermon spent the past week-end wi h their parents, Mayor"}, "highlight": {"text": {"matched_tokens": ["McKeee"], "snippet": "tnd Mrs John S. <mark>McKeee</mark> and son, of Morganton,"}}, "highlights": [{"field": "text", "matched_tokens": ["McKeee"], "snippet": "tnd Mrs John S. <mark>McKeee</mark> and son, of Morganton,"}], "text_match": 1155199603042156665, "text_match_info": {"best_field_score": "1112352751616", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199603042156665", "tokens_matched": 2, "typo_prefix_score": 2}}
{"document": {"bbox": [994.12, 1582.47, 1151.31, 1640.62], "bbox_id": "7bc6117556", "file": "AppomattoxNewspapers_1902-1905a_0160.pdf", "page": 1, "text": "Mayor Falkenstein will hold th Am algam ated Association for the fu ture conduct of the McKeesport strikers. Three persons were killed in an ex pIson at the works of th e. Indepen dent .Powder tornpany- Carthage, Mis"}, "highlight": {"text": {"matched_tokens": ["Mayor"], "snippet": "<mark>Mayor</mark> Falkenstein will hold th"}}, "highlights": [{"field": "text", "matched_tokens": ["Mayor"], "snippet": "<mark>Mayor</mark> Falkenstein will hold th"}], "text_match": 1155199568682418297, "text_match_info": {"best_field_score": "1112335974400", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199568682418297", "tokens_matched": 2, "typo_prefix_score": 3}}
