{"document": {"bbox": [258.25, 272.11, 402.49, 429.21], "bbox_id": "ef395c5aef", "file": "AppomattoxNewspapers_1962-1965a_0273.pdf", "page": 1, "text": "Mr. and Mrs. Lyle Thomas had as their supper guests Friday Mrs. Ida Stratton, Mrs. Etta Routon and Sheldon, Mrs. Betty Walker Anderson, Mr. Raleigh Wright, Miss Mattie Wright, Mr. and Mrs. I. B. Wheeler. Dr. and Mrs. Northington were dihner guests of Miss Kate Dav idson and family last Wednes day. He may be remembered as a doctor in this neighborhood a long time ago. Mr. and Mrs. Stuart Barrell spent Saturday night with her father, Mr. J. O. Davidson."}, "highlight": {"text": {"matched_tokens": ["Northington"], "snippet": "Wheeler. Dr. and Mrs. <mark>Northington</mark> were dihner guests of"}}, "highlights": [{"field": "text", "matched_tokens": ["Northington"], "snippet": "Wheeler. Dr. and Mrs. <mark>Northington</mark> were dihner guests of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.44, 878.6, 2389.51, 1196.99], "bbox_id": "b27f6020c0", "file": "AppomattoxNewspapers_1922-1923a_0596.pdf", "page": 1, "text": "is walking around while Mrs. Mar tin, though not alle to sR up, is getting along very wall. Both have bad very bad oases of grippe. Rt-v. Mr. Murphy rilled his ap pointment at Trinity last Sunday and took home with him a nice quilt mxde by the ladies of the neighborhood, also six nice rugs for Trinity room in the parsonage. Mr. and Mrs. Frunk Drinkard, of Lynchburg, who spent Christ nar at his fathers have both been under the treatment of Dr. Northington for scarlet ftver, supposed to have I been contracted in Lynchburg. I Since their recovery Miss Etta I Drinkard has had the earns discs1  but Is ge ting aloag nicely. Li.  Northington seems to win the con I fldence and esteem of all with wbou. I he co.nes in contact. We pred5 I for him a brilliant future. We are sorry to say Mr. Wortley I Taylor, of Lynchburg is again at I the home of his uncle, Mr, F. M.l Taylor, eick with acute rheumatism."}, "highlight": {"text": {"matched_tokens": ["Northington"], "snippet": "the treatment of Dr. <mark>Northington</mark> for scarlet ftver, supposed"}}, "highlights": [{"field": "text", "matched_tokens": ["Northington"], "snippet": "the treatment of Dr. <mark>Northington</mark> for scarlet ftver, supposed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.44, 657.48, 2045.5, 1156.39], "bbox_id": "6e0dda9bb6", "file": "AppomattoxNewspapers_1954-1955a_0049.pdf", "page": 1, "text": "August 16 saw 75 campers from all over Virginia come to Holliday Lake camp site for two weeks of study at the Northington Nature Study Camp. This camp is sponsor ed by the Shenandoah District of the Virginia Federation of Womens Clubs and is in its ninth session. The directors for the third year are Mr. and Mrs. Russell Cummings, Lexington, with Mrs. William Carr, Amherst, as the nurse. Counselors, who were former campers, include Emma Lou Marchant, of Mathews Joanne Wilkinson, of Portsmouth Jesse Lee Mahone, Richlands Jim my Young, Covington Marsha Gteenshields, Arlington George Helms, Manassas Jim and Grey Hume, of Leesburg Susan Coe and Jeannette Foltz and Cabell Flour noy, of Lexington. This staff is join ed in instruction by Forest Patton, V. P. I. Extension E. W. Mundie, soil conservationist expert of V. P. I. C. W. Crist, soil conservationist of Buckingha mCounty Robert Holmes, Watershed Forester, Appo mattox William Kellner, of the Virginia Commission of Game and inland Fisheries, and Ralph Rainey. of Dillwyn. The newest feature of the camp will be instruction in nature art by Neil G. Payne, of Salem. Philip Clark and daughter, Margaret, of Hampton will be on hand with their full dress Indian costumes to show dances and tell legends. The treas ure hunt of Saturday, August 21 will be conducted by Roger M. Beebe, of Lexington. Campers from this area include Hal Flood, Jr., of Appomattox Shir ley Rae Baber, of Lynchburg Glen- his Carr, of Amherst. The largest delegation is from Lexington, with 25 on the bus from Rockbridge County. There are eight from Staun ton and six from Arlington."}, "highlight": {"text": {"matched_tokens": ["Northington"], "snippet": "of study at the <mark>Northington</mark> Nature Study Camp. This"}}, "highlights": [{"field": "text", "matched_tokens": ["Northington"], "snippet": "of study at the <mark>Northington</mark> Nature Study Camp. This"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [574.81, 758.05, 746.3, 964.6], "bbox_id": "c49dade633", "file": "AppomattoxNewspapers_1947-1949a_0260.pdf", "page": 1, "text": "And how many doctors do you think there were in Appomattox County at that time? One or two? Youre wrong! Travel wasnt easy then. A doctor could serve only a H mi tod territory. The  following were practicing medicine in Appo- matto County when Dr. Christian started Dr. R. A. North, at Oak ville Dr. D. Mott Robertson, near Spout Springy Dr. James Abbitt, at Appomattox Dr. D. N. Twyman, i at Appomattox Dr. Chap Jones,! at Appomattox Dr. F. H. .Lukin,  at Pamplin  Dr. Hart, at Pamplin  - Dr. Walker, at Evergreerj, Dr. I Northington, at Stonewall and at Concord, just across the county line, Dr. W. L. Ould was practic ing. That makes eleven doctors in the area !"}, "highlight": {"text": {"matched_tokens": ["Northington"], "snippet": "at Evergreerj, Dr. I <mark>Northington</mark>, at Stonewall and at"}}, "highlights": [{"field": "text", "matched_tokens": ["Northington"], "snippet": "at Evergreerj, Dr. I <mark>Northington</mark>, at Stonewall and at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
