{"document": {"bbox": [186.96, 1696.76, 215.16, 1703.76], "bbox_id": "2de172419d", "file": "AppomattoxNewspapers_1898-1902a_0515.pdf", "page": 1, "text": "NORTH."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "<mark>NORTH</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "<mark>NORTH</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.8, 747.28, 1940.76, 754.78], "bbox_id": "dbfbe17824", "file": "AppomattoxNewspapers_1902-1905a_0101.pdf", "page": 1, "text": "North"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "<mark>North</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "<mark>North</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [817.17, 1275.76, 841.7, 1286.26], "bbox_id": "2818c551d8", "file": "AppomattoxNewspapers_1943-1947a_0348.pdf", "page": 1, "text": "north."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "<mark>north</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "<mark>north</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.31, 479.88, 1816.33, 666.08], "bbox_id": "30f7b44c11", "file": "AppomattoxNewspapers_1960-1962b_0435.pdf", "page": 1, "text": "zon. And, in looking straight up at the Northern Cross, Vega will be seen about one-fourth of the way toward the horizon dug west. Further, the Little Dipper will be seen almost midway between the Northern Cross and the Big Dipper, that is, in the middle north western sky. An interesting star in the Sep tember sky is Altair. Altair will be found about one-third of the dis tance to the southern horizon from the Northern Cross. It is a bright star and one of our closest neigh bors. It is not a large star, but it is bright because it is so close only fifeen light years away."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "is, in the middle <mark>north</mark> western sky. An interesting"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "is, in the middle <mark>north</mark> western sky. An interesting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2413.88, 1256.97, 2574.53, 1489.22], "bbox_id": "b26690f1bc", "file": "AppomattoxNewspapers_1915-1918a_0130.pdf", "page": 1, "text": "Zeppelins Built Since the War. According to a dispatch from Berne, Switzerland, there are now some eighty Zeppelins in the German service. This statement is said to be based on information developed at Friedricbshafen, where the airship works are located. Recently one of the latest type Zeppelins made a trial flight. 1 bore the number LZ-95, and in design varied considerably from the ante-bellum Zeppelins. Its gondolas are said to be of plated steel. The craft is plentifully supplied with ma chine guns and apparatus for throw ing bombs and aerial torpedoes among tho latter being a new typo which is reported to be far more pow erful then any heretofore developed. In fact, rumor has it that the new i aerial torpedo is to play a prominent part in the event of the German war ships and Zeppelins coming out from their sheltering harbors and engaging in battle with the British fleet in the North sea.Scientific American."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "British fleet in the <mark>North</mark> sea.Scientific American."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "British fleet in the <mark>North</mark> sea.Scientific American."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [202.55, 579.06, 382.52, 1462.4], "bbox_id": "37888a554b", "file": "AppomattoxNewspapers_1908-1909a_0375.pdf", "page": 1, "text": "Zedeklah was made king ot Judah by the king of Babylon U Kings  54  17 , but In spits of this kindness and the word of the Lord spoken to bint by Jeremiah Jet. 8417, 18. cf. Jer. 523, be febelled against tbeHng of Babylon. Be relied upon the help, tof Egypt, but all that Egypt could do was to cause tempo.sfy Interruption of tbe siege of Jerusalem. L The Siege of Jerusalem  tv . 1-3.  L Tbe time vv. L 2. It began on tbe tenth day of tbe  tenth month of the ninth year of  Zedeltlahs reign and lasted about  eighteen months.  The tenth month, according to the Jewish calendar, cor 1 responds to our December, January, Igg their calendar year began about j the middle of March. Tbe reason i the exact time la given is that this i was to be an event of great tmpor Itance to the Jews In their exile. t. 2. Tbe method  t . 1. Nebuehad nezzar came with a large army and l encamped against Jerusalem and built I forts against it round about It is thought that siege walls were built ! ground the city, abutting. It In. On the tops of these walls forts were I built from which missiles of destrnc- tlon could be bnrled by their engines  of year against tbe city. j  Tbe famine v. 8. i f Oelkle says, It wan speedily fol-  lowed, as is always tbe case, with an  outbreak of pestilence Food was iweli-nigb gone There bad long been k no bread. Mothers were at last driv- . en to murder and eat tbelr children. I . Tbe richest cltlsens wandered about searching for scraps In the dong hills. It Is estimated that one-third of the people of Jerusalem died of  starvation. It. Zedeklah Flight and Fate 4-7.  ki- J p p l Tbe city was broken up . 4. The Chaldeans had succeeded In making an opening in tbe wall so -  j large that they could make tbelr way .Into tbe city In spite of all that tbe k Hebrews could do. 2. Zedeklahs flight v. 4. Tbe king with his men of war fled night toward the plain. His ob- no doubt was to cross the Jor dan at Jericho ana bide in tbe moun tains east of tbe river. 3. Zedekiahs fate vv. 8-7.  1  He was overtaken In the plains Jericho v. 5, When his flight discovered, the Chaldean army pursued and captured him. 2 Be was brought to the king of Babylon at Rlblab v. , a town north of Da mascus. It was tbe kings headquar ters from which he directed his armies against Tyre and Jerusalem. Zedeklah was tried as a criminal be fore Nebuchadnezzar. 3 His fate v. 7. His sons were slain In his sight bis eyes were put out he was bound with fetters of brass and they carried him tc Babylon where he re mained prisoner until the day of his death Jer. 5211.  III. Jerusalem Destroyed w. 8-10. The dismantling of the city was de layed a month, pJthaps awaiting In structions from Nebuchadnezzar, who was at Rlblah. f L They trarnt of the house of the Lord v. 9. This was the sacred temple bnllt by Solomon, with additions And mod ifications. Before burning It waa de spoiled of all Its sacred contents. ... 2. Burnt the kings bouse v. 9. This was doubtless the palace built far Solomon. - 81Hurnt all the houses of Jerusa lem v. 9. Ill The Implication la that the common   Houses wereleft tor the people -i - m y r r r    c 4. They breko down the walls of"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Rlblab v. , a town <mark>north</mark> of Da mascus. It"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Rlblab v. , a town <mark>north</mark> of Da mascus. It"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1123.17, 469.82, 1283.47, 1585.51], "bbox_id": "022e619294", "file": "AppomattoxNewspapers_1922-1923a_0048.pdf", "page": 1, "text": "Zedekiah was made king of Judah by the king of Babylon 2417, but in spite of this kindness and the word of the Lord spoken to him by Jeremiah Jer. 3817, 18 cf. Jer. 523, he re belled against the king of Babylon. He relied upon the help of Egypt, but all that Egypt could do was to cause temporary interruption of the siege of Jerusalem. I. The Seige of Jerusalem vv. 1-3. 1. Time of vv. 1, 2. It began on the tenth day of the tenth month of the ninth year of Zedekiahs reign and -lasted about eighteen months. The tenth month according to the Jewish calendar corresponds to our December- January, as their calendar year began about the middle of March. The reason the exact time is given is that this was to be an event of great importance to the Jews in their exile. 2. The Method v. 1. Nebuchadnez zar came in person with a large army and encamped against Jerusalem and built forts against it round about. It is thought that siege walls were built, around the city, shotting it in. On the tops Of these walls forts were built from which missiles of destruction could be hurled by their engines of war against the city. With the city shut in its fall was only a question of time. 3. The Famine v. 3. Gelkie says It was speedily followed, as is always the case, with an outbreak of pesti lence. Food was well-nigh gone. There had long been no bread. Moth ers were at last driven to murder and eat their children. Tlie richest citi zens wandering about searching for scraps in the dunghills. Even outside the city the people were starving. There was no bread for the people of the land. It is estimated that one- third of the people of Jerusalem died of starvation. II. Zedekiahs Flight and Fate vv. 4-7. 1. The City was Broken Up v. 4. The Chaldeans had succeeded in mak ing an opening in the wall so large that they could make their way into the. city in spite of all that the He brews could do. Resistance was car ried on to the bitter end. 2. Zedekiahs Flight v. 4. The king with his men of war fled by night to ward the plain. His object, no doubt, was to cross the Jordan at Jericho and hide in the mountains east of Jordan. 3. Zedekiahs Fate vv. 5-7. 1 He was overtaken in the plains of Jericho v. 5. When his flight was. discovered the Chaldean army pursued and cap tured him. 2 He was brought to the king of Babylon at Riblah v. 6. Riblah was a town north of Damascus. It was the kings headquarters from which he directed his armies against Tyre and Jerusalem. Before Neb uchadnezzar, Zedekiah was tried as a criminal. 3 His.fate v. 7. His sons were slain in his sight his eyes were put out he was bound with fet ters of brass and they carried him to Babylon where he remained pris oner until the day of his death Jer. 5211. III. Jerusalem Destroyed vv. 8-10. The dismantling of the city was de layed a month, perhaps awaiting in structions from Nebuchadnezzar, who was at Riblah. 1. They Burnt the House of the Lord v. 9. This was the sacred temple built by Solomon with additions and modifications. Before burning it they plundered it of all its sacred contents. 2. Burnt the Kings House v. 9. This was doubtless the palace built by Solomon. 3. Burnt All the Houses of Jeru salem v. 9. The implication is that the common houses were left for he people v. 12. 4. They Broke Down the Walls of Jerusalem. The aim was to render the walls useless as a means of de fense. IV. The Disposition of tho People vv. 11, 12. 1. Carried Them Into Captivity v. 11. The people who were left In the city and those who had deserted to the Babylonians were carried to Baby lon all such as would be of use in Babylon. 2. The Poorest of the Land Were Left v. 12. The people who would not likely make any trouble were left as vine-dressers and husbandmen Doubtless they were looking forward to colonization by foreign peoples. The object in leaving these people was that the country might be ready for their coming. Over these people Gedaliah was appointed as governor, with head quarters at Mizpah."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Riblah was a town <mark>north</mark> of Damascus. It was"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Riblah was a town <mark>north</mark> of Damascus. It was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1833.1, 1123.58, 1980.71, 1309.64], "bbox_id": "7f1b7b1130", "file": "TimesVirginian_1976_0218.pdf", "page": 1, "text": "zAnn.oun.ce. UBixtn Mr. and Mrs. Larry Stallings announce the birth of a daughter, Lynn, born May 7th. They are also parents of a 3 year old daughter, Wendy Renee. Paternal grandparents are Mr. and Mrs. Alfred M. Moore of Concord and maternal grandparents are Mr. and Mrs. J. H. Stallings Jr. of Belvedere, North Carolina. Her grand mothers are Mrs. Mundy Moore of Concord and Mrs. J. H,j Stallings Sr. of Belvedere North Carolia. Mrs. Stallings is the former Barbara Moore."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Stallings Jr. of Belvedere, <mark>North</mark> Carolina. Her grand mothers"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Stallings Jr. of Belvedere, <mark>North</mark> Carolina. Her grand mothers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1380.28, 596.34, 1527.97, 1157.54], "bbox_id": "7f82f337ca", "file": "AppomattoxNewspapers_1918-1922a_0034.pdf", "page": 1, "text": "Z. T. O sborn iir Z T. Osborn, an old Con federate soldier of this place, died last Friday morning after abrief illness. He had been jnhi8iuual good health up to ifew days of his last sickness, then he was taken very sick i rapidly gave way and the I came quickly. Ur. Osborn was born in North Carolina in the year 1843, and Sserved his native State in the Confederate army. He served through the four years and vagatthe surrender at Appo mattox. He married Miss Hilah Os I born , also of North Carolina, tho died in 1899. Soon after hiamarriage he moved to Smith county, Va., and since that time has been a citizen of f  ite. A few years ago he bought a farm in this neighbor bood and with his son and daughter moved to this place. Mr. Osborn was a member of Heinorial Methodiatcburch and a very earnest, sincere man, honored and respected by his neighbors. Tba funeral services w ee conducted from the borne by hiapagtor, Rev. L F. Callahair, interment at Liberty cemetery. Mr. Osborn is survived by four one and four daughters, as follows B. V. Osborn, of Tennessee E. J. Osborn, of 8mith ccunty and W. F. and ff. W. Osborn, of this place Mrs, 0 J. James, Mrs. A P Boland and Misses R M. and Janett M. Osborn, of this place The community is in sympa thy with the bereaved."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Osborn was born in <mark>North</mark> Carolina in the year"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Osborn was born in <mark>North</mark> Carolina in the year"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [375.85, 547.36, 524.16, 1351.95], "bbox_id": "b6e0617cd8", "file": "AppomattoxNewspapers_1918-1922a_0602.pdf", "page": 1, "text": "ywshington.Immediate steps to Reestablish the value of farm products Raa parity with those of other com- aiodtties was asked of Congres and president Harding by the National Agricultural Conference through the Ittnanimous adoption of a resolution to that effect. The resolution was con- Itaiued in a report from the marketing committee and members said Its adop tion meant that something must be done by the President and Congress Itatnedlately. The resolution follows! -H Is the sense of this committee  that the Congress and the President of the United States should take such rte as will immediately re- establish a fair exchange value for ill farm products with that of all other  commodities. The conference at the same time rejected a resolution of the National Farmers Union, offered by J. S. Wan- Ihamaker, of South Carolina, which would have called for a Government minimum price guarantiee on farm products. Some measure of stabilization of prices was advocated by J. M. Ander- rson of St. Paul, Minn., who said some such step should be taken until Eu- frooe is restored economically. He favored participation of the United States in European readjustments, hut said We dont want to embarrass the President by asking more entangle- ments In foreign affairs. E. B. Page, of North Dakota, asked I for a minimum guarantee ou wheat for I two years. The conference previously had  adopted a resolution which read With respect to the question Of I Governmental price guarantees, we. feerthat there should be a compre hensive study of this subject. There fore, we urge that the Congress cause j a careful investigation of this whole I problem to be made by some proper authority which will report its find ings as early as practicable. Co-operation of farm marketing was j also recommended and indorsed.  Commendation of the agricultural bloc in Congress was voted unani- ! mously by the Conference through un animous adoption of the report of the ! committee on agriculture and price relations.  The committee also recommended and the conference adapted resolu tions urging the Government to use Its offices to aid in the economic ré habilitai ion of Europe and expressing the belief that such steps should be taken as necessary to limit acreage of particular crops to balance produc tion and restore the farmers dollar to Its normal purchasing .power. Other resolution reported by the committee which were adopted includ ed approval of the program of the American Arms Conference delegation, commended the investigation by the Dwart.ments of Commerce and Justice of retail prices, urged mofe vigorous action in the placing of agriculture on parity with other industries, advocated the gathering and distributing of foreign markets end production re- ports by the Department of Agricul ture and urged investigation by Con gress of plans to stabilize the dollar And equal tariff protection."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "E. B. Page, of <mark>North</mark> Dakota, asked I for"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "E. B. Page, of <mark>North</mark> Dakota, asked I for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [559.2, 1659.57, 721.91, 1706.02], "bbox_id": "9a8bb5b0e3", "file": "AppomattoxNewspapers_1912-1915a_0514.pdf", "page": 1, "text": "Yukon in Fifth Place. A government survey resulted in ranking the Yukon river in fifth place among the great streams of North America."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Yukon in Fifth Place. A government survey resulted in ranking the Yukon river in fifth place among the great streams of <mark>North</mark> America."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Yukon in Fifth Place. A government survey resulted in ranking the Yukon river in fifth place among the great streams of <mark>North</mark> America."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2018.86, 347.26, 2189.63, 545.41], "bbox_id": "6267b9cfc0", "file": "AppomattoxNewspapers_1954-1955a_0060.pdf", "page": 1, "text": "Youth Exchange program is getting into full swing. By the end of next week four foreign visitors will begin an ex tended stay on Virginia farms. They are Miss Margaret Martin, North ern Ireland, who arrived on Friday, August 20 Seppo Olavi Kanervisto, Finland, due Friday, August 27 Fer nando Bozo Vargas, Costa Rica, and Miss Elizabeth Aebi, both scheduled to arrive Thursday, September 2. All of them will stay until early October. Returned last week from Costa Rica was Dominic Lay, Fair fax 4-Her. Scheduled to leave Vir ginia September 11, also under the IFYE program, is Miss Edith Frame, of Quinton, who will go to New Zealand."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "are Miss Margaret Martin, <mark>North</mark> ern Ireland, who arrived"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "are Miss Margaret Martin, <mark>North</mark> ern Ireland, who arrived"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2399.48, 1506.03, 2488.71, 1518.6], "bbox_id": "329e2602af", "file": "AppomattoxNewspapers_1892-1898a_0400.pdf", "page": 1, "text": "Yours truly. p . G. .NORTH,"}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "Yours truly. p . G. .<mark>NORTH</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "Yours truly. p . G. .<mark>NORTH</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2359.44, 1714.96, 2516.51, 1754.39], "bbox_id": "d1b397ea8a", "file": "AppomattoxNewspapers_1905-1912a_0338.pdf", "page": 1, "text": "Your Picture on a Button io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block North of Court Green."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Your Picture on a Button io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block <mark>North</mark> of Court Green."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Your Picture on a Button io cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties Enlarging, Ac. Studio on Block <mark>North</mark> of Court Green."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [325.48, 1548.42, 481.55, 1587.34], "bbox_id": "477d472410", "file": "AppomattoxNewspapers_1905-1912a_0364.pdf", "page": 1, "text": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block North of Court Green."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block <mark>North</mark> of Court Green."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field Photographed. Novelties, Enlarging, o. Studio on Block <mark>North</mark> of Court Green."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2389.44, 1714.05, 2553.99, 1754.25], "bbox_id": "b307b0459f", "file": "AppomattoxNewspapers_1905-1912a_0318.pdf", "page": 1, "text": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block North of Court firnru"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block <mark>North</mark> of Court firnru"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Your Picture on a Button 10 cents. Homesteads, Tobacco and Wheat Field a Photographed. Novelties, Enlarging, Ac. Studio on Block <mark>North</mark> of Court firnru"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1175.97, 1715.57, 1334.33, 1756.18], "bbox_id": "db871c8d0e", "file": "AppomattoxNewspapers_1905-1912a_0314.pdf", "page": 1, "text": "Your Picture on a B utton io cents- Homesteads, Tobacco and W heat Fields Photographed. Novelties, Enlarging, Studio on Block North of Court Green."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Your Picture on a B utton io cents- Homesteads, Tobacco and W heat Fields Photographed. Novelties, Enlarging, Studio on Block <mark>North</mark> of Court Green."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Your Picture on a B utton io cents- Homesteads, Tobacco and W heat Fields Photographed. Novelties, Enlarging, Studio on Block <mark>North</mark> of Court Green."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1969.88, 1669.68, 2114.23, 1722.18], "bbox_id": "b5cc0bb95f", "file": "AppomattoxNewspapers_1974-1975a_0572.pdf", "page": 1, "text": "Your letters should be in our I office Thursday or Friday of this week so that we can get  them in the paper and then sent j on to the North Pole."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "j on to the <mark>North</mark> Pole."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "j on to the <mark>North</mark> Pole."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [489.82, 913.22, 651.77, 1087.77], "bbox_id": "3f528dd5d2", "file": "AppomattoxNewspapers_1905-1912a_0228.pdf", "page": 1, "text": "Young W omans Slayer Himself Fired At, He Says. F ort W orth, Tex. Special.-Miss Lula W illiams, aged 25 years, daugh ter of T. L. W illiams, a prosperous farm er, living six miles north of Ar lington, was shot and killed by R. H Bates, aged 40, a farm er, in front of Bates home. Bates stated he was called to the door and after a pistol shot had been fired at him, he seized a shotgun and fired into the dark ness. There was no outcry although he discerned a fleeing figure. An hour later the woman was found dead In front of the gate. She was dressed in a m ans overcoat and cap. Bates is under arrest."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "er, living six miles <mark>north</mark> of Ar lington, was"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "er, living six miles <mark>north</mark> of Ar lington, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [853.68, 1038.59, 1013.84, 1247.03], "bbox_id": "bb6e695efc", "file": "AppomattoxNewspapers_1915-1918a_0006.pdf", "page": 1, "text": "Young animals make more pounds of gain from their food then when old er. Dean Henry of Wisconsin gath ered a lot of data on thin and found that SSHwund pigs required J 39 pounds of feed,to make 100 pounds of pint 78-pound pigs required 400 pounds of feed, 128-pound pigs 437 pounds of feed, 174-pound pigs 483 pounds, 226- pound pigs 498 pounds, 871-pound pigs 511 pounds and for the 880- pound bogs It took 586 pounds of food I to make the 100 pounda of gain, or nearly twice as much as for the 38- pound pigs. j This emphasizes the Importance of I pushing the hoga from the start in or der to make the moet economical  gains. It has been found at the North Da-1 kota experiment station that April  plga can be made to weigh 200 to 250  pounds by November 1."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "been found at the <mark>North</mark> Da-1 kota experiment station"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "been found at the <mark>North</mark> Da-1 kota experiment station"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.42, 371.27, 1913.95, 909.97], "bbox_id": "a6706d0663", "file": "AppomattoxNewspapers_1912-1915a_0083.pdf", "page": 1, "text": "Youll find out fer yerself, mister, he answered sullenly, an maybe damn quick too. They are in the grape arbor to the south of the house, broke ln Eric. That was where Fa gin told them to lie quiet and wait orders. Then we will explore along the north side, keeping the fence between us. Ive got a handful of men over there ln the orchard. If you are both ready well go. I took a look myself at TomB rope- tying, and found It satisfactory. In deed, in remembrance of my own suf fering, l even loosened the strain a little, cohfldent the fellow could never free hlmBelf unaided. Then the three of us, Mortimer armed with his late guards gun, crawled up over the edge of the bank, raq without stopping across the open space, and crouched ln the shadow of the fence, tt was still dark, although a faint gray tinged the eastern sky-line, barely perceptible through the Intervening trees. The great house, a hundred yards away, was but a blurred outline, distinguish able by the lights shining out through open windows. At that distance no sound reached us. However, If Mor timer was right, the way would be clear for. our passage along the front, under shelter of the fence, even though ,a sentry was posted there, and we could creep up to the walls on the opposite side unobserved. All we needed to do wsb to advance With caution. Whispering directions Into the ears of the others, I move 4 for ward slowly, Mortimer close to my shoulder. I could see across the top rail of the fence, and the open space beyond yielded no point of conceal ment Tell me the rest of your story, I said, speaking softly, as we go along. Where did Fa gin take you? To a sand cave we rode a night and a day to get there. Treat you all right? Well as he could, I suppose. I had enough to eat, but was guarded close ly, and the fellows were a bit rough. Did you gain no Inkling of what they were up to? No tiie men I saw knew nothing, or pretended not to. I only saw Fagin twice. Once he came to assure him self that I was really myBelf. Some-"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "will explore along the <mark>north</mark> side, keeping the fence"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "will explore along the <mark>north</mark> side, keeping the fence"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [490.78, 700.29, 803.38, 804.24], "bbox_id": "680aacd7be", "file": "AppomattoxNewspapers_1905-1912a_0187.pdf", "page": 1, "text": "You trade at a Southern shoe store. You give the dealer your money. You probably buy a western or northern made shoe. When the dealer pays his bill, thfe money, less a small per cent to the dealer, goes north or west and the South is that much poorer. Keep your money at home. Let it work for better times, better wages, more factories, more work for Southern people."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "to the dealer, goes <mark>north</mark> or west and the"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "to the dealer, goes <mark>north</mark> or west and the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.06, 594.05, 1764.25, 1123.34], "bbox_id": "12b5899f81", "file": "AppomattoxNewspapers_1915-1918a_0461.pdf", "page": 1, "text": "you to hardship and possible impris onment. -  Iier eyes were shining, and her hand reached forth, unconsciously, and rest ed on mine. How long would It require? Week, probably I should choose the more northern route, around Scot land, and then skirt tho Norway coast through the North sea. To place me on some other vessel at sea would spoil your plan, Mr. Hol lis? It would render our chances of suc cess much less. The only possibility would be tlie meeting of some Ameri can ship, homeward bound, whose cap tain would promise to make no report. Such a one might be hard to find, espe cially if ho suspected we were endeav oring to carry munitions of war to Ger many.  Do you believe the Germans nre right in this warthat you ought to aid them? ,I cannot answer that, I answered honestly enough, for I do not fully understand the conditions. To be per fectly frank, however, my sympathies are with England and France. In this case I am not considering either side, but the poor devil who owns this ship and cargo. What we carry on board here will not be a drop In the bucket, but lts loss will spell ruin to him, and that Is the thought which In fluences me. And I could not even dispatch a messagewireless ? The Indian Chief has no equipment. No, Miss Vera, we shall bo absolutely lost to the world until we are either captured, br safe In some German port. I would not deceive youthe project Is both a desperate and a dangerous one., jT   The girl remained silent, her eyes lowered to the deck. I had said all possible, determined as I was not to Influence her decision. As she did not speak, or change her attitude, I arose nnd walked across the cabin to where I could look out forward. Mr. Hollis. Yes. I turned. I must decide this? You mean to leave It all to me?- There Is no other way. But I do not know what to say."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Norway coast through the <mark>North</mark> sea. To place me"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Norway coast through the <mark>North</mark> sea. To place me"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2299.9, 1704.55, 2463.14, 1798.15], "bbox_id": "3f682a9698", "file": "AppomattoxNewspapers_1905-1912a_0154.pdf", "page": 1, "text": "You Cant Como to Now York to Buy Yov Books, but 1 am here, and ready to buy them for yoo at, lowest prices. Keep la touch with me. A . B_ NORTH RI P. Room SOX, No. 500 Fifth Avenue. New York City. D R O P S Y ! BM BBTM g   Hollar P v m . Dr. M. H.  B S ir i BOlM, log a f ---- PATENTS V o S n E M m logSon. C.C! Boato murn"}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "with me. A . B_ <mark>NORTH</mark> RI P. Room SOX,"}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "with me. A . B_ <mark>NORTH</mark> RI P. Room SOX,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [503.36, 1394.6, 674.81, 1801.82], "bbox_id": "d41cbfecdb", "file": "AppomattoxNewspapers_1952-1954a_0271.pdf", "page": 1, "text": "You ask me whats my hobby? My hobby, sir, is ham. You ask me if Im serious. I tell you sir, I am. These verses by a bard of Bun combe County, whose name escapes us at the moment, incorporate a lot of truth. The man with a ham hobby is serious about it. He will argue for his particular kind of ham, even if he hasnt tasted it in years, with all comers and at all hours. People will argue about many things, such as how mint julips ought to be made, but no people argue more than those about how true and proper hams -ought to be cured. There is a story that a North Carolinian, a Virginian, a Tennes sean and a South Carolinian Dr. R. G. Coker of Chapel Hill, so the story goes were arguing about how long it should take to cure a ham. Con noisseurs from the first three states were making the time longer, and until they came to Dr. Coker and asked him How long do you take to cure a ham in South Carolina? I dont know, said Dr. Coker. You dont? came the chorus. No, he said, in .South Carolina we inherit our hams. We have about quit selling the good, old ones in North Carolina, so we reckon it is about time for us to start inheriting them. In Georgia, however, they have a apeed-up process. They hang their hams inside a barrel with the bot tom knocked out and run th smoke"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "a story that a <mark>North</mark> Carolinian, a Virginian, a"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "a story that a <mark>North</mark> Carolinian, a Virginian, a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1144.79, 371.01, 1335.62, 874.65], "bbox_id": "8d0af65a35", "file": "AppomattoxNewspapers_1960-1962b_0047.pdf", "page": 1, "text": "You and each of you are here-1 I by notified that the undersigned Herbert N. Carter, has purcha! and now claims complete and ab solute ownership o f that tract o . land containing approximately  I acres, be the same more or less, however, which tract of land is lo cated in Francisco Magisterial Dis trict irr the County of Buckingham, State of Virginia and is situated a- K 3  . North of OhertnM Grove -Church, in the sa id . County land is adjoined by the lands _of W alter Morris, Sam Scruggs, Piedmont Lumiber Company M others and it is the same tract of land th a t was standing on the tenc books of Buckingham County, Vir ginia in the year 1944 m the name of Mary F. Wooldridge and chil dren and being the same tract of land th at was deeded unto one H. I C OBrien hy W. C. Quid and Adi-1 die C. Ould by a deed dated May 13 1948 of record in the Clerk si Office of Buckingham County in U sed book . no. 4 8 ... at page 593 thereof and the same tract of ndT I that was deeded unto the under signed, H erbert N. Carter and wife, from H. C. 0 BTien and wife I by a deed dated October 17, 1959 land admitted to record in the said  Clerks Office on- November 16, 1959. I The undersigned and his wife do from the day that they acquired the property- and have from the day they acquired the property hold and assert ownership and! claim com plete and adverse ownership and UEIe to tter en tire- 75 acres -of-tewa against all persons whosoever and -particularly the heirs at law   4 successors in title of the saMjTMterir F. Wooldridge, daughter of W il liam Sfcruggs, and the said Dr. W. L. Guld. H erbert N. Carter. Itc .-"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "situated a- K 3  . <mark>North</mark> of OhertnM Grove -Church,"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "situated a- K 3  . <mark>North</mark> of OhertnM Grove -Church,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1350.25, 436.79, 1508.74, 647.54], "bbox_id": "cde9a56c0b", "file": "AppomattoxNewspapers_1898-1902a_0323.pdf", "page": 1, "text": "York-River Line, Dally except Sunday For Baltimore, Philadelphio, New York, and all points north aud east. U. S. mail steamers Charlotte aud  Baltimore. Steam heat, electric lights, luxurious staterooms, diniug- room on saloon deck. Fare2.50 one way, 4 for round trip. Express train leaves Richmond, Southern Railway station, daily except Sun day, at 430 p . u ., connecting with steamers at West Point 550 p . m arriving Baltimore at 8 A. u. Tbe favorite route to Atlantic City, Cape May, Niagara Falls, and all eastern resort points and commercial cen tres. Excursion tickets now on sale via this route to all of the above points  also to West Point Ne v York aud all eastern resort points. C. W. W estbu r y , T. P. A."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "York, and all points <mark>north</mark> aud east. U. S."}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "York, and all points <mark>north</mark> aud east. U. S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [801.89, 512.19, 960.15, 724.18], "bbox_id": "9801688c16", "file": "AppomattoxNewspapers_1898-1902a_0311.pdf", "page": 1, "text": "York-River Line, Daily except Sunday For Baltimore, Philadelphio, New York, aud all points north and east. U. S, mail steamers Charlotte aud Baltimore. Steam heat, electric lights, luxurious staterooms, dining room on saloon deck. Fare2.50 one way, 4 for round trip. Express train leaves Richmond, Southern Railway station, daily except Sun day, at 430 p . u., connecting with steamers at West Point 550 P. 11 ., arriving Baltimore at 8 A. m . The favorite rente to Atlantic City, Cape May, Niagara Falls, and all eastern resort points aud commercial cen tres. Excursion tickets now on sals via this route to all-of the above points also to West Point New York and ail eastern resort points. C. W. W e st b u r y . T. P. A."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "York, aud all points <mark>north</mark> and east. U. S,"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "York, aud all points <mark>north</mark> and east. U. S,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [411.37, 821.39, 572.02, 1033.85], "bbox_id": "e87e663490", "file": "AppomattoxNewspapers_1898-1902a_0331.pdf", "page": 1, "text": "York-River Line, Daily except Sunday For Baltimore, Philadeiphio, New fork, and all points north and east. , S, mail steamers Charlotte and I Baltimore. Steam heat, electric lights, luxurious staterooms, diuing- room on saloon deck. Fare2.50 lone way, 4 for round trip. Express train leaves Richmond, Southern Railway station, daily except Sun- Iday, at 430 p. m ., connecting with steamers at West Point 550 P. m ., arriving Baltimore at 8 A. M. The favorite route to Atlantic City, Cape IMay, Niagara Falls, and all eastern jresort points and commercial cen- Itres. Excursion tickets now on sale Jvia this route to all of the above points also to West Point Nev York and all eastern resort points. C. W. W e s t b u r y , T. P. A."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "fork, and all points <mark>north</mark> and east. , S, mail"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "fork, and all points <mark>north</mark> and east. , S, mail"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.41, 1194.13, 493.54, 1568.42], "bbox_id": "aedb412fb8", "file": "AppomattoxNewspapers_1898-1902a_0235.pdf", "page": 1, "text": "YORK RIVER LISE VIA WEST FOIST, THE FAVORITE ROUTE NORTH. LEAVE RICHMOND, 430 p. m .No. 16, Baltimore Limited, daily except Sundays, for West Point and intermediate stations, mak ing close connection at West Point with steamers for Balti more. 230 p. 11 .No. 10, local express, daily ex cept Sunday, for West Point and Intermediate stations. Con nects with stage at Lester Manor forWalkerton andTappahannock also, at West Point with steamer for Baltimore. Stops at all stations. 500 a . m .No. 46, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and intermediate stations, connecting with stage at Lester Manor for Walkerton and Tap- pahannock. TRAINS ARRIVE AT RICHMOND. 920 A. M.Daily. 1045 a . m .Except Sundays and Mondays. 530 p. m .Dally except Sunday from West Point and intermediate stations. Steamers leave West Point, daily except Sunday, 600 p. m., arriving Baltimore 830 following morning returning, leave Balti more at 600 p. m. daily except Sunday, ar riving West Point 730 and Richmond 020 following morning.  Steamers call at Almonds Wharf and Gloucester Point Tuesdays, Thursdays and Saturdays at Claybank and Yorktown Mon days, Wednesdays and Fridays. C. W. WESTBURY, Trav. Pass. Agent, 920 East Main street, Richmond, Va. J. M. CULfr, W. A. TURK, Traffic Manager. Genl Pass, Agent, F. S. GANNON. Third Vice-President and Genl Manager. WASHINGTON, D. O. ___________ NWWWestem"}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "FOIST, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND, 430 p."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "FOIST, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND, 430 p."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [382.85, 1165.42, 541.21, 1351.51], "bbox_id": "77acf41eac", "file": "AppomattoxNewspapers_1898-1902a_0373.pdf", "page": 1, "text": "YORK RIVER LINE VIA WK8T POINT, TU kAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 p . m .N o . 16. Baltimore Limited, daily except Sundays, for West Point and Intermediate stations, mak ing close connection at West Point with steamers for Balti more. 236 p. m .N o . 10, local express, dailv ex cept Buuday-, for West Point and intermediate stations. Con-- nects writh stage at Lester M anbr for Walkertou aud Tappahnnr nock also, at West Point with steamer for Baltimore. Stops ut all stations. 500 a . M.No. 71, local mixed. Leaves daily except Sunday from Vir ginia street Station for West Point and intermediate station, connecting with stage at Lesui Manor for Walkerion and Tap- pahs unock TRAINS ARRIVE IN RICHMOND."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "POINT, TU kAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p"}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "POINT, TU kAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [393.62, 1202.4, 554.9, 1544.25], "bbox_id": "7303f7dd2c", "file": "AppomattoxNewspapers_1898-1902a_0240.pdf", "page": 1, "text": "YORK RIVER LINE VIA WEST POINT, THE FAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 r. m .No. 16, Baltimore Limited, daily except Sundays, for West Point and Intermediate stations, mak ing close connection at West Point with steamers for Balti more. 230 p. m .No. 10, local express, daily ex cept Sunday, for West Point and intermediate stations. Con nects with stage at Lester Minor forWalkertou andTappahannoek also, at West Point with steamer for Baltimore. Stops at all stations. 500 A. M.No. 46, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and intermediate stations, connecting with stage at Lester Manor for Walkerton and Tap- pnbannock. TRAINS ARRIVE AT RICHMOND. 920 A. M.Daily. 1045 a . m .Except Sundays and Mondays. 530 p. M.Daily except Sunday from West - Point and intermediate stations. Steamer? leave West Point, daily except Sunday, 600 p. m., arriving Baltimore 830 following morning returning, leave Balti more at 500j. m. daily except Sunday, ar riving West Point 730 and Richmond 920 following morning. Steamers call at Almonds Wharf and Gloucester Point Tuesdays, Thursdays and Saturdays at Claybank and Yorktown Mon days, Wednesdays and Fridays. C. W. WESTBURY, Trav. Pass. Agent, 920 East Main street, Richmond, Va. J. M. CULP, W. A. TURK, TralHc Manager, Genl Pass. Agent, F. s. GANNON, Third Vice-President and Genl Manager. WASHINGTON, D. O."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "POINT, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 r."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "POINT, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 r."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [400.09, 1242.47, 559.01, 1417.32], "bbox_id": "bd8eebc11e", "file": "AppomattoxNewspapers_1898-1902a_0426.pdf", "page": 1, "text": "YORK RIVER LINE VIA WEST P O I N T H E FAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 r. u.No. 16, Baltimore Limited, daily except Sundays, for West Poiat and Intermediate stations, mak ing close connection at West Point with steamers for Balti more, Mondays, Wfdnsdays and Fridays. 230 p. m .No. 10, local express, daily except Sundays, for Wi9t Point and intermediate stations. Connects with stage at Lester MAnor for Walkerton and Tnppa- honnock also, at West Point with steamer for Baltimore. Stops at all stations. 500 a . m . No. 74, local mixed. Leaves daily except Sunday for West Point and intermediate stations, connecting with stage at Lester Manor for Walkerton and Tap- pahannock."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "H E FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 r."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "H E FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 r."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [225.08, 1210.51, 381.85, 1383.91], "bbox_id": "c9f927909c", "file": "AppomattoxNewspapers_1898-1902a_0385.pdf", "page": 1, "text": "YORK RIVER LIKE VIA WEST POIR?, THE FAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 p. m . No. 16, Baltimore Limited, daily except Sundays, for West Point and intermediate stations, mak ing close connection at West Point with steamers for Balti more. 280 p. m . No. 10, local express, daily ex cept Sundays, for West Point and intermediate stations. Con nects with stage at Lester Ms nor for Walberton nud Tappnhan- nock also, at West Point with steamer for Baltimore. Stops at ail stations. 500 a . m . No. 74, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and intern1 ediate stations, connecting with stage at Lester Manor for Walker ion and Tap- pahnnnock."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "POIR?, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "POIR?, THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1099.14, 1251.29, 1255.26, 1496.63], "bbox_id": "bba8919292", "file": "AppomattoxNewspapers_1898-1902a_0592.pdf", "page": 1, "text": "York, Pa., Special.Part of through train for the West which left Baltimore over the Northern Central Railway at 9 oclock was blown from the tracks by a big charge of dynamite soon after leaving this city at 10.44 P- M. The train was composed of four Pull man cars, a day coach, a combination car and express car. It was running at the rate of 45 miles an hour, when the engine struck the dynamite. Al though the windows in the locomotive cab were blown to pieces, Engineer Thurmer stuck to his post and succeed ed in stopping the heavy train after it had run over the ties for 200 feet. The scene of the wreck is about one mile north of the city, close to where Codorus creek flows between high hills The Northern Central crosses the stream on an open iron bridge, which is 50 feet above the bed of the stream. Conductor Grove says the bandits evi dently planned to throw the train into the creek. When the attempt failed the robbers we believe, took refuge in the hills."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "is about one mile <mark>north</mark> of the city, close"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "is about one mile <mark>north</mark> of the city, close"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1473.57, 1036.03, 1627.17, 1310.93], "bbox_id": "181bec916e", "file": "AppomattoxNewspapers_1918-1922a_0524.pdf", "page": 1, "text": "York, New Haven  LiartffffLehlgii  Hudson, and others. Lehigh Valley New York, Chicago  St. Louis Pittsburg  West Vfr- ginn, and others. Atlantic Coast line, Norfolk South ern, Florida East Coast. Mississippi Central, Louisville  Nashville and others. Illinois Central, Seaboard Airline Carolina, CHuchflehl  Ohio and others. Union Pacific lines, C hicago  North western, Wabash lines west of the Missouri and others. Chicago, Burlington  Quincy Northern Pacific Spokane, Portland  Seattle and others. Chicago, Milwaukee  St. Paul Great Northern and others. Atchison. Topeka  Santa Fe Colorado  Southern Denver  Itlo Grande Western Pacific and others. Southern Pacific company Chicago, Rock Island  Pacific El Paso  Southwestern Vicksburg, Shreveport  Pacific and others. Chicago  Eastern Illinois Mis souri Pacific Texas  Pacific Gull Const lines and others."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Pacific lines, C hicago  <mark>North</mark> western, Wabash lines west"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Pacific lines, C hicago  <mark>North</mark> western, Wabash lines west"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [124.48, 1006.08, 269.32, 1353.55], "bbox_id": "e3a53efb15", "file": "TimesVirginian_1980a_0367.pdf", "page": 1, "text": "York, in the heai of the Adirondack Mountains. It jvas more tkan a year ago when the Duvals first I began checking out different manufacturers of fog homes. Them are more than 200 log homo manufactureres in the - United States and Canada. Steve and Debra examined dozens of them  before making the decision to go with Lincoln Logs. If w When we first heard abopt Lincoln LogiPi said Debra, we thought it was JuM loogoedm be true. As a matter pf .fact, we were afraid there would be a catch to it, so we personally visited Lincolns home office ia sahestertown. When we walked through the front . door, we knew this was what we panted. The Lincoln Logs Basie Log Home Package is the m ost com plete building material package in the  industry lor the money, according to the Duvals, Lincoln Logs Ltd is plaited to announce their acceptance into the North-"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "their acceptance into the <mark>North</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "their acceptance into the <mark>North</mark>-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.32, 730.81, 1174.26, 905.75], "bbox_id": "b89ec5b148", "file": "AppomattoxNewspapers_1898-1902a_0491.pdf", "page": 1, "text": "YORK GIVER LIN E VIA WEST FOIKV, THZ FAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 p. x . No. 10 , Baltimore Limited, daily except Sundays, tor West Point and intermediate stations, mak ing close connection at West Point with steamers or Balti more, Mondays, Wednesdays and Fridays. 230 p. H.No. 10 , local express, daily except Sundays, for West Point and intermediate stations. Connects with stage at Lester Manor for Walkerton aail Tappa- hannock also, at West Polo t with steamer for Baltimore. Stops at all stations. 600 a . m .No, 74 , local mixed. Leaves dally except Sunday for West Point and intermediate stations, connecting with stage at Lester Manor for Walkerion and Tnp- pahannock."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "FOIKV, THZ FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "FOIKV, THZ FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [465.09, 1204.97, 623.39, 1552.57], "bbox_id": "8657cc7538", "file": "AppomattoxNewspapers_1898-1902a_0272.pdf", "page": 1, "text": "YORK BIVER LINE VIA WEST POINT, THE FAVOBITE ROUTE NORTH. LEAVE BICHHOND. 430 p. m .No. 16, Baltimore Limited, dally except Sundays, for West Point and intermediate stations, mak ing dose connection at West Point with steamers for Balti more, Mondays, Wednesdays and Fridays. 230 p. x .No. 10, looal express. Mondays, Wednesdays and Fridays, lor West Point and intermediate stations. Connects with stage at lis te r Manor for Walkerton and Tappahannock also, at West Point with steamer for Baltimore Stops at all stations. 500 A. x.No. 74, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and intermediate stations, connecting with stage at Lester Manor for Walkerton and Tap pahannock. TRAINS ABBIVE AT BICHXOND. 920 A. x.Daily. From West Point, with connection from Baltimore, Tue- days, Thursdays and Saturdays. 1046 a . x.Wednesdays and Fridays. 640 p. x.Daily except Sunday from West Point and intermediate stations. Steamers leave West Point, Mondays, Wed nesdays and Fridays, 600 p. m., arriving Baltimore 830 following morning return ing, leave Baltimore at 500 p. m., Tuesdays, Thursdays and Saturdays, arriving West Point 730 and Richmond 90 following morning. Steamers call at all landings on York River. C. W. WE3TBUBY, Trav. Pass. A-fent, 920 East Main street, Richmond, Va. J. M. CULP, W. A. TURK, Traffic Manager. Genl Pass. Agent, F. S. GANNON, Third Vice-President and Genl Manager. WASHINGTON, D. a"}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "POINT, THE FAVOBITE ROUTE <mark>NORTH</mark>. LEAVE BICHHOND. 430 p."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "POINT, THE FAVOBITE ROUTE <mark>NORTH</mark>. LEAVE BICHHOND. 430 p."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [244.31, 1248.92, 403.77, 1423.2], "bbox_id": "89762a65c7", "file": "AppomattoxNewspapers_1898-1902a_0389.pdf", "page": 1, "text": "YORK BIVER LINE VIA WEST P O IN ., THE FAVORITE ROUTE NORTH. LEAVE BICHMOND. 430 r. m .No. 16, Baltimore Limited, daily except Sundays, for West Point aud intermediate stations, mak ing close connection at West Point with steamers for Balti more. 230 r. M.No. 10, local express, dally ex cept Sundays, for West Point and intermediate stations. Con nects with stage at Lester Manor for Walkerton and Tappahan- nock also, nt West Point with steamer for Baltimore. Stops at all stations. 800 a , m .No. 74, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and Intermediate stations, connecting with stage at Lester Manor for Walkerton and Tap- pahannock."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "IN ., THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE BICHMOND. 430 r."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "IN ., THE FAVORITE ROUTE <mark>NORTH</mark>. LEAVE BICHMOND. 430 r."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [312.96, 1227.37, 484.41, 1595.59], "bbox_id": "abe2c35dc2", "file": "AppomattoxNewspapers_1898-1902a_0244.pdf", "page": 1, "text": "yoke river line via west point , the FAVORITE ROUTE NORTH. LEAVE RICHMOND. 130 r. m .No. 16, Baltimore Limited, daily except Sundays, for West Toint and intermediate stations, mak ing clo?e connection at West Point with steamers for Balti more. 230 p. m .No. 10 , local express, daily ex cept Sunday, for West Point and intermediate stations. Con nects with stage at Lester Manor forWalkerton andTappnhacnoc.i also, at West Point with steamer for Baltimore. Stops at all stations. . 500 A. M.No. 46, local mixed. Leaves daily except Sunday from Vir ginia Street Station for West Point and intermediate stations, connecting with stage at Lester Manor for Walkorton and Tap- pabannoek.  TRAINS ARRIVE AT RICHMOND. 920 a . m .Daily. 1045 A. M.Except Sundays and Mondays. 530 p. m .Daily except Sunday from West Point and intermediate stations. Steamers leave West Point.-daily except Sunday, 600 p. m., arriving Baltimore 830 following morning returning, leave Balti more at 500 p. m. daily except Sunday, ar riving West Point 730 and Richmond J-0 following morning. __ ,  , Steamers call at Almond s Wharf and Gloucester Point Tuesdays, Thursdays and Saturdays at Claybank and Yorktown M ol - days, Wednesdays and Fridays. C. W. WESTBURY, Trav. Pass. Agent, 920 East Main street. Bichmond, Va. J. M. CULP, W. A. TURK Traffic Manager. Gen 1 Pass. Agent, F. 8 . GANNON, Third Vice-President and Genl Manager. WASHINGTON, D. 0. __________ NW MkWestem"}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "point , the FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 130 r."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "point , the FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 130 r."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [406.32, 1232.37, 561.92, 1406.65], "bbox_id": "5f6b7f20e2", "file": "AppomattoxNewspapers_1898-1902a_0434.pdf", "page": 1, "text": "YOBX RIVER LIRE VIA WEST F O I X T H E FAVORITE ROUTE NORTH. LEAVE RICHMOND. 480 v. M.No. 10, Baltimore Limited, daily except Sundays, lor West Foinl and intermediate stations, mat ing close connection at Wes P oin t with steamers for Balti more, Mondays, Wi dm sd Ry an d Fridays. 280 p. m .No. 10 , local express, chilli except Sundays, for W ts Point and Intermediate stations. Connects with stage at Lostei Manor for Walkerton and Tappa- hanuock also, nl West Point with steamer for Baltimore. Stops at all stations. 500 A. M.No. 74, local mixed. Loaves daily except Sunday for W-st Point and intent- 1 into stations, connecting wits stage at Lester Manor for Walkerton and Tap- pahaunock."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "H E FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 480 v."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "H E FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 480 v."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [254.15, 1200.47, 414.21, 1216.17], "bbox_id": "bb53110631", "file": "AppomattoxNewspapers_1898-1902a_0213.pdf", "page": 1, "text": "YOBK RIVER LINE VIA WEST POINT, TIIE FAVORITE ROUTE NORTH."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "YOBK RIVER LINE VIA WEST POINT, TIIE FAVORITE ROUTE <mark>NORTH</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "YOBK RIVER LINE VIA WEST POINT, TIIE FAVORITE ROUTE <mark>NORTH</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1413.1, 863.9, 1566.2, 1047.35], "bbox_id": "19297569ad", "file": "AppomattoxNewspapers_1898-1902a_0454.pdf", "page": 1, "text": "YOBK BITER LINK VIA WEST P01N., THP FAVORITE ROUTE NORTH. LEAVE RICHMOND. 430 p. if.No. Ill, Baltimore Limited, daily except Sundays, for West Point and intermediate stations, mak in it olose connection at Wes Point with steamers for Balti more, Mondays, Wednesdays anil Fridays. 230 p. it.No. 10, local express, dully except Hu mi ays. for West Point and intermediate stations. Connects with singe at Lester Manor forWalki-rtonandTnppa- hannock also, at West Point with steamer for Baitiaiore. Stops at all stations. 500 a . u. No. 74, local mixp.1. L nnves daily except Sunday for West Point and intermediate stations, connecting witk e.-.ige ut Lester Manor for Walkcrion end Tup- pahannock. TRAINS ARRIVE IN RICHMOND."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "P01N., THP FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "P01N., THP FAVORITE ROUTE <mark>NORTH</mark>. LEAVE RICHMOND. 430 p."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [729.84, 961.62, 1368.36, 1299.01], "bbox_id": "f15435db4b", "file": "AppomattoxNewspapers_1943-1947a_0259.pdf", "page": 1, "text": "YNCUBURO. V Takes Lot to Sink One Of Uncle Sams Ships WASHINGTON.A torpedo from a U-boat clipped off the stern of the destroyer escort Fogg, but her crew got her safely to a friendly port 400 miles away. The action occurred last Decem ber 20 north of the Azores in the Atlantic, but the navy withheld the story until recently. The Fogg has been repaired and is ready to fight again. The torpedo ripped into the ship just aft of the deckhouse when she turned to give assistance to a dis abled landing ship in a convoy. The explosion hurled the Foggs fantail into the air and the entire stern sec tion began to settle. Within minutes, a third of the ship was flooded. A bulkhead athwart- ships kept her afloat, however, until the remaining two-thirds of the ship could be made watertight. Finally, the entire stern section sheared off. The remainder of the ship re gained buoyancy and another vessel took the Fogg in tow. A jury rud der was rigged up, the ship was bal lasted, and eventually the Fogg was taken in tow and returned to the United States."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "last Decem ber 20 <mark>north</mark> of the Azores in"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "last Decem ber 20 <mark>north</mark> of the Azores in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.45, 632.32, 2039.55, 959.31], "bbox_id": "a98d408a9a", "file": "AppomattoxNewspapers_1954-1955a_0027.pdf", "page": 1, "text": "YIELDS OF CREEPING ALFALFA VARIETIES LOWER THAN RECOMMENDED TYPES Creeping alfalfa varieties, which have spurred many questions from farmers the past few years, can be expected to yield 25 to 50 percent lower than recommended  varieties in Virginia. This is indicated by Virginia tests and reports from other states. VPI agronomists say In addition to having low yields, these varieties are very susceptible to leaf spot and other diseases common to the east ern part of the United States. It is hard in most cases to maintain a satisfactory stand under Virginias humid conditions, and there is no indication to date in the east that creeping alfalfa is any more suitable for grazing than standard varieties. Two creeping alfalfa varieties, Nomad and Rhizoma, have received the .most attention publicity-wise, and seed of each is available. Both were developed in the Pacific North west Oregon and Canada in semi- arid areas where natural fertility and lime conditions are most favor able for alfalfa without the addition of lime and potash as fertilizer."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "developed in the Pacific <mark>North</mark> west Oregon and Canada"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "developed in the Pacific <mark>North</mark> west Oregon and Canada"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.59, 240.12, 513.57, 414.77], "bbox_id": "dd380cda3a", "file": "AppomattoxNewspapers_1922-1923a_0473.pdf", "page": 1, "text": "yet all of us are not happy. Mer- hants of the north end of Main Street protest against moving lie ffice Southward. 1 he South end- rs are perfectly willing that it shall be done.  When elf the wavering balance shakes its rarely ht adjusted. There is a big lifference between nieum  and tuum, and the principles of the Golden Rule have never yet been ipplied to a post office fight. We have a fine body of athletes n town, but now an 1 then one of the number gets to be so streiiu- j"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Mer- hants of the <mark>north</mark> end of Main Street"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Mer- hants of the <mark>north</mark> end of Main Street"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.51, 234.59, 2171.37, 1618.88], "bbox_id": "1f01d1eeb2", "file": "AppomattoxNewspapers_1915-1918a_0381.pdf", "page": 1, "text": "Yesterday mornings fight? asked De Spain reluctantly. Yes, sir. How did he happen to catch us ou El Capitan? He saw a fire on Music mountain and watched the lower end of the gap all night. Sassoon was a wide-awake man.  Well, Pm sorry, Pardaloe, con tinued De Spain after a moment No body could call It my faul. It was either he or Ior the life of a woman who never harmed a hair of his head, and a woman Tm bound to protect. He was running- when he was hit. If he had got to cover again there was noth ing to stop him from picking both of us off. He was hit ln the head. De Spain was silent. It was a soft-nose bullet contin ued Pardaloe. Again there was a pause. HPU tell you about th at too, Pardaloe, Do Spain went on collectedly. I lost my rifle before that man opened fire on us. Nan happened to have her rifle with herIf she hadnt hed ve dropped one or both of us off El Capi tan. We were pinned against the wall Uke a couple of targets. If there were soft-nose bullets ln her rifle Its be cause she uses them on gamebobcats and mountain Ilona. I never thought of it till this minute. That Is It What I came up to fell you has to do with Dave Sassoon. From what happened today ln the gap I thought you ought to know It now. Gale and Duke quarreled yesterday over the way things turned out they were pretty bitter. This afternoon Gale took It up again with his uncle, and It ended ln Dukes driving him clean out of the gap. Where has he gone? Nobody knows yet. Ed WIckwire told me once that your father was shot from ambush u good mnny years ng6. It was north of Medicine Bend, on a ranch near the Peace river that you never found out who killed him, and that one reason why you came up Into this country was to keep an eye out for a clue. What nbout It? asked De Spain, his tone hardening. I was riding home one night about a month ago from Oalabasas with Sas soon. Hed been drinking. I let him do the talking. He began cussing you out, and talked pretty hard about what youd done, and what hed done, and what he was going to do Nothing, It seemed, would hurry the story. Finally, Sassoon says That hound dont know yet who got his dad. It was Duke Morgan thats who got him. I was with Duke when he turned the trick. We rode down to De Spains ranch one night to look up a rustler. That, concluded Pardaloe, was all Sassoon would say. He stopped. II seemed to wnlt. There was no word of answer, none of comment from the man sitting near him. But, for one, at least, who heard the passionless, monotonous recital of a murder of the long ago, there fol lowed a silence as relentless as fate, a silence shrouded ln the mystery of the darkness and striking despair Into two heartsa silence more fearful than any word. Pardaloe shuffled his feet. He coughed, but he evoked no response, I thought you was entitled to know, he said finally. Now that Sassoon will never talk any more. De Spain moistened his lips. When he spoke his voice was cracked and harsh, as It with what he had heard he had suddenly grown old. You are right, Pardaloe. I thank you. Iwhen Iln the morning. Par daloe, for the present, go back to the gap. I will talk with WIckwireto morrow.  Good night, Mr. de Spain. Good night, Pardaloe. Bending forward, Ump, ln his chair, supporting his head vacantly on his hands, trying to think and fearing to think, De Spain heard Pardaloes meas ured tread on the descending steps, and listened mechanically to the re treating echoes of his footsteps down the shaded street. Minute after min ute passed. De Spain made no move. A step so light that It could only have been the step of a delicate girlhood, a step free as the footfall of youth, poised as the tread of womanhood and beauty, came down the stairs. Slight as she was, and silent as he was, she walked straight to him ln the dark ness, and, sinking between his feet, wound her hands through his two arms. I heard everything, Henry, she murmured, looking up. An Invol untary start of protest was his only response. I was afraid of a plot against you. I stayed at the hend of the stairs. Henry, I told you long ago some dreadful thing would come be tween ussomething not our fault. And now It comes to dash our cup of happiness when It Is filling. She stopped, hoping perhaps lie would sny some little word, that lie would even pat her head, or press her hand, but he sat Uke one stunned. If It could have been anything but this! she pleaded, low and sorrowfully. Oh, why did you not listen to me before we were engulfed! My dear Henry! You whove given me all the happiness I have ever hadthat the blood of my own should come against you and yours! The emotion she struggled with, and fought back with all tho strength of her nature,- rose ln a re sistless tide that swept her on, ln the face of.Jds ominous silence, to despair. Her breath, no longer controlled, came brokenly, and her voice trembled. You have been very kind to me, Henryyouve been the only man Ive ever known that always, everywhere, thought of me first I told you I didnt deserve It, I wasnt worthy of It His hands slipped silently over her hands. He gathered her close Into his arms, and hts tears fell on her up turned face. TO BE CONTINUED."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "years ng6. It was <mark>north</mark> of Medicine Bend, on"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "years ng6. It was <mark>north</mark> of Medicine Bend, on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1585.69, 674.66, 1753.04, 826.51], "bbox_id": "9979e661b0", "file": "AppomattoxNewspapers_1902-1905a_0289.pdf", "page": 1, "text": "Yesterday a west bound freight train put out a fire which burned over about 1000 acres of land on the north side of the road between this point and Evergreen. A barn was burned on the farm cf Mrs. S. H. Kelley. Several small houses were also burned and it is said one cow  perished in the flames. Tbe same engine set fire to a shed at this place in the Smith block, and but for the timely discovery v. ould have resulted in a serious conflagration."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "of land on the <mark>north</mark> side of the road"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "of land on the <mark>north</mark> side of the road"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.66, 752.62, 1763.73, 1675.07], "bbox_id": "5cfa05a0a4", "file": "AppomattoxNewspapers_1898-1902a_0066.pdf", "page": 1, "text": "Yes, tor some people ln this world there seems no let-up. They are pursued from youth to manhood, and from manhoodto old age. Very distinguished are Lord Staf fords hoUnus, the Earl ot Yarboroughs honnds, and Qaeen Victoria pays eight thousand live hundred dollars per year to her Master Ot Backhonnds. But all of them put together do not equal in number or speed, or power to hunt down, the great kennel ot hounds ot which Sin and Trouble are owner and master. Bnt what Is a relief forall this pursuit ot trouble, and annoyance, and pain, and be reavement? My text gives It to you In a word of three letters, bat each letter is a harlot if you would triumph, or a tbron If yon want to be orownod, or a lake It yon would slake yonr thirstyes, a chain ot three lakesO-O-D, tbe One for whom David longed, and the One whom David found. You might ns well meet a stag whleb, after Its sixth mile of running at the top most speed through thicket and. gorge, and with the brehth Of the dogs on Its heels,has come in fnll sight ot Serooh Lake, and try to ctjbl Its projeetlng and blistered tongue with a drop of dew from a blado ot gloss,ns to at tempt to satisfy an Immortal soul,when fly ing from trouble and sin, with anything less deep, and high, and broad, and immense, and Infinite, and eternal tiian God. Hto comfort, wby it embosoms all distress. Hls arm, it wrenches off aU bondage. Hls hand, It wipes away all tears. His Obrlstly atone ment, It makes us all right with the past, and all right with the future all right with God, all right with man, and all right for ever. Lamartine tells us tbat King Nimrod said to hls three sons, Hero aro three yokes, and one is ot clay, another of amber, and another ot gold. Choose now which yon will have. The eldest son, having first ohoice, chose the vase of gold, on whloh was written the word Empire, and when opened it was found to contain human blood. The second son, making tho next, choice, ohose the vase ot aml0r.Jns with the 1 nuTwM f openod I  jUma the ashes of these who were Called great. The third son took tho of clay, and, oponing It, found it _ ptv bat on the bottom of it was in- scrlral the name ot God. King Nimrod asked bis oourtlers whloh vase they thought weghed the most. The avaricious men ot hiseourt said the vase of gold. The poets said the one of amber. But tho wisest men said the empty vase, because ono letter ot the name of God outwoighed a universe. For Him I thirst for Hte gram I beg on Hls promise I build my all. Without Him I cannot be happy. I have tried the world, and it does well enough as far it goes, but It Is too uncertain a world, too evanescent a world. I am not a prejudiced witness. I have nothing against this world. I have been one of the most fortunate, or to use a more Christian word, one of the most blessed of menblessed in my parents, blessed ln the place of my nativity, blessed In my health, blessed ln my field of work, blessed in my natural temperament, blessed In my family, blessed in my opportunities, blessed in a comfortable livelihood, blessed In the ho,e that my soul will go to Heaven through the pardoning mercy ot God, and niy body, unless it be lost at sea or cre mated in some conflagration, will He down ln the gardens of Groenwood among my kindred and friends, some already gone and others to come after me. Life to many has been n disappointment, bnt to me It bas been a pleasant surprise, and yet I de clare that It I did not feel tbat God was now my Friend and ever-present help, I should be wretched and t error at icken. But I want more of Him. I have thought over this text aud preached this sermon to myself until with all the arouse.l energies of my body, mind and soul, I can ory out, As tbe liart panteth after the water brooks, so panteth my soul after Theo, O God. Ob, when some of yon get there it will be like what a hunter tells of when push ing his eanoe far up North ln the winter and amid the Ice-floes, and a hundred miles, as he thought, from any other human be ings! He was startled ono day as he heard astepplng on the ice, and he cocked his rifle ready to meet unythlng that came near. He found a man, barefooted and In sane from long exposure, approaching him. Taking him into bis canoe and kindling fires to warm him, he restored him and found out where be had lived, and took him to hls home, and found all the village ln great excitement. A hundred men were searching for the lost man, and bis family and friends rushed out to meet him and, as had been agreed at hls first appearance, bells were rung, and guns were fired, and banquets spread, and the rescuer loaded with presents. Well, when some ot yon step oat of this wilderness, where yon have been chilled and torn ag sometimes lost amid the Iceberg warm greetings of all tbe villages  th e glorified, and your friends rush o u t to give you weleomlng kiss, the news that th e r e to another soul forever saved will c all th e caterers ot Heaven to spread tho banquet and the bell-men to lay hold of the ro p e in the tower, and while tbe ehallees eliek at the feast, and the bells clang from the tur rets, it will be a scene so uplifting I p ra y God I may be there to take part in th e celestial merriment. Until tbe d a y break and the shadows flee away, be th o u like a roe or a young hart upon the mouse tains of Bether."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "his eanoe far up <mark>North</mark> ln the winter and"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "his eanoe far up <mark>North</mark> ln the winter and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [655.2, 1379.33, 816.92, 1582.68], "bbox_id": "344774e165", "file": "AppomattoxNewspapers_1898-1902a_0242.pdf", "page": 1, "text": "Yes, said a young man, as he thrtw himself at the leet of the pretty schoolmis tress,  I love you, aud would go to the worlds end for you.  You eould not go to the end of the world for me, Jam es. Tne world, or the earth, a It is called, is rouud Hkq_a ball, slightly flat tened al tbe poles. One o rth e first lessous in elementary geography is devoted to the shape of the earth. You must have studied it wtisn you were a boy.  Ol course I did, b u t ---------  Aud It is no louger a theory. Circum navigators hav.e established the luct.  I know  but what I meant was th at I would do auythiug to please you. Ab, ill uerva, If you kuew the aching void   There Is uo such thiug as a void, Jaun-r. Nature abhors a vacuum. But, adm itting tba! there could be auch a thing, how eoulu the void you apeak ol be a void If there were au ache iu i t ?   I meant to say that my life will be louelv without y o u  that you are my dally though i and uiy nightly dream . I would go auywlmre to be with you. If you were iu Australia, or at the North Foie, I would fly to you."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Australia, or at the <mark>North</mark> Foie, I would fly"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Australia, or at the <mark>North</mark> Foie, I would fly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [393.35, 1751.74, 555.31, 1933.79], "bbox_id": "821a104791", "file": "AppomattoxNewspapers_1898-1902a_0215.pdf", "page": 1, "text": "Yellow fever broke out about two weeks ago at the Soldiers Home in Hampton. It was not at first sup posed to be genuine yellow fever, bnt dengue. Up to Tuesday night there were 40 cases and 8 deaths. There are three cases in the town of Phoebus, between the home and Old Point. The hotels at Old Point are deserted, and most of the gariison at Fort Monroe has been sent to the north. Strict quarantine has been established, and it is hoped that the disease can be kept from spreading. There i no good reason for a panic."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "been sent to the <mark>north</mark>. Strict quarantine has been"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "been sent to the <mark>north</mark>. Strict quarantine has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [680.66, 764.05, 844.15, 1111.45], "bbox_id": "745507db69", "file": "AppomattoxNewspapers_1922-1923a_0346.pdf", "page": 1, "text": "years. Camille Saint-Saëns, the French composer became seriously ill on the steamer La Provence while en route from France to this country. Mrs. Mary Dower shot her hus band, Thomas Dower, in Mobile, Ala., in self-defense, Inflicting a wound in the head, from which he died. Further evidence was given before Interstate Commerce Commission in Omaha, Neb., of the conditions of the grain trade in the West. Rev. Dr. Phillip Meiancthon Doo little, pastor of the Reformed Church at North Branch, N. J., for more than 50 years, died suddenly. Tne new battleship Minnesota, in an endurance trial trip off the New England Coast, maintained an aver age speed of 18.851 knots on hour. Rev. Dr. Washington Gladden de livered an address at the meeting of the American Missionary Association on the negro problem. William Dittmar began a prison sentence of 20 years for the murder of David Howard at Somerville, N. J., last June. A sweeping antiliquor statute was passed by the Supreme Lodge Knights of Pythias in session In New Orleans. Charles Page Bryan, American minister to Portugal, sailed from New York for Europe on the steamer La Savoie. The freight steamer Hastings, bound from New York to New Haven, was burned to the waters edge and sunk in Long Island Sound off Stam ford, Ct. The crew of 11 men got away in a life-boat."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "the Reformed Church at <mark>North</mark> Branch, N. J., for"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "the Reformed Church at <mark>North</mark> Branch, N. J., for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.48, 1051.05, 1557.95, 1792.97], "bbox_id": "9b918ab1e9", "file": "TimesVirginian_1978_0020.pdf", "page": 1, "text": "Years ago the late Rev. H, Frederick Jones, while pastor at Liberty Baptist Church, gave me a small book entitled, What Every W riter Should Know. Packed with practical informa tion about grammar, style, punctuation, spelling, etc. Ex ample counties with same names but different spelling. There is Allegany county in M aryland and New. York, Alleghany in North Carolina andTfrginia, and Allegheny in Pennsylvania, Bulloch county in Georgia, Bullock in Alabama. Burnet in Texas, Burnett in Wisconsin. Clarke county in Alabama, Georgia, Iowa, Mis sissippi, Virginia and Washing ton, but elsewhere it is Clark. Dickenson county in Virginia. Piçkinson county in Michigan.  Green county in Kentucky and Wisconsin all others, including Virginia, it is Greene. Ix u isa county in Virginia. Smyth county in Virginia all others Smith. Same for county names npt found in Virginia. Davidson county in North Carolina and Tennessee Davison county in North Dakota. Coffee county in Alabama, Georgia, Tennessee Guffey in Kansas. Cook in minois and Minnesota Cooke in Texas. Stanley county in South D akota Stanly in N orth égrolina. Stark in Illinois, tferth Dakota and Ohio Stark jft-Indiana. Storey in Nevada Story in Iowa. Andrew in - Maine Andrews in Texas. Barber in Kansas Barbour ip  Ajahema and West Virginia. Plus many others. It took a long time to got agreement da how fo spell Appomattox. I have found ft advisable to get the correct spelling of names as toon as convenient meeting someone. John Smith may ipU his name J ob Sipythe. Sally may Pww spell her name Sallye may be BQlye Jo. I ,tto privilege of peÇg yom- name any way you deore. w  I nice to know. Loyd and Bara Vaughn, or Lloyd ip4 Varan Vaughan. My U nameis Robinson, h títere are fine folks named JWértaon, sob. Robson. 8ome change muñes. When 1 mit Brightleaf, her ! wo Fsttesoo. not POterson. hut to mah tt to Robinson. Thanks  raiding, and seeya"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "New. York, Alleghany in <mark>North</mark> Carolina andTfrginia, and Allegheny"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "New. York, Alleghany in <mark>North</mark> Carolina andTfrginia, and Allegheny"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1945.88, 1417.86, 2095.51, 1516.26], "bbox_id": "57f97d919f", "file": "TimesVirginian_1984a_0158.pdf", "page": 1, "text": "ye give your home the exposure it needs to get it sold. Because with over 6,000 independent offices in North America, the CENTURY 21 system has the power to attract buyers from across town and across the country."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "6,000 independent offices in <mark>North</mark> America, the CENTURY 21"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "6,000 independent offices in <mark>North</mark> America, the CENTURY 21"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [840.7, 226.6, 990.72, 969.06], "bbox_id": "ccc033b941", "file": "AppomattoxNewspapers_1971-1973a_0467.pdf", "page": 1, "text": "Ye are strong and the word of God abideth in you. I John 214 Mr. and Mrs. Bruce Strat ton, of Thomas Terrace, spent Sunday with Mr. and Mrs. Marshall Stratton and attend ed church at Hebron. Mr. and Mrs. William Alvis, of Lynchburg, spent Sunday with Mr. and Mrs. J. P. Alis, Sr. Mr. and Mrs. Claude Trent and Dana, of Charlottesville, spent the week end with her parents, Mr. and Mrs. Wallace Bondurant. Miss Rhonda Trent spent the week end with Miss Mary Davidson. Mr. and Mrs. J. L. Harrison visited her father, Mr. J. O. Davidson, Saturday. Mr. John Laughon is in Lynchburg General Hospital and is doing fine. Welcome to The Curran and Ewers families who have just moved into the neighborhood. Mr. and Mrs. Bob Harris visited Mrs. Nina Caldwell and Mrs. Elsie Caldwell Sunday. Mr. and Mrs. H. B. Jones and family and Ben Wheeler visited Mr. and Mrs. I. B. Wheer over the week end. Mr. and Mrs. I. B. Wheeler received word from Airman Brad Wheeler, who is in North Dakota for training. He likes fine and would spend the week end in Canada. We wish a lot of luck for this young man. Master Scott Elliott is a patient in intensive care at Lynchburg General Hospital having had an accident with a Bush Hog Saturday at his home. We wish him a speedy recovery. Mr. and Mrs. Jimmy Lowe, of Va. Beach, and sons spent the week end with his mother, Mrs. Hop Elliott. Mr. and Mrs.Hatcher King are in Christiansburg with his sister, Miss Josie King, who is in the hospital. We wish her a speedy get-well. Mr. and Mrs. Wallace Bondurant and Richard, Mr. and Mrs. Claude Trent and Dana visited Mr. and Mrs. I. B. Wheeler Saturday night. Mr. and Mrs. I. B. Wheeler went to Colonial Heights Wednesday to visit Mr. and Mrs. Sep Spencer. They are both doing fine."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Wheeler, who is in <mark>North</mark> Dakota for training. He"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Wheeler, who is in <mark>North</mark> Dakota for training. He"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2257.24, 829.71, 2582.58, 1029.03], "bbox_id": "8c4ec23dac", "file": "AppomattoxNewspapers_1905-1912a_0380.pdf", "page": 1, "text": "YavX??e  ye express paid by us  G. P. Ft. Baltimore Rye,    . North Carolina Corn,     1 Select Apple Brandy,     4 Full Quarts Overholt Bottled in Bond J ,  . E X P R E S S P A ID B Y U S 4 Full Quarts Burwood 100 proof jl I E X P R E S S P A ID B Y U S A Trial Order, will prove to you, that we giy the Best for the Money.   jg JEFFERSON LIQUOR CO., J T H E PROM PT S H IP P ER S ? - o . B o x s o s . P ETER SB U R G , VA."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "P. Ft. Baltimore Rye,    . <mark>North</mark> Carolina Corn,     1 Select"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "P. Ft. Baltimore Rye,    . <mark>North</mark> Carolina Corn,     1 Select"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1173.85, 643.88, 1301.88, 719.02], "bbox_id": "f127ae9435", "file": "TimesVirginian_1984a_0135.pdf", "page": 1, "text": "YARD SALE Two-family yard, sale. Sat April 28,9 a.m. til ?, third house on left, on North Ave. in Appomattox. Lots of items including new exercise set, new radios."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Two-family yard, sale. Sat April 28,9 a.m. til ?, third house on left, on <mark>North</mark> Ave. in Appomattox. Lots of items including new exercise set, new radios."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Two-family yard, sale. Sat April 28,9 a.m. til ?, third house on left, on <mark>North</mark> Ave. in Appomattox. Lots of items including new exercise set, new radios."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [438.95, 1205.44, 590.13, 1258.01], "bbox_id": "6600b4ecdf", "file": "TimesVirginian_1978_0444.pdf", "page": 1, "text": "YARD SALE Saturday, Octo- j ber 7 - 9 - to 3 - North Avenue I off Patricia Ann Lane. Raindate October 14. ____________ 10-5-ltp ,"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Saturday, Octo- j ber 7 - 9 - to 3 - <mark>North</mark> Avenue I off Patricia Ann Lane. Raindate October 14. ____________ 10-5-ltp ,"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Saturday, Octo- j ber 7 - 9 - to 3 - <mark>North</mark> Avenue I off Patricia Ann Lane. Raindate October 14. ____________ 10-5-ltp ,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2492.66, 425.94, 2636.89, 488.77], "bbox_id": "c74fa2981f", "file": "TimesVirginian_1981a_0395.pdf", "page": 1, "text": "YARD SALE Saturday, Nov. 21, from 9 a.m. to 4 p.m. at 301 North Church Street, across from Middle School. Two family sale, OBrien and Moore. __________ 7911-18-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Saturday, Nov. 21, from 9 a.m. to 4 p.m. at 301 <mark>North</mark> Church Street, across from Middle School. Two family sale, OBrien and Moore. __________ 7911-18-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Saturday, Nov. 21, from 9 a.m. to 4 p.m. at 301 <mark>North</mark> Church Street, across from Middle School. Two family sale, OBrien and Moore. __________ 7911-18-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [419.03, 375.99, 562.06, 417.23], "bbox_id": "f0b9ee2815", "file": "TimesVirginian_1978_0231.pdf", "page": 1, "text": "YARD SALE Saturday, May 27 - 8 to 2 - 510 North Avenue off Patricia Anne Lane. ______________ 5-25-1TP"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Saturday, May 27 - 8 to 2 - 510 <mark>North</mark> Avenue off Patricia Anne Lane. ______________ 5-25-1TP"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Saturday, May 27 - 8 to 2 - 510 <mark>North</mark> Avenue off Patricia Anne Lane. ______________ 5-25-1TP"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [984.5, 908.09, 1113.61, 950.01], "bbox_id": "b826fe3b59", "file": "TimesVirginian_1980a_0192.pdf", "page": 1, "text": "YARD SALE Saturday June 7th, North Ave. Appomattox, 9 to 12. ____________ 796-5-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Saturday June 7th, <mark>North</mark> Ave. Appomattox, 9 to 12. ____________ 796-5-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Saturday June 7th, <mark>North</mark> Ave. Appomattox, 9 to 12. ____________ 796-5-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.5, 1582.94, 435.33, 1614.98], "bbox_id": "804dfd0a41", "file": "TimesVirginian_1978_0283.pdf", "page": 1, "text": "YARD SALE Saturday, June 24. 8 to 2 - 510 North Ave., Appomattox. _____ 6-22-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Saturday, June 24. 8 to 2 - 510 <mark>North</mark> Ave., Appomattox. _____ 6-22-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Saturday, June 24. 8 to 2 - 510 <mark>North</mark> Ave., Appomattox. _____ 6-22-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.11, 1409.87, 1161.35, 1441.16], "bbox_id": "53cda1c725", "file": "TimesVirginian_1983a_0376.pdf", "page": 1, "text": "YARD SALE Sat.. Oct. 29, 9 son. at 508 North Ave ________ 7910 26-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Sat.. Oct. 29, 9 son. at 508 <mark>North</mark> Ave ________ 7910 26-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Sat.. Oct. 29, 9 son. at 508 <mark>North</mark> Ave ________ 7910 26-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1165.9, 1368.26, 1291.79, 1410.27], "bbox_id": "644e7f299c", "file": "TimesVirginian_1983a_0368.pdf", "page": 1, "text": "YARD SALE Oct. 22. 9 a.m. to 2 p.m. at 506 North Ave. Rain date Oct. 29. _________ 7910-19-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE Oct. 22. 9 a.m. to 2 p.m. at 506 <mark>North</mark> Ave. Rain date Oct. 29. _________ 7910-19-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE Oct. 22. 9 a.m. to 2 p.m. at 506 <mark>North</mark> Ave. Rain date Oct. 29. _________ 7910-19-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1088.4, 450.46, 1198.89, 480.16], "bbox_id": "5f7b359562", "file": "TimesVirginian_1983a_0163.pdf", "page": 1, "text": "YARD SALE May 21. 508 North Ave., 9-3. _______ 795-19-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE May 21. 508 <mark>North</mark> Ave., 9-3. _______ 795-19-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE May 21. 508 <mark>North</mark> Ave., 9-3. _______ 795-19-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [284.9, 1419.51, 1095.59, 1469.03], "bbox_id": "78f6d2c5d9", "file": "TimesVirginian_1983a_0179.pdf", "page": 1, "text": "YARD SALE 508 North Ave.. May 28,9 - 3._ ________ 795-26-ltp EXCAVATING Clearing -Ponds- Driveways-General Hauling"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE 508 <mark>North</mark> Ave.. May 28,9 - 3._ ________ 795-26-ltp EXCAVATING Clearing -Ponds- Driveways-General Hauling"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE 508 <mark>North</mark> Ave.. May 28,9 - 3._ ________ 795-26-ltp EXCAVATING Clearing -Ponds- Driveways-General Hauling"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [455.72, 347.7, 600.2, 379.06], "bbox_id": "cdd12ab45f", "file": "TimesVirginian_1978_0409.pdf", "page": 1, "text": "YARD SALE  September 16 - North Ave. 8 a.m. to 4 p.m. _______________ 9-14-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE  September 16 - <mark>North</mark> Ave. 8 a.m. to 4 p.m. _______________ 9-14-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE  September 16 - <mark>North</mark> Ave. 8 a.m. to 4 p.m. _______________ 9-14-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [298.76, 1213.07, 439.39, 1255.36], "bbox_id": "168cc07226", "file": "TimesVirginian_1978_0273.pdf", "page": 1, "text": "YARD SALE - 9 - 3 Saturday, June 17 - 506 North Ave. - Little Bit of Everything. ______________ 6-15-ltp"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "YARD SALE - 9 - 3 Saturday, June 17 - 506 <mark>North</mark> Ave. - Little Bit of Everything. ______________ 6-15-ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "YARD SALE - 9 - 3 Saturday, June 17 - 506 <mark>North</mark> Ave. - Little Bit of Everything. ______________ 6-15-ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [723.08, 1190.06, 881.55, 1527.42], "bbox_id": "d497fb8c8b", "file": "AppomattoxNewspapers_1926-1933a_0069.pdf", "page": 1, "text": "Yakalos, New Steel Breed, May Solve Meat Problem Wainwright, Alta.When the world hangs ont the Standing Room Only sign the problem of meat supply may be solved by a new breed of live stock called yakalos being devel oped In the national park at Waln- wrtght by crossing the bnffalóes with yaks Yakalos combine thè meat-pro ducing qualities of the yak with the foraging characteristics of the buffalo according to G. B. Botimeli, director of the animal hqsbandry division of the Department of Agriculture. The new animals breed true to type, he said, and have proved more adaptable than cattalo evolved several years ago by crossing buffalo with domes tic cattle. The meat of yakalos is said to ha almost Identical with beef aside from being finer grained. The animals are hardy, can forage for themselves, ara capabla of wintering In the open, and are resistant to many of toe common diseases of domestic tetti. Buffalo In the government herd at Wain wright park have Increased so rapidly that 2,000 young animals were shipped north last spring to a wild bison preserve-on the Slave river. The herd at Walnwright, which Is the cen ter of a fertile farming area, now numbers 8 . 000 ,"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "young animals were shipped <mark>north</mark> last spring to a"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "young animals were shipped <mark>north</mark> last spring to a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2107.9, 1556.22, 2274.1, 1681.42], "bbox_id": "43a3b3ec5a", "file": "AppomattoxNewspapers_1933-1936a_0539.pdf", "page": 1, "text": "yAj4TED Representatives to look after our magazine subscription in terests in Appomattox and vicinity. Our plan enables yon to secure a good part of the hundreds of dollars spent in this viciiity each fall and wiiter for magazines. Oldest agency in U .S . Guaranteed ilowest rates ori all periodicals, domestic and foreign. Instructions and equipment free. Start a growing and permanent business in whole or spare time. Address MOORE-COTTRELL, Inc , Wayland Road, North CoboctonN."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "MOORE-COTTRELL, Inc , Wayland Road, <mark>North</mark> CoboctonN."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "MOORE-COTTRELL, Inc , Wayland Road, <mark>North</mark> CoboctonN."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.67, 1162.03, 1915.18, 1353.68], "bbox_id": "928f48c503", "file": "AppomattoxNewspapers_1912-1915a_0065.pdf", "page": 1, "text": "Y. W. C. A. Report. The regular meeting of the board of directors of the Young Womens Chris tian Association was held in the chapel of the Presbyterian Committee of Pub lication, Miss Katharine H. Hawes pre siding. There was a full attendance and much enthusiasm expressed over the progress of the work. A full financial statement will be given to the public in January, and in the mean while it was reported that the new hoarding home at 108 West Carey street is rapidly nearing completion, and will be ready for use by March 1  that the administration building to be erected at 6 North Fifth street has been unavoidably delayed by minor legal complications, but it is expected that ground wjll be broken before Jan uary 1 . ."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "be erected at 6 <mark>North</mark> Fifth street has been"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "be erected at 6 <mark>North</mark> Fifth street has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2169.79, 869.85, 2337.03, 1366.85], "bbox_id": "182a25011e", "file": "AppomattoxNewspapers_1922-1923a_0500.pdf", "page": 1, "text": "y ur.-tgin Lhe Ii. W. M. met last Wednesday and much bn ineus was attended to. If the sisters only had more help h 1 could carry out their good desires, what a power they might be hi the Masters work, hut it is difficult, with so many nestic duties to attend to church rk as we would like. Bohve of tils o I loved ones who left t year, i lyinkid  Ui y -vbuld find a mud of milk mid honey  in thi North, have re.unnd md ?ay they are siiti-hed. W h hope the tid turning. T.a farmers too are ferine much lor help. We see some rye fields of c ini no thinned nor d all for the want of labor ck Carson has a large nice clover hay, which good fanning. Taylor killed a large asiu snake in his childrens lay yard yesterday. It was quite a fright to the little folk-. My letter appears v ry dull Mr. Editor, hut she hath done what she could in the way of news, so lease excuse. How this, papers correspondence forms a liuK between the writers Borne of us are dear friends. For others whom we have never rn -t we feel an attachment. It is a plea sure to exchange our compliments. It is not  taffy  either but of the sincerity of heart. Southside de serves all she received."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "mid honey  in thi <mark>North</mark>, have re.unnd md ?ay"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "mid honey  in thi <mark>North</mark>, have re.unnd md ?ay"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1392.97, 751.89, 1580.25, 934.04], "bbox_id": "79b1470ebb", "file": "TimesVirginian_1984a_0022.pdf", "page": 1, "text": "y The wedding of Vicki Elizabet h Baldwin and Thomas Maxwell Dresfor, both of Raleigh, North Carolina, wuj held at 4 p.m. Jan. 7, in the C hairt at Centenary United Methodist Church. The Rev. George Robinsdn officiated, if The bride is the daughter of Mr. and M rs. - Louis Barley Baldwin of Winston-Salem. She graduated from -Western Carolina University and to an art treacher for the Franklin County Schorts , 2 DTessertothe sonof Margaret Jones D resser and Frank T. Dresser both of Laurel, Maryland. - Paternal grandparente were the late Mr. and Mrs. Frank Charles Dresser of"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Dresfor, both of Raleigh, <mark>North</mark> Carolina, wuj held at"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Dresfor, both of Raleigh, <mark>North</mark> Carolina, wuj held at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [448.3, 808.88, 609.95, 1021.83], "bbox_id": "8f61ce58e7", "file": "AppomattoxNewspapers_1898-1902a_0335.pdf", "page": 1, "text": "Y o rk - River Line, Daily except Sunday For Baltimore, Philadelphio, New  York, and all points north and east. U. S-. mail steamers Charlotte and  Baltimore. Steam heat, electric  lights, luxurious staterooms, diuiug- room on saloon deck. Fare2.50 one way, 4 for round trip. Express train leaves Richmond, Southern Railway station, daily except Sun- I day, at 430 p . m ., connecting with j steamers at West Point 550 p . m ., I arriving Baltimore at 8 A. m . The favorite route to Atlantic City, Cape May, Niagara Falls, and all eastern .resort points and commercial cen tres. Excursion tickets now on sale via this route to all of the above points also to West Point Nev York aud all eastern resort points. C. W. W e s t b u r y , T. P. A."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "York, and all points <mark>north</mark> and east. U. S-."}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "York, and all points <mark>north</mark> and east. U. S-."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [522.96, 1417.01, 694.91, 1534.26], "bbox_id": "ff8ab8f14f", "file": "AppomattoxNewspapers_1947-1949a_0316.pdf", "page": 1, "text": "y  ieenng naa passed from one generation to another, but it is not one of hatred for the Ne gro. The South just doesnt believe that the Negro has grown up. No section of the country has made more progress in finding a workable solution to the Negro problem than the South. Naturally Southerners are resentful when the North at tempts to ram a civil rights pro gram down their throats."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "are resentful when the <mark>North</mark> at tempts to ram"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "are resentful when the <mark>North</mark> at tempts to ram"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.15, 1700.07, 1555.69, 1759.97], "bbox_id": "f35107affd", "file": "AppomattoxNewspapers_1918-1922a_0342.pdf", "page": 1, "text": "y   , In a iv i north of Ap. . m. n September 4th at heavr .  8 25-2w t hh8 BridgJlnFV  00k away ,c Mae   r,day nitrht 1 w iaooB l"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "y   , In a iv i <mark>north</mark> of Ap. . m. n September 4th at heavr .  8 25-2w t hh8 BridgJlnFV  00k away ,c Mae   r,day nitrht 1 w iaooB l"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "y   , In a iv i <mark>north</mark> of Ap. . m. n September 4th at heavr .  8 25-2w t hh8 BridgJlnFV  00k away ,c Mae   r,day nitrht 1 w iaooB l"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1262.85, 463.91, 1423.57, 795.21], "bbox_id": "9ec4c624f5", "file": "AppomattoxNewspapers_1898-1902a_0180.pdf", "page": 1, "text": "xWaia Member of tlio Houso From Ioul 0 . iaua In tho Last Congress. Washington, D. CL, Special.Represen tative Samuel T. Baird, of Louisiana, died in Washington from a complication of di- eases. The remains were taken to Bastrop, La., for interment. In addition to the family the following named Senators and Representatives accom panied tbe remaihs Senators Cuffrey, of Louisiana, and Bacon, of Georgia Repre sentatives Meyer and Davey, of Louisiana Bartlett, of Georgia Morris, Eddy and Me- Cfeary, of Minnesota Marsh, of Illinois Gibson and Brownlow, of Tennessee Cum mings, of New York, and Ciayton, Under wood and Bankhead, of Alabama, who will act as honorary pall-bearers. Samuel T. Baird was well-known In north ern Louisiana, where for seventeen years he has been a prominent factor at tbe bar, on the bench aud in politics. He was a native of that State and was thirty-eight years old. Born at Oak Ridge on May 6 , 1861, his prim ary instructions were begun very early aud he received uls education both at home aud at Vincenues, Ind. In 1870 he commenced the study of law, and three years later was admitted to the bar. Iu 1884 he was elected district attorney of the sixth judicial circuit, served in this capacity for four years, and then vacated it to become district judge for the same district. He occupied this bench for four years and then relinquished it to resume his private practice. In April, 1896, he was elected to tbe State Senate. He was a delegate to the national Democratic con vention in Chicago in 1896. Mr. Baird bad just finished his first term in tbe House of Representatives and had been re-eiocted to the fifty-sixth Coogresj."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Baird was well-known In <mark>north</mark> ern Louisiana, where for"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Baird was well-known In <mark>north</mark> ern Louisiana, where for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2040.0, 284.08, 2204.82, 1086.61], "bbox_id": "0b8488a1b6", "file": "AppomattoxNewspapers_1908-1909a_0402.pdf", "page": 1, "text": "Xn he Clerks Office of the Gtrrtr t Court of the County of Appomut tox, on tho 25th day of February, 1929. Kitty Wooding and Others, PLintiff VS Fountain Eldridge, Lou Eldridg Perkins Lee Martin Lee, ThV Federal Land Ba k of Baltimore Ba tonore, Md., Annie Lee Harris Mariah Lee Douglas, Nannie U Jasper, John Lee, Nathaniel Ee and he unknown heirs at law  f Ample EUlr dge, decd., Anqit I ee Tony, decd., and Fannie Le Uyer, dicd., whose names anti whereabouts are unknown, an  ho are designated as parties de fendant unknown, and Others, Defendant. The object of this suit is t ave partition by one of th modes provided by law of tho- wo parcels of land, ore situated in Stonewall District, Appomat- ox County, Va., about thre smiles north of Concord Dpot Va., on which Kitty Wootiii 1 now r- sides, containing 123 ar s and 8 pocs, and in ywhich Ell Tucker decd., owned one-half undivided interest.  The othe ract located i n MeckWnbutg c unty, Chase City Dist.Va abU h ee mites north of Chase City, tpon which Ella Tucker died, owning one-half undivided interest containing 55 3 acres. And an affidavit having b et made and ti ed by which it ap pears that t h e defendants, cunt-Ju Eldridge, Lou Eluridte, rkms Lee,yMarin Lee. -Tl Federal Lund Bank of Baltimore Md-, are jidt residents of the Sta e of Virginia, and that due dilligence has been us d to ascertain in wha unty or t o.parauon the aeftnd nts, Anhte l.ee Harrs, Maria! ee 1 ouglas, Nannie Lee Jasper obn Le- and Nath nie-t Lee af , tit out effect, and it appear, n from the bill filed in this cau hat there are or may te pers n itercsted in the subject to b vj. ed or di-pos d o f hcreir v ose name and addresses ar unknown, hnd who halve been made , at tits dtL ndant h- re to b. the general description of purtie- nknown, and it uppenring I y ffidavit that said parties are un now n, th s -id ountain I id id  ou Eldrdge, Perkins l ee, Martin tee and The Federal Land Bank of Ba t more, and the sa d Annie ee Harris, Mariah Lee Douga N nnie Lee Ja-per, John Lee a  N tha iel Lee, ard the aid un known p rsons as parties unknovt i re spirally lequiieJ to appea wuhin ten davs - fter due publi- c t on hereof, end do wh t may Se necessary to protect their in terests in this suit. And it is further ordered that a copy hereof be published once a week for four successive weeks in the Jmes-Virgiiiian, a newspaper published in the County of Appo-"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Va., about thre smiles <mark>north</mark> of Concord Dpot Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Va., about thre smiles <mark>north</mark> of Concord Dpot Va.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [553.47, 1153.87, 718.47, 1634.11], "bbox_id": "d64144e1b2", "file": "AppomattoxNewspapers_1922-1923a_0070.pdf", "page": 1, "text": "x visitor here, had his cai dtolsn from the warehouse shed. Ford Tourimr, motor No 5252 289, Va. License No. 84249, small hole in rear cushion caused by cushion spring. Tell the Sheriff promptly if you saw any suspicious parties going away from Appomattox Tues day evening about 4 oclock. TLe town iB after this thief and ask the help of all to whom these geeting come. Appomattox looks more and more like a city every day, and now she begins to adorn her p e a c e f u l and delightful quietude by the His common to our cities. See what happened here yesterday-27,000 public sale of lots Chicago girls ball team defeated by our club Ford Touring car stolen. Verily we do fnove along The N.  W. Ry. Co , is the only laggard in ihe growing cRy and soon the patience of a forbearing public will move mightily against this indifferent corporation. Mr. and Mrs John A. Payne and children have returned to iheir home near Vera, after a pleasant visit to their old home in Culpeper Misses Elsie and Stella payne aie motoring with a party from Charlottesville to North Carolina, where they will viBit friends in Charlotte, Ash v ille and MoUDt I011?!"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "party from Charlottesville to <mark>North</mark> Carolina, where they will"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "party from Charlottesville to <mark>North</mark> Carolina, where they will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [624.02, 871.34, 967.39, 1033.04], "bbox_id": "b15c8e0931", "file": "AppomattoxNewspapers_1947-1949a_0429.pdf", "page": 1, "text": "X H h e businf 18 the cas only vally of humility between two when the business can expect to  mountains of pride, Virginia and recover interest and principal, and South Carolina  The nrSE of tit something additional, fr m the ad- state of the ong-leaf pine must Je tot h 1 earm ngsade possible by I swelling these days, for it is achie- the borrowing. The States situa- ving notable gains among progret tion is different. With certain ex-j sive Southern states. ceptions, such as the proposed York  River toll bridge, it cannot expect  . There has been a long and con- any direct return from money in- tinuouf flourishing of the tree of vested in public improvements The  liberalism from which the state is prudent course for it to follow is now. beginning to gather fruit. It to pay for improvements out of  s time, says Governor Scott, for current income. Only a very grave  hlorth Carolina to stop dodging the emergency would justify a ftcnnrt.l Negro question. He pledges him- ure worn that pqlicy.  Self t 8 see that the minority race has a fair opportunity. North"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "has a fair opportunity. <mark>North</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "has a fair opportunity. <mark>North</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2080.33, 1375.93, 2242.79, 1530.05], "bbox_id": "f7f37174fe", "file": "AppomattoxNewspapers_1912-1915a_0064.pdf", "page": 1, "text": "X. C. GHAIQ.SR miles north ot Appomat tox, known aa 8. G. Blackwell place. Z. H. SIMMS, on Cub Creek. B. C. SIMMS, on Cub Creek. C. N. ABBITT, near Appomattox, Va IDA OKKBFK, near Pamplma, Va U. L. MV BUS, Pittman and GUIs p-aoee, near Bversieeu, Va. R. L. MY MBS, Temple Bioharaeons place, neat Pamplin City, va. B, L. MYBB8, Kelly place near Appomat tox Va. B. L. MYBR8, Proebl place, at Dawsons Downf E. L. MV BUS,. Beasley .place near Born Bower, Va. B. L MYBR8, Davidson place near Foree Store in Bookluaham County. Persoua desiring to ------- g- do to  a"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "X. C. GHAIQ.SR miles <mark>north</mark> ot Appomat tox, known"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "X. C. GHAIQ.SR miles <mark>north</mark> ot Appomat tox, known"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1615.9, 780.54, 1938.7, 1051.44], "bbox_id": "cba5f0fe41", "file": "AppomattoxNewspapers_1905-1912a_0237.pdf", "page": 1, "text": "X. B. Following schedule figures pub-1 lished only as Informatlen and are net guar. an teed. .  Southbound Trains leave Lynchburg. 342 A. M. No. 87. Solid pullman train to Atlanta. New Orleans, the South and Southwest. 88 A M. No. 19 Local to Danville and I Charlotte, connecting at Greens-1 hero for points east and west I thereof. 2.25 P X. No. 85 To Atlanta. New Or leans, the Sooth- snd Southwest.  Dining ear service. . , 8.05 F. M No. fh Local to IcnvUle,! Charlotte aad Intermedióte   points. . 410P.M. No. 48 To Charlotte and Atienta. 1 the 10.10  M. No. 20 Jacksonville Limited 1 and Birmingham special tor Columbia, Augusta, Savannah and all Florida  points also Atlanta and Birmingham  dining car aervtcs. NORTHBOUND Trains leave Lynchburg No. 48, 1. 60 A M. No.88. IM A M. Ni SO, 523 A. M. No. 10,70 A. . N 44, lift F. M. .No. Sfi. 50 F M. rN - ___ I No. 80, 70 P M, RV. J H . F ranklin, D. D ., p a s - 1 f 0r Washington, D. C. and the North.  _ . . . . r f 77 P M, N o TS Local tor Charlottesville. A ll through trains carry pullmena and  Railway dining cara. Trains leave Ricnmond, Ya. for all points  south, as follows 010 A M, 105 A M and"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "D. C. and the <mark>North</mark>.  _ . . . . r f 77 P"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "D. C. and the <mark>North</mark>.  _ . . . . r f 77 P"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [792.67, 569.18, 958.37, 869.73], "bbox_id": "42299b3bac", "file": "AppomattoxNewspapers_1905-1912a_0106.pdf", "page": 1, "text": "X. B. Following schedule figures pub lished only as Information and are not guar, an teed. Southbound Trains leave Lynchburg. 3.-42 A X. No. 37. Solid poilman train to Atlanta, New Orleans, the South and Southwest. SAS A M. No. 19 Local to Danville sad Charlotte, connecting at Greens boro for points east and west thereof. 3.23 P M . No. 35 To A tlanta, New Or leans, the South and Southwest. Dining car service. .05 P. M No. 9 Local to tnvUle, Charlotte and intermediote points. 410 P. M. No. 43 To Charlotte and Atlanta. 9.10  M. No. 29 Jacksonville Limited and Birmingham special for Columbia, Augusta, -avannah and all Florida points also A tlanta and Birmingham dining car service. NORTHBOUND Trains leave Lynchburg No. 42, 1. 55 A M. No.38, 1.35 A M. No 30, 538 A. M. No. 10, 730 A. X. No. 44, 107 P- V. No. 36. 535 P M. No. 26, 730 P M, all for Washington, D. C. and the North 737 P X , No. 20 Local for Charlottesville. All through trains carry pullmans and Southern Railway dining cars. Trains leave Ricnmond, Va. for all points south, as follows 630 A X , 1045 A X and 11.-45 P X. S. E . B JR G F 8 S, D .P . A., 920 E Main St, Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "D. C. and the <mark>North</mark> 737 P X , No."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "D. C. and the <mark>North</mark> 737 P X , No."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [237.34, 1460.81, 393.2, 1708.9], "bbox_id": "bc36a72518", "file": "AppomattoxNewspapers_1908-1909a_0106.pdf", "page": 1, "text": "X Anclionij!-. A la sk a .Tlit- J - irn mi!ionrt novt boaam a SOP. X lh menagerle Was threat-opon j 9 the organisation and there-ap- j X pears no way to get rid of the  6 extra burden but to declare war  x end use gunfire. 9 It happened at Tunnel, where  x the road maintains a gigantic . 9 hole, known as the gravel pit X into this snow-covered, Inno 5 cent-looklng clearing walked a, 6 large bull moose not yet relieved 9 of its antlers, file floundered 9 and floundered about the x loose snow until he tramped out o a pit whose high wall prevent- 9 ed all ferit When men approach 9 he charges at them with the ar- X row-pointed shovels. He ex- 9 hausted the crop of willows for x food and railroaders have been .1 hauling hay to him. How to get Jr 6 the moose, declared by every one 9 as the la rte  I n t J h ln the 6 North, out of Jts dlMpjttmln- x Jured is a problem."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "h ln the 6 <mark>North</mark>, out of Jts dlMpjttmln-"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "h ln the 6 <mark>North</mark>, out of Jts dlMpjttmln-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1402.52, 594.88, 1564.99, 1634.72], "bbox_id": "627b9258d8", "file": "AppomattoxNewspapers_1905-1912a_0548.pdf", "page": 1, "text": "WythevilleDexter Goad, clerk of the Carroll County Court, where Judge Massie and four other persons were killed by the Allen clansmen on March-14, was the principal witness Saturday at the trial of Floyd Allen on the charge of murdering Common wealths Attorney William M. Foster. Mr. Goad was wounded four times in the affray with the Allens, and bullets from his revolver broke Floyd Allens leg, and also injured Sidna Allen. The witness was asked why he was armed with two pistols on the day of the affray. Counsel for jthe defense ob jected, on the ground that testimony elicited by this question would he hear-say or a mere expression oi opinion. After brief argument by Mr. Draper, for the state, and Mr. Willis, for the defense, the question was with drawn. On recross-examination by Judge Hairston, for the defense, Mr. Goad said that after the shooting he step ped into the clerks office and reloaded his automatic pistol, but made no at tempt to use it again. This pistol shoots eight or nine times with one loading. The next witness was J. M. Beville, 66 years old, wearing a checked jump er under his coat and striped trousers, and with long iron gray chin whiskers. He lives two miles from Floyd Allen. He has been friendly with him. He met Floyd Allen on the road between their two houses some time before the trial. Allen said he was sorry he had got into the trouble with the boys he wished he had just let the boys go to jail. Now he was in it, he would submit to anything they put on him In the way of fine, but if they tried to put him in the penitentiary he would make a hole in the courthouse, and if Judge Bolen his counsel didnt do his duty he would be plied up with the rest of them. Witness said Mr. Allen, I hope you wont get into no such a thing as that. Cross-ex amined by Mr. Willis, the witness said he had often borrowed money from Floyd Allen, but always paid him. He denied that Floyd Allen holds a note of his for borrowed money. Judge Bolen Testifies. Judge Bolen, of Carroll, was put on the stand and he practically confirm ed Bevilles account of his transactions with Floyd Allen, showing that it is a matter of 9, involving some ques tions over a sale of land for parti tion. Sidney Spraker, 22 years old, a well- dressed young farmer, said he lived near Hillsville and works for Mr. Wil kinson. He was in the courtroom at Hillsville the day before the shooting, when the jury in Floyd Allens trial was out and was expected to return. Floyd Allen came to the stove, on the north side of the room, where witness was, as if to warm himself. Claude Allen walked up to Floyd, reached out and took hold of his hand and said Let me feel your pulse, old man. After about three seconds Claude dropped Floyds hand and said Its heating regular. Floyd Allen asked, in a sort of whisper Are all the hoys ready? Witness did not hear the reply. Floyd then walked across to near the door of the judges room and stood on a bench. W. D. Tompkins, a well-known law yer of the Carroll bar, another eyd wit ness, was next examined. His office is directly across the street from the courthouse. He did not know the ver dict in the Allen case had been given and went into court to attend to legal business. He exchanged a few words on a matter with the judge, then con ferred briefly with Mr. Tipton, also of the local bar, and handed him a paper on which to indorse an excep tion. Witness stepped outside the bar, and, facing Mr. Tipton and the Judge, waited for the indorsement. He then noticed that th- courtroom was very quiet and that here was an air of sup pressed excitement. He inquired and was told that the verdict was what it was. The witness said The First Shots. About that time Judge Massie asked Judge Bolen if anything more was to be done in the Allen case that day. Judge Bolen said No, and added that Floyd Allen wanted to speak to one of his sons. Claude Allen was called and went to the bar, where he"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "the stove, on the <mark>north</mark> side of the room,"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "the stove, on the <mark>north</mark> side of the room,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1277.26, 1332.38, 1427.76, 1537.73], "bbox_id": "837972d6b9", "file": "AppomattoxNewspapers_1912-1915a_0043.pdf", "page": 1, "text": "Wtlsh lines, and could swing to the eft at daylight. It made little dlffer- se where I struck the Delaware I wwy mile north added to my safety. JMy horse had fallen into a long, pmging lope, bearing us forward rap- piy. The moon had disappeared, but P  J was glittering with stars, and .could distinguish the main features K the country traversed. I was on the a sll8ht ridge, but the road Into 1.t0 tbe rgllt loading down boa vaUoy. There were no ?.  habitations, until we rounded stuM f 8 BmaH grove, and came iy UPn 8 tO village of a len houses on either side the hlgh- J h8e were wrapped In dark-  n  PParently deserted, shapeless structures, although I tavern 0D bad tl10 aPPearance of a Thorand another seemed a store. f 1 fewas a well in front of this last,"}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Delaware I wwy mile <mark>north</mark> added to my safety."}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Delaware I wwy mile <mark>north</mark> added to my safety."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [549.61, 1144.64, 719.62, 1512.68], "bbox_id": "c2f3a10ed9", "file": "AppomattoxNewspapers_1949-1952a_0578.pdf", "page": 1, "text": "WTH THE FIRST MARINE AIRCRAFT WING IN KOREAThe infantry has confirmed that Marine F irst Lieutenant Jam es McCleery destroyed four enemy tanks with one napalm bomb. He had to. It was the only weapon he had left. Lieutenant M cCleery of St. Louis, Mo., and his wingm ate from the M arine  D evilcat squadron, F irst Lieutenant Loren W. Calhoun of Ashton, 111., were near the end of an arm ed search over North Ko- rea when they spotted the Commu nist tanks. The M arines had used up all their bombs, rockets and machine gun ammunition. They carried one napalm fire bomb as their only weapon. Flying extrem ely low, Lieutenant McCleery discovered the four cleverly camouflaged tanks pro truding from a natural revetm ent under an overhanging hill. This was a larger order than he had figured on, but he decided to m ake the napalm bomb do as much dam age as possible. He set his Corsair fighter-bomber into a dive and released the napalm tank. It landed right in the middle of the target and splattered its fire over the four tanks. When the pilot left the area, all the tanks were burning. Two days later, an infantry unit moved north through the area and sent word back that all four tank w ere burned out and destroyed."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "arm ed search over <mark>North</mark> Ko- rea when they"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "arm ed search over <mark>North</mark> Ko- rea when they"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [774.26, 427.92, 929.33, 761.37], "bbox_id": "157e61ec2e", "file": "AppomattoxNewspapers_1898-1902a_0493.pdf", "page": 1, "text": "Wsldersee Fitting Ont Another Pnnlttve Ex pedition-French Troops to Stay. London By Cable. Dr. Morrison, wiring to the Times yom Pekin, says The German staff have notified the al lies of their intention to send another expedition to suppress Boxers in the southern part of the province of Chili, beyong Chingching, and have invited he co-operation of the allies. The de parture of the French troops has been countermanded. - The British military authorities are extending the railroads to Tungchow, along the Peiho. This will greatly fa cilitate the withdrawal of the foreign troops, and, commercially, will cause important developments in the north after the work of pacification is com pleted. The German War Office has received a dispatch from Pekin concerning the explosion at the arsenal at Kalgan, and naming Lieut. Kummer as the officer wounded. The dispatch characterizes the explosion as very serious, saying seven cavalrymen are reparted missing or found dead, and that three men, be side Lieut Kummer, were seriously wounded. The viceroy of Canton has signed a contract for the removal of the Macao barrier in the Canton river, constructed during the Franco-Chinese war, which has been a great obstacle to navigation. The viceroy has also squelched the na tive opposition to the construction of new wharves, pointing out that they are necessary to the interests of the trade. The viceroys action is creating a good impression."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "important developments in the <mark>north</mark> after the work of"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "important developments in the <mark>north</mark> after the work of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2136.67, 282.36, 2288.22, 491.03], "bbox_id": "4ed8d2e07e", "file": "AppomattoxNewspapers_1952-1954a_0011.pdf", "page": 1, "text": "Wrong Train Rldo Cautot Airman Action on Front PHILADELPHIACpl. J o h n J. Murphy, Jr., 20, wrote his parents here about a wrong train ride that caused him to see front line action in Keora92 days worth. Murphy wrote that he fell asleep on a train while enroute back to his air-terminal group headquarters and woke up north of the 38th parallel. Calvary officers refused to believe his story and he wound up in bat tle, a rifle in his hands. He took part in 13 patrols and won the Combat Infantrymans Badge before being returned to his outfit, which had listed him A.W.O.L."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "headquarters and woke up <mark>north</mark> of the 38th parallel."}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "headquarters and woke up <mark>north</mark> of the 38th parallel."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2290.3, 1544.67, 2452.41, 1575.81], "bbox_id": "4a970bf045", "file": "AppomattoxNewspapers_1905-1912a_0156.pdf", "page": 1, "text": "WRITE TO ME FOR ANYTHING YOU WANT. Lot me buy it for you, in tin Worlds greatest shopping centre. Money saveu, and sntisfaction jr?Tin. Personal attention. Mrs. A. It. NORTH HUP, Room 401. No. 500, Fifth Ave., N. Y. City."}, "highlight": {"text": {"matched_tokens": ["NORTH"], "snippet": "attention. Mrs. A. It. <mark>NORTH</mark> HUP, Room 401. No."}}, "highlights": [{"field": "text", "matched_tokens": ["NORTH"], "snippet": "attention. Mrs. A. It. <mark>NORTH</mark> HUP, Room 401. No."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1083.08, 1121.23, 1320.68, 1334.52], "bbox_id": "83b26e2ae5", "file": "AppomattoxNewspapers_1943-1947a_0071.pdf", "page": 1, "text": "write the peace. Every day more and more American food stuffs have to be transported to our fighting men and our Allies. The Nazis have overrun and pillaged Russias fertile granary in the Ukraine . They stripped North Africa bare . . . Japanese hordes have burned and blasted the good earth of valiant China . . . England has already increased her tillable acreage fifty per cent, and plans to increase it another ten per cent this year. But even that is not enough to feed the brave people of the tight little island, who fought off our foes single-handed in 1941. And there are our own millions of war workers who must be fed."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "the Ukraine . They stripped <mark>North</mark> Africa bare . . . Japanese hordes"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "the Ukraine . They stripped <mark>North</mark> Africa bare . . . Japanese hordes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [414.94, 1012.43, 704.94, 1166.67], "bbox_id": "1b5dc32308", "file": "AppomattoxNewspapers_1962-1965a_0433.pdf", "page": 1, "text": "Wright Martin. Groomsmen were then go to the Dibble home in Kenneth Wayne Reynolds, of Red Long Meadow, Mass., for House, brother of the bride Al-1 visit. vin Reynolds of Red House, cou sin of the bride Lealon Vassar, of Charlotte Court House W. D. Perdieu, of Drakes Branch A. C. Wilson, of Martinsville. After the ceremony, the re ception was held in the church social hall. For travel the bride changed to a pink crepe dress with white accessories, adding the orchid from her bouquet. On their return from a North-"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "their return from a <mark>North</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "their return from a <mark>North</mark>-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [552.86, 1334.49, 711.36, 1495.56], "bbox_id": "b2f26edc61", "file": "AppomattoxNewspapers_1905-1912a_0411.pdf", "page": 1, "text": "Wreek of tha Chilian Steamer Tucapel Near Qullca. Lima, Peru.A telegram received here from the purser of the Chilian steamer Tucapel, which was wrecked near Qullca, says that the total num ber of persons drowned was 32. Ninety others were saved. Those who lost their lives were the captain of the vessel, the first and second officers, 20 members of the crew and nine deck passengers. The Tucapel during a heavy fog struck on an unchartered stretch of rocks 20 miles north of Qullca, which lies several hundred miles south ot Lima."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "of rocks 20 miles <mark>north</mark> of Qullca, which lies"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "of rocks 20 miles <mark>north</mark> of Qullca, which lies"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [509.75, 1622.23, 665.14, 1756.52], "bbox_id": "6b7a974956", "file": "AppomattoxNewspapers_1902-1905a_0361.pdf", "page": 1, "text": "Wrecked By Spreading Rolls. Altamont, Mo., Special. The Chi cago, Rock Island and Pacific railway, which left Kansas City for the north was wrecked by spreading rails two miles east of here. Two persons were probably fatally hurt and fifteen oth ers seriously injured. The train, which was made up of baggage, smoker, two chairs, a Pullman sleeper and an ob servation car, was running at the rate of only fifteen miles an hour when the accident occurred. The baggage car, smoker and one chair car were turned over and went down the embankment."}, "highlight": {"text": {"matched_tokens": ["north"], "snippet": "Kansas City for the <mark>north</mark> was wrecked by spreading"}}, "highlights": [{"field": "text", "matched_tokens": ["north"], "snippet": "Kansas City for the <mark>north</mark> was wrecked by spreading"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.59, 271.09, 2094.91, 378.34], "bbox_id": "dd646fb042", "file": "TimesVirginian_1976_0101.pdf", "page": 1, "text": "wqs the brother of Mrs. Dale Jones.  Mrs. Alta Hopkins visited Mr and Mrs. Dean Pugh Wednesday afternoon. Mr. and Mrs. Walter Jordan visited his sister Mrs. Trent one afternoon last week. Mr. and Mrs. Roger Coving ton spent Sunday in North"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "ton spent Sunday in <mark>North</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "ton spent Sunday in <mark>North</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1650.23, 850.39, 1812.32, 1207.43], "bbox_id": "1aa2c8ae86", "file": "AppomattoxNewspapers_1892-1898a_0085.pdf", "page": 1, "text": "WOUNDED. 0. C. Falls, member of Friendship Fire Company, mortally wounded. Will Eddy, shot through the groin. George 0. Mnnroe, shot in the head. Frank Wills, shot in the arm. Thomas Nelson, leg shot off, Leroy White, shot in the back. J. B. McGehee shot in the leg flesh wound,  Sheppard, shot in leg. E. J. Small, shot in the stomach. J. F. Powell, shot through the body. J. E. Wayland, clerk in the post- office shot in the leg. Geo. Leigh, clerk at the Ponce de Leon Hotel, flesh wound in leg. Waller P. Huff, knocked down and ankle badly sprained. Mayor H. S. Trout, shot in the foot. Emmett J. Small, of Northwest Roanoke. J. H. Campbell. Edgar Whaling. C. P. North. . O. B. Taylor.  Hall."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Edgar Whaling. C. P. <mark>North</mark>. . O. B. Taylor.  Hall."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Edgar Whaling. C. P. <mark>North</mark>. . O. B. Taylor.  Hall."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [983.87, 1281.13, 1145.3, 1379.23], "bbox_id": "7df36fe181", "file": "AppomattoxNewspapers_1905-1912a_0072.pdf", "page": 1, "text": "Would Make Peary Admiral. Washington, D. C. Special. That Commander Robert E. Peary may he officially recognized by Con gress as the discoverer of the North Pole and promoted to the rank of Rear-Admiral of the Navy the Maine delegation voted to empower one of its members to introduce a resolu tion to that effect. Commander Peary is a resident of Maine."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "the discoverer of the <mark>North</mark> Pole and promoted to"}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "the discoverer of the <mark>North</mark> Pole and promoted to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.25, 872.59, 886.42, 1134.22], "bbox_id": "03e3ca4fbb", "file": "AppomattoxNewspapers_1908-1909a_0400.pdf", "page": 1, "text": "Would -Inflict 10,000 L  Goats oh North Carolina Kinston, N. O.D. Eugene Wood Kinston sportsman, would have -tliR general assembly of North Carolino spend 10,000 to buy 10,000 goats and turn them loose in the eastern and western part Of the state In the hope that the number would Increase to 100,IKK In ten years. He believes, does Mr. Wood, that the goats would Rid the state oT weeds and under growth and thus.beautify woods, and natural parks. Eradicate snakes and other pests by eating up weeds and things that snakes lurk In. Give the mosquito population a wallop by eating weeds In mnrshes and allowing the sun to dry up the water puddles, V And, another thing, they would provide a new. supply of game, he says, adding. If you dont believe it try to catch a tame billy goat when he doesnt want to be caught."}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "10,000 L  Goats oh <mark>North</mark> Carolina Kinston, N. O.D."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "10,000 L  Goats oh <mark>North</mark> Carolina Kinston, N. O.D."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1123.9, 1369.88, 1415.37, 1545.08], "bbox_id": "7390cc3823", "file": "AppomattoxNewspapers_1949-1952a_0132.pdf", "page": 1, "text": "WOULD be difficult to estimate how greatly Americas high standard of health is directly due to our dairy farmers end milk distributors. For milk is more lavishly available to more families in America, and at lower cost, than in any other country, It is the best milk in the world, and abundant supply plus our system of low-cost distribution, create a standard which is a model for the world. One out of every 15 U. S. families is dependent on milk for a livelihood, and 1949 cash farm income from milk, in Virginia, West Virginia and North Carolina alone, totalled 122,162,000. A Situation SO mutuallv favurahlA In nrniiinor Jiatrihuior"}, "highlight": {"text": {"matched_tokens": ["North"], "snippet": "Virginia, West Virginia and <mark>North</mark> Carolina alone, totalled 122,162,000."}}, "highlights": [{"field": "text", "matched_tokens": ["North"], "snippet": "Virginia, West Virginia and <mark>North</mark> Carolina alone, totalled 122,162,000."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
