{"document": {"bbox": [728.07, 360.5, 737.67, 417.25], "bbox_id": "ea635dd88f", "file": "AppomattoxNewspapers_1918-1922a_0317.pdf", "page": 1, "text": "Palmer  ........."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "<mark>Palmer</mark>  ........."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "<mark>Palmer</mark>  ........."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [677.75, 1445.03, 837.22, 1526.85], "bbox_id": "b90245435e", "file": "AppomattoxNewspapers_1922-1923a_0425.pdf", "page": 1, "text": "Your Opportunity. God has made you after His own plan, and He places you just where He wishes you to work with Him to bring about the highest results for yourself. He has given you every opportunity. Make yourself what you willremember it lies with you. God can make no mistakes!Alice Freeman Palmer."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "make no mistakes!Alice Freeman <mark>Palmer</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "make no mistakes!Alice Freeman <mark>Palmer</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1542.26, 542.17, 1691.49, 992.07], "bbox_id": "7819ee959b", "file": "AppomattoxNewspapers_1918-1922a_0381.pdf", "page": 1, "text": "WMhington.Doors of dietillerifi. Ml bonded warehouses in every State the Union, Hawaii and Porto Rico L i ordered indefinitely closed uslnst liquor withdrawals by Prohtbi- KL commissioner Kramer. At the yL time wholesale liquor dealers re ruled out of further participa- Alon in the sale of intoxicating bever Lne by Attorney General Palmer. I Commissioner Kramers drastic or- Lr .topping the flow of liquor from korage and the Attorney Generals in- Crpretation of the Volstead Act, pro- Iribttlon officials said, mean the elira- CgMi of the wholesale liquor deal- tn and makes possible the prevention tf bootlegging through forged per lite and illegal disposal of intoxi- ant. Stoppage of liquor withdrawals all Lver the country and in two of the territories was in extension of the p er issued last week putting a ban t , removals by New York, Pennsyl-1 isnia, Maryland, Massachusetts, Con necticut, Rhode Island and New Jer- hey. The order does not apply to with drawals of industrial alcohol or rea- lonable quantities of sacramental line, and makes exception In the case bt retail druggists, who are permitted to make withdrawals up to five cases pf liquor at a time. J Warning against attempts to obtain Ivhleky despite the nation-wide ban was sent out by Commissioner Kram- L, who directed all owners of dis- plleries and warehouses not to honor lermKs for whisky withdrawals pur porting to be issued by any state di rector, Irrespective or the date such jermlt Is issued or approved by the plrector. No such applications are King approved, he said, adding that Jhilnre to comply with the notice pould deprive owners of their license i hold their stock still in storage."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Lne by Attorney General <mark>Palmer</mark>. I Commissioner Kramers drastic"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Lne by Attorney General <mark>Palmer</mark>. I Commissioner Kramers drastic"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [284.41, 223.08, 447.14, 1727.23], "bbox_id": "c328505bc3", "file": "AppomattoxNewspapers_1912-1915a_0004.pdf", "page": 1, "text": "with the power of selecting and ap pointing the members of the various committees, which committees un der those rules, passed on all pro posed legislation, framed the langu age of the bills, and practicall de cided whether or not legislation should be enacted by the House Under the present rule, the mem bers of the various committees are elected by a majority vote of tbe memberrs of the House. AJao, under tbe Cannon rnles, tbe Speaker was chairman of the power ful committee on rules, and since he bad the appointment of his brother members on that committee, he ac tually controlled the shaping aDd direction of all legislation brought before the House. Under the pre sent rales, not only is the Speaker shorn of bis former autocratic power to appoint members of com mittees, and thns to control the ac tion of the committees, bnt he him self is not permitted to be a member of the committee on roles. Not content with the above-men tioned changes, the House progres sives adopted certain rnles which changed the committees from arbi trary bodies to advisory bodies, and which greatly enlarged the power and influence of the individual members of the Honse. For in stance, under the Cannon rnles, the chairman of a committee could practically prevt a vote being taken on a measure which had been referred to bis committee while un der the prednt rules, although a committee cnairman is influential and powerful when it comes to shaping legislation coming before his committi e, he cannot prevent thy Honse from voting as to whet her or not a measure shall pass the House. The standpat Republicans, toget her with a few reactionary Demo crata, most of whom have since been retired to the shades of private life, fought hard againss the revision of the Cannon rnle, bnt tbey were overwhelmingly defeated, the new rnles were adopted, and Cannon- ism took its place among the things that used to be. In the fighting that preceded tbe final victories of the progressives in the lower Honse of Congress, Mr. Flood was always on the firing line, and he, together with Bepresenta tives A. Mitchell Palmer of Penn sylvania, Clande Kitchin of North Carolina, and James Hay of Vir ginia, ably assisted Bepresentative Oscar W. Underwood of Alabama in the bringing about of those pro gressive reforms that practically re stored to the people the power to shape legislation in the halls of Congress. Previously, when tbe Bepnbli- cans were in control of the Honse, Mr. Flood had frequently attacked the reactionaries who had entrench ed themselves behind the Gannon rnles, and on one occasion when the infamy of those rnles was under discussion on the floor of the Honse, particularly with reference to their application to a bill for the relief of the tobacco growers of Virginia, the member from the Tenth Dist rict, himself the author of a mea sure having for its purpose the re- ief of the Virginia growers, rose in his seat, and by the grace of Mr. Speaker Cannon, delivered a most forctble address in which he scored the antocratic power exercised by the Cannon regime, which, be re marked, had taken from the mem bers of the HonBe the powers dele gated to them by the Federal Con stitntion. Space does not permit me to give yon more than a taste of the milit ant progressivism with which that particular speech was charged, so 1 must content myself with quoting one small paragraph, reserving for my next weeks letter a fuller ac count of the speech, whioh itself alone stamps Henry D. Flood as one of that band of active progres sives whose efforts jrill be a step nearer fnll fruition when Woodrow Wil.on takes his sent in the White Honse. Mr. Flood said When Oliver Cromwell cleared ont liie Parliinent Honse with a file of soldier, it whb no whit more tyranmoal, no whit moie subversive sf the fundamental principles of representative government, than this aeeumptiou of a power which should only be exercised by a ma jority of -this Honse,namely tbe power to legislate. The above words are a matter of record. Tbey stamp the man who uttered them as the kind of fight ing progressive who counts. O b s e r v e r ."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Bepresenta tives A. Mitchell <mark>Palmer</mark> of Penn sylvania, Clande"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Bepresenta tives A. Mitchell <mark>Palmer</mark> of Penn sylvania, Clande"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [381.36, 534.52, 545.37, 591.32], "bbox_id": "a6dbd2a756", "file": "AppomattoxNewspapers_1892-1898a_0341.pdf", "page": 1, "text": "With Gen. Palmer 80 and Gen. Buckner 73 years of age, respecdvely, j victory at a single precinct would prove a disastrous shock to their health."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "With Gen. <mark>Palmer</mark> 80 and Gen. Buckner 73 years of age, respecdvely, j victory at a single precinct would prove a disastrous shock to their health."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "With Gen. <mark>Palmer</mark> 80 and Gen. Buckner 73 years of age, respecdvely, j victory at a single precinct would prove a disastrous shock to their health."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [761.3, 589.68, 920.41, 1313.58], "bbox_id": "90059e7a14", "file": "AppomattoxNewspapers_1898-1902a_0700.pdf", "page": 1, "text": "William CojljnSj colored yeàys, .waè nearty tut to piece! with art ax, by William Dixon aged 70 years. Joseph A. Swain, president of Indiana State University, has accepted the pres idency of Swarthmore. Blenheim, the home of Dr. B. L. Win ston, in Hanover county, Virginia, was destroyed by fire. The combine plate-glass works of the country have agreed to shut down ter it month. The city of New York Wiiì prBsecuté corporations to fortfe them M strip Using s6n éoftl-, , , Cbunsei. fojr Chaile! L. Raymond, of Boston àsfced permission of Vice-Chan cellor Emery at Newark, N. J., to file a bill for a preliminary injunction to restrain the United States Steel Corpora tion from retiring 200,000,000 of pre ferred stock and issuing bonds instead. 1 he Imperial Glucose and Starch Com pany, recently formed to compete With the Glucose Trust, bf the COrn Prdducts Company, Will Construct a 3,000,000 plant near Chicago with ft daily capacity of 25,000 bushels of Cribri. . Jphri Wftriamaker is reported to be back of a deal in progress in Chicago for the purchase of the Palmer House block for the erection of a gigftHtiè de partment store. The wholesale miliiitebs 8f Éjiièagri Upon notice Of .the. Auuubriri Society agreed to stop tJiC itflprirtatloH as well as thè Sale Of thè plumage of singing birds-. Lieut. R. C. Croxton, Twenty-third United States Infantry, attempted to kill himself by shooting in Richmond, Va., where he had gone on sick leave. Thosvald Hansen, who murdered ft boy in Montreal to get if cents, Was hanged, tickets, df admission being soid to see the ha.ngjng. Charles W. Reynolds,pioneer citi zen of Newport News, và, died .there of a CQmplicatirin of diseases. Ed Franks, a moonshiner, living in the mountains of Virginia, shot and killed Samuel Engle. John Fox, a farmer, of Elbow Lane, Minn., killed his brother, his mother and himself. The centennial celebration of the Mili tary Academy at West Point closed with the presentation of. diplomas tri the brie hundredth graduating class. . The pro gram included the presentation of di plomas by President Roosevelt and re marks by General Miles. Capt. R. F. Kolb, Henry B. Gray, George A. Blinn, Jr., and W. L. Dodd, prominent citizens of Alabama, were in dicted by the grand jury of Birming ham on charges of embezzlement. Former Governor General Wood, of Cuba, in an interview in New York, justi fied his course in contributing to a fund for the distribution of literature favoring Cuban reciprocity. Judge Robinson, in the Superior Court of Waterbury, Ct., decided that the ex ecutors of the. Plant will might remove the 17,000,000 trust fund to New York for distribution. The United States transport Warren arrived at San Francisco with a detach ment of soldiers, including some of the fighting Ninth. Rhode Island State troops were or dered to Pawtucket to check the riotous demonstration growing out of the street car mens strike. The Steel Trust filed its answer to the suit brought to prevent the conversion of the 200,000,000 of preferred stock into bonds."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "the purchase of the <mark>Palmer</mark> House block for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "the purchase of the <mark>Palmer</mark> House block for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1746.92, 814.54, 1885.42, 1066.48], "bbox_id": "c0b4b46367", "file": "AppomattoxNewspapers_1971-1973a_0634.pdf", "page": 1, "text": "William A. Coleman, both of Lynchburg. Dental Assistants participat ing were Miss Cynthia Coker and Mrs. Karen Palmer of Lynchburg Miss Vicky Pear son, Mrs. Mary Frances Moore and Mrs. Dorothy W. David son, all of Appomattox. One hundred and ninety persons were examined and fifteen were refered to Dr. Knight, the oral surgeon, for further consultation. Seven tissue studies were made and their results will be known on Friday, Feb. 15th. A biopsy or tissue study is a test to determine disease and is an effort to rule out the danger of a malignancy. Oral or mouth cancer, although not significant in total"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Coker and Mrs. Karen <mark>Palmer</mark> of Lynchburg Miss Vicky"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Coker and Mrs. Karen <mark>Palmer</mark> of Lynchburg Miss Vicky"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [801.09, 1154.36, 954.94, 1355.7], "bbox_id": "ba9fbe1ca5", "file": "AppomattoxNewspapers_1918-1922a_0155.pdf", "page": 1, "text": "Will Tell House Rules Committee Of Deportation Work. Washington.  Attorney-General A. Mitchell Palmer will appear before the House Rules Committee this week to discuss the part he and his depart ment have played in the effort to de port undesirable aliens. Mr. Palmer and Representative Camp bell, chairman of the Rules Committee, were in conference. Palmer appeared at the committee rooms in response to a letter written him by Mr. Camp bell, in which Mr. Campbell pointed out that statements made by attorneys for Assistant Secretary of Labor Post might be considered a reflection upon the Attorney-General and the Depart ment of Justice. He suggested that Palmer should be given a chance to make a statement before the commit tee closed its hearings."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Washington.  Attorney-General A. Mitchell <mark>Palmer</mark> will appear before the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Washington.  Attorney-General A. Mitchell <mark>Palmer</mark> will appear before the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [715.44, 1116.8, 868.49, 1316.84], "bbox_id": "b0c7302876", "file": "AppomattoxNewspapers_1918-1922a_0289.pdf", "page": 1, "text": "Will Tell House Rules Committee Of Deportation Work. Washington.  Attorney-General A. Mitchell Palmer will appear before the House Rules Committee this week to discuss the part be and his depart ment have played in the effort to de port undesirable aliens. Mr. Palmer and Representative Camp bell, chairman of the Rules Committee, were in conference. Palmer appeared at the committee rooms in response to a letter written him by Mr. Camp bell, In which Mr. Campbell pointed out that statements made by attorneys for Assistant Secretary of Labor Post might be considered a reflection upon the Attorney-General and the Depart ment of Justice. He suggested that Palmer should be given a chance to make a statement before the commit tee closed Its hearings."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Washington.  Attorney-General A. Mitchell <mark>Palmer</mark> will appear before the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Washington.  Attorney-General A. Mitchell <mark>Palmer</mark> will appear before the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1017.81, 256.5, 1188.32, 805.08], "bbox_id": "e0344ef338", "file": "TimesVirginian_1983a_0107.pdf", "page": 1, "text": "wife thè late Kenneth B. Hogan. Born in Appomattox, she was a daughter of John Esmond Pugh and Zora Guthrie Pugh, Spout Spring. She was a member of Appomattox Baptist Temple and an employee of Thomasvide Furniture Corporation. In addition to her parents, she is survived by two sons, William Harvey Hogan and Charles Edward Hogan, both of Appomattox five brothers, Tommy Lee Pugh, Houston, Tex., Grover D. Pugh. Lynchburg, Joel Watkins Pugh, Appomattox, and Harold Walker Pugh mid Robert Guthrie Pugh, both of Spout Spring two sisters, Eugenia Pugh Clay, Gladys, and Nora Pugh Webber. Appomattox. Funeral services were held Sunday at 4 p.m. at Robinson Funerql Home by the Rev. Ronald L. Gallagher. Burial was in Liberty Cemetery. ThcHMsKiaclde Moore Thomas Kinckle Moore, 75, of Route 4, died early Saturday morning in Lynchburg General Hospital. He was born in Appomattox County, a son of, the late Hunter Marshall and Bertha Pajrrish Moore. He was a retired welder for Truck Body Corporation and 4 member of Mt. Comfort United Methodist Church. He is survived by his wife, Estelle Doss Moore four sons. L.C. Moore, Gladstone,- T. Eddie Moore, Appomattox, James A. Moore, Lynchburg and Henry Palmer Moore, Richmond a daughter, Mrs. Herbert Peggy Wood, Madison Heights 13 grandchildren and three great-grandchildren. Funeral services were conducted Monday at 2 p.m. from Mt. Comfort United Methodist Church by the Rev. David Camden, with burial in the church cemetery. Robinson Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Moore, Lynchburg and Henry <mark>Palmer</mark> Moore, Richmond a daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Moore, Lynchburg and Henry <mark>Palmer</mark> Moore, Richmond a daughter,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.21, 1221.01, 1588.55, 1391.61], "bbox_id": "6494fd8859", "file": "AppomattoxNewspapers_1905-1912a_0121.pdf", "page": 1, "text": "which was crowded with .friends, who were there to witness the mar riage of Miss Mary Lou, daughter of the lat Ann E. and E. A. Chick, to Mr. James Palmer Carson, form erly of this county, bnt now of Lynchburg. The church was bean tifully dt-co ated with evergreens and snowballs, the color scheme be ing white and gre.u. Rev. J. O. Davidson, uncle of the groom, was the officiating minister. Mrs. J. E. Chick, of Spout Springs, presided at the organ and played Mendel-"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Chick, to Mr. James <mark>Palmer</mark> Carson, form erly of"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Chick, to Mr. James <mark>Palmer</mark> Carson, form erly of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1658.62, 1304.76, 1823.22, 1526.39], "bbox_id": "b07e5158c1", "file": "AppomattoxNewspapers_1947-1949a_0410.pdf", "page": 1, "text": "Whether Costs High, Low LINCOLN, NEB.The idea that the cost of living varies sharply from city to city doesnt carry much weight with the business-research bureau at the University of Neb raska. Living expenses are 12 per cent lower in New Orleans than in Wash ington, but those are the two ex tremes, the bureau reported. In 34 cities studied, the average differ ence amounted to less than 3 per cent, Dr. Edgar Z. Palmer, bureau chief, said. Food costs varied about Vi per cent. It seems to make little differ ence what city we live in, he said Living costs too much in any, and there is not much choice. Population appears to have no effect on living expenses, Palmer said."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "cent, Dr. Edgar Z. <mark>Palmer</mark>, bureau chief, said. Food"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "cent, Dr. Edgar Z. <mark>Palmer</mark>, bureau chief, said. Food"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.29, 1630.27, 1680.07, 1787.51], "bbox_id": "334733b9c2", "file": "AppomattoxNewspapers_1926-1933a_0417.pdf", "page": 1, "text": "Whereas it hath seemed wise and good in sight of our Heaven ly Father to call unto Himself ------- f... ! after an illness of only a few Miss Ada Zelia Ince and Mr 1 hours, a beloved member of our - p- Ranson Jr. nmww1 Willing Workers Sunday School Carried p - at the i ergreen Sunday Pastor, Rev. Goad. aPle left on No. 6 for tore home Norfolk, Va. shes for Zelia and Palmer. Misses Virginia Hanson have"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "shes for Zelia and <mark>Palmer</mark>. Misses Virginia Hanson have"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "shes for Zelia and <mark>Palmer</mark>. Misses Virginia Hanson have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [704.39, 457.66, 1191.6, 793.53], "bbox_id": "b5cdc00d8d", "file": "AppomattoxNewspapers_1902-1905a_0585.pdf", "page": 1, "text": "When Frederick Krugal and John Monahan, mere boys both, were before Captain Brennan in the East One Hun dred and Fourth Street Station, the story of the strangest thief chase Harlem has known in a long while was told. Police man Lawlor saw them steal a pocket- book from a baby carriage, drew his pis tol, and shoved its muzzle into Krugals side. You chase your pal, the policeman directed, or Ill blow a hole through you. At One Hundred and Twelfth street Krugal was neck and neck with Mon ahan. Grab him, Lawlor shouted, or Ill shoot! Krugal grabbed. The next instant both lads were under arrest.  After being tempered with an old- fashioned spanking prescribed by Re corder Stanton, of Hoboken, Frank Led- ing, aged 17 years, is expected to wake up from his love dream. He is in a cell  __ , ___ , ___ in Hoboken police headquarters now, and found charred and blackened in another in the detention ward, where she can be room. looked after by the matron, is Mabel The father said that he had bound Pierce, an attractive girl of 16. They them securely and set fire to the house, were arrested in Hudson Square Park but it is believed they were first mur-  after an elopement and several days of dered with an axe or a hatchet, and then I wandering. Recorder Stanton said he i possibly bound as he described. It re- thought the best thing for Leding was a Yellow fever caused one death in Pen- I ffure a half dozen men to overcome spanking, and if the youths father would sacola, Fla. I Ford, as he fought like a demon when administer it the court would permit the The steamer Juniata, of the Mer- he discovered that he was to be placed brave but penniless youth to return to chants and Miners Line, bound from 1 unt.r .arrg.s.t Ford is 50 years of age  the parental roof.___The girl will be sent Boston to Baltimore, collided with the five-masted schooner Harwood Palmer,"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "the five-masted schooner Harwood <mark>Palmer</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "the five-masted schooner Harwood <mark>Palmer</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1097.3, 383.51, 1263.17, 640.41], "bbox_id": "7bec315e3a", "file": "AppomattoxNewspapers_1912-1915a_0552.pdf", "page": 1, "text": "West Point voters and voters gen erally are hustling to get their poll taxes paid to quality for the primary on August 3 and the general election to November. West Point and King William voters will be called on to choose a Senator, member of the Leg islature, county treasurer, sheriff commissioner of the revenue. Com monwealths attorney and many other county officials. Three candidates are now in the field for county treasurer, R. T. Palmer, incumbent, f West Point E . S. Carter, of Manquta, and Beauregard Turner, of Sweet Hall. Mr. Carter has announced that he will not enter the primary and will run as an independent. For the office of sheriff, two rondidates have entered the race, W. L . Neale, incumbent, of LeBter Manor, and J . L. Gregory, of King Wil liam h . 1. Lewis, who has filled the office of Commonwealths attorney for many years, haB no opposition, and as yet no one has announced his inten tion of opposing H. W. Neale, present commissioner of revenue."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "county treasurer, R. T. <mark>Palmer</mark>, incumbent, f West Point"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "county treasurer, R. T. <mark>Palmer</mark>, incumbent, f West Point"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2165.05, 871.1, 2330.76, 914.24], "bbox_id": "94f03819fb", "file": "TimesVirginian_1983a_0102.pdf", "page": 1, "text": "week and Bfra. Palmer Moore and family, fo Richmond rod Mrs. Emma Totty."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "week and Bfra. <mark>Palmer</mark> Moore and family, fo Richmond rod Mrs. Emma Totty."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "week and Bfra. <mark>Palmer</mark> Moore and family, fo Richmond rod Mrs. Emma Totty."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2491.85, 1306.32, 2644.72, 1682.3], "bbox_id": "a70e9a029c", "file": "TimesVirginian_1981a_0425.pdf", "page": 1, "text": "We are asking all desiring to sing for our Lord, please join our choir. Mr. Jerry Wayne Davis, son of the late Mr. Charlie Edward Davis, of Appomattox, was married Saturday, December 5, at 2 p.m. to Miss Mary Rose Matthews, daughter of Mr. and- Mrs. George Rowland Matt hews of Appomattox. The double ring ceremony was performed by Rev. R. Q. Lawing Sr. A large number of relatives and friends witnessed the ceremony. Mr. Willie Harvey is receiv ing special treatment at LG ML Hospital. We extend our  sympathy to the family of Mr. Tommy Kelso. Let us pray with and for them. Mr. and Mrs. Henry Palmer spent their vacation in Balte more, Md. as guests of relatives and friends. The sick of our church and community are improving. A special talent program was successful at Promise Land. Many local churches were represented. Mrs. Thelma Hancock was the sponsor. In conclusion, let us think of helping others. See you in church."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Mr. and Mrs. Henry <mark>Palmer</mark> spent their vacation in"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Mr. and Mrs. Henry <mark>Palmer</mark> spent their vacation in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [546.89, 1291.78, 1039.74, 1418.93], "bbox_id": "e2ea1c3a3b", "file": "AppomattoxNewspapers_1905-1912a_0050.pdf", "page": 1, "text": "ways puzzled scientists. Before the Society of American Bacteriologists, Prof. C. E. A. Wins low and G. T. Palmer declared, as the result of their investigations, that the types of bacilli in a horse, cow and man are different. Wheth- animals can give tubercu losis to a man, he said, is not de finitely settled. The workings were badly damaged. The.mine had been in operation one year. Charles Carlson, one of the dead, lost two relatives in the Cherry 111. disaster."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "low and G. T. <mark>Palmer</mark> declared, as the result"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "low and G. T. <mark>Palmer</mark> declared, as the result"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [421.45, 569.82, 579.92, 1296.01], "bbox_id": "d11cc5f250", "file": "AppomattoxNewspapers_1918-1922a_0406.pdf", "page": 1, "text": "Washington.-Tho wholesale liquor establishment, brother of tho bar, will be put to death May 16 under sen tence pronounced by Prohibition Com missioner Kramer. Although an opinion rendered by At torney-General Palmer last December said the wholesaler had no legal right to continue in business, Internal Rev enue and prohibition officials decided to grant some time In which he could unload stocks without too heavy mon etary loss. But Mr. Kramers an nouncement mtfde It clear there would be no further extension of time and that execution of tho sentence would be carried out. Mr. Kramer, however, opened the way for the retail druggist to obtain supplies for prescriptions, removing the Imn on withdrawals from bonded warehouses. For sevoral months such warehouse doors have been closed. The order makes it possible for the retail druggist to transact business direct with the bonded warehçuses Wholesae druggists will be taken care of later. Mr. Kramer Indicated, by granting them similar privileges. Dealings between retail druggists and other purchasers and the bonded warehouses later will be limited by regulations which officials declared would be drastic enough to satisfy the I most ardent dry advocate. They must  be based, however, It was added, on  Mr. Palmers opinion. It Is planned to put them In effect about the time the wholesale houses go out of exist ence. So far aB the wholesaler Is con cerned, Mr. Kramer said, his one task now is to get rid of the stocks on hand. He will not be allowed to in crease his present holdings, but there are no strings, tied, to him .In selling 18druggists, either wholesale or lé tau, before May 15. Officials an nounced no Agures concerning the amount of liquor held by the whole salers, but said they believed the stocks largely would be disposed of before the doors are closed finally. Prohibition officials declined to com ment on the statement in Pblladel phla of former Attorney General Pal mer, who said his recent ruling that physicians may prescribe beer might mean that beer could be sold over soda fountain counters Regulations carrying out Mr. Palmers opinion! handed down the day before he retired from office, will be left to the next Commissioner of Internal Revenue, said Commissioner Williams, adding that therefore the full effect of the opinion could not now be determined. The Revenue and Prohibition bu reaus have been besieged since the Palmer opinion was made public, both wets and drys urging their sides for consideration of the officials In draft lng the regulations. Although consid erable study has been given to the ruling, there was no indication that the regulations could be completed short of another 10 days."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "rendered by At torney-General <mark>Palmer</mark> last December said the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "rendered by At torney-General <mark>Palmer</mark> last December said the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.88, 551.7, 1684.01, 1284.1], "bbox_id": "1d1befa1f5", "file": "AppomattoxNewspapers_1918-1922a_0405.pdf", "page": 1, "text": "Washington.The wholesale liquor establishment, brother of the -bar, will be put to death May 15 under sen tence pronounced by Prohibition Corn missioner Kramer. . Although an opinion rendered by At torney-General Palmer last December said the wholesaler had no legal right to continue in business. Internal Rev enue and prohibition officials decided to grant some time in which he could unload stocks without too heavy mon etary loss. But Mr. Kramers an nouncement mqde it clear there would be no further extension of time and that execution of the sentence would be carried out. Mr. Kramer, however, opened the way for the retail druggist to obtain supplies for prescriptions, removing the ban on withdrawals from bonded warehouses. For several months such warehouse doors have been closed. The order makes it possible for the retail druggist to transact business direct with the bonded warehouses Wholesae druggists will be taken care of later. Mr. Kramer Indicated, by granting them similar privileges. Dealings between retail druggists end other purchasers and the bonded warehouses later will be limited by regulations which officials declared would be drastic enough to satisfy the most ardent dry advocate. They must be based, however, it was added, on Mr. Palmers opinion. It is planned to put them in effect about the time the wholesale houses go out of exist ence. So far as the wholesaler 18 con cerned, Mr. Kramer eald, his one task now Is to get rid of the stocks on hand. He will not be allowed to in crease his present holdings, but there are no strings lfct3fingg!5tsre!ther wholesale or re tell, before May 15. Officials an nounced no figures concerning the amount of liquor held by the whole- lalers, but said they believed the stocks largely would be disposed of before the doors are closed finally. Prohibition officials declined to com- ment on the statement In Philadel phia of former Attorney General Pal- mer, who said his recent ruling that . physicians may prescribe beer might mean that beer could be sold over soda fountain counters Regulations carrying out Mr. Palmers opinion, handed down the day before he retired from office, will be left to the next Commissioner of Internal Revenue, said Commissioner Williams, adding that therefore tbe full effect of the opinion could not now be determined. The Revenue and Prohibition bu reaus have been besieged since the Palmer opinion was made public, both Wets and drys urging their sides for consideration of the officials In draft ing the regulations. Although consid erable study has been given to the ruling, there was no Indication that the regulations could be completed short of another 10 days."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "rendered by At torney-General <mark>Palmer</mark> last December said the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "rendered by At torney-General <mark>Palmer</mark> last December said the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1707.64, 654.85, 1877.63, 1129.94], "bbox_id": "86b0612a58", "file": "AppomattoxNewspapers_1947-1949a_0110.pdf", "page": 1, "text": "WASHINGTON.Secretary of In terior Julius P. Krug has announced that 45,000 acres in Alaskas Mata nuska .valleynear the ghost town of Knikwould be opened to home steading next spring. . The district land office at Anchor age will start accepting applications from war veterans October 17. The general public can apply after next January 15. Actual settlement will be permitted six months after appli cations are approved. Krug said most of the land is un improved but suitable for farming. This is in contrast with 2,750,000 acres of public land along the Alaska highway, upon which settlement, may begin  October 2. The newly opened highway, lands are non-agri- cultural.  The new Matanuska homesteads may not exceed 160 acres. The land is free. There is a filing fee of 5 for tracts not larger than 80 acres and 10 for tracts of 81 acres or more, plus a commission of 1.50 for each 40 acres. The proposed homesteads are in the Wasilla-Goose Bay region, in the northeastern end of Knik Arm, 48 miles from Palmer, headquarters of the Alaska Rural Rehabilitation corporation farm cooperative proj ect, or 15 minutes by plane from Anchorage The Alaska railroad crosses the northern end of the area. .. Krug said the decision to open the area to settlement was based on land classification reports showing that the area was suitable for farm ing and is needed for further devel opment of the valley. The bureau of land management said the area is sparsely settled, partially because the original Mata nuska development in 1935 drew settlers away from the Wasilla- Goose B s v region."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Arm, 48 miles from <mark>Palmer</mark>, headquarters of the Alaska"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Arm, 48 miles from <mark>Palmer</mark>, headquarters of the Alaska"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.7, 544.44, 1707.53, 854.76], "bbox_id": "ba06a44985", "file": "AppomattoxNewspapers_1918-1922a_0192.pdf", "page": 1, "text": "Washington.Proceedings asking that Bainbridge Colby, secretary of Mate, be enjoined from issuing any proclamation declaring the suffrage amendment ratified, wero instituted In the District of Columbia Supreme Court by Charles S. Fairchield, of New York, president of the Ameri can Constitutional League. Mr- Fairchild also seeks ito prevent Attorney General Palmer from en forcing the amendment. Justice Bailey Issued a rule on Secretary Col by and the Attorney General to dhow ause July 13 why the motion should hot be granted. The basis of the proceedings is the Olatm -that the ratification of the amendment by the West Virginia Legislature was Illegal because ac complished by fraud and that the praptaed ratifica,liii-m iby the Tennessee Legislature also would be illegal on SCOTTSVILLE, VA. Main Offices at Scottsville, 1 tj,e ground that the legislature lacked  -   ---------------- -Authority under the states constltu- DR. L. L. GAYLE tlon to act on the measure. Only 35 ptates have ratified the DENTIST amendment, and as ratification by Office Over Babcock1 Sin one other is necessary the attack on the amendments through the courts at this time came as a surprise in suffrage circles here. An attack on the legality of the action of the Ten-"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "ito prevent Attorney General <mark>Palmer</mark> from en forcing the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "ito prevent Attorney General <mark>Palmer</mark> from en forcing the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.8, 686.86, 1341.72, 1211.24], "bbox_id": "0d6d9a11f9", "file": "AppomattoxNewspapers_1918-1922a_0409.pdf", "page": 1, "text": "Washington.Four new moVss were made here in the wet and dry con troversy, revived and inflamed by the Palmer decision that the prohibition enforcement officers cannot prohibit or limit physicians prescriptions for beer for medicinal purpose. They were President Harding was told in a conference at the White House by Wayne B. Wheeler that the Anti- Saloon League would not stand for a Commissioner of Internal Revenue with a wet record. The solicitor of the Internal Rev enue Bureau rendered a decision hold ing that the prohibition unit cannot collect a beverage tax on liquor pur chased by a druggist if it is stolen or destroyed, and the Department of Justice has upheld him. A light wine and beer backfire prop aganda campaign, through a chain of postcards, was started on Congress. In the Supreme Court the validity of the prohibition amendment was at tacked on the ground that the section making the amendment inoperative unless ratified in seven years violates Article V of the Constitution, which gives Congress no power to impose a limit on ratification or to otherwise attempt to control what the Legisla tures of the States shall do In their deliberaions. Mr. Wheeler called at the White House to make clear the attitude of the prohibitionists. While the Anti- Saloon League will have no particular candidate to collect the taxes and en force the dry laws of the country, Mr. Wheeler told the President,  it will signature of a peace  treaty with Po- --------- land and a trade agreement with Great oppose with all its ability anyone sug- Britain. gested if he cannot toe the prohibi- Not all these treaties conform to tion mark. He explained that all our desires, says the message, but would be well if a man who will fand they are significant successes for the Soviet and show the consolidation of its power on the international front. China and Rumania have addressed a proposal to Russia to enter into peace negotiations, continues the statement, which adds Tlius France, with her cold, per sistent hatred of Soviet Russia, will remain a solitary power, keeping aloft from Soviet Russia."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "and inflamed by the <mark>Palmer</mark> decision that the prohibition"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "and inflamed by the <mark>Palmer</mark> decision that the prohibition"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [372.51, 556.99, 524.4, 1014.09], "bbox_id": "46fe79fa8c", "file": "AppomattoxNewspapers_1918-1922a_0579.pdf", "page": 1, "text": "Washington.Doors of distilleries tad bonded warehouses in every State In the Union, Hawaii and Porto Rico yere ordered indefinitely closed ,gainst liquor withdrawals by Prohibi tion Commissioner Kramer. At the lame time wholesale liquor dealers tere ruled out of further participa tion in the sale of intoxicating bever sges by Attorney General Palmer. Commissioner Kramers drastic or der stopping the flow of liquor from Storage and the Attorney Generals in-  terpretation of the Volstead Act, pro-  hibttion officials said, mean the elim ination of the wholesale liquor deal ers and makes possible the prevention t of bootlegging through forged per- nlts and illegal disposal of intoxi-  cants. Stoppage of liquor withdrawals all i orer the country and in two of the territories was in extension of the order issued last week putting a ban on removals by New York, Pennsyl vania, Maryland, Massachusetts, Con necticut, Rhode Island and New Jer sey. The order does not apply to with drawals of industrial alcohol or rea sonable quantities of sacramental vine, and makes exception in the case of retail druggists, who are permitted to make withdrawals up to five cases of liquor at a time. Warning against attempts to obtain whisky despite the nation-wide ban was sent out by Commissioner Kram er, who directed all owners of dis tilleries and warehouses not to honor permits for whisky withdrawals pur porting to be issued by any state di rector, irrespective or the date such permit is issued or approved by the director. No such applications are being approved, he said, adding that failure to comply with the notice would deprive owners of their license to hold their stock still in storage."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "sges by Attorney General <mark>Palmer</mark>. Commissioner Kramers drastic or"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "sges by Attorney General <mark>Palmer</mark>. Commissioner Kramers drastic or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1667.39, 557.79, 1850.85, 1018.49], "bbox_id": "1ad0e776c3", "file": "AppomattoxNewspapers_1918-1922a_0578.pdf", "page": 1, "text": "Washington.Doors of distilleries Led bonded warehouses in every State in the Union, Hawaii and Porto Rico Imre ordered indefinitely closed Lgoinst liquor withdrawals by Prohlbi- Kion Commissioner Kramer. Ait the Lame time wholesale liquor dealers Enre ruled out of further participa nt!! in the sale of intoxicating bever ties by Attorney General Palmer. Commissioner Kramers drastic or- fer stopping the flow of liquor from orage and the Attorney Generals in terpretation of the Volstead Act, pro- Ihibttion officials said, mean the elim- linatiion of the wholesale liquor deal-  lers and makes possible the prevention lot bootlegging through forged per- suits and illegal disposal of Intoxi- uti. Stoppage of liquor withdrawals ail over the country and in two of the IterrKorles was in . extension of the  order Issued last week putting a ban Ion removals by New York, Pennsyl- j I von I a, Maryland, Massachusetts, Con- Inectlcut, Rhode Island and New Jer- Isay. The order does not apply to with drawals of industrial alcohol or rea sonable quantities of sacramental rlne, and makes exception in the case of retail druggists, who are permitted make withdrawals up to five cases Df liquor at a time. Warning against attempts to obtain whisky despite the nation-wide ban Was sent out by Commissioner Kram- ler, who directed all owners of dis- Rlllerles and warehouses not to honor IpermR8 for whisky withdrawals pur porting to be issued by any state di- i statl pector, irrespective or the date such ownl permit Is Issued or approved by the! pomj director. No such applications are I tlon  being approved, he said, adding that failure to comply with tho notice would deprive owners of their license to hold their stock still in storage."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "ties by Attorney General <mark>Palmer</mark>. Commissioner Kramers drastic or-"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "ties by Attorney General <mark>Palmer</mark>. Commissioner Kramers drastic or-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1706.58, 719.76, 1851.17, 1645.15], "bbox_id": "f572ca26fb", "file": "AppomattoxNewspapers_1918-1922a_0401.pdf", "page": 1, "text": "Washington.Beer and wines I given the same status as whlsky der an opinion by the Attorney eral just made public by the BuJ of Internal Revenue. The ruling, one of the most ImJ ant since the advent of national hlbttlon, makes it possible for all hollc liquors to he used for mej and other nonbererage purposes, for all to be manufactured and for these purposes subject only tol limitations ot the Volstead Act nonbererage intoxicants. The opinion was written by fori Attorney General Palmer the day tore he retired from offlee, and wa reply to a series of questions f internal revenue and prohibition dale bearing on construction of a dozen moot points ta the law. There are many rumors afloat the opinion had wrecked plans of I advocates of liquor sales. Officials fused to comment on the reports, ever, but Wayne B. Wheeler, genl counsel of the Anti-saloon Leagucf sued a statement ta which he that 39 States had State codes hiblttag the prescribing of beer I medicinal purposes. Mr Wheelert fared the opinion was not ta act! with the purpose of the Federal l Congress clearly did not Intend attempt to legalize what the .Stl laws prohibit, Mr. Wheeler si Unless the opinion Is overruled j ress should amend the law. Itl difficult, of course, to overrule it I cause the Government and the hrl ers are on the same side of the c and there Is no one to contest It less the new Attorney General oj rules the opinion. The opinion appeared amblguousl some respects, officials said, and as result they were unable to determf whether the government had pow the light of the ruling, to limit number of prescriptions which a p eiclan may write, except that the ll specifies no more than a pint per n son ta a ten-day period. Mr. PalirT 1 deolared he believed It the purpn of Congress to leave the pliyslcl unfettered by governmental contrn yet he thought that regulations mis properly restrict the amount to bo ei on any one prescription. Mr. Palmer called attenlon to pi visions of law which, apparently, hi left the physician to act on his Ju ment. He suggested then that whei physician abused the privilege could be dealt with criminally, ll added that In no case should the jui ment of the physician he supplant by that of enforcement officials, situation he believed would rei from regulations attempting to xj trol the use of prescriptions. Replying to the question whethl the Government could restrict t  number of permits to manufacti sell or prescribe In any State or col munlty. Mr. Palmer explained thl the Volstead Act had limited only tj classes to which permits could issued and had permitted no dfscrlr nation between persons within tho classes. He said the withholding permits could not be done legalll even though officials were convincj that fewer permits would suffice any given State or city. Mr. Palmer advised officials thl they had ample authority to wri such regulations as they belfei necessary to make certain the forcement of the law. Dry advooatl stressed this statement, declarlJ that by It means would be fo u j which would circumvent and hand cap sale of beer and wines and wo not throw open the door to mam facture of quantities of high alcoholj beer again as anti-prohibitionists stated."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "by fori Attorney General <mark>Palmer</mark> the day tore he"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "by fori Attorney General <mark>Palmer</mark> the day tore he"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [583.85, 723.4, 742.6, 1643.7], "bbox_id": "737b66588d", "file": "AppomattoxNewspapers_1918-1922a_0402.pdf", "page": 1, "text": "Washington.Beer and wines are given the same status as whisky un der an opinion by the Attorney Gen eral just made public by the Bureau of Internal Revenue. The ruling, one of the most import ant since the advent of national pro hlbition, makes it possible for all alco holic liquors to be used for medical and other nombeverage purposes, and for all to be manufactured and sold for these purposes subject only to the limitations of the Volstead Act on nonbeverage intoxicants. The opinion was written by former Attorney General Palmer the day bé fore he retired from office, and was in reply to a series of questions from internal revenue and prohibition offi cials bearing on construction of half a dozen moot points in the law. t There are many rumors afloat that the opinion had wrecked plans of dry advocates of liquor sales. Officials re fused to comment on the reports, how ever, but Wayne B. Wheeler, general counsel of the Anti-saloon League is sued a statement in which he said that 39 States had State codes pro hibiting the prescribing of beer for medicinal purposes. Mr Wheeler de clared the opinion was not in accord with -the purpose of the Federal law. Congress clearly did not intend to attempt to legalize what the State laws prohibit, Mr. Wheeler said Unless the opinion is overruled Con gress should amend thé law. It is difficult, of course, to overrule it be cause the Government and the brew ers are on the same side of the case and there is no one to contest it un less the new Attorney General over rules the opinion. The opinion appeared ambiguous in some respects, officials said, and as a result they were unable to determine whether the government had power. In the Hght of the ruling, to limit the number of prescriptions which a phy sician may write, except that the law specifies no more than a pint per per son in a ten-day period. Mr. Palmer declared he believed it the purpose of Congress to leave the physician unfettered by governmental control, yet he thought that regulations might properly restrict the amount to be sold on any one prescription. Mr. Palmer called attenion to pro visions of law which, apparently, had left the physician to act on his judg ment. He suggested then that when a physician abused the privilege he could be dealt with criminally, but added that In no case should the judg ment of the physician be supplanted by that of enforcement officials, a situation he -believed would result from regulations attempting to con trol the use of prescriptions. Replying to the question whether the Government could restrict the number, of permits to manufacture, sell or prescribe in any State or com munity, Mr. Palmer explained that the Volstead Act had limited only the classes to which permits could be issued and had permitted no discrimi nation between persons within those classes. He said the withholding of permits could not be done legally, even though officials were convinced that fewer permits would suffice in any given State or city. Mr. Palmer advised officials that they had ample authority to writ1? such regulations as -they believed necessary to make certain the en forcement of the law. Dry advocates stressed this statement, declaring that by It means would be found which would circumvent and handi cap sale of beer and wines and would not throw open the door to manu facture of quantities of high alcoholic beer again as anti-prohibitionists in sisted."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "by former Attorney General <mark>Palmer</mark> the day bé fore"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "by former Attorney General <mark>Palmer</mark> the day bé fore"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1957.44, 581.94, 2114.86, 903.69], "bbox_id": "d731ae9032", "file": "AppomattoxNewspapers_1918-1922a_0143.pdf", "page": 1, "text": "Washington.Attorney-General Pal mer will take up the question of gov ernmental action in the soalled out law railroad strike immediately. Offi cials of the Department of Justice were busy Sunday assembling detailed reports, gathered by telephone and telegraph from all important strike centers. Action can be taken by the Govern ment under the Lever act, in the pres ent case, it was said. There was a slight hint, however, that in event Mr. Palmer decided to throw the weight of the Government into the con troversy, it would not be by the in junction process which was the meth od employed in the bituminous coal strike. Officials apparently favor the use of the criminal indictment to check the power of the so-called out laws. If the Government moves to end the strike by authority of the Lever act, it was indicated -the basis would be a charge that the flow of food shipments had been stopped, or hindered at least. Although the provisions of the Lever act make It possible to charge a con spiracy, it was believed that by whole sale indictment of individuals the strike could be ended more quickly than through the lodging of con spiracy charges against the strike leaders."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "that in event Mr. <mark>Palmer</mark> decided to throw the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "that in event Mr. <mark>Palmer</mark> decided to throw the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.89, 533.79, 1679.62, 1155.29], "bbox_id": "1d65401468", "file": "AppomattoxNewspapers_1918-1922a_0316.pdf", "page": 1, "text": "Washington.- .-Proceedings asking Out Balnbridge Colby, secretary of ,tste be enjoined from issuing any proclamation declaring the suffrage mendment ratified, were -instituted in the District of Columbia Supreme Court by Charles S. Fairchield, of jew York, president of the Ameri ca Constitutional League. Mr. Fairchild also seeks to prevent Attorney General Palmer from en forcing the amendment. Justice Bailey issued a rule on Secretary Col ly and the Attorney General to Show aause July 13 why the motion should sot be granted. The basis of the proceedings is the claim that the ratification of the amendment by the West Virginia Legislature was illegal because ac complished by fraud and that the proposed mtlficaitiiian toy the Tennessee Legislature also would be illegal on tie ground that the legislature lacked authority under the states constitu tion to act on the measure. Only 35 states have ratified the amendment, and as ratification by one other is necessary the attack on tie amendments through the courts at this time came as a surprise In wffrage circles here. An attack on the legality of the action of the Ten nessee legislature had been expected, but not until the legislature actually had acted. In anticipation of such a move by the anti-suffrage forces, the organiza tions supporting the amendment have arged early action by more than 36 states so that the amendment could become operative in time to permit ! the omen to vote In the4presiden- ! dal election this year.  Application for the restraining or der was said by the National Wom ans Party, in a statement, to indi cate the bitterness of the opposition  to suffrage and the determination  ol its opponents to defeat the oto- I tiouswlll of states which have signi fied their approval of the enfranchise-  sent of the women of the nation. ... We are convinced that, as In the  Ohio referendum case, said the j Womans Party statement, the  validity of the action of the various  Hate legislatures in ratifying the suf- i Inge amendment will finally be up held by the courts. Anti-suffragists  are evidently grasping at straws in  their attempt through court proceed- i lags to lengthen the suffrage strug- ! fie and to force the expenditure of more money and time by suffragists lor the success of their cause."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "to prevent Attorney General <mark>Palmer</mark> from en forcing the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "to prevent Attorney General <mark>Palmer</mark> from en forcing the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [378.27, 560.02, 535.15, 1484.36], "bbox_id": "c02b0045c2", "file": "AppomattoxNewspapers_1918-1922a_0587.pdf", "page": 1, "text": "Washington.- on charges of high I crimes and misdemeanors, Federal I Judge K. M Landis, of Chicago, was I impeached in the House of Representa I lives bv Representative Welty Demo- I crat of Ohio, because of his accept- I ance of the office of supreme arbitrator I of baseball while still serving on the I bench. In taking this step the Ohio mem- I ber swept aside an opinion by Attor- I ney General Palmer that Judge Lan- I dis was within the law and that there I was no law making such acceptance I a crime, either misdemeanor or fel- I ony. The opinion was rendered re- I cently by the Attorney General on the I written request of Mr. Welty, who I had questioned the Judges right to I hold both positions. I Before proceeding to the floor of I the House, where his charges were I read, Mr. Welty refused a request by I Senator Dial Democrat of South I Carolina, to include in the general  Indictment statements attributed to  Judge Landis in refusing to send to I Jail a young Ottawa 111. bank clerk I because of the Judges belief th a t1 officials of the bank were responsible  for the clerks peculation by failure j to pay him a living wage. Senator Dial, on receiving the Ohio j representatives refusal, announced he would file complaint against Judge Landis with the Department of Justice,  and late in the day attacked the Chicago jurist on the floor of the Sen-  ate, describing him as a freak and a  crank. The South Carolina Senator i i characterized Judge Landis state-, ment that the Ottawa bank clerks   employers were, in a measure, re sponsible for the youths theft of 96,000 as the most bolshevik doctrine I ever heard. and added that if the action taken by the judge in paroling the clerk is to be encouraged, it is striking at the foundations of our gov ernment. There was no comment in the House when Mr. Welty concluded the reading of a formal indictment of Judge Lan dis. On his own motion, as is customary In such proceedings, the indictment was referred to the Judiciary Com mittee without debate. Less than a third of the members present voted, and a number of scattering voices were lifted in opposition. Nobody asked for a rising vote. Representa tive Sherwood, Democrat, of Ohio, sit ting on the front row, clapped his hands, hut otherwise there was no in dication as to how the House felt. The next step will be by Mr. Welty, who will appear, possibly this week, before the Judiciary Committee, with such witnesses as he sees fit to call, to amplify his charges. The commit tee will then decide whether to go ahead with the case. It has the power to dismiss the charges and so report to the House, and adoption of such a report would exonerate Judge Landis of the charges preferred by Mr. Welty. Belief was expressed in House circles that the case would be thrown out by the committee, in view of the opinion by the Attorney General. In that event the end would come before adjournment of Congress on March 4. Adjournment, however, would not stop proceedings should the committee find enough evidence to send the case on to the House. The impeachment proceedings the Judiciary Committee acts in a simi lar capacity to a justice of the peace. The House -s the grand jury, and if the House indicts it transmits its find- lnP t0 the Senate, which becomes the trial court. It requires only a ma jority vote for the House to indict, hut a two-thirds vote by the Senate is necessary to convict."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Attor- I ney General <mark>Palmer</mark> that Judge Lan- I"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Attor- I ney General <mark>Palmer</mark> that Judge Lan- I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [128.63, 422.34, 295.47, 921.19], "bbox_id": "5581b3363e", "file": "AppomattoxNewspapers_1912-1915a_0315.pdf", "page": 1, "text": "Washington, D. C.Framers of the American Income Tax Law are not worried by the capitalist fugitives who are expatriating themselves to escape the tax. Leaders said Representative Underwood If It be true that American millionaires are seeking asylum in England to escape the American Income tax, they will be hurt more than they now know. I think there must be another reason why they should seek the sovereignty of Great Britain, and it might be in their love for a monarchy over their iove for a republic. Representative Hull, Tennessee framer of the Income Tax Law The American tax on small incomes is less than Englands tax. It is less, in fact, than the income tax levy by any Eu ropean country, and the American who vents his resentment on this country because of its new income tax law will have to flee to some uncivilized coun try to escape payment of this tax. I have no sympathy with any one who has made his money in this country and who seeks to evade payment of lust taxation. Representative Rainey, Illinois We can better afford to lose than to hold those of our rich who are fleeing to foreign countries to escape taxation. We have their property and their agents will pay this countrys levies. It is a good riddance. Representative Sabath, Illinois No American who has lived and knows eondltiohs in foreign countries where Income taxes are levied will flee the Income tax of the United States. If he does the protection of this coun try should be withdrawn, because we do not want him. Representative Palmer, Pennsyl vania The income tax has come to stay in this country. Our millionaires will learn to conform to its require ments. Those Americans who are living abroad will find they will have to pay an income tax and they will learn its burden is heavier than the tax imposed by this country."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "not want him. Representative <mark>Palmer</mark>, Pennsyl vania The income"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "not want him. Representative <mark>Palmer</mark>, Pennsyl vania The income"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [521.71, 372.3, 682.42, 1085.2], "bbox_id": "6e0121967a", "file": "AppomattoxNewspapers_1902-1905a_0588.pdf", "page": 1, "text": "Washington, D. C. Special.Thou sands of his fellow-citizens turned out to welcome President Roosevelt to the national capital, and made his home coming an occasion for an ovation from the time he was sighted on the plat form of his car until he passed within the doors of the White House. There was no band of music, but the sweeter melody of the cheers of the assembled people made the air ring with hurrahs as his carriage passed slowly up the avenue. It was awfully kind of them to come out to greet me, the President remarked to some friends at the White House por tecochcre, and I was deeply, deeply touched by their welcome. The presidential train came into the station at 619 oclock. On the platform were assembled a dozen or more officials. At their head was Mr. West, the Dis trict Commissioner, who was in charge of the arrangements for the welcome, and who was the first to shake the Pres idents hand as he stepped from the train. With the President were his sec retary of state, Mr. Root, and Mrs. Root and the secretary of the treasury, Mr, Shaw. At the station were Secretary Hitchcock, Postmaster General Cortelyou Mr. Quesada, the Cuban minister Dr. Rixey, the surgeon general of the Navy Mr. Palmer, the marshal for the Dis trict of Columbia, and others. A mighty cheer went up as the crowd inside the depot caught sight of the President, which was taken up by the crowds outside of the station and passed along the line as the President was recognized. He shook hands first with the Cabinet members and other officials. Then, giving Mrs. Roosevelt his arm, he walked slowly to his carriage, which was waiting at the Sixth street entrance. As he reached the engine the President thanked the engineer for his safe trip and stopped to shake his hand. In the car riage with the President were Mrs, Roosevelt, Ethel, Kermit and Quentin Quentin sat on the box with the coach man. The cabinet officers and the other mem bers of the party followed in carriages, accompanying the President to the White House. The President frequently arose and bowed to the cheering crowds on both sides of the Avenue, and, during the latter part of the drive, the hur rahs became so enthusiastic that the President stood most of the time. Mrs Roosevelt was greatly pleased with the greeting, and her face was radiant as she bowed to the right and left. Not since last inauguration day has Pennsylvania avenue held such a crowd as lined.it from the station to the White House. Heavy cables, stretched the whole length on both sides, kept the crowds on the sidewalks. Street cars were stopped and vehicles were halted in thé side streets as the party came up the avenue. From every flagpole and from many windows flags were flapping in the cool evening breeze. A brilliant scene greeted the Presi dents eye as he reached the White House. The mansion was illuminated from basement to attic, bathing the whole white structure in a soft, radiant glow. As the President reached the White House gate he stopped his carriage, and, lifting his hat to the crowd, said  Good night, good luck and thank you so much for all this."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "of the Navy Mr. <mark>Palmer</mark>, the marshal for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "of the Navy Mr. <mark>Palmer</mark>, the marshal for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [517.16, 370.63, 682.9, 1081.42], "bbox_id": "e9c5d162cc", "file": "AppomattoxNewspapers_1902-1905a_0589.pdf", "page": 1, "text": "Washington, D. C. Special.Thou sands of his fellow-citizens turned out to welcome President Roosevelt to the national capital, and made his home- coming an occasion for an ovation from the time he was sighted on the plat form of his car until he passed within the doors of the White House. There was no band of music, but the sweeter melody, of the cheers of the assembled people made the air ring with hurrahs as his carriage passed slowly up the avenue. It was awfully kind of them to come out to greet me, the President remarked to some friends at the White House por- tccochere, and I was deeply, deeply touched by their welcome. The presidential train came into the station at 619 oclock. On the platform were assembled a dozen or more officials. At their head was Mr. West, the Dis trict Commissioner, who was in charge of the arrangements for the welcome, and, who was the first to shake the Pres idents hand as he stepped from the train. With the President were his sec retary of state, Mr. Root, and Mrs. Root, and the secretary of the treasury, Mr. Shaw. At the station were Secretary Hitchcock, Postmaster General Cortelyou, Mr. Quesada, the Cuban minister Dr. Rixey, the surgeon general of the Navy Mr. Palmer, the marshal for the Dis trict of Columbia, and others. A mighty cheer went up as the crowd inside the depot caught sight of the President, which was taken up by the crowds outside of the station and passed along the line as the President was recognized. He shook hands first with the Cabinet members and other officials. Then, giving Mrs. Roosevelt his arm, he walked slowly to his carriage, which was waiting at the Sixth street entrance. As he reached the engine the President thanked the engineer for his safe trip and stopped to shake his hand. In the car riage with the President were Mrs. Roosevelt, Ethel, Kermit and Quentin. Quentin sat on the box with the coach man. The cabinet officers and the other mem bers of the party followed in carriages, accompanying the President to the White House. The President frequently arose and bowed to the cheering crowds on both sides of the Avenue, and, during the latter part of the drive, the hur rahs became so enthusiastic that the President stood most of the time. Mrs. Roosevelt was greatly pleased with the greeting, and her face was radiant as she bowed to the right and left. Not since last inauguration day has Pennsylvania avenue held such a crowd as lined.it from the station to the White House. Heavy cables, stretched the whole length on both sides, kept the crowds on the sidewalks. Street cars were stopped and vehicles were halted in the side streets as the party came up the avenue. From every flagpole and from many windows flags were flapping in the cool evening breeze. A brilliant scene greeted the Presi dents eye as he reached the White House. The mansion was illuminated from basement to attic, bathing the whole white structure in a soft, radiant glow. As the President reached the White House gate he stopped his carriage, and, lifting his hat to the crowd, said Good night, good luck and thank you so much for all this."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "of the Navy Mr. <mark>Palmer</mark>, the marshal for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "of the Navy Mr. <mark>Palmer</mark>, the marshal for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [628.5, 417.88, 789.56, 956.33], "bbox_id": "4c7a1101c8", "file": "AppomattoxNewspapers_1912-1915a_0206.pdf", "page": 1, "text": "Washington, D. C. Representative Francis Burton Harrison, of New York, was nominated to be Governor-General of the Philippines to succeed W. Cameron Forbes. .Mr. Harrison is oqe of the leading members of the Ways and Means Com mittee and a stanch A dm inistration supporter in the House. His appointment was strongly urged by Majority Leader Underwood and Caucus Chairman A. Mitchel! Palmer. It was also welcomed by the advo cates In Congress of the immediate independence of the islands. Mr. Har rison, in the past, has been outspoken in bis championship of independence for the Filipino people. The retirement of Mr. Harrison from the House assures the election of Mr. Palmer to the chairmanship of the Ways and Means Committee and therefore to the majority leadership, should Representative Underwood be elected tq the Senate from Alabama. As Governor-General of the Philip pines, Mr. Harrison will receive a salary of 15,000 a year aud an addi tional sum of 5,000 a year as presi dent. of the Philippine Commission. This is more money than is paid to any official of tiie Government with the exception of the President. Am bassadors receive 17,500 a year, Cabinet members 12.000 and Minis ters to foreign governments, 10.000 a year. The Governor of the Panama Canal Zone receives 14.000 a year. Mr. Harrison is perhaps the wealthiest member of the House and tne salary feature of the new job had no weight with him. He accepted the appointment, he told friends, because he believ-d there was much important work to be done in the islands. He wants to reorganize the whole Philip pine Government and prepare the peo ple of that Oriental archipelago for self-government as soon as it is pos sible. The declarations in the Baltimore platform in favor of Philippine inde pendence, the views of the President upon this question and the declared position of Mr. Harrison upon it lead to the belief that the Philippines will at least be given an opportunity of home rule before this Administration is ended."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Caucus Chairman A. Mitchel! <mark>Palmer</mark>. It was also welcomed"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Caucus Chairman A. Mitchel! <mark>Palmer</mark>. It was also welcomed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1159.66, 402.07, 1321.53, 933.56], "bbox_id": "48e0b260b8", "file": "AppomattoxNewspapers_1915-1918a_0430.pdf", "page": 1, "text": "Washington.  The new War In dustries Board held its first conference with President Wilson Monday and took up in general the problems it must face in the purchase of war sup plies for this government and the Allies. The President indicated his idea of the boards functions. , One of the points decided was that the Allies of the United States should be given the same advantages in the purchases of war materials as this country enjoys. Members of the board are Frank Scott, Bernard M. Baruch, Hugh Frayne, Robert S. Brookings, L. S. Lovett, Lieutenant Colonel Palmer E. Pierce and Rear Admiral Frank F. Fletcher. Secretary Daniels also at tended the conference. , J The question of co-ordinating Ameri can and allied purchases will be one of the first to be taken up by the board. Allied purchases soon will be made by Bernard Baruch, who is to be designated by the allied governments as their buying commissioner. At the same time he will be chairman of a purchasing commission for the Ameri can government to be formed of mem- bers of the War Board, with Herbert  Hoover as a member in charge of food purchases. Officials believe that ultimately a j system may be evolved under which one man will do all the Atnerican and allied buying, members of the War Board serving as advisers. Legisla tion would be required, however, be fore the government departments could delegate purchases to any person out side of their organizations. For the present American purchases will be negotiated by the buying com mission, but contracts for the Army and Navy will be signed by their rep resentatives on the War Board. Ship ping Board purchases probably will be made by the buying commission itself, as there Is no legal obstacle. The board faces a considerable problem in obtainingsupplies for the Allies at the same price paid by the American government. Already the proposal has brought protests from manufacturers and producers who have agreed to sell to this government at prices lower than.the market."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "S. Lovett, Lieutenant Colonel <mark>Palmer</mark> E. Pierce and Rear"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "S. Lovett, Lieutenant Colonel <mark>Palmer</mark> E. Pierce and Rear"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1916.41, 417.72, 2077.43, 1168.37], "bbox_id": "b36ca5260e", "file": "AppomattoxNewspapers_1947-1949a_0170.pdf", "page": 1, "text": "WASHINGTON.  In the hope of learning more about the mysterious region of multi-colored lakes sighted from the air in Antarctica last year, the United States navy has started a special expedition to the area. The first of two ships chosen for the taskthe icebreaker Edisto  sailed receitly from Norfolk, Va. A second iceineaker, the Burton Is land, saileefrom San Pedro, Calif. Each vesseig to carry a helicopter, to permit nyy fliers to land hi the lake region,among the gravel hills that precluq a landing by a con ventional aiplane. Comdr. Grald L. Ketchum was designated t head the expedition, it was learnf. The two icebreakers will rendezvqg at sea, it was indi cated, and loceed directly to the Antarctic iceiack. Operie in Summer. The plan ohxploration adopted is for the two iibreakers to drive as near to the oast as possible and launch their llicopters. Although it will be wintefn the northern hemi sphere, the eedition will have the advantage oftperating during the Antarctic sumer. Personnel will live aboard th Edisto and the Bur ton Island, adding the difficulties of setting up base ashore, as was done by last jxrs larger navy ex pedition. Plans for a tit to Little America were tentative but it was under stood that su a visit might be made. In addon, It was learned that the expedim might attempt to force the ice brier at other points where explorah has been slight, provided time mains after it has accomplished i primary mission of studying theike area. A primary nrtery surrounding this region is w the lakes do not freeze, surround as they are by glaciers and pertual snow. Among the theories adveed to account for the temperaturis one that the earth is warmeoy volcanic activ ity. Climatelianging. Another theory that the climate is becoming mile. This theory will be checked, it w understood, even though there istle evidence to support it in thejrrounding frigid wastes of the arctic, because such a change, it progress, would have portentous iteorological im plications. Commander Khum was cap tain of the Burtoaland during the last expedition, small group of civilian scientist whose names have not been ire public, is ac companying him the present un dertaking. Members of ttl946 expedition described the It area as an oasis because ds isolated posi tion. The region inland from the Knox coast of thintarctic conti nent, almost due Ah of Australia. Another navy edition, headed by Comdr. Finn nne, is in the Antarctic, opera on Palmer peninsula."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "the Antarctic, opera on <mark>Palmer</mark> peninsula."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "the Antarctic, opera on <mark>Palmer</mark> peninsula."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [513.57, 1217.25, 837.29, 1251.45], "bbox_id": "9ce0831949", "file": "AppomattoxNewspapers_1905-1912a_0476.pdf", "page": 1, "text": "was spectacular, and the mamilflr-enT f   jAlbia banker. as he prepared to bunding went down in half an hoUr  Detrolt witb on. Palmer The 53 monks sought shelter in the 1 q L Daf ? ir ia custorY United new monastery near! . Statea M arshal Milo M."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "hoUr  Detrolt witb on. <mark>Palmer</mark> The 53 monks sought"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "hoUr  Detrolt witb on. <mark>Palmer</mark> The 53 monks sought"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [654.92, 1473.04, 815.94, 1604.74], "bbox_id": "7d6a56faaa", "file": "AppomattoxNewspapers_1905-1912a_0505.pdf", "page": 1, "text": "Wants a Revenue Board. Washington.The purpose of the majority of the House Ways and Means Committee to abolish the Tariff Board and substitute for it another kind of a commission was manifested by the introduction of a Wll for a reve nue board by Representative A. Mitchell Palmer, of Pennsylvania. Mr. Palmers bill is the second of the kind, another having been introduced by Representative Peters, of Massachu setts, providing for a board of statistical experts."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "by Representative A. Mitchell <mark>Palmer</mark>, of Pennsylvania. Mr. Palmers"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "by Representative A. Mitchell <mark>Palmer</mark>, of Pennsylvania. Mr. Palmers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1534.3, 255.71, 1689.45, 402.79], "bbox_id": "7d3888da9c", "file": "AppomattoxNewspapers_1915-1918a_0302.pdf", "page": 1, "text": "Wanted  Several customers for milk. A. B Harwood. Mrs. Jeter Palmer, of Nor folk, V., is visiting her mother Mrs. J. R. Atwood, here. Mr. and Mrs. Einstein, of Richmond, are guests of Mrs R. Atwood. Mr. Willis Inge is olerking at the Drug store, and Mr. Her bert Pulliam is with Mr. 8. L. Ferguson again."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "B Harwood. Mrs. Jeter <mark>Palmer</mark>, of Nor folk, V.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "B Harwood. Mrs. Jeter <mark>Palmer</mark>, of Nor folk, V.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [539.74, 326.77, 2231.1, 617.85], "bbox_id": "43ac97a052", "file": "AppomattoxNewspapers_1960-1962b_0290.pdf", "page": 1, "text": "Walter D. Chernault Palmer beat Sanders in goal play- No business enterprise grows un- 0f f at phoenix, s it is pushed by somebody., with fins and energy- announc- month. He was born in Appomattox County Feb. 26, 1916, sln of Mrs, Janie Co-lman Ohernauit and the late Jesse J. Chernault. He was a member of New Hope Baptist Church Surviving in addition to his mother are five brothers, Russell A. Cher- r.ault, Henry T. Chernault, James Chernault, Clark Chernault, all of Appomattox, Robert H. Chernault of Arlington, seven sisters, Mr 8 . E. .0. Blackwell of Appomattox, Mr. C eorge Craddock of Norfolk, Mrs. ICurtis W. McCormick and Mrs. IFichard Burge of Lynchburg, Mrs. Pendell McMjnn of  Brockway, Pa.  lrs. Hugli Bailey of Darlington Ieights and Mrs. Lindy Hamlett of  armville. Funeral services will be 1 csnducted in New Hc-pe Baptist p.m. today with burial h cemetery. Robinson e in Appomattox is in"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Walter D. Chernault <mark>Palmer</mark> beat Sanders in goal"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Walter D. Chernault <mark>Palmer</mark> beat Sanders in goal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1283.05, 333.81, 1423.17, 1382.02], "bbox_id": "b176580f44", "file": "AppomattoxNewspapers_1902-1905a_0272.pdf", "page": 1, "text": "w Y  In the Reformed Igass comforter on Sunday morn- karri, Ltb r L Palmer preached a  S   S s e entitled Whv he Lbrif W r and the Ungodly Pros- S e WS? S hia text from Psalm 73. 3.  iT n v io u s at the arrogant, when or I?crity of the wicked.  tySw-rtird Psalm was probably The who was a pious Jew, the leaders of the temple  phraseology and contents n- t he was intelligent and spiritual, the course of his rehgioup ex- fcdth Sis exposed to the ravage of WM eir _ _ MAtuiui itphnffni F However, upon mature delibera- p_Mi, K was overcome, and he be- HíLíngin th i rtienlar ron!.nu?e problem that confused  .  1 . CC n  nn1 f nfl phe P  W re righteous suffer and .the  Bwswh to  hy the most viciquB enjoy material prosperity r  .irated disciples be subjected to B w If God is perfectly righteous m and supremely just in all His  -fTmen whv does He allow the A y succeed and the believer to does He not obliterate every j reserve every siint. permit the godly to pass through - rtte SLn and raffing seas of affliction. kLdmany of tie Cbristless so free fly  misery? These are questions K T b e n fresh in the mind of every and the only satisfactory an- jflfthe one that suffioed the psalmist. iSetedertaking to develop so impor- I . imbiect it is necessary that we di-  minds of one possible misconcep-  fiSplicatonof the text is not F  w i c k e d prosper, and that all R S S , w ifflittf It is not that itte uny prosper because they are JX or that all believers are afflicted they are believers. It is not true Sun the wrldly enjoy success, and all .hteous are discontented, unhappy ft  S u l The psalmist was in a E i S  mood ct the time of writing, EfXibes  condition from which he H X S y extricated. It is true that tine godless inen and women seem to be Lnn, and prosperous, and that some de- disciples are greatly afflicted. But Fi, far from the natural deduction of notureaud experience that all the godly unsuccessful and the wicked prosper-  though we do acknowledge that the keient sentiment of the text is not with-  its modern application. We still won- Lr why the unrighteous prosper and the Uly are afflicted. why THE UNGODLY ENJOY TEM PORAL PROSPERITY, i We cannot deny that many worldly peo- le have an abundance of life s blessings, Td that they appear to be quite free from Evereity. It is well known that many ot most wealthy people seem to be indif- Cent to religion. They spend their time Ed means either in business or seeking Ensure. Our contention is that human icces8 or failure is not an infallible criter ia by which we are to justify or condemn. fcegovernment of God. fit is not uncommon for godless people to Merit property. Nor is it uriusual for un- aieving parents to leave an inheritance  heir children. That while there has eea utter indifference to Christianity has been no want of concern ift the _.jnulation of wealth. And many pos- Css a disinterested temperament that pro-, jects them from needless care and anxiety. Unbelievers are often more shrewd than Kristians. The children of this world, te wiser in their generation than the chil- ren of light. A life of utter absorption _i the accumulation and management of honey develops an acumen, one who read- Dy discovers whatever will contribute to lis personal and temporal advancement, ad since we are free moral agents it is ossible for one to succeed in the direction If his ambition. I Unbelievers are often less scrupulous, fhey will do many things for temporal nmfort that others will not. A godless mortal will keep a saloon or a gambling Hen, from which the profits are very large, pe will desecrate the Sabbath or violate lay of the divine laws without hesitation long as his personal interest is encour- ged. His moito is eat, drink and be fery, for to-morrow we die. Would a kbom soul and heir of the kingdom do Jjtt same? A true disciple of the Great Heicher would not consciously transgress Iny civil or religious requirement, even if y such a violation he would increase his pans and comfort. pie attention of unbelievers is more FMentrated on the accumulation of with and on personal comfort. It is wot all many think of. They think about ijney when they retire. They dream pot it at night. It is upon their minds P the.v awake in the morning, and they Mbor for it during the day. It is the onlv Hears thev have, and it is not strange than y should obtain it. Lktians are unwilling to deprive them- Mves of the comfort and blessing of giv- a iHhes are supported by the WMjffiea followers of Christ. All the phi- Ptnropic and charitable organizations are PKely sustained by those who bear the jMstian name. The church has great rea- Ito thank God for those who give so  S  toward her support, while the Ei 18 ether hoarding or wasting its  W a r e applying their gifts to the intellectual, moral and eternal im- rovement of others. U .011?,suffering of God is not to be  j Permts ungodly people to .desr of eir hearts. The onysius, the younger, a 1 Tpmnio CIc vken after haying robbed fcvnmi!le.iii?iZacu,se he had a prosper- US vmi .the plunder is well known. ttjA  t. esd he, to those who were lira, how the gods favor the sacrileg-  .interpretation of the incident 1 . . the standpoint of a heathen, DM ammL . . k v,uw KJL  UCC Í DonhttiL Permitted him to escape. Ä th? US are allow,ed to wt order to test and prove the  is a test for the faithful but"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "karri, Ltb r L <mark>Palmer</mark> preached a  S   S"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "karri, Ltb r L <mark>Palmer</mark> preached a  S   S"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.58, 1635.86, 1653.98, 1727.01], "bbox_id": "f4631d0b15", "file": "AppomattoxNewspapers_1939-1943a_0130.pdf", "page": 1, "text": "W. Palmer and dir- shmore, Frank Ba- Barksdale and H. , the Farmville Pro- Assocdation attend- ten meeting along ves of four other Blacksburg on July SecretaryTreasurer Jr. also attended"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "W. <mark>Palmer</mark> and dir- shmore, Frank Ba- Barksdale and H. , the Farmville Pro- Assocdation attend- ten meeting along ves of four other Blacksburg on July SecretaryTreasurer Jr. also attended"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "W. <mark>Palmer</mark> and dir- shmore, Frank Ba- Barksdale and H. , the Farmville Pro- Assocdation attend- ten meeting along ves of four other Blacksburg on July SecretaryTreasurer Jr. also attended"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [721.9, 1207.51, 874.42, 1248.95], "bbox_id": "42fbf1f696", "file": "AppomattoxNewspapers_1892-1898a_0403.pdf", "page": 1, "text": "W. It. PALMER, WATenLOO, IOWA. Saved From the Horror of Nervoue Pro, trat!on by Òr. Milet Nervine."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. It. <mark>PALMER</mark>, WATenLOO, IOWA. Saved From the Horror of Nervoue Pro, trat!on by Òr. Milet Nervine."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. It. <mark>PALMER</mark>, WATenLOO, IOWA. Saved From the Horror of Nervoue Pro, trat!on by Òr. Milet Nervine."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [402.23, 338.17, 717.68, 463.9], "bbox_id": "f5a4525138", "file": "AppomattoxNewspapers_1926-1933a_0392.pdf", "page": 1, "text": "W ill Be Placed in Station and on Corners. New Vork.Capt. C. W. R. Knight of England recently demonstrated ms trained golden eagle before an audi ence of about 20 bird enthusiasts on the estate of George Palmer Putnam on Long Island sound. Mr. Putnam explained that the flight was merely to give the bird exercise and that the bird enthusiasts, some of whom were members of the Explorers club, had been given permission to view the"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "the estate of George <mark>Palmer</mark> Putnam on Long Island"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "the estate of George <mark>Palmer</mark> Putnam on Long Island"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [713.58, 1191.88, 864.87, 1236.98], "bbox_id": "fa5c1084b7", "file": "AppomattoxNewspapers_1892-1898a_0522.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA. Saved From the Horror of Nerv oue Proa trat ion by Or. Milet Nervino,"}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. Saved From the Horror of Nerv oue Proa trat ion by Or. Milet Nervino,"}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. Saved From the Horror of Nerv oue Proa trat ion by Or. Milet Nervino,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [832.29, 1256.8, 984.02, 1296.82], "bbox_id": "3342fc8ba7", "file": "AppomattoxNewspapers_1898-1902a_0012.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA. Saved From the Horror o f Norvous Pros- tration by Dr. M ils Nervine."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. Saved From the Horror o f Norvous Pros- tration by Dr. M ils Nervine."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. Saved From the Horror o f Norvous Pros- tration by Dr. M ils Nervine."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [731.28, 470.13, 885.45, 511.52], "bbox_id": "7734bba7b7", "file": "AppomattoxNewspapers_1892-1898a_0467.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA. M8aved From the Horrors of Nervous Pros tration by Dr. Miles Nervine."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. M8aved From the Horrors of Nervous Pros tration by Dr. Miles Nervine."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. M8aved From the Horrors of Nervous Pros tration by Dr. Miles Nervine."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.01, 1214.66, 880.79, 1254.86], "bbox_id": "086d0685e2", "file": "AppomattoxNewspapers_1892-1898a_0404.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA. aeved From the Horrors of Nervous Pros trotion by Dr. Milss Nervine."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. aeved From the Horrors of Nervous Pros trotion by Dr. Milss Nervine."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. aeved From the Horrors of Nervous Pros trotion by Dr. Milss Nervine."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.51, 379.48, 825.2, 418.88], "bbox_id": "d56f490dee", "file": "AppomattoxNewspapers_1892-1898a_0431.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA. 8avod From the Horror o f Nervous Pros tration by Dr. Mile Nervine."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. 8avod From the Horror o f Nervous Pros tration by Dr. Mile Nervine."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA. 8avod From the Horror o f Nervous Pros tration by Dr. Mile Nervine."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [987.11, 1164.42, 1104.46, 1189.58], "bbox_id": "5836e50e6c", "file": "AppomattoxNewspapers_1898-1902a_0038.pdf", "page": 1, "text": "W. H. PALMER, WATERLOO, IOWA."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W. H. <mark>PALMER</mark>, WATERLOO, IOWA."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [339.57, 1532.45, 639.56, 1708.9], "bbox_id": "292755ac29", "file": "AppomattoxNewspapers_1892-1898a_0096.pdf", "page": 1, "text": "w 8 same do Life. w 7 Morris Sophia Morris W illis dd F . 8. nlO do do 50 Sycamore creek n w 15 Neighbors Jennie do do 25 do nw 15 same do do Ilk Pt- Wilkeraon estate nwlO Palmer A lice W. do do 170 Jam es river w l7 Poore Sarah do Life. 42 W altons Fork nw 10 Patteson Camm trustee for wife and children do Trust. 187k North river nw 4 Patteson Camm, trustee do do 332k P t. Selma n w l7 Patteson Camm, trustee do F. 8. 187k North river nw 4 Reynolds Seymour S do do 67 Adj. Wm. A. Crews nw 9 Rogers John Thornton do do 474 w est Slate river w 10 Ross Lucy do do 10 P t. Travellers Best n w 16 Budsberry David Stinson Elizabeth do do 110 Ripleys creek 211 Merediths creek nw 8 do do nw 9 Saunders Peter and Charles Coleman do do 81 W altons Fork nw 10 Scott Lncv A. do do 2 R ipleys creek w 8 Thomas v ash do do 71 W altons Fork nw 9 Thomas Eli P. do do 11 Sycamore creek n w 13 Wright Thomas W. do do 43k w est Slate river  w 12 W illiams R. N, Nathaniel and do do 237 near Liberty Church n l2 W alter Wood Wm. M. estate do do 183 Sycamore creek nw 15 Wayne Emanuel Wright Reuben do do 42 do to  nw 15 do do 10 Warminster road nw 8 Young Austin do do 25 Glennmore road nw 10"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Pt- Wilkeraon estate nwlO <mark>Palmer</mark> A lice W. do"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Pt- Wilkeraon estate nwlO <mark>Palmer</mark> A lice W. do"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [682.55, 1008.96, 836.82, 1052.76], "bbox_id": "cc85638c9c", "file": "AppomattoxNewspapers_1892-1898a_0442.pdf", "page": 1, "text": "W . H. PALMER, WATERLOO, IOWA Saved From tho Horrors of Nervous Proa tration by Or. Milos Nortino."}, "highlight": {"text": {"matched_tokens": ["PALMER"], "snippet": "W . H. <mark>PALMER</mark>, WATERLOO, IOWA Saved From tho Horrors of Nervous Proa tration by Or. Milos Nortino."}}, "highlights": [{"field": "text", "matched_tokens": ["PALMER"], "snippet": "W . H. <mark>PALMER</mark>, WATERLOO, IOWA Saved From tho Horrors of Nervous Proa tration by Or. Milos Nortino."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [630.48, 398.92, 796.38, 486.92], "bbox_id": "1131152a24", "file": "AppomattoxNewspapers_1955-1957a_0410.pdf", "page": 1, "text": "Visiting Hal Moore on Sunday were Mr and Mrs. R. B. Martin, Mis. O. W. Martin, Mr. and Mrs. Hubbard Moore, Hunter and Palmer Moore, Mr. and Mrs. Beverly Mar tin, Mr. and Mm. David Martin and Pam, Mrs. E. B. Martin, Mr. and Mis. Louis Moore and Faye, and Mr. and Mrs. Race Moore."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Hubbard Moore, Hunter and <mark>Palmer</mark> Moore, Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Hubbard Moore, Hunter and <mark>Palmer</mark> Moore, Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [855.58, 1167.42, 1021.53, 1462.76], "bbox_id": "920e4044e9", "file": "AppomattoxNewspapers_1922-1923a_0378.pdf", "page": 1, "text": "Views of a Globe Girdler. Charles J. Glidden, the globe gird ling automobilist, wrote to some Boston friends as follows concerning his impressions of the first part of his Journey from Boston to Mexico by road and railroad tracks Six years ago I drove over the road from Bos ton to New York, and considerable Improvement was noticed on this trip hut on the average the road can be considered only fair, in comparison with the good roads around Boston and the excellent roads of France Closed roads necessitated detours in Connecticut, increasing the distance twenty miles, and the roads we were obliged to take were wretched. The trouble and expense we have been put to in arranging for our permits and numbers for New Jersey, Pennsyl- vania and Maryland give the impres sion that we are not in a united coun try, but driving through small coun tries in Europe. Special numbers, 1 am informed, are not required in other States. Motoring can be made ideal between New York and Boston by improving the roads in Connecti cut and Massachusetts east of Palmer and south of Springfield to the State line.New York Sun."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "and Massachusetts east of <mark>Palmer</mark> and south of Springfield"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "and Massachusetts east of <mark>Palmer</mark> and south of Springfield"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.1, 1441.43, 1764.31, 1510.43], "bbox_id": "dbf46a41a2", "file": "AppomattoxNewspapers_1962-1965a_0329.pdf", "page": 1, "text": "vices. cesenit for the first part of meeting was C. A. Palmer. dent entgineer, and J . H. Phil- , DiStlict engineer fSi r the e H i i! ll w a y Deitartment. V du5CUissed with cc Urnen"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "meeting was C. A. <mark>Palmer</mark>. dent entgineer, and J"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "meeting was C. A. <mark>Palmer</mark>. dent entgineer, and J"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [693.13, 526.76, 865.9, 734.5], "bbox_id": "6f0798713d", "file": "AppomattoxNewspapers_1955-1957a_0030.pdf", "page": 1, "text": "Vassette Harris, of have lovely home Lynchburg, Va. Mr. Howard Stevens is spending some time here with his mother, Mrs. Lucy Stevens and family. Miss Sarah Watkins, of Virginia State College spent the hoilday withj her sisters and brother. Mr. and Mrs. Charlie Palmer and Miss Nellie Thornton spent the holi day in Baltimore. Miss Lillie Mae Lewis and Miss I Novella Hicks, of St. Paul spent the holiday here with their parents.  Mr. and Mrs. Lindsey Marshall and daughter spent the holiday in I Baltimore. iCurtis Marshall, of Baltimore, spent the week-end here with rela-"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Mr. and Mrs. Charlie <mark>Palmer</mark> and Miss Nellie Thornton"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Mr. and Mrs. Charlie <mark>Palmer</mark> and Miss Nellie Thornton"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1625.03, 375.51, 1797.54, 1179.35], "bbox_id": "15af3493a3", "file": "AppomattoxNewspapers_1892-1898a_0336.pdf", "page": 1, "text": "uois, were In turn called to the stage, and stirred the enthusiasm to A high pitch When the platform Was At last brought ih, shortly before  oclock, after tbe couventiou bad been in session three hours-. It was read amid aa almost continuous storm of ap plause, And was adopted unanimously with out a Word of debate. When the nominations for President were called for, it was apparent that Palmer Would be nominated over hto protest, as the opposition to Bragg had concentrated upon birth These two names wero tbe only ones pre sented to the convention. It was known that 11 message from President Cleveland had reached tho convention that ho could not en tertain for a moment the suggestion of bis cwn nomination, and bis decision was at once accept d as final, Before tho states wofe called for nominations, Henry Watter- son was taken out of the lists by Mr. Carroll, of Louisville, wbo, from tho platform, con veyed to tbe convention a message from the Kentucky editor In his retreat in the moun tains of Switzerland. Mr. Watorson, Mr, Carroll said, three days after the Chicago convention had cabled that other candidates must bo named or the Democracy was lost. Later he had Bald he Jld not want tbe honor, bat that if no one ilse could be found to take command, ho would not UBk others to go where be Would not lead. Now that others were ready to accept, he preferred to do bnttlo In the ranks Some of the nominating speeches wore eloquent and full of fire. L . L . Kllbourn, of Michigan, placed Senator Palmer in nomina tion and there was a scries of seconding speeches. Burr W. Jones, of Wisconsin, aoair oted General Bragg,  the hero of 0 battles and the commander of tho Iron Brigade. Illinois waited untill all the other states had been called. Then Judge Morno, of Chicago, took the stage and said they had lecegnizod from the first that Senator Pal mer wns tbe man to lead the fight. He was, Qe said, a platform in himBelf. All hto life he had fought fialism, greenbacktom, free diver and other vagaries. But he had aealod nelr lips. After securing the temper of tbe tonVentlon, however, he said Illinois was compelled to join bauds with her sister states n urging hto nomination. The roll call immediately developed an verwbelmlug majority in favor of Senator Palmer, but It proceeded to tbe end, lalmef ecelvlng 757X votes and Bragg 124. - At is conclusion the commander of the -rob Brigade mounted a chair and, in A brief but graceful speech, moved that the nomina tion be made unanimous, nnd pledged that bo and Wisconsin in the coming battle would be where brake soldiers should always be icarest the flashing of the guns. He was given three hearty cheers, and General Pal mer was declared the nominee amid an ehthusinstlcdemonstration, during which the sste guidons were carried about tbo hall in the wake of the standard of Illinois. Thero never wns any doubt about General Buckners nomination for Vice-President,  ixccpt while the nomination was being talked of for Sonaor Palmer for President. When Chairman Caffrey Instructed tbe secretary to call the Slates for nomination for Vice-President, tho latter called but one 8a,  Kentucky, and tbe band struck up My Old Kentucky Home. William F. Brodder, of Bussellvtlle, Ky., placed General Buckners name formerly in nomination and the nomination was forthwith made unanimous. After the convention had adjourned Senator Pal mer sucoumbod. He said he would ac cept. He had never yet failed to respond to the call ct duty, he said, and he oouldnot do so now with such a cause at stake."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "it was apparent that <mark>Palmer</mark> Would be nominated over"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "it was apparent that <mark>Palmer</mark> Would be nominated over"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.92, 299.42, 1651.39, 339.72], "bbox_id": "3bdaab8e29", "file": "AppomattoxNewspapers_1905-1912a_0483.pdf", "page": 1, "text": "uionta inserted under ttaUilead at I j Palmer, of W eflt Poin, f ONE CENT per word each week. . . , iNTS per word tor one month. Our 118 v ttltin g th e MlMfcB AtWOOO. _ invitnd to make their wnuts I _ to - -----------  Mrs. Ida Farrsr, of T iggle, wsb Oath m u t accompany all"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "ttaUilead at I j <mark>Palmer</mark>, of W eflt Poin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "ttaUilead at I j <mark>Palmer</mark>, of W eflt Poin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [434.33, 543.51, 570.81, 1159.5], "bbox_id": "3a7d6611e7", "file": "AppomattoxNewspapers_1918-1922a_0317.pdf", "page": 1, "text": "ttshington.Proceedings asking Bainbridge Colby, secretary of be enjoined from issuing any Iniiiation declaring the suffrage dment ratified, were -Instituted District of Columbia Supreme by Charles S. Fairchield, of iVorlc, president of the Ameri- ponstitutional League.  Fai Kill Id also seeks ito prevent icy General Palmer from en- IK the amendment. Justice issued a rule on Secretary Col id the Attorney General to Show jjuly 13 why the motion should granted.  basis of the proceedings is the j.that the ratification of the fnient by the West Virginia Bture was illegal because ac- fished by fraud and that the ed ratificaitfcn toy the Tennessee bture also would be illegal on Bound that the legislature lacked pty under the states constitu- act on the measure.  35 states have ratified the Iment, and as ratification by Kier is necessary the attack on jiendments through the courts time came as a surprise in ie circles here. An attack on lality of the action of the Ten- legislature had been expected, until the legislature actually Iteri. aticlpation of such a move by i-suffrage forces, the organiza- Jpporting the amendment have karly action by more than 36 po that the amendment could operative in time to permit nen to vote in the.presiden- ption this year. pcation for the restraining or- said by the National Worn- rty, in a statement, to indi i bitterness of the opposition page and the determination opponents to defeat the ob lìi of states which have signi- r approval of the enfranchise- Ithe women of-the nation. fare convinced that, as In the ferendura case, said the  Party statement, the of the action of the various isiatures in ratifying the suf- oendment will finally be up- jthe courts. Anti-suffraglsts gently grasping at straws in lempt through court proceed- flengthen the suffrage etrug- Ito force the expenditure of Iney and time by suffragists feuccess of their cause."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "ito prevent icy General <mark>Palmer</mark> from en- IK the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "ito prevent icy General <mark>Palmer</mark> from en- IK the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [903.83, 665.27, 1074.15, 1166.15], "bbox_id": "00d378faff", "file": "AppomattoxNewspapers_1905-1912a_0440.pdf", "page": 1, "text": "Trenton, N. J.The governments j  long-planned suit to break up the so- j called Steel Trust was begun here  Thursday in the United States Circuit  I Court. It is the most sweeping anti- !  trust action ever brought by the De- I i pariment of Justice. The government asks not only for the dissolution of the United States j ! Steel Corporation, but for the dlssolu- j tion of all constituent or subsidiary companies which axe alleged to have I combined in violation a l the Sherman law to maintain, or attempt to main-  tain a monopoly of the steel business. j There axe 36 subsidiary corporations j named as defendants. J. Pienoont Morgan, John D. Rocke- j j feller, Andrew Carnegie, Charles M.  Schwab. George W, Perkins, E. H. I j Gary. John D. Rockefeller, Jr.. Henry j  C. Frick, Charles Steele, James Gay- j i ley, William H Moore, J. H. Moore, Edmund C. Converse, Pereira! Rob- j I erts, Jr., Daniel G. Reid, Norman B. j I Ream, P. A. B. Widener and William I ! P. Palmer are named individually as 1  defendants. Sensational Charges. The steel corporations lease of the j j Great Northern Railways ore proper-  I ties which the directors of the steel j I company Thursday formally decided j j to cancel is alleged to be illegal. This j j action of the directors was taken but I a few hours before the filing of the j I bill. The government acknowledges I that it was advised of the steel cor-  j porations intention in this respect, j I but states that under the terms of the j  lease no cancellation would be effec-  tive until January 1, 1915, and there I is no limit upon the amount of ore j that can be taken out in the meantime. I Sensational allegations fairly topple i over each other in the governments J  petition, which is an equity proceed-! I ing praying for injunctions to estop ! continuance of the alleged monopoly and such other relief as the court may grant. The steel corporations acqui sition of the Tennessee Coal and Iron I Company during the panic of 1968 is declared illegal and scathingly criti cised."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "and William I ! P. <mark>Palmer</mark> are named individually as"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "and William I ! P. <mark>Palmer</mark> are named individually as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.65, 433.56, 1654.13, 744.16], "bbox_id": "86926e0285", "file": "AppomattoxNewspapers_1918-1922a_0538.pdf", "page": 1, "text": "training camps at home. It Is that efficient mobilization of the nations fighting strength can be carried out only as a decentralized process through agencies set up in times of peace. Realization that these lessons must be worked Into the new military policy, If perilous delay and costly confusion which preceded past mobilizations were to he avoided, has marked the effort of the War department. The bulletin shows it has attempted to write regulations under the revised natlonnl defense act that would fur nish a clean-cut scheme for war mobilization without violating nntlonal traditions against militarism or creat ing machinery that would Impose heavy burdens In peace times upon the taxpayers. The project undertaken probably Is the most far-reaching mllitnry effort the nation has ever attempted in peace times. Col. John Palmer, assigned to aid congress In framing the legislation, has devoted himself to a stmly of the subject. His work now Is to go to nil parts of the new army and ex plain the workings of the new plan. Cleverest Men in Congress in Gallery"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "peace times. Col. John <mark>Palmer</mark>, assigned to aid congress"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "peace times. Col. John <mark>Palmer</mark>, assigned to aid congress"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2200.09, 256.33, 2371.54, 412.23], "bbox_id": "07fa7a924a", "file": "AppomattoxNewspapers_1960-1962b_0557.pdf", "page": 1, "text": "took their son, Ronnie, to seo a dodtlor at Appomattox Saturday night. 4  Rocks was xtepreeented at the annual W j MU. Meeting at Gullen Thursday. Phillip Inge spent! Sunday with Jimmie Ramson. Mrs. Mary Inge spent Sunday with MrsL Rosa Marks, Miss B ar bara Sims and Mr. and Mrs. Ed ward Rahson. Mrs. Nancy Palmer glaive a dem onstration party in the hernia of Mr. and Mra. Walter Williams bn"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "ward Rahson. Mrs. Nancy <mark>Palmer</mark> glaive a dem onstration"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "ward Rahson. Mrs. Nancy <mark>Palmer</mark> glaive a dem onstration"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [700.09, 370.81, 871.87, 1939.75], "bbox_id": "17666728c7", "file": "AppomattoxNewspapers_1898-1902a_0251.pdf", "page": 1, "text": "Tom Myers, the confidence man and forg er, died in the woods near Waukegan, III., from exposhre, and was burled there by tbe three other prisoners who had escaped from prison with him. Oscar T. Hines, accused of shooting George Vaughan in Richmond, Va., was re leased on habeas corpus proceedings. The Fof ty-slxth Regiment left South Fnrm- ingham, Mass., tor Ssn Francisco, for trans portation to the Philippines. In a qunrrel over division of property Jack nnd Floyd Allen, brothers, shot each other In Carroll county, Vn. In a collision upon the Union Pacific Rail road near Granite Cannon, two men were killed and three Injured. Tbe Wm. B. Trigg Shipbuilding Company, In Richmond, Va., re-elected the old officers. J. L. Smith, the leader of a cattle-stealing gang, was lynched near Wilson, La. Mrs. Leslie Palmer Leigh died at her home, la Richmond. Dr. George H. Jones, a prominent physi cian and political leader of Ualvert-eounty, was stricken with apoplexy at Prince Frt d- oricktown, Md., while in the act of calling a Democratic mass-meeting to order, and died a few hours later. Mr. Howard Steep, of Frederick county, Md., bad an exciting brnsh with two colored blgflwsymen, both of whom ho scattered with a few well-placed drives from tho shou der. Tho Scott building, a large business struc ture in Hagerstown, Md., wns destroyed by fire, with a loss of about 18,000, Articles have been filed with tbe Secretary of Stnto of New Jersey, Increasing the capi tal stock of the Pittsburg Coal Company from 2,000 to C4,tKO,OCO. Alfred G. Vanderbilt, who has beon hur rying homeward from tbe Far East since ha learned of the death of his father, Cornelius Vanderbilt, has arrived, Horace Campbell, a negro phosphate miner, is in jail at Columbia, Tenn., and a strong guard stands watch to prevent a threatened lynching. Campbell killed James Gilmer, an officer. The Windsor Hotel, Hudson, N. L , wns destroyed by fire, and Wallace G. Hall, a drummer for a Philadelphia publishing company, was suffocated. AH the other guests escaped. About 260 delegates and offlaers of tbo National Womans Christian Temperanee Uuion, on route to tlio national aonventlou, at Senttle, were guests of Fargo Sunday. They refused to travel on Sunduy. Frank Augustn was shot and killed at Nllos, Ohio, In the Italian quarter by Mrs. Tauro, who was arrested and lodged In Jail at WnrreD. Sbe is snld to have shot the man to avenge her husbands murder. St. Marys Training School, at Fttehan- vlue, III., burned to tho ground. The loss Is estimated at 200,000. Seven buildings wero destroyed. Archbishop Feehans sum mer homo being tbe only building saved. Alaskas first Territorial Convention Is be ing held at Juneau to formulate for tbe use of Congress tbe legislative needs of the Territory.  Tbe Skngway Chamber of Commerce  nssed resolutions protesting against the cession of a port on tbe Lynn Canal to Great Britain. Tbe Samoans have proclaimed Tamasese King, in spite of tho agreement of tbe Pow ers to abolish tbe Kingship at least, this Is the story sent by a German correspondent, Tho Cubans continue to harass the Span- laid In Havana and vicinity, taking their cue from Mayor Lacostes recent order against the display of the Spanish flag. An attempt was made In Havana to lynch a Chinaman who had served as a guerrilla durlDg the war. The steamer Nutmog State, of the Bridge port Line, wns Lurned to tbo waters edge on Old Hen Beef, near N-w York. Eight of tbe crew were buind to death and several passengers are missing. President and Mrs. McKinley and some members of tbe Cabinet party attended Sun day service in tho First Methodist Church at Sioux City, fa. At night tho presidential trnin left for the East. J. H. Hlnde, a trusted messenger of tba National Machine Company, In New York, disappeared with 750 of the companys money. DnWiel Lockllet executed a deed in New port News, Va., transferring his little daughter to Mr. and Mis. A. W. Watson Lieutenant Harry Caldwo.l, Admiral Deweys secretary, will bo presented with a silver loving cup l-y his Illinois friends. Tbe family of Charles Herman, In New port News, Va., declare that the skeleton found In tbe woods was not bis. Seven buildings of St. Marys Training School, at Feelieuvilli, III., were burned. Loss 200,000 Insurance 60,000. Ten thousand pooplo attended tbe jubilee missionary convention of the Christian Church at Cincinnati. Two mm made n brutal assault on Police man Spinks In Alexandria, Va. James OBelrne, of New York, and Mr, Van der Hoogt, of Baltimore, representing the Transvnal government, were In Minnr. n polls seeking on Interview with President McKinley. Addresses were made nt the Huntsville Industrial Convention by Booker T. Wash Ington, Governor MacCorkle apd Professor W. H. Council. Alexandria, Vn., celebrated Its sesqul-cen- tennlal with day and night parades lavish street decorations and beautlfal Illumina tions nt night. President M KInley participated la the weleome to the returned Minnesota Volun teers In Minneapolis and was given a recep tion in St. Paul. Bev. Dr. J. Ritchie Smith, formerly of Baltimore, received a call to the Market Square Presbyterian Church in Harrisburg, Pa. Frederick George and his three little daughters were killed 1 y an express train strtklog their Wagon at B versld -, N. j. Boekefeller bos cornered the lake freight market and Carnegie will now have to pay doublo charges on iron ore. Bev. Norman Plass was arrested in Provi dence, R. I., on tbe charge of attempting to blackmail a saloon keeper. Ocean freight rates have advanced, as a rosult of the British government ebarterlng over eighty steamships. Bev. C. J. Woods, of York, Pa., and others read papers at tho Protestant Episcopal Congress at.St. Paul, Minn. Hugh Warwlok, colored, was nrrqs.ed in Lexington, Vn., on the oharge ol feloniously assaulting Lucy Creasy. Admiral Dewey wns the guest of bis native StateVermontand received the medal that wnk otcd to blm. The National Wholesale Druggists Asso ciation d- elded to ask Congress for a reduc tion of the war revenue tax. Another part of a dismembered human body was found la New York. The Minneapolis Produce Exchange wns burn d-loss  100 , 000 . The International Commercial Congress opened in Philadelphia. Senator Sbonp, ol Idaho, who has just re turned from Alaska, is opposed to ceding an lncb of land to Canada in Alaska. Chairman Jones, of the Democratic Na tional Committee, will soon kesume active charge of campaign affaire. Confederate veterans ask no pensions from tbe Federal Government, deolnred Colom-1 Hall of Macon, G., in bis address at tbe Blue and Gray Benulon in Evansville, Iod. Seven-year-old Kitty Sbaugbnessy, 6l Brooklyn, was badly l itten by rD, wl invaded tbe childs bed. The annual, reunion of tbs AnnjT Ol tbO TeBOrtse began in Chicago."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Wilson, La. Mrs. Leslie <mark>Palmer</mark> Leigh died at her"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Wilson, La. Mrs. Leslie <mark>Palmer</mark> Leigh died at her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1613.23, 640.17, 1764.85, 1250.6], "bbox_id": "5108e72550", "file": "AppomattoxNewspapers_1918-1922a_0586.pdf", "page": 1, "text": "to taking this step the Ohio mem- j I hr swept aside an opinion by Attor- nr General Palmer that Judge Lan- i fj, as within the law and that there  m no law making such acceptance I,crime, either misdemeanor or fel- The opinion was rendered re- antly hy the Attorney General on the r written request of Mr. Welty, who h questioned the Judges right to hid both positions. i Before.proceeding to the floor of fie House, where his charges were ned, Mr. Welty refused a request by Seutor Dial Democrat of South , Carolina, to include in the general hdlctment statements attributed to ledge Landis in refusing to send to jell s young Ottawa 111. bank clerk j because of the Judges belief that I officials of the bank were responsible I for the clerks peculation by failure It pay him a living wage. I Senator Dial, on receiving the Ohio I representatives refusal, announced h would file complaint against Judge I Landis with the Department of Justice, j  tad late in the day attacked the i Chicago jurist on the floor of the Sen-  tie, describing him as a freak and a  crank. The South Carolina Senator ielaracterized Judge Landis state- i leat that the Ottawa bank clerks liaployers were, in a measure, re sponsible for the youths theft of i M ,000 as the most bolshevik doctrine I ever heard, and added that if the action taken by the judge In paroling Ike clerk Is to be encouraged, it Is .ttriklng at the foundations of our gov ernment  There was no comment in the House .when Mr. Welty concluded the reading Informal indiotment of Judge Lan-   Oa his own motion, as is customary h eh proceedings, the Indictment f   ed to the Judiciary Com- j F without debate. Less than a   Wra of the members present voted, I W a number of scattering voices T 1lfted in opposition. Nobody i wed for a rising vote. Represente-!  Sherwood, Democrat, of Ohio, sit-1 M! on the fr0Ilt row, clapped his  M at otherwise there was no in-  0D 4810 how the House felt.  not step will be by Mr. Welty,   k J l T -  Possibly this week, ch wn Jud,clary Committee, with  l i f T 38 he sees fit t0 ah.  L S  V  !harBes- The commit-"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "by Attor- nr General <mark>Palmer</mark> that Judge Lan- i"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "by Attor- nr General <mark>Palmer</mark> that Judge Lan- i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1049.99, 477.69, 1078.39, 521.84], "bbox_id": "f9a942da02", "file": "AppomattoxNewspapers_1908-1909a_0012.pdf", "page": 1, "text": "Tire Firestone Michélm Firestone Palmer Goodrich Goodrich"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Tire Firestone Michélm Firestone <mark>Palmer</mark> Goodrich Goodrich"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Tire Firestone Michélm Firestone <mark>Palmer</mark> Goodrich Goodrich"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [356.63, 642.7, 516.34, 738.44], "bbox_id": "a6d6244c16", "file": "AppomattoxNewspapers_1926-1933a_0254.pdf", "page": 1, "text": "tin, of Lynchburg this week. Donald Roach, of Roanoke, accompanied his father home last Sunday. Mr. and Mrs. Palmer Ran son left here for Roanoke where they expect to spend a few days with Mrs. Ransons sister, Mrs. R. E. Roach."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Sunday. Mr. and Mrs. <mark>Palmer</mark> Ran son left here"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Sunday. Mr. and Mrs. <mark>Palmer</mark> Ran son left here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [786.95, 1501.67, 953.53, 1627.46], "bbox_id": "0da277a9de", "file": "AppomattoxNewspapers_1912-1915a_0126.pdf", "page": 1, "text": "TIDEWATER BANK CLOSE8. Warsaw.John A. Palmer, Jr., presi dent of the Tidewater Bank of Vir ginia, of Reedville, issued a statement saying that the bank had been com pelled temporarily to close its doors. He says thafrln his judgment there are sufficient assets to pay every deposi to r and every stockholder dollar for dollar. President Palmer further says fthat the banks embarrassment was I caused by Its Inability to realize on loans made, which,. while good, can not be made ta a day."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "BANK CLOSE8. Warsaw.John A. <mark>Palmer</mark>, Jr., presi dent of"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "BANK CLOSE8. Warsaw.John A. <mark>Palmer</mark>, Jr., presi dent of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1876.1, 1559.07, 2043.0, 1608.92], "bbox_id": "ac7672d0d9", "file": "AppomattoxNewspapers_1955-1957a_0365.pdf", "page": 1, "text": "Three for Jamie Dawn, set the hall rolling for Maria Palmer. She now receives loads of fan mail, in cluding love letters, proposals of marriage, and poetry."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Three for Jamie Dawn, set the hall rolling for Maria <mark>Palmer</mark>. She now receives loads of fan mail, in cluding love letters, proposals of marriage, and poetry."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Three for Jamie Dawn, set the hall rolling for Maria <mark>Palmer</mark>. She now receives loads of fan mail, in cluding love letters, proposals of marriage, and poetry."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.1, 659.57, 1650.43, 921.72], "bbox_id": "b0980d3875", "file": "AppomattoxNewspapers_1918-1922a_0333.pdf", "page": 1, "text": "though no one would predict nn Imme diate end of the trouble with the bi tuminous miners of the middle West. President Lewis of the United Mine Workers of America asked for a joint conference of operators and miners to deal with the confusion that ex ists In the coal industry, and the Illi nois operators consented to meet the workers for the purpose of discussion, but would not agree to reopen the wage  agreement until they received authority from Washington. So serl- rlous is the threat of a fuel famine that Governor Lowden of niinols urged the authorities at Washington to act quick ly in bringing about a settlement. In the national capital it was said Sec retary of Labor Wilson was about to make a report to the president Mr. Tumulty, secretary to President Wil son, said a satisfactory solution of tho problem would be reached -through the efforts of Attorney General Palmer, who named a committee to fix profit margins, and the orders of the inter state commerce commission. Others were not nearly so optimistic as Mr, Tumulty."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "efforts of Attorney General <mark>Palmer</mark>, who named a committee"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "efforts of Attorney General <mark>Palmer</mark>, who named a committee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1578.64, 676.55, 1730.92, 939.0], "bbox_id": "e0758aea66", "file": "AppomattoxNewspapers_1918-1922a_0207.pdf", "page": 1, "text": "though no one would predict an Imme diate end of the trouble with the bi tuminous miners of the middle West President Lewis of the United Mine- Workers of America asked for a joint conference of operators and miners to deal with the confusion that ex ists In the coni industry, and the Illi nois operators consented to meet the workers for the purpose of discussion, but would not agree to reopen the wage agreement until they received authority from Washington. So serl- rlous is the threat of a fuel famine that Governor Lowden of Illinois urged the authoritlest Washington to act quick ly In bringing about a settlement. In the national capital It was said Sec retary of Labor Wilson was about to make a report to the president. Mr. Tumulty, secretary to President Wil son, said a satisfactory solution of the problem would be reached through the efforts of Attorney General Palmer, who named n committee to fix profit margins, and the orders of the Inter state commerce commission. Others were not nearly so optimistic as Mr. Tumulty."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "efforts of Attorney General <mark>Palmer</mark>, who named n committee"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "efforts of Attorney General <mark>Palmer</mark>, who named n committee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1921.9, 375.87, 2084.09, 1603.85], "bbox_id": "ddec7a48c0", "file": "AppomattoxNewspapers_1892-1898a_0099.pdf", "page": 1, "text": "This Was the Vote on the Repeal B illThe Final Vote on the Voorhees B ill for Uncondi tional Repeal Was Taken on Monday NightDaniel Votes in the Negative and Hunton in the Affirmative. When the Senate met on Monday morning, 52 Senators answered to their names when the roll was called. As soon as the Vice President en tered the Chamber, at 11 a. m., he an nounced that the Senate resume its session, and thatHouse bill No. 1 the silver purchase repeal bill was now before the Senate. Mr. Hunton, of Virginia, explained briefly the position which he had oc cupied, and still occupied, ou the re peal hill. He subscribed in good faith to the Chicago platform, which demanded the repeal of the Sherman law. He should vote for its repeal. But he stood ready to joip his silver friends in a fight. for silver, and strive earnestly and manfully for vic tory. Senators Morgan, Jones, of Nevada Cockrell, Vest, Carey, and others, anti-repeal, occupied the time in speech-making until 430, when sev eral amendments were offered and voted down, then Mr. Jones, of Ne vada, resumed the floor. At 645 Mr. Jones finished his speech, and Mr. Peffer began speak ing, saying he would occupy only 15 minutes of the time of the Senate. He was correct-as to the time, fin ishing at 7 oclock. Mr. Harris spoke ten minutes, and was followed by Mr. Stewart, who began_ with the prefa tory remark that the die is cast. , Mr. Stewart closed at 720 and then the Vice-President stated that if no further amendment was offered the vote would now be taken on the engrossment and third reading of the bill. That was agreed to without a division, and then the vote was taken hy yeas and nays on the passage of the bill as amended, and it was passed. Yeas 43 nays 32, as follows YeasAldrich, Brice, Caffery,Cam den, Carey, Cullom, Davis, Dixon, Dolph, Faulkner, Frye, Gallinger, GibsSn, Gorman, Gray, Hale, Haw ley, HigginB, Hill, Hoar, Hanson, Lindsay, Lodge, McMillan, McPher son, Manderson, Mills, Mitchell, of Wisconsin Morrill, Murphy, Platt Proctor, Quay, Ransom, Sherman, Smith, Squire, stockbridge, Turpie, Vilas, Voorhee8? Washburn and White43. NaysAllen, Bate, Berry, Black burn, Butler, Call Cameron, Cock rell, Coke, Daniel, Dubois, George, Harris, Irby, Jones, Arkansas, Jones, Nevada Kyle, Martin, Pasco, Peffer, Perkins,  Pettigrew, Power, Pugh, Roach, Shoup, Stewart, Teller, Vance, Vest, Walthal and Wolcoot 32. The following were the pairs Mitchell, Oregon, and Allison Chandler and White, California Colquit and Wilson Palmer and Hansbrough Gordan and Morgan. As soon as the vote was announced the Senate at 750 p. m. adjourned till tomorrow at noon. Tomorrow the Secretary Of the Senate will appear at the bar of the House with a message, informing that body that the bill has been passed, with an amendment, and re questing the concurence of the House in that amendment. The message and billmay remain on the speakers desk until it is convenient to have it laid before the body, or it may be re ferred to a committee, or the Senate amendment may be concurred in without reference to any committee and by a direct vote of the House. Not only was the repeal bill brought to a termination today, but so also was the abnormally long legislative day of Tuesday, the 17th of October. The Senate will meet tomorrow at noon and the session will be opened with prayer and the usual formalities."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "California Colquit and Wilson <mark>Palmer</mark> and Hansbrough Gordan and"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "California Colquit and Wilson <mark>Palmer</mark> and Hansbrough Gordan and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1198.27, 367.25, 1304.22, 1096.73], "bbox_id": "177406f241", "file": "AppomattoxNewspapers_1955-1957a_0001.pdf", "page": 1, "text": "third and fourth grade t, and see their lemon  plants brought by Mrs n orange and . lemon plnS h  The ng much practicing f sembly Pr0gTam  given on November 23 The Fourth and Pifti with Mrs. Martha Valent structor, have formed tl tng committees Houseke, the following members -1 S 0? Evonne Johnson with Lottie Palmer and 8 gmson Bulletin Board a Jones, Roberta Ferguin Turner, and George Bead tahty, with Roberta Ferg Turner, Margie Fleshman ard Megginson. This gron organized a Junior Lear Officers are President, Howard J Vice-president, Geori Secretary, Roberta 1 Asst. Sec., Juanita  Treasurer, Yvonne J Choir Manager of P mittee Hazel Meggina With the teaching oi Science Center Commit ward to a very busy Both grades are work for a most successful We are very glad 1 from our Elementary this year as we know want to know interests are doing. Until next week, o The proof of a thing is that it has power o that it excites us, wins us. Cafeteria Mi Monday, Oct 24.- I buttered corn, green butter, milk, gingerbre Tuesday, Oct 25.- brown beans, turnip g butter, milk, applesaui Wed., Oct 26.- Chic steamed rice, buttered bread, butter, milk, a Thurs., Oct 27- 1 beef soup, toasted che nut butter sandwiches Monday, Oct 31.- St cole slaw, brown bean ter, miik, cherry cobl Tues., Nov. 1. Ha ties, green peas, mas bread, butter, milk. Wed., Nov. 2..- Stei candied yams, butterec bread, butter, milk, a Thurs., Nov. 3.- M cheese, stewed tom greens, bread, butter, Fri., Nov. 4.- Beef cheese and peanut bu i, milk, gingerb es,"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Evonne Johnson with Lottie <mark>Palmer</mark> and 8 gmson Bulletin"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Evonne Johnson with Lottie <mark>Palmer</mark> and 8 gmson Bulletin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [861.78, 419.42, 1041.72, 1635.41], "bbox_id": "81e46af139", "file": "AppomattoxNewspapers_1943-1947a_0056.pdf", "page": 1, "text": "There are only two requirements for making Who Was Who in Amer ica, an additional volume to Whos Who. They are death and a listing in Whos Who in Amer ica itsef, since the new 1,406-page Who Was Who contains the non living listed in Whos Who from its founding in 1897 up to the cur rent edition. Approximately 800 names will hereafter become eligi ble annually for succeeding Who Was Who volumes. At present a viscount, eight Presi dents of the United States, a premier of a republic the government of which is now in exile, and- 27,447 others meet the two reo.uirements for listing in Who Was Who. The viscount is William Waldorf Astor. The eight Presidents are Cleveland, Coolidge, Harding, Har rison, McKinley, Theodore Roose velt, Taft and Wilson. And the pre mier is Ignace Jan Paderewski, fa mous pianist and composer, who had a leading part in organizing the Po lish republic in 1919. Dates From Civil War. Among the 27,447 others whose sketches as last published in Whos Who now reappear in Who Was Who with the dates of their deaths added, are American leaders from Civil war days to the present. This long span which the volume covers brings famous figures of past dec ades such as Alexander Graham Bell, Sarah Bernhardt, Chauncey Depew, Anna Held, Mme. Nellie Mel ba, Potter Palmer, James Whitcomb Riley and Mark Twain, into its pages beside leaders of recent years like Jane Addams, Sherwood Anderson, William E. Borah, Louis D. Bran déis, Arthur Brisbane, Thomas A. Edison, Daniel Frohman, George W. Goethals and Robert M. LaFollette. One, that of a woman, mentions relief work on battlefields during the Civil war and the organization at her own expense of searches for missing men. It is the last Whos Who sketch of Clara Barton, first presi dent of the American Red Cross. Another lists employment in 1860 as a pony express rider. It is Buf falo Bill Codys sketch. Sketch Successes. Many of the sketches are strik ing examples of the opportunity this country has offered for exceptional advancement and achievement. A typical sketch of this type, beginning with farm work and clerking for four years, ends with a mention of a mil- lion-dollar gift to a museum. It is Marshall Fields. Other business men whose sketches recall intimate details of unusually interesting commercial and industrial careers are those of James C. Fargo, whose enterprise became the American Express com pany Robert Dollar, who started in a lumber camp and became one of the worlds leaders in ocean ship ping Harvey Firestone, who began with 17 employees in the rubber business and finally employed 40,000 Edward Harriman, clerk who be came railroad king  Henry Flag ler, another clerk who personally owned 600 miles of railroad before he died Julius Rosenwald, who started in the wholesale clothing business but bought control of a struggling mail order business Sears, Roebuck and Co.which had to have clothing to fulfill some of its advertising offers John H. Patter son, who perfected the cash regis ter, but started in the coal business and Theodore N. Vail, for many years president of the American Telephone and Telegraph company, I who first studied medicine. MacArthurs Dad in Book. General Arthur MacArthurs name ! is in both Whos Who and Who j Was Who, since it appears in his famous sons current Whos Who - biography. Gen. Nelson A. Miles  records that in 1864 he commanded an army corps of 26.000 men at 25 years of age. Henry Clews, the financier, who recorded in his sketch that during the Civil war the secretary of the treasury in Lincolns cabinet placed him in charge of the sale of bonds for continuing the war, and as well that later General Grant -recom mended him as advisor to Japan in setting up its financial system, also reported that he had originally studied for the ministry. Oliver Wendelf Holmes, the jurist, carefully- detailed his Civil war wounds anatomicallyin the chest at Balls Bluff, in the neck at Antietam, in the foot at Marys Hillbefore de scribing his succeeding legal experi ence and writings. John Hay noted that his earliest employment was as one of Abraham Lincolns secre taries, while John D. Rockefeller re corded his initial job as clerking ip a commission and forwarding busi ness."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Nellie Mel ba, Potter <mark>Palmer</mark>, James Whitcomb Riley and"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Nellie Mel ba, Potter <mark>Palmer</mark>, James Whitcomb Riley and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1829.27, 394.07, 2002.79, 1292.77], "bbox_id": "4ce0e21596", "file": "AppomattoxNewspapers_1902-1905a_0488.pdf", "page": 1, "text": "their captors over Sunday. On being released they instituted an investigation, which resulted in the arrest of the two men. Lumpkin is said to have had his portion of the money in his possession when arrested. After lying on the bottom of Black- water river over four months the body of 14 -vear-old Tracey Blount, son of Peter Blount, of Smithfield, came to the surface and was found floating near Zuni, I by Lee Urquhart. The boys father had I advertised in several papers offering a reward for the lad, whose disappearance had mystified all his friends, but no clue to his fate had come to light until Wed nesday. Tracey was seen rear Zuni sit ting on a bridge over the river on No vember 22 , 1904 . He is supposed to have fallen or jumped into the water and been drowned at that time. Because his father refused to let him go riding, the four-year-old son of C. W. Huffman, of Chester, attempted to burn his fathers house. He was whipped and put to bed, but got loose and set fire to the barn, which was burned, in volving a loss of  1 . 000 . While she was in the field with her brother burning corn stalks bear Savage grossing, 6 -year-old Eva Brinkley was varned from her shoulders to her knees. Her skin was badly scorched. Dr. Harre, the attending physician, thinks she cannot recover. In his efforts to stay he flames Evas 14 -year-old brother Floyd was seriously burned about the hands and arms. The 14 -year-old daughter of a farmer nyned McHaynie, of Northumberland county, was badly injured, her clothing taking fire while burning brush. While blazing she drew water from a well and her mother extinguished the blaze. W. H. Loving, a prosperous young farmer who lived near Bowling Green, Caroline county, blew his head off wtih a shotgun. He was alone and his body Was not found until some time later. Loving was a great sufferer from dys pepsia. This probably caused his sui cide. The Department of Public Instruction has issued notices that the yearly ex amination of white teachers will be held at various points July 19 and 20 and for colored teachers July 21 and 22 . Secretary Frank P. Brent, of the State Board of Education, said that the Board would likely soon make a reply to the charges of J. D. Eggleston, Jr., who gave figures fo show that Virginia school patrons are being compelled to pay exor bitant prices for their books. Mr. Brent characterizes some of Mr. Egglestons statements as misleading. An investi gation, however, indicates that the State has spent thousands of dollars for teach ers registers, which are printed by the J. L. Hill Printing Company of Rich mond. The lowest price at which they can be obtained.in lots of 100  is 60 cents a copy. The regular price is 75 cents. Three responsible firm are said to be ready to print these hooks at from 18 to 25 cents each. The heavy winds blew down an un finished two-story frame structure in the southeastern section of Roanoke which was owned by W. H. Carter, who ex pected to opei a drug store when the building was completed. It was com pletely demolished, the loss being about  2 , 000 . No one was injured, but Mrs. J. W. Snedyar was miraculously saved. A letter was delivered to her a few mo ments before as she was at work be side the building that collapsed. As she stepped into her home to read the letter the crash came. Palmer St. Clair, trainmaster on the Radford division of the Norfolk and Western, who recently resigned to be come superintendent of the Mathieson aikali works, at Saltville, was elected president of the company, which is capitalize at over  1 , 000 . 000 . Mr. Robert W. Burke, president of the National Valley Bank and one of Staun tons most substantial citizens, died in that city, aged 67 years. Mr. Burke found it necessary a year ago to underge a surgical operation at Johns Hopkins Hospital, Baltimore, after which he was greatly improved for a while. He was not confined to his house until h"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "letter the crash came. <mark>Palmer</mark> St. Clair, trainmaster on"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "letter the crash came. <mark>Palmer</mark> St. Clair, trainmaster on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [729.61, 206.53, 869.16, 710.91], "bbox_id": "44f3504540", "file": "AppomattoxNewspapers_1974-1975a_0441.pdf", "page": 1, "text": "The Youth Committee of the Appomattox Baptist Associa tion will be showing the movie MY SON, MY SON on Saturday evening, Oct. 4. at the Appomattox County High School auditorium at 730 p.m. The public is invited to attend. In a day when many Christian parents search for answers, this film offers some needed suggestions and guide lines. It is the true story of Bernard Palmer and his son Barry. After Barrys mother died his father rem arried. Barry rejected his stepmother and as he grew older he rebelled in many ways. Barrys behaviour brought heartache and em barassm ent to the Palmer household. Post - midnight telephone calls, humi liating visits to the local jail, and the inevitable community gossip were hard to bear. Maybe you can identify with such difficult parent-child rela tions and you would like to see what happened to Barry Palmer. Well, it was only after the pursuit of his rebellion had all but swung full course before Barry, like the prodigal Son, come to the end of himself and realized he must haye a new beginning. It was the realiza tion of that new beginning in Gods love and forgiveness found in Jesus the Christ that brought Good News to the Palm ers Life. Maybe you would like such an experience in your family relationship also. We encourage you and invite you to come and see with us this great story of Gods gift of"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "true story of Bernard <mark>Palmer</mark> and his son Barry."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "true story of Bernard <mark>Palmer</mark> and his son Barry."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.3, 302.09, 734.37, 534.18], "bbox_id": "75bd11f335", "file": "AppomattoxNewspapers_1960-1962b_0483.pdf", "page": 1, "text": "The tnuaioal recital and rally fri4pu by the Junior Choir of the Oenlee Baptist Ohu.ich last Sunday ewertifig at 2 P. M. was a success. Tfc program was under the direc tion of MVi. Dorothy Stevens, Rev. Hi Q. Lawr g, pastor, conducted demotions. CTie program included several seledtioua by the group and a arilo by Miss Carol Andrews and a special selection by Misses Mabel Johns, Carol Andrews and Ellen Jane Palmer! Tim La wing served as pianist. The following members retorted the following amounts Delores Hamlet, .50, Winfred Ham let, .00 Tim I,awirg, 1.00 Mabel Johns, 1.00 Ellen Jane Palmer, j 1.00 Juanita lowing, 1.00 the! Gaff or d Sistere, 5.35 Phillip  Lar.ghorne-, 6.20 Jame Hamlet, w S iiiiaieeaii"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Andrews and Ellen Jane <mark>Palmer</mark>! Tim La wing served"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Andrews and Ellen Jane <mark>Palmer</mark>! Tim La wing served"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [452.9, 306.79, 612.44, 1134.39], "bbox_id": "2032433eb5", "file": "AppomattoxNewspapers_1902-1905a_0473.pdf", "page": 1, "text": "The strike on the Interborough Rapid Transit Companys lines in New York is at an end, the men having been ad vised by the leaders to apply for rein statement. A man known as Hunter de Bowie is accused in New York of various swin dling operations in which women were the victims. Young Kingdon Gould was hazed by The Black Avengers of Columbia Col lege. The committee of the Trunk Line As sociation in charge of the uniform bill of lading question has agreed to with draw the hill, to which objection has been made, if the shippers will promise to drop the appeal to the Interstate Com merce Commission. Chairman J. Taylor Ellyson, of the Virginia Democratic State Committee, is expected by many to resign some time in May. William W. Conner, of Somerset coun ty, Md., committed suicide at Norfolk. Norfolk supervisors paid back into the treasury 4,815 salaries paid to them in excess of the 30 allowed. The National Mothers Congress is expected to demand the unseating of Senator Smoot, of Utah. Six colonels in the army are soon to be retired with the rank of brigadier-gen eral. Sir H. Rider Haggard was the guest of the President at the White House. For the present the President will consider no more applications for con sular positions. Grand Chief Stone, of the Brother hood of Locomotive Engineers, revoked the charter of the striking Interborough engineers in New York. Many of the strikers applied at the companys offices for positions. The strike continues. Representative members of the theat rical profession attended the funeral of Mr. A. M. Palmer in the Little Church Around the Corner in New York. Albert De Rome, crippled from the effects of hazing, swore out warrants for the arrest of students of the Hopkins Art Institute, in San Francisco. By a collision at Monk Center, Ind., between two trains Engineer Harson was fatally injured and Fireman Harry Cum mings was instantly killed. At a meeting of the Pittsburg mem bers of the Amalgamated Association of Street Car Employes it was determined to present a new wage scale. Mrs. Jefferson Davis is anxious to have the State of Mississippi recognized on the monument to be erected in Rich mond to Jefferson Davis. Proceedings for disbarment have been entered at Marianna, Fla., against for mer Chief Justice Liddon, of the state. Oliver Hopkinson, the oldest member of the Philadelphia bar, is dead, aged 93 years. Two negroes were hanged in Birming ham, Ala., for the murder of their sweet hearts. Grand Chief Warren S. Stone, of the Brotherhood of Locomotive Engineers, has ordered the striking motormen on the Interborough to return or be ex pelled. The local leader of the strike says the men will stay out. Many have returned and traffic is moving along. The executive committee of the United Brethren Missionary Board dropped Daniel F. Wilberforce a native African missionary, who, after 25 years work in the church, relapsed to heathenism. W. S. Alley, who was suspended from the New York Stock Exchange for one year for alleged irregularities last Sep tember, has been reinstated by the gov erning committee. The Moral Forces in the Twentieth Century was the subject of the Trask lecture delivered at the Princeton Uni versity by the Rev. Dr. Edward Everett Hale. An address on Some Phases of the Municipal Problem was delivered be fore the Yale Law School."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "of Mr. A. M. <mark>Palmer</mark> in the Little Church"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "of Mr. A. M. <mark>Palmer</mark> in the Little Church"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2287.69, 1517.33, 2451.42, 1640.63], "bbox_id": "3929dee17e", "file": "AppomattoxNewspapers_1912-1915a_0307.pdf", "page": 1, "text": "The stockholders f the Virginia Fire and Marine Insurance Company held their annual meeting In Rl- mond and re-elected the board of di rectors as constituted last year. Ths board Is composed of E. B. Addison, u py Bowe, H. L Cabell, J. Jordan Leake, F. E. NolUng, W. H. Palme and W. H. Palmer, Jr. The board re elected the officers as follows W. H. Palmer, president E. B. Addison, vice-president, and W. H. McCarthy, secretary-"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Palme and W. H. <mark>Palmer</mark>, Jr. The board re"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Palme and W. H. <mark>Palmer</mark>, Jr. The board re"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1610.62, 279.49, 1751.59, 893.79], "bbox_id": "ef887f1a5b", "file": "AppomattoxNewspapers_1962-1965a_0163.pdf", "page": 1, "text": "The States Rally sponsored by the Galilee Baptist Church netted over 500.00. The States Rally came to a successful close last Sunday morning at the close of the regular preaching service. The following leaders reported the following amounts Mrs. Ber nice LaWing, 137.00 Miss Helen Stevens, 120.00 Mrs. C. D. Beasley, 130.00 Mrs. Dorothy Pansell, 71.66 and Mrs. Mary Marshall, 62.25. The total amount reported was 520.91. The Tally was given for the benefit of installing new pews m the church.  The eleventh annual Ladies Day program sponsored by the Ladies Aid Club of Galilee came to a successful close last Sunday evening a t the 3 p.m. service. The Rev. Errfmett Palmer and his Cross Road Baptist Church Choir were the special guests The following program was pre sented, opening selection, the Cross Road Choir and audience Scripture lesson, Mrs. J. W, King Prayer, Mrs. Mary Mc Daniels Music, Guest Choir Welcome address, Mrs. mi mi Dennis Response, Mr. Joe Berry Diano solo, Mrs. Celestral Turn er Greetings from the First Baptist Church, Mrs. Ella Brown Preston Greetings, Mrs. Jose phine Webb Musical selection, Mr. and Mrs. Joe Berry Greet ings were extended by the follow ing ladies from their church clubs Mount Shiloh, Mrs. Theda Harris Promise Land, Miss Mattie Fleshman Jordan, Mrs. Dorothy Turner Springfield, Mrs. Delores Janes Sulphur Spring, Mrs. Bertlja King. The introduction of the speaker was given by the pastor. The offering was taken by Miss Helen Steph ens, Mesdame C. D. Beasley and Dorothy Pannell. The following ladies served as ushers Mes- dames Dorothy Stevens, Bernice Lawing and Bessie Watson. Re marks were given by the pastor and Miss H. B. Stevens. Mrs. Mary Marshall served as mist ress of ceremony. The total amount of offering was 79.37. The annual Ladies day will be held at the Zion Baptist Church, Pamplin, this second Sunday at 3 p.m. The Rev. R. Q. Lawing and the Galilee Junior Choir will"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "service. The Rev. Errfmett <mark>Palmer</mark> and his Cross Road"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "service. The Rev. Errfmett <mark>Palmer</mark> and his Cross Road"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1207.68, 1179.31, 1364.01, 1406.12], "bbox_id": "bb90d8b9c4", "file": "TimesVirginian_1981a_0095.pdf", "page": 1, "text": "The soils judging team of the Halifax County Young Farmers Association placed first in the annual area contest at Rust- burg, March 26. Appomattox was runner-up. Members of the winning Halifax team are Louis Ingram, David Slabach, and Mike McDoweU. W. L. Palmer is team coach. R. E. McClenny, Jr., District Conservationist, SCS, selected . the test plots and made official placings. W. K. Carroll, instructor of agriculture in the - hostRustburg High School, was in Charge of local arrange ments. Local man"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Mike McDoweU. W. L. <mark>Palmer</mark> is team coach. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Mike McDoweU. W. L. <mark>Palmer</mark> is team coach. R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1126.79, 422.87, 1288.09, 1299.33], "bbox_id": "51d95e1abc", "file": "AppomattoxNewspapers_1898-1902a_0087.pdf", "page": 1, "text": "The situation at Wilmington, N. C., Is re ported qniet, as the new olty government continues to enforce order and protect all citizens alike. The W. 0. T. U. national convention ai St. Pan, Mian., unanimously adopted reeo. luttons strongly protesting sgelnst the can teen, end also dscided by a vote ot 285 to 71 to abandon ownership of the temple In Chi cago. James Temple, an American has been ar rested In the Mexican State of Sonora on the charge of killing a Mexican in Arizona. The State Deportment has demanded Temples release. Two million dollars will he asked ot the coming Congress to make the Tennessee River navigable from Chattanooga to Its mouth. A severe fire In Dawson, Yukon territory, soused a loss of 500,009. It was started by a women throwing a lamp at another woman. The tame woman started the big fire at Dawson last winter in the same way. It is reported from Madrid that Spain will probably surrender thePhilippine Islands and make a statement to the world that she yields to superior force. Captain-General Bianco has attempted to snd the mutinies of Spanish troops In Cuba, by raising a loan with which to give them their overdue pay. Tbe Cuban Assembly at 8anta Cruz de cided upon Insignia for officers of the Cuban army. The Filipino junta at Hong Kong has drawn np a statement to President HoK!n ley complaining of alleged slights pnt on in- argents by American officers at Manila. Eight lives have boea lost as a result ol raoe troubles that started on election day In Abbeville oouuty, South Carolina. Tbe doubt as to the resalt in Nebraska has been settled by en announcement that the republicans won the Legislature and the tusionlsts the governsbip and State offices, Full-blood Creek Indians ere reported to have attacked half-breeds In a quarrel over the voting on the aooeptanee ot tbe Dawes commission treaty. Rev. Helen Stuart Rlohards, a woman wbo nursed at Cblckamaoga, told the Investiga ting commission some of tho wretched con ditions she tad oLserved there In hospi tal. White pastors in Wilmington pulpits preached on the citys recant experience and expressed gratitude for the victory of order and conservatism. It is stated in St. Paul, where the National W. C. T. U. is meeting, that Mis. L. M. N. Stevens will probably succeed the late Miss Frances Willard as president ot the orgeat cation. Mrs. Clara Fisher Maeder, who was prob ably the oldest living actress, died at Metnoben, N. J., aged eighty-seven years. It is related that In 1828 she danced at a ball in Baltimore with Louis Napoleon, after ward Emperor of the French. The war investigating commissioners at Chicago declined to take np any oases of soldiers who were wounded at Santiago and have since been missing to their relatives. Mrs. Alice Freeman Palmer, well known as an educator, was Injured by being struck by a bicycle at Cambridge, Mass. The Window Glass Cutters League of America has secured an advanoe ot wages for all its members of more than 8 per cent. The cruiser Buffalo, which started for. Manila, put back Into Newport, her air pumps being disabled. It Is reported in San Franciseo that tbe Philadelphia and Yorktown have been or- dered to Samoa to protect American Inter ests there. A new Japanese minister to the United Btat-s, Jutaro Komlra, who Is a graduate of Harvard University, has w ived at San Francisco. Ministers of Chattanooga, Team, are much incensed becanse Dr. Connor, of the war Investigating commission, charged that they were lax la promoting morality In their elty. A crowd of negroes stoned many houses In the Hebrew section of St. Louis and wounded two men and a girl. Tbe thirty 80 new freight locomotives ordered by the receivers ot the Baltimore jnd Ohio Railroad about three months ago, whlob are from the Baldwin Lo- comottveV-arks and ten from tbe Pittsburg Locomotive WHk have been delivered and are now in aervloe. StlgP9 engine are the ----- . successfully"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "relatives. Mrs. Alice Freeman <mark>Palmer</mark>, well known as an"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "relatives. Mrs. Alice Freeman <mark>Palmer</mark>, well known as an"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.19, 262.04, 1629.11, 783.18], "bbox_id": "f20c32a09b", "file": "AppomattoxNewspapers_1962-1965a_0555.pdf", "page": 1, "text": "the school. Impressive services were held at the Galilee Baptist Church last first Sunday morning at both the morning and the 3 p.m. service. The pastor of the church delivered the morning sermon and special music was rendered by the Senior and Juni or choirs of the church. Several visitors were present. The 3 p m. service was spons ored by the Senior Choir of the church. The Rev. E m m e t t e Palmer, pastor of the Wingfield Baptist Church, of Lynchburg, and his senior choir were the special guests. The welcome ad dress was given by Mrs. Dorothy Stevens, president of the choir. The response was given by Mrs. J. C. Webb, a member of the Mordenistic Club. The Mordenis- tic Club attended as a group and were presented by Miss H. B. Stephens. The offering w a s taken by Deacons John A. Wat son, L. A. Lawing and J. W. King. Remarks were given by the pastor of the church and the Rev. Carter, assistant pastor of the Wingfield Baptist Church. Special services will be rend ered at the Promise Land Bap tist Church this second Sunday evening at 3 p.m. The Rev. Mr. Bruce, pastor of the New Vine Baptist Church, will be the guest speaker. Special music will be rendered by the Galilee Church Junior Choir. Mrs. Virginia Han cock, the leader for the month of December is the sponsor of the program. The public is cor dially invited to attend this spec ial service. The regular church meeting of the Mount Shiloh Baptist Church will be held this Saturday Dec. 12 at 2 p.m. All officers and members are urged to attend."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "e t t e <mark>Palmer</mark>, pastor of the Wingfield"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "e t t e <mark>Palmer</mark>, pastor of the Wingfield"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [890.18, 332.74, 1040.15, 609.38], "bbox_id": "0f71a9b8f6", "file": "TimesVirginian_1978_0025.pdf", "page": 1, "text": "the Quarter Century Club, and a member of Bethesda Presby terian Church. Survivors include a son, Robert D. Jamerson of College Park, Mr. two daughters, Doris J. Carter and Nina J. Doyen, both of Appomattox five sisters, Viola Cumby, Palmer Harper. Lucille Mat thews. all of Lynchburg, Ina Cox of Altavista and Mary Foley of Madison, N.C. three half-sisters, Ethel W right, j Janie Franklin, and Annie j Andrews, all of Lynchburg. 10 j grandchildren and five great - j grandchildren. I. Funeral services will be  conducted at 3 p.m. Thursday I Today at Whitten Park i Avenue Chapel by Rev. James i Wood. Burial will be in Fort Hill ! Memorial Park, j Whitten Park Avenue Chapel  is in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "five sisters, Viola Cumby, <mark>Palmer</mark> Harper. Lucille Mat thews."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "five sisters, Viola Cumby, <mark>Palmer</mark> Harper. Lucille Mat thews."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1952.67, 312.98, 2095.92, 529.67], "bbox_id": "647ea38ca7", "file": "TimesVirginian_1976_0146.pdf", "page": 1, "text": "The public is reminded the annual Ladies Day celebration at the Galilee Baptist Church on the first Sunday in May at 3 p.m. All officers, members and friends are asked to attend the evening service at Mt. Shiloh this Sunday evening at 7 p.m. Special music will be rendered by the Junior Choir. Mi. Vassette Harris is still receiving treatment in th.e Lynchburg General Marshall Lodge Hospital. Mr. Charlie Palmer has been on the sick list. Mrs. Josephine Hamlet is improving nicely after a stay in the hospital."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Lodge Hospital. Mr. Charlie <mark>Palmer</mark> has been on the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Lodge Hospital. Mr. Charlie <mark>Palmer</mark> has been on the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1686.69, 383.13, 1854.27, 421.93], "bbox_id": "5fb5ad3345", "file": "AppomattoxNewspapers_1954-1955a_0377.pdf", "page": 1, "text": "The Palmer sisters, Miss Tillie, Lottie and Carrie, of Baltimore, are spending their vacation here as the guests of relatives."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "The <mark>Palmer</mark> sisters, Miss Tillie, Lottie and Carrie, of Baltimore, are spending their vacation here as the guests of relatives."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "The <mark>Palmer</mark> sisters, Miss Tillie, Lottie and Carrie, of Baltimore, are spending their vacation here as the guests of relatives."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1335.1, 1140.34, 1487.15, 1275.59], "bbox_id": "33a01ddc13", "file": "AppomattoxNewspapers_1918-1922a_0301.pdf", "page": 1, "text": "The orators for the two conventions are being selected. Former governor Willis of Ohio will place Senator Harding in nomination in Chicago, and Charles S. Willis of California will do the same for Senator Johnson. In San Francisco former Governor Shallen- berger of Nebraska will present the name of Hitchcock, C. F. X. OBrien of Jersey City that of Edwards, Claude Porter will nominate E. T. Meredith, John H. Bigelow will place Palmer be fore the convention, and Dr. Burris Jenkins of Kansas City will name Me- Adoo."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "H. Bigelow will place <mark>Palmer</mark> be fore the convention,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "H. Bigelow will place <mark>Palmer</mark> be fore the convention,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1413.6, 1166.73, 1565.38, 1302.18], "bbox_id": "b68e12d08e", "file": "AppomattoxNewspapers_1918-1922a_0167.pdf", "page": 1, "text": "The orators for the two conventions are being selected. Former governor Willis of Ohio will place Senator Harding in nomination in Chicago, and Charles S. Willis of California will do the same for Senator Johnson. In San Francisco former Governor Shallen- berger of Nebraska will present the name of Hitchcock, C. F. X. OBrien of Jersey City that of Edwards, Claude Porter will nominate E. p?. Meredith, John H. Bigelow will place Palmer be fore the convention, and Dr. Burris Jenkins oKansas City will name Mc Adoo."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "H. Bigelow will place <mark>Palmer</mark> be fore the convention,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "H. Bigelow will place <mark>Palmer</mark> be fore the convention,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [354.68, 235.09, 525.88, 960.94], "bbox_id": "b4a25a825d", "file": "AppomattoxNewspapers_1892-1898a_0359.pdf", "page": 1, "text": "The official vote of this State will, it is quite certain, show that the total vote east ht the present election will exceed but little, It any, that in the Cleveland-Harrison con test of 1891 Th official returns haye been reoelred hero at the Capitol from all of the cities and nlnety-flre of the one hundred counties. These give Bryan 157,480, Mc Kinley 129,836, Palmer 2,003, Levering 2,503, Machott socialist 100. It was expected that tho vote of November 8 would largely exceed that of any past campaigns. The re turns, however, show that the Increase will be insignificant. In the returns inode to the secretary of the Commonwealth notice is taken of the largo number of ballots ruined in the preparation and therefore not recog nized In the canvass of the votes. Hon. Page Morris, formerly of Lynchburg, where ho was postmaster nnder President Hayee, was elected to Congress on tho 3d from the Duluth Minn. district as a sound money democrat, beating Mr. Towne, who was elected as a republican two years ago and turned populist, running on the Bryan ticket. Bechnnt mill, situated about four milee west of Boydton, Mecklenburg connty owned and operated by E. A. Winn, was to tally destroyed by fire on Saturday night. The loss Is heavy, especially on many farml ers, who lost all their wheat Mr. Flodo H. Jones, formerly of Alexan dria, and son of Capt J. A Jones, has been appointed trainmaster of the Missouri di vision of the 8 t Louis Southeastern Ballway Company at Jonesboro, Ark. The postoffice at aeysvme was oroaen open and robbed. The Iron safe was blown open with dynamite and about 0800 In stamps taken and about 100 In currency. Six reg istered packages were In tho safe, but only one wns missing. This was stamps for the Clarksville office, supposed to be 50 . The other live were overlooked. It Is supposed that whsn the door to the safe was blown open the Inside fell on the floor and con cealed them. The thieves gained entrance to the postoffloe by prizing open the door. Several letters, containing dry goods, etc., were opened, bnt the contents were left on the counter. No clue as yet to tho perpetra tors of this theft It Is learned that the present poannt crop Is the poorest for many years, the proportion being but little over half of an average crop. The yield In bushels per acre Is about the same as last year, the most serious item be ing tho quality, which Is far below that of former years, 80 per cent showing a great many saps and otherwise poor nuts. On the ltocky Mount Branch of the South ern Railway a combination mail, baggage and passonger car jumped the track. The car cangbt Are and burned. Some of the mall was lost B. B. Powell, mall agent, R. T. Shelton and J. W. Brown, brakemen, wore painfully h u rt Only three passengers were on the train and they escaped Injury. Mrs Mary D. Gregory, widow of tho late WUllam Gregory, who before the war was one of the leading merchants of Alexandria, died, aged eighty years. Mr. Newton Bogsrs, who was strnok by a freight train on the Chesapeake and Ohio Railroad at Pedlar, died from his Injuries. He had been engaged in repairing the dam at Pedlar and was on his way to work when he was struck. The prospeot for another cotton mill at Lynchburg is taking form"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "157,480, Mc Kinley 129,836, <mark>Palmer</mark> 2,003, Levering 2,503, Machott"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "157,480, Mc Kinley 129,836, <mark>Palmer</mark> 2,003, Levering 2,503, Machott"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1385.3, 1067.5, 1552.25, 1288.39], "bbox_id": "a0783b35f8", "file": "AppomattoxNewspapers_1908-1909a_0071.pdf", "page": 1, "text": "The New Christmas over! Y ear is here!  Misses Virginia Beatrice Ran  son and Palmer Ramson, of  Nor folk, spent part of Xmas with relatives and friends- fa -this vicinity. Tho ones who entertained the young people at parties during Christmas were Mrs. H, Ran son, Monday night in honor of the marriage of Mr. Willie Ham ilton, her nephew to Miss Neva Morris Miss Alice Ransom Wed nesday night Miss Elia Epperlj- on Thursday - in honor of her birthday and Mrs. D. W .. Din kins entertained Friday night at a watch party Cake, jelly ant picklewere served, ât midnight tliA a M i . aah nrna  a .  . ai , hnf"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Beatrice Ran  son and <mark>Palmer</mark> Ramson, of  Nor folk,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Beatrice Ran  son and <mark>Palmer</mark> Ramson, of  Nor folk,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1352.89, 185.45, 1512.74, 958.86], "bbox_id": "12c71d8f30", "file": "TimesVirginian_1976_0444.pdf", "page": 1, "text": "The Mens club of the Promise Land Baptist Church will hold its annual Mens Day program this Sunday evening at 3 P.M. The Rev. J. W. Paige  land his Mens Chorus of the Mount Shiloh ami Chestnut Grove Churches of Amherst, Ya. will be the special guests. A short literary program will be presented by members of the local club. Local Mens dubs fhhve been invited to appear on I the program. The president of th e local, Deacon William  Hancock will serve as master of I ceremony. The general public is B cordially invited to attend. I An overflow crowd of relatives and friends attended  funeral rites for the late Mrs.  Mary Frances Palmer Hunter Mast Sunday at 1 P.M. at the Galilee Baptist Church. The K pastor or the church officiated I and delivered the eulogy. He  was assisted in the service by I his son R. Q. Lawing, Jr. The I local senior . choir rendered I beautiful music. Mrs. Jacque- 1 line Poteat of Baltimore sang a  solo. The floral designs were in jUjOtge- numbers and w ere, earned by friends and members f a r the deceased graduating m 1ass. The pastor paid tribute to jfi 1 er work in the Sunday school 2 ,nd thé Junior and senior choir. I f also paid tribute to her P ürsonaHtÿ and her spirit of I nidustrÿ. She moved to Mather,  a. last January after marrying E dr. Fred Hunter, who survives G She diedf suddenly at her home S n Mather, Pa., after suffering a S erebral hemorrage December H 1 around 230 a.m. She leaves Sfthe following to mourn their B oss A husband. Parents, Mr. ram d Mrs. Floyd Henry Palmer, pjfppoinattot, four aunts, Mes- jffidames Mitaldia Thompson, H jo ttie Rogers and Carrie Brice 5f Baltimore, Md., and Mrs. ygsMartha Ann Bonds of Roanoke, K va.,three brothers, Floyd of Richmond, Va., Henry 0. of MLynchburg, end Richard of aAppomatox Two sisters, Mrs. SaSllen Jane Hythe of Lynch- Wburg. Va., and Miss Jacqueline KjnPalmer of Appomattox, Va., a hnother-in-law, Mrs. Mary Ellen H unter of Mather, Pa., and a GBiost of other relatives and frie n d s . Burial was held in the H am ily plot in the community P B cemetery. West Funeral Home v w a s in charge of arrangements.  S The members of Galilee and 8 th e Appomattox community In ta k e thfeopportunity to extend"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "late Mrs.  Mary Frances <mark>Palmer</mark> Hunter Mast Sunday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "late Mrs.  Mary Frances <mark>Palmer</mark> Hunter Mast Sunday at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.63, 861.86, 1994.73, 993.8], "bbox_id": "54251b6670", "file": "AppomattoxNewspapers_1912-1915a_0462.pdf", "page": 1, "text": "The Lynfchburg Home Guard, Com pany E, First Virginia Volunteers, celebrated the fifty-fifth anniversary of Its organization with a banqueL A number of Confederate veterans were guests of honor of the company at the supper. Dr. Wallace T. Palmer, pas tor of Westminster Presbyterian Church and chaplain of the company, was toastmaster. As far as is known there are only three members of the original company, which was organ ized about the time of the John Brown raid at Harpers Ferry."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "supper. Dr. Wallace T. <mark>Palmer</mark>, pas tor of Westminster"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "supper. Dr. Wallace T. <mark>Palmer</mark>, pas tor of Westminster"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [270.62, 1518.35, 415.22, 1650.29], "bbox_id": "b0464bbaac", "file": "AppomattoxNewspapers_1962-1965a_0433.pdf", "page": 1, "text": "The Joanna Maiden Circle of Liberty Baptist Church enter tained at a luncheon, Saturday at the Parkway Restaurant in honor of Mrs. Cecil Palmer who will soon be moving to Richmond Members that attended were Mrs. William Chenault, Mrs. Jerry Smith, Mrs. G. P. Beas ley, Jr., Mrs. Fred Barlow, Mrs. Bobby Bryant, Mis. Judson Franklin, Mrs. Peggy Harvey. The honoree was presented with gifts."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "honor of Mrs. Cecil <mark>Palmer</mark> who will soon be"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "honor of Mrs. Cecil <mark>Palmer</mark> who will soon be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.28, 694.06, 1777.67, 858.05], "bbox_id": "e32c48935a", "file": "AppomattoxNewspapers_1902-1905a_0358.pdf", "page": 1, "text": "The followingi 8 a list of the giand and petit jurors who are well known to our readers, for the regular fall term of the United States District Court, Judge H. C. McDowell pre siding, which begins at Lynchburg September 13th Dabney L. Ander son, Thos. E. LeGrand, B. H. W. Martin, and J. T. Moses, of Appo mattox. Rolf Eldridge, Joseph T. Spencer, M. L. Layne, Chas. A. Glover, and J. J. Charlton, of Buck ingham G. T. Palmer, iVinginiu B. B. Wiisou, Concord."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Buck ingham G. T. <mark>Palmer</mark>, iVinginiu B. B. Wiisou,"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Buck ingham G. T. <mark>Palmer</mark>, iVinginiu B. B. Wiisou,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.11, 491.96, 1763.81, 870.65], "bbox_id": "d8af0254c6", "file": "AppomattoxNewspapers_1915-1918a_0498.pdf", "page": 1, "text": "The financial statement of the Bank of Pamplin appears in this issue. Read the special Christmas ad of James, the druggist, in this issue. Mr. George T. Budd, of Fay etteville, N. 0., spent the week end in the home of Mr, L E Smith Mrs. Florenoe Atwood is on an extended visit to her daugh er, Mrs. Jeter Palmer, in Nor folk Mr. R. T. F l e s h m a n and family returned to Richmond Monday, after a visit to his par ents here. A little snow and rivht chillv weather4 degrees above is the coldest recorded here so far. Henry S i l v e r t b o r n , the Lynchbur jeweler, has an in tereeting change of ad, on page one. Read tbe au of 11. N.. Hills man  Co , Lynchburg, on an other page. Special sale now going on."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "daugh er, Mrs. Jeter <mark>Palmer</mark>, in Nor folk Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "daugh er, Mrs. Jeter <mark>Palmer</mark>, in Nor folk Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [683.73, 720.45, 1003.95, 866.48], "bbox_id": "45e2a96108", "file": "AppomattoxNewspapers_1902-1905a_0573.pdf", "page": 1, "text": "The fifty-sixth convocation of die Uni- 1 . . cabiegram Emperor Nicholas ex- versity of Chicago was held in Chicago, . ded t0 p resident Roosevelt his earn- Hamlin Garland delivering the address. thanks for having brought the peace A cablegram from Shanghai tbat negotiations to a successful conclusion, the Chinese government has forbidden dispatch is regarded as one of the the boycott of American goods. most remarkable of its kind ever sent Charles Christian was saturated with the head of one nation to that of an- gasoline and set on fire by a companion otjier Hannibal, Mo. President Roosevelt received from the Almost the entire business section of - 0f j apan, warm thanks for his Flemingsburg, Ky., was destroyed by disinteresteJ anti unremitting efforts flic. _______ in 1 interest of peace and humanity. WASHINGTON The cablegram, which was received Public Printer Palmer has requested from the Emperor personally, follows , the resignation of Foreman Oscar J. Tokio, September 3, I 9  Ricketts and LC. Hay. Both have de-  The President dined to comply with the request."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "was received Public Printer <mark>Palmer</mark> has requested from the"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "was received Public Printer <mark>Palmer</mark> has requested from the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [364.31, 660.01, 536.71, 1775.08], "bbox_id": "448abd8c34", "file": "AppomattoxNewspapers_1892-1898a_0347.pdf", "page": 1, "text": "The Duty of Virginia Freemen. What is the duty of Virginia free men in the present great crises ? Let every voter reflect well before he casts his ballot. It has been rare in the history of this great country that so important an elec tion has engaged the attention of the American people. It is emphat ically a critical crucial period. What is the condition of affairs here at home ? Land in Southside V ir ginia is down to fifty cents an acre in many places and is unsaleable even at that price. I saw in 1895 a tract of land in Buckingham con taining 600 acres sold at less than fifty cents an acre. It was within five miles of a railroad and a mower can be run over every foot of it, and it is fertile and well timbered and in a good neighborhood, convenient to churches and schools. Farm products are below the cost of pro duction. No man wants land be cause he cannot make any profit in cultivating it. What is true of Buckingham is true of every county in Virginia. Indeed Buckingham is far more than an average county, its land is rich and productive and its timber and mineral resources are very great. No farmer can employ a hand even as low as seven dollars a month and find him and make a cent from the sale of farming pro ducts. T h i volume of money in Virginia is less than 5 per capita circulation and is decreasing. Our laborers cannot get employment at any price and thousands of them are forced to emigrate. I cannot tell how many have come to me this year ana said Captain Patteson we are ready to work for you at any price you choose to give. The scarcity of money has filled our highways and byways with tram ps it has filled our prisons and asylums md is still doing its fatal work Despair, misery, want and suffering ire to be seen on eyery side. What the Romaus called the angusta res domi is felt in all sections of the and. Between 1880 and 1890 the population of every agricultural county in Virginia decreased and the decrease has been greater since 1890 than it was before. Buck ham, Cumberland and Fluvanna fell back . enormously. There are fewer white people in Buckingham md Cumberland to-day thau there were one hundred years ago. A s tonishing as is this statement it is true. Actually the beavers are omiug back and building their ams just as they did two centuries go. The trade of the trapper is becoming one of the few profitable employments. This state of things cannot last It is intolerable. I f it continues all over te State a year longer it will force a default in the interest on the Virginia century bonds it will cut down the appro priatiun for the free schools and probably cause their abandonment altogether. It will force the county levies to be lowered and the rate of taxation on land. It will cause the ilaries of officers including county and circuit judges to be cut down one half at least. It will cut down the appropriation for our asylums and will inevitably force a constitu- 1 tional convention. This is no fancy sketch. And yet the people aie asked to vote for William McKinley, and worse still for his allies, the two old dry rotted cats paws, Palmer and Buckner who offer 11 s no hope but propose to continue this dreadful"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "dry rotted cats paws, <mark>Palmer</mark> and Buckner who offer"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "dry rotted cats paws, <mark>Palmer</mark> and Buckner who offer"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2004.7, 993.87, 2180.25, 1281.31], "bbox_id": "8043fbaa4c", "file": "AppomattoxNewspapers_1955-1957a_0602.pdf", "page": 1, "text": "The Council, Mayor and Town Manager are still greatly interested in continuing their current Clean- Up Campaign. I want to take this opportunity to again thank Mr Palmer and Mr. Brown and all the employ?.-- State Highway De partment for their untiring efforts and generous assistance in changing the appearance of Main and Court Streets. I also want to thank all of the Town Employees and the people for their support. In order for our Clean-Up Cam paign to be a success we need and solicit the continued cooperation and assistance of all our good citi zens. For the coming week, let s all put our shoulder to the wheel and see that Highland Ave., from the intersection with Court Street to the intersection of Church Street is cleaned and beautified as it should be Remember, this is a job for all of us. Your help is needed. Sincerely, C. T. Moses, Jr., Mayor."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "to again thank Mr <mark>Palmer</mark> and Mr. Brown and"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "to again thank Mr <mark>Palmer</mark> and Mr. Brown and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2188.76, 355.63, 2335.14, 728.48], "bbox_id": "6a3365274d", "file": "AppomattoxNewspapers_1962-1965a_0419.pdf", "page": 1, "text": "the church hospital in Baltimore, is imrpoving nicely here at her home and plans to be m her slyP on the week of June 8. Mr. Philip Haskins Is improv ing slowly in the Lynchburg Gen eral Hospital. Mrs. Daisy Palmer visited her brother in Holland, Va. last week end. The local Carver Chapter of New Farmers of America are making plans to attend the State Convention of New Fanners of America at Virginia State Col lege on June 9 through the llth. The following boys will make up the delegation Winfred Hamlet, Edward Lockett, Sylvester Dill ard and Jan White. The public is cordially invited 0 attend the regular morning services at the Galilee Baptist Church this Sunday at 1130 The Jordan Baptist Church held their annual Womans Day Brdgram Sunday evening, May 1. It was very successful. The guest speaker was Mrs. Arrie Thornhill, of Lynchburg. The program was wonderful and en joyed by all. Total amount taken was 50.65. The program was Sponsored by Mrs. Viola Austin was presented to Mrs. WilUe and Mrs. Edna Lamherth. A gift the club, by Mrs. Martha Pan wheeler, the oldest member of"}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "eral Hospital. Mrs. Daisy <mark>Palmer</mark> visited her brother in"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "eral Hospital. Mrs. Daisy <mark>Palmer</mark> visited her brother in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [774.89, 1721.23, 932.66, 1980.73], "bbox_id": "044c1cc113", "file": "AppomattoxNewspapers_1898-1902a_0592.pdf", "page": 1, "text": "The Chicago  Eastern Illinois and Illinois Central will build a bridge across the Mississippi River from Grays Point to Thebes. It is stated that the Canadian Pacific will build from Winnipeg to Duluth and compete with Great Northern  and Northern Pacific. The American Sugar Refining Compa ny of New York has been incorporated with a capital of 2.500,000. The direc tors are H. O. Havemeyer, W. E. Thomas, L. M. Palmer, C. N. Senff and A. Donner, of New York city. The English courts have ordered the compulsory winding up of the West Lc Roi, East Le Roi and Columbia-Koote- nay Mining Companies, all Whitaker Wright concerns. The organization of the Northern Se curities Company as. slated in the char ter is only temporary and the permanent board of directors wil be chosen as soon as possible after the election of the Bur lington directors. , Mr. T. J. Hurley, who has for sev eral years-been vice-president and gen eral manager of the Exploration Com pany. of New York, has accepted the presidency of the Mine Securities Cor poration of this city. The capital is 2,500,000."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "E. Thomas, L. M. <mark>Palmer</mark>, C. N. Senff and"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "E. Thomas, L. M. <mark>Palmer</mark>, C. N. Senff and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.34, 952.55, 509.59, 1417.04], "bbox_id": "2010a347e4", "file": "AppomattoxNewspapers_1902-1905a_0579.pdf", "page": 1, "text": "The Bureau of Navigation has order ed the ships of the North Atlantic fleet to begin their semi-annual target prac tice in Cope Cod Bay next week. Judge Penfields appointment as spe cial trade commissioner to South Amer ica is regarded as a nice way of getting him out of the State Department. J. Martin Miller, whom the German government would not have as consul at _Aix-la-Chapelle, has been appointed to serve as Auckland. The criminal prosecution of Morris Bursch, contractor, and Robert Charlton, inspector, was ordered by Acting Sec retary of War Oliver. Charlton and Ex aminer F. T. Quinlan are to be dis charged. Judge Advocate General Davis was directed to prepare the necessary papers for this prosecution and submit them to the Department of Justice. Bursch hold a contract with the Quarter masters Department of the Army to fur nish fur caps and gauntlets, to be deliv ered at the Schuylkill Arsenal, Philadel phia. , The Armor Car Lines filed with the Interstate Commerce Commission a state ment in which they claim that they are not within the jurisdiction of the com mission. The Board of Consulting Engineers of the Panama Canal Commission agreed to accept the French location at the basis for future detailed discussions. Public Printer F. W. Palmer has been removed and Oscar J. Ricketts, foreman of printing, has been designated to suc ceed- himr Vice President and Mrs. Fairbanks expect to entertain on a large scale dur ing the coming season. An answer was filed to the charges of the Intersate Commerce Commission by the Santa Fe Refrigerator Dispatch, in which the company denied being a com mon carrier. Consul General Rodgers, at Shanghai, cabled that the Chinese boycott of Ameri can goods had been practically abandon ed there. Minister Grip returned with the an nouncement that he would continue to represent Norway and Sweden at Wash ington."}, "highlight": {"text": {"matched_tokens": ["Palmer"], "snippet": "Public Printer F. W. <mark>Palmer</mark> has been removed and"}}, "highlights": [{"field": "text", "matched_tokens": ["Palmer"], "snippet": "Public Printer F. W. <mark>Palmer</mark> has been removed and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
