{"document": {"bbox": [1664.13, 1734.77, 1822.88, 1829.02], "bbox_id": "5616ba055a", "file": "AppomattoxNewspapers_1922-1923a_0479.pdf", "page": 1, "text": "Price SS  Vans lying U wile north of Hlxfuin- M front Pamplin Depot, tbe h m dlaUnce flroa Prospect Depot, N f W. It to, Appomattox connty, cout.-m 187 mm, epon which there 1  goo ! lw.- lag with Sve room, end good hoiue sOjji.. log With  room. Oood tobacco barn, nui  eil yeeagereherd. Convenient t-- sete- eharebM, mats, poet office, c. Tuts la moeth mna, bsmmm well, and weud mv I hffiMftf elKM b"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "of Hlxfuin- M front <mark>Pamplin</mark> <mark>Depot</mark>, tbe h m dlaUnce"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "of Hlxfuin- M front <mark>Pamplin</mark> <mark>Depot</mark>, tbe h m dlaUnce"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [473.92, 404.91, 630.37, 506.46], "bbox_id": "3fa33bf743", "file": "AppomattoxNewspapers_1902-1905a_0344.pdf", "page": 1, "text": "No. 118. Price  1,000 Farm lying near Hlxburg,containing 2 liy acre, four miles from Pamplin Depot, N. o W. R. R., Appomattox count-, upon ivhlcl there 1  a good log bulldtn-r. four room.- uin four Srs-place, brick chimney., gool se  vante bouse in tbe yard with rock uDd brie I chimneys, two good tobacco burn., a few nie- fruit trees, apples, cherries, peaches, pears plums, grapes die. A spring ol cxeell n water near tbe bouse. Convenient to school churches, mil Is, post ofHcc Ac.  This is a splendid neighborhood, and an. one deslrlug a home will do well loculi quick"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "acre, four miles from <mark>Pamplin</mark> <mark>Depot</mark>, N. o W. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "acre, four miles from <mark>Pamplin</mark> <mark>Depot</mark>, N. o W. R."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [135.33, 468.78, 290.23, 791.02], "bbox_id": "5bcc5cea18", "file": "AppomattoxNewspapers_1902-1905a_0412.pdf", "page": 1, "text": "No. 1  W e SO Farm lying 9M mile north of HUuur and alfht mile from Pamplin Depot, . the same dletaoce from Prospect Depot, N. VV. R. R., Appomattox couuty, cuu U I mii 437 aeres, upon whtoh there Is a goo 1 J w l. lug with iv a room, and good house adjoh lag with on room. Quo 1 tobaoco baru, a a small young orchard. Convenient to scb.K. churches, mills, post olfle, Ac. This Is smooth M U , produces well, and would m- a comfertahle home for a farmer. No. 11 C. Price 10 A traotofland containing ab u 118 tores, on thu N. A W. Raiiwin uear Evergreen, in Appomatt county. On burn on the place, splonaid opportunity for any ou Thin little nrm is oonveniently sit dated to ohurohes, schools and mar ket It is a great bargain for th money. Certainly one-half of tin land oleared, the remaining om half stands in aeooud growth wood land. Mot, 3,000Easy Utiui. No. t. Farm of 250 acres, in goo condition. Produoes good grain an shipping tobadco. k bout 5Q acres i original oak, 50 acres in pine an ohestnnt. Good frame house of I rooms, with tin roof. Is in Prill Edward county, throe miles fro Pamplin City  convenient to 8 tr schools, roller mill, and postoffice."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "and alfht mile from <mark>Pamplin</mark> <mark>Depot</mark>, . the same dletaoce from"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "and alfht mile from <mark>Pamplin</mark> <mark>Depot</mark>, . the same dletaoce from"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1630.31, 1008.44, 1961.92, 1098.44], "bbox_id": "5695006c34", "file": "AppomattoxNewspapers_1926-1933a_0328.pdf", "page": 1, "text": "misfortune to have his clothes I most of his life in this county stolen from his suit case in Mr. Roberts wds a kind-heart- Pamplin depot, but were re- ed man and will be greatly covered by officers later. missed by those near and dear Mr. and Mrs. Meade had to him. He leaves to mourn their home destroyed by fire their loss his wife and the fol on Sunday night about nine  lowing children E. W. Roberts"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "depot"], "snippet": "Roberts wds a kind-heart- <mark>Pamplin</mark> <mark>depot</mark>, but were re- ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "depot"], "snippet": "Roberts wds a kind-heart- <mark>Pamplin</mark> <mark>depot</mark>, but were re- ed"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1620.5, 847.41, 1953.18, 1040.85], "bbox_id": "79d3b71abb", "file": "AppomattoxNewspapers_1908-1909a_0328.pdf", "page": 1, "text": "Darlington Heights, Va. Mrs. Henry Tolley and child- ren .who have been visiting in I Richmond, have  returned to  their home. Mr. J. T. Davis, of Lynch burg, was the recent guest of the home of his daughter, Mrs. his sister, Mrs. T. N. Ransom.lW JE. .Layjne. Mr. Roberts Mr. Frank .Worsham, of V-a4 nf been confined to his P. I., spent the week-end with bed and his death came as. a his parents, Mr. and Mrs. L. great shock to his family, he W. Worsham. Frank had the  was  6 years old and lived misfortune to Wave his clothes most of his life in this county, stolen from his suit case inJMr. Roberts wds a kind-heart- Pamplin depot, but were re-ed man and will be"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "depot"], "snippet": "Roberts wds a kind-heart- <mark>Pamplin</mark> <mark>depot</mark>, but were re-ed man"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "depot"], "snippet": "Roberts wds a kind-heart- <mark>Pamplin</mark> <mark>depot</mark>, but were re-ed man"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [482.6, 497.56, 1865.4, 836.76], "bbox_id": "3277ad7343", "file": "AppomattoxNewspapers_1962-1965a_0026.pdf", "page": 1, "text": "Cactus In Bloom mblings About Clay Pipes  TIMES office The star-shaped e in color with R. A. D. COMMUTE when these pipes were made,  and wonders if some of the an-1 cestors of the women who made I them may have learned the art I from the Indians, which must be the case. I called several of the older citizens of Pamplin to see if any one knew just how old the village of Pamplin is. Miss Kate Frank lin, a relative, told me that the original name of Pamplin was Merrymans Shop something that I had not known  and that the name was changed to Pamplin Depot when the railroad went through. She did not know in what year that was, however. She did give m e one bit of in formation that helps a little she had one of her mothers wed ding invitations, dated January 11, 1871, and the address on the invitation was Pamplin Depot which means that the railroad had gone through at that time. She told me something else which  isnt too apropos of this article Nicholas"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "name was changed to <mark>Pamplin</mark> <mark>Depot</mark> when the railroad went"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "name was changed to <mark>Pamplin</mark> <mark>Depot</mark> when the railroad went"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1835.75, 795.01, 2002.04, 936.57], "bbox_id": "7e62e17adc", "file": "AppomattoxNewspapers_1922-1923a_0284.pdf", "page": 1, "text": "4-Prlce soo miles north of Hizi.uic, .. . Pamplin Depot, and   JM J dleWiee from Proapect Dep ,t, N. A  Appomattox county, conUlinns 137 aeiee, upon whtoh there ia a go I d,vli log With dv rooms, and good house adjoin. Inf With M t room. Qool tobacco b irii, and a a mall yoenf erebard. Canvenieot   m . h -I Cburehaa, mills, post office, c. This la a smooth mrm, produces well, and wouid mak. a nnmhrjf- -----   - - No. 3. Bplendld , O T iS F J for the wle ent, bhb r eld estate"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "miles north of Hizi.uic, .. . <mark>Pamplin</mark> <mark>Depot</mark>, and   JM J dleWiee"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "miles north of Hizi.uic, .. . <mark>Pamplin</mark> <mark>Depot</mark>, and   JM J dleWiee"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1859.76, 372.57, 2019.46, 477.57], "bbox_id": "7eb9ddbce4", "file": "AppomattoxNewspapers_1922-1923a_0522.pdf", "page": 1, "text": "0. 18. irl  1. v- Fans lying near Hlxburg,cotitainbic  U  . acres, foar miles from Pamplin- Depot .V V W. R. R., Appo mattox county, Ijpun ., there U  good log buildim,, Join rooms  1 ,. fosr firs-place, brick chinAitys, good se Tneta house in the yard with rock aud brio chimneys, two good tobacco barns, a few  1 , firaw trees, apples, cherries, peaches, p ar plums, grapes Ac. A spriag of excell 1 water near the house. Convenient to sell-.-., churches, mills, post office Ac. This ie e splendid neighborhood, and  ou deairing a home will do well tocall aum-"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "acres, foar miles from <mark>Pamplin</mark>- <mark>Depot</mark> .V V W. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "acres, foar miles from <mark>Pamplin</mark>- <mark>Depot</mark> .V V W. R."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1057.24, 241.38, 1175.29, 1060.66], "bbox_id": "07dacd00d9", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "Postoffice Order No. Evergreen 1 Appomattox 4 Pamplin 5 Bent Creek 7 Spout Spring 8 Vera 9 8pout Spring 11 Appomattox 12 Pamplin 18 Appomattox 19 Spout Spring. 20 Evergreen 21 Oakville 23 Appomattox 24 Appomattox 27 Appomattox 28 Stapleton 32 Appomattox 36 Appomattox 37 Appomattox 46 Walkers Ford 48 Appomattox 51. Pamplin 62 Appomattox 59 Appomattox 61 Appomattox 63 Spout Spring 641 Appomanox 66 Bent Creek 67 Conoord Depot 69 Spout Spring 70 Evergreen 71 Vera 73  Vera 741 Pamplin 771 V tra 79 Bent Creek 81 Pamplin 82 Appomattox 85 Appomattox , 86 Appomattox 89 Pamplin 901 Oakville 95 Spout Spring 961 Appomattox 981 Appomattox 991 Stapleton 1011 Bent Greek 1071 Concord Depot 1101 Appomattox 111 I Pamplin 113 Vera 1141 Pamplin 1161 Concord Depot 1161 Appomattox 1171 Appomattox 1181 Appomattox 1231 Spout Spring 1301 Vera 1351 Spout Spring 1361 Concord Depot 1381 Pamplin 1391 Spout Spring 1411 Vera 1461 Appomattox 147 L Pamplin 148  Bent Creek 1501"}, "highlight": {"text": {"matched_tokens": ["Depot", "Pamplin"], "snippet": "Spout Spring 1361 Concord <mark>Depot</mark> 1381 <mark>Pamplin</mark> 1391 Spout Spring 1411"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot", "Pamplin"], "snippet": "Spout Spring 1361 Concord <mark>Depot</mark> 1381 <mark>Pamplin</mark> 1391 Spout Spring 1411"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1949.49, 1035.79, 2096.44, 1715.19], "bbox_id": "d6c1dd0829", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "Pam plin 77 Spout Spring V era, r f d 3 78 79 Oakville 80 Bent Creek 81 Pam plin, r f d 1 82 V era, r  d 3 83 Appomattox 84 Appom attox 85 Appom attox 86 Appomattox 87 Pam plin 88 Appom attox 89 Pam plin 90 Spout Spring . 91 Spout Spring Vera 92 93 Appomattox 94 Oakville 95 Spout Spring 96 Spout Spring 97 Appomattox 98 Appom attox 99 Appomattox 100 Stapleton 101 Appomattox 102 Bent Greek 103 Appomattox 104 Appomattox 105 Appomattox 106 Appom attox 107 Appomattox 108 Spout Spring 109 Goncord Depot 110 Appomattox 111 Pamplin 112 Pam plin 113 Vera, r f d 3 114 Pamplin 116 Concord Depot 116 Appom attox 117 Appomattox 118 Pam plin 119 Vera 120 Bent Creek 121 Pam plin 122 Appom attox 123 Spout Spring 124 Vera 125 Spout 8pn n g 126 Appom attox 127 Appomattox 128 Concord Depot 129 Spout Spring 130 Pam plin 131 Pam plin 132 Tower Hill 138 Oakville 134 Vera now Tower Hill 135 Spout Spring 136 Appom attox 137 Concord Depot 138 Pamplin 139 Oakville 140 Spout Spring 141 Oakville 142 Pam p1 in 143 Appomattox 144 Appom attox 145 V era, r  d 8 146"}, "highlight": {"text": {"matched_tokens": ["Depot", "Pamplin"], "snippet": "Appom attox 137 Concord <mark>Depot</mark> 138 <mark>Pamplin</mark> 139 Oakville 140 Spout"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot", "Pamplin"], "snippet": "Appom attox 137 Concord <mark>Depot</mark> 138 <mark>Pamplin</mark> 139 Oakville 140 Spout"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [763.4, 345.46, 894.16, 841.0], "bbox_id": "fef56b2f00", "file": "AppomattoxNewspapers_1939-1943a_0318.pdf", "page": 1, "text": "Appomattox, Va. Appomattox, Va. Appomattoox, Va., Rt. 1 Gladstone, Va. Appomattox, Va. Concord Depot, Va., Rt. Gladstone, Va., Rt. 2 Spout Spring, Va. Appomattox, Va., Rt. - Appomattox, Va. Appomattox, Va. Spout Spring, Va., Rt. 1 l amplin, Va. Appomattox, Va. Appomattox, Va., Rt. 2 Appomattox, Va. Pamplin, Va., Rt. 1 Bent Creek, Va. Appomattox, Va. Appomattox, Va. Spout Spring, Va. Appomattox, Va. Appomattox, Va. Spout Spring, Va. Concord Depot, Va., Rt. Pamplin, Va. K-ergreen, Va. Spout Spring, Va. Appomattox, Va. Appomattox, Va. Concord Depot, Va. Appomattox, Va. Appomattox, Va. Appomattox, Va. Pamplin, Va., Rt. 1. Appomattox, Va. Pamplin, Va. A ppoinattox, Va. Appomattox, Va. Concord Depot, Va. Rt. Appomattox, Va. Pamplin, Va. Appomattox, Va. Appomattox, Va. Concord Depot, Va., Rt. Appomattox, Va., Rt. 4 Spout Spring, Virginia Appomattox, Va. Rt. 1 Pamplin, Va., Rt. 1 Spout Spring, Va. Appomattox, Va. Appomattox, Va , Rt. 3 Gladstone, Va. Concord Depot, Va., Rt. Appomattox, Virginia"}, "highlight": {"text": {"matched_tokens": ["Depot", "Pamplin"], "snippet": "Spout Spring, Va. Concord <mark>Depot</mark>, Va., Rt. <mark>Pamplin</mark>, Va. K-ergreen, Va. Spout"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot", "Pamplin"], "snippet": "Spout Spring, Va. Concord <mark>Depot</mark>, Va., Rt. <mark>Pamplin</mark>, Va. K-ergreen, Va. Spout"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2004.46, 942.33, 2138.21, 1436.55], "bbox_id": "ed9dc98954", "file": "AppomattoxNewspapers_1939-1943a_0309.pdf", "page": 1, "text": "A HrtiPRo Concord Depot, Va. Rt. 2 Appomattox, Va. Concord Depot, Va., Rt. 1 Appomattox, Va. Appomattox, Va. Pamplin, Va. Appomattox, Va. Spout Spring, Va. Appomattox, Va. Bent Creek, Va. Gladstone, Va. Appomattox, Va. Appomattox, Va. Spout Spring, Va. Pamplin, Va. Concord Depot, Va. Rt. 2. Concord Depot, Va., Rt. 2 Appomattoox, Va., Rt. 1 Appomattox, Va., Rt. 4 Pamplin, Va., Rt. 1 Pamplin, Va., Rt. 1. Appomattox, Va. Appomattox, Va. Appomattox, Va. Appomattox, Va. Appomattox, Va. Appomattox, Va. Rt. 1 Appomattox, Va. Spout Spring, Va., Rt. 1 Gladstone, Va. Concord Depot, Va., Rt. 2. Appomattox, Va. Appomattox, V a , Rt. 3 Concord Depot, Va., Rt. 2 Pamplin, Va., Rt. 1 Gladstone, Va., Rt. 2 Appomattox, Va., Rt. 2 Appomattox, Va. Appomattox, Va. ypomattox, Va. Pamplin, Va. Appomattox, Va. Appomattox, Va. Spout Spring, Va. Evergreen, Va. Appomattox, Va. Spout Spring, Va. Pamplin, Va. Appomattox, Va., Rt. 4 Appomattox, Va., Rt. 2 Appomattox, Va. Appomattox, Va. Appomattox, Va. Spout Spring, Va."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "Va. Spout Spring, Va. <mark>Pamplin</mark>, Va. Concord <mark>Depot</mark>, Va. Rt. 2. Concord"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "Va. Spout Spring, Va. <mark>Pamplin</mark>, Va. Concord <mark>Depot</mark>, Va. Rt. 2. Concord"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1768.1, 630.97, 1931.39, 1749.55], "bbox_id": "448885dc7c", "file": "AppomattoxNewspapers_1926-1933a_0538.pdf", "page": 1, "text": "newall Some farmers are busy threshing wheat this week. A big crop made thru this section, only 50 cents per bushel- What will become of the poor farmers? We have nice rains every few days and corn and tobacco are looking fine. Veg etables are plentiful. Miss Virginia Carson of Ap pomattox visited Miss Ethel Al- vis for the week-end. John Alvis, Jr., of Blacks burg, was home for the week end. Miss Elsie Lowry Christian, of Covington is spending some time with her grandmother, Mrs. C. E- Carson. Mr. and Mrs. Keeling Sissin and children of Richmond, were guests of Mr. and Mrs. Parks Jennings last week, hav ing been called here by the death of Judge Christian. Mr. and Mrs. Frank C. Drinkard a n d Frances, spent the week with Mrs- Drinkards mother, Mrs. W. H. Drinkard, and attended the Drinkard and Chick reunion Sunday at Mr. A. F. Drinkards. Elkton Hamilton of Chicago, is the guest of his parents, Mr. and Mrs. B. H- Hamilton- Supervisor S. E. Anderson and family and Mr. O. R. Turnes and family returned Wednesday from a trip to Nor folk, Va. Beach and other cities. Mrs- Alice Jacobs and little daughters, Bettie and Dot, John Howard Elder, Jr-, a n d Mary Cornelia Elder, of Rich mond, are spending this week with Mrs. C. M. Stratton, Jr. Tilden Lee, of Ohio is visit ing his mother, Mrs. Anna Lee- Miss Elva Stratton, of Uni versity of Va-, is expected home for the week-end. The revival begins at Tririi- ty Ghurch 4th Sunday, conduct ed by the pastor, Mr. Lewis. Mrs. J. P. Alvis, Miss -Annie Alvis and Miss Lizzie Rice are on a motor trip to West Vir ginia and. Tennessee. Miss Sue Taylor a n d Mrs. Elizabeth Snavely, of Lynch burg visited Mrs- Parks Jen nings last Sunday. Quite a number of friends and relatives of Lynchburg and other places visited in this home and attend ed the funeral of Judge Chris tian- Mr. O. R. Turnes has a new Chevrolet. ------------ o- ----------- Honorary Pall Bearers The following were named honorary pallbearers for th e late Judge D. A. Christian, the first 14 being confederate com rades of the deceased R. E. Caldwell, C. H. Cole man, D- P. Ferguson, C. C. Ferguson, J. W. Perdue, Appo mattox G. W. Cheatham, Spout Spring, R. H. Thornhill, Spout Spring, Milton Isbell, Lynchburg, J. B. Nowlin, Lynchburg, S. T- Marsh, Oak ville, J- F. Connelly, Pamplin, S. M. Ranson, Pamplin, C. E. Cardwell, Concord Depot, J. C. Whitaker, Crewe. George Diuguid, Lynchburg, B- P. Thornhill, Lynchburg, Robert Thornhill, Lynchburg, Dr. W. B. Thornhill, Lynch burg, George M. Tarry, Rich mond, Dr. Paul Redd, Rich mond, Dr. Manfred Call, Rich mond, A. R, Harwood, Appo mattox, Col. Joel Flood, Appo mattox, Hon. S- L. Ferguson. ------------ o ------------ Memorial Methodist Church G. D. Coffey, Minister. Sabbath School9 30 A. M. Morning service1030 A. M."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "Pamplin, S. M. Ranson, <mark>Pamplin</mark>, C. E. Cardwell, Concord <mark>Depot</mark>, J. C. Whitaker, Crewe."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "Pamplin, S. M. Ranson, <mark>Pamplin</mark>, C. E. Cardwell, Concord <mark>Depot</mark>, J. C. Whitaker, Crewe."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1406.15, 817.82, 1565.53, 857.82], "bbox_id": "d0906f20a7", "file": "AppomattoxNewspapers_1922-1923a_0550.pdf", "page": 1, "text": "Rev. George H. Wiley has just closed a great revival at Pamplin. He held service at the depot while waiting for his train."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "depot"], "snippet": "Rev. George H. Wiley has just closed a great revival at <mark>Pamplin</mark>. He held service at the <mark>depot</mark> while waiting for his train."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "depot"], "snippet": "Rev. George H. Wiley has just closed a great revival at <mark>Pamplin</mark>. He held service at the <mark>depot</mark> while waiting for his train."}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2104.51, 247.13, 2337.24, 693.52], "bbox_id": "9c0d3a0425", "file": "AppomattoxNewspapers_1915-1918a_0552.pdf", "page": 1, "text": "James R. Alvis,Spout Spring. John MoCartney Scott, Appo  Pa7 when due mattox. Adam Clarke Clement, Appo mattox. James Ammon Casey, 8pout Spring. Ernest Wrightman Harwood, Pamplin. Charles Reams Morris, Con- oord Depot. Bennett Harding, Beokham. Frank Obey Oovington, Hoi ly wood. Emmett Mott Perdieu, Spout 8pring. Robert Hall Thornhill, 8pout Spring. Ohas. Walker Harding, Ap pomattox. Lyle Foster Oaldwell, Spout 8pring. j - John R. Webb, Vera. Clarenoe Burnette 8imtnons, Evergreen. Jesse Peyton Harvey, Ever green. Frank Lee Coleman, Vera. Jno. Webb Beasley, Vera. Edward MePhilUps, Pamplin, Silas Panl Oawthon, Vers. William Ernest Lsyne, Spout 8pring. Thomas Tyndal Pugh, Appo mattox. Joseph Rufus Burnette, Sta pieton. Melvin Davis Childers, Vers."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "Spring. Ernest Wrightman Harwood, <mark>Pamplin</mark>. Charles Reams Morris, Con- oord <mark>Depot</mark>. Bennett Harding, Beokham. Frank"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "Spring. Ernest Wrightman Harwood, <mark>Pamplin</mark>. Charles Reams Morris, Con- oord <mark>Depot</mark>. Bennett Harding, Beokham. Frank"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [827.74, 347.66, 984.75, 1597.49], "bbox_id": "6a4e55ae51", "file": "AppomattoxNewspapers_1915-1918a_0453.pdf", "page": 1, "text": "4 Bedford Morris, negro,Ap pomattox. 8 Jam es Edward Al via, Spout Spring. 18 Joe Hancock, negro,Pam- plin. 21 Archer Wade Gallier,Ev ergreen. 23 Raymond Bell, Oakville. 24 W alter W. Scott, Appo mattox. 27 Hallie Dillard, negro,Ap pomattox. 82 Joseph Edward Crewe, Stapleton. 36 Dean Alfred Pugh, Ap pomattox. 37 Jam es Henry Stanley, jr., Appomattox. 46 William Albert Owen, Ap pomattox. 48 Thomas Edgar Moore, ne gro, W alkers Ford. 51 Calvin Chanie Woods, Appomattox. 62 Alexander Price, Pamp- lin. 61 Charles Douglas Dose, Appomattox. 63 W illiam Walter Gunter, Appomattox. 64 A r t h u r Cleveland Al mond, Spout Spring. 66 Leonard Nathaniel Greg ory, Appomattox. 69 Albert Tucker Scruggs Concord Depot. 70 George Lee Jones, Spout 8pring. 71 Leonard Henry, negro, Evergreen. 74 Thomas Jefferson Sprad lin, Vera. 77 W i l l i e David OKeefe, Pamplin. 79 Norman Baker, negro, Vera, r f d 3. 81 W illiam Walker McCor mack, Bent Creek. 82 Samuel Lee Loomis,Pam- plin, r f d 1. 85 Larkin Foster Williams, Appomattox. 86 Alex Robertson, negro Appomattox. 89 Bradley Whitney Bab cock, Appomattox 90 C a r i e Caleb Baldwin, Pamplin. 96 Norman W att Page, ne grò, Spout Spring. 98 Terry Colley Durham Appomattox. 99 Samuel Jeel Harvey, Ap pomattox. 101 Henry Alvin Drinkard Stapleton. 107 Hunter MarehaU McCoy negro, Appomattox. 110 Charles Clarence Thom as, Concord Depot. 111 Julian Delaware Pugh Appomattox. 113 Harry Miokle, negro Pamplin. 114 W illiam Anthony J ones, negro, Vera, r f d 3. 115 Rusoell Mack, negro Pamplin. 116 Charles Davis, negro Concord Depot. 117 Aubrey McCoy Thomas Appomattox. 118 David Grover Pugh, Ap pomattox. 119 Emmet Warren Oakes, Pamplin. 123 W illiam Tunstall Mor gan, Appomattox. 130 George Elliott Cheat ham, Spout Spring. 135 Ewell Ferguson, Vera r f d 3. 136 Rexford Lion Martin, Spout Spring. 138 Hal ThornhiU Baber, Concord Depot. 141 James Tazewell Jones, Spout Spring. 146 George Harrison White, Vera, r f d 3. 147 William Andrew Day, Appomattox. 148 Marcus Oase, Pamplin, r f d. 150 F r a n k Jam es 8mith, Bent Creek."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "115 Rusoell Mack, negro <mark>Pamplin</mark>. 116 Charles Davis, negro Concord <mark>Depot</mark>. 117 Aubrey McCoy Thomas"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "115 Rusoell Mack, negro <mark>Pamplin</mark>. 116 Charles Davis, negro Concord <mark>Depot</mark>. 117 Aubrey McCoy Thomas"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.19, 589.31, 1440.16, 959.59], "bbox_id": "76f0b89fea", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "Hollywood Spout 8pring Vera Appomattox Appomattox Pamplia Spout 8pring Spout 8pring Vera Appomattox Appomattox Appomattox Bene Creek Appomattox Appomattox Appomattox Spout Spring Pamplin Spout Spring Vera Spout Spring Appomattox Appomattox Concord Depot Tower Hill Oakville Appomattox Oakville Oakville Pamplin Orange Vera"}, "highlight": {"text": {"matched_tokens": ["Depot", "Pamplin"], "snippet": "Spring Appomattox Appomattox Concord <mark>Depot</mark> Tower Hill Oakville Appomattox Oakville Oakville <mark>Pamplin</mark> Orange Vera"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot", "Pamplin"], "snippet": "Spring Appomattox Appomattox Concord <mark>Depot</mark> Tower Hill Oakville Appomattox Oakville Oakville <mark>Pamplin</mark> Orange Vera"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.42, 310.2, 1841.59, 382.85], "bbox_id": "404f388c77", "file": "AppomattoxNewspapers_1947-1949a_0015.pdf", "page": 1, "text": "day, M.ty MAnn C8rson daughter of Mr. and un-n vC  -?arson Concord Depot, will be Maid of Honor.  Ali,m ,Martin Pamplin, and Elo- !? South, Gladstone, will be in the list of attendants."}, "highlight": {"text": {"matched_tokens": ["Depot", "Pamplin"], "snippet": "un-n vC  -?arson Concord <mark>Depot</mark>, will be Maid of Honor.  Ali,m ,Martin <mark>Pamplin</mark>, and Elo- !? South, Gladstone,"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot", "Pamplin"], "snippet": "un-n vC  -?arson Concord <mark>Depot</mark>, will be Maid of Honor.  Ali,m ,Martin <mark>Pamplin</mark>, and Elo- !? South, Gladstone,"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [407.05, 1531.89, 510.55, 1648.78], "bbox_id": "e02db77c0b", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": "Spout Springs ......... Nov. Appomattox ...........  Evergreen ...............  Pamplin City .........  Hixburg .................  Tower Hill .............  Oakville....................  Mineral ....................  Stonewall.................  Appomattox Depot, Dec."}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "Spout Springs ......... Nov. Appomattox ...........  Evergreen ...............  <mark>Pamplin</mark> City .........  Hixburg .................  Tower Hill .............  Oakville....................  Mineral ....................  Stonewall.................  Appomattox <mark>Depot</mark>, Dec."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "Spout Springs ......... Nov. Appomattox ...........  Evergreen ...............  <mark>Pamplin</mark> City .........  Hixburg .................  Tower Hill .............  Oakville....................  Mineral ....................  Stonewall.................  Appomattox <mark>Depot</mark>, Dec."}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.92, 1481.89, 2102.76, 1629.19], "bbox_id": "2c0639f702", "file": "AppomattoxNewspapers_1915-1918a_0117.pdf", "page": 1, "text": "poinattox. i v a p i l i a v i u u VKAVO  sea ea v y j n1n v  rnnw ift n _______ _ Mr, Curtis Harvey and Miss order to vote in the November I  rtf u n d d  d . b to i d  p  m M iry Louise Wingfield were election. married at the Presbyterian Now th a t the depot here is j ttaritho heirat taw Manse, at Pamplin last Satu J bt.tween two ailroad , p Injcaric inrrofmdo hatay be neo- iav evening. The bride is the pose there will be a new one 5jM tto o very pretty daughter of Mr. 8. bu It or the old one moved UP  VMw.paf puS P. Wingfield, of Charlotte Ap- west some distance.  u m  e pom atox county lnq, and the! groom is a son of Mr. E G. Haivey of this county. Curtis I is well known here and his I"}, "highlight": {"text": {"matched_tokens": ["depot", "Pamplin"], "snippet": "th a t the <mark>depot</mark> here is j ttaritho heirat taw Manse, at <mark>Pamplin</mark> last Satu J bt.tween"}}, "highlights": [{"field": "text", "matched_tokens": ["depot", "Pamplin"], "snippet": "th a t the <mark>depot</mark> here is j ttaritho heirat taw Manse, at <mark>Pamplin</mark> last Satu J bt.tween"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1501.69, 1542.53, 1650.52, 1711.68], "bbox_id": "353826ea3a", "file": "AppomattoxNewspapers_1892-1898a_0199.pdf", "page": 1, "text": "and pay 1894. Spout Springs, Appomattox ........... Evergreen.............. Pamplin City ........ Hixburg ................ Tower Hill ............ Oakville ................. Mineral ................. Stonewall .............. Appomattox Depot Very Respectfully, D. M ott R obertson , Treasurer,"}, "highlight": {"text": {"matched_tokens": ["Pamplin", "Depot"], "snippet": "and pay 1894. Spout Springs, Appomattox ........... Evergreen.............. <mark>Pamplin</mark> City ........ Hixburg ................ Tower Hill ............ Oakville ................. Mineral ................. Stonewall .............. Appomattox <mark>Depot</mark> Very Respectfully, D. M ott R obertson , Treasurer,"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin", "Depot"], "snippet": "and pay 1894. Spout Springs, Appomattox ........... Evergreen.............. <mark>Pamplin</mark> City ........ Hixburg ................ Tower Hill ............ Oakville ................. Mineral ................. Stonewall .............. Appomattox <mark>Depot</mark> Very Respectfully, D. M ott R obertson , Treasurer,"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [748.79, 358.49, 911.47, 923.84], "bbox_id": "f02e3fa8f0", "file": "AppomattoxNewspapers_1898-1902a_0618.pdf", "page": 1, "text": "who has been visiting relatives here and in Farmville, retuned to her home Saturday. Miss Mamie Glenn, of Prospect, was among the guests at Mr. Joe  Inges last week. Mrs. Hunter Glenn and baby, who have been visiting relatives here and j at Prospect, returned to her home in  Roanoke, last week accompanied by I Miss Berta Cralle. Mi. Monroe Dickersons little child, wno has been quite ill with rheu matism, Is slowly improviug. Miss Pearl Inge of Hollywood ,who has been visiting her brother Mr. Dave luge, of Rice Depot, returned to her home last Wednesday accom panied by Mr. Buck Rakes and sister, Miss Ethel Rakes of High Bridge. Mrs. Johnny Caw thorn, who has been ill is convalescent. Mrs. Joe Inge, who has been quite ill for the past two weeks is some thing better we are glad to state. Capt. Swann, of Hixburg, Va., spent three days here last week, surveying for Mr. E. E Chism. Miss Rena Staples spent last week with relatives at Spout Spring. Mrs. Jim McDearmon Jr., spent a part of the holidays in Richmond on a pleasure trip. Mrs. Everett Furguson, of Lynch burg spent the holidays with rela tives in Chap neighborhood. Little Lizzie Fvrgnson left last week to visit her grandparents, Mr. and Mrs. Ford of Red House. Miss Lena Rutledge spent a por tion of the holidays with relatives near Pamplin City. Her brother Mr. Jesse Rutledge, of Lynchburg, is at home on a visit. His mother con tinues quite ill at her home near here."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "Dave luge, of Rice <mark>Depot</mark>, returned to her home"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "Dave luge, of Rice <mark>Depot</mark>, returned to her home"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2111.69, 371.88, 2290.46, 1322.67], "bbox_id": "3bc3a7077d", "file": "AppomattoxNewspapers_1902-1905a_0521.pdf", "page": 1, "text": "Wednesday night and singing on Saturday night. Mr. Hurley Ferguson, of the Piedmont Business College, of Lynchburg. Bpent Saturday and Sunday last at his home near ihe Old Oourthouse. Rev. W, E. Warren, Miss Lucy Warren and Mr. Paul Warren, of I Pamplin City, and Mr. Seymore, of  Halifax County were at Mr. Wool- I ridges Sunday. j Messrs. Tom Webb and Frank I Williams spent several days of last I week in Roanoke, where they ex-  peot to accept work.  Mr. aud Mrs. E. H. Oawthorn were in Lynchburg last week buy ing new goods. Mr. J. R. Atwood, of your town was in our village last Friday. Miss Lena Woolridge, who has been ill with fever is slowly improv ing. Mrs. Mattie Fletcher, of Lynch burg, is on t visit to her sister, Mrs. , Ray Baldwin of this county. Mr. Charlie Warren, of Roanoke was in our village Sunday. He has accepted a position in Winston, N. LG. and will go there this week. Wo wish him much success. Mrs. Joe Inge returned home I Sunday from Roanoke, aocompa- Inied by her daughter Mrs. W. E Davis und littu girl, Odell, of that City. Miss Annie nd, In nw  been on a b it  relatives in Lvnch i burg returned home Sunday la Mr. and Mis. Walker Coleman of near here, have ihe sympathy of ns all over he death of their deal little baby, which occurred on Pri day last. The God who gave it saw fit to transplant this dear litile. bud in heaven, The jm!l bearer were four little boys, Frank Glover. Jim Rutledge, Peyton Harvey and Harry Johnson. The remains were interred near the dear little darl ings home in the presence of maDy  friends and loved ones. Mr. Floyd Inge, of the Hill City was the guest of his sister, Mrs. W. T. Johusou, of this place last Sun- da. Mr, Jack Hanson, of Durham Va., and his sister. Miss Girtie, of Lynchburg spent Sunday at th-ir home near Rocks church. Mr. James Hamilton spent las j Sunday with hi wife, who is under- truing an operation in Lynchburg. I We are glad to learn she i. gel tint i along nicely, and hope she nia I soon come home. j j On Sunday last, while Mr. Joel Inge came to the Depot to meet hi wife, some one broke the w ndow I open and robbed the house, taking p. nice suit of clothes and a large bucket of nice eatables, about three dozen eggs and since then they keep missing different things. They left  the house by the rear door. Mr. luge was absent from home from about four to five oclock P. M. He will be thankful for any informa tion he could receive."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Paul Warren, of I <mark>Pamplin</mark> City, and Mr. Seymore,"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Paul Warren, of I <mark>Pamplin</mark> City, and Mr. Seymore,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.39, 990.86, 1988.37, 1316.45], "bbox_id": "242d8078b4", "file": "AppomattoxNewspapers_1905-1912a_0483.pdf", "page": 1, "text": "This fine farm is located five miles from depot and good tow n on m ain publio road. The farm is well located and in i splendid state of cultivation now in hands of owner who has best of reasons for selling. 20 acres seeded to w heat, anc about 60 acres in grass well w atered and conveniently ar ranged for profitable farm ing and stock-raising. The land lays well and m achinery may be used on it all except possibly 10 acres which could be used for pasturage or orchard There are over 300 fru it trees of five years old, 200 W inesap apple, 50 mammoth black tw igs, 50 summer varieties, 20 pear trees of different varieties  plum s and cherries, peaches mal c. One-half of the farm is in Toe whole family will be shown . The treatmel,t for a aick an father, mother, sister, brother, baby, I ia.very unsatisfactory. The animal I cultivation, residue in tim ber and po-i iblv the family dog. Ad Lbould be confined where it cannot oak, hickory, poplar, etc mission free. Everybody invited darm ifcself or peraona. A bri8k Church and school on the place to tte entertainment. Grand UP-1 ruruative arecoline or eserine and The bulWinK8 on818t of a  ice purgative fareconne, or eserine ana reBidence of 9 rooms, one ten- W h A I pilocarpine subcutaneously is ex- an t jjOUBej 16x30, fram e barn ui very no J  oellent. If tne purge is to be given30x60, fram e barn 20x44, w ith by the mouth, seven drachms of I two 16-foot sheds, log barn 20x At Franklin Bros., Pamplin City,aloes in a ball pr a quart of raw 126, log corn crib"}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "located five miles from <mark>depot</mark> and good tow n"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "located five miles from <mark>depot</mark> and good tow n"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.18, 1396.63, 1859.16, 1820.67], "bbox_id": "2bfcc8cca9", "file": "AppomattoxNewspapers_1922-1923a_0184.pdf", "page": 1, "text": "This farm lie in Prince Edward county, four miles from Prospect Depot on the N. A W. Railroad, convenient to churches, schools ann mills, and contains 268 acres, one- half of which is in young growth timber. On the piece is a frame house containing three rooms also spme fruit trees of different varie ties. Farm has low grounds end produces good crops. tries, 92,000, No. 302. Lies iu Nelson count v, 13 miles from Rockfish station, lop acres, 60 in timber, white oak, pop- iar, chestnut, and locnst. Framed dwelling of six rooms, two stories in height, shingle roof. 800 fruit trees on the place, 200 Albemarle pippins in bearing, 100 winesaps five years old. Land produces corn, tobacco ad wheat of good quality. Price, 90,000 Cash, No. 6. 864 aores, 400 in timber white oak, black oak, pine, poplar, etc. In Prince Edward, six milet from Prospect station. Produce tobaccn, corn, wheat, and oats. 15 fruit trees on pls-e. Framed hons of six rooms, one and a half storie high, with shingle roof. Arids. 9,000Easy Leras. No. 8. Farm of 250 acres, in good condition. Produces good grain ami shipping tobacco. About 50 acres ii original oak, 60 acres in pine aim chestnnt. Good frame house of K rooms, with tin roof. Is in Prim- Edward county, three miles from Pamplin City  convenient to st-i- schools, roller mili, and postoffice."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "four miles from Prospect <mark>Depot</mark> on the N. A"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "four miles from Prospect <mark>Depot</mark> on the N. A"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.19, 1467.36, 1774.01, 1806.4], "bbox_id": "2c865543a0", "file": "AppomattoxNewspapers_1905-1912a_0017.pdf", "page": 1, "text": "This farm lie in Prince Edward county, four miles from Prospect Depot on the N.  W. Railroad convenient to chnrehes, schools am mill, aud contain 258 aor, one- half of which is in young growth timber. On the place is a frame house containing three room also spine fruit tree of different varie ties. Farm has low ground and produce good orop. Price, 4,500. No. 803. 278 acres in Nelson, five miles from Arrington station or Southern Railway. 50 acres in tim ber. Land produces wheat, corn, oats, tobacco, and all fruits. 1,20C fruit trees on the place. A wooden dwelling of eight rooms, two storiet high, with shingle roof. Is close tc churches, schools, mills, and post- office. Price, 2,000. No. 4. Lies in Prince Edward, 6 miles from Pamplin City  800 acre in good oondition  about 100 acre in original oak about 200 fruit trees in bearing. All cleared land not under other orops is in clover. Frame dwoLing, two stories high, with 18 rooms and two large halls. is.  metal and shingle roof. Five good houses for tenai.is. on, of them with five room-, li h e good chimneys V. j built of gtosn"}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "four miles from Prospect <mark>Depot</mark> on the N.  W."}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "four miles from Prospect <mark>Depot</mark> on the N.  W."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.42, 1009.97, 1877.6, 1812.81], "bbox_id": "fc18521988", "file": "AppomattoxNewspapers_1922-1923a_0179.pdf", "page": 1, "text": "This farm Ilea in Prince Edward county, four milea from Proapecl Depot on the N. A W. Bailroad. convenient to ehurehea, schools ano mills, and contains 258 acres, one- half of which ia in young growth timber. On the place ia a frame house containing three rooms also apme fruit trees of different varie ties. Farm has low grounds end produces good orops. trtoe, 2,000, No, 302. Lies in Nelson count v, 13 miles from Rockfish station. 10C acres, 60 in timber, white oak, pop lar, chestnut and loonst. Framed dwelling of six rooms, two stories in height, shingle roof. 800 fruit trees on the place, 200 Albemarle pippins in bearing, 100 winesaps fire yean old. Land produces corn, tobacco md wheat of good quality. PriCBj 8j000 J Qash. No. 5. 864 acres, 400 in timber white oak, black oak, pine, poplar, etc. In Prince Edward, six mllef from Prospect station. Produce tobaccn, corn, wheat, and oats. 15 fruit trees on place. Framed housi of six rooms, one and a half storiei high, with shingle roof. Phot. 3,000Edsy ierau No. 8. Farm of 250 acres, in goo oondition. Produces good grain an shipping eobaico. About 50 acres i original oak, 50 acres in pine an chestnut. Good frame house o j rooms, with tin roof. Is in Prm Edward county, three miles fr Pamplin Oity  convenient to str ichools, roller mill, and postoflicu. Price, 4,500. No. 7. 207 acres in Albemarle couqjy, on Rockfish river, two miles from Howardsville. 100 acres tim bered with oak, hickory, etc. Iron, iron pyrites, slate, soapstone, and traces of copper and gold haye been found on the land. About 20 acre? of flats on river. Fine water power. Excellent land both for fruit-gr aw ing and for mineral development Wooden honse, four rooms, one and a half stories high, shingle roof. Phot, 590. No. MM. About 180 acres, neat I all well timbered. Good for tobacc? growing. Pine vein of iron ore ran through the land. Ides in Buck ingham county, abont 8 miles froir Gladstone. Ohes. and Ohio Railwr No. iF J m  Price S4, o  j Farm lying In thSfeounty of Powhatan, Irn mediately upon Jami River, running aiout said rivet-1400 yards. Two miles from Roei Castle DspBV on U. A O. Ry., 80 milea wet of Richmond and Containing 525 8-4 acres about 60 acres ta t land and 300 acres open Dwelling of seven rooms situated on higt point overlooking river and railway for miles One good tobacco barn. Well of good wate- in the yard. Some good fruit, apples, peueb es. pear and plums. Six miles of Ooupt- seat, convenient.to schools churches, mills post office, Ac. This Is an opportunity no- Vten offered te tbe public. Fine oi l estate No. 188.200 acres 3.609. The buildintra on this place arc all in good repair the residence is a splendid slate-roof building with 7 noouis barn for six horses good 2-story granery - oi her good barns whole farm under godd fenCe i creeks run through farm well in rard several springs on place good orchard tbe farm lies well and fa very productive lituated 7 miles from stallpn close to schools, mill, churches, in ."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "four milea from Proapecl <mark>Depot</mark> on the N. A"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "four milea from Proapecl <mark>Depot</mark> on the N. A"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [194.4, 1517.56, 352.3, 1754.13], "bbox_id": "a2a64d2109", "file": "AppomattoxNewspapers_1892-1898a_0197.pdf", "page": 1, "text": "Taxes. All persons wishing to save the 5 per cent, chargeable on the first day of December 1894, will meet me at the timesand places specified below, and pay their taxes for the vear 1894 . Spout Springs ........ Nov. 19, 1894 Appomattox ...........   20, Evergreen...... . .........  1 Pamplin City ..............  22, Hixburg ..................  23  Tower Hill ...............  26,  Oakville. ...................  27,  Mineral .....................  28,  Stonewall .................  29  Appomattox Depot. Dec. 6th, 1894 . Very Respectfully, J, Mon R o b er t so n , Treasurer."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Appomattox ...........   20, Evergreen...... . .........  1 <mark>Pamplin</mark> City ..............  22, Hixburg ..................  23"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Appomattox ...........   20, Evergreen...... . .........  1 <mark>Pamplin</mark> City ..............  22, Hixburg ..................  23"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1344.95, 1308.95, 1482.8, 1464.93], "bbox_id": "aaa5fb78e4", "file": "AppomattoxNewspapers_1892-1898a_0193.pdf", "page": 1, "text": "Spout Springs .... Nov. 19, 1894, Appomattox ............  20 ,  Evergreen ...............  21  Pamplin City ...... .  22 ,  IHixburg .................  23  power H ill ..............  26  Oakville .................. . 27 1 mineral ...................  28 1 Stonewall................  29 Appomattox Depot. Dec. 6th,1894 Very Respectfully, D. M ott R obertson , Treasurer."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Appomattox ............  20 ,  Evergreen ...............  21  <mark>Pamplin</mark> City ...... .  22 ,  IHixburg .................  23"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Appomattox ............  20 ,  Evergreen ...............  21  <mark>Pamplin</mark> City ...... .  22 ,  IHixburg .................  23"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.46, 1540.23, 1997.94, 1685.13], "bbox_id": "89a9989602", "file": "AppomattoxNewspapers_1939-1943a_0577.pdf", "page": 1, "text": "Spout Spring, Oct. 19.- Mr. and Mrs. . IV. Dern, of Portsmouth, Va., spent Stnday with elativcs at Spout. Spri and Concord Depot. Miss Virginia Jones, of Tennessee spent several days recently with her parents, Mr. and Mrs. F. O. Jones. Mr. and Mrs. J. A. Martin and children spent Sunday with her parents, Mr. and Mrs. Tom Harris, of Pamplin. Marvin Martin, of Newport News spent the week-end with his mother, Mrs. Drucie Martin."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "Spout. Spri and Concord <mark>Depot</mark>. Miss Virginia Jones, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "Spout. Spri and Concord <mark>Depot</mark>. Miss Virginia Jones, of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [191.29, 284.93, 354.49, 1272.47], "bbox_id": "3f8d780ddd", "file": "AppomattoxNewspapers_1902-1905a_0332.pdf", "page": 1, "text": "Prospect. Dear T im e s  It is hot and dry  here. That is not copyrighted so anybooy can use it with my con- J sent. Crops are looking very well not-! withstanding the protracted dry spell. During the past week the wheat I harvest has been in full blast, and  a fine crop is being cut. Bennett Taylor has the beet aver age crop I have seen anywhere. Though only about seventeen yea re old he is a very progressive and suc cessful farmer, and makes it pay. Last Thursday morning as ti freight train was near ng the tank an axle of a car broke causing a de lay f several hours, but no seriouf damage was done. Yesterday as Mr. James D. Glenr was walking along the track near thi depot, No. 3 passenger train struck him, fracturing and dislocating th small bones of the right arm at the elbow. Dr. J. F. Alsop was called and did all that was nee- ssary foi his relief. Mr. Glenn is a deaf mute and did not heai the approaching train. Master lleury Moore, son of Mr. Cabell Moore, who has been sick several weeks with peritonitis, e much better. He is a manly litth fellow and has borne his suffering very patiently and bravely. The new residence of Mr. Hunter Brightwell is about completed, and the family will move in about the first of July. Miss Bessie Carter is at home from the State Normal, at Farm- ville, where she recently graduated. Miss Nora Brightwell, who has been attending the Blac stone Fe male Institute, is at home for her vacation. Miss Mamie Glenn attended the commencement exercises af Hump- den-Sydney and prolonged her visit to that neighborhood several weeks, has returned home. Mr.H.W.Glenn, of Roanoke, mad a short visit to his parents here Iasi Thursday. He was looking well and is a walking evidence of the health ful properties of the famous Grysta Springs water of the Magic City. Last Monday Mr. James W. Glenn and family, of Venner, were visiting their parents, Mr. and Mrs. Pincknej Glenn. Last Sunday Mrs James D. Glenn and son attended preaching at Olive Brapoh and spent the remainder ol the day with Mr. Hubert Glenn ol that neighborhood. Last Tuesday the Ladies Mission ary Society of Prospect Church met at the residence of Mr. F. Vi. Craw ley, about one and a-half miles eau of Prospect. The ladies took theii lunches with them, and after the business meeting, enjoyed a pleasant picnic on the Bhady lawn. Mrs. P. M. Bell and children at tended quartely meeting at Pamplin City recently. Rev.J.Hauk preached two very fine sermons, at the third quarterly meet ing at Pamplin City. He is a model presiding elder, and is doing a fine work on the Farmville District."}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "the track near thi <mark>depot</mark>, No. 3 passenger train"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "the track near thi <mark>depot</mark>, No. 3 passenger train"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [166.77, 456.79, 326.22, 1072.27], "bbox_id": "c0d32da138", "file": "AppomattoxNewspapers_1902-1905a_0404.pdf", "page": 1, "text": "Price S0f miles north of Hlxburi. snd eight miles from Pampllns Depot, an the seme distance from Prospect Depot, N.  W .R. R., Appomattox county, couUlmi.. 137 sera, upon whtoh there la a good dwcl lug with ire rooms, snd good house sdj-di Ing with one room. Qool tobacco bsrn, an a small young orchard. Convenient to sc.b o. churebee, mill, post office. Ac. This is smooth farm, produces well, and would mat a comfortable home for a farmer. No. 11. Price 10 A tract of land containing ab u 115 acres, on the N.  W. Hailwu uear Evergreen, in Appomatt. county. On barn on tbe place, splendid opportunity for any on Thie little nrm is oonvenieutly sit uated to ohurohes, schools and uiat ket. It ie a great bargain for th money. Oertainly one-half of  ! land oleared, the remaining on half stands in second growth wood land. Aiot. 3,000Easy urat. No. 8. Farm of 250 acres, in go. condition. Produces good grain an hipping cobaeco. . A bout 50 acres in original oak, 50 acres in pine an cheatnnt. Good frame house of 1 rooms, with tin roof. Is in Prim- Edward oounty, three miles froi Pamplin City  canvmiient to stoiv schools, roller milt, and postoffice. No. 103. Price 3.75 This farm, containing 302 acre adjoins No. 104, titul is in good cm. ditioti in every way  well fence and ready for work. It lies In An , 1 omattox Countv, about 4 miles iron West Appomattox depot on N  W itaiirosd, on the main county road and is easy of ingress and egress Owing to its good situation, it i considered very cheap. There art no buildings on it, but No. 104, de scribed below, can be bought with it. The two would make a fine sheep farm. No. 104. Price a,o This fine farm is not qn!1 four miles from West ApponinOo lies well, is splendidly watered, ai finely adapted for a sheep or graz e farm. It is a part of tract No. 10 which was divided, and the buii ings are on No. 103. but either both of these farms can be had ai bargain. 238 acres. Price, 2.0 Property in this neighborhood always desirable, because it is c . of access and the soil is good. Cor wheat, and tobacco yield well on 1"}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "eight miles from Pampllns <mark>Depot</mark>, an the seme distance"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "eight miles from Pampllns <mark>Depot</mark>, an the seme distance"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [862.51, 436.83, 1028.71, 513.53], "bbox_id": "c1ec474432", "file": "AppomattoxNewspapers_1955-1957a_0061.pdf", "page": 1, "text": "Pamplin Vicinity, Dec. 27.- Well, another Christmas has passed, and we have so much to be thankful for. Such beautiful weather for Christ mas. The little children enjoyed the thrill of seeing old Santa Claus up at the depot Saturday evening."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "<mark>Pamplin</mark> Vicinity, Dec. 27.- Well,"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "<mark>Pamplin</mark> Vicinity, Dec. 27.- Well,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1609.49, 533.85, 1760.03, 1127.53], "bbox_id": "954e91e575", "file": "AppomattoxNewspapers_1962-1965a_0535.pdf", "page": 1, "text": "PAMPLIN CITY  Many peo ple are curious to know more about Pamplin City. Well I want to tell you, it is not such a small one as one might think just pass ing through, for it is the center of a large progressive farming area and rather unique for its situation as it is located, you could say, in a corner of three contiguous counties, Appomattox Prince Edward and Charlotte. Especially now with the new addition to Harveys Supermar ket Lucys Beauty Shop oper ated by Miss Lucy William and two more business places, the William G. Baldwin Barber Shop and Petes Radio and TV Service in operation on Main Street, The Cobb Nursing Home recently opened for pat ients and all the new modern homes, Yes it must be said Pamplin City is spreading out. I must tell you Pamplin City is its real name, just as your name might be John Doe, and mine etc. The family of Pamp- lins that owned much of the land here many years ago lived just beyond the railroad about a stones throw from our home which is the last house down near the underpass on Route No 47 where we have lived for 39 years the 15th of last March The Pamplin cemetery is also near the site of the Pamplin home. A frame house which was torn down about 40 years ago I understand after the old depot was built and a few stores, the Pamplins gave it their name, with perhaps Ttreams Of it be coming just as it is today with a large number of nice friendly people who have shared sor- orws and joys with me through their news and daily contacts during my sojourn here that I feel I am really and truly a part of them. Guess the greatest reward for being a news cor respondent is sharing. Pamplin City is stiii on tire map. See for yourself."}, "highlight": {"text": {"matched_tokens": ["PAMPLIN"], "snippet": "<mark>PAMPLIN</mark> CITY  Many peo ple"}}, "highlights": [{"field": "text", "matched_tokens": ["PAMPLIN"], "snippet": "<mark>PAMPLIN</mark> CITY  Many peo ple"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.7, 905.34, 1764.49, 1480.65], "bbox_id": "94f7955a46", "file": "AppomattoxNewspapers_1905-1912a_0125.pdf", "page": 1, "text": "Pam plin City. Mr. W. H. Ligon is making -some improvements on the place here known as the Durphy place. It is very interesting to visit Mr. Scott Rices poultry yard when he has so many thoroughbred fowls, and all modern conveniences for caring for them. The Missionary Rosebud Society of Pamplin City will give a free entertainment in the grove known as Masons Woods, on the 27th of May p m. All are invited. There sril be an ice cream and strawberry feast on the M. E. church lawn here on Tuesday May 20th. Proceeds for repairs on M. E. church here. Mr. J. F. Connelly and wife left ast week for a visit to Richmond, Norfolk and Pinners Point. Rev. Mrs. Paisley left on Friday last to join her husband at Moores- ville, N. C., where he has accepted a call. Mr. J. D. Jennings, who is in the fiish and oyster business here, is now located in r more central part -f the town. Capt. W. T. Johnson, who is now Sargeant of the town, Returned from a trip to Petersburg last Sat urday. Another one of the western farm ers unloaded his stuff at the depot here Saturday. Mayor Peterson, who is in the real estate business, is inducing quite a number of western farmers to settle in this community. There seems to be a gre it dearth of beef cattle over the country _ bnt how could it be otherwise, when nearly all the calves are ship ped away and sold at six and seven weeks old?"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Missionary Rosebud Society of <mark>Pamplin</mark> City will give a"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Missionary Rosebud Society of <mark>Pamplin</mark> City will give a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [208.08, 1270.8, 710.81, 1703.69], "bbox_id": "6faeb5f74c", "file": "AppomattoxNewspapers_1915-1918a_0560.pdf", "page": 1, "text": "p wi i 1  H 1 í i 30 Amos Lee Cress Pamplin 20 39 Chas. A. Bocock Vera 21 ujb 25 William Price Martin Appomattox 22 B  g te  12 Lyle Foster Caldwell Spout 8pring 23 ppnd no J R j Jf!j B  1 34 Henry Augustus Tames Appomattox 24 i   , m m t i 2 John McCartney Scott Appomattox 25 S r i a B ! IB B i, 1 46 Add Alvis Washing Branch Pamplin 26 fyiEOcl l A H H j l l p l l 8 Frank Obey Covington Hollywood 27 sjmgii c H lfí Í 2 n lr f  ü 40 George Ferguson Vera 28 1 38 Clarence Fletcher Moore Oakville 29 H n oB fii 7 Bennett Harding Beckham 30 foTphn dMfi  27 Durward Belmont Thomas Appomattox 31 Hoft w sH BF VjL- 1 James R. Alvis Spout Bpring 32 HM. ohH  52 Lucius Ashton Harrison Appomattox 33 D i i H .  jal a 6 Charles Reames Morris Concord Depot 34 24 Doctor Connie Baldwin Evergreen 35  4 j 14 Clarence Burnett Simmons Evergreen 36 19 Silas Paul Cawthon Vera 37 Hem H . 11 j 37 James Leonard Blackwell Appomattox 38 B r K.v 36 Geo. Wesley Tolley Evergreen 89 1 Jff i . 1 BBBBj h yl Vc.-i y  44 Junius D ud gee Spout 8pring 40 16 Jesse Peyton Harvey Evergreen 41 ftSflrai RS 26 Nick Burrell Pamplin 42 IpfMilwjB y Si 31 Allen Howard Mayberry Appomattox 43 B  i H I i B I B K i 63 John Henry Stephens Appomattox 44 43 Thomas Doss Spout Spring 45 23 Melvin Davis Childers Vera 46 H r 22 Joseph Rufus Burnett Stapleton 47 21 Thomas Tyndal Pugh Appomattox 48 IVeg 50 Walter Day Bent Creek 49 É É p ?fl 47 Ossie Watson Evergreen 50 P aaH HpODt jtff -T Jifííg i   Es 9 Emmett Mott Perdieu Spout Spring 61 20 William Ernest Layne Spout Spring 52 H P f  5 Ernest Wightman Harwood Pamplin 63 42 Nelson Harris Spout Spring 54 L ocal B oard A ppomattox C ounty ."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "30 Amos Lee Cress <mark>Pamplin</mark> 20 39 Chas. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "30 Amos Lee Cress <mark>Pamplin</mark> 20 39 Chas. A."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1746.67, 164.88, 1895.7, 563.4], "bbox_id": "79c9712bd2", "file": "AppomattoxNewspapers_1974-1975a_0354.pdf", "page": 1, "text": "Of course the State never acquired t h  surrender grounds, leaving this action to the Federal Government. How ever, since this was completed in 1940, the village buildings 1  1865 vintage have been restored, w ith tw o others reconstructed. Wouldnt au thoress Hagy be pleased? LOOKING BACK 1. Last non-NPS resident of Surrender Grounds A. Thomas Peters B. Thomas Guill C. Thomas Gray D. Thomas LaGrand 2. Pamplins original name A. Prospect Depot B. Fayette C. Farrar D. Merrimans Shop 3. First mayor of Pamplin A. Mr. Peterson B. Mr. Paulette C. Mr. Williams D. Mr. Ranson 4. Pamplin clothes presser and pipe molder _ A. Tom Roy B. Money Jim C. Luke Sadler D. Bluett Bye 5. At 95, she made 500 clay pipes in one year A. Betty Williams B. June Chenane C. Betty Price D. Betsy Keaton _ _ . 0C9 a V C8 a 8 act 8H3M 8NV"}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "original name A. Prospect <mark>Depot</mark> B. Fayette C. Farrar"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "original name A. Prospect <mark>Depot</mark> B. Fayette C. Farrar"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2204.67, 562.3, 2370.19, 1049.19], "bbox_id": "b85b540e98", "file": "AppomattoxNewspapers_1902-1905a_0408.pdf", "page": 1, "text": "Not 115. Priea 1,509 This farm oontalns 824 acres, end lies near the village of Ever- green in Appomattox eounty, on the Norfolk  Western Railway. There is a good frame dwelling of one and a half stories, shingle roof, and oontaining five rooms, with ell the neoeasary outbuildings, About 175 aoree are in young growth timber. There ere about 276 fruit trees on the plaoe. The landspro duces average crops of corn, wheat end tobacco. Tnis place is conve nient to mill, postoffice, ohurohef apd schools.  t ,v. . Price, 1 2 , 000 , No. 4. Lies in Prinoe Edward, 6 miles from Pamplin City  800 aorei in good condition  about 100 aorei n original oak about 200 fruit trees in bearing. All oleared land not under other orops is.in clover. Frame dwoliing, two stories high, with 18 rooms and two lare halls, metal and shingle roof. Five good houses for tenants, one of them with five room. All have good ohimneyf built of ston Ill ti, m .No. Its, Farm lylug uosr llUlim tr eniiiijjwir 1 J acre, lour miles rein Fsijii, Depot, N. .v W. R, R., Apponi Altov cOUtiiv, upon vvill,ii here is a good log bullillnt,. lour rooms s..l tour Urs-placei, rirtek ehinmeys, ffo sl at-  vants bouse In the yard wlt.li rock uuil brick cbtmneye, two good tobacco burns, a few nb-r fruit trees, apples, cbcrrlr, peseta S.  plums, grapes Ac. A sprlmr of exccll ol water near tbe bouse. Convenient to ytiU churches, mills, post dillco Ac. This Is a splendid nclglilii-rliond, ninl nMV one desiring a home will do well to veil qua k Price, 8,0001 Cash, No. 5. 864 acre, 400 ip timber white oak, black oak, pine, poplar etc. In Prinoo Edward, six mllei from Prospect station. Producet tobacon, corn, wheat, and oate. 15 fruit trees on plu-e. Framed houst of six rooms, pno and a half storier high, with shingle roof."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Edward, 6 miles from <mark>Pamplin</mark> City  800 aorei in"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Edward, 6 miles from <mark>Pamplin</mark> City  800 aorei in"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.22, 1292.66, 1836.82, 1747.86], "bbox_id": "f841f522c3", "file": "AppomattoxNewspapers_1902-1905a_0586.pdf", "page": 1, "text": "No a06 Prio 200 A small farm of 60 acres, lying in Buckingham eounty. On this lfcnd ,a ?ood B house weather-board ed on outside and containing four rooms, and is situated convenient to schools and churohesL No- 209. Price 125. , acres of land6 in w ood- situated in Buckingham eounty 18 miles from railroad. Good log and frame house containing two rooms withporoh, fruit trees, and r etc.  Phot. 3,000Busy Letiao. I No. 8. Farm of 250 acres, in good I condition. Produoes good grain au.J I  ihipping wbasco. About 5u acres ir I  original oak, 50 acres in pine am- I chestnut. Good frame house of li I rooms, with tin roof. Is in Prin I Edward county, three miles fron I Pamplin City  convenient to stori- I tohools, roller mill, and postoffice. I No- ,,a - Price I Farm of 157 acres, in Appom.iii  I County, 2 mile3 from N.  V. I road. There 3 a good two-.-t I frame house and otherimprovefi.f-i I on the place. 100 acres young r-r.- I  timber good water 80 fniii ir  I  Good soil for tobacco, grain. tc   . Pr,e 3-730 I I This farm, containing 302 acre, I I joins.N o. 104, and is in good coi, I I ition in every w ay-w ell fence, I I and ready for work. It lies In A I I pomattox County, aboiit 4 miles froii 1  West Appomattox depot on N.  V Railroad, on the main county road and is easy of ingress and egress Owing to its good situation, it ii cornered very cheap. There ar no buildings on it, but No. 104, de scribed below, can be bought with it. Tffie two would make a fine sheep"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "three miles fron I <mark>Pamplin</mark> City  convenient to stori-"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "three miles fron I <mark>Pamplin</mark> City  convenient to stori-"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1615.43, 583.72, 1776.32, 1016.87], "bbox_id": "896dbd8fb1", "file": "AppomattoxNewspapers_1905-1912a_0512.pdf", "page": 1, "text": "Negro H it by Unknown Man Pamplin City, Va., March 12 What seems to have been an attempt at murder was revealed when the negro named Couch, who was found unconscious early Sunday morning at the switch just east of the depot, regained consciousness for a short time last night and told how he received the injury which almost caused him to lose his life. He sought lodg ing Saturday night at the house of an unknown negro. After he gained admittance he became involved in a quarrel with this negro, who struck him with a blunt instrument, rendering him unconscious. It is suppos ed that his assailant then car ried the unconscious negro to the railroad, in order that a train might finish his task and have it appear as an accident. When Couch was found his head was lying in the switch, in the path of any train which might pass. The injured negro is the son of Issac Couch, whose home is near Tara, in Charlotte county. His condition is now more hopeful, although Dr. H. 8. Hart, who is attending him thinks his skull is fractured. Times Dispatch."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "it by Unknown Man <mark>Pamplin</mark> City, Va., March 12"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "it by Unknown Man <mark>Pamplin</mark> City, Va., March 12"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1588.07, 582.52, 1852.47, 1015.2], "bbox_id": "61b9252c04", "file": "AppomattoxNewspapers_1905-1912a_0513.pdf", "page": 1, "text": "Negro H it by U nknow n Man Pamplin City, Va., March 12 What seems to have been an attempt at murder was revealed STORES when the negro named Couch, who was found unconscious early Sunday morning at the switch just east of the depot, regained consciousness for a short time last night and told how he received the injury which almost caused him to lose his life. He sought lodg ing Saturday night at the house of an unknown negro. After he gained admittance he became involved in a quarrel with this negro, who struck him with a blunt instrument, rendering him unconscious. It is suppos ed that his assailant then car ried the unconscious negro to the railroad, in order that a train might finish his task and have it appear as an accident. When Couch was found his head was lying in the switch, in the path of any train which might pass. The injured negro is the son of Issac Couch, whose home is near Tara, in Charlotte . county. His condition is now D1?ht more hopeful, although Dr. H. Hart, who is attending him thinks his skull is fractured. Times Dispatch."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "U nknow n Man <mark>Pamplin</mark> City, Va., March 12"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "U nknow n Man <mark>Pamplin</mark> City, Va., March 12"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1445.31, 386.56, 1613.62, 1471.36], "bbox_id": "4e9a5f4d75", "file": "AppomattoxNewspapers_1926-1933a_0573.pdf", "page": 1, "text": "My man Friday,  Spillei Trent to you year around ar- ives at our office at day beak . He pilots his way down by lan tern light and as the glow worm shows he matin to be near he begin? his daily task of brushing an d rummaging. Thus and so, abeit, Sunday afternoon Spiler retired early. He awoke ai d convinced him- f-elf that c awn was abo iz to bustso he got up and dressed lighted his trusty lantern and took out for work. But all the way down Court Street people walking along stopped him Lo break the news that it was still Sundayonly about 930 P. M.and dawn was as far off as beer in Virginia. Spiller ambl ed around awhile and then snuilied back to his house by the side of the road and for the second time retired. Spil ler has been janitor here for 36 years and he was 40 when he got the jobso whats a lew hours to him?    While our Col Flood was in Washington, one of the coun tys officials went up for a visit. A society lady, living in Wash ington, took an interest in hin at a classy affaira n d finall asked, And where were educated, Mr. . . .? Quick as a flash he came back with. Out in an old field, madam!    John A Fisher, veteran coun ty school teacher, now retired can tell you a lot of things. Father Darkleaf gave him a lift from Concord into Lynch burg Tuesdayand I wished there had been more time to talk. He began teaching at Spout Spring in 1883and thats a long time ago.    A friend writes in to call at tention to a paradox. He at tended a cinema movie to you, which treated, he relates, in masterful fashion of the groping attempt of mortal minds to arise to dignity, great ness and PEACE , . . . and then the feature picture was followed by a news reel that showed little else but march ing soldiers in nation after na tion. Our correspondent adds, The miserable hath no other medicine, but only hope.We addhope that you and 1 wont be mhrehing off to fight people you and I have nothing against and who have nothing against usbecause the folks who have money cant agree over it.    THINGUMBOBS wonder what makes a white rats eyes  so pink? . . . Rev. W. M. Black, of Pamplin, holds a mas ter of arts degree from Colgate University . . . .1 must tell about that golf round of 49 I shot first time out this year . . Amos n Andy have broad casted over 1,600 times a n d created 66 voice characters ever notice how red in the face Don Moses gets when he sings tenor? . . .1 didnt know H W. McKinney onct ran a livery stable . . . Nor have I ever seen LeRoy Smith excited or ruffled . . .Mr. Earmon says the tourists will be a-coxning soon . . .yes, and Mr. Hanen krat added yesterday, And if wed been farsighted enough to give em something to see at the Surrender Field, Appomat tox would be built up densely from the depot to the Ole Court House and wed have prosperous city. ------ - ------- o"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "W. M. Black, of <mark>Pamplin</mark>, holds a mas ter"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "W. M. Black, of <mark>Pamplin</mark>, holds a mas ter"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [825.09, 1557.66, 1290.33, 1659.31], "bbox_id": "a4b3685ac9", "file": "AppomattoxNewspapers_1939-1943a_0081.pdf", "page": 1, "text": "MRS. B. B. ADAMS Charlotte C. H., Va. MR. J. A. CAPELLE Gladstone, Va. MR. A. K. LAMBDIN Concord Depot, Va. MRS. O. L. BROWN Gladstone, Va MR. AND MRS. GILBERT DINKINS Pamplin, Va. MR. J. A. MARTIN Spout Spring, Va. MR. J. E. CHICK Spout Spring, Va. MR. F. R. GREAVER Gladstone, Va. MRS. CARLYLE SCRUGGS Spout Spring, Va. MR. RUSSELL CAWTHORN Spout Spring, Vn. MR. B. L. HANCOCK Appomattox, Va. MR. J. W. TWEEDY Concord Depot, Vn."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "A. K. LAMBDIN Concord <mark>Depot</mark>, Va. MRS. O. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "A. K. LAMBDIN Concord <mark>Depot</mark>, Va. MRS. O. L."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1347.36, 1138.86, 1507.58, 1206.66], "bbox_id": "44d295f5ac", "file": "AppomattoxNewspapers_1902-1905a_0586.pdf", "page": 1, "text": "Mr. S. A. Ferguson and Miss Susie B. Baldwin were married in the Depot here Saturday evening by Rev. Hugh C. Smith. The par ties live in the neighborhood of Pamplin City."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "were married in the <mark>Depot</mark> here Saturday evening by"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "were married in the <mark>Depot</mark> here Saturday evening by"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [568.55, 1171.71, 729.36, 1894.11], "bbox_id": "86b2454f7a", "file": "AppomattoxNewspapers_1918-1922a_0331.pdf", "page": 1, "text": "Mr Joe Inge and brother, Eld wood, left Monday for their uome in Pennsylvania, after a visit to their sister, Mrs. L.  E. Smith Messrs. Childress Wright and j Joel Morris have purchased the T. E Riely farm near Turnes Mill and will move on same  this fall. Mr. Elliott Cheatham, of I Jacksonville, Fla , a former I Appomattox boy, is visiting ! relatives and acquaintances in town and county. Miss Rheda Drinkard accom panied her sister, Mrs Royal  Hancock, of Norfolk, home i where she expects to attend business College. Miss Bertha Croberger, of Roanoke has been on  visit to  the home of Mr J . H. Garrett  and Mr. L C. Hatcher in this ! county. Miss Clara Caldwell is visit j ing friends in Pittsylvania 1 county for some time. Her sis ter, Mrs. W. D Browning, of Ricumond, is spending the summer at the old home. The N  VV. painting force haB been in town for several day 8. Its a shame to waste good paint on the old barn of a depot maintained here. Mr. 0. N Abbitt is in Chil howie for a few days. He goes to accompany back hbme his daughter who has been visiting friends in the Southwestern part of the State for some time. Doug Puckette, our expert blacksmith, went to Roanoke last weeK looking for a business opening, but reports things in that city as being dull. He ays there is no place like Ap pomattox, anyway. Tho friends of Mr. Gleen Longsworth, of the Pamplin Club Appomattox County, was elected president of the S -ate Boys and Girls Agricultural and Home Economic Club at Blacksburg last Friday. This is quite a compliment to Mr. Longsworth and his county."}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "old barn of a <mark>depot</mark> maintained here. Mr. 0."}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "old barn of a <mark>depot</mark> maintained here. Mr. 0."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.9, 217.96, 2196.8, 644.36], "bbox_id": "ceb6ff2aca", "file": "AppomattoxNewspapers_1892-1898a_0067.pdf", "page": 1, "text": "most prosperous business men, the late J. B. Glenn A big fire occurred at Prospect on yesterday evening at 3 oclock. I understand that the fire broke ont in the rear of E. 8. Taylor  Gos store, entirely destroying three stores and a stable before it oonld be cheeked. Nearly half of the busi ness part of the village is now a complete rain.  The Norfolk and Western depot was jnst across the street, and caught fire several times but was saved. The. stores totally destroyed were E. S. Taylor ft Co., loss abont 10,000, insurance 6,250 Hnbbard ft Bro., loss abont 500 no insurance H. M. Brightwell, loss about 1,000, insurance on building 1,000stook of whiskey saved. The total damage is estimated at be- tween 20,000 and 30,000. Since beginning my letter it has commenced raining, and I think the prospects are good for a fine shower. Yon can imagine the smile that onr farmers have on their faces already. Mr. Sam Daniels, of Charlotte county, passed through town last week on his way to Petersburg. Messrs. Thornton ft Meadows, pro prietors of the Pamplin City livery stable, had the misfortune to lose one of their fine driving horses, valued at 125, caused by hard driving. E."}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "The Norfolk and Western <mark>depot</mark> was jnst across the"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "The Norfolk and Western <mark>depot</mark> was jnst across the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [345.6, 1093.66, 507.24, 1305.55], "bbox_id": "2212b2afc9", "file": "AppomattoxNewspapers_1908-1909a_0533.pdf", "page": 1, "text": "Miss Sallie Rice takes charge of Malone school at Bucking ham.     Pamplin City Warehouse Co. constructs 100x16 ft. addition and reports tobacco prices and demand good. Luther LeGrand slightly hurt in explosion at Lynchburg fair. John Johns opens barber shop opposite depot in Appo mattox. T h e Rev. MacFarland pleaches, farewell sermon in arm ville before leaving f o r studies at Louisville Seminary. -Train delayed in Farmville as conductor gets out to look for false teeth dropped from ocomotive cab."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "school at Bucking ham.     <mark>Pamplin</mark> City Warehouse Co. constructs"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "school at Bucking ham.     <mark>Pamplin</mark> City Warehouse Co. constructs"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [136.79, 472.09, 282.37, 617.24], "bbox_id": "906c4120ef", "file": "TimesVirginian_1981a_0022.pdf", "page": 1, "text": "Marine Pvt. Sharon M. Overton, daughter of Alvin L. and Mary J. Overton of Route T, Box 27B, Pamplin, Va., has completed recruit training at the Marine Corps Recruit Depot, Parris Island, S.C. During the eight-week train ing cycle, she was introduced to the typical daily routine that she wul experience during her enlistment, and studied the personal and professional stan dards traditionally exhibited by"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Route T, Box 27B, <mark>Pamplin</mark>, Va., has completed recruit"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Route T, Box 27B, <mark>Pamplin</mark>, Va., has completed recruit"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "present day Appomattox . . . . the  <mark>Depot</mark>. There were nine attorneys"}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "present day Appomattox . . . . the  <mark>Depot</mark>. There were nine attorneys"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1617.61, 898.87, 1783.31, 1695.81], "bbox_id": "e70655f446", "file": "AppomattoxNewspapers_1892-1898a_0142.pdf", "page": 1, "text": "ingham T imes the Christmas ser mon of Rev. Geo. H. Wiley, I wrote at once and secured his services for revival meeting. Brother Wiley came on April the 9th full of the spirit of the Master and  preached with great power and effect. The word- of God was quick and powerful and was glorified in accomplishing much good  at one service about twenty five young men came to the altar nearly all or whom have been happily converted. The secret of this brothers success is his humility of spirit and power to draw people to him. His style simple and expository, yet when he speaks his hearers are lostin the depth of his thoughts. Never before have thè people of this town and surround ing country been so stirred by plain gospel truth. The good people of Appomattox circuit are to be congratulated on having such an humble man of God to serve them, while they are com mended for their kindness in allow ing Brother Wiley to assist in win ning souls to Christ at other places. While my people here would have contributed largely to compensate Brother Wiley for his services he would receive nothing. The prayer of hundreds follow this brother to his circuit and other places, that he may work for Christ. Both young men and maidens, old men and children, let them praise the name of the Ixrd. A drian L. C arson , Pastor Elba M. E. Church South. Èvergreen Budget. On Friday evening last at about 6 oclock, we were visited by a terrific hailstorm, which lasted about a half hour and during which some very, large stones fell. Mrs. Bunch Thornton, of Pamplin City, was in our village for a short while Thursday. Mr. Wm. Couch was here Saturday and succeeded in disposing of a large  lot of fine shad. Our former depot agent, Mr. A. W. Harvey, passed through town Monday. One of our main diversions here is watching Mr. Hallie Burge riding his bicycle and chasing the small boys. Mr. Dan Inge, while at work on his section at Rice, inflicted quite a painful wound on his hand, and has returned home. Mr. B. F. Gunter shipped a nice"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Mrs. Bunch Thornton, of <mark>Pamplin</mark> City, was in our"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Mrs. Bunch Thornton, of <mark>Pamplin</mark> City, was in our"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1476.54, 1008.89, 1651.92, 1571.44], "bbox_id": "cd6d5f7cfc", "file": "AppomattoxNewspapers_1892-1898a_0186.pdf", "page": 1, "text": "I oyvs  H on . J ohn AV. D aniel . Appomattox Court House, October 4th, court day. Concord Depot, October 29 th, Barbecue. II on . P eter J. O tey . Concord Depot, October 29th, Barbecue, H on . H. S t . G. T ucker . Concord Depot, October 29th, Barbecue. H on . E. AV. H ubard . Walkers Church, October Oth, 1 night. H on . H. D. F lood . Pamplin City, October 4tli, 8 p. m. AValkers Church, October Oth, night. Chap, November 3rd, 3 oclock p. m. Spout Springs, November 3rd, night. H on . J. II oge T yler . Concord Depot, October 29th, Barbecue. D on . P. H alsey , E sq . Concord Depot, October 29th, Barbecue. Megginsons Mill, October 30th, 3 oclock, p. m. Oakville, November 1st, 3 oclock j p. m. Pamplin City,November 2nd, 330 p. m. Chap, November 3rd, 3 oclock p, in. Spout Springs, November 3rd, night. C ol . lb B. P oore . Megginsous Mill, October 30th, 3 oclock, p. m. Oakville. November 1 st, 3 oclock, j T lo p. 111. v Pamplin City, November 2nd,330 j ty oclock, p. m."}, "highlight": {"text": {"matched_tokens": ["Depot"], "snippet": "4th, court day. Concord <mark>Depot</mark>, October 29 th, Barbecue."}}, "highlights": [{"field": "text", "matched_tokens": ["Depot"], "snippet": "4th, court day. Concord <mark>Depot</mark>, October 29 th, Barbecue."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.8, 1563.72, 1505.35, 1714.27], "bbox_id": "4aa6f1f536", "file": "AppomattoxNewspapers_1892-1898a_0151.pdf", "page": 1, "text": "H. GRIGG, Successor to Griggr  Elcan, D ruggist and A pothecary .  Pamplin City,     Va. I I S f Physicians Prescriptions carefully Impounded at all hours. Dealers in Drugs, pbaccos, Cigars and Gandies. Field and gar- fn Seeds a specialty. HT HAMLBT,  D entist , Pamplins, Va. Wi 11 be at Appomattox C. H. every Court y. Office with Dr. J. H. Abbitt, opposite fe Depot. PHOMAS W. ODOR, Unstable and Tax collector in South Side District. - Appomattox C. H., Va. EPIcse meet me at each court, Appomattox H., Va., prepared to settle your taxes. And Fill also give prompt attention to ail claims Btinmynand8 for collection."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "ruggist and A pothecary .  <mark>Pamplin</mark> City,     Va. I I"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "ruggist and A pothecary .  <mark>Pamplin</mark> City,     Va. I I"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2085.82, 379.73, 2248.37, 1602.18], "bbox_id": "d11bb7481a", "file": "AppomattoxNewspapers_1902-1905a_0167.pdf", "page": 1, "text": "Evergreen. We are. having some cool weather for the last few days, which makes the farmers hustle around cutting tobacco and pulling fodder. The tobacco crop through this part of the county is good the corn touch better than was expected at one lime. The merchants are busy opening up their fall stocks of goods. The trade is good for a small town like ours. .Ties, wood, sumac, and hun her are the principal articles of trade with the public workingmen There was preaching at Rooks church yesterday morning, and also at night. The pastor, Rev. Wm Warren, will take a vacation now, and there will be no more services for six weeks. We wish this faith ful worker of God a pleasant trip, and hope that he will enjoy the much needed rest. Mr. Geo. Glover is reported bettre this morning. He is skillfully treated by Dr. Jnlian Abbitt Miss Mazie McDearmon is much  9 better. She has been staying with her sister, Mrs. E. H. Caw thorn, fov a day or so. Mr. John Jennings is slowly im proving from a had oaie of fever contracted on the railroad while In business. Mrs. Tom LeGrand is busy train ing the Snnday-sohool children foi the picnic, which will tuke p!ac soon. She deserves much credit for her untiring set vices. Mr. Guwthorn Glover was called home last week from Blue Ridge to the bedside of his brother George. Mr. C. B. Evans left yesterday for Roanoke to pay a visit to hie best girl. Miss Maude Ragland has gone to Lynchburg to visit her cousin, Mrs. Silas Richardson, and from there will go to Eockfish depot and Schuy ler to visit her fathers relatives. We wish this little girl a pleasant trip. Miss Lillian Caldwell, of West Virginia, who has been visiting thi Misses McDearmon, of this place, left yesterday. Miss Lizzie Binford, of Princi Edward, was also the guest of Mist Mazie McDearmon lust week. Mr. Charlie Warren is heie thir veek to rest up. We are glad t. have this popular young man witl us. These cold days make us feel sat o think that fall has again come. Lhc riuniuer has seemed 30 short rio many hearu have been nia-h desolate this year, so many empty chairs by bur firesides this winter so many empty little cribs. Mrs. Ham. Almond huff returned home, after a pleasant visit of two weeks to her mother, Mrs. McCor mick, near Oakville. Mrs. Samuel Fergusons little daughter Lizzie has come home. She spent the summer with her grandmother, Mrs. Ford, near Red House. Her health is much im proved. We are glad to see such a nice letter from the Southside last yeek. She has stopped writing so many love letters and turned her at tention to the A. and B. T imes . Mr. Scott Rice, of Pamplin City, was in own on Saturday. Miss Marjory MeadernaC, of Dan ville, is the guest of the Misses Garrett this week. Miss Minnie Colley, of Amherst, came on Saturday to spend a few weeks with her cousins, Misses Blannie and Annie Evans. Mr. Willie Glover and Miss Mary Hamilton went to Lynchburg last week. Miss Mary stayed. Dame Rumor says there will be u wedding ere long, but some times she makes a mistake, for she has so much to attend to along this line. September 21,1903."}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "will go to Eockfish <mark>depot</mark> and Schuy ler to"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "will go to Eockfish <mark>depot</mark> and Schuy ler to"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1995.86, 460.2, 2159.4, 1191.2], "bbox_id": "f2cbe6b0d8", "file": "AppomattoxNewspapers_1902-1905a_0132.pdf", "page": 1, "text": "Evergreen. The people of this section were blessed with a fine rain Sunday night, which was badly needed. Rev. W. L. Bedinger filled his ap pointment at Evergreen Sunday night He also administered the Lords supper. Remember, prayer meeting every Wednesday night a t the church here. We are indeed glad to have our pastor with us at that meeting. It wiH be conducted by Mr. C. S. McDearmon, Wednesday,, night of thi week. Miss Ethel OBrien, of Lynch burg, is this week the guest of Mrs. Dr. Walker, of Pamplin City She will visit Miss Maude Ragland be fore returning home. Her brother, Mr. Edgar OBrien, who has been at Pamplin City for some time, re turned home Snnday last, much to the regret of his many friends at that place. We are indeed sonv 10 learn that Mrs. Chas, Dickerson, near Rocks, church, continues ill. She is at tended by Dr, Walker, of pHiuplin City. Miss Mary Hamilton spent several days last week with her sister, Mrs, Lncado, near 1 he oljl Courthouse, Misses Willie Woolridge and Maude Ragland and Mr. uiwthoi n were the guests of friends at I hui - plin City on Sunday. Miss Woui- ridge will spend the -week, - there with Mrs. Ed Hamilton. Mrs, Sarnie Cheatham him ! three little sous, of 1 Florid, are the guests of Mrs. Joel Uantou, near this place. Her husband will join her soori. 1 Miss Beseie Ragland left Situdu or Rice Depot 10 visit Mis, D. P, nge, of that place. Messrs. Ed and Wiley Cbenault,j of Lyuchburg, spent Sunday last with their parents not far from here. Mr. Randolph Fitzhugh, of the Phillipine Islands is uow the gnest of his father at this place, after an absence of 10 years from home. Mrs . 1 Hariiiltbh, of Charlotte county, is here on a visit to her brother, Mr. Frank Thorntou. Mr. Tom. Evans has accepted work with Mr. Cawtborn Glover at Riverside, and left on Sunday with the other boys for that place. Mrs. John Evans, who has been for the past four monts the guest of her daughter, Mrs. Lawrence Brown, of Philadelphia, returned to her home here last week. Your correspondent had the pleas- re of listening to one of Rev. P. M. Bells fine sermons on Sunday morn ing last, at the Methodist church at iamplin Ci.y. His text was from Acts vii. 59, 60. We hope soon to ave him come and preach for us. July 13, 1903."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Mrs. Dr. Walker, of <mark>Pamplin</mark> City She will visit"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Mrs. Dr. Walker, of <mark>Pamplin</mark> City She will visit"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [947.49, 294.32, 1106.74, 1153.95], "bbox_id": "36e34c2a7b", "file": "AppomattoxNewspapers_1898-1902a_0351.pdf", "page": 1, "text": "Evergreen. Cutting tobacco ami piilliug fod der seem to be the ordei of the day in our neighborhood. The farmers all seem to be of good cheer. Tbe continued dougbt does not seem to have a bad effect on them. We are sorry to say there will be no protracted meeting at Evergieen now, as onr pastor, Mr. Underwood, has gone on a visit to bis relatives in North Carolina. Revs. P. M. Bell and Bascom Dey expect to bold a meeting there. Tbe Wesley Chapel meeting closed on Friday night last. There were only a few conversions this year. Rev. P. M. Bell preached some ex cellent sermons to large congrega tions. We hope to have him with us soon. He will preach at Ever green Church on Saturday uight at 830 oclock. Come, one and all, and listen to one of his fine sermons. Mrs. Willie aud Mrs. Dan. John son, of yonr town, passed through our village to-day en route to visit relatives at Hixburg. Miss Maye Farrar h this week the guest of Miss Gracie Browning, of the old Courthouse. We wish her a pleasant visit. M r. and M rs. 8 am Farrar, of Tug gles, have lately been visiting rela tives hereabout. Mr. aud Mrs. Thomas Cralle aud family, of Wilson, have been visit ing his parents here. His little bro ther, Jesse, went home with them. We wish him a pleasant visit Mr. Bud Evans, of Newport News, is the guest of his parents near here. Miss Minnie Foster spent Satur day aud Sunday with Miss Pearl Pankey, of Pamplin City. Mr. Baxter C.alle spent Saturday and Sunday at his home near here. Mr. and Mrs. Taylor luge and family, of Forest Depot, are guests of his parents near here. Mr. Jim Hamilton and Miss Maye Farrar attended a croquet party at the old Courthouse on Friday last, and report that they had a pleasant time. Mr. Frank Thornton and daugh ter Nellie are both on the sick-list this week. Mr. and Mrs. Clifford Fraukln and baby, of Buckingham county, were, on Sunday last, tlie guests oi her sister, Mrs. James Snllivan. Mr. and Mrs. Clem. Marshall left on Satnrday for a trip down east. We wish for them a merry time. Mr. Williamson, of Concord, was on Saturday last the guest of Mr. Jack Staples. Little Eliza Snllivan, who ha been onite ill with throat trouble, is out again, we are glad to say. Little Walter is now ill. Little Esther, daughter of Mr. Hop. Fergnson, of Chap, who has been visiting little Beale and Lizzie Ferguson, of this place, left to-day. Miss Lulu Rutledge, of Lynch burg, is now at home on a visit. We welcome you home, Sis. Mr. Henry Gills and grandmoth er, Mrs. C. T. Gills, passed through our village on Sunday last. Mrs. Hunter Martin is quite ill, we are sorry to learn. We wish for her a speedy recovery."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Miss Pearl Pankey, of <mark>Pamplin</mark> City. Mr. Baxter C.alle"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Miss Pearl Pankey, of <mark>Pamplin</mark> City. Mr. Baxter C.alle"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.52, 489.8, 2208.6, 1180.76], "bbox_id": "88eef1f9c4", "file": "AppomattoxNewspapers_1905-1912a_0356.pdf", "page": 1, "text": "E v e r g r e e n . Protracted meeting will be gin at the Presbyterian Church here next Sunday night Rev. Mr. Ponton, of Pamplin City, will assist Mr. Leps in this meeting. Mr. and Mrs. J. R. Tucker, of Fort Worthy Texas, and Dr. C. Wiley Tucker, of Drakes Branch, are visiting their sister, Mrs. C. S. McDearmon, here. Miss Beulah Crute and Little Odelle Davis, of Roanoke, spent Sunday with Mr. and Mrs. Joe Inge here. Mr. .and Mrs. W. ti. Brown and Mrs. J. D. MoDearmon were in Lynchburg on Friday ash Mr. Tom Ransom, of this place, left recently for an ex tensive visit to friends in Roa noke, Montgomery and Char- eston, W. Va. Miss Annie Cheatham is at lome from the Farmville Nor mal- Miss Ethel Calhoun, of this dace, recently visited relatives in Lynchburg Messrs. Russell and Charlie Cralle, of Bedford City and Forest Depot respectively spent Sunday with their parents bere. Miss Lillian Cralle, who has been quite ill with fever, is said to be doing very nicqly this morning. Miss Zola Thopaas, a trained nurse from Lynch burg, is with her. Mr. Jas. Whorley, of Hinton, W. Va., visited relatives here last week- Mrs. N. E. Farrar and son, Kenneth, of Forest, V a, are visiting her home people here. Mr. J. L. Staples, of Lynch burg, is spending his vacation with his parents near here. Mr. Calyin Wilks, of Am- arrila, Texas, is visiting his sister, Mrs. John Evans, here. Dont forget the Lawu Party here next Saturday, the 24th."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Rev. Mr. Ponton, of <mark>Pamplin</mark> City, will assist Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Rev. Mr. Ponton, of <mark>Pamplin</mark> City, will assist Mr."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [850.11, 238.0, 1006.77, 400.91], "bbox_id": "9a2978102f", "file": "AppomattoxNewspapers_1892-1898a_0082.pdf", "page": 1, "text": "E. GROB. THOS.R. HAWS. PHOENIX HOUSE, UNDER NEW MANAGEMENT. Commerce Street, VIRGINIA. Restaurant O pen No. 9 0 9 LYNCHBURG, First-class Bar and D ay ano N ight ! tw BatwoasquareTfromthe depot srÄjy We have engaged Mr. ru  - to chef of the Maryland department. g K  H 5 BrcakfastorDinner in the city, 25 cents. _______ -- -------------- For Riding and Driving Horses ---- CALI. ON ---- Thornton  Meadows,  VIRGINIA. Horses and other _jpt attention. We PAMPLIN CITY,"}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "N ight ! tw BatwoasquareTfromthe <mark>depot</mark> srÄjy We have engaged"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "N ight ! tw BatwoasquareTfromthe <mark>depot</mark> srÄjy We have engaged"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1347.84, 1523.33, 1500.11, 1713.6], "bbox_id": "0fbafe14e3", "file": "AppomattoxNewspapers_1892-1898a_0152.pdf", "page": 1, "text": "D ruggist and P harmacist , Farmville, Va., Baler in Drugs and Chemicals, Paints, Oils, . nishes, Garden Seed, Window Glass, Putty, bacco and Cigars. rescriptions accurately filled at all hours. H. GRIGG, Suecesser to Grigg  Elcan, D ruggist and A pothecary , Pamplin City,     Va.  Physicians Prescriptions carefully ppounded at all hours. Dealers in Drugs, baccos, Cigars and Candies. Field and gar- n Seeds a specialty. 6 T HAMLET, D entist , Pamplins, Va. ill be at Appomattox C. H. every Court  Office with Dr. J. H. Abbitt, opposite Depot. OMAS W. ODOlt stable and Tax collector in South Side District. ! Appomattox O. H., Va. Tease meet me at each court, Appomattox S f J m Va., prepared to settle your taxes. And .ill also give prompt attention to ail claims t in my hands for collection."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "ruggist and A pothecary , <mark>Pamplin</mark> City,     Va.  Physicians Prescriptions"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "ruggist and A pothecary , <mark>Pamplin</mark> City,     Va.  Physicians Prescriptions"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [856.22, 265.58, 1016.46, 716.17], "bbox_id": "34af24b686", "file": "AppomattoxNewspapers_1902-1905a_0034.pdf", "page": 1, "text": "D e a r M r . E d it o r  The w eather to-day is w arm an d balm y a n d , f it co n tin u es very lo n g , som e o f ns m ay have an a tta c k o f  sp rin g fever. During the recent freeze our citi zens filled their ice-honses. About one mile from towu there is a nat ural basin covering about two acres, belonging to Mr.Will Garden, which luruishes au abundance of pore, crystal ice for all our village. A large number of wagous loaded with tobacco for Farmville have re cently passed through onr town. Oar town is not on a boom but all of our merchants seem to be do ing a good business, which is better. We greatly need a new depot at this place. The old one is unsight ly and inconvenient. We hope the raiiioad officials will make the im provement this year. Mr. Scott Rice, of Pamplin, was iu onr village last Sunday wearing his usual happy smile. Mr. J. E. Harris, tobacco inspec tor at Farmville, has beer, at home reveral days on sick list, but return ed to Faim ville today. Miss Mattie Walden is visiting her parents and friends near Hurts- ville. Mr. Benj. Abbitt and wife, from near Five Forks, were visitiug at Mr. Hunter Brightwells Sunday. Last Sunday there were good con- gregarious at Olive Branch and Prospect."}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "greatly need a new <mark>depot</mark> at this place. The"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "greatly need a new <mark>depot</mark> at this place. The"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [286.54, 668.76, 426.94, 969.9], "bbox_id": "b9b04dc06a", "file": "TimesVirginian_1976_0460.pdf", "page": 1, "text": "COMPLETES RECRUIT TRAINING DEC. 7 - Marine Private John E. Jamerson, Jr., 17, son of Gwendolyn G. Jamerson of Rt. 1, Pamplin, Va., has completed recruit training at the Marine Corps Recruit Depot, Parris Island, S.C. During the 11-week training cycle, he learned the basics of battlefield survival. He was introduced to the typical daily routine that he will experience during his enlistment and studied the personal and professional standards tradi tionally exhibited by Marines. He participated in an active physical conditioning program and gained proficiency in a variety of military skills, including first aid, rifle marksmanship and close order drill. Teamwork and self-disci pline were emphasized thro- oughout the training cycle. He joined the Marine Corps"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "Jamerson of Rt. 1, <mark>Pamplin</mark>, Va., has completed recruit"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "Jamerson of Rt. 1, <mark>Pamplin</mark>, Va., has completed recruit"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [619.19, 223.21, 785.43, 1298.58], "bbox_id": "734c328b72", "file": "AppomattoxNewspapers_1912-1915a_0040.pdf", "page": 1, "text": "choice Main county road runs through the farm well fenced god water hih state of cultivate three miles of Appomattox Court house. R, F. D and school- wagon pass the farm. The and is good. 110 acres of it in cult vatton, orchard and 25 acres of fairly good timber. The farm is smooth and produces good crops. The dwelling is practically a new house two stories high, with tin roof con taining 7 rooms. There are two frame tobacco barns, a good stable and shed two corn houses, chicken house and oth er out-buildings. A fine well of water at door. Terms one half cash and the balance in two an iual installments. Any one looking for a convenient, well-improved farm close S town would do well to see this property. I62a 129 Acres 1800 This is a tract of land with the main pubi c road running through itabout two miles to Pamplin, a good R. ft. town Splendid new frame house with three large rooms and porch fronting the road. The stable and henhouse are not worth much good garden enclosed with woven wire fence the rest of the land is practically in timber60 acres of it in good stuff, pine and mized oak this timber and two thousand cords of wood so close to station anc market makes this proposition especially attractive as an in vestment. The land lays level and is free of stones and is of a very fine quality. A fine op portunity for a farmer with one or two boys about twenty acres of the tract can be pun in crop with very little prepara tion The timber and wood will more than pay for farm and the terms are 500 balance in seven annual payments. A finely watered farm No. 219 340 Acres 2,400 This tract of land is located 12 miles from R. R. town it is close to school, church, store, shop, mdl, R. F. D., c. The land js smoo h and produces good crops. About 100 acres under cultivation, the rest in very go d oak imber. It is well watered and there are two sets of bui d ngs and two or ebards on the p operty. -The is a five-room log and frame house on one trkcv and a frame 4-ioo  house on the other t act with laige hall, also a splendid, bam 30x16 and other out-build ings. This farm could easii e divided and would make two good homes. Pay 800 cash and tbe rest will be cut up in small annual payments. No. 17, 786 Acres. 30,000 This plantation lies 6 miles from depot in the best farming section of the State. The land is smooth and is easy to work and is very productive. About 150 acres are .fine river low grounds which produces large crops, about 600 acres are in cultivation and grass and about 200 acres in timber of good quality. Well fenced and finely watered for stock. Good orchard of 200 trees. The resi dence is a brick structure of two stories covered with tin and contains 7 rooms. The improvements on the place are worth more than two-thirds of the price of the whole. If you are in the market for one of the finest river plantations in Virginia, one that yields a pro fit, look at this one. Terms, one-half cash, balance one and two-years time."}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "itabout two miles to <mark>Pamplin</mark>, a good R. ft."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "itabout two miles to <mark>Pamplin</mark>, a good R. ft."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [135.59, 432.26, 286.43, 968.09], "bbox_id": "53221e214f", "file": "TimesVirginian_1981a_0273.pdf", "page": 1, "text": "Celebrating 60 years as a supplier of pulpwood to Continental Finest Industries Hopewell nfll is the 0. S. Jamerson and Sons Company. As one of the earliest dealers in Virginias Piedmont, Oscar Jam erson loaded the first pulpwood at the depot in Appomattox in 1981 for the Hummel Ross Company, the predecesor of Continentals Hopewell. mfli. The histoiy of the 0. S. Jamerson Company parallels the development and produc tion of pulpwood in the Virginia Pjpdmont and its impact on the economy, in the area and the concomitant growth of the paper industry. Mr. Jam ersons business grew during the 1980s and he began loading pulpwood, cross- ties, and mine props at several other locations in Virginia. He operated woodyards at Phenix. Lynchburg, Pamplin, Lowry, Prospect and Concord. Phenix was the most active of all these yards. During this time, Mr. Jamerson shipped most of his pulpwood to Hopewell. As close as could be determined from several sourc es, Mr. Jamerson received from 4.00 to 5.00 per unit for peeled pine pulpwood at the beginning. Out of that rate he had to pay labor, loading and stumpage. Railroad sidings and land was used free at that time to anyone who had a .commodity to load. Around 1940, Jack G ant from Boones Mill, Virginia became very active in the crocstie and pulpwood business in the state of Virginia and especially on the NAW Railroad. He and Osear Jamerson went into business"}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "first pulpwood at the <mark>depot</mark> in Appomattox in 1981"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "first pulpwood at the <mark>depot</mark> in Appomattox in 1981"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [300.49, 1192.76, 625.31, 1362.22], "bbox_id": "c2949bcb81", "file": "AppomattoxNewspapers_1912-1915a_0020.pdf", "page": 1, "text": "Beware of Ointments for atarrh that Contain flercury, X8 mercury w ill surely destroy the sense oí mell and completely derange the whole sys tem when entering it through the mucons sur- aces. Such articles should never be used ex- 7 m iles from R. R depot and Jam es River. The land is good and m ost all of it is under cul- There is a stable, to __  p  bouse, and a com fortable 3-room lesidence on the place. It lies along the m ain country road and is  smooth, good landvery pro S TATEMENT OF THE FINANCIAL CON- 1 Gnctive. A good spring is situ DITION OF THE STATE BANK OF I . t b holts and run-  amplin , incorporated , located I tea n ear tn e nouse an a run at pamplin city , in the coUNTY I u ng stream through the farm .  f A ppomattox , state of viR-1 There is good fishing and hunt-"}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "iles from R. R <mark>depot</mark> and Jam es River."}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "iles from R. R <mark>depot</mark> and Jam es River."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2399.77, 1342.3, 2559.34, 1464.3], "bbox_id": "607ccefb1a", "file": "AppomattoxNewspapers_1892-1898a_0036.pdf", "page": 1, "text": "ATTENTION TAX PAYEBfi. I will by at the foilowinj plaoeefoe the purpoeeof rterivlngta TKxie 1  ta  Chap P. O.. Hovembitr fM, Evergreen. 2 - -BHf Pamplin City,  lllehiirtr .f. ttULk. Hixburg. Fore. Store - W I i , Mih. M Deoe arbori Tower HUI. Oaksvllle, Mineral.. Stonewal, ÏSLii JSBf. Ppout Nprlog.  .  YZW ÊmËSm Appomattox Depot. Ji , ftb After which tbe 6 per .cont. poaelty will be Bdfho tickets will bo placed in tjMti jtafeeg"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "fM, Evergreen. 2 - -BHf <mark>Pamplin</mark> City,  lllehiirtr .f. ttULk."}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "fM, Evergreen. 2 - -BHf <mark>Pamplin</mark> City,  lllehiirtr .f. ttULk."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1521.4, 740.87, 1693.15, 1744.91], "bbox_id": "a643a0f26e", "file": "AppomattoxNewspapers_1902-1905a_0474.pdf", "page": 1, "text": "Any farm or business for sale will be advertised in these columns. Nc charge unless sale is made. Write this office for information. No. 108. Price 835 acres, about 4 miles noiiii o West Appomattox. About 1.00 ile trees. Land well adapted  tobacco, corn, and wheat fin sheep farm. 100 actes in wood, tn balanoeopen land. Plenty of thubc for building purposes. Fine tobaec bams, holding 8,000 lbs. of tobacc. Bara an d stable 40x40 ft. can iag house, cow house, chicken house, in bouse. Farm well watered. No. H i. Price  10 A treat of land containing ah u 115 acres, on the N. A VV. Hail near Evergreen, in Appumatto county. On barn on the place, splendid opportunity for any u- This little Arm is oonvenieutly si lifted to churches, schools and mar kei It is a great bargain for tin money. Certainly one-half of hi oleared, the remaining one half stands in second growth wood land. N o iio e. Price i   A most valuable tnut of a . Appomattox County, 7 mil.M  Evergreen on N.  W. IhuJryjt containing 800 acres, with brick a frame dwelling of 6 rooms, outbun ings, etc. About 600 acres in y. E wth timber. Well watered. It, good grazing and crop l u i le to churches, schools, et  No. 310. Price 5400. A small farm of 97 acres, 40 whiob are in timber, situated BucKingham county, 15 miles from N.  W. Railroad. On this place i a good frame and leg house of foui rooms, shingle roof, and outbuild ings- about 100 fruit trees, school and ohuroh facilities and good neigh borhood. Mot. 8,000Easy uriii N ik . 5. Farm of 350 acres, in condition. Produces good grain .. hipping tobasoo. About 5u acr- - original oak, 60 acres in pnje . ohestnnt. Good frame house  rooms, with tin roof. Is in Pn Edward oonnty, three miles fr Pamplin Oity  convenient to si - m ohoels, roller mill, and postnfTu No. A Price ll.iH This land is four miles south wt of Farmville, in Prince lul l, county, and contains 297 it - about ont-balf of which is iu sv- both oak and pine, much of w is a nios building size. There i good tiro-story frame d-vei shingle roof, with five rooms, a Is Within two miles of station ou  N. A w . Bail way church aud soli  house about two miles off and n .. by stores, mill and postotfiee. No. 115. Pries 1,601 This farm contains 824 acres and lies near the village of Ever green in Appomattox county, or the Norfolk A Western Bailway There is a good frame dwelling o one and a half stories, shingle roc f and containing five rooms, .will ail tbe necessary outbuildings About 175 acres are ia y?U9g gro wtL timber. There are about 375 fruit trees on tho plaoe. The lands pro duoea average crops of corn, whea and tobacoo. This place is oonve nient to mill, postoffies, churche engjchqole. Au.  Price 3 - This farm, containing 302 u  u ljoins No. 104, and is in good dition in every way well fen and ready for work. It lies In A pomattox County, about 4 miles iron West Appomattox depot on N.  W Railroad, on the main county road and is easy of ingress and egie. s Owing to its good situation, it i, considered very cheap. There art no buildings on it, but No. 104, de scribed below, ean be bought with it. The two weald make a fine she"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "oonnty, three miles fr <mark>Pamplin</mark> Oity  convenient to si"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "oonnty, three miles fr <mark>Pamplin</mark> Oity  convenient to si"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [156.24, 417.67, 316.98, 799.17], "bbox_id": "0d3d43c373", "file": "AppomattoxNewspapers_1902-1905a_0416.pdf", "page": 1, "text": "Any farm or business for sale will be advertised in these columns. Nc charge unless sale is made. Write this office for information. No. 103. Price 3.750 This farm, containing 302 acrct adjoins No. 104, and is in good con dition in every way well fencet and ready for work. It lies In Ap pomattox County, about 4 miles froir West Appomattox depot on N.  W Railroad, on the main county road and is easy of ingress and egress. Owing to its good situation, it if considered very cheap. There art no buildings on it, but No. 104, de scribed below, can be bought,with it. The two would male a fin sheep farm. Price. 3,000Easy terms. No. 8. Farm of 250 acres, in good condition. Produces good grain an shipping wbasco.  bout 5o acres 1 1 original oak, 50 ncies in pine an- chestnut. -Good frame house of J rooms, with tin roof. Is in Prim Edward oounty, three miles fron Pamplin City  convenient to 8tori sohools, roller mill, and postoffico. Prioe, 2,000. No. 302. Lies in Nelson oomtv, 13 miles from Rockflsh station. 100 acres, 50 in timbers white oak, pop lar, chestnut, and locust. Framed dwelling of six rooms, two stories in height, shingle roof. 300 fruit trees on the plaoe, 200 Albemarle pippins in bearing, 100 winesaps fire years"}, "highlight": {"text": {"matched_tokens": ["depot"], "snippet": "miles froir West Appomattox <mark>depot</mark> on N.  W Railroad,"}}, "highlights": [{"field": "text", "matched_tokens": ["depot"], "snippet": "miles froir West Appomattox <mark>depot</mark> on N.  W Railroad,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.75, 1227.4, 2034.35, 1765.16], "bbox_id": "5555f246ba", "file": "AppomattoxNewspapers_1892-1898a_0067.pdf", "page": 1, "text": "Pamplin City Budget. On a recent visit to Buckingham I noticed that the crops were suffer ing very much indeed for rain. The portion of country that I passed through was at least as dry if not dryer than we are at Pamplin City. It has been nearly three weeks since we have had any rain to amount to anything. I was told while in Buck ingham that about a mile and a-half northeast of Sheppards postoffice there was a farm, and corn on half of it was entirely too wet to work, while the other was burning np. If we do not have some rain in a few days I am afraid the corn crop in this section will be a complete fail ure. Mr. Christopher Atkinson, of Co lombia, S. G., is visiting his consin, Mr. J. EL Hannah. Mias Cora Price returned to Farm ville this week from a visit to her friend, Miss R ath Hannah, of this county.  Miss Katie M. Ford, of Lynch burg, is visiting her annt, Mrs. D. C. S. Morton. Mr. John G. Fisher, of Concord Depots is visiting his friend, Mr. W. D. Thornton. Mr. Chap Jones, of yonr town is here on a visit to his friends, Dr. John Hamlet and R. L. Franklin. Misses Morton and Gilliam, of this county, are visiting relatives and friends in Buckingham. Mr. Goodman Glenn, a yonng man about twenty years old, died at ltis home, Prospect, Va., on the night of the 23d inst., with typhoid fever. Mr. Glenn was relief operator on the Norfolk and Western Railroad, and the son of one of Prince Edwards"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "<mark>Pamplin</mark> City Budget. On a"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "<mark>Pamplin</mark> City Budget. On a"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1321.46, 1540.38, 1482.22, 1640.98], "bbox_id": "8185ff6122", "file": "AppomattoxNewspapers_1892-1898a_0136.pdf", "page": 1, "text": "17 H. GBIGG, i au Successor to Grlgg A Eloan, D r u g g ist an d A po thecary , Pamplin City,     Va. I Physicians Prescriptions carefully I a t hours. Dealers in Drugs, a n,.QCCOi9 d s a rs and Candles. Field and gar den Seeds a specialty. TR. h a m l e t ,   D en tist , Pamplins, Va. a t Appomattox C. H. every Court the Depot6 r  H. A hbitt, opposite"}, "highlight": {"text": {"matched_tokens": ["Pamplin"], "snippet": "d A po thecary , <mark>Pamplin</mark> City,     Va. I Physicians"}}, "highlights": [{"field": "text", "matched_tokens": ["Pamplin"], "snippet": "d A po thecary , <mark>Pamplin</mark> City,     Va. I Physicians"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
