{"document": {"bbox": [1277.46, 420.59, 1380.14, 479.37], "bbox_id": "fe76cd0a0c", "file": "AppomattoxNewspapers_1954-1955a_0086.pdf", "page": 1, "text": "zine or arsenalTublick c ton Parish Church and colonial craft shops - --- - auvjIS. J. Neville McArth School Services for v. iam sburg,, reports that"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "zine or arsenalTublick c ton <mark>Parish</mark> Church and colonial craft shops - --- - auvjIS. J. Neville McArth School Services for v. iam sburg,, reports that"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "zine or arsenalTublick c ton <mark>Parish</mark> Church and colonial craft shops - --- - auvjIS. J. Neville McArth School Services for v. iam sburg,, reports that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1996.81, 201.65, 2158.16, 478.5], "bbox_id": "a2aa9d7698", "file": "AppomattoxNewspapers_1892-1898a_0409.pdf", "page": 1, "text": "Young PillarsMessrs. Cross am! Staples. Mrs. Nannie Page, of Lynchburg, has been witli her mother, Mrs. Wharton, during her illness. Mr. Wm. Price hs been quite ill for more than a week with catarrhal fever, but is now much better. The unknown, Bapto-Methodist passon and Holy Land Lecturer drew- very small erdwds aud still mailer receipts at this place. The Epworth League, of Bethle ham Methodist Church, will hold its egular session next Friday evening ind afterwards will assemble fort nightly on Sunday eveniugs at 8 oclock. Rev. Mr. Parish lectured before the B. Y. P. U., of Mt. Vernon, Baptist Church last Sundav evenjng, Q uid N unc . May 17, 1897 ."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "8 oclock. Rev. Mr. <mark>Parish</mark> lectured before the B."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "8 oclock. Rev. Mr. <mark>Parish</mark> lectured before the B."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1987.9, 1106.59, 2161.18, 1782.38], "bbox_id": "a83d5b7671", "file": "AppomattoxNewspapers_1892-1898a_0239.pdf", "page": 1, "text": "Yonr correspondent met a gentle-1 man yesterday who gives the follow- ing account of a most Singular evi-  deuce of intelligence on the part of  a horse belonging to K. L. Moore, of  this parish. The horses name is Dixie, and Moore raised him from a colt and is much attached to the animal. During the spring of 1894, Dixies knee was hurt while em ployed in repairing levees, and for some weeks thereafter he was not able to work at all and was allowed j to run loose in the pasture and about the place. One morning, when the hands were all in the fields at work and Moore himself was riding after them, they heard a violent ringing of the big plantation bell back at the house. Thinking something dreadful had happened to his wife or children, perhaps, Moore pout spurrs to his horse aud, calling to the hands to follow, galloped np to the house. When he got there he found Mrs. Moore and the children safe and sound aud very much amused at old Dixie,who bud managed to open the yard gate and was pulling on the bell-rope like a crazy thing. All their efforts to drive the horse away had been in vain he only continued to ring the bell more loudly. Moore began to suspect that Dixie might know what he was about after all, and went out to investigate. When the horse saw his master he let go the bell-rope and ran off to ward the pasture, looking back and tossing his head at every step, as if to say, Come on 1 Moore soon saw that something unusual had occurred and followed after Dixie as fast as he could. The horse made straight for the levee at the lower end of the pasture and stopped short under a _ A COllUUWWU ViCC When Moore came up, what was his astonishment to see a little break in the levee,with the water trickling through. Quickly summoning the hands the breach was soon healed. Bnt for Dixies timely . warning, however, the levee would have gone and the whole place wonld have been overflowed."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "L. Moore, of  this <mark>parish</mark>. The horses name is"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "L. Moore, of  this <mark>parish</mark>. The horses name is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1576.28, 679.9, 1741.53, 1171.87], "bbox_id": "aeb2749f37", "file": "AppomattoxNewspapers_1926-1933a_0226.pdf", "page": 1, "text": "yhruches present- Dr. Brumfield, Dr.- Farmer .nd Mrs. Lucy have been visit- ng the school here. They gave he toxin anti-toxin to 13 child- en of school age and toxoid o 15 babies- They also gave he typhoid serum to 9 a n d accinated 8 for smallpox. Mrs. Emma Bagby is ill. Misses Rachel, Ruby and Lil ian Ferguson, of Lynchburg, j.ace.   - Mr. and Mrs. Gilliam Mann nd children visited their aughter, Mrs Tom Dickerson, f Cub Creek, last Saturday nd Sunday. Miss Mazie McDearmon, ac- ompanied by her little niece, ranees McDearmon, spent last week at Bellvue on a visit to rer brothers Messrs. Lacy and .Villiam McDearmon, of that place. Misses Willie and Lena fVoolridge visited Lynchburg ast week- Mr. Sam Staples, who h a s jeen quite ill is improving. Mr. and Mrs- Edmond Caw- horn have moved into thei lew home at this place. Mr. Willie Glover and sister, diss Martha, were among the uests of Mr. W. E. Warren, f Pamplin City this week. Mr. and Mrs- C. S- McDear- .non left Sunday for Buena Vis- a to attend,the burial of her mnt, Mrs. Parish, which oc curred in Mecklenburg Coun y last Saturday. Mr. Charlie Gunter, visited ais home people at Schuyled ast week."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "of her mnt, Mrs. <mark>Parish</mark>, which oc curred in"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "of her mnt, Mrs. <mark>Parish</mark>, which oc curred in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1145.99, 652.46, 1297.45, 857.31], "bbox_id": "ac9dfe7e07", "file": "AppomattoxNewspapers_1912-1915a_0348.pdf", "page": 1, "text": "Xuroing the Page. A testator, after citing the obliga tions he was under to a, particular friend, bequeathed to him at the bot tom of the first page of his will tea thousanddollars, of course, thought the delighted legatee, but on turning the page he found the missing word to be thanks. A similar story is told of an old lady, who, in her last illness, prom ised the priest to leave him a sum of money for parish purposes. When she was dying she asked the priest to come nearer the bedside, and gasped out FatherIvegivenyou Stop, said the priest, anxious to have as many witnesses as possible I will call in the family, and, open ing the door, he beckoned them all in Ive given you, panted out the dy ing woman, a great deal of trouble. j"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "sum of money for <mark>parish</mark> purposes. When she was"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "sum of money for <mark>parish</mark> purposes. When she was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2148.0, 512.66, 2294.51, 936.68], "bbox_id": "dba46ee4ce", "file": "TimesVirginian_1981a_0301.pdf", "page": 1, "text": "worship style is one pf hospitality as compared tp a more traditional, style in older parishes, according to a parish member. The Rev. Walter F. Sullivan, who has visited Appomattox several times, suggested that When choosing a design for the church that the design of the building be in keeping with the historical significance of this area. - ! The church will be located just south of the Appomattox H istoric National Park at intersection of 631 and 627. The architect has designed a simple building with a pitched roof with an exterior of natural western cedar verticle siding. A focal point will be the entrance, which it is hoped will welcome those. who approach with a natural openess. Inside the entrance is a gathering space or commons for people to greet each other before going into the Parish Hall. The Appomattox Catholic Community has shared facili ties with other faiths, particul arly the M emorial U nited Methodist Church. Catholics of this community first gathered together for a Vacation Bible School in the summer of 1974 at the Evergreen Memorial United Methodist Church. With approximately 35 fam"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "parishes, according to a <mark>parish</mark> member. The Rev. Walter"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "parishes, according to a <mark>parish</mark> member. The Rev. Walter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1048.3, 997.68, 1204.15, 1168.18], "bbox_id": "919ab3f350", "file": "AppomattoxNewspapers_1898-1902a_0137.pdf", "page": 1, "text": "wonnded by a young girl of 18, Mary Pro- renzano. Miss Provenzano Is of a family blob attained considerable notoriety in NeflOrleans some years ago, as tbe feud be tween tbe two Italian families, tbe Matran- gas and Provenzanos, in which a number ol lives were lost, led to the Interference of the polioe. It was In this affair that Chief of Police Hennessy lost his life, which was followed by the lynching of the Italian prisoners iu the parish prison. Phillips boarded with tbe Provenzanos. He came home Friday drunk and became abusive. When tbe elder Mrs. Provsnzano protested he promptly knocked her down, and, polling out his pistol, waved It In the air and threatened the whole household. The younger girl, Mary, rnshed at tbe offioer, wrenched the pistol from him, and, turning It on him, Bred twice, inflicting mortal wounds."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Italian prisoners iu the <mark>parish</mark> prison. Phillips boarded with"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Italian prisoners iu the <mark>parish</mark> prison. Phillips boarded with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.71, 841.01, 1624.41, 1731.35], "bbox_id": "4285b798a2", "file": "AppomattoxNewspapers_1892-1898a_0305.pdf", "page": 1, "text": "women wefe seriously injured, ----- James Dewitt, a vile murderer, was hanged In Grayson, Ky. ----- David L Snodgrass, chief justice of the Supreme Court ot Tennessee, was aequltted ot the chargo of shooting John R. Beasley ----- Tho boiler ln the Davidson Brothers sawmill, near Marietta, Ind., exploded with terriflo force. Three were fatally injured. ----- Two suits for dam ages were brought against the B. A O. Rail road receivers in the Circuit Court at Park- ersbprg, W. Va., by Mrs. Lucy Harmon, who changes that a conductor forcibly ejected her children from a train. The Democratic convention of the Seventh Ohio District offered the congressional nomi nation to John W. Bookwulter, who declined I t The trial of Dr. Oeorge Vi. Fraker, of Excelsior, Mo., on the charge of defrauding insuranco companies out of 54,000, was be gun In the Circuit Court of Ray county, Mo. ---- The buildings of the Grove Shaft, Mid lothian mine coal pits, twenty-five miles from Richmond, Va., were burned.-----Thomas M. Carina, an attorney, disappeared from Phil adelphia, and a charge is made that he leaves unsecured debts to ihe amount of over 50,- 000. Unsuccessful operations in real estate are supposed to have Involved him ln diffi culties. ----- Fred Green and Joseph Williams hnve b een arrested at Waldo, Wis., by the sheriff on the charge of having caused the wreck of the freight train, in which three men were killed and two lujured. ----- The Osage Carbon Company had closed all of Its coal shafts in Osage City, Kan., excepting ono, throwing about 500 mep out of work, Monday someone disabled the remaining shaft, No. 24, by exploding n charge of dyna mite in the main entry, and 100 more men aro out of work. ---- .lames Dazzle, colored, was taken from the jail in Bt, Bernard Parish, La., nnd lynched. Ho was arrested for at tempting to assault a white lady near the Poydras plantation- ---- A Lake Shore faBt freight train was wrecked at Toledo, O., by the parting of the air hose. Frank Harris, a tf amp, was killed, and six other tramps seri ously Injured. Newswas received at Vancouver, B. O., of the wreck of the British bark Cadrow Forest  J. E. Blanther Is suspected of having murdered Mrs. Philopena Langfeldt lu San Frauclsco. ----- The large flouring mill and grain elevators of the Alliance Manufactur ing Campany, situated at Torreor, Mexico, were destroyed by fire. The loss Is estimated at 150,000. The mills had recently been equipped with new machinery, and were the largest in Northern Mexico. ----- Destructive forest fires were reported tn West Virginia, Pennsylvania and Massachusetts. ---- -Seven were killed and a number injured by the tornadp that swept the town of Deserve in w e.. ----- The Methodist Protestant Gen eral Conference at Kansas City, Kansas, ap pointed a committee to make a revision ol tho catechism and report to the next general conference. ----- Fire destroyed the Central Opera House, the American House and the residences of William Ralston, M. McDer mott and John Norman, in Dubois, Fa. In Richmond, Mo , Judge Broad.is np- held three of the live indictments against Dr. F. W. Fraker, tho ullegcd Imuranoo swindler, but hold that tho venue should be made in Clay county. The State at once took an appoul to the Supreme Court. E leven bridges wore wnsliod,away and ten miles of track are under water between Hwance and Holdenville, on tho Choctaw, Oklahoma a ,d Gulf Itoad, os a result Of the rfrst nights heavy rains, and no train through. ---- The annual ineellng soolatod Press was belli In Clilongo, and tho reports of the lionrd of Directors showed a steady growth in the momborslilp ot the grent nows service  Dr. Thomas Bonn was shot and seriously Injured by his wife on the street In Chicago. ---- James Stephens was acquitted of murder in Wheeling, W. Vn. ___ Charles KinteJew, an oiler on the teiim- !il Wyanoke, who win badly scalded nt tho tone of tin collision wllh the cruiser Colum bia, died at 8L Vincent s Hospitnl in Norfolk. ___ All audit of the accounts of the city at torney of Itltsltorg shows 425,0011 imno- eounted Tor. ---- A freight train was wrecked it Ismimm IMwa."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "jail in Bt, Bernard <mark>Parish</mark>, La., nnd lynched. Ho"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "jail in Bt, Bernard <mark>Parish</mark>, La., nnd lynched. Ho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.7, 388.84, 1846.06, 1070.07], "bbox_id": "fcaf414f68", "file": "AppomattoxNewspapers_1955-1957a_0548.pdf", "page": 1, "text": "Williamsburg.- Virginias Fourth Estate celebrates 715 years of or ganization when the Virginia Press Association holds its Diamond An niversary Convention here Thurs- day, Friday and Saturday, Ju ly 18, 19-20. More than 300 Virginia newspapermen and women, their families and invited guests will participate in the gathering. Highlight of the convention will be the Parks-Franklin memorial ob servance in tribute to Virginias colonial printer and Americas first Public Printer. Working in coopera tion with the Colleg of William and Mary and the Virginia 350th Anniversary Celebration, the V . P. A . will hold a dinner on Ju ly 19, following which wili be the presen tation of an award to the Ameri can adjudged the outstanding champion of freedom of informa tion and the never-ending battle for the peoples right to know. Nominations for the recipient of the award have been received from throughout the United States. Pre sentation will be held in Phi Beta Kappa hall. The recipient, whose name has not been disclosed, will be present ed a solid silver miniature of n_ colonial press. The press, fashioned of five .pounds ocf silver, was de signed and executed by William de- Mjaltte, Colonial Williamsburg silver smith who made the Freedom Bell presented to Sir Winston Churchill T8 months ago in recognition of his championship of freedom. Cost of the silver press minia ture was borne by most of the daily and weekly newspapers in Virginia. Speaker at the dinner will be Raymond Blattenberger, United States public printer and head of the government printing office in Washington, and Don Whitehead, chief of the Washington Bureau of the Nhw York Herald Tribune, and former Associated Press corespon dent who won two Pulitzer prizes for distinguished reporting. Miss Marguerite Osborne, Edi tor of The -Virginia Gazette, is chairman of the V . P. A . Awards Committee, Ralph K . T . Larson, managing editor of the Norfolk Virginian-Pilot and a member of the award committee, will preside at the dinner. The invocation will be given by the Rev. Cotes worth Lewis, rector of old Bruton Parish Church in Williamsburg. Alvin D. Chandler, president of the College of William and Mary, will deliver the address of welcome."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "rector of old Bruton <mark>Parish</mark> Church in Williamsburg. Alvin"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "rector of old Bruton <mark>Parish</mark> Church in Williamsburg. Alvin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1802.43, 1253.94, 1966.79, 1458.54], "bbox_id": "0fca1fe40f", "file": "AppomattoxNewspapers_1912-1915a_0358.pdf", "page": 1, "text": "William C. Brown Bishop-Coadjutor. After some debate as to the advisa bility of going outside the State and country to select a man, the Rev. Wil liam Cabell Brown, D. D., missionary to Southern Brazil, was unanimously elected by the Episcopal Diocesan Council of Virginia to be bishop-co adjutor. In opposition to him were placed the names of the Rev. W. A. R. Goodwin, D. D., formerly rector of Bruton Parish ChArch, Williamsburg, and now rector of a church in Ro chester, N. Y. the Rev. Thomas C. Daret, rector of St. James Church the Rev. W. H. K. Smith, of South Carolina, and the Rev. W. D. Smith, D. D., of Winchester. Dr. Smith with drew himself from candidacy, and the others were voted upon. Dr. Brown re ceived a majority vote on the first ballot, and was formally declared"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "formerly rector of Bruton <mark>Parish</mark> ChArch, Williamsburg, and now"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "formerly rector of Bruton <mark>Parish</mark> ChArch, Williamsburg, and now"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [280.3, 1676.13, 440.62, 1807.48], "bbox_id": "712cc664b6", "file": "AppomattoxNewspapers_1902-1905a_0244.pdf", "page": 1, "text": "Whitaker Wrights Burial. London B y Cable.The body of W hitaker W right was buried in Wit- 3 ey Parish Churchyard after a brief ser-  ic t at the graveside by the Vicar of Y Y ilky. Besides the relatives and a nnher of friends, the bulk of the pop-  of fee village, which is in iMimiBiTi- turned out in a drenching i f e to see tbe last of the remains o f feear squire. Tbe deceaseds mam aad two daughters were the prin- capoi mourners. Tbe willow was too ill fea -r d H er wreath was inscribed X aaaa has broken-hearted widow"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "in Wit- 3 ey <mark>Parish</mark> Churchyard after a brief"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "in Wit- 3 ey <mark>Parish</mark> Churchyard after a brief"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1718.91, 907.71, 1885.55, 965.01], "bbox_id": "72c29d1c37", "file": "AppomattoxNewspapers_1952-1954a_0098.pdf", "page": 1, "text": "While in college, Mr. Tucker was an active member of Brutan Parish, serving as a member of the choir, and as president of the Canterbury Club, the national college organiza tion of the Enisc A n   Church"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "active member of Brutan <mark>Parish</mark>, serving as a member"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "active member of Brutan <mark>Parish</mark>, serving as a member"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2051.68, 370.16, 2216.81, 633.61], "bbox_id": "e21a3c49f9", "file": "AppomattoxNewspapers_1905-1912a_0396.pdf", "page": 1, "text": "where there is a training school for colored men who desire to preach. The leaving the State by two such well known and useful men will be a great loss to the Pre 8 b terian Church un less their places can be prom pt ly filled. A correspondent of some Southern paper seems to have started a story saying th at Miss Celeste. S. Parish, who did such fine work at the Farmville Norm al College and at the Randolph-Macon Wo m ans College, had engaged to sell her brain to a physiologi cal laboratory. Miss Parish says, or is quoted as saying,  I never sold my brain or was asked to sell it. The whole paragraph is an ignorant and"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "at Miss Celeste. S. <mark>Parish</mark>, who did such fine"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "at Miss Celeste. S. <mark>Parish</mark>, who did such fine"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2045.99, 368.16, 2376.02, 681.56], "bbox_id": "0adbb5c6f8", "file": "AppomattoxNewspapers_1905-1912a_0395.pdf", "page": 1, "text": "where there is a training schoo for colored men who desire to preach. The leaving the State by two such well known and useful men will be a great loss to the Pre8b terian Church un less their places can be prompt ly filled. A correspondent of some Southern paper seems to have started a story saying that Miss Celeste. S. Parish, who did such fine work at the Farmville Normal College and at the Randolph-Macon Wo mans College, had engaged to sell her brain to a physiologi cal laboratory. Miss Parish says, or is quoted as saying, I never sold my brain or was asked to sell it. The whole j paragraph is an ignorant and il _1 _ ___ . . . 1 ... j. f ... , 0 I naif a crop of corn and tobaooo silly distortion of very ordinary Jmaje r 1 occurrences. Miss Parish has j _ _ don much good in educational ever ta dl t,T L  t n .  linos by tho use of her brain , hJ but M thi, ,m."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "that Miss Celeste. S. <mark>Parish</mark>, who did such fine"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "that Miss Celeste. S. <mark>Parish</mark>, who did such fine"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2218.06, 547.47, 2400.79, 1843.62], "bbox_id": "835f28df6c", "file": "AppomattoxNewspapers_1954-1955a_0023.pdf", "page": 1, "text": "What Alexander and Lilbourne Patteson had in mind was to build up a great stage coach business. They never dreamed that the Tavern they built at Clover Hill, in 1819, would become the museum of relics of a great peace for a nation re united after four years of bitter internacine war. Clover Hill Tavern is the oldest building at the Appomattox Court House National Military Park. It has just been restored and houses the National Park Service Museum . . . a museum now displaying as a late addition the famous Guillaume paint ing of the Surrender of Gen. Robert E. Lee to Gen. U. S. Grant, April 7, 1865. Another new feature is an electric map, showing just where the great events of history occured here. Two brothers, Alexander and Lil bourne Patteson, opened a stage coach line from Lynchburg to Rich mond in 1811. At that time the im mediate area at what is now Old Appomattox Court House was a part of Prince Edward County, Appomat tox County not having been estab lished until 1845. In 1814 the Pat teson brothers purchased 206 acres laying near the north branch of the Appomattox River from one John B. Sadler. The land was valued at 157.89. In 1819 they built the Clover Hill Tavern, and the property zoomed to a value of 7,890. There is quite a story about these Patteson -brothers. A 208 page In formal History of the Virginia-Ken- tucky Pattesong in Illinois, Their Forbears and Their Kin by Ethel Marion Smith, traces the Patteson ancestry back to 1680. The first Pat teson entry in St. Peters Parish Reg ister in Eastern Virginia, shows that one Thomas Patteson came over from England in 1680 and settled on what is known as Roxbury Plan tation. Thomas Patteson had five sons Thomas, Edward, David, Alex ander and Geofrge, The next name to look for was Obfcdiah Patteson, who the St. Peters Parish Register says was born in 1750. His second son was named Littleberry . . . and father and son, Obediah and Little- berry took up land patents in this section in 1782. Records exist that show! that Obediah Patteson paid taxes on 800 acres of land in Camp bell County from 1782 through 1791. Littleberry Patteson was born in New Kent County in February, 1754, married in 1782 and died June 23, 1827. He fought in the Revo lutionary War. He is known to have paid taxes on land in Buckingham County from 1793 to 1814. He married Matilda Smith. Lilbourne and Alexander, build ers of Clover Hill Tavern, were sons of Littleberry Patteson. They owned Clover Hill Plantation, under a deed dated November 25, 1814. Alexander Patteson died in 1836, and his fam ily moved to Kentucky. Family rec ords show that the family was prom- ient. David Patteson of Chesterfield, Jonathan of Lunenburg, and Charles of Buckingham represented their re spective counties in the Virginia Convention of 1788 to ratify the United States Constitution. A stage coach line was a great thing 150 years ago. Clover Hill Tavern was a grand conception at a time when Americans were fan ning out from the Atlantic Coast and moving Westward. The Clover Hill Tavern remained in the hands of the Patteson family until Aug ust 8, 1839, when it passed to John Raine. It was transferred to Hugh Raine in 1842 for the sum of 3,- 200, and again passed to Samuel McDearmon in 1845. McDearmon, a great leader in the early growth of this section and one of the top citizens of his time, added many outbuildings and improvements to the Tavern. However, he sold the property to Samuel Glover in 1854. The foundation lines of this store are today readily apparent as a de pression in the ground between the Tavern and the Ferguson home, re cently used as Park Service office. About the year 1859, Glover transferred his holdings to Wilson Hix. The holdings at that time con sisted of lots 16 and 17 in the vil lage of Appomattox Court House and contained the Tavern and its outbuildings. Hix operated the prop erty as a hotel all through the Civil War period. It was yvritten up in the New York Hearld in April, 1865. It was referred to as Glenns Hotel and was used as the office of the paroling officer. Gen. Sharpe. In 1880, it was transferred from the estate of Wilson Hix to Edward G. Hix and included lots 11, 17, 18 and part of lot 16 in the village. The ownership continued to change hands until finally resting in the Continued on Page Eight"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "entry in St. Peters <mark>Parish</mark> Reg ister in Eastern"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "entry in St. Peters <mark>Parish</mark> Reg ister in Eastern"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.55, 498.59, 1583.16, 562.04], "bbox_id": "bef242d737", "file": "AppomattoxNewspapers_1915-1918a_0430.pdf", "page": 1, "text": "Wednesday the rector Jndes brought himself and oHorn back to his parish, days Elinor had hardly fnfeaten. Never once had she Vs room, but always, day _ t, sbe was just outside. When In Wards"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "oHorn back to his <mark>parish</mark>, days Elinor had hardly"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "oHorn back to his <mark>parish</mark>, days Elinor had hardly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.49, 1328.29, 1584.29, 1344.94], "bbox_id": "56a1514a6d", "file": "AppomattoxNewspapers_1915-1918a_0415.pdf", "page": 1, "text": "W ard  parish"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "W ard  <mark>parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "W ard  <mark>parish</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2020.1, 376.67, 2254.78, 673.27], "bbox_id": "4fbf5604f6", "file": "AppomattoxNewspapers_1922-1923a_0556.pdf", "page": 1, "text": "visited friends at this place last Wednesday. Mr. W. D. Miles has returned to Hinton, W. Ya., after several days stay at his home, Glenmore. Messrs. Charlie Ragland and Parish Moss, of Lynchburg, have been down the past week hunting and fishing. Miss Lillie Ragland is at home I this week. I Mr. Percy Omohundro visited the Hill City last week. Mrs. E. P. Robertson and little I son, of Nelson county, spent the that they were!day at Omohundro Sunday. M issGs Louise and EsBie Omohuu-1 dro and Mary Kyle are anticipating I a delightful trip to Greenway on Thanksgiving to attend a birthday J party given by Miss Mary J. liar-1 low. The wedding bells are ringing around Omohundro. Now readers dont get impatient."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Messrs. Charlie Ragland and <mark>Parish</mark> Moss, of Lynchburg, have"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Messrs. Charlie Ragland and <mark>Parish</mark> Moss, of Lynchburg, have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [741.58, 372.63, 927.9, 712.92], "bbox_id": "e7408a9727", "file": "TimesVirginian_1984a_0079.pdf", "page": 1, "text": "Virginia, being Dale Parish, in Chesterfield County where his lout spoken American sympathies got bini into trouble with the authorities along about 1774. It seems he had been in court before, rin the charge of using hymns , and poems instead of the Psalms of David in - his church services. He did, however, dear himself in the eyes of the higher-ups in the Presbyterian Church and the law before besoming pastor of Walkers Church. Following the pastorate of McRob- ert, there was a long period, during which Walkers Church is listed as vacant or as being supplied by various ministers who were never actually pastor of the church. Possibly, for that reason, the church did not grow but actually declined in membership. Then in the period between 1787 and 1788 something happened, a great revival took place. The Rev. Drury Lacy, was trustee and acting president of Hainpden- Sydney College, moderator of. the General Assembley of thè Presbyter ian Church in 1809 ài Philadelphia and a powerful man. He played a great part in the revival resulting in growth.and change. ! 1"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Virginia, being Dale <mark>Parish</mark>, in Chesterfield County where"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Virginia, being Dale <mark>Parish</mark>, in Chesterfield County where"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [316.53, 778.05, 476.11, 947.6], "bbox_id": "9afdd42cbf", "file": "AppomattoxNewspapers_1905-1912a_0523.pdf", "page": 1, "text": "vicar of the parish in the last 11 days, for which a small charge has been made. Now the people of the district are unable to bear the burden of pay ing even a penny for a meal and are compelled to fail back on charity. In Wales and Scotland and in the Industrial districts of England relief works have been started and soup Kitchens established. There is scarce ly a mining village in Scotland where the children are not being fed by the public authorities. In the English coal fields the people are better off, as the trades union funds are richer and will last much longer. It Is estimated that the miners thus far have lost in wages 26,408,850, be sides the depletion of the union funds."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "vicar of the <mark>parish</mark> in the last 11"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "vicar of the <mark>parish</mark> in the last 11"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1845.35, 662.04, 1998.38, 741.84], "bbox_id": "c304a3ec60", "file": "AppomattoxNewspapers_1915-1918a_0379.pdf", "page": 1, "text": "variety that transmits the germ of the fever, and the only tick that the au thorities are trying to. extermnate the others being harmless to cattle, so far as tick fever Is concerned. And a seasons regular dipping, at Intervals of 14 days, should, In most cases, eradi cate this tick entirely from a parish or section."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "tick entirely from a <mark>parish</mark> or section."}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "tick entirely from a <mark>parish</mark> or section."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.4, 1286.11, 1778.59, 1566.58], "bbox_id": "27b4b403b2", "file": "AppomattoxNewspapers_1902-1905a_0032.pdf", "page": 1, "text": "Vanderbilt, and placed among a stringof superbly bred Hacking mares a t Shelburne Farms, Vermont, where she produced several prize winners, prominent among whom Is Mountain Maid, a frequent winner at New York for her owner, Lewis Wormser, esq. Heroine is herself a prize winner, having carried off several ribbons at Madison Square Garden during the Horse Shows of 1891 and 1892. She Is now a brood mare inthecelebrat- ed Plym outh Hackney Stud of EdenD , Jor den, esq, of, Boston, Mass.  __ , Dam gelt, the sire of Danesfort, and grand sire of HEIDltEK . sold for t.wenty-flve thous and dollarswhen thirteen years old. He was the sire of Matchless, of Londesboro, Royal Danegelt, Rosadorand tìannymede, au or whom were chapions in their day. Denmark, the sire of 4 Danegelt, and Lord Derby 2d., the grandsire of Danesfort. are to the Hackney pedigrees w hat Lexingti-n and Leamington are to tho American race horses no good ones w ithout a showing of thei blood.   l . . . Monarch, the sire of Heroine, and grand- sire of HEIDREK, on his doms side, was probably the greatest Norfolk Hackney stall ion of a half century. I t is said of him th at his foals paid the rent of his parish for a de cade. He sired beside a host of show horses, the champion stallions Fashion and Reality. HEIDREK, is perfectly docile, a charact eristic of the Hackney breed. has fine speed for a youngster, as well as great powers of endurance, aud his get from either high class or common Wbrk mares should make horses admirably adapted to the farm or road. The owners of H 1 IDRBK.do not propose to charge an extortionate fee for his service simply because he is a fine horse, and. bred iihtbe purple, but they are exceedingly an- xionsto improve the stòck Of horses in their vicinity, and to that find, will make the following fee, which, cosidering the breeding ofJHElDREK, they think is very, reasonable, Season.. .. .. .. . ..........................................."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "the rent of his <mark>parish</mark> for a de cade."}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "the rent of his <mark>parish</mark> for a de cade."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [465.6, 1003.78, 652.39, 1658.39], "bbox_id": "d74aaf4673", "file": "AppomattoxNewspapers_1905-1912a_0170.pdf", "page": 1, "text": "UUUVCioaiiuu uwv - w- ------- odemus, who comes to Him by night to ask Him certain question, and the answer is that God so loved the world that He sent His only begotten Son. that whosoever believes in Him shall not perish, but shall have ever lasting life. Let men speculate In the cool, damp prison of Calvinism, and I shall put the sunshine of whosoever opposite It, to say, It matters not how dis tracted men are, I shall point them to these placid words of Jesus Christ, and so take Him and find peace in Him. I feel in coming here this morning that It is a great privilege to stand In this pulpit. It requires but little In formation about this church to find how matters have gone in the parish, I how men and women have gone home  to God so thoroughly equipped and i j provided for that blessed heritage which God has promised. It has been a privilege for you men and women to live in this blessed atmosphere, IMS a great privilege to feel that mystic  union, that spiritual relationship be- tween those on earth and those in I that Paradise where Christ shall set I up His kingdom, and His children will be with Him. And I want to maln- 1 tain the prestige of this pulpit. You i say that is a difficult thing to do. It j is not difficult, If I obtain the prayers and sympathy of those who worship here. Christs process Is a heavenly process, and so the process of reju venation is a heavenly process. I cannot explain to you the coming to gether of the people of a congrega tion. I cannot explain to you how in the taking of this blessed sacrament of the body and blood of Jesus Christ, God Invested the blessed recipient with heavenly grace. I cannot ex plain to you when you are asking a special blessing on the rector who is ministering to you day after day. That Is a spiritit may seem old- fashioned, but that is a spirit of aban don which I possess when it comes to the things pertaining to God. Notnr Ing is paradoxical, nothing Is Incom prehensible to me in the scheme of God. I take the Bible from lid to lid. I take the miracles set forth Ini tne Bible without question. I accept them, in the fulness of my heart, becauf God is not God unless He puts Into these works His own power, His own spirit. His own love. I have seen men sent from tne transcendent heights of splendid man hood down to the dismal depths of degradation. I have seen a lace marred with the marks of sin, and the body heavy with the weight of sin. And I have seen this same Individual rejuvenated with the spirit of God, It Is transm utation of the elements on the individual. It is bringing the whole man into play, according to- Gods direction. I believe that to-day the church- stands forth more glorious than It has ever stood, because the Spirit has been operating In its own way In the. hearts of men. The Spirit now is op erating more than It has since the"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "have gone in the <mark>parish</mark>, I how men and"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "have gone in the <mark>parish</mark>, I how men and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1419.74, 1193.2, 1499.49, 1201.23], "bbox_id": "5146ead195", "file": "AppomattoxNewspapers_1952-1954a_0071.pdf", "page": 1, "text": "UT SPRING PARISH"}, "highlight": {"text": {"matched_tokens": ["PARISH"], "snippet": "UT SPRING <mark>PARISH</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["PARISH"], "snippet": "UT SPRING <mark>PARISH</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.4, 562.61, 2195.16, 818.11], "bbox_id": "c28fe44e3e", "file": "AppomattoxNewspapers_1922-1923a_0208.pdf", "page": 1, "text": "une Tramp. The curse of the man who will not work has always been with us. In Henry VIIIs reign he was not allowed to beg the bread that belonged to hon- ester folk, for a statute was made by which the old and impotent were granted licenses to beg, and anyone found begging without one was sound ly flogged and sent home to his own parish. In this way as many as a hun dred in one day, in Elizabeths time, were sent back to the land. The begging license seems to work well enough abroad, where the row of authorized beggars is a familiar sight outside every church, and where the halt and maimed are seldom seen any where else. The rise of the vagrant in this country no doubt took place after the destruction of the monaster ies, and before any other relief-giving body took their place. Yet, after the queens magnificent gift we can still say with the monk of medieval times, The friendship of the poor makes us the friends of kings.London Chronicle."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "home to his own <mark>parish</mark>. In this way as"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "home to his own <mark>parish</mark>. In this way as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [703.92, 638.43, 852.27, 1208.12], "bbox_id": "d6303dc6f1", "file": "TimesVirginian_1976_0147.pdf", "page": 1, "text": "U D C Meeting The Appomattox Chapter of the United Daughters of the Confederacy met on Thursday, April 15, at 730 p.m. at Farmers National Bank, T ri-. angle Plaza Branch. There were 17 members ip attendance. Pledges to the United States Flag and salutes of the Virginia Flag and the Confederate Flag were led by toe president, Mrs. Lena Eversole. The ritual was read by Mrs. Frances Harvey. Also the Confederate Prayer by Mrs. Harvey. Mrs. Frances Harvey, secre tary, read the minutes of the last meeting which were approved. Mrs. Louise Plunkett gave a report on the memorial fund. Members voted. to donate 10.00 to the Skip Island Memorial Fund, ft  t Mrs. Eversole announced that the 3rd District Confer ence will meet on May 22 at 10 a.m. at the Parish House of the Trinity Episcopal Church, Main St., South Boston Va. Mrs. ucille Fertoll, histo Ian, gaVq an interesting talk on EdmundRuffins. Mrs. C. A. Moore led the group in singing southern songs, closing with Blest Be the Tie That Binds. Delicious refreshments were served by the hostesses Mrs. Wiley Moore,  Mrs. Alton Moore, Mrs. Claude A. Moore, Mrs. H. L. Wilkerson, Mrs. E. J. Hillsman and Mrs. B. Curray Harvey. The May meeting will meet on May 20 at 6 p.m. in the home of Mrs, Helen Gunter for a covered dish supper. Mrs. Tilden Lee, U.D.C Publicity"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "10 a.m. at the <mark>Parish</mark> House of the Trinity"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "10 a.m. at the <mark>Parish</mark> House of the Trinity"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1207.89, 982.46, 1376.42, 1306.36], "bbox_id": "ed36b1d0e1", "file": "AppomattoxNewspapers_1939-1943a_0071.pdf", "page": 1, "text": "U . S. Board Ends Dispute Over Naming of Island A 160-year dispute over the correct name of the island on which the Statue of Liberty stands ended with the announcement by the United States board of geographical names that its correct name is Bedlots island. The New York harbor island has, been called Bedlow island, Red. loe island and Bedloes island since it was owned by Isaac Bedloe between 1667 and 1672. f The geographical names board of the interior department decides dis putes over names and selects-hantos for places heretofore unnamed. Under Secretary Ickes, the an nouncement on the boards work stated, the policy of the board has been to avoid officially naming places and objects after living per sons so that the christening function cannot be used for political - pur poses. Among the 398 decisions handed down in the last year was one con cerning a bayou in Louisiana. The stream, located in Terrebonne parish, should be called Bayou Col- yell, the board decided. It teiM not be called Bayou Qo-tP-HeU,"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "stream, located in Terrebonne <mark>parish</mark>, should be called Bayou"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "stream, located in Terrebonne <mark>parish</mark>, should be called Bayou"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [585.35, 227.48, 731.87, 355.03], "bbox_id": "244549dd7e", "file": "AppomattoxNewspapers_1962-1965a_0544.pdf", "page": 1, "text": "Tyree funeral Funeral services for William Carrington Tyree were conduct ed at 4 p.m. Wednesday, Nov. I 25 at Memorial Baptist Church i in Gladstone by the Rev. Gilbert  Proffitt with burial in Tyree  Fam ily Cmetery. Graveside ser vices were conducted by Odd Fellows Lodge No. 398. Pallbear- j ers were S.P . Parish, J.G .Payne H. C . Christian, Edward Larieu, Burk Smoot and F . T. Banton."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "j ers were S.P . <mark>Parish</mark>, J.G .Payne H. C"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "j ers were S.P . <mark>Parish</mark>, J.G .Payne H. C"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [298.79, 1666.45, 461.07, 1788.5], "bbox_id": "03933fa485", "file": "AppomattoxNewspapers_1912-1915a_0238.pdf", "page": 1, "text": "Two Parish When Flames Sweep Through Edgewood Sanitarium. Govans, Md.Two women lost their lives, a third was so severely injured that she had-to be taken to a hospital and several other persons received in juries when the Edgewood Sanitarium, conducted by Mrs. T. K. Carter, at Govans. was destroyed by fire. About a score of other patients were res cued with difficulty by attendants of the institution and neighbors who came to their assistance."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Two <mark>Parish</mark> When Flames Sweep Through"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Two <mark>Parish</mark> When Flames Sweep Through"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1542.18, 1201.52, 1699.54, 1256.37], "bbox_id": "82df01442a", "file": "AppomattoxNewspapers_1922-1923a_0551.pdf", "page": 1, "text": "Two parish priestsone of Saint Paul, in the Oise, and another of Mag nifies Relgners, in the Vendeeare artists, the former painting pictures and the second using the sculptors chiselTablet."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Two <mark>parish</mark> priestsone of Saint Paul, in the Oise, and another of Mag nifies Relgners, in the Vendeeare artists, the former painting pictures and the second using the sculptors chiselTablet."}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Two <mark>parish</mark> priestsone of Saint Paul, in the Oise, and another of Mag nifies Relgners, in the Vendeeare artists, the former painting pictures and the second using the sculptors chiselTablet."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [620.45, 781.63, 771.87, 975.47], "bbox_id": "7bdf88622b", "file": "AppomattoxNewspapers_1947-1949a_0403.pdf", "page": 1, "text": "Two Minnesota Families Have Marriage Monopoly MINNEOTA, MINN.St. Ed wards Catholic parish has set a matrimonial record. Five children of Mr. and Mrs. Will Gossen have married five children of Mr. and Mrs. Nick Janssen in five years. And theres still time to make the record better. Mr. and Mrs. Gossen, farm ers five miles northeast of here, have 14 children. Mr. and Mrs. Janssen, who retired from their farm here and moved to town, have 12 children. Father Philip Casey has per formed all five marriages and says hed like to officiate at more."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "MINN.St. Ed wards Catholic <mark>parish</mark> has set a matrimonial"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "MINN.St. Ed wards Catholic <mark>parish</mark> has set a matrimonial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1201.2, 1260.9, 1349.71, 1332.55], "bbox_id": "21ee481316", "file": "AppomattoxNewspapers_1933-1936a_0168.pdf", "page": 1, "text": "Two Kinds Five pounds! exclaimed a parish ioner. is that all the squire is giv ing to the church fund? Why, he ought to give at least fifty! Ah, said the vicar gently, I ex pect he forgot the ought!Toronto Globe."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Five pounds! exclaimed a <mark>parish</mark> ioner. is that all"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Five pounds! exclaimed a <mark>parish</mark> ioner. is that all"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [644.66, 820.85, 970.18, 1102.15], "bbox_id": "79987d761a", "file": "AppomattoxNewspapers_1898-1902a_0017.pdf", "page": 1, "text": "Two Darkeys Killed and their Bodies Cremated In the Burning House. Crops Damaged. Last Sunday between 6 and 8 p. m the severest storm ever known in this section came up within the _________ _ twinkle of an eye almost and raged throughout the entire circle of his with fierceness and destruction for acquaintances. He had a smile more than an hour. such as will not be forgotten for a In Roanoke and S a le m s e v e ra l lo n g time, for everybody, and looked churches were demolished, and the with kind feelings flpon all poor peo- frnit crop greatly damaged. pie. He was blessed with a goo At Amherst courthouse the storm constitution and an active and reten- was particular severe, and the rain tive memory. He merely succumed fall very heavy. Mr. Henry Shearer to old age. The funeral, attended who is farming near Amherst, and by the largest congregation ever seen who is well known in this county, by the old inhabitants took place lost a horse by lightning, and his from Bethleham Church in this vil-  a i in iiomatrorl lage, the nextdav, at 3 o clock p. m crop was considerably damaged g -  the 25 000 hills of tobacco .were flooded. Ke  .g  , , ,, , 1 1 life-time friend of the deceased, as- The corn crop was blown down and    q greatly damaged. Houses were .  Rey Mr Parish of this blo vn from their foundations and  aud Dr. Rice of Spani8h Oaks"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Houses were .  Rey Mr <mark>Parish</mark> of this blo vn"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Houses were .  Rey Mr <mark>Parish</mark> of this blo vn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1602.04, 1197.74, 1767.2, 1394.44], "bbox_id": "b404e2f4f7", "file": "AppomattoxNewspapers_1905-1912a_0056.pdf", "page": 1, "text": "tribute money to maintain the roads, remarking that the one he has is quite good enough for its use. In the Isle of Ely Is a little parish witih about a dozen inhabitants that has no rates, as there are no roads or public Insti tutions of any kind and consequently no expenses. Kempton, near Bradford, can prob ably lay successful claim to the dis tinction of being the longest village in the world, as it straggles along the road for a distance of seven miles. Sometimes a village will entirely dis appear, having been built either on the edge of the crumbling cliffs that make part of the coastline, or over an ancient mine. One of the latter class is in Shropshire, and each year one or more of the cottages tumble as the earth , sinks beneath it"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Ely Is a little <mark>parish</mark> witih about a dozen"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Ely Is a little <mark>parish</mark> witih about a dozen"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1130.2, 1496.16, 1264.05, 1689.91], "bbox_id": "977c68cbbc", "file": "AppomattoxNewspapers_1902-1905a_0278.pdf", "page": 1, "text": "Tree Inaide a Churel,. ifg Rosa, Hertfordshire, can bo31 ! church dvhere two fine elms art! ing one on either side of a  3 pied by a member named J01 Mr. Kyrle was a great lover  Ta and especially of elms, of   3 planted an avenue near the 3 One of the trees of this aveal  cut down, and it is supposel offshoots have grown up ia c church at each end of the pe  parish church at Kempsey eon  chestnut tree which in tomb of Sir Edward Wl1 nMd  school children ot the village j sit in the chancel, and it  one occasion their teacher 0 of them eating a chestnut.  he snatched it away and tare hind the tomb, where it too has flourished."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "end of the pe  <mark>parish</mark> church at Kempsey eon"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "end of the pe  <mark>parish</mark> church at Kempsey eon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1442.35, 406.64, 1588.12, 430.29], "bbox_id": "97ae719590", "file": "AppomattoxNewspapers_1918-1922a_0435.pdf", "page": 1, "text": "tq Alleviate Starving Condi tions in Parish"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "tq Alleviate Starving Condi tions in <mark>Parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "tq Alleviate Starving Condi tions in <mark>Parish</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1268.39, 595.01, 1409.49, 627.56], "bbox_id": "f94e80c685", "file": "AppomattoxNewspapers_1952-1954a_0127.pdf", "page": 1, "text": "toratio SI?ent  the Rock n e ? t toration is a monment to the PPt of Brutan Parish. Dr. G d buried in the church. 1"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "toratio SI?ent  the Rock n e ? t toration is a monment to the PPt of Brutan <mark>Parish</mark>. Dr. G d buried in the church. 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "toratio SI?ent  the Rock n e ? t toration is a monment to the PPt of Brutan <mark>Parish</mark>. Dr. G d buried in the church. 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1772.12, 472.6, 1918.07, 748.54], "bbox_id": "553e33ccc6", "file": "AppomattoxNewspapers_1974-1975a_0449.pdf", "page": 1, "text": "Tompkins of Neport News, Jane Forster W acaster of Hattiesburg, Miss., Mrs. A- dolph Haug, William A. Haug, Frank F. Boone, Elizabeth P. G. Boone, William A. Haug, Jr., John Walker Haug, Mr. and Mrs. Wells Darling, grooms sister and her husband. Appomattox guests attend ing the wedding were Mr. and Mrs. William D. OBrien, Mr. and Mrs. Robert Morris, Mrs. Mildred 0. Alvis, Misses Edith and Claudine OBrien, and Mrs. Maruice McGill. A reception following the ceremony was held in the Parish House of the church. Relatives and friends of the bride assisted in serving. For their wedding trip Mr. and Mrs. Boone .drove via the southern route aejoss the United States to reside in Berkeley, California."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "was held in the <mark>Parish</mark> House of the church."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "was held in the <mark>Parish</mark> House of the church."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1838.45, 246.88, 1996.98, 1024.07], "bbox_id": "cf4a403a51", "file": "AppomattoxNewspapers_1902-1905a_0143.pdf", "page": 1, "text": "to cònvihce fGtigrancT that every man hau a soul andthat life was an immortal stair way, up or down! It taught, of a living God and the powers of an endless life. Tt reviewed that standing article of the lief dito at ion, u Justification by faith. It car ried the truth afield and again it lifted the cotters roof till it touched the stars. It trod the bottom of human longing, and while it arraigned sin in fearful terms, it brought the news of hope and joy. No wonder that gut-came with the rain norm the barren land. No wonder that turbid emotion accompanied the flood of feeling. Many things c ways are riot when Satan is casi out. Ahvays such upheaval  .irry stubble upon their currents  sudi- tides swing loose unanchorcd spirits. But par ody is a counting proof of power, and the forces ol eternity were shaking a Decide to its centre. Much was unwelcome when all was unready. What real prophets have not met opposi tion? These men were fidmt out of the synagogues of the establishment. They faced a frqwning world. They knew all indignities. Mobs led by squires and clergy men dragged them through hprse ponds and howled against their lives. Nothing was too foul to fling at them with hand and tongue. Not a man of all the bishop, save Samuel Butler took their part. But despis ing hardships and dangers, thev grew, and upon the church that disowned them thev pfit an indellible mark- Being defamed, they entreated, and they lived to see opin ion change. What a diocese waited this apostolic man John Wesley! He touched two hemis. pheres. Nav. all the ends of the earth, and his hand is stretched oyt still. In 1766 Methodism began in Anrnca. Wesley at his death declared.  The best of all. God is with u. There Ycre then JU 3 of his reacher ,3 in England in the Hniterl States, 198 . Now in Great Britain there are 700 .- 00 communicants, in Canada 330 . 000 . in the United State 6 , 000 . 000 , who recur to that new Penteeot. At length in 1876 Dean Stanley ruveied in Westminster Abbey a tablet with t.he shining profiles of John VVetuey and CbarV. Tardily but at last did a state church-hich in their day knew not the tine of its visitationat test the reffex influence of its prophets and own a work so grandly done! In Jdip Wesley tremendous toil and a rare gift for organization and order and the loftiest spiritual enthusiasm and n sim ple purpose to do one thing were united in the pronorton of genius. Great he was by any test. Time is a stern criterion and by thpt estimate We!ey aurvives as Paul does and Luther and Levo7. He is of thè few 4 who make eras. He bao large sense and system. He wrought wit mighty industry for half a century. No moment was wasted. With a giant energy he preached 500 times a year for fiftv years. And yet with this passioo fo work he had a pure and calm mind. Se f-denying, refined, sweet terprred, considerate, he had the scholars visioo and a saintly heart.  In seventy years. he said, i have nut lost a nights Vep.  I sve all T can and give all I pe.  Make all von ern hv industry, save nil vou can bv cconor4. give all you can bv hberaJity. Thins u was rich to ward God. Peculiarities he. had let small souls count thjm . Strifes there were, luit who caes for the lomn differences be tween Weslev and Whitfield, nnce both preached the everrei of a holy and imme diate decision. Thark God for tftat. good home at Epworth and for that Susannahs sois! Let, 11 all see that, reigion ip not in ru bric and rPe. but in devoted hearts and fives, unsophisticated by the bribes of cus tom. undfMmted by the oppositions of hol low tradition instant to Ferve, tireless to effect regniti, be.ieving God! For one may have all the apparatus of regularity and die  starveling. Power is granted nnlv to hose who w?ll pav its whoV price! Love .is ceHoic hen it. is apostolic and can ut ter WèseyV  AP the world is my parish. The methodical in Gods service are the ?onnuerors.  Oh. let me snv To you WesVvs great text.  Seek ye the T-ord while He may be V r d  call ye epon Him whiY He is near! Emulate such n man! Ami coudewnx Ihe isim cf a totally .surrendered life, imi- lst.e its fefih. It is success. It is trfiimpb. K attainable. Let r.nc quote Wesleyn hymn  G !,V to the winds thy fears Hone and be ìmdismaved God hears tjv ughs and counts thy tears  Cod shall lift up thy head."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "the world is my <mark>parish</mark>. The methodical in Gods"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "the world is my <mark>parish</mark>. The methodical in Gods"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.85, 402.62, 1589.81, 428.77], "bbox_id": "8a608f4c13", "file": "AppomattoxNewspapers_1918-1922a_0434.pdf", "page": 1, "text": "To Alleviate Starving Condi tions in Parish"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "To Alleviate Starving Condi tions in <mark>Parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "To Alleviate Starving Condi tions in <mark>Parish</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1099.7, 1634.81, 1263.92, 1882.79], "bbox_id": "7a42e6c7a9", "file": "AppomattoxNewspapers_1898-1902a_0056.pdf", "page": 1, "text": "TN THB CUEHKS OFFICE OF THE Clii- X CCUT Court of the County of Ruckinham on the 19th day of September 198. Annie E. Perkins and J. F. Perkins her hus- oand.., .................................................... Plaintiffs against Bettie Davis and F. S. Wilkinsons adminis trator and others .............. ....... Defendants The object of this suit is to perfect and quiet the litlc of Annie E. Perkins one o f the plaintiffs to the tract of land in Buckingham county, Virginia, bounded by the CartcrsvilJe Road on the south, on the east by land of SamuelC. Wilkinson, deceased, on the north by Pardee and Terrell land, on the west by Pardee and Lee land and others, containing 45414 acres more or less, w hich was formerly owiied by F. L. Wilkinson, deceased. And an affidavit, having been made and tiled that the defendants Bettle Davis an d ---------- Davis her husband, Emily Parish a n d --------- Parish her husband, Christopher Meyers, Roberl Meyers, Addie Meyers, Mary Meyers, Davy Meyers, uratsford Meyers, Samuel C. W ilkin.on, Fannj A. Wilkinson, Nettie L. Wilkinson, William Wilkinson, Bessie Wil kinson and Henry Wilkinson arc not residents of the State of Virginia, it is ordered that  they do appear here within fifteen days after due publication hereof, and d  what may bc- necessary to protect their interest in this suit. And it is further ordered that a copy hereof be published once a week for foursu. . cessive weeks in the Appomattox and Duck- I inghain T imes and that a copy be poste  at the front door of the courthouse of this  county on the first day o f the next terin of I the county court. A copyTeste P. A. FORBES, Clerk. E W. HUB A it D, p. q. 9-2 4w"}, "highlight": {"text": {"matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> a n d --------- <mark>Parish</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> a n d --------- <mark>Parish</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [743.41, 1341.11, 964.25, 1493.12], "bbox_id": "41aa685721", "file": "AppomattoxNewspapers_1905-1912a_0430.pdf", "page": 1, "text": "tion to ship to any m arket she thinks best a grade of beef steers that will do credit to any m arket In the coun try, and without any quarantine re strictions whatever. The dipping vat has made It possi- j pie for Claiborne parish to reach this i stage of progress, and it will do the  same for other parishes, if we will ! only burry things along Let us I net those public dipping vats go ing! The sooner we get to work, the sooner will we reach the stage of prog- i combination. I res attained by our neighbor In the j __ 1 northern part of the state. And why  shouldnt the capital parish be a lead  er In this Important work?"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "j pie for Claiborne <mark>parish</mark> to reach this i"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "j pie for Claiborne <mark>parish</mark> to reach this i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1894.0, 333.8, 2022.12, 415.1], "bbox_id": "637b059bf8", "file": "TimesVirginian_1980a_0412.pdf", "page": 1, "text": "tion of Holy Cross Attended. Preliminary plans of the future Parish Center in Appomattox were reviewed and discussed. Approximately twenty pa rishioners enjoyed a covered dish luncheon."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "tion of Holy Cross Attended. Preliminary plans of the future <mark>Parish</mark> Center in Appomattox were reviewed and discussed. Approximately twenty pa rishioners enjoyed a covered dish luncheon."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "tion of Holy Cross Attended. Preliminary plans of the future <mark>Parish</mark> Center in Appomattox were reviewed and discussed. Approximately twenty pa rishioners enjoyed a covered dish luncheon."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [637.2, 177.55, 812.36, 768.34], "bbox_id": "f882536690", "file": "AppomattoxNewspapers_1912-1915a_0409.pdf", "page": 1, "text": "tifle thought. The man they described  as the simple parish priest was not moved by the onslaught. He took j the position that the new sect i should not be tolerated. He realized that prominent men in his own fold were among the leaders, and some of them, when brought face to face with the ultimatum of Pius X.. recanted, while others left the church. The effect of this encyclical has been felt in all Europe and in the United States. It came like a bomb. On becoming supreme pontiff there j was of course some real curiosity shown as to the attitude of Pius X. in his relations with the Quirinal. it was flgured in some quarters that the new pontiff was kindly disposed to ward the Italian government, and that  as a result the breach which was i made in the Porta Pia and by which was effected the overthrow of the temporal power of the Pope back in  1870 would be filled in and all differ ences between the Vatican and Quiri nal settled amicably, but Pius X. fol lowed the exampU et by Pio Nono and Leo XIII. He refused to recognize the law of guarantees which had been passed by the Senate and chamber of the Italian Parliament on May 13, 1871, that con cerned the prerogatives of the Holy See and the relations between church and state in the kingdom of Italy. Among the stipulations were The Popes person to be sacred and in- 1 violable, and he be treated with royal honors and that he be given an an nual endowment of 3,225,000 lire, or 022,425, to cover all the needs of the Holy See. This law was not recog nized by Pio Nono or by Leo XIII., and the endowment has been accumu lating annually, it Is said, since the law was passed. Pius X. did not draw on the funds, and he did not take advantage of the assurances of military protection. He shut himself up in the Vatican after the example of his two predecessors and remained a voluntary prisoner. The Pope In 1906 sent a pastoral , letter to the Catholic clergy and laity of certain Roman churches ex- ! isting In Russia, warning them against j countenancing in any way the out-  rages on. the Jews. At that time there was some talk as to why the Pope 1 interested himself thus far in the i Jews. But It was soon explained that I the holy father numbered among his j stanch friends some of the wealthiest"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "described  as the simple <mark>parish</mark> priest was not moved"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "described  as the simple <mark>parish</mark> priest was not moved"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2002.44, 860.49, 2167.14, 954.24], "bbox_id": "1cf6355247", "file": "TimesVirginian_1983a_0212.pdf", "page": 1, "text": "This week at St. Annes The Vacation Church School in coopera tion with the Our Lady of Peace Roman Catholic Christian communi ty is now in progress. Sunday, June 19 Song Practice 900 a.m . Holy Eucharist and Church School 930 a.m. Parish Council 730 p.m."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Church School 930 a.m. <mark>Parish</mark> Council 730 p.m."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Church School 930 a.m. <mark>Parish</mark> Council 730 p.m."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1033.84, 147.14, 1176.28, 243.83], "bbox_id": "dc7926c73d", "file": "TimesVirginian_1976_0117.pdf", "page": 1, "text": "this Mass and there will be a renewal of marriage vows for married couples. April 18 at 930 a.m. Easter Family Mass at Sacred Heart Parish Center in Lynehburg. Bring Easter Breads to share afterwards. April 27 at 645 Prayer and"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Mass at Sacred Heart <mark>Parish</mark> Center in Lynehburg. Bring"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Mass at Sacred Heart <mark>Parish</mark> Center in Lynehburg. Bring"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [172.08, 302.11, 334.52, 1784.78], "bbox_id": "5a281e23a8", "file": "AppomattoxNewspapers_1922-1923a_0432.pdf", "page": 1, "text": "There was a time in the history of Farmville when Lunenburg was one of its best pattens and while the trade from that grand old coun ty, generally called the Free State, has fallen off it is still no mean contributor to our success as a town and we are watching Lunen burg grow with genuine inti rest. The building of the Tidewater railroa 1 through that country has given a new life-thrill to it. Real estate values have greatly increased and the timber interests of the county are attracting wide spread attention. Victoria, the terminous of a division of the road, is build ing rapidly and promises to be a town of considerable size and im portance. There is no good that can come to Lunenburg that Farm ville will not rejoice in. There 117 students at Hampden Sidney this session as against 72 two years ago and 82 last year. The number cf new students is 79 as against 22 two years ago and 43 last year. Of the whole numbi r enrolo 1 this year Virginia sends 82 West Virginia 2, Tennessee New Jersey, 2, while Florida, Ill inois, Maryland, Mississippi and North Carolina send one each, and Japan sends one. This is dr,ing well and Richmond should let well enough alona. A library for Farmville may be reckoned among the assured facts. The mothers of our town are be hind the movement and that means it must go. At a recent public meeting which was held in the in terest of the project representative business men made enthusiastic speeches in its. advocacy and noth ing remains but to get the books and go to reading. McCauly says, reading makes a full man so that we will have two pl aces at which our people may get fu ll li brary and dispensary. The Normal girls not only en joy the splendid faculty of 26 of gifted men and women. Mrs. Brooks, the accomplished lady mat ron, who has been kept from the school for sometime, is on duty again. The Episcopalians o 1 our town are still without a rector, though the pulpit of the church has been well filled of late. Mr. Garnett, our new postmaster begins to look very much at home in the new position. With  pleas ant duties to perform and a 2000 salary to draw with unvarying reg ularity most of us would feel com fortable in the cozy official nest. With one exception, that of star route mail carriers, Uncle Sam is a good pay master. The old gentle man is especially kind in his deal ings with his day laborers, who work only 8 hours and have 16 for play and sleep. I have always thought that was ideal division of the day. Farmers who rise at 3 a m and retire at 8 p m wont agree with me however. The health of Mrs. Tom Clark is far from good, and she may go to a sanitarium near Asheville, N. C. for treatment. Ur. J, W. Gills has elaborately furnished offices over the store room of Messrs. Verser  Son. He is gaining in popular favor day by day, and is not only learned in his profession but knows how to meet with the people. A cheerful, com panionable, family physician is better than physic. Mr. Vernon Paulette went west not in search of a wife, but he found one and telegraphed the fact to his Farmville friends. A happy greeting awaits them on their ecin- ing to the old home, and the old friends. Our merchants and milliners are stocked up for spring and summer and stand waiting for customers. Mrs. R. S. Paulette and sister, Mrs. Bettie Venable, of Hampden Sidney, have been visiting in Wash- ngtrn and Baltimore. Mrs. Dr. Messenger is on a visit to home folks in Iowa. Mrs. Wallace Burnette, of Wash ington, vho has been with us re gaining her strength after practical illness, will return to her home ou the 1st of April. Prospective sweet girl graduates are already excited over diplomas, flowerB, addresses, white dresses and farewells. May their brightest hopes be all realize l. And yet tha broader field before them is not a flower-garden but a work-field Bishop Tucker paid his first visit to this parish recently and has left behind him a pleasant memory. I wonder that Farmville ever abandoned holding her annualFairs"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "first visit to this <mark>parish</mark> recently and has left"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "first visit to this <mark>parish</mark> recently and has left"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2268.17, 770.1, 2419.95, 1028.54], "bbox_id": "8ccd551610", "file": "TimesVirginian_1976_0285.pdf", "page": 1, "text": "then placed the cornerstone which contained a brief history of the church, a register of all in attendance, names of church members, copies of the ! program and the building contract. Lunch was served on the church grounds -following the ceremony and was attended by church members, former members, and  friends from Appomattox and elsewhere. The new building is being named Rose Hall after Rt. Rev. Dsyid Rose, current Bishoo of the Diocese of Southern Virginia ad will be used as, a parish il snd feducinohailfaiimtji St. Annes Episcopal Church, originally consecrated in 1875 at Five Forks in Prince Edward County, was dismantled and moved to Appomattox in 1949"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "be used as, a <mark>parish</mark> il snd feducinohailfaiimtji St."}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "be used as, a <mark>parish</mark> il snd feducinohailfaiimtji St."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1410.22, 755.28, 1559.12, 979.13], "bbox_id": "b742f6ff24", "file": "AppomattoxNewspapers_1949-1952a_0192.pdf", "page": 1, "text": "The World is My Parish inHERE is another reason why T Paul is important. It is not too  r fay that if it had not beer for him, there never would have been any Christianity, as a world- religion It would have died as Jewish sect. .. What the history of the world would have been in that rase God only knows. But al- Stfh our so-called Christian era is still not exactly Chris tian, it Is vastly different from what it would have been II Christianity had been no more say than Essenism, a word you would have to look up in the enclycopedia, an antique and forgotten sect. To many un-named Christians, but to Paul more than any other one person, we owe the fact that ours is a religion with a world-outlook."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "The World is My <mark>Parish</mark> inHERE is another reason"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "The World is My <mark>Parish</mark> inHERE is another reason"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [996.69, 537.9, 1163.2, 1228.49], "bbox_id": "d290615e9a", "file": "AppomattoxNewspapers_1949-1952a_0382.pdf", "page": 1, "text": "The We-Feeling G OD INVENTED the family that is what is meant by calling it a  divine institution of Gods plan foi dren that he learn how to live, not in a lonely cell by himself, not as a lonely wolf fighting against a l l comers, but as a member of a famiiy. The f a m i l y is enormously impor tant in many ways. There is room to speak of only one of them. Students of personality have found a new but simple name for something that every one ought to have, but not every one does have it is called the  we-feeling. The lone-wolf type of person never really thinks we. His mind divides the world into two armed camps on the one side is I and on the other side is every one else. He goes through life assuming that nobody is for him, nobody is with him, and he in turn is for no body and with nobody. His  hand is against every man, as the Bible says. Even if he teams up with others for a while, he will double- cross them if he thinks he will make something out of it. He is your typical criminal, anti-social as teachers and sociologists call him.    What It Means to Grow Up fH IL D R E N usually begin l i f e  without m u c h , we-feeling, if any. They dont naturally share their toys or their dinners or any thing else. They grab all they can and they dont like to be grabbed from. The process of growing up really growing up, not merely get ting older and biggeris a process ef developing a healthy we-feeling. Nearly every one develops this to some extent, of course but when some people say  we they dont mean very many. We have all heard of the man who prayed Lord, bless me and my wife, my son John and his wife. Us four, no more. Amen! He doesnt make a very good citizen. But as the  we -circle grows wider and wider we get a more and more publie-spirited and service- minded citizen, till at the high point of the we-feeling we see a man like St. Paul who calls himself a debtor to all men, or like John Wesley who said, The world is my parish, or a modern inter national citizen and statesman such as John R. Mott."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "The world is my <mark>parish</mark>, or a modern inter"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "The world is my <mark>parish</mark>, or a modern inter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [995.31, 256.12, 1139.61, 539.71], "bbox_id": "08c777e4c5", "file": "AppomattoxNewspapers_1974-1975a_0336.pdf", "page": 1, "text": "The wedding of Miss Lillias Ann Emery to Mr. James Elliott Shirey took place at Zabriskie Chapel, Immanuel Church-on-the-Hill, Alexandria, Virginia May 24, 1975 at four oclock in the afternoon. Reverend William L. Dols, Jr., Rector of the parish. He was assisted by the Reverend Rodney L. Caulkins, Rector, St. Margarets Episcopal Church, Woodbridge, Virginia. The bride is the daughter of Mr. and Mrs. George F. Emery, Sr., of Arlington the groom is the son of Mr. and Mrs. Horace W. Shirey, of Spout Spring. Given in marriage by her  father, the bride wore a candlelight gown trimmed in I lace and seed pearls. The train flowed from an empire bodice. She wore a cathedral mantilla of Brussels lace and carried a I cascade of white butterfly orchids and sweetheart roses."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Jr., Rector of the <mark>parish</mark>. He was assisted by"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Jr., Rector of the <mark>parish</mark>. He was assisted by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1101.62, 438.19, 1271.03, 621.73], "bbox_id": "093c66b718", "file": "AppomattoxNewspapers_1952-1954a_0080.pdf", "page": 1, "text": "The Virginia Travel Council points out that through the years, from the proceeds of Historic Garden Week in Virginia, the Garden Club of Virginia has restored the grounds of Stratford, birthplace of Robert E. Leo the grounds of the Manse, birthplace of Woodrow Wilson the Rolfe Property, known as Smith Fort Plantation, a wedding gift to Pocahontas on her marriage to John Rolfe Bruton Parish churchyard in Williamsburg historic Christ Church churchyard in Middesex Fincastle churchyard placed a permanent planting about the monument of Mary Washington in Fredericksburg and planted the Lee Chapel Memorial Garden in Lexington."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "to John Rolfe Bruton <mark>Parish</mark> churchyard in Williamsburg historic"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "to John Rolfe Bruton <mark>Parish</mark> churchyard in Williamsburg historic"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1868.68, 453.64, 2009.87, 526.77], "bbox_id": "cc3a38a6e0", "file": "AppomattoxNewspapers_1971-1973a_0473.pdf", "page": 1, "text": "The Virginia House of Burgesses in 1632 passed the first act in American history establishing a system of road administration. The act specif ied that the Governor and cer tain other officials - or parish-"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "tain other officials - or <mark>parish</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "tain other officials - or <mark>parish</mark>-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1184.15, 708.43, 1325.05, 893.61], "bbox_id": "09114af0f7", "file": "AppomattoxNewspapers_1962-1965a_0582.pdf", "page": 1, "text": "The Vestry of St. Anns Epis copal Church, Appomattox, held its first meeting of the new year on Tuesday, Jan. 12. Officers elected for the coming year in clude John A. Mathews, M.D., Senior Warden and Robert L. Austin, Junior Warden. A. E. Hopkinson and William S. Jones were re-elected treasurer and re gister, respectively. A rising vote of thanks was given R. J. Janat- ka for his services as Senior Warden in past years. It was an nounced that a parish supper for adults only would take place Tuesday, Jan. 19 at which time plans for the proposed rectory would be discussed."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "an nounced that a <mark>parish</mark> supper for adults only"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "an nounced that a <mark>parish</mark> supper for adults only"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1731.32, 324.4, 1875.09, 979.73], "bbox_id": "2596cea6bc", "file": "AppomattoxNewspapers_1971-1973a_0479.pdf", "page": 1, "text": "The Seventy-Seventh An nual Convention, Virginia Div ision of the United Daughters of the Confederacy was held in Williamsburg, Virginia, on October 3rd, and October 4th, at the Williamsburg colony Motor Inn. A Memorial Service was held in the Bruton Parish Episcopal Church honoring the deceased members of the entire Virginia Division. The total deceased members were 105, and as each name of the deceased member was called a white carnation was placed on a green wreath which was accepted by Mrs. Russell B. Frost, President of the Vir ginia Division, and was placed at the Confederate Monument in the church yard. Tuesday was Historical night and a Grand March honored the Virginia Division and General Officers. Wednesday was Chapter Presidents night, beginning with the Grand March of Presidents of all Chapters, at which time the Historians and Recorders of the Crosses of each Chapter were also recognized. The Appomattox Chapter was awarded two prizes. One, a 5.00 prize, was awarded the local Chapter for enrolling the second largest number of new members in the Virginia Div ision. The - ond, a 10.00 prize, was aw. .ed Appomat tox Chapter for giving the largest number of books to the library. Members attending from the Appomattox Chapter of the United Daughters of the con federacy were Mrs. Albert Zastrow, Chapter President Mrs. Johnnie Cyrus and her daughter, Dale Mrs. Lena Eversole, Second Vice-Presi dent Appomattox chapter Mrs. Cliff Plunkett, Virginia Divison Registrar and Mr. and Mrs. Orie Schaubach of Crewe, Virginia. 1 t-"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "held in the Bruton <mark>Parish</mark> Episcopal Church honoring the"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "held in the Bruton <mark>Parish</mark> Episcopal Church honoring the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [718.81, 359.41, 891.83, 771.39], "bbox_id": "0df2d03938", "file": "AppomattoxNewspapers_1954-1955a_0269.pdf", "page": 1, "text": "The rural ministers summer school, one of the oldest continuous leadership training programs con ducted by the VPI Agricultural Ex tension Service, will be held at VPI July 4-8. Co-sponsor of the program, which is entering its second quarter cen tury this year, is the Rura Church Department of the Virginia Council of Churches. Dr. D. R. Fessler, rural sociologist at VPI, say3 the faculty for the 1955 school is one of the most not able in recent years. The principal morning speaker will be Dr. Samuel Blizzard of Pennsylvania State University. His series of four talks on the rural parish minister, will be the first major presentation of the findings of a study he conducted un der the auspices of the Russel Sage Foundation and the National Council of Churches. Dr. Harold E. Smith of Perdue University also will con duct a series of four morning talks on the rural church and the com munity. Discussion seminars will follow the morning lectures. Afternoons will be open for relaxation and re creation. Evening speakers will include Dr. L. George Nace, Perdue University, executive secretary of the Division of Home Missions of the National Council of Churches and Dr. Alfred P. Fernback, associate professor of foreign affairs, University of Vir ginia."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "talks on the rural <mark>parish</mark> minister, will be the"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "talks on the rural <mark>parish</mark> minister, will be the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [723.31, 454.89, 864.17, 551.09], "bbox_id": "c5502ff4dc", "file": "TimesVirginian_1978_0190.pdf", "page": 1, "text": "The Rev. William L. Trimyer of Elon Baptist Church, Pamplin City, and co-author of a book just released entitled Colors of the Mind, published by Skipworth Press, was in attendance at the 10th Anni versary Annual Meeting of the Academy of Parish Clergy at"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "of the Academy of <mark>Parish</mark> Clergy at"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "of the Academy of <mark>Parish</mark> Clergy at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1719.13, 709.01, 1886.02, 901.86], "bbox_id": "83dc5e43e8", "file": "AppomattoxNewspapers_1952-1954a_0098.pdf", "page": 1, "text": "The Rev. Herbert Tucker, Minig- ter-in-Charge of St. Anns Episcopal Church, has announced the accept ance of a call to become associate rector of Bruton Parish Church, ai Williamsburg, Va., beginning on No vember 19 of this year. He will sevre as assistant to the rector, the ir.. riancis xi. unugiiiii. Mr. i uck - er was a member of the class of 1948 of the College of William and Maiy. Upon graduation from the col lege, he entered the Episcopal Theo logical Seminary in Alexandria, Va.. receiving the degree of Bachelor of Divinity in 1951. Since then he has served as minister-in-charge of St. Anns, Appomattox Emmanuel, at Glenmore Grace at Manteo, and St. James at Cartersville."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "associate rector of Bruton <mark>Parish</mark> Church, ai Williamsburg, Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "associate rector of Bruton <mark>Parish</mark> Church, ai Williamsburg, Va.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [744.49, 700.41, 913.42, 1160.14], "bbox_id": "37ca961cda", "file": "AppomattoxNewspapers_1954-1955a_0234.pdf", "page": 1, "text": "The Rev. and Mrs. Francis Hop- kinson Craighill, of Bruton Parish Church, Williamsburg, Virginia, an nounce the engagement of their daughter, Catherine Rutledge, to the Rev. Herbert Nash Tucker, Jr. Miss Craighill is a graduate of Stuart Hall, Staunton, Virginia, and is attending Sweet Briar College. She is the granddaughter of the late Mr. and Mrs. James Edward Willink of Savannah, Georgia, and the late Rev. Francis Hopkinson Craighill, former Rector of the Church of the Good Shepherd, Rocky Mount, North Carolina, and the late Mrs. Craig hill, and the great-granddaughter of the late Rt. Rev. Frederick Focke Reese, Bishop of Georgia. Mr. Tucker is a graduate of the College of William and Mary and of the Virginia Episcopal Seminary. He is the son of Mrs. Herbert Nash Tucker and the late Rev. Herbert Nash Tucker, former Rector of St. Pauls Church, Suffolk, Virginia. Miss Craighill is the great-grand daughter of the Rev. James Brown Craighill, a former Rector of St. Pauls. Mr. Tucker is the grandson of the late Rt. Rev. Beverley Dan- dridge Tucker, Bishop of Southern Virginia, and the late Mr. and Mrs. Charles James Faulkner, of Boyd- ton, Virginia, and the nephew of the Rt. Rev. Henry St. George Tucker, Retired Presiding Bishop of the Episcopal Church. Before com ing to Williamsburg as Associate Rector of Bruton Parish, Mr. Tuck er was Minister-in-Charge of the Appomattox - Buckingham - Cum berland Cure. The wedding will take place in June."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "kinson Craighill, of Bruton <mark>Parish</mark> Church, Williamsburg, Virginia, an"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "kinson Craighill, of Bruton <mark>Parish</mark> Church, Williamsburg, Virginia, an"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [939.4, 1061.26, 1123.35, 1402.68], "bbox_id": "4a0706e310", "file": "TimesVirginian_1984a_0136.pdf", "page": 1, "text": "The Raider varsity tennis team easily defeated Altavista last Tuesday 9-0. but a powerful Liberty team handed Appomattox its fifth district loss of the season Friday, 7-2. Against Altavista, The RaiderSYnade a clean sweep. Freddie Lawson defeated John Steele, 64 Bobby Carter defeated Rusty Dalton, 8-2 Mike McCoy defeated Travis Hedrick, 8 - 6  Kinkle Robinson defeated Ivoe Sitterding, 9-7 Stan Slagle defeated Robert Newman, 8-4 and Howard Anderson defeated Steve Parish, 8-1 in singles competition. In doubles, the Lawson-Carter team defeated Steele and Dalton, 8-0 McCoy and Robinson defosted Hedrick and Newman, 8-4 and Billy Caldwell and Billy Carter defeated Steve Parish and Jeff Hammock, 8-3. Libertys 7-2 victory against Appomattox Friday saw the Minute- mens doubles team of David Copeland and Scott Brotherton hand the Raider team of Freddie Lawson and Bobby Carter their first defeat of this season, 8 - 2 . The only Raider victories against Liberty were Lawsons 8-1 win over Copeland, and Mike McCoys and Kinkle Robinsons doubles win against"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Howard Anderson defeated Steve <mark>Parish</mark>, 8-1 in singles competition."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Howard Anderson defeated Steve <mark>Parish</mark>, 8-1 in singles competition."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2185.93, 761.41, 2326.82, 907.71], "bbox_id": "224f489c59", "file": "AppomattoxNewspapers_1971-1973a_0365.pdf", "page": 1, "text": "The Pastor Parish Commit tee will have a reception on Sunday afternoon, July 2nd, from two to four oclock, in the Social Hall of the United Me morial Methodist Church for the Rev. and Mrs. Henry E. Riley J., and their daughter, Ann. The Rev. Riley will begin his pastorate here on Sunday morning. All church m e m b e r s and friends are invited to attned the reception."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "The Pastor <mark>Parish</mark> Commit tee will have"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "The Pastor <mark>Parish</mark> Commit tee will have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1096.06, 318.37, 1268.07, 535.52], "bbox_id": "73c996a749", "file": "AppomattoxNewspapers_1952-1954a_0142.pdf", "page": 1, "text": "The Parish House of the Presby terian Church was the scene of the annual Brownie Scout Investiture Sendee. On Tuesday night, at 800 oclock, five new Brownies were in vested in the troop. They were Carole Gilbert, Mary Watkins Booth, Mary Lou Jamerson, Joan Moses and Pa tricia Price. The program was led by Robbie Lou Robertson, president. The Brownie Story was told to the par ents and other guests of Catherine Gray Richardson. At this service each new Brownie received her pin. The girls were led in singing two Brownie songs by Nancy Chandler. Sandra Trent explained the closing ritual to the parents. Delicious refreshments, donated by various mothers, brought the service to a delightful close."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "The <mark>Parish</mark> House of the Presby"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "The <mark>Parish</mark> House of the Presby"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1551.13, 1226.99, 1717.45, 1403.13], "bbox_id": "892dbcdefc", "file": "AppomattoxNewspapers_1949-1952a_0138.pdf", "page": 1, "text": "The members of St. Anns Church, Appomattox, are holding a Parish Conference this Saturday, July 1, ta make plans for the worlT of their church for the coming year. In at tendance at the meeting will be Mr. Donald H. Allen, consultant to the Department of Christian Education of the Episcopal Diocese of South ern Virginia. Mr. Allen haa been holding similar conferences in Epis copal Churches throughout Southern Virginia. Mr. Allen will discuss var. ious problerns connected with local churches and will suggest several things that the members of St. Anns can do in planning a parish program."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Appomattox, are holding a <mark>Parish</mark> Conference this Saturday, July"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Appomattox, are holding a <mark>Parish</mark> Conference this Saturday, July"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2133.36, 540.6, 2277.59, 885.89], "bbox_id": "feb25c8b52", "file": "TimesVirginian_1976_0187.pdf", "page": 1, "text": "the Medical College of Virginia. He is a member of The Academy of Parish Clergy and was named as an Outstanding Young Man in America for 1976. He is married to the former Patricia Ferguson of Appomat tox, daughter of Virginia Ferguson ahd the late Berkley Ferguson. Dr. and Mrs. Trimyer have one son, Brian Lewis, age two and one-half years. The week end of May 15 and 16 was a happy occasion. On Saturday, May 15 a reception was held at Dr. Trimyers home in his honor given by his wife. Many persons participated in the event. Those attending from this area were Mrs. Virginia Ferguson, Mr. and Mrs. Joel Trent and Roy, Mr. and Mrs. Robert Morris, Mrs. Charlie Williamson and Lisa, Mrs. Dorothy Boney, Mr. and Mrs. Marie Ferguson, Jane and Jody. Mr. Delly OBrian, and M _ and Mrs. Haywood Ferguson. Many kind notes and gifts were received .from"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "of The Academy of <mark>Parish</mark> Clergy and was named"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "of The Academy of <mark>Parish</mark> Clergy and was named"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.32, 474.31, 1770.71, 975.34], "bbox_id": "c594f7f614", "file": "AppomattoxNewspapers_1974-1975a_0449.pdf", "page": 1, "text": "The marriage of Mary Catherine Haug of Berkeley, California, to Arthur Robinson Boone of Providence, R.I., took place at 2 p.m. Saturday, September 20 in Bruton Parish Church in Williamsburg. The bride is the daughter of Mrs. Adolph Haug of Norfolk and the late Mr. Haug. Mrs. Haug is the former Isabelle OBrien of Appomattox. The bridegroom is the son of Frank F. Boone of Naples, Florida, and the late Mrs. Boone. The Rev. Almus M. Thorp, Jr., Rector of St. Francis Church, Potomac, Maryland, officiated, assisted by the Rev. Cotesworth Pinckney Lewis, Rector of Bruton Parish. The Rev. Peter LaValley Spencer, Rector of St. Pauls Church, Wickford, R. I., preached the sermon. The brother of the bride, William Adolph Haug, of Baton Rouge, La., greeted guests as they entered the church. Also assisting at the door and offering each guest a flower were the brides nephews, Wiliam A. Haug, r. and John Walker Haug of Baton Rouge, La. and the grooms daughter, Elizabeth P. G. Boone of Portland, Maine. The procession into the church involved Cecilia Laurie Benz of Berkeley, Cal., Linda Bell Carter of Richmond, Gayle Ferebee Donovan of Norfolk, Jane Hutton Grantham of Ple  d tville. N.Y., Margaret GafNMge Savedge of Williams burg,Bailie Daniel Staftglb of Willington, Conn., Ellen Jones"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "September 20 in Bruton <mark>Parish</mark> Church in Williamsburg. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "September 20 in Bruton <mark>Parish</mark> Church in Williamsburg. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.76, 1594.72, 2324.21, 1675.58], "bbox_id": "21d7f71586", "file": "AppomattoxNewspapers_1933-1936a_0401.pdf", "page": 1, "text": "The Keawiek M ovem ent The Keswick movement originated j in England in 1874 when Canon Har- ford-Battersiy experienced a deep spiritual awakening and, returning to his parish church at Keswick, London, called the Keswick convention In 1875. The .movement was organized for the 1 promotion of practical holiness."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "and, returning to his <mark>parish</mark> church at Keswick, London,"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "and, returning to his <mark>parish</mark> church at Keswick, London,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2001.83, 799.68, 2165.95, 1013.38], "bbox_id": "3d9ca4583b", "file": "AppomattoxNewspapers_1892-1898a_0433.pdf", "page": 1, "text": "the Indians. Miss Fannie Furbush returned home from Eagle Rock last. Tuesday, with her friend Miss Myers. Rev. Wm. Fisher left here last Tuesday to attend the Appomattox Association at Rices Depot, and went from the-e to Portsmouth to the Eastern Shore of Virginia, where he will spend the month of August Rev. Dr. W. F. Fisher of Ports mouth spent Saturday at his fath ers home near here. Rev. J. H. Parish and lady at tended the Sunday School Conven tion in- Bedford city last week. Miss Mary Schnyler and her daughter, Miss Schuyler, will return"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "here. Rev. J. H. <mark>Parish</mark> and lady at tended"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "here. Rev. J. H. <mark>Parish</mark> and lady at tended"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.52, 347.3, 1943.43, 657.32], "bbox_id": "8cf9cc2c15", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Thè i Appomattox Garden Club  met Monday night, March 26 at T30 in the St. Amras Parish HsH Mrs. Martin Webb president, was in charge of the mecUaac, For! ib i program M rs. W ebb. presented an arrangnient in an . Oriental design, and Mra. Rèîd 8hields and Mrs. Richard Robinson demonstra ted various designs in flower  arrangements.  Plsns were fhislised foa the Barter Theatre Playerri production, Hetpes, to be presented at 8 p.b , on Friday, April 6 at the Appomattox County High Sehool Auditorium. MTbe Gardép Club m em bres, sponsors of the production are pleased with ike response of the public in ft cooperatimi if advertising of thè play and purchasing tickets, said Miss Claudine OBrien, dùb member. Tickets are available for 5 at the Farttitfrs N ational Bank, C entral Fidelity Bank, American Federal Thompson"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "in the St. Amras <mark>Parish</mark> HsH Mrs. Martin Webb"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "in the St. Amras <mark>Parish</mark> HsH Mrs. Martin Webb"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [780.95, 511.22, 949.55, 561.02], "bbox_id": "9812364847", "file": "AppomattoxNewspapers_1954-1955a_0117.pdf", "page": 1, "text": "The guided tour included the capi- tol, Governors Palace, the jail, the Powder Horn, and Brutan Parish Church. Everyone was ready for the delicious picnic lunch."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "The guided tour included the capi- tol, Governors Palace, the jail, the Powder Horn, and Brutan <mark>Parish</mark> Church. Everyone was ready for the delicious picnic lunch."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "The guided tour included the capi- tol, Governors Palace, the jail, the Powder Horn, and Brutan <mark>Parish</mark> Church. Everyone was ready for the delicious picnic lunch."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1930.31, 1137.88, 2414.13, 1355.2], "bbox_id": "43a5a8304d", "file": "AppomattoxNewspapers_1892-1898a_0173.pdf", "page": 1, "text": "The girl was fifteen years of age . appucawou uuomOB, .................... . . . Fatal to W ilsons Re-election, filed with the sugar bounty bureau  Capt. Flangan, of Parkersburg, IPT the estimated production at A craze has taken  ra rK e rso u rg , ,s  -  .............  . ----------  - -  possession o f W V a member of the democratic 1845,230,774 ponds, and the yield will I the boys in Warrenton for making congesrional committee of Wilsons fall very little below these figures, horse hair chains and on Snmky district, asserts that the latters ac- This at regular bounty would have last acolored gentleman came for ceptanceof the senate substitute required from the United States,gov- his horse in the afternoon which he defeats his re-election. There is eminent 19,944,155. At half the had tied near the pump in the morn great excitement among the dem- bounty, as proposed, it would amount ing and found it looking like a bob ocrats of the district, who consider to 8,472,075. tail rat only a f6w hairs were left hem selves betrayed. The parish of St. Mary, from which by which could be distinguished a ,i Senator Caffery came, leads with a I horse tail.Warrenton Virginian A narchists U sing the Torch. promised production of 149,467,500 an gunday morningnear Carters Carl Herlitz and wife were held pounds of sugar. What an impetus Bridge.  lbemarle county, a young the other day at Chicago for the the bounty system has given to the l  ffick8 had WCMion to grand jury in a bond of 3,000 on I sugar production of Louisiana is I . ..  . ------ j m ------- j . the charge of arson. The husband I shown by the tact that the State pleaded guilty and made a confes- j crop of 1891, the first raised undei"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "hem selves betrayed. The <mark>parish</mark> of St. Mary, from"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "hem selves betrayed. The <mark>parish</mark> of St. Mary, from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [758.61, 541.59, 909.66, 872.72], "bbox_id": "4d410fa652", "file": "TimesVirginian_1981a_0399.pdf", "page": 1, "text": "The fund drive .for the building fund of Our Lady of Peace Catholic Church has met all expectations, according to Dr. A. A. Fratrick, President of. th é Parish Council. The business community of Appo mattox and Appomattox Coun ty have certainly responded generously, to . our plea, Fratrick said. We feel we have been welcomed into the comm unity w ith th e . first Catholic Church in Appomattox County. . Some contributions are still coming in, and others promised are expected to add to thé total raised. It was emphasized that no house to house canvass had been m ade, but individual contributions are gratefully welcomed. Dr. Fratrick also pointed out that the new building, , when completed, will be an asset to the community and will be available to groups for meet ings. We would like to see the doors open every day, and the lights on every evening with various community activities."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "President of. th é <mark>Parish</mark> Council. The business community"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "President of. th é <mark>Parish</mark> Council. The business community"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [763.4, 1474.11, 922.85, 1748.86], "bbox_id": "9cc2054f62", "file": "AppomattoxNewspapers_1898-1902a_0275.pdf", "page": 1, "text": "The following are the appoint ments which our people are esjec- ially inteiested in. Lynchburg District, Paul White head, I. D., P. E. AppomattoxP. M. Bell. ConcordC. H. Galloway. West CampbellJ. W. Parish. PittsylvaniaS. H. Johnson. MartinsvilleH. C. Cheatham. ClarksvilleJ. E. Oyler. . LancasterJ. O. Babcock. ChesterfieldOscar Littletou. City MissionG. H. Wiley. iiasker-MemorialL. C. Shetwncr- Charles CityW. E. Moore, ProspectBascoin Dey. West BuckinghamL. L. Banks. BuckinghamW. E. Grant. Cumberland  W. W. Sawyer. South of DanA. L. Carson, UyeoF, P. Parham. BlaudfordFloyd C. Moore."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "Galloway. West CampbellJ. W. <mark>Parish</mark>. PittsylvaniaS. H. Johnson. MartinsvilleH."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "Galloway. West CampbellJ. W. <mark>Parish</mark>. PittsylvaniaS. H. Johnson. MartinsvilleH."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [122.41, 657.29, 268.81, 1574.2], "bbox_id": "4d46aaefc4", "file": "TimesVirginian_1976_0261.pdf", "page": 1, "text": "The First Presbyterian Chur ch of Sparta, Term., was the evening setting June 18 for the wedding of Miss Brenda Alberta Mann and Mr. Philan der Kelsey. Miss Mann is the daughter of Mr. and Mrs. Louis Rex Mann of Cookeville, Tennessee, and Mr. Kelsey is the son of Mr. and Mrs. Raymond Hardy Kelsey. Sr. of Sparta and formerly of Appomattox. The Reverend Carl Stoldt, minister of the White County Presbyterian Parish officiated at the double ring ceremony. Musical selections began with Because and Love Story by Luke Trovarelli, music director of First Presby terian Church, followed by Wedding Prayer by the grooms father during the kneeling service. Following the vows, Mr TfbVarelli sang Climb Every Mountain. Or ganist was Mrs. Georgians Parker. The bride, given in marriage by her father, chose an elegant gown, of while peau de soie and alencon lace. The bodice was designed with a bibbed yoke of lace adorned with seed pearls. The wedding band collar and deep stenciled cuffs of bishop sleeves were eteched with scallops of lace. The semi-circu lar skirt bordered in matching lace cascaded into a chapel length train. Her veil was a full  length mantilla of illusion bordered with lace with scattered medallions fastened to a Spanish headpiece of lace. Her bridal bouquet of blue daisies was centered with white roses and babys breath. Miss Kim Hudgens of Sparta was maid of honor. Bridesmaids were Miss Karen Kelsey, of Sparta, sister of the groom, and Miss Terry Duncan of Colum bia, Virginia, cousin of the groom. They wore identical dresses of cotillion blue macracane jersey that featured a white winged collar edged in a self ruffle. The tapered sleeves were also ruffled at the wrist. The skirt was held in gathers at the empire bodice. They wore hats of blue nylon braid, and carried white roses and babys breath and streamers. r Mr. Kelsey was his sons best man. Ushers were  Raymond Hardy Kelsey, Jr., brother of the groom, and Michael Shockley of Sparta. Miss Cheryl Dawn Simpson from Appomattox, Virginia, cousin of the groom was flower girl. She wore a blue, floor length dress bordered with lace and ribbon and carried a basket of daisy petals. Robert Lee England, IV, from Gallatin, Tenn., was ring bearer. Mrs. Mann chose for her daughters wedding an apricot dress with matching scarf. The grooms mother wore a sheer blue floral dress with old"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "the White County Presbyterian <mark>Parish</mark> officiated at the double"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "the White County Presbyterian <mark>Parish</mark> officiated at the double"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.49, 1444.42, 2275.46, 1784.49], "bbox_id": "9489f15d67", "file": "TimesVirginian_1978_0146.pdf", "page": 1, "text": "The Eton Baptist Church in Pamplin City has recently called Dr. William L. Trimyer as its new pastor. The new minister is a native of Portsmouth, Virginia. He is married to the former Patricia Ferguson of Appomattox. The couple have two sons, Brian and Brandon. Mrs. Trimyer attended Bluefield College where she met Mr. Trimyer. Mrs. Trimyer has been actively involved in the Northside Garden Chib in Richmond. She is currently classified as a student judge while persuing her course work toward certification as a judge. Mrs. Trimyer was an instructor tor Diet Workshop and active hi the Christian Womens Club while living in Richmond- . J l ____ _ Dr. Trimyer completed his undergraduate work at Kuefieid and Georgetown colleges. He holds a Master of Divinity degree, from Southern Baptist Seminary in Louisville, Kentucky, as well a the Doctor of Ministry degree from Union Seminary in Richmond. - He has had extensive training in the field of pastoral care nd crisis ministry. He spent a year sad a half in a Stoical Pastoral BfiM tiw i program at the Medics! College of V irg in ia During that time he worked especially cfoee with cancer patients and the erttkafiy ffi in numerous intensive cmw unfa within the hpspftai. Part of his training there focused on m inistry to persons with drinking problems. . . Dr. Trimyer has published articles in several periodicals of Southern Baptist literature, b conjunction with another Richmond minister, he haa written a book Colors 1 the I m m , to be released ttoa month. _ v .  . Dr. Trimyer was selected by the Richmond Jaycee s as onoogc the Ortatnnding Young M ini h 1978. He is also an aewm mfohber ia tho Academy of Parish Clergy. ... We welcome Dr. Trimyer and his family to our community."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "ia tho Academy of <mark>Parish</mark> Clergy. ... We welcome Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "ia tho Academy of <mark>Parish</mark> Clergy. ... We welcome Dr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [795.37, 1136.51, 962.14, 1392.12], "bbox_id": "e91198d697", "file": "AppomattoxNewspapers_1892-1898a_0019.pdf", "page": 1, "text": "The English Church Two Centuries Ago. If you were to ask any person specially interested in the Church of Englandnot necessarily a clergyman of that church which was the deadest and lowest and feeblest period of the churchs existence, he would without the least hesitation re ply that the reign of George n covered that period. It is certain that the churches were what is commonly called ngly, that is to say, they were built by Wren, I or were imitations of his style, and had nothing to do with Early English or Deco rated or even Perpendicular. Also, it is certain that the congregations sat in pews, each family - by itself that there were some few pews of greater dig nity than others, where sat my lord mayor, or the aldermen, or the sheriffs, or the masters of the city companies. It is also certain that all the churches had galleries, that the services were performed from a three decker? , that the sermon was preached in a black gown, and that the clergyman called himself a minister, and not a priest. All these forms are abomina tions to the latter half of the Nineteenth century. There were also pluralists the poor were left very much to themselves, and the parish was not worked according to modern ideas.W alter Besant in Har per"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "to themselves, and the <mark>parish</mark> was not worked according"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "to themselves, and the <mark>parish</mark> was not worked according"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2214.0, 989.93, 2362.46, 1155.52], "bbox_id": "8aeab89d6b", "file": "TimesVirginian_1981a_0232.pdf", "page": 1, "text": "The Celebration of the Eucharist followed the wedding ceremony. During this time,, the organist played Celebre Canon by Paçhèlbel. The brides parents then entertain ed with a reception in the church parish hall. After a weeks honeymoon in - Arizona, the couple will leave for their new home in Austin, Texas, where the groom will begin his seminary studies at The Episcopal Seminary of the Southwest, and the bride will resume her nursing career."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "reception in the church <mark>parish</mark> hall. After a weeks"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "reception in the church <mark>parish</mark> hall. After a weeks"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1212.0, 455.46, 1365.63, 698.26], "bbox_id": "edb27f4627", "file": "AppomattoxNewspapers_1905-1912a_0438.pdf", "page": 1, "text": "The Bishop and the Boy. The late Bishop Williams of CoJ necticut was very fond of chtldrma and It was always a joy to us y0UnJ sters when he came for his visit to n fathers parish. His anecdotes stories enlivened the whole household Once when he was staying with us I told the following story. One Sunday morning, just aftj breakfast, I repaired to the rectmd study, where 1 was soon followed bJ bis little four-year-old son, wti climbed up on my knee and began tol talk. Suddenly tbe little fellow lookn up into my face and said Bishop, dj oo want to see my piggy book?  Yes, indeed, said I. So the chilli slid down and started to get the book.! When half-way across the room a rum den idea seemed to strike him, anil running back and putting one hand J my knee, he looked up in my face and shook his little forefinger at me, whin poring Bissop, Its Sunday. We mu do zis on ze slyl  Harpers Mag, zine."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "visit to n fathers <mark>parish</mark>. His anecdotes stories enlivened"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "visit to n fathers <mark>parish</mark>. His anecdotes stories enlivened"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [351.85, 222.39, 515.51, 643.28], "bbox_id": "6d0015d74d", "file": "AppomattoxNewspapers_1922-1923a_0351.pdf", "page": 1, "text": "the beautiful home of Mr. and Mrs. J. A. Thompson, Saturday of charlotte, when Miss Elizebeth Houston, daughter of Major P. B. Houston, division engineer of the Tidewater Railroad, became the iride of Ur. Herbert O. Forbes, a prominent young physiciau of Jet- ersville. Sweet an l lovable in character, attractive in manner, she has won a host of friends in Keysville, who wish her all the sunshine and hap piness that marriage bestows. This typical Southern girl is descended from a long line of distinguished ancestors. She will prove  worthy- helpmeet to the one she has chosen as a life partner. The bride wore a handsome dark brown tailor-made suit, and carried a lovely hoquet of brides roses and ferns. The marriage ceremony was im pressively performed vy the Rev. G, Wallace Ribtle, rector of the parish. On account of a recent be reavement, only the immediate members of the family were present. The bridal party left on the 930 morning train for an extended Southern tour. Dr. Forbes is a son of the late Peter A. Forbes, of Buckingham County."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Ribtle, rector of the <mark>parish</mark>. On account of a"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Ribtle, rector of the <mark>parish</mark>. On account of a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.34, 1319.38, 1613.94, 1504.62], "bbox_id": "dba89b11bd", "file": "TimesVirginian_1980a_0345.pdf", "page": 1, "text": "The Appomattox Garden Clubs October meeting will be held at 730 p.m. next Monday evening in St. Annes Episcopal Parish Hall. Guest speaker on the subject Growing of Chry santhemums will be Mrs. Dorothy W. Elliott of Hampden-Sydney. Artistic exhibits for this month are Class I - Goblins Time and Class II-Election Day. Designers may use their choice of material but each exhibit must include some fresh or dried plant material."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "in St. Annes Episcopal <mark>Parish</mark> Hall. Guest speaker on"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "in St. Annes Episcopal <mark>Parish</mark> Hall. Guest speaker on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1836.72, 815.45, 2002.5, 878.55], "bbox_id": "17a5ce7ed1", "file": "TimesVirginian_1983a_0081.pdf", "page": 1, "text": "The Appomattox Garden Club will meet on Monday, March 28,730 p.m. in St. Annes Parish Hall. Mrs. C.T. Moses, Jr., second vice president of the Virginia Federation of Garden Clubs, Inc., will present a"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "p.m. in St. Annes <mark>Parish</mark> Hall. Mrs. C.T. Moses,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "p.m. in St. Annes <mark>Parish</mark> Hall. Mrs. C.T. Moses,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.27, 749.7, 1821.21, 921.98], "bbox_id": "3c40414a24", "file": "TimesVirginian_1983a_0019.pdf", "page": 1, "text": "The Appomattox Garden Club will meet on Monday, January 24, 730 p.m. at St. Annes Parish Hall. Mrs. Uoyd Walton, Appomattox County Extension Agent, will E resent a program on Pollution and litter ControT. Mrs. Martin Webb will give a mini-demonstration on Crescent Design.  The artistic exhibit is Winter Mood, a design of dried, treated aad or painter material. All members are urgeiffo attend. W illia m se s"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "p.m. at St. Annes <mark>Parish</mark> Hall. Mrs. Uoyd Walton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "p.m. at St. Annes <mark>Parish</mark> Hall. Mrs. Uoyd Walton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2158.78, 593.68, 2324.99, 689.18], "bbox_id": "ea0b0544c1", "file": "TimesVirginian_1983a_0052.pdf", "page": 1, "text": "The Appomattox Garden Club will meet on Monday, February 28, 730 p.m., in St. Annes Parish Hall. The program will be a film strip featuring the Chelsea Flower Show in London. The artistic exhibit is Simplici ty, a line design using all green plant material."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "p.m., in St. Annes <mark>Parish</mark> Hall. The program will"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "p.m., in St. Annes <mark>Parish</mark> Hall. The program will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [715.21, 821.11, 893.31, 894.01], "bbox_id": "1d5623af42", "file": "TimesVirginian_1983a_0413.pdf", "page": 1, "text": "The Appomattox Garden Club will meet Monday, Nov. 28 at 730 p.m. in St. Annes Parish Hall. Mrs. Dan Coleman, Mrs. Clyde Nash and Mrs. Gerald Wfibun wifi present the program on Christmas arrange ments."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "p.m. in St. Annes <mark>Parish</mark> Hall. Mrs. Dan Coleman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "p.m. in St. Annes <mark>Parish</mark> Hall. Mrs. Dan Coleman,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1629.56, 1057.48, 1758.01, 1220.62], "bbox_id": "e285106875", "file": "TimesVirginian_1980a_0263.pdf", "page": 1, "text": "The Appomattox Garden Club will hold its first meeting of the club year on Monday, August 25. 700 p.m., at St. Annes Parish Hall, Mrs. Susan Holland, Re gional Coordinator for Crea tive Expressions, will pre sent a special program consisting of a slide, show on the history of needlework, as well as conduct a work shop, on the techniques involved in his art. Mrs. Holland, married to a former"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "p.m., at St. Annes <mark>Parish</mark> Hall, Mrs. Susan Holland,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "p.m., at St. Annes <mark>Parish</mark> Hall, Mrs. Susan Holland,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1736.87, 264.14, 1919.12, 401.14], "bbox_id": "9fa5181e45", "file": "TimesVirginian_1983a_0348.pdf", "page": 1, "text": "The Appomattox Garden Club met Monday, Sept. 26, at St. Annes Parish House with Mrs. Ruth Webb, president of the dub, presiding. One very important item of business was the decision of the dub to sponsor the Barter Theaters production of TINTYPES, a musical revue. The play will be presented in Appomattox County High School auditorium on April 6. 1964. Three new members were taken into the dub Mrs. Cheryl Dawson, Mrs."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "26, at St. Annes <mark>Parish</mark> House with Mrs. Ruth"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "26, at St. Annes <mark>Parish</mark> House with Mrs. Ruth"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1381.38, 870.18, 1535.21, 1598.25], "bbox_id": "68fea5adfc", "file": "TimesVirginian_1980a_0067.pdf", "page": 1, "text": "The Appomattox Chapter of the United Daughters of the Confederacy met in the home of Mrs. Hazel Lee Martin on Thursday, Feb. 21, at 12 noon for a covered dish luncheon. Mrs. Harriett Cunningham returned thanks for the food for the 19 members in attendance who gathererd around the dining room table for a most delightful meal.   Mrs. Martin, chapter presi dent, presided at .the meeting. ! The Pledge of Allegiance to the United States flag was led by Mrs. Helen Gunter. Mrs. Mary Sue Gordon led the salute t the Virginia flag, and fhe salute to the Confederate flag was led by Mrs. Gladys Jbhnson.  Mrs. Martin read the ritual and Mrs. Cunningham read the Confederate prayer. Mrs. Martin announced that the Third D istrict Spring Conference, Virginia Division, U.D.C. will meet with the Appomattox Chapter on Satur- cfey, April 12, at the Parish House at St. Annes Episcopal Church in Appomattox. Regist ration and a coffee hour will be ffom 915 to 10 a m.  Mrs. Lena Eversole read a fetter from Mrs. Lula Hunter Jones who was the first president of the Appomattox Chapter, U.D.C. when it was p-ganized on Aug. 22,1895. The fetter was written Sept. 30,  9 6 to Mrs. Eversoles grandmother, Mrs. Betty Sears Caldwell, and requested help in getting the chapter better organized and established. I Mrs. Harriett Cunningham presented an interesting prog ram on Major General Patrick Ronayne Cleburne. . J Born in Ireland, Cleburne S me to America at the age of after serving in the British Army. He settled in Arkansas, pas a fierce defender of states ights and loved this new country where he could earn the right to be heard, vote his beliefs and be able to buy land tp develop as he saw fit.  When war came, because of tis past training, he was made a Captain in the Yell Rifles. His Organization and training of his troops, his bravery and Ladership in battle brought Rim his appointment to brigadier general. 5 He was sent to Huntsville, Alabama, was at Murfreesboro,"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "April 12, at the <mark>Parish</mark> House at St. Annes"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "April 12, at the <mark>Parish</mark> House at St. Annes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [883.17, 190.1, 1028.69, 458.88], "bbox_id": "25f2948047", "file": "TimesVirginian_1976_0117.pdf", "page": 1, "text": "The Appomattox  Concord Catholics are happy to an nounce the selection of their new name. Members of the congregation adopted MOur Lady of Peace as the official name for the growing miiurinh parish. In order to speed up the, possibility of having M ass celebrated on a weekly basis and bolster community spirit, a prayer meeting will be held on those Tuesdays between Mass es. The prayer meetings held every other Tuesday at 645 w ill provide members an opportunity to meet in friend ship, prayer and song. Other events for the month are as follows April 5 at 645 - Communal Penance April 6 at 645 Uturgy Bea Torr will join our community at"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "for the growing miiurinh <mark>parish</mark>. In order to speed"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "for the growing miiurinh <mark>parish</mark>. In order to speed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [411.85, 230.77, 554.13, 465.91], "bbox_id": "f79351150a", "file": "TimesVirginian_1976_0042.pdf", "page": 1, "text": "The Appomattox - Concord Catholic community is continu ing to grow. The Maas and covered fish supper on January 27 drew the largest -gathering so far. And for good reason. Bishop Sullivan from the Archdiocese of Richmond shar ed in the celebration and led in the discussimi on the formation of a new parish in this area. Mary Grid presented a brief summary of community activi ties and answered questions on the organizational structure of the church board. During the open discussion that followed, Bishop Sullivan recognized the needs of the community. Bishop Sullivan, Fr. Ferry, pastor of Holy Cross in Lynchburg, and Fr. Dumminger, Pastor of St-"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "formation of a new <mark>parish</mark> in this area. Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "formation of a new <mark>parish</mark> in this area. Mary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1898.63, 250.84, 2085.05, 1473.49], "bbox_id": "19cb7df812", "file": "AppomattoxNewspapers_1902-1905a_0532.pdf", "page": 1, "text": "The 25,000 issue of 4 per cent. Fred ericksburg .city bonds have all been taken by the National Bank of Fredericksburg. Giles Maddox, employed by the  tr- ginia Locust Pin Company, Front Royal, had three lingers almost severed from his left hand while running a lathe. Mr. J. W. Bitzer was elected Mayor of Leesburg by 17 majority over S. Carroll Chancellor, Joseph Wright and E. L. Pleasants. Elsie Perrow, the 8 -months-old clulu of Mr. and Mrs. Jack Perrow, of Lynch burg, was strangled at the home of her parents in a tragic manner. The lithe one was left on a bed by its mother while she was attending to her house hold duties. The child evidently rolled off the bed, and as she fell her dress caught in a projecting port. 1 of the springs, suspending h e r between the bed and the floor. When discovered the lit- tie girl was dead. The blow has pros trated Mrs. Perrow. This was her only- child. . , Mrs. Lucy Pearman, a young married woman of Richmond, lost her life as a result of an effort to kindle a fire in a cook stove with kerosene oil. _Mrs. Pearman occupied a flat at 415 North Twenty-second street. As she started to light the fire about 7 A. M. an explo sion occurred, setting her clothing on fire. Though she was dragged worn the building by a neighbor, Harry YVilson, who himself sustained painful injuries, the young woman died almost instantly. Mrs. Pearman was the wife of B. W. Pearman, a bridge builder in the employ of the Atlantic Coast Line Railroad, who at the time was in Rocky Mount, N. C. .  Carelessly stepping m front of an en gine on the Richmond, Fredericksburg and Potomac Railroad, in Richmond, Ju nius Jones, a miller, 5  years old, was crushed to death. His widow and six children survive. Rev. Manson T. Dye, head of a set of religious enthusiasts of Danville, known locally as Holy Jumpers, was arraigned in the Mayors Court, charged with creating a disturbance. A number of citizens complained of boisterous con duct of Dye and his followers in the streets at night. The services consist mainly of screams and shouts and gym nastic performances. The Mayor did not impose a fine, but ordered modera tion. T Augustus Walker and two sons, Lester S. Walker and Holland Walker, who were charged with robbing a number of stores in Shenandoah county, were given preliminary hearings. Augustus Walker was fined 20 for receiving stolen goods. Lester Walker was sent to the grand jury, and Holland Waker, who is 13 years of age, was sent to the reformatory near Richmond. Mr. Grant Parish, real estate broker, of Washington, sold Paul Kcstcr s Woodlawn Mansion House property, about four miles back from Mount Ver non. It was originally a part of the lands of George Washington, who left that portion and built thereon for Nel lie Custis Lewis the present Woodlawn Mansion House. The mansion is brick, has about 22 rooms and is located on 1 commanding elevation. The price paid was 25,000 cash. The new owner is Miss Elizabeth M. Sharpe, o f Orange, N. J. It is believed that Mrs. Lucy APuck- ett, who was struck by a train near Lynchburg, was not killed by the train, but that she dropped dead of heart dis- ase On the track, otherwise she would have had ample time to have escaped being struck. Eye-witnesses declare she lay on the track when she was struck. The pilot picked her up and threw her at least 20 feet into the air, breaking al most every bone in her body. The fund for a Confederate monu ment at Bowling Green, Caroline county, has reached nearly i, 5  The com mittee is considering designs for the monument, and later will call a general meeting of veterans and citizens, when there will be speaking. A dinner and a band of music will also be features. It is expected that the cornerstone will be laid on that occasion. Ralph P. Gage, formerly of the law firm of Wolcott, Wolcott  Gage, en tered suit in the Court of Law and Chancery at Norfolk against Thomas H. Robbins, of Washington, claiming 10,- 000 for alleged defamation of character. A heavily loaded wagon of the Gentry dog and pony show, drawn by four horses, broke through a bridge at Grat- ton, killing one horse and injuring Chas. Cooper, of Columbus, Ohio, and Her- bert Braxton. The extensive plant of the .Beaver Creek Lumber Company, Davis, has closed down and several hundred men are out of employment. It is believed the shutdown will be of short duration. Ground was broken at Marshall Col lege, Huntington, by the senior class tor the new Marshall College building. The cornerstone was dedicated by Miss Fan nie Wysor, who broke a bottle of wine on i The commencement address was deivered by Rev. Dr. Charles W. Dab ney, of Cincinnati. Miss Fannie L. Harmon, of Monon- Kah, took a civil-service examination for the position of rural mail carrier. She is an accomplished horsewoman. The Bromall Iron and Steel Company at Belington, is making steady progress with the construction of the buildings for the extensive plant. Three weeks ago Policeman William H Wyatt, Jr., who became famous by closing single-handed all the gambling lens in Richmond, was given a fur lough and entered the race for the office sf high constable. Just six days before he primary election he and his wife are sick with what is supposed tg be typhoid fever."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "near Richmond. Mr. Grant <mark>Parish</mark>, real estate broker, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "near Richmond. Mr. Grant <mark>Parish</mark>, real estate broker, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [569.98, 1124.58, 891.56, 1449.43], "bbox_id": "f716513daf", "file": "AppomattoxNewspapers_1933-1936a_0153.pdf", "page": 1, "text": "THAT serio-comic civil war In A Huey Longs domain is becoming more serious than comical and almost any day may develop Into real war fare. It was cen tered for the present at the state capital. Two hundred armed men, directed by lead ers of the Square Deal a s s o c i a t i o n , seized the parish court bouse in East Baton Rouge and held it un til assured that one of their friends who had been arrested was re leased. They then dispersed with a warning from one John Appel to be sure you have enough ammunition and be ready for the call at any time. The Kingfish was in New Orleans at the time, but he hastened to Baton Rouge while Governor Allen called out some troops and proclaimed partial martial law In the capital. Huey Im mediately ordered the recently ap pointed Judge J. D. Womack to TlH EN the senate passes the 4,- start an Investigation of what he de- 000,000,000 work relief measure, scribed as a plot to murder him, in as It certainly will after all the ora- which four sheriffs and a district at- tors get through, there need be no torney were involved. The senator fussing as to who is to administer the I declared huge fund. President Roosevelt him- We picked up two men, one of them self, according in an authority high in i was going to drive the murder car. It"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "o n , seized the <mark>parish</mark> court bouse in East"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "o n , seized the <mark>parish</mark> court bouse in East"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [747.1, 237.41, 908.5, 1059.05], "bbox_id": "ab3d0f898d", "file": "AppomattoxNewspapers_1892-1898a_0258.pdf", "page": 1, "text": "that he possessed the three designat ed qualifications. He applied for the place, was accepted and installed, and, for a time, all went well with the pastor and liis flock. But this serenity was not destined to long duration. It was learned, in some way not explainednor is the ex planation materialthat Mr. Boyd had voted for Grover Cleveland in 1892. He had done this quietly, had uot preached politics during the 92 campaign, but suspicion was excited by something Mugwumpian in his appearance. An investigation was held and the startling truth came out. Of course there was trouble. Many of the young pastors parish ioners refused to contribute to his support, and others reproached him. Mr. Ephraim Morris, a woolen man ufacturer, is one of the principal financial pillars of this church, his contribution beiug one-third of the total annual expenses. Mr. Morris says of this matter I mistrusted from Mr. Boyds application that he was not a Re publican and cautioned the commit tee against hiring him, saying that I would not contribute to the support of a Democrat but they were all wise and had their way. I gave tbem fair warning and they must take the consequences. I went to Mr. Boyd and he acknwledged that he voted for Mr. Clevelaud. I am a woolen manufacturer. Democra cy is detrimental to my business,and I wouldnt hear the gospel preached by a Democrat any more than I would cut off my right hand. If they secure a Republican they can have my support otherwise theyll go without i t  There is nothing unlawful in the attitude of Mr. Morris. He has a right to put his money where he thinks it will do the most good, but is he not going too far in con cluding that Mr. Boyd is a Demo crat merely because he voted for Mr. Clevelaud iu 1892 ? Would it not be better to follow the example of ex-President Harrison, who has urged his neighbors to vote for a candidate for Mayor of Indianopolis who did just what the Rev. Mr. Boyd did in 1892 ? Mr. Harrison regards this bolter as a Republican in 1895, in spite of the slip three years ago. Mr. Harrison will go to the polls and cast his ballot for the man who scratched him and voted for his opponent. We think this is a good example, good politics, and good morals. These w avering breth ren in Vermont should turn their gaze westward and let it rest on the form of the ex-Presideut as he goes to the polls and votes for his former enemy.Washington Post."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "of the young pastors <mark>parish</mark> ioners refused to contribute"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "of the young pastors <mark>parish</mark> ioners refused to contribute"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [515.71, 486.45, 673.95, 999.31], "bbox_id": "925409ceed", "file": "AppomattoxNewspapers_1915-1918a_0445.pdf", "page": 1, "text": "TH E FIG H TING PASTOR. During the Civil war there were  a few fighting parsons and here comas an Espiscopal rector, who says I am a rector of a parish in the Protestant E p i s c o p a l church, and I am sure the clergy generally will gain more respect, win complete confi dence in their leadership and accomplish greater results in honorable field of endeavor when they cease to avail them selves of the privelege of ex emption and show a readiness to get on the common level with all men when occasion de mands a work inconspicuous and heroic. We admire the heroic spirit of the rector, but we still in sist that a man called of God to preach the Gospel has no time for anything else. The church is called the church militant and that means a fighting church but the war it should wage is against sin in all its forms and the weapons are spiritualthe Sword of the Spirit and the Word of God. Go with the soldier boys to the front, brother, ready to admin ister to soul wants, and, as far as you can, to bodily comfort.. Enter the trenches, if needs be not to shoot Germans, but at proper time and in the proper manner bid the soldiers to be as true to the Christ as they are to oountry. This one thing I do, and woe is me if I preach not the Gospel."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "a rector of a <mark>parish</mark> in the Protestant E"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "a rector of a <mark>parish</mark> in the Protestant E"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [859.69, 1175.65, 1024.9, 1450.79], "bbox_id": "d44ad7e662", "file": "AppomattoxNewspapers_1922-1923a_0549.pdf", "page": 1, "text": "Tbe Earthly Paradise. In the days when William Morris ! sras regarded only as an apostle of  beauty there were people who  thought that if they had stuck a i Morris paper on their ______ ____ Morris chintz on their furniture, had, perhaps, subscribed to a Morris window in the parish church, they really were in the foremost ranks of culture. It was a comfortable thought, and, for families of even moderate means, the thing was so easy to do that the foremost ranks were for a time quite crowded, and became rather fashionable instead of s little ridiculous, - tbey were deemed at first. The outward sign is so readily identified with the spirit ual grace that to daub a wall over with beautiful patterns and to cover windows with hangings of gorgeous dye were reckoned quite important matters, lending to the inmates of the house an intellectual and moral j superiority that could be felt. By adding some Burne-Jones photo- j graphs, vellum-bound books, and  Liberty muslins, it seemed possible I to reach a kind of earthly paradise. ___  T ondon Nation."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "Morris window in the <mark>parish</mark> church, they really were"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "Morris window in the <mark>parish</mark> church, they really were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1465.46, 1514.36, 1790.19, 1616.27], "bbox_id": "3153c18a56", "file": "AppomattoxNewspapers_1905-1912a_0474.pdf", "page": 1, "text": "Taft Has 5 Virginia Auto Licenaea. Governor Mann Friday forwarded to President Taft Virginia automobile 11- censes for five cars. The Governor paid the fees, amounting to 82.50 out 7   , . of his contingent fund.    cadla parish are alleged in a series -------- ----------- i _____ 800 suits, the filing of which is Harrisonburg.In an election held nnder way in the Circuit Court here. In Edinburgh district, Shenandoah I Tbe 8Uits pray ,or a wrl of man- eounty, the drys won by a majority I damus directing Register of Voters a  0 4 r. - - ___ x  T a w w  i a 3 4 a - x v _"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "his contingent fund.    cadla <mark>parish</mark> are alleged in a"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "his contingent fund.    cadla <mark>parish</mark> are alleged in a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.28, 1427.83, 1756.88, 1844.12], "bbox_id": "d6777eefcd", "file": "AppomattoxNewspapers_1898-1902a_0020.pdf", "page": 1, "text": "T im es was in town Sunday evening. Dr. W. F. Fisher returned to his home in Portsmouth last Tues day. Miss Kate Majors, of Big Island, former principal of the Concord Graded school is the guest ot Maj. Jas. D. Evans. Miss Sallie Arrington returned from a trip to Bedford Springs last week. Miss Maggie Dickie who has been visiting Miss Rosalie Howard will return to her home in the Hill City much to the regret of the local beaux. Miss Mollie Ingraham is visiting her father near this place. Mr. and Mrs. Courtney Thomas, the young couple that skipped to the Tar-Heel State, so unceremoniously on the 12th Just, were in town Sun day evehing receiving congratula tions from their many friends. Rev. J. W. Parish filled his pnlpit at Beth chain Methodist Church Sunday morning. There were inter esting-services at the same church in evening under the auspices of thej Epworth League. Mr. W. D. Browning cf Appo mattox was in town, yesterday. Mrs. John B. Blackwell, returned las Saturday, from a visit to her sis ter, Mrs. M. H. Martin, of Roanoke City."}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "friends. Rev. J. W. <mark>Parish</mark> filled his pnlpit at"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "friends. Rev. J. W. <mark>Parish</mark> filled his pnlpit at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [395.05, 201.8, 715.07, 441.56], "bbox_id": "5aae311ea9", "file": "AppomattoxNewspapers_1915-1918a_0548.pdf", "page": 1, "text": "T i m e s - V i r i r i i i i a n S parehi car- j. i u i c a r i r g i u i n u  Any perBon in dmbt M  ! where he should register should I WEDNESDAY, MAY 29, 1918.o0ngg  the local board in the I place where he permanently! resides, or he may obtain the I desired information from the I office of the mayor if he lives I in a city of 30,000 population! or over, or in the office of the I county clerk or parish clerk if  he does not live in a city of 80, 000. Failure to register on June 5 constitutes a misdemeanor pun ishable by imprisonment fori one year, and may result, I furthermore, in the loss of I valuable rights and privileges and immediate induction into military service."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "I county clerk or <mark>parish</mark> clerk if  he does"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "I county clerk or <mark>parish</mark> clerk if  he does"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [811.45, 399.85, 970.2, 505.39], "bbox_id": "0854e608b8", "file": "AppomattoxNewspapers_1898-1902a_0064.pdf", "page": 1, "text": "T h e T im e s  The series of meetings at Bethle- huin Methodist church, conducted by the pastor, Rev. J. W. Parish, closed last Friday evening, resulting iu the conversion of several and two accessions to the church. The dining hall of Mrs. Victoria Arringtons residence was broken"}, "highlight": {"text": {"matched_tokens": ["Parish"], "snippet": "pastor, Rev. J. W. <mark>Parish</mark>, closed last Friday evening,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parish"], "snippet": "pastor, Rev. J. W. <mark>Parish</mark>, closed last Friday evening,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1065.11, 996.66, 1221.79, 1433.16], "bbox_id": "fddee8e491", "file": "AppomattoxNewspapers_1898-1902a_0072.pdf", "page": 1, "text": "T h e little  D octors Book  toll alt abotr them , an d a w e e k s T reatm en t F ree, prove- e v e ry w o rd true. Com plete T re a tw c a v , 26 . M OW N MFS. CO.. N. V. I   greM t,iiu. fen I N THE CLERKS OFFICE OF THE Cl CD1T Court of the County of Bucklnglm on the 10th day of September IMS. Annie B. Perking ana J. F. Perkins her bu oand......................................... .. ....... Plttiutn against Bettie Davis aud F. 8. Wllhinaons admini- trator and others ............. ....... Defendant The object of this suit is to perl eet au qniet the title of Annie E. Perkins one of tli plaintiffs to the tract of land In Uuuklntfluu county, Virginia, bounded by the Carteravlli Hoad on the south, on the east by land u Samuel C. Wilkinson, doce.iscd, ou the i-m i by Pardee aud Terr,-!! land, on the -1 u Pardee and Lee land and others, contai.-iii. 4644 acres more or loss, which was foameil owned by K. L. vv ilkinson, deceased. And au affidavit having heed made un i lile- thnt the defendants liettic Davis and ------ Davis her husband, Emily Parish and  - Parish her husbai.d. Cnri-tophcr Meyers Robert Meyers, Addie Meyers, Mary Meyers Davy Meyers, Unn.sford Meyers, egmuel C Wilkin on, Fanny A. Wilkinson, Nettie I. Wilkinson, William Wilkinson, tiussie Wii kinson and Henry Wilkinson are nut resident, of the State of Virginia, it is ordered tha they do appear here within lUtuen days alter due publication hereof, and d what may In necessary to protect their interest in lh - suit, Aud it is farther ordered that a copy hereof be published ouce a week for four su- cesslve weeks In the Appomattox aud luck Ingham T imes and that a copy be pouted a the front door of the courthouse of thi county on the flrst day of the next term o the county court. A conyTeste P. A. FORRES, Clerk. B W . H U B A R D , p . q . 0 -flx 4 w. r RUST EES SALE. By virtue of a deed of trust, dated 29tl. day of November. 1806, of record in the Clerk Office of Appomattox county court, D. R. 3. pages 233-4, default having been made in th payment of the debt thereby secured, anc being required by the beneficiary so to do, i will sell by auction, at Appomattox Court House on THURSDAY, DEG. 8TH, 1898, the following property A tract of land con taining 107 acres, with buildlnifs thereon, it the county of Appomattox, south of Ever green. and bounded by the estates of K. tv. wheeler and Presley Paulete and the land o E. G. Harvey and owned by Sarah A. Harvey. TERMS Cash Sufficient to defray expense, of executing this trust and a debt of 161.87. with interest thereon from July 1. 1806, and residue upon such terms as may be prescribed by Mrs. Sarah A. Harvey or myself, which will be announced at sale. 10-3m. P. R. WOOL UBIDGB.-Trastee."}, "highlight": {"text": {"matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> and  - <mark>Parish</mark> her husbai.d."}}, "highlights": [{"field": "text", "matched_tokens": ["Parish", "Parish"], "snippet": "Davis her husband, Emily <mark>Parish</mark> and  - <mark>Parish</mark> her husbai.d."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1743.34, 195.25, 1900.87, 1045.89], "bbox_id": "29d199df38", "file": "AppomattoxNewspapers_1915-1918a_0415.pdf", "page": 1, "text": "T albot disgustedly relinquished Me golf, and in the Bbrary of the hall w rote the anonymous letter to the chief. Then, in Ms gray car, he setoff for the city to mail the letter. When he was in the car, the engine throbbing easily, Elinor ventured to put her hand on his arm. L ast night, she said rapidly, W al te r threatened ail,sorts of tM ngs that he would get the morning collection at Saint Judes, that he would kill Mr. W ard. I am frightened, Taille. Talbot patted her hand. We will get this fixed .up so it wont be necessary  and as for the other, you know W alter. H e w as mad with jealousy last night. T h ats all talk. On th at wild ride T albot had little tim e to think, but, such as they were, his thoughts were of Elinor and her caprice. Its the preacher, after all, he said to himself. Its enough to make old H ilary turn over. From th a t his mind wandered to W alter. He knew Huff, the violence of his temper, the madness of his passion for the girl. Talbot was uneasy. Elinor had an unexpected visitor th at afternoon. It was th e B ryant roman. White, but very dignified, Elinor cam e into th e drawing room. B ut Mrs. B ryant had not come about the pearL You m ust forgive a Sunday visit, she said. B ut I have taken Mr. Bry an t to the country dub, and I wanted so much to come to see you. Elinors color returned. It is very kind of you to cotne. Mrs. B ryants smalt, birdlike eyes darted over the room. The house was distinctly good form. Perhaps the girl m ight be an acquisition to the social life of the village. A fter all, religion was becoming very broad. Even the best people The country club, said Mrs. Bry an t aloud, is full of disagreeable memories to me ju st now. It was less than a week ago that I w as robbed. A h! said Elinor. Robbed! How interesting ! All my jewels, everything I pos sessed th at was really w orth while. B ut surely the police Mrs. B ryant flushed with anger. The police ! she said. It wouldnt surprise me a t all to discover that the police are In with the thieves. Look a t the condition of this country! It has been terror-ridden fo r the last two or .three years. You yourself are a victim. Your poor father ! Actually she had detested old Hilary. She sat forw ard on the edge of her chair and spoke with great unction. There is a band of organized, in telligent bandits working, in this neigh- borhood, Miss Kingston, a band of m ur derers. In these days of feminism, it wouldnt astonish me a t all to discover th at some woman Is a t the head of it. The tMngs th at have been planned have been so fiendishly clever ! Mrs. B ryant rose. It shows how demoralizing such things are, she said. I assure you th a t I never look a t a womans throat these days without expecting to see my pearl. From th at dangerous ground she stepped quickly to the burning of the parish house, wMch she believed was the work of m ilitant suffragettes. The dear rector is not a feminist, she said. His assistant, I fear, has a strong tendency ln th a t direction. But he .is a wonderful person, really. Ju st Imagine, seventy-eight thousand dol lars was collected in Saint Judes church tM s morning for rebuilding the parish house! She turned a t the doorway. TO BE CONTINUED. ."}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "the burning of the <mark>parish</mark> house, wMch she believed"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "the burning of the <mark>parish</mark> house, wMch she believed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [147.61, 999.57, 328.73, 1096.47], "bbox_id": "c5f740c228", "file": "TimesVirginian_1984a_0059.pdf", "page": 1, "text": "t . FRIDAY, FEB. IT Mrs. Maymond Mitchell will present a program on dough flowers to . the Appomattox Garden Club at 780 p.m. in the St. Annes Church parish hall. Artistic exhibits will include Class L Speaking of Small Things Class H, Pamplin Pipes. ?"}, "highlight": {"text": {"matched_tokens": ["parish"], "snippet": "the St. Annes Church <mark>parish</mark> hall. Artistic exhibits will"}}, "highlights": [{"field": "text", "matched_tokens": ["parish"], "snippet": "the St. Annes Church <mark>parish</mark> hall. Artistic exhibits will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
