{"document": {"bbox": [291.85, 275.94, 434.14, 543.72], "bbox_id": "a735eb3582", "file": "TimesVirginian_1978_0015.pdf", "page": 1, "text": "y . Plans for 4-H Public Spea king are well underway with tite County Contest set for February 1 at Appomattox Elementary School. Make your plans to tain part. Senior members speeches should be 5 - 7 minutes long while Junior speeches may be 2 - 4.minutes long.4-Hers may speak oâ any subject they are interested in.    4-H leaders sure reminded that travel they haite incurred in the past year for 4-H programs is déductible on Fédéral Income Taxes if you itemize your deductions. This travel is deductible at the rate of 7 cents per mile, or as actual expanses. 4-ITers of the Week-Our TV Stars-Ernie Chenault, David Caldwell and Susan Parris."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "David Caldwell and Susan <mark>Parris</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "David Caldwell and Susan <mark>Parris</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.24, 464.88, 1689.67, 1442.32], "bbox_id": "696ee9f1d1", "file": "AppomattoxNewspapers_1926-1933a_0417.pdf", "page": 1, "text": "Xmas holidays passed off very quietly. Lots of visitors came back to spend Xmas with the home folk and some went away for the holidays. Quite a numoer of parties for the younger set Miss Virginia Chick entertained a number her friends at a birthday party on the evening of the 26th. Mis Hazel Taylorwas hostess to the younger set Monday night. The flu epidemic is quite serl ous around here. Some families are ali in bed. The schools wi remain closed until an. 17th on account of flu. Rev. A. I. Caudle spent Sat night with Mr. W. S. Taylor and family. On account of flu there was no services at Hebron last Sunday. Rev. Caudle motorec to Durham, N. C-, Sunday p. m or his family, where they were spending the holidays. Mr. J. H. Elder and family, lrs. G. A. Jacobs and children returned to Richmond Sunday after spending the holidays with Mr. and Mrs. C- M. Stratton. Miss Hazel Taylor left Sunday or Richmond to resume her duties in school. Mrs. J T. Whitten spent part of the holidays in High 3oint, N. C., with her daughter Mrs. Whitten is sick with flu. Mrs. J. W. Neighbors visitec her son, Jim, in Lynchburg few days last week. Mr. and Mrs. W. D. Parris are happy over the arrival of their twins, boy and a girl. Mr. and Mrs- C. M. Stratton spent Wednesday with their daughter, Mrs. D. A. Christian Mr. and Mrs. S. E. Anderson Mrs. C. M. Stratton, Mr. and Mrs. W. H. Drinkard, Mr, anc Mrs. C. T. Drinkard and Cla,yton Jr., attended the funeral of S P. Taylor in Bedford county Monday. Rev. H. B. Jennings Jr., of Leesburg, was Xmas guest of his brother, F. E. Jennings and family. Parks Jennings returned from Richmond Saturday nite after a stay of several weeks. While there tie contracted flu and re mained longer than expected Mrs. Jennings and four children were all in bed with flu when he reached home. Glad to say they are improving. Doctors are kept busy in this community as there is so much sickness. Mr. and Mrs. Clayton Drink ard and Clayton, Jr., returned Thursday from Franklin, where they spent the holidays. Miss Annie Alvis left Tuesday for Farmville, after spending the holidays at home.. She had as her guests Miss Alice Street Davis and Jeffers Street o f Lowesville, and Miss Evelyn Smith of Farmville. Prof. Kenneth Alvis of Athens Ga., visited home people Xmas."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mrs. W. D. <mark>Parris</mark> are happy over the"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mrs. W. D. <mark>Parris</mark> are happy over the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.49, 415.68, 1646.72, 1391.67], "bbox_id": "4da4b1663c", "file": "AppomattoxNewspapers_1908-1909a_0417.pdf", "page": 1, "text": "Xmas holidays passed off very quietly. Lots of visitors came back to spend Xmas with the home folk and some went away for the holidays. Quite a numoer of parties for the younger set Miss Virginia Chick entertained a number her friends at a birthday party on the evening of the 26th. Mis Hazel Taylor was hostess to the younger set Monday night. The flu epidemic is quite serf ous around here. Some families are all in bed. The schools wil remain dosed until Jan. 17th account of flu. Rev. A. I. Caudle spent Sat, night with Mr. W. S. Taylor and family. On account of flu there was no services at Hebron last Sunday. Rev. Caudle motorec to Durham, N. C., Sunday p. m jor his f amily, where they wen spending the holidays. Mr. J. H. Elder and family lire. G. A. Jacobs and children returned to Richmond - Sunday after spending the holidays with Mr. and Mrs. C M. Stratton, Miss Hazel Taylor left Sunday or Richmond to resume her duties in school. Mrs. J. T. Whitten spent part of the holidays in High oint, N. C., with her daughter. Mrs. Whitten ib sick with flu. Mrs. J. W. Neighbors visited her son, Jim, in Lynchburg few days last week. - Mr. and Mrs. W. D. Parris are happy over the arrival of their twins, boy and a girl. Mr. and Mrs. C. M. Stratton spent Wednesday with -their daughter, Mrs. D. A. Christian. Mr. and Mrs. S. E. Anderson, Mrs. C. M. Stratton,- Mr. and Mrs. W.-H. Drinkard, Mr, and Mrs. C. T. Drinkard and Clayton Jr,, attended the funeral of S P. Taylor in Bedford county Monday. - Rev. H. B. Jennings Jr., of Leesburg, was Xmas guest of his brother, F. E. Jennings and family. Parks Jennings returned from Richmond Saturday nite after a stay of several weeks. While there he contracted flu and re mained longer than expected, Mrs. Jennings and four children were all in bed with flu when he reached home. Glad to say they are improving. . Doctors are kept busy in this community as there is so much sickness. Mr. and Mrs. Clayton Drink- ard and Clayton, Jr., returned Thursday from Franklin, where they spent the holidays. Miss Annie Alvis left Tuesday for Farmville, after spending the holidays at home.. She had as her guests Miss Alice Street U av im n d Jeifers Street o f Lowesville, and Miss Evelyn Smith of Farmville. Prof. Kenneth Alvis of-Athens  Ga., visited home pdople Xmas."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mrs. W. D. <mark>Parris</mark> are happy over the"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mrs. W. D. <mark>Parris</mark> are happy over the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [901.46, 981.04, 1041.61, 1159.28], "bbox_id": "68f5caa49e", "file": "AppomattoxNewspapers_1974-1975a_0036.pdf", "page": 1, "text": "womanless beauty contest, carnival, camp Olympics, best dressed tribal chiefs, and best tribal songs and years. In addition, each afternoon cam pers took part in games and sports as they competed with members of opposing tribes. Campers are assisted by teen 4-Hers designated as Junior Leaders at 4-H Lamp. Junior Leaders assisting with the 1974 camp were Cynthia Hix, Lisa Dickerson, Pam Moore, Donna Paulette, Mike Hancock, Bax ter Parris, Ricky Wingfield and Joe Ford."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mike Hancock, Bax ter <mark>Parris</mark>, Ricky Wingfield and Joe"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mike Hancock, Bax ter <mark>Parris</mark>, Ricky Wingfield and Joe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [559.67, 490.9, 698.85, 671.54], "bbox_id": "224b3c5383", "file": "AppomattoxNewspapers_1974-1975a_0406.pdf", "page": 1, "text": "with their faculty advisers and department chairmen, may design their own course of study for the bachelors degree or, in selected areas, a four-year m asters degree program. Other features of the Scholars program include di rected independent study, early access to higher level courses, andor public pre sentation of an original study or creative work during the senior year. Miss Parris is the daughter of Mr. and Mrs. Roland B. Parris, Jr. At Appomattox High"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "the senior year. Miss <mark>Parris</mark> is the daughter of"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "the senior year. Miss <mark>Parris</mark> is the daughter of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [274.3, 661.47, 546.6, 704.11], "bbox_id": "de25d82ccc", "file": "AppomattoxNewspapers_1974-1975a_0321.pdf", "page": 1, "text": "WINNERS IN THE 4-H DOG SHOW in the Sporting Class shown above, left to right, are Robin Bollinger, Susan Parris, Wendy Macintosh, Jayne Doss, David Williams, Chad Deavers, and Mary Dyess."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "are Robin Bollinger, Susan <mark>Parris</mark>, Wendy Macintosh, Jayne Doss,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "are Robin Bollinger, Susan <mark>Parris</mark>, Wendy Macintosh, Jayne Doss,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [163.86, 912.55, 337.62, 1266.23], "bbox_id": "ba44eaabb4", "file": "TimesVirginian_1978_0378.pdf", "page": 1, "text": "William Clifford Parrish, 58, of Rt. 6, Dixie Airport Road, Madison Heights, died at 1015 p.m. Friday at his home after a short illness. IQs wife is Jessie True Burt Parrish. Born in Lynchburg, be was a on of tin lafeKjSRua PateHkdhSEI Parrish and Nettie LeGrande Parris. He was an employee of Gorlin Manufacturing Co., a veteran of World War H, having served in the Army Air Force, and a member of College Hill Baptist Church. He was also a member of Masonic Blue Lodge. In addition to his wife, he is survived by two sons, William Clifford Parris H of Forest and Michael B urt P arrish of Madison Heights three broth ers, A rthur T. Davis of Newport News and Jack C. Davis and George T. DaviS, both of Appomattox and one granddaughter, Theresa Di anne Parris of Greer, S.C. Funeral services were con ducted at 3 p.m. Monday from Whitten Park Avenue Chapel. Burial was in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Parrish and Nettie LeGrande <mark>Parris</mark>. He was an employee"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Parrish and Nettie LeGrande <mark>Parris</mark>. He was an employee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1823.3, 647.18, 1992.73, 706.18], "bbox_id": "292cc78ffb", "file": "AppomattoxNewspapers_1960-1962b_0431.pdf", "page": 1, "text": "William Clark Ferguson, son of Mr. and Mrs. Jesse Ferguson, of Appomattox, is at Parris Island, South Carolina, where he is taking his basic training -with the Ma rines."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "William Clark Ferguson, son of Mr. and Mrs. Jesse Ferguson, of Appomattox, is at <mark>Parris</mark> Island, South Carolina, where he is taking his basic training -with the Ma rines."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "William Clark Ferguson, son of Mr. and Mrs. Jesse Ferguson, of Appomattox, is at <mark>Parris</mark> Island, South Carolina, where he is taking his basic training -with the Ma rines."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1514.15, 824.1, 1795.5, 911.39], "bbox_id": "4f005136aa", "file": "TimesVirginian_1976_0474.pdf", "page": 1, "text": "When the Appomattox Senior 4-H Club gave a Christmas party last week, fourteen first and second graders took part in the party. The photos above were taken during the prty  4-Hers helping with the party were Mike Hancock, Moly Hanoy, Tamara Nash, Baxter Parris, Nathan Smith, Donald Parris, Sharon Roach, Rita Reynolds, Bill Vaughan, Bud Rosser, Mary Dyess, Joe Ford, and Gaye Phelps."}, "highlight": {"text": {"matched_tokens": ["Parris", "Parris"], "snippet": "Hanoy, Tamara Nash, Baxter <mark>Parris</mark>, Nathan Smith, Donald <mark>Parris</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris", "Parris"], "snippet": "Hanoy, Tamara Nash, Baxter <mark>Parris</mark>, Nathan Smith, Donald <mark>Parris</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1511.05, 1135.63, 1979.15, 1460.35], "bbox_id": "34eea8b19e", "file": "AppomattoxNewspapers_1908-1909a_0476.pdf", "page": 1, "text": "were more satisfactory than last year. We hear the cry my to-ard, _ _____ ___ bacco did not pay me out. Gobble, Eya Fergusom SuechS!  Mercantile business ia on theMers, Pearl Burnett, Hilda bum m Gladstone and the BenfjOBrien, Garland OGrien.  vreek merchants are getting the  Fourth GradeSarah Drink- benefit of it tool Some are sell-lard, Virginia Beal, Elizabeth mg some items below cost just Harris, Iva Childers Defornia to get the businessthere is no Gobble, Mildred Abbitt, libfite profit in that. Abbitt, Wj Mis Carter, Herbert Automobile traffic is slow nowLucado, Maynard OBrien, Har roads ate in awful condition. Wejris Almond, Berkley Garrett, are glad to learn thatwe are toj Charles Torrence, have a hard-surface road from Third gradeLorrain Hamil- Appomattox to Bent Creek in the j ton, Mary Carter, Maggie Gal- near future.   her, Earl Morris, Edwm Lucado, The Bent Creek Garage form-j Robert Patterson Arthur Ayers, I  erly run by B. J. Parris is fw Walter OBrien, Charley Abbitt! I a  i .,- -   T rent. Good stand, reasonable Second gradeThelma Caving- Ue WOtance Co. rent and a paying business for ton, Emma Robertson, Annie  aetA c R I f  . toe right man. Robertson, Dorothy OBrien,An- HfliVCy J. R. Mark has been suffering nie Torrence, Gertrude Ahhitt  -  with throat trouble for gevprniLula Harris. Magdalinp Pn,n I opeaai Agent days. j baum, Junior Carter, Wesley Car- ___ Mrs. W. W. Thornhill has been ter, Berkley Ferguson, Carrol I ,a - v wek agaim------------------------4QhiidaJohn Smtta Policy. Mrs. D. W. Jamerson came Kinney, James Smith, James."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "run by B. J. <mark>Parris</mark> is fw Walter OBrien,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "run by B. J. <mark>Parris</mark> is fw Walter OBrien,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2114.63, 158.16, 2256.9, 470.85], "bbox_id": "44a5964b7b", "file": "TimesVirginian_1976_0464.pdf", "page": 1, "text": "were Bass Category Ray Phelps 1st, Dennis Cuneo 2nd, Janis Richardson 3rd Catfish Darryl Macintosh 1st, Michael Marshall 2nd, Jerry Hudson 3rd Bream and Crappie Jack Williams 1st, Steve Mayberry 2nd,.Todd Pickett 3rd. Awards for the 1976 4-H Wildlife Feed Patch Contest were presented by James A. Smith, Extension Agent, on behalf of the Oakville Ruritan Club. Top winners were 1st Kevin Mitchell, 2nd Virginia Marshall, 3rd Donald Parris, 4th Mark Elliott, 5th Diann Harvey. The Oakville Ruritans have sponsored this program for the past several years. 4-Hers planted 34 feed patches in 1976. Special certificates were also awarded to outstanding first year 4-H members in 1976. These awards were given to Vivian Seay, Debbie McCor mick, Tambra Hamlet, Connie Clifton, Jay Chenault, Eliza"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Virginia Marshall, 3rd Donald <mark>Parris</mark>, 4th Mark Elliott, 5th"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Virginia Marshall, 3rd Donald <mark>Parris</mark>, 4th Mark Elliott, 5th"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1630.73, 698.27, 1773.99, 973.51], "bbox_id": "01de9e1bbf", "file": "AppomattoxNewspapers_1974-1975a_0571.pdf", "page": 1, "text": "well, Kenny Shorter, Tony Ferguson, Susan Shorter, Che ryl Walton, Sharon White, Lisa Moore, Rhonda Nash. In addition to the top winners above, the following senior acts received blue ribbons Vicki Glover who performed a ventriloquist act with her puppet Sidney Pam Ford and Susan Parris who perform ed a skit entitled Wake Up Freddy Mitchell who sang Daisy Jane and Games People Play while accompani ed by Faith Vaughn Cheryl Adams who played a Medley of Love Songs on the piano Rita Ferguson, Robbie Carter, and Rhonda Nash who sang One Tin Soldier, and Polly Carter who performed Calyp so on the piano. Other blue ribbon acts in the J ifh io rD iv isib n were as follow s  Mike McCoy who"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Pam Ford and Susan <mark>Parris</mark> who perform ed a"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Pam Ford and Susan <mark>Parris</mark> who perform ed a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2327.43, 194.55, 2469.24, 511.78], "bbox_id": "d42088941d", "file": "AppomattoxNewspapers_1971-1973a_0510.pdf", "page": 1, "text": "Watson, Monica Ewers, Paula Franklin, Brenda Garrett,Kar en Marshall, Mary McCraw, Debbie Netherland, Debbie Stratton, Kay Stratton, Deborah Tweedy. SOPHOMORE CLASS PRINCIPALS LIST - David Marshall, Michael Quinn, Mary Parris, Cathy Paulette, Donna Paulette, Debbie Rush. HONOR ROLL Allen Austin, Warren Coleman, Gary Harris, Steve Lamb, Kaye Chenault, Annette Conner, Brenda Gar rett, Lynn Glover, Cindy Guill, Denise Hamlett, Gay Honeycutt, Marcella Lively, Teressa Lu cas, Debbie Martin, Nancy May berry,. Julia Moore, Pam Moo re, Joanne Scott. HONORABLE MENTION - Lewis Martin, Marvin Watson, Lacy Webb, Ricky Wingfield, Patricia Doss, Joyce Foster, Shelin Franklin, Delophine Le wis, Stephanie Martin, Diane Parson, Carla Verner, Joan Wright NINTH GRADE"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Marshall, Michael Quinn, Mary <mark>Parris</mark>, Cathy Paulette, Donna Paulette,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Marshall, Michael Quinn, Mary <mark>Parris</mark>, Cathy Paulette, Donna Paulette,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [284.4, 1280.43, 434.89, 1824.9], "bbox_id": "3f463013e7", "file": "TimesVirginian_1976_0306.pdf", "page": 1, "text": "Wanda Mosley, Rebecca Moss, Mary Mullins, Tamara Nash, Sharon Overton, Arlene Pan key, Velma Pankey, Michelle Paris, Juanita Patterson, Pen ny Patterson, Pam Phelps, Susan Phelps, Teresa Powell Room 322  BOYS - Myron McCoy, Clark McGuire, Freddy Mitchell, Jerry MitcheU, Mit chell, Randy Moore, Clifton Mosley. _ GIRLS - Vicky Reed, Rita Reynolds, Gail Ragland, Cindy Roach, Sharon Roach, Melinda Robertson, Melissa Scott, Doris Smith Cafe - Tolley - BOYS - Ronald Mosley, Otis Mosley, Tliunwgi Moslsy, William Mos ley, Larry Mottley, Andy Mullins, Jay Musick, Chuck Padgett, Dennis Page, Tim Page. Donald Parris, Scott Paulette, Andy Poole, Mike Powell GIRLS - Pam Smith, Susan Smith, Vanessa Smith, Pam Taylor, Linda Torrence, Gwen Turner, Michelle Tweedy, Faith Vaughan, Gladys Walker, Jill Walton, Theresa Watts, Lisa White, Brenda West, BmnqrWhmfc, Bonnie Williams. Cafe - Martin - BOYS - Thomas Randolph, Cliff Rho- denizer, Aeil Itree, Charles Rice, Kerry Richardson, Jimmy Roach, Kenneth Robertson, Clarence Robinson, David Robinson, Bud Rosser, Clar ence Rosser, Daniel Rosser, Mike Rowe, Dwayne Scruggs, Greg Scruggs, Charles Smith, Tony Smith, David Stratton, Frankie Tanner, Mark Thomas, David Thompson, Bill Vaughan, Kenneth Walker, Randy Wa terman, Carl Watson, Sammy Webber, Robert West, Dave"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Page, Tim Page. Donald <mark>Parris</mark>, Scott Paulette, Andy Poole,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Page, Tim Page. Donald <mark>Parris</mark>, Scott Paulette, Andy Poole,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2203.91, 567.61, 2375.73, 896.52], "bbox_id": "ec5fb5b05e", "file": "AppomattoxNewspapers_1954-1955a_0031.pdf", "page": 1, "text": "WALTER HENRY NAMED PRESIDENT OF LOCAL METHODIST CLUB A new organization of Methodist Men in Meomrial Methodist Church, Appomattox, has been chartered by Methodisms General Board of Lay Activities in Chicago. Officers of the new group are Walter Henry, Appomattox, presi dent Fred Smith, Appomattox, vice president R. B. Parris, Jr., Appo mattox, secretary. The local group is one of more I than 7,000 Methodist Men organi zations out of a total goal of 10, 000 clubs which the board plans to charter by 1956. It is estimated that 2,000,000 men in the Methodist Church are pros pective members of Methodist Men clubs. Robert G. Mayfield, executive secretary of the board, states that, We seek to mobilize through Meth odist Men the tremendous power and enthusiam of the men of the church. Our purpose is to give strength to the program of Christ and His Church through consecra ted service of men in every local curch of Methodism."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "vice president R. B. <mark>Parris</mark>, Jr., Appo mattox, secretary."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "vice president R. B. <mark>Parris</mark>, Jr., Appo mattox, secretary."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1342.51, 191.17, 1436.65, 313.23], "bbox_id": "3ff5033677", "file": "AppomattoxNewspapers_1974-1975a_0190.pdf", "page": 1, "text": "w p m ix  u ie t a smooth, orderly i Mr. Sweet pre special slide prea the identification Members were encu participate on thd identification team.  Refreshments weJ and the meeting adjJ Mary Parris, presides Joe Ford"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "the meeting adjJ Mary <mark>Parris</mark>, presides Joe Ford"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "the meeting adjJ Mary <mark>Parris</mark>, presides Joe Ford"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1769.66, 205.59, 1913.89, 1070.26], "bbox_id": "c5c905fd4b", "file": "AppomattoxNewspapers_1971-1973a_0627.pdf", "page": 1, "text": ".vinorc, Juriy Morris. Donna J Mottly, Debbie Netherland. Dianne Parson. V a n e s s a J Phelps. Joanne Scott, Charlene Shrock, Cynthia Simmons, Kitty Simpson, Debbie Strat ton, Kay Stratton, Kathy Tuck, Jedwel Williams, Ricky Wing field, Sue Moore and Rhonda Mitchell. Six-Weeks Honor Roll - Mike Belter, Ricky Book. Clifton Carson, Warren Coleman, Mark Eggleston, Keith Fergu son, Gary Hudson, Chip Jamerson, Hampton Johnson, Ricky Lewis, Allen Litchford, William Mann, Michael Quinn, A1 Sears, Bryan Selz, Robert Smith, James Torrence, Joe Vaughan, Doug Webb, Brenda Almond, Lelia Austin, Virginia Beaty, Marie Booker, Jane Conner, Evelyn Crain, Ellen Doss, Vickie Elder, Joanne Elder, Monica Ewers, Shelia Franklin, Brenda Ferguson, Miriam Ferris, Brenda Garrett, Connie Gillaspie, Lynn Glover, Martha Grishaw, J u a n i t a Hamlett, Martha Harvey, Sue Harvey, Janet Hix, Gay Honeycutt, Pam Lawson, Pat Hudson, Bonnie Johnson, Dale Layne, Gail Layne, Deborah Lucas, Teresa Lucas, Teresa Lynch, Debbie Martin, Penny Martin, Kathy Mitchell, Pam Moore, Susan Moore, Brenda Morris, Hope Paulette, Phyllis Ramsey, Linda Sullivan, Con nie Scott, Debbie Tweedy, Marva Tweedy, Brenda Wat kins, Linda West, Nancy Winston, Carol Wood, Dianne Wooldridge, Joan Wright, Carla Varner, Julia Moore. Semester Principals List Phillip Harris, Gary Hudson, David Marshall, Jane Conner, Brenda Ferguson, Rita Inge, Deborah Jamerson, P am Moore, Mary Parris, Cathy Paulette, Donna Paulette, Donna Stanley Semester Honor Roll - Mike Belter, Warren Coleman, Mark Eggleston, Keith Ferguson, Mike Gallier, Gary Harris, Chip Jamerson, H a m p t o n Johnson, Bobby Layne, Bill Lewis, Marvin Mitchell, Mich ael Quinn, Kent Ramsey, A1 Sears, Bryan Selz, James Torrence, Joe Vaughan, Mar vin Watson, Doug Webb, David Wheeler, Brenda Al mond, Lelia Austin, Lou Beamer, Virginia Beaty, Billie Brightwell, Joan Coleman, Ellen Doss, Vickie Elder, Monica Ewers, Shelia Franklin, Miriam Ferris, Jane Hix, Janet Hix, Brenda Garrett, Connie Gillaspie, Lynn Glover, Sue Harvey, Julia Hesson, Gay Honeycutt, Pat Hudson, Bon nie Johnson, Pam Lawson, Dale Layne, Gail Layne, Marcella Lively, Deborah Luc as, Teresa Lucas, Teresa Lynch, Penny Martin, Steph"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "P am Moore, Mary <mark>Parris</mark>, Cathy Paulette, Donna Paulette,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "P am Moore, Mary <mark>Parris</mark>, Cathy Paulette, Donna Paulette,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [597.85, 512.41, 763.3, 718.06], "bbox_id": "979424d27a", "file": "AppomattoxNewspapers_1926-1933a_0156.pdf", "page": 1, "text": "Victor Burnette, of Rocky Mount with his wife, visited in the home of her parents, Mr. and Mrs. T A. Drinkard, for the week-end. Mr. A. R. Caudle and little daughter Catherine, Mrs. Frank Jennings and son Lloyd, were dinner guests of Mrs. Henry and Clayton Drinkard, Tuesday. Rev. A. S. Caudle, who has been spending a month in Flor ida, is expected home next week. Little T. H. Parris, small son of Mr. and Mrs. W. D. Parris, who has been ill with pneumonia, was taken to the hospital Mon-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "week. Little T. H. <mark>Parris</mark>, small son of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "week. Little T. H. <mark>Parris</mark>, small son of Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.7, 734.2, 1595.7, 763.85], "bbox_id": "e8df7779fd", "file": "AppomattoxNewspapers_1952-1954a_0017.pdf", "page": 1, "text": "Ver rilan 4 Ljiapirf 597 Lou, fee mSïy reunion was flÊ the ironie of Mr. and iewis Parris."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Ver rilan 4 Ljiapirf 597 Lou, fee mSïy reunion was flÊ the ironie of Mr. and iewis <mark>Parris</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Ver rilan 4 Ljiapirf 597 Lou, fee mSïy reunion was flÊ the ironie of Mr. and iewis <mark>Parris</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [785.04, 1073.21, 925.29, 1376.49], "bbox_id": "658b2906a0", "file": "AppomattoxNewspapers_1971-1973a_0257.pdf", "page": 1, "text": "ver Beasley, Millicent Martin, Sue P e r d u e , Kathy OBrien, Cheryl Robinson, Bonita John son, Cindy Harris, Ann Sears, Steve Weakley, Jack Smith,Cin dy Smith, Maryjane Smith. GRADE 9 - A Honor Roll - Warren Coleman, Shelia Frank lin, David M ar shall, Nancy Mayberry, Julie Moore, Mary Louise Parris, Cathy Paulette, Michael Quinn, Donna Paulette. B Honor Roll  Sarah Brown, Julie Chambers, KayeChenault, Annette Conner, Vanessa Phe lps, Diane Parsons, Patricia Doss, Wanda Harden, Teresa Lucas, Susie McCormick, Pam Moore, Marvin Watson, Gay Honeycutt, R ho nd a Mitchell, Douglas Belter, Allen Litch - ford, Deborah Puckett, Donna MotUey, Juanita Terry, Pam Williams, Judy Mayberry, Le wis Martin, Mike Ramsey .Vic tor Banton, Denise Hamlett, Joan Wright, Joe Ferris,Tho mas Wheeler, Lynn Glover,Cin dy Guill."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Julie Moore, Mary Louise <mark>Parris</mark>, Cathy Paulette, Michael Quinn,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Julie Moore, Mary Louise <mark>Parris</mark>, Cathy Paulette, Michael Quinn,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [257.76, 244.25, 407.04, 1037.14], "bbox_id": "c5aa372d41", "file": "AppomattoxNewspapers_1962-1965a_0430.pdf", "page": 1, "text": "Vacation Church School at Me morial Methodist Church was conducted last week with eight classes for pre-schoolers through the sixth grades. Seventy - six children were enrolled with sixty one attending every session and sixty-seven attending four days. Workers in the school were Kindergarten I, Mrs. Peggy Lawson, Mrs. Martha Morris, Mrs. Merle Lawson, Joyce Car ter, Judy Smith, Beverly David son and Faye Honeycutt Kinder garten II, Miss Joan Martin, Mary Lou Martin and Betty Trent Primary I, Mrs. Charlotte Jennings, Susan Ruth Jennings and Ann Sheets Primary II, Mrs. Estalene McCraw, Linda! Grinels, and Mary Agnes Wagon-1 er Primary Ilf, Mrs. Kay Steele Nancy Steele and Louise Wheel-! er. Junior I, Mrs. Jean Pitsenber- ger, Mrs. Nancy Carson and Carlene Pitsenberger Junior n , I Mrs. Gladys Moon, Mrs. Loraine I Montgomery, Judy Goodrich, and Michelle Stanley Junior III, j Mrs. Ruby Moses and Joan! Moses. Others who helped with the transportation, refreshments and  program were Mr. Graham Pitz - 1 enberger, Mr. Roy Moon, Mr . 1 Buddy Carson, Mr. Bobby Phe-i Ips, Mr. Robert Montgomery, Mr. Paul Cawthorn, Mrs. Charlie Carter, Mrs. Jack Layne, Mary Lou Jamerson, Mrs. R. M. Hon eycutt, Mrs. Thomas Stanley, Mrs. Carter Martin, Mrs. A. A. Babcock, Mis. Martin Webb, Mrs. A. C. Phillips, Mrs. Beni Wheeler, Mrs. F. s. Wagoner, Mrs. T. T. Martin, Mrs. Mark! Weatherly, Mrs. Paul Cawthorn, Mrs. L. N. Hemcall, and Mrs. I J. E. Jamerson. Mrs. H. D. Folks served as director of the school. Children attending wereSusan i Rosser, Shelly Davidson, Sue I Lawson, Susan Doss, Gordon Lawson, Baxter Parris, Bob Weatherly, Rindy Lawson, Kim Ferguson, Cindee Morris, Ann McCraw, Sue Thomas, S. L. Fer guson, Jay Ferguson, Tommy Ray Stanley, Cindy Almond, and Kit Carson Tony Phelps, Ann Sears. Rich ard Ferguson, Beth Lawson, J. T. Jones, Scott Montgomery, and Jerry Wayne Conner Jamie Kay Carson. Linda Gay Honeycutt, Charles Thomas Mos es in, Tommy Wheeler, Mary Louise McCraw, J a n i e Lou Beamer, Brenda Dale Layne. Puttie Sue Kerr, Gail Layne, Jane Conner, Cindy Kay Guill! Karen Montgomery, David Jones A1 Sears, Mary Ellen Schrock, Donna Stanley, Kay Honeycutt, Melanie Folks, Susan Weatherly, Douglas Webb, and David Wheel er Jack Layne, Elmer Beamer, Lee Montgomery, Steve Almond! Steve Lawson, Joe Lawson, Ka-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Doss, Gordon Lawson, Baxter <mark>Parris</mark>, Bob Weatherly, Rindy Lawson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Doss, Gordon Lawson, Baxter <mark>Parris</mark>, Bob Weatherly, Rindy Lawson,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2118.63, 1458.53, 2292.65, 1811.28], "bbox_id": "7a38ee9b78", "file": "AppomattoxNewspapers_1949-1952a_0085.pdf", "page": 1, "text": "v  r rSVE Anderson and Mr. and Mra. Martin Kraus attended the miSre a Concord Friday night. Mr. and Mra. Clarence Brooks, of Lynchburg Misses Josephine and Eunice Martin, of Lynchburg were guests of Mr. and Mra. Claude Map tin during the week-end. . Mr. nd Mrs. C. M. Stratton at tended a dinner party Saturday evening at the home of Mr. and H- Burru on Woodlawn Ave., Lynchburg, celebrating the an niversary of Mr. W. R. Seays 25th year of service with the Burrus Land and Lumber Co. Mrs. R. H. Routon and sons, Shel ton and John Bpent Sunday with Mra. Marvin Stratton. Recent guests of Mr. and Mra. Louis Parris and Mr. and Mrs. Claude Martin included Rev. and Mrs. IX M. Spence, of Appomattox Mrs. C.M. Caldwell, Mrs. T. M. Martin, Mrs. JBob Martin, Mrs. Em mett Mays, Mrs. H. D. Martin, Em ory Martin, W. C. Story, Mrs. L. E. Martin, Mr. and Mrs. Pete Martin Rachel Martin and Dorothy Ana Burge. Mrs. P. B. Stratton, Miss Edna Adcock, Mrs. G. E. Hughes and Miss Verna Harding went to Flat Creek Baptist Church Wednesday to the Appomattox W. M. U. Associa tion, from Hebron Church."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mr. and Mra. Louis <mark>Parris</mark> and Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mr. and Mra. Louis <mark>Parris</mark> and Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.66, 698.03, 1647.21, 949.09], "bbox_id": "9cec4f68ec", "file": "AppomattoxNewspapers_1974-1975a_0242.pdf", "page": 1, "text": "US Honor Roll Rebecca Gunter, Susan Hamlin, Cindy Harris, Jeff Harrison, Nancy Hoke, Becky McIntosh, Tammy Martin, Debbie Morrel, Milca Reynolds, Ann Sears, Richard Shelton, Cindy Smith, Maryjane Smith, Wilson Sta ples, Bonnie Terry. Twelfth Grade - Sarah Brown, Gary Carter, Julie Chambers, Warren Coleman, Annette Conner, Joe Ferris, Debra Fleshman, Joyce Foster, Brenda Garrett, Connie Gillas- pie, Gary Goin, Denise Ham- lett, Wanda Harden, Kim Harrison, Alan Jones, Dela- phine Lewis, Nancy Lewis, Diane Parsons, Mary Parris, Vanessa Phelps, Debbie Puck ett, Debbie Rush, Charlene CM a Tneri rBai"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Lewis, Diane Parsons, Mary <mark>Parris</mark>, Vanessa Phelps, Debbie Puck"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Lewis, Diane Parsons, Mary <mark>Parris</mark>, Vanessa Phelps, Debbie Puck"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.69, 390.52, 885.0, 976.99], "bbox_id": "2146dbd165", "file": "TimesVirginian_1978_0228.pdf", "page": 1, "text": "United States Senator Harry F. Byrd, Jr. spoke at Lonwood Colleges graduation cere monies on Saturday, May 13th. Senator Byrd has spent 30 years in government, serving in the Virginia Senate fpr 18 years prior to his appointment to the U. S. Senate in 1965. He was , elected senator in 1966, and re-elected in 1970 and 1976. Senator Byrd. was introduced i by Mrs. Raymond E. Brown, Jr., of Hampton, rector of Longwoods Board of Visitors. A total of 446 degrees were  awarded, including 392 bacca-  laureate degrees and 54 1 masters degrees. This was the largest number of graduate j degrees awarded by Longwood since the graduate program was authorized in 1954. The diplomas were presented by Longwoods president, Dr. Henry I. Willett, Jr., and vice president for academic affairs. Dr. Carolyn Wells. Area students receiving degrees were Dennis Gene Clarkson of Pamplin, B. S. in Elementary Education Rhonda Fulghum Jones of Spout Spring, B.S. in Elementary Education Russell Lewis Tom-  lin of Spout Spring, B.S. in Elementary Education Kathy Taylor Whately of Spout Spring, M.S. in Reading Mary Louise McCraw of Appomattox of Appomattox, B.S. in Health  Physical Education Donna Paulette Terry of Appoipattox, cum laude, B.S. in Elementary Education Mary Louise Parris of .Appomattox, summa cum laude, B.S. in English Bonnie Jean Pugh Herncall of Appo mattox, M.S. in Supervision and Barbara Almond Shelton of Appomattox, M.S. in Supervis ion. 1 Following the graduation ceremonies, a brunch was held iri the Blackwell Dining Hall for"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Elementary Education Mary Louise <mark>Parris</mark> of .Appomattox, summa cum"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Elementary Education Mary Louise <mark>Parris</mark> of .Appomattox, summa cum"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [882.48, 375.27, 1056.45, 937.82], "bbox_id": "8269e30ab9", "file": "AppomattoxNewspapers_1943-1947a_0052.pdf", "page": 1, "text": "United States marines lay claim to being the best fed of the worlds fighting men. And it is easy to see why the Leathernecks believe their chow is so superior. A menu picked at random from any marine base throughout the country is a good il lustration. Heres onebreakfast at the ma rine corps training station at Parris Island, S. C. oatmeal with cream, bacon and eggs, fried potatoes, but tered toast, coffee and fruit. And heres what the boys at Quan- tico, Va., had for dinner on Sunday, September 12 roast turkey with dressing and giblet gravy, mashed potatoes, buttered string beans, to mato and lettuce salad, bread and butter and ice cream. Another sample menu will round out the day. This is a typical Sun day evening meal cold cuts, baked beans, sliced cheese, beet and onion salad, bread and butter, doughnuts and coffee. Each and every meal prepared for the fightinest body of men on earth can well satisfy the most ex acting gourmet. Carefully designed menus of at tractive and well-prepared food nec essary for the needs of these sea going soldiers is an every-meal proj ect. It is most important that the food give the number of vitamins and calories required by the nature of their work. The amount of food may vary ac- I cording to climatic conditions but ! marines abroad eat of the chow of the same quality and quantity as their buddies back home. The food which the enlisted man of today eats is as good as, if not better than, that which he had been getting in civilian life. The corps points out that the food is more wholesome because tlje in dividual is assured a scientifically balanced diet, whereas in civil life he may pick his food, ignoring vict uals that make up a proper diet. Meals in the marine corps are pre pared in smaller quantities than is usual elsewhere so that each batch is uniform. The men who prepare the foods are experts. Released by Western Newspaper Union. ---------- O ----"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "corps training station at <mark>Parris</mark> Island, S. C. oatmeal"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "corps training station at <mark>Parris</mark> Island, S. C. oatmeal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [875.74, 374.09, 1042.8, 935.4], "bbox_id": "2a46178f08", "file": "AppomattoxNewspapers_1943-1947a_0053.pdf", "page": 1, "text": "United States marines lay claim to being the best fed of the worlds fighting men. And it is easy to see why the Leathernecks believe their chow is so superior. A menu picked at random from any marine base throughout the country is a good il lustration. Heres onebreakfast at the ma rine corps training station at Parris Island, S. C. oatmeal with cream, bacon and eggs, fried potatoes, but tered toast, coffee and fruit. And heres what the boys at Quan- tico, Va., had for dinner on Sunday, September 12 roast turkey with dressing and giblet gravy, mashed potatoes, buttered string beans, to mato and lettuce salad, bread and butter and ice cream. Another sample menu will round out the day. This is a typical Sun day evening meal cold cuts, baked beans, sliced cheese, beet and onion salad, bread and butter, doughnuts and coffee. Each and every meal prepared for the fightinest body of men on earth can well satisfy the most ex acting gourmet. Carefully designed menus of at tractive and well-prepared food nec essary for the needs of these sea going soldiers is an every-meal proj ect. It is most important that the food give the number of vitamins and calories required by the nature of their work. The amount of food may vary ac cording to climatic conditions but marines abroad eat of the chow of the same quality and quantity as their buddies back home. The food which the enlisted man of today eats is as good as, if not better than, that which he had been getting in civilian life. The corps points out that the food is more wholesome because tl?e in dividual is assured a scientifically balanced diet, whereas in civil life he may pick his food, ignoring vict uals that make up a proper diet. Meals in the marine corps are pre pared in smaller quantities than is usual elsewhere so that each batch is uniform. The men who prepare the foods are experts. Released by Western Newspaper Union. --------------------------- o----------"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "corps training station at <mark>Parris</mark> Island, S. C. oatmeal"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "corps training station at <mark>Parris</mark> Island, S. C. oatmeal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [705.59, 430.49, 874.49, 1007.4], "bbox_id": "2fdce1d74b", "file": "AppomattoxNewspapers_1939-1943a_0545.pdf", "page": 1, "text": "United States marines are rated among the best-trained soldiers in the world. One major reason for this rating is found in the basic training every marine recruit re ceives in boot camp at either Parris Island, S. C., or San Diego, Calif. Key figures in putting thousands of recruits through this rigorous six- weeks period of training are groups of versatile non-commissioned offi cers known as Drill Instructors. The DIs, as they are called, work in pairs. JCs recruits arrivé from ïvery corner of the nation, they are formed into platoons of from 66 to 74 men and each platoon is placed under the charge of a duo of DIs. It then becomes the duty of the Drill Instructors to transform some 70 men from every walk of life farmers, mechanics, accountants, reporters, truck drivers, schoolboys into a trained, disciplined group of men who walk, talk, think and act in the best marine manner. The average age of their charges is 20. And they have just six weeks for the task. The DIs must guide their men through intensive practice in drill ing, manual of arms, combat prin ciples, dressing, shooting the rifle and pistol, throwing the hand gre nade and handling the bayonet. The DIs must be good teachers in order to give instructions in first aid, field sanitation, military cour tesy, guard duty, scouting and pa trolling, security on the march and other subjects with which ev ery marine is expected to be fa miliar. They must set an example in mili tary courtesy, neatness, military bearing and countless regulation proceedings. Probably most important of all, however, the Drill Instructors teach discipline. They teach men to obey orders without question  to do what they are told, when they are told, whatever the orders may be. At the end of the boot period, the platoon of well-trained marines leaves for advanced work at special schoolsbut the DIs remain behind. They get the evening offand start in the folowing day with 66 to 74 new recruits. Released by W estern N ew spaper Union. ---------- o----------"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "boot camp at either <mark>Parris</mark> Island, S. C., or"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "boot camp at either <mark>Parris</mark> Island, S. C., or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1006.13, 448.06, 1272.63, 605.7], "bbox_id": "a8ed2d7c5f", "file": "AppomattoxNewspapers_1971-1973a_0475.pdf", "page": 1, "text": "Trophies were awarded winners in the first annual tennis tournament at Falling River Country Club on Sunday after noon. The winners, pictured above from left to right are Mark Eggleston, Tommy OBrien and Freddy Mitchell. In the final play in the Junior Division, for boys under 13 years of age, Freddy Mitchell defeated Donald Parris in sets of 6-1 and 6-3. In the Intermediate Division, ages 13 and up, Mark Eggleston defeated his brother, Mitch Eggleston, in sets of 7-5 and 7-5. In the Senior Division for adults, Tommy OBrien defeated Sam Kerr in sets of 6-0,6-4 and 6-3 to win, the trophy. FRCC plans to hold another tournament next year and will conduct the tournament play under singles elimination re gulations. Mark Weatherly is Chairman of the Tennis Com mittee."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Freddy Mitchell defeated Donald <mark>Parris</mark> in sets of 6-1"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Freddy Mitchell defeated Donald <mark>Parris</mark> in sets of 6-1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [967.67, 347.18, 1156.0, 832.62], "bbox_id": "5692d3cf70", "file": "AppomattoxNewspapers_1949-1952a_0043.pdf", "page": 1, "text": "Trinity Road, Jan. 18.- Mrs. Lewis Parris and Mrs. Claude Martin at tended the M. Y. F. Sub-District meeting of the Appomattox Circuit of Methodist Churches at Memorial Methodist Church Tuesday night at Appomattox. , Mr. and Mrs. Tommy Bondurant and family, of Sherwill were guests of Mrs. Bondurants parents, Mr. and Mrs. E. C. Wooldridge on last Sunday. I Mr. and Mrs. E. P. Gills and Mr. and Mrs. Hunter Parris, of Lynch burg visited in the home of Mr. and Mrs. Lewis Parris during the week end. Mrs. E. P. Tanner was the dinner guest of Mrs. S. E. Anderson and Mrs. 1ddie Routon Wednesday. i Miss Eileen Weakley and Mr. Warren Wood, of Lycnhburg visit ed Miss Weakleys parents, Mr. and Mrs. W. A. Weakley, for the week end.  j Mr. Jimmy Stratton visited Mrs.  Stratton and little daughter, Diann,  in South Boston over the week-end. j  The Rev. Twyman Williams filled his regular appointment at Stone- I wall Church Sunday. He was the. j dinner guest of Mrs. E. H. Carson j and Mrs. C. M. Stratton. If i I Little 1 heihert and Bill Stratton , are on the sick list. Mr. and Mrs. Parks Jennings re cently visited Mrs. Jennings sister, J Mrs. Keeling Sisson and family in Richmond, and Mr. Jennings broth er, the Rev. H. B. Jennings and family, in Drewryville. .. . Quite a large number from the Hebron B. T. U. attended the group meeting of B. T. U.s at Red Oak Church last Friday night."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Jan. 18.- Mrs. Lewis <mark>Parris</mark> and Mrs. Claude Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Jan. 18.- Mrs. Lewis <mark>Parris</mark> and Mrs. Claude Martin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1983.86, 340.36, 2158.21, 711.04], "bbox_id": "755cd918dd", "file": "AppomattoxNewspapers_1947-1949a_0599.pdf", "page": 1, "text": "Trinity Road, Dec. 7.? The coun ty was saddened this past week by the death of Miss Mary Savedge, county schqol supervisor. We re gret the passing of this fine lady, who has served the county schools for fifteen years. Miss Ndine Bur nett, Mrs. Mary Taylor and Mrs. Parks Jennings attehded the funer al at Waverly Monday afternoon. The Hebron W. M. S. will meet Sunday morning after the Sunday School. Topic Christ, the Answer for the World. Leader Mrs. Clay ton T. Drinkard. A Christmas play, the Manger, will be presented at Hebron Church Friday, December 23, at 8 P. M. A mission study class will be held at Hebvon Sunday at 2 P. M., by Mrs. Foster, of Lynchburg. Mrs. Lula Taylor lias concluded a months visit with her daughter, Mrs. John Watson and family, of Staunton. Mrs. Claude Martin accompanied her sister, Mrs. Mary Lloyd  and family tq Richmond last Sunday. They spent the Thanksgiving holi day with Mr. and Mrs. Louis Par ris. Mr. Martin and Mr. and Mrs. Parris were in Richmond for the week-end. Mr. Martin returned to her home with them. Believe it op not, we have a for tune teller in this section! Guess who!"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mr. and Mrs. <mark>Parris</mark> were in Richmond for"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mr. and Mrs. <mark>Parris</mark> were in Richmond for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.0, 656.01, 2148.49, 808.36], "bbox_id": "884fa4d10c", "file": "AppomattoxNewspapers_1947-1949a_0457.pdf", "page": 1, "text": "Trinity Road, April 21.- Mr. and Mrs. Louis Parris and daughter, Molly Mr. and Mrs, S. O. Frank lin and little daughter, Linday, and Claude Martin attended the Sun. rise service Blaster Sunday at Natural Bridge. Mrs. John P. Alvis, Jr. and chil dren, Betty Jane and John, III re turned home Sunday from Orange. Mrs. Alvis was called there last Monday due to the illness of Betty Jane while she and John were Vis iting their grandparents, Mr. and Mrs. Herbert Matthews."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mr. and Mrs. Louis <mark>Parris</mark> and daughter, Molly Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mr. and Mrs. Louis <mark>Parris</mark> and daughter, Molly Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1518.3, 813.01, 1714.76, 904.4], "bbox_id": "ed501d69d5", "file": "AppomattoxNewspapers_1974-1975a_0227.pdf", "page": 1, "text": "trees will grow up to provide a windbreak and school grounds. i are left to right and top to bottom Mays class planting a pine seedling and Pooles class and Miss Butlers class. Students rt on the origin of Arbor Day and why it is ear. The report was given by Joe Ford. Other rith the program were Lisa Mitchell, Dwayne Macintosh and Baxter Parris."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Dwayne Macintosh and Baxter <mark>Parris</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Dwayne Macintosh and Baxter <mark>Parris</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1190.63, 158.07, 1336.05, 330.57], "bbox_id": "65658c5895", "file": "TimesVirginian_1978_0092.pdf", "page": 1, "text": "transportation this year.-Senior- 4-Hers should begin now to work on demonstrations or illustrated talks for the District Contest, April 15.    Wildlife Feed Patch forms are due by March 17. Please try to get them to on time. The seed for this wildlife conserva tion programisprovided by the Virignia Game Commission. 4-Hen ef tl Week Our Public Speaking announcers - Susan Parris, Leigh Ann Duncan, Edward McCoy."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Public Speaking announcers - Susan <mark>Parris</mark>, Leigh Ann Duncan, Edward"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Public Speaking announcers - Susan <mark>Parris</mark>, Leigh Ann Duncan, Edward"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.68, 1063.36, 1807.91, 1246.9], "bbox_id": "82e9c97ad7", "file": "TimesVirginian_1976_0247.pdf", "page": 1, "text": "ton, Dawn Regula and chap erones Fran and Brenda Zirbel. During their visit in Appomat tox the 4-Hers stayed with the following 4-H families Mr. and Mrs. David White, Mr. and Mrs. R. B. Parris, Jr., Mr. and Mrs. J. M. Cobb, Jr., Mr. and Mrs. Marvin Glover,Jr., Mr. and Mrs. Billy Chenault, Mr. and Mrs. William Hix, Mr. and Mrs. Lloyd Walton and Mr. and Mrs. Frank Sweet. During their visit here the South Dakota 4-Hers toured Holiday Lake 4-H Camp, Appomattox Historical Park,"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mrs. R. B. <mark>Parris</mark>, Jr., Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mrs. R. B. <mark>Parris</mark>, Jr., Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2128.27, 1458.52, 2295.79, 1547.27], "bbox_id": "48554b7036", "file": "AppomattoxNewspapers_1949-1952a_0460.pdf", "page": 1, "text": "Tommy Berry, of Lynchburg, a former baseball player with the Appomattox Green Sox, entered the armed forces Tuesday by way of the draft. He was a Junior member of the University of Virginia football team this year. He will serve with the Marine Corps, and will train at Parris Island, S. C."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and will train at <mark>Parris</mark> Island, S. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and will train at <mark>Parris</mark> Island, S. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [265.21, 274.22, 413.29, 617.11], "bbox_id": "344c77536d", "file": "TimesVirginian_1978_0555.pdf", "page": 1, "text": "tioned that they have already begun preparation for 4-H Public Speaking which will be held in late January and early February. Farmers National Bank has sponsored 4-H Public Speaking for the past seven years in Appomattox. Speeches may be on any subject and should be 2 - 4 minutes in length, for the Junior Division ages 9 - 13 and 5 -7 minutes in length for the Senior Divison ages 14 - 18.    Last years 4-H projects will be given back this month. Some will be without ribbons as weve had to restock our supply. Ribbons will be awarded as soon as theyre available. Over 350 completed projected were submitted.    4-ffen of the Week All the participants in Share-the-Fun and especially the backstage crew Philip Jacobs, Ernie Chenault, Allen Smith, Michael Nash, Steve Conner, Richard Conner, and emcees David Caldwell and Susan Parris."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "David Caldwell and Susan <mark>Parris</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "David Caldwell and Susan <mark>Parris</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [926.4, 584.53, 1072.05, 979.51], "bbox_id": "2fd28c15cc", "file": "AppomattoxNewspapers_1971-1973a_0623.pdf", "page": 1, "text": "Timmy Doss, Benny Drinkard, Mitch Eggleston, D a r n e l l Evans, Manley Ferguson, Tony Ferguson, Joe Ford, Kenneth Franklin, Lloyd Franklin, Reg gie Franklin, Dean Gillispie, Roger Godsey, Russell Gunter, Perry Harris, Thomas Harris, Donald Harvey, Ronald Har vey, William Henry, Randy Hipps, Tom Hix, Kent Hodges, Buddy Hudson, Phillip Jamer- son, Michael Jarrell, David  Jones, James Jones, Stanley Jones, Jackie Kerr, Steven 1 Lawhorne, Lloyd Litchford, Hunter Marshall, Mark Mar shall, Dean Martin, Lewis Martin, Mike Martin, William Megginson, Larry Mobley, Fleming Moore, Timmy Moore, Bud Moses, Adolphus Mosley, Clarence Mosley, Allen Nash, Baxter Parris, Bennett Paulet te, William Perdue, Jeff Puryear, Eddie Ragland, Ted Rickmond, Wesley Ri l ey, James Robinson, James Roger, Lonni Rogers, David Roope, Joe Rosser, Bill Shorter, Nathan Smith, Tony Snell, Donald Stanley, Ralph Stanley, William Trent, Marco Turner, Derek Tweedy, Marshall Wat son, Bob Weatherly, Tommy Wingfield and Jerry Womack."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mosley, Allen Nash, Baxter <mark>Parris</mark>, Bennett Paulet te, William"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mosley, Allen Nash, Baxter <mark>Parris</mark>, Bennett Paulet te, William"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [844.53, 218.41, 987.43, 664.19], "bbox_id": "4cf2a444ed", "file": "AppomattoxNewspapers_1971-1973a_0183.pdf", "page": 1, "text": "Thursday was graduation day for several 4-H Club members and their pet dogs who have con cluded a 12-week Dog Obedience class in Appomattox county. As part of the graduation, each owner and pet took part in a judging exercise with Mrs. John F. Jonas, training direc tor of Dog Owners, Inc. of Lyn- chburg-as judge. Mrs. Diana Williams, inst- ructor of the class termed her stay in Appomattox with th e group  very enjoyable and remarked further that the class members had achieved a great deal in the way of control of their dogs. First place winner in the con test with 146 and one-half points out of a possible 155 were Pam Moore and her basset,  Tina . Second were Matt Lair and his golden retriever,  Fuddy  third, Baxter Parris with 118 and one-half points earned by his setter, Max . Max won first place in last summers 4-H Dog Show. Fourth place was won by Carol McFaden with her collie  Cheyenne , who earned 113 points. Perfect attendance certific ates and toys were given to each dog entered in the competition. Others in the competition in clude Brenda Drinkard and her collie,  Jelly Bean.  Lisa Mit chell and her boxer,  Duch ess  Rindy Lawson and her poodle,  Honey  and G. F James, extension agent, with"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "retriever,  Fuddy  third, Baxter <mark>Parris</mark> with 118 and one-half"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "retriever,  Fuddy  third, Baxter <mark>Parris</mark> with 118 and one-half"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.7, 1103.18, 904.18, 1479.42], "bbox_id": "6545c19354", "file": "AppomattoxNewspapers_1952-1954a_0285.pdf", "page": 1, "text": "Those visiting in the home of Mr. and Mrs. Tom Moore Sunday were Mr. and Mrs. Robert Patterson and Mrs. Della Doss, of Lynchburg Mr and Mrs. Lloyd Doss and family Mr. and Mrs. Hunter Parris, of Lynchburg, and Lewis Parris. Dr. Twyman Williams left this afternoon for Natural Bridge where he will make the commencement ad dress tonight for the high school there. He .will attend the graduation exercises at Washington and Lee University, Lexington, on Friday morning. His son, James Taylor Williams will receive the Bachelor of Law degree. Mrs. Grace C, Winters and Miss Janie B. Caldwell spent last week end in Crewe, Va. with their sister and brother-in-law, Mr. and Mrs Edd M. Schaubach. Others visiting in the same home during the week end were their son, Sgt. Eddie M Schaubach, Jr., of Camp Gordon Ga. Mr. and Mrs. B. F. Schaubach and daughter, Pearl Jake Schau bach, Miss Alice Joy Schaubach, S N., of Lewis-Gale Hospital, who is taking a three week vacation with her parents. Miss Florence Robertson, of Wash ington, D. C. spent the week end with her mother, Mrs. Irvin C. Robertson Pvt. George R. Kruer, of Camp Gor don, Ga., was a guest in this home"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mr. and Mrs. Hunter <mark>Parris</mark>, of Lynchburg, and Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mr. and Mrs. Hunter <mark>Parris</mark>, of Lynchburg, and Lewis"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [500.38, 517.72, 635.41, 641.96], "bbox_id": "61e2d244d9", "file": "AppomattoxNewspapers_1974-1975a_0220.pdf", "page": 1, "text": "Thon. Our club has been put in charge of the publicity for the event. A Committee was selected to work out the details for the publicity. Members include Mary Paris, Bud Ross er, Joe Ford, Freddy Mitchell, Cathy Morris, Donald Parris, Bill Vaughan, Tereesa Watts, Mike Hancock, and Dwayne Scruggs. The Walk-A-Thon will be held May 24, from 10 until 2"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mitchell, Cathy Morris, Donald <mark>Parris</mark>, Bill Vaughan, Tereesa Watts,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mitchell, Cathy Morris, Donald <mark>Parris</mark>, Bill Vaughan, Tereesa Watts,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1669.72, 533.69, 1841.98, 849.94], "bbox_id": "7bd1b57ffd", "file": "AppomattoxNewspapers_1955-1957a_0181.pdf", "page": 1, "text": "Thomas, Ashby Wright, Rebekah Barger Dale Doss, Bonnie Gilbert, Linda Jarrell, Marjorie Johnson, Mary Elizabeth King, Susan Nell OBrien, Cynthia Richardson, Judy Smith, Vickie Smith, Lina Trent, Brenda Williamsdn, Anne Crawley, Michael Johnson. Fourth grade, Mrs. Thelma W. Martin Harold Carter, Earl Day, Wayne Ferguson, Doug Mitchell, Mike Mitchell, Cecil Phelps, Wayne Phelps, David Reed, Richard Smith, Jimmy Torrence, Kathy Jo Bragg, Linda Carter, Gloria Jean Dos3, Sue Giles, Vickie Mayberry, Linda Slagle. Fourth grade, Miss Nola Burkey William Allen Bryant, John Gillette, James Gunter, Joe LeGrande, Wen dell Maddox, Charles Martin, Ron ald Millner, Herbie Pulliam, Joe Terry, T. C. Torrence, Priscilla Cole, Barbara Giaines, Carolyn Keys, Linda Phelps, Jane Wilson, Nellie Ruth Harris. Fifth grade, Mrs. Parris Watkins Abbitt, Kyle Almond, Marvin Cald well, Freddie Carter, Allen Conner, Freddie Grishaw, Irby King, Taylor Mabley, Billy Trent, Suzanne Gills, Margaret Johnson, Juanita Maddox,"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Harris. Fifth grade, Mrs. <mark>Parris</mark> Watkins Abbitt, Kyle Almond,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Harris. Fifth grade, Mrs. <mark>Parris</mark> Watkins Abbitt, Kyle Almond,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [318.7, 1432.1, 595.8, 1768.79], "bbox_id": "20a9f8c22d", "file": "AppomattoxNewspapers_1974-1975a_0477.pdf", "page": 1, "text": "This sumer during the week of June 23 through June 27,Fourteen 4-Hers and one adult leader from Appomattox County traveled to the Virginia Polytechnic Institute and State University in Blacksburg, Virginia to take part in 4-H State Congress. This was the largest delegations from Appomattox to ever attend Congress. Approximately 1200 4-Hers throughout the state took part. During the week many activities took place. Contests such as Public Speaking, Share-the-fun, Dress Revue, Tractor Driving and Demonstrations and Illustrated Talk were among the many events that took place. Leadership classes and special classes centered around the Bicentennial were held. The election of state 4-H officers and district cabinet members were also held. The Appomattox 4-Hers took part in a variety of activities and events and came home with some state winners. Mary Parris, Cindy Guill, Charlene Rush and Debbie Rush participated in the Share - The - Fun Contest. They performed a singing act entitled, The Cloverettes in Concert. The four girls were among the five first place winners in the state. They each received a cassette tape recorder or radio. Cindy served as emcee for the contest. Nathan Smith took part in the Tractor Driving Contest. He did a great job and won 3rd place on the state level. Robert Dyess competed in a seminar program sponsored by the American Institute of Coopedratives. Roberts trip was provided by the Farmville Production Credit Association. John Jones competed in the Demonstration and Illustrated Talk Contest and the Driving Skills Contest. He gave a demonstration entitled Why A Retread May Be Your Best Buy which won him second in the state. John also won first place in the state in the Driving Skills contest. He won a trip to Richmond for the Eastern US Auto Skills Driving Contest."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "some state winners. Mary <mark>Parris</mark>, Cindy Guill, Charlene Rush"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "some state winners. Mary <mark>Parris</mark>, Cindy Guill, Charlene Rush"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.99, 221.27, 2239.14, 705.24], "bbox_id": "c86e7df011", "file": "AppomattoxNewspapers_1971-1973a_0065.pdf", "page": 1, "text": "The T-Rebs tied Blue Ridge Farms Monday night 6-6 in a tight game matching hard-play ing boys who had to postpone a Saturday game because of field conditions, resulting from Hur ricane Ginger.. Appomattox scored in the first quarter with co-captain Dillard Reynolds going in from 15 yards out. The extra point failed. In the second quarter Blue R i d g e Farms scored on a 40-yard pass play. They also tried a run, but the extra point feiled. In the 4th Brookville was down on the eight-yard line but stiff defense from the T- Rebs held them. Appomattox, with about two minutes left in the game, moved the ball to the 10 - yard line, but the drive failed and the boys had to come on home with a tie. Appomattox standouts on de fense were Gordon Ford, Tom my Bryant, J a m e s Rogers, Richard Blazer, Baxter Parris, Danny Scruggs and Phillip Jam erson. T-Reb standouts for the of fense included R. B. Carter, Bob Weatherly, Tim Doss, Ro bert Dyess, Ronnie Davidson and William Perdue. T-Rebs meet Rustburg here Saturday night at 8 p.m. Rust burg 11-12 year olds are un- deated 4-0 so the T-Rebs have their work cut out for them. Mites meet Rustburg at 530 p.m. with Midgets game vs Rustburg at 630 p.m. T-Rebs of Appomattox also are unde feated with 3 wins and a tie. Its gonna be a good garnet!"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Rogers, Richard Blazer, Baxter <mark>Parris</mark>, Danny Scruggs and Phillip"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Rogers, Richard Blazer, Baxter <mark>Parris</mark>, Danny Scruggs and Phillip"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [280.79, 566.53, 431.52, 825.42], "bbox_id": "2525b6a875", "file": "TimesVirginian_1978_0292.pdf", "page": 1, "text": "The team of Mitch Eggleston - Buck Tillery reached the semi-finals with a 6-1, 6-2 victory over Rick Thompson - Bruce Cowan. Bob Frey-Larry White gained a semi-final place with the defeat of Jim Goodwin-Tom R oberts 8-6.  Steve Cobb - Donald Parris advanced with a 8-2 decision over Tommy OBrien - J. T. Guill. White - Frey team faced Cobb - Parris Sunday with a long exciting 8 sets victory of 63,67,7-5 sending White-Frey to m eet Thompson-Cowan. After a brief rest Frey-White to meet Thompson-Cowan. After a 7-5 contest, advancing to meet Eggleston - Tillery. After a long exciting plays Eggleston - Tillery claimed victory at 6-4, 6-4 to become the 1978 Mens Doubles Champions."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "8-6.  Steve Cobb - Donald <mark>Parris</mark> advanced with a 8-2"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "8-6.  Steve Cobb - Donald <mark>Parris</mark> advanced with a 8-2"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2010.69, 1039.68, 2151.19, 1135.12], "bbox_id": "ac75364967", "file": "AppomattoxNewspapers_1971-1973a_0350.pdf", "page": 1, "text": "The representatives of the Appomattox County Senior 4-H Club will be competing on Class Room Quiz Monday, June 19, at 700 p.m. The show is seen on Channel 7 from Roanoke. Re presenting Appomattox will be Mary Louise Parris, Mike Bel ter and David Jones."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "will be Mary Louise <mark>Parris</mark>, Mike Bel ter and"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "will be Mary Louise <mark>Parris</mark>, Mike Bel ter and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2356.8, 1005.18, 2507.6, 1610.09], "bbox_id": "403060d955", "file": "AppomattoxNewspapers_1974-1975a_0296.pdf", "page": 1, "text": "the recipient of the Greater Lynchburg Area Honor Scho larship for four year study at Lynchburg College. Marcella was an alternate for the Governors School for the Gifted in 1974 and a National . Merit Commended Scholar. She is a member of the National Honor Society, Annual Staff, and the Drill Team. She attends Central Baptist Church. Pamela Adair Moore is the daughter of Mr. and Mra. James C. Moore of Appomat tox. Her career goal is to work as a veterinarians assistant. She will continue her education at Blue Ridge Community College at W eyers Cove, Virginia beginning her studies in Animal Science which will lead to specialization in Veterinary Technology. Pamela is a member of the Varsity Club, the National Honor Society, Career Council, and she has been recognized as a Virginia 4-H All-Star. She is a member of Evergreen Baptist Church. David Jarrell Marshall, son of Mr. and Mrs. B. H. Marshall of Appomattox, was accepted at the College of William  Mary on the Early Decision Plan. He plans a major in Business Administration. David is Vice-President of the .National Honor Society, Co-Chairman of the Career Council, and appeared in the I Senior Play. He is a member of I Liberty Baptist Church and he also toured Poland with the I Liberty Youth Singers in 1974. Mary Louise Parris, daugh ter of Mr. and Mrs. R. B. Parris, Jr. of Appomattox, will major in English and Dramatic Arts at Longwood College. She was named as a National Merit Commended Scholar, and she will participate in an Honors Program as a Longwood Scholar when she enters  I College this fall. She has served Society"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "in 1974. Mary Louise <mark>Parris</mark>, daugh ter of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "in 1974. Mary Louise <mark>Parris</mark>, daugh ter of Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.61, 650.89, 2123.89, 867.54], "bbox_id": "909522a5aa", "file": "TimesVirginian_1976_0133.pdf", "page": 1, "text": "The Raiders made their debut in Seminole District tennis by losing a close match to William Campbell on the winners courts April 6. Joe Ford and Roger Godsey won their singles matches and Don Harvey narrowly lost a match decided by a tiebreaker. The doubles matches could not be played because of darkness. RESULTS D eJarnette WC defeated Donald Parris  A 8 to 1 Putnam WC defeated Randy Hipps A 8 to 4 Joe Ford A defeated Woddell WC 8 to 5 Yuille WC defeated Don Harvey A 9 to 8"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "eJarnette WC defeated Donald <mark>Parris</mark>  A 8 to 1"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "eJarnette WC defeated Donald <mark>Parris</mark>  A 8 to 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1681.7, 489.03, 1826.35, 664.37], "bbox_id": "38f1218e4a", "file": "TimesVirginian_1978_0149.pdf", "page": 1, "text": "The program was given by Susan Parris and Robert Dyess on slides from FFAFHA Camp. This camp is held each summer for FFA and FHA members from different areas of the state. It is a great opportunity for members to become involved in various activities and to make new friends. The m eeting was then adjourned by Mary Dyess, FHA President and Robert Dyess, FFA President."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "was given by Susan <mark>Parris</mark> and Robert Dyess on"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "was given by Susan <mark>Parris</mark> and Robert Dyess on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1792.48, 1000.2, 1932.73, 1240.33], "bbox_id": "51ef222591", "file": "AppomattoxNewspapers_1974-1975a_0288.pdf", "page": 1, "text": "the Primary School at approxi mately 2 p.m. Pledge cards can be obtained from the Appomat tox Extension Office or from the offices at the Appomattox Middle School and Appomattox County High School. Each walker should sign up as many as he can to back him at so much per mile. So get together with your friends and plan td walk Saturday for those who cant. Or if you arent able to walk, sponsor someone gener ously.. All proceeds will be donated to the Muscular Dystrophy Association. Re member the more who partici pate, either as a walker or sponsor, the sooner the fight against dystrophy will be won. Mary Louise Parris is shown above holding the poster."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "be won. Mary Louise <mark>Parris</mark> is shown above holding"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "be won. Mary Louise <mark>Parris</mark> is shown above holding"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1792.79, 1469.7, 1957.11, 1499.39], "bbox_id": "e4989c7fda", "file": "AppomattoxNewspapers_1949-1952a_0369.pdf", "page": 1, "text": "The Parris Reunion was held last Sunday at the home of Mr. and Mrs. Lewis Parris."}, "highlight": {"text": {"matched_tokens": ["Parris", "Parris"], "snippet": "The <mark>Parris</mark> Reunion was held last Sunday at the home of Mr. and Mrs. Lewis <mark>Parris</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris", "Parris"], "snippet": "The <mark>Parris</mark> Reunion was held last Sunday at the home of Mr. and Mrs. Lewis <mark>Parris</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1632.0, 248.44, 1802.31, 1071.79], "bbox_id": "2264ab541a", "file": "TimesVirginian_1983a_0217.pdf", "page": 1, "text": "The marriage of Miss Kathy Faye Johnson and Mr. Donald Nelson Parris waa an event of Saturday, June 18, at three oclock in the afternoon at Bible Baptist Church in Appomattox, Virginia. Pastor Ro bert E. Lee, Jr. officiated at the ceremony. The bride is the daughter ot Mr. and Mrs. Fred D. Boone Johnson of Appomattox. The groom is the son of Mr. and Mrs. Ronald Baxter Parris, Jr. of Appomattox. A program of nuptial music waa presented by Mr. Scott Drinkard of Appomattox, organist, and Miss Tamara Nash of Appomattox pianist. Vocalists were Miss Susan Johnson of Appomattox, sister of the bride, and Mr. Jane Frederick Mitchell of Hampton, VA. The bride was escorted and given in marriage by her father. The bride wore a white formal gown of bridal angel wing over bridal taffeta, featuring a high neckline and sheer sleeves gathered halfway down then fitted at the wrist. They princess style fitted bodice, the sleeves, neckline, and back seams were all accented with lace appliques covered in seed pearls and sequins. The cathedral length train was edged in lace accented with seed pearls and sequins. The cathedral length veil was accented with sequins and trimmed in lace applique covered with pearls and sequins. The headpiece waa a crown, covered with pearls and aequins. She wore a strand of pearls borrowed from Mrs. Helen Pierce, aunt of the bride. The mother of the bride designed and created the dress and headpiece. The bride carried a white Bible borrowed from Mrs. Ruth Trent, aunt of the bride. The Bible was given to Mrs. Trent by the brides grandmother 26 yean ago. It waa covered with lavender orchids, babys breath and white streamers. Miss Susan Johnson, sister of the bride, was maid to honor. She wore a formal length gown of lavender floral print organiza over lavender taffeta. The gown featured full puffed short sleeves, square neckline and fitted waist. She carried a nosegay bouquet of assorted lavender flown and wore a halo of matching flowers. Bridesmaids were Mn. Michelle Elliott, Mrs. Deborah Goin, Mn. Mary Goin, Mias Kim Johnson, Miss Elizabeth Pierce, Mn. Patsy Pierce, Miss Susan Parris, and Miss Judy Johnson, all of Appomattox, Miss Susan Gregg of Bedford, Va. and Mn. Patricia Williams of McMinni- ville, Tennessee. They wore lavender taffeta formal length gowns and short puffed sleeves and a short plume of taffeta at the fitted natural waistline seam. They carried nosegay bouquets to match the maid"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mr. Donald Nelson <mark>Parris</mark> waa an event of"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mr. Donald Nelson <mark>Parris</mark> waa an event of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1795.67, 364.22, 1964.95, 1141.98], "bbox_id": "f15ca0957a", "file": "TimesVirginian_1983a_0272.pdf", "page": 1, "text": "The marriage of Miss Donna Kay Hodges to Mr. John Barry Joy took place Saturday, July 30, at seven oclock in the evening at Evergreen Baptist Church in Evergreen, Virginia. The Reverend Edmond Terry, pastor of the church, officiated at the double ring ceremony. The bride is the daughter of Mr. and Mrs. H. Lawrence Hodges of Pamplin. The groom is the son of Mr. and Mrs. Paul J.! Joy of Brookneal. A program of nuptial music was presented by Mrs. Carolyn Totty of Appomattox Mr. Rick Lawrenson of Lynchburg and Mrs. Kathy Parris of Appomattox were soloists, singing The Wedding Song, Let Us Climb the HUl Together, and The Wedding Prayer. The bride was escorted by, her father and given in marriage by her parents. The bride wore a gown of white silk taffeta with a high neck trimmed with alencon lace. The bodice was alencon lace with short puffed sleeves adorned with self-roses. The full skirt was silk taffeta with a sweep train accented with the same alencon trim. She wore a wreath of silk flowers with a finger tip veil trimmed with satin ribbon. The bride carried a nosegay bouquet of roses, daisies, miniature carnations and babys breath. Mrs. Gloria Baxter, of Richmond, cousin of the bride, was matron of honor. She wore a pink floor length bustled gown. She carried a nosegay bouquet of daisies, sweetheart roses and babys breath. Bridesmaids were Mrs. Cheryl Reynolds of Suffolk, friend of the bride Miss Pam Smith of Gladstone, friend of the bride Miss Mitzi Baldwin of Pamplin, cousin of the bride. Junior bridesmaid was Miss Susan Williams of Cheriton, friend of the bride. They all wore pink gowns identical to the matron of honor and carried smaller identical nosegay bouquets. Mr. Paul J. Joy of Brookneal, father of the bridegroom, served as best man. Ushers were Mr. Lester Hodges of Pamplin, brother of the bride Mr. Jim Creasey of Lynchburg, brother-in-law of the bridegroom and Mr. Barney Joy of Brookneal, brother of the bride groom. Junior usher was Mr. David Shotwell of Powhatan, nephew of the bridegroom. Ring bearer was Master Jeremy Creasey of Lynch burg. nephgw of the bridegroom. The bridegroom wore a white tuxedo with full length rounded tails with a wing-tipped collar, pleated shirt and bow tie. He wore a white rosebud with babys breath bou-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Lynchburg and Mrs. Kathy <mark>Parris</mark> of Appomattox were soloists,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Lynchburg and Mrs. Kathy <mark>Parris</mark> of Appomattox were soloists,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [136.79, 646.31, 289.29, 1562.81], "bbox_id": "7a2029f663", "file": "TimesVirginian_1981a_0271.pdf", "page": 1, "text": "The marriage of Miss Cynthia Dawn Hix to Mr. Nathan Stewart Smith took place Saturday evening, Aug ust 22,1981, at seven oclock at Elon Baptist Church in Pam- plin. The bride is the daughter of Mr. and Mrs. William Daniel Hix of Pamplin. The groom is the son of Mr. and Mrs. Moses Wendell Smith of Spont Spring. The Reverend Danny Lee Owens, pistor of Elon Baptist Church officiated at the double ring ceremony before an altar of baskets of mixed flowers, plihs and brass candelabras. Mrs. Don Jimison, organist, provided a program of nuptial music, and soloist, Miss Gracia Farmer of Richmond sang Thats The Way and The Wedding Prayer. The bride was escorted by her father and given in marriage by her parents. She wore a hill, flowing, ivory wedding gown, creating a soft feminine mood. The bodice and sweetheart neckline featured a lavish spread pi ivory alencon b n and seed peiris. This alencon lace was also continued into the striking pyramid front skirt, constructed of Chiffon. The traditional sleeves and cathedral train were also garnished with lace. Her ivory veil of cathedral length was edged by applique and attached to a cap garnished with applique and seed pearls. Miss Jane Havergal Hix of - Lynchburg, sister of the bride, was maid of honor. She wore a dusty rose gown with low neckline and pullover cape of sheer floral design. Other attendants were Miss Cindy Berry of Gate City, Miss Lisa Dickerson of Lynchburg, Mrs. Janet Morgan of Appomattox, cousin of he bride, Mrs. Teresa Perrow and Miss Vanessa Smith, both sisters of the groom and of Spout Spring. They alf wore identical gowns to that of the maid of honor. The flower girl was Miss Mary Beth Hix, sister of the bride. She wore a floor length dusty rose gown with a scooped ruffled neckline and short sleeves with gathered cap. She carried an ivory basket of rose petals. Mr. Smith was best man, for his son and the ushers were Scott Almond of Spout Spring, cousin of the groom, Ed Bowers of Appomattox, Danny Hix of Pamplin, brother of the bride, and Baxter Parris and Donald Parris, both of Appomattox. The brides mother wore a floor length huckleberry gown with pleated skirt and matching lace bodice. She wore a corsage of ivory and pink silk roses. The brides grandmother, Mrs. Bessie Oliver of Lynch Station, wore a floor length gown of beige and wine nylon, and wore a corsage of ivory silk roses. The grooms mother wore a blue floor length gown, fitted at the waistline, and accented"}, "highlight": {"text": {"matched_tokens": ["Parris", "Parris"], "snippet": "the bride, and Baxter <mark>Parris</mark> and Donald <mark>Parris</mark>, both"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris", "Parris"], "snippet": "the bride, and Baxter <mark>Parris</mark> and Donald <mark>Parris</mark>, both"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [136.08, 638.91, 286.2, 1185.28], "bbox_id": "fa3d412682", "file": "TimesVirginian_1981a_0359.pdf", "page": 1, "text": "The marriage of Miss Bfpry Louise Parris to Gary Sheckeis Goin took place Saturday, Oct. 17, 1961 at four oclock at Memorial United M ethodist Church, Appomattox, Virginia. The bride is the daughter o f. Mr. and Mrs. Roland Baxter Parris, Jr. of Appomattox. The groom is the son of Mr. and Mrs. John Howard Goin of Appomattox. The Reverend P .. Edward Leonard, Jr., minister of the church, officiated at the double ring ceremony. Mrs. ShirUly Walton served as mistress of ceremonies. Miss Debbie Rush, organist, provided a program of nupital music. Mrs. Karen Gibson sang 0 Love That Casts Out Fear and Mr. Donald T. Parris, unde of the,bride, sang The Lords Prayer. Given in marriage by her father, the bride wore her mothers wedding gown of. ivory tapestry brocade fashion ed on princess lines with a portrait neckline trimmed with seed pearl The skirt ended in a chapel train. Her matching ivrnr m itx illusion was edged with embroidered lace and attached at the crown to a seheffli lace covered cap. She carried a silkHower bouquet of white and pink roses, lily of the valley, miniature carnations and ba- ny s breath. Miss Susan Gay Parris of Appomattox, sister of the bride, was maid of honor. She wore a floor length sleeveless govern of dusty rose giana. She carried a fireside basket filled with burgundy and dusty pink silk roses. Bridesmaids were Mrs. Da- niel Boyer of Richmond Mrs. Thomas Cook of Valley Stream."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "of Miss Bfpry Louise <mark>Parris</mark> to Gary Sheckeis Goin"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "of Miss Bfpry Louise <mark>Parris</mark> to Gary Sheckeis Goin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.05, 623.52, 1525.88, 1384.93], "bbox_id": "c75fd94e9b", "file": "TimesVirginian_1976_0024.pdf", "page": 1, "text": "The m arriage of Miss Lucinda Jane Guill to Mr. Lawton Murrell Thomas, Jr. took place Saturday, January 3,1976 at 3 oclock in the afternoon in Evergreen Baptist Church in Evergreen.  The bride is the daughter of Mrs. Hazel Wooldridge Guill of Appomattox, and Mr. Robert Allen Guill of Richmond. The bridegroom is the son of Mr. and Mrs. Lawton Murrell Thomas of Appomattox. The Rev. Edmond M. Terry, pastor of the church officiated put the double ring ceremony. A program of nupital music was presented by Mr. N athan Carroll, soloist, of Blacksburg. Miss Charlene Rush, soloist, of Red House, Miss Debbie Rush organist, of Red House, cousins of the bride and Mr. Joseph Goad, pianist of Blacksburg. Given in marriage by her- uncle, Herbert M. Abbitt, the tjbride wore a traditional wedding gown fashioned of white organza and re-embroid ered Chantilly lace over taffeta. The dress is designed with an Empire bodice w ith, a high scoop eckline, outlined wjfh lace àfipTfobroiaerg l pëttfls, and long Bishop sMbYtes With lace cuffs. Her floor length skirt was full ending in a chapel train outlined with three bands of lace cascading through the skirt. Her mantilla veil in fingertip length of silk illusion was edged with lace, and she carried white and red poinset- tas. The gold locket worn by the bride was a family heirloom. Miss Cathy P aulette, of Appomattox was maid of honor. She wore a slipper length dress of pine green crepe, featuring an Empire bodice which is finished with strap shoulders and is worn with a matching jacket, which has a yoke of candlelight linen lace and long sleeves. She carried one ret and one ivory poinsetta with streamers. Bridesmaids were Miss Sue , Thomas, sister of the bride groom. Miss Charlene Rush of Red House, cousin of the bride, and Miss Donna Stanley, cousin of the bridegroom, and Miss Mary Louise Parris, both of Appomattox. Miss Eve Thomas of Appomattox, sister of the bridegroom, was junior brides maid. The attendants dresses"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Miss Mary Louise <mark>Parris</mark>, both of Appomattox. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Miss Mary Louise <mark>Parris</mark>, both of Appomattox. Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [585.8, 645.02, 737.07, 1114.59], "bbox_id": "6a918051cb", "file": "TimesVirginian_1978_0181.pdf", "page": 1, "text": "The Go and See Tour March 29 started out at the Appomattox E l e m e n t a r y School Library where we were met by Mrs. Jean Hesson, General Supervisor for the Appomattox County School System, who introduced us to i Mrs. Janice Loveless, Librar- , ian, and Mrs. Stratton, Library j aide. They showed us the library facilities and explained j the program carried out with i the children which teaches  them the Dewey System and j use of the card catalog. From there we proceeded to ! the Primary School and Mrs. J Nellwyn Smith, Media Special- , ist, described the many j activities the children exper- j ience in this library. Mrs. Pat  Torrence, principal, took pict- j ures of Mrs. Virginia Tyler, Chuck Wilkinson and Patsy  Butler admiring . the castle made by Kashia Haskikns through a supplementary en richm ent to thé reading program wheeby she read directions and then , carried themoutjtthp finished wprk.  Mrs. Torrence also took a picture of those on the tour which included Virginia Tyler, Minerva Kepler, Eleanor Mc Williams, Mary Jane Hoffman, grouped around Mrs. Smith. The tour continued on to the Middle School and we were greeted there by Louise Parris, librarian, who described how these older students used the library to carry out classroom"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "greeted there by Louise <mark>Parris</mark>, librarian, who described how"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "greeted there by Louise <mark>Parris</mark>, librarian, who described how"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.96, 926.4, 1657.41, 1066.05], "bbox_id": "6026439451", "file": "AppomattoxNewspapers_1955-1957a_0561.pdf", "page": 1, "text": "The folowing men were enlisted under the Marine Corps Buddy Plan and are presently undergoing recruit training together at Parris Island, South Carolina Fred M.. Caldwell, son of Mr. and Mrs. Hubert H. Caldwell, of Route 3, Appomattox James A. Connor, Jr., son of Mr. and Mrs. James A. Connor, Sr., of Route 1, Appomattox Frank W. Inge, son of Mr. and Mrs. William E. Inge, of Route 3, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "recruit training together at <mark>Parris</mark> Island, South Carolina Fred"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "recruit training together at <mark>Parris</mark> Island, South Carolina Fred"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2335.0, 1606.42, 2476.33, 1795.47], "bbox_id": "63b72e3313", "file": "AppomattoxNewspapers_1962-1965a_0187.pdf", "page": 1, "text": "The following officers have been elected by the Appomattox Lions Club for year 1963-1964. . Ivey Holland, President T. M. Trent, 1st Vice President R. D- Robinson, 2nd Vice President W. W. Blythe. 3rd Vice Presi dent R. Murrell Ferguson, Se cretary and Treasurer Ray mond F. Jamerson, Tall Twister James E. Beamer, Lion Tamer Directors for 2-year term Clyde G. OBrien and T. DeWitt Evans. Directors for 1 year term M,. A. Hemcall and R.. B. Parris, Jr. The above officers will be in stalled at Ladies Night on June 27th. Seibert Myers, Zone chair man from Lynchburg, Va., will oiflcally Install new officers."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Hemcall and R.. B. <mark>Parris</mark>, Jr. The above officers"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Hemcall and R.. B. <mark>Parris</mark>, Jr. The above officers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [122.4, 258.89, 282.91, 1682.54], "bbox_id": "0f88461768", "file": "TimesVirginian_1976_0306.pdf", "page": 1, "text": "The following Freshman students have been assigned to the designated homerooms R moi 303 - BOYS - Eddie Agee. Sidney Allen. Donnie Almond, James Almond, .Goble Atkins, Ronnie Austin. Edward Baldwin, Dickie Beale, John Boyce, Carl Bryant, Jeff Bryant, David Caldwell, Gary Campbell. Willie Chambers, -Greg Cheatham, Ernie Che- nault. GIRLS - Penny Almond, Lisa Atchison, Debbie Baldwin, Laura Baldwin. Nancy Baldwin, Johanna Belter. Tammy Book. Katrine Bryant, Fannie Calloway. Teresa Campbell. Annette Carter, Crystal Car ter, Robbia Carter, Gloria Cashwell, Martha Chandler, Lisa Clark. Room 100 - BOYS- Michael Childress, Steve Cobb, Larnya Culpepper, Chuck Cuneo, Tim Davidson, David Doss, Gene Doss. Keith Doss. Bob Dun- nam, S. L. Ferguson, Tony Ferguson, Darryl Fitch, John Fleshman, John Foxwell Dale Garrett. GIRLS - Wilsie Cobbs, Helen Coleman, Margie Coleman, Linda Cowan, Terri Dalton, Dianne Daniel, Victor Daul- ton, Mary Davidson, Kathleen Davis, Melinda Davis,. Tina Doss. Cindy Dowdy, Charitta Ferguson, Ivette Ferguson. Roberta Ferguson, Rita Fergu son. Rosas 214  BOYS - David Garretts, Thomas Coin, James Guill, Steve Guthrie, Andrew Hall William Hamlett, William Hansen, Robert Harding, Dan ny Hhrvey, James Hash,  Ronald Hipps, William Hodges, Michael Hubbard, Jack Hud son, Vincent Hunter, Charles Irvin. y Verna Fleshman, Pamela Ford, Wanda Forest, Jackie Franklin, Martha Garrett, Vickie GSliam, Lisa Join, Pamela G ift Sharon Guill, Vickie Handy,- Ara Haskins, Kimberly Hipps, Gloria Hodges, Nancy Hodges, Vinnie Hubbard. - Room 205 - BOYS - Jeff Jamerson, Larry Kelso, Roy L. King. Robert Lawhorn, Eugene Lawson, Gary Layne, Mark Litchford, Timothy Marshall Bradley Martin, Jeffrey Mar tin, Jimmy Martin, Mark Martin, Roger Mayberry -Rich ard Mitchell, Robert Mitchell y GIRLS - Law lura Ivery, Clara Jackson, Jennifer. Johnson Teresa Kerr, Arlene Kidd, Verta Kress, Danette Letter- man, Agnes Lewis, Angie Mann, Darnell Mayberry, Mat- tie McCoy, Terry McCoy, Lulai McCoy, Virginia McCoy, Teresa McFadden. Art - BOYS - Gary Moore, Jeffery Moore, William Moore, William Moore, Godfrey Mos ley, Henry Moss, John Neigh bors, Kevin OBrien, Louis 1 OBrien Mark Paulette, Phillip Paulette, John Pennington. GIRLS - Vivian McFadden. Laurie McLean, Carolyn Megg- inson, Barbara Miller, Lori Mitchell, Lisa Moore, Terrell Morgan, Susan Musick, Sherrie Repass, Rhonda Nash, Cheryl Notestein, Beverly Oxner, _ Janice Pankey. Room 309 - BOYS - Anthony Phelps, Michael Phelps, Mark Pierce, David Price, James Pugh, Craig Puryear, Charles Rixey, Bryan Roach, Michael Robinson. GIRLS - Susan Parris, Darlene Powell, Alene Preston, Elizabeth Redman, Angie Rich ardson, Brigette Richardson, Sara Richardson, Debbie Roa ch, Linda St. John. Room 327 - BOYS - Ronnie Robinson, Vincent Robinson, Darrell Schrock, Gerald Sharp, Kenny Shorter, John Slifko, Danny Slough, Craig Smith, Darrell Smith, Troy Stanley. GIRLS - Robbie Sayre, Sherry Shorter, Pam Shrock, Debbie Smith, Shelby Smith, Edith Smoak, Robin Spiggle, Maxie Story, Connie Taylor, Pam Taylor. Room 304 - BOYS - Stanley Megginson, Donald Mitchell, Leon Stevens, Herbert Thorn ton, John Thurman, Gary Tolbert, Jerry Trent, James Vassar, James Vaughan, An-  thony Volturo, Roger Webb, Larry White, Terry Woods GIRLS - Renae Thomas, Loretta Tolbert, Elizabeth Waldo, Pam Watkins, Barbara Watson, Denise Webb, Sharon White, Zandra William, Tam my Womack, Debra Wright, f Judy Zimmerman."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Michael Robinson. GIRLS - Susan <mark>Parris</mark>, Darlene Powell, Alene Preston,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Michael Robinson. GIRLS - Susan <mark>Parris</mark>, Darlene Powell, Alene Preston,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [502.08, 652.61, 640.18, 942.2], "bbox_id": "d0010cca70", "file": "AppomattoxNewspapers_1974-1975a_0220.pdf", "page": 1, "text": "The first order of business was the 1975 Demonstration and Illustrated Talk Contest. The Junior contest will be held Sat., April 19, at the Appomat tox Elementary School. All Junior 4-Hers from the age of 9 to 13 are eligible to participate. It will be held from 930 - 1130 a.m. Senior Demonstration Con test will be held Wed., April 9 at the Appomattox Extension Office. All 4-Hers from the age of 14-19 are eligible to take part. District Contest will be held April 26 at the Appomat tox County High School. Mr. Frank Sweet, extension agent, discussed dates for special activities to be held later on this year. The week end campout committee gave a report. The details were presented before the club. Other arrangements are to be made later. Baxter Parris, Lisa Mitchell,"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "be made later. Baxter <mark>Parris</mark>, Lisa Mitchell,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "be made later. Baxter <mark>Parris</mark>, Lisa Mitchell,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [143.3, 290.8, 285.31, 544.39], "bbox_id": "89b89d8783", "file": "TimesVirginian_1978_0015.pdf", "page": 1, "text": "The Farm and Home Show on WSET. Channel 13, that features 4-H Interstate Ex change Program wOl be ihm n this coming Saturday, January 14, rather than last Saturday as we reported last week. Susan Parris, Ends Chenault and David Caldwell assisted with the show. It begins at 30 a.m.     Two important 4-H dates have just beat established. Our Senior 4-H District Contest will be held at ACHS on April 15 and Appomattox 4-ITers will go to Holiday Lake 4-H Camp during the week of August 7 -11. Mark your new 1978 calendars fair these two events. It appears that - 4-H Camp cost for this year will be 32.00,   .  ."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "reported last week. Susan <mark>Parris</mark>, Ends Chenault and David"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "reported last week. Susan <mark>Parris</mark>, Ends Chenault and David"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [282.0, 1115.27, 569.66, 1373.4], "bbox_id": "39c81c09ae", "file": "AppomattoxNewspapers_1974-1975a_0269.pdf", "page": 1, "text": "The East Central District Senior 4-H Dem onstration Contest was held last Saturday, April 26, at the Appomattox County High School. Many of the counties adjacent to and near Appomattox County parti cipated in the event. Repre senting Appomattox were Debbie Rush, Charlene Rush, Mary Parris and Cindy Guill in The East Central District Senior 4-H Demonstration Contest was held last Sat., April 26, at the Appomattox Seven 4-Hers will be County High School. Many of will be representing Appo- the counties adjacent to and mattox County in the State 4-H near Appomattox County par- Club Congress June 23-27,1975 tiepated in the event. Repre- at VPI  SU. Steve Cawthorn, senting Appomattox were John Jones, Nathan Smith, Debbie Rush, Charlene Rush, Debbie Rush, Charlene Rush, Mary Parris and Cindy Guill in Mary Parris, and Cindy Guill the Share-The-Fun activity will compete against many Pam Moore in Dog Care and other 4-H members around the Training Lisa Dickerson in state."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Rush, Charlene Rush, Mary <mark>Parris</mark> and Cindy Guill in"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Rush, Charlene Rush, Mary <mark>Parris</mark> and Cindy Guill in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [354.23, 377.58, 625.78, 437.56], "bbox_id": "22ee0f71f5", "file": "AppomattoxNewspapers_1974-1975a_0102.pdf", "page": 1, "text": "The Cloverettes won first place in the Senior Division of the 1974-75 Appomattox County 4-H Share-The-Fun Contest held recently. Shown above, left to right, are Debbie Rush, Mary Parris, Donna Paulette, and Cindy Guill. m"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "are Debbie Rush, Mary <mark>Parris</mark>, Donna Paulette, and Cindy"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "are Debbie Rush, Mary <mark>Parris</mark>, Donna Paulette, and Cindy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [469.21, 639.44, 613.95, 898.13], "bbox_id": "185e089444", "file": "TimesVirginian_1978_0411.pdf", "page": 1, "text": "The Appomattox Senior Chapter Future Homemakers of America decided to present the program of the year in the form of a play for the September meeting. The play consisted of four dub officers, Penny Elliott, Mary K atherine Simpson, Susan Parris, and Arylece Ferguson, who represented the younger sisters of four F.H.A. em bers and they discussed what their older sisters had told them was planned for the coming year in F .H.AA. The play was humorous and enjoyed by all. Penny Elliott, Jane Guill and Susan Parris led some relaxers and the meeting was then adjourned by president, Cheryl Elliott. Robin Bollinger, Reporter"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "K atherine Simpson, Susan <mark>Parris</mark>, and Arylece Ferguson, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "K atherine Simpson, Susan <mark>Parris</mark>, and Arylece Ferguson, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [977.48, 231.19, 1106.63, 506.63], "bbox_id": "3b814df41f", "file": "TimesVirginian_1980a_0191.pdf", "page": 1, "text": "The Appomattox Senior Chapter and Junior Chapter, Future Homemakers of America met together for their Parent-Member Ban quet on Thursday, May 22, at Appomattox County High School. Susan Parris, President of the A.C.H.S. chapter pre sided over the banquet. Among the activities during the meeting was the awUrmng of degrees. Miss Parris announced that the following FHA members had met the requirements to receive their Junior Home maker Degree Norma Mor- gan, Sylvia Prince, Edna Moss, Pauline Lovelace and JoAnn Ferguson. Those receiving their Chapter Homemaker De gree are Bobby Stanley, Brenda Harris, Teresa Bass, Tina Hamlett, Donna Aber"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "County High School. Susan <mark>Parris</mark>, President of the A.C.H.S."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "County High School. Susan <mark>Parris</mark>, President of the A.C.H.S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [116.41, 610.69, 265.73, 1246.2], "bbox_id": "0bf6e72881", "file": "TimesVirginian_1976_0353.pdf", "page": 1, "text": "The Appomattox Mighty  Four 4-H Club held their  meeting Sept. 21 at the  Appomattox County Extension  Office. Meeting was called to ! order by President, Laurie  The club was led in  the pledges to the American  and 4-H Flags. The secretary  read the minutes and called the l roll. The treasurer reported  that we have 68.00 in our  account. The meeting was then  turned over to Mr. Sweet and 3 Mrs. Thomas. First on the ! business agenda was old I business. We discussed project i books, which should be turned tin by the end of October. The  Five County Fair was discuss- ed, Appomattox 4-ITers won  over 1,000 in prize money. We voted on the issue of inviting 47th grade students as new members. The majority ruled that 7th graders should be invited. Forms were givne out for the Chick-N-Que Contest to he held Saturday, Sept. 25 at Holiday Lake 4-H Camp. Float committee agreed to meet after the meeting to make plans for our Raflapad Parade float. We then prSapedfti to discuss ne w business BiKVThon . forms for Calmer were given ut. Young 4-H officers will have officer training, Mr. Sweet said some of our members may be need to help. If enough persons are interested the 4-H Clubs would like to plan a trip on Nov. 6 to Virginia Tech - Tulsa Football Same. Senior mem bers given the new Achieve ment Records. The 4-H Fishing Contest will continue until Oct. 15. Get amove on fishers! We theif elected new officers. Slate of officers for 1976-77 are  as follows President - Susan Parris, Vice President - David Caldwell, Secretary - Steve Mayberry, Treasurer - Laurie McLean, and Reporter - Rhonda Nash. The meeting was adjourned. Refreshments were served. Rhonda Nash, Reporter"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "as follows President - Susan <mark>Parris</mark>, Vice President - David Caldwell,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "as follows President - Susan <mark>Parris</mark>, Vice President - David Caldwell,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1895.46, 1534.19, 2065.07, 1770.98], "bbox_id": "0ae4be8cb8", "file": "AppomattoxNewspapers_1955-1957a_0310.pdf", "page": 1, "text": "The Appomattox Junior Garden Club held a meeting in the Elemen tary School on October 19. The president, Carlton Collins, presid ed and introduced the new officers, who are Secretary, Virginia Caldwell Reporter, Sandra Trent. One vice-president from each home room Mrs. Carson Nancy Sue Lewis Mrs. Hesson Ronald Sides Mrs. Furbush Helen Mann Mrs. Evans Joan Moses Mrs. Wilkins Mary Lou Jamer son Mrs. Cunningham Joyce Ed munds Mrs. Parris Barbara Gaines The program, which was center ed around flowers and arrange ments, was given by pupils from Mrs. Carsons room. Lawrence Beard gave the devotionals."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Joyce Ed munds Mrs. <mark>Parris</mark> Barbara Gaines The program,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Joyce Ed munds Mrs. <mark>Parris</mark> Barbara Gaines The program,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2020.04, 738.56, 2220.17, 827.06], "bbox_id": "fe53eb5d6f", "file": "AppomattoxNewspapers_1971-1973a_0476.pdf", "page": 1, "text": "The Appomattox County High School Raiderettes, undefeated this season, are pictured above. On the front row, from left to right, are Janet Hix, Donna Paulette, Nan Chambers, Emily Williams, Susan Moore and Brenda Morris. On the second row, from the left., are Mary Louise Parris scorekeeper, Mrs. louise Martin, Coach,"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "left., are Mary Louise <mark>Parris</mark> scorekeeper, Mrs. louise Martin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "left., are Mary Louise <mark>Parris</mark> scorekeeper, Mrs. louise Martin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2029.18, 495.14, 2176.38, 1180.21], "bbox_id": "69f28f6b08", "file": "AppomattoxNewspapers_1971-1973a_0358.pdf", "page": 1, "text": "The Appomattox County Chamber of Commerce will have a dinner meeting on Thurs day, June 29th, at 700 p.m. at Maudes Restaurant. Wives or husbands of members are in vited to attend. Mr. Robert P. Nelson, Ex ecutive Vice President of the Virginia Travel Council in Ri chmond, will be the guest speak er. All members are urged to be present and are asked to notify Mrs. June Chenault, Secretary of the C of C, at the Fidelity Bank regarding reservations. W. W. Blythe is President of the Chamber of Commerce in Appomattox County. 4-H Group Wins On Klassroom Kwiz rne Appomattox Community Senior 4-H Club members ap pearing on Klassroom Kwiz on Monday, June 19th, won over a team of three Boy Scouts, Or der of the Arrow, from Catawba, by a score of 150 to 140 points. The Appomattoxcontestants were behind by 20 points until the third round when one of the scouts failed to spell a word correctly and the three local contestants answered all three of their third round questions correctly. Klassroom Kwiz is seen each Monday night ot 700 p.m. on TV Channel 7, WDBJ, Roanoke. Representing the Appomattox 4-H group were David Jones, Mary Louis Parris and Mike Belter. They were awarded a check in the amount of 25.00 for their club, the prize for first place, and the chance to return next Monday night, June 26th, when they will be competing against a team from Pembrook Methodist Youth Fellowship group from Pembrook. Mr. Frank Sweet is sponsor of the Community 4-H Senior Club. Remember to tune your TV set on Monday night and support these fine young people from Appomattox."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "David Jones, Mary Louis <mark>Parris</mark> and Mike Belter. They"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "David Jones, Mary Louis <mark>Parris</mark> and Mike Belter. They"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1394.63, 274.02, 1797.58, 601.56], "bbox_id": "722e25ee5c", "file": "TimesVirginian_1978_0175.pdf", "page": 1, "text": "The Appomattox County  inior Demonstration Contest will be held Saturday, April 22, neiu iasi oaiuraay at Appomat- beginning at 930 a.m. at 1  .   . tox County High School. The the Appomattox Elementary j  A y u eB u O U S vT Answers entire program involved over 250 4-H members from a nineteen county area. In most areas of competition, the first and second nlace winners will on to compete at the State level in June during 4-H Congress. Among Appomattoxs first place winners were Ernie Chenault, Kathy Lewis, Tama ra Nash, Rhonda Nash and Philip Jacobs. Appomattoxs i Meats Team consisting  of Cheryl Walton, Steve Conner, j Lisa Moore and Mary Dyess j also won first place. Second j place winners were Allen ! Smith, Cheryl Adams and I Donald Parris. Also participating from Ap- pomattox Were David Caldwell, Laurie McLean, Dana White, Susan Parris, and Susan Shorter."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Adams and I Donald <mark>Parris</mark>. Also participating from Ap-"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Adams and I Donald <mark>Parris</mark>. Also participating from Ap-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2002.78, 509.45, 2143.71, 856.64], "bbox_id": "930dc394de", "file": "AppomattoxNewspapers_1971-1973a_0391.pdf", "page": 1, "text": "The Appomattox Community Senior 4-H group, Mike Belter, Mary Louise Parris and David Jones, trying for their 5th con secutive win on Klassroom Kwiz on Monday night, won by a score of 200 to 140 when they were challenged by the Northside High School Key Club of Roa noke. Klassroom Kwiz is seen each Monday night on TV Channel 7 at 700 p.m. People in the area will want to be watching this 4-H group next Monday night when they will be challenged by Floyd Senior 4-H Club of Floyd. It is our understanding that next weeks team will be made up of Mike Belter, Al Johnson replacing Mary Louise Parris who will be vacationing and David Jones. The record now stands at 5 wins - with only two more chances to go. If a team wins 7 consecutive times, they are retired as Champ ions and so h r our local con testants are really going great. We wish them the best of luck next Monday, but win or lose, to us they are real  Champ ions now."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Mike Belter, Mary Louise <mark>Parris</mark> and David Jones, trying"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Mike Belter, Mary Louise <mark>Parris</mark> and David Jones, trying"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.58, 551.63, 1859.81, 739.22], "bbox_id": "d8076aaff6", "file": "AppomattoxNewspapers_1974-1975a_0076.pdf", "page": 1, "text": "The Appomattox Community Senior 4-H Club participated in the County Clean-Up Campaign on Saturday, November 9, 1974. The club was busy cleaning up Route 727 from the new high school out toward the intersect ion including the Promise Land Road. The members sacrificed their free time from 9 a.m. until 12 noon. Members of the club partici pating in the success of the campaign were Pam Moore, Mary Parris, Mike Hancock, Bill Vaughan, Andy Pool, Lauri Cawthorn."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "were Pam Moore, Mary <mark>Parris</mark>, Mike Hancock, Bill Vaughan,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "were Pam Moore, Mary <mark>Parris</mark>, Mike Hancock, Bill Vaughan,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [341.03, 955.25, 617.17, 1244.38], "bbox_id": "f1e05287a7", "file": "AppomattoxNewspapers_1974-1975a_0048.pdf", "page": 1, "text": "The Appomattox Community Senior 4-H Club met Monday night, Oct. 21, 1974 at the Extension Office. The meeting was called to order by Mary Parris, Club President. The minutes of the previous meeting were given by the Secretary, Tamara Nash. They were approved as read. Pam Moore gave the Treasurers report. It was reported that we have 95 in the checking account and 132.00 in the savings account, with a total of 227.00. Our club had several mem bers attending the Virginia State Fair. Pam Moore pre sented a demonstration entitl ed, Once Upon A Dog House for the Virginia 4-H Follies. She  ,   1  also entered the state dog! H j X w GHSIOH LlUD show. Pam with her basset hound, won first place in the breed class and fourth in the obedience class.  Mary Parris, Donna Pau-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "to order by Mary <mark>Parris</mark>, Club President. The minutes"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "to order by Mary <mark>Parris</mark>, Club President. The minutes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.28, 241.24, 1828.5, 920.11], "bbox_id": "dae374329a", "file": "AppomattoxNewspapers_1974-1975a_0010.pdf", "page": 1, "text": "The Appomattox Community Senior 4-H Club met Monday i night. Sept. 16, at the VPI extension office. The meeting was called to order by the past secretary i Mary Parris. Frank Sweet, 4-H extension agent welcomed the new members. The first order of business was the election of the new 1974-75 4-H officers. Mary Parris was elected president, Mike Hancock, first vice-presi dent Steve Cawthorn, second vice-president Tamara Nash, secretary Pam Moore, treasur er and Joe Ford, reporter. The second order of business was the appointing of the standing committees Programs Committee - Mike Hancock and Steve Cawthorn, co-chairmen. Other members include Shenna Watts, Bill Vaughan and Judy Zimmerman. Pam Moore and Joe Ford will serve as co-chairmen of the Special Programs Committee. Karen Lively, Wendy McIn tosh, Susan Campbell, Marcella Lively, Cathy Morris and Freddy Mitchell will serve on the committee. Refreshments committee - Laurie Selz and Teresa Lively, co-chairmen. Other members include Scott Paulette, Karen Lively and Andy Pool. The Treasurers report was given by Pam Moore, it was reported that we have approxi mately 75 dollars in the checking account, and 135 dollars in the saving account, totaling 210 dollars. The Share-the-Fun program was discussed. The date of the program has been changed from the Spring to sometime in late November or early Dec ember. An exact date will be announced at a later time. Some of the members were recognized for the outstanding performances at the Five County Fair. Preparations were made for the week-end camp-out to be held Sept. 20-21-22. The next meeting was scheduled for Oct. 21. The meeting was adjourned by the newly elected president, Mary Parris."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "past secretary i Mary <mark>Parris</mark>. Frank Sweet, 4-H extension"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "past secretary i Mary <mark>Parris</mark>. Frank Sweet, 4-H extension"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2456.48, 1463.11, 2603.67, 1808.38], "bbox_id": "1d72a593b7", "file": "AppomattoxNewspapers_1971-1973a_0398.pdf", "page": 1, "text": "The Appomattox Community 4-H S e n i o r s appearing on Klassroom Kwiz for their sixth consecutive tim e, lost by only 10 points on Monday night, when they were challenged by a team of Senior 4-H members from Floyd. The Appomattox team, Mike Belter, A1 Johnson replacing Mary Louise Parris who was vacationing and David Jones, ended with a score of 140 while the group from Floyd scored 150 points. Appomattox was leading in the second round of questions when George Bassett the Quiz- Master declared an answer from the Floyd team incorrect, then he had to ask for a ruling on the answer and at the end of the program it was ruled correct, thus putting the Floyd 4-Hers 10 points ahead. Our team came close to going all the way to being retired as Champions , but we are poud to say that in losing our team showed the same dignity that they had displayed when they were winning. To all of us in Appomattox, they are truly a Championship team."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Johnson replacing Mary Louise <mark>Parris</mark> who was vacationing and"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Johnson replacing Mary Louise <mark>Parris</mark> who was vacationing and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1845.14, 1094.63, 2000.06, 1649.15], "bbox_id": "5f2c6f49a9", "file": "TimesVirginian_1978_0277.pdf", "page": 1, "text": "The Appom attox Middle School Home Economics De partment was the setting for a surprise shower on Monday afternoon, June 5, in honor of Miss Dale Layne. Miss Layne,whose marriage to Mr. Steve Weakley will be an event of July 8, was presented with a place setting of china. In addition to the bride-elect, those in attendance were Mrs.  Hezteine Foster, principal Mr.  Lloyd Walton, superintendent and all faculty members of the school. Area Students Named To Long woods Deans List I The following students were among 330 Longwood students, in an enrollment of approxi mately 2,200 at the college-, who achieved the distinction of earning an academic average of 3.5 B from a possible 4.0 during the second semester of the college year. There were 82 students who made 4.0 or all As. From Appomattox County, named to the Deans List were Anita Lynn Glover, Beverly Dianne Harvey - 4.0, Mary Louise McCraw, and Mary Louise Parris. Founded in 1839, Longwood became fully coeducational in June of 1976, offering residence hll accomodations and all attendant services to both male and female studenta. A comprehensive institution, the . college offers majors in 30 subject areas, as well as professional training for social work, business, the health sciences and teaching."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "McCraw, and Mary Louise <mark>Parris</mark>. Founded in 1839, Longwood"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "McCraw, and Mary Louise <mark>Parris</mark>. Founded in 1839, Longwood"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [799.71, 882.39, 960.0, 1018.89], "bbox_id": "18d0871324", "file": "AppomattoxNewspapers_1971-1973a_0101.pdf", "page": 1, "text": "The annual Book Fair is com i n g to Appomattox Intermediate S c h o o l as announced by Mrs.R. J 3 . Parris, librarian. Students and parents are in- v i t e d to browse among hundreds o f book offerings and to place o r d e r s for holiday giving or for p e rs o n a l pleasure. The Book Fair will be held Monday, Nov. 8 through Friday, P io v . 12. Everyone is invited to s e e and buy."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "by Mrs.R. J 3 . <mark>Parris</mark>, librarian. Students and parents"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "by Mrs.R. J 3 . <mark>Parris</mark>, librarian. Students and parents"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1414.5, 214.13, 1712.96, 853.91], "bbox_id": "ea625cf39b", "file": "TimesVirginian_1980a_0038.pdf", "page": 1, "text": "The Annual 4-H Awards Walton Leadership Lisa Banquet was held last Monday Moore, Cheryl Walton, Allen evening in thei cafeteria of Smith Photography Nancy Appomattox County High Cole Joanie Canada Public School. Approxim ately 150 Speaking Blair Smith, Brett persons attended the banquet Marston, Rhonda Nash, Ruby including 4-H members and Smith Safety Dawn Dawson, their families. Janet Smith Wood Science F ollow  a covered dish Donald Martin, Russell Walton, m eal, the following 4-H Mike Hansen, Billy Caldwell members were recognized for Community Beautification their outstanding work in Laura Walton Horse Cheryl various project areas Agricnl- W ooten, Janice Abernathy tuml Glen Glowdis Achieve- Recreation Tony Bailey, Jo rent Lisa Moore and Cheryl Ann Jamerson and Fashion Walton Bicycle Janet Smith, Revue Karen Stevens, Nancy Brett Marston, Stefanie Mar- - WopKjridge, Natasha ,-Woold- tin Bread Jane Guill, Rhonda ridge and Nash, Joanie Canada Citizen- Awards were also made for hip David Caldwell, Laurie the top winners in the Wildlife McLean- Clothing -Martha Feed Patch program. Mr. Bill Haley, Jennifer Inge, Jennifer Caldwell, Vice President of the Coleman,. Betsy W ingfield sponsoring . Pamplin Ruritan Commodity Marketing Allen Club, presented awards to 1st Smith, Blair Smith Conserve- dace Wayne Waycaster, 2nd tieu . of Natural Resources Jo Ellen. Garrett, 3rd Glen Jeannice Bartelt, Shelia Mul- McClenny, 4th Curtis Pearson tins, . Dale Glover, Cheryl and 5th Angelia Jaggars. Waltop Consumer Education Also recognized were out- Mike Davis, Lonnie Reynolds, Standing .volunteer 4-H leaders Ernest Humbles, Jr. Dairy Mrs. Elaine Stanley, Mrs. Janet Foods Tiffany Royal, Angel Morgan and Mrs. Cindy Goode, Angela Totty Dog Thomas. Framed certificates Care Anne Hancock, Jessica were presented to each of these Stanley Electric Energy Brian volunteers in recognition of Hudson Food Conservation their contributions to the 4-H and Safety Billy Carter Food program in Appomattox, and Nutrition Nancy Cole, Special certificates were Carrel Almond,  Cathryn Bal- awarded to 4-Hers who have lowe, Jo Ann Jamerson Food made outstanding accomplish- Preservation Sally Coleman, ments in project areas where Bonnie Drinkard Jennifer they had previously received ColernSn Cats Tiffany Royal, county awards or in areas Wendy Harris Entomology where county awards were not Janet Smith, David Hendricks, available. Recognized were Patty Harris, Beraadine Gar- Susan Parris in Leadership rett. Terri Nash in Egg Cookery Also recognized were.Fore- Glen McClenny in Crops and try Cheryl Wooten, Lisa Beef Patty Harris in Poultry Harrison Gardening Jennifer and Dog Care Lisa Harrison in Coleman Health Jennifer Dog Care Kenneth McClenny Inge, Janet Smith Home in Crepe and Beef and Dana rnvtrenmsrit Tosnin Canada, W hite in Dog Care and Patricia MyrickNeasien Stan- Forestry. - ley, Janice Abernathy Home A special appreciation award Management Ada Hunter, Lisa was given to M rs., Ruby Campbell, Laurie Cowan, Laura Continued on page 2B"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Harris, Beraadine Gar- Susan <mark>Parris</mark> in Leadership rett. Terri"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Harris, Beraadine Gar- Susan <mark>Parris</mark> in Leadership rett. Terri"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [577.71, 483.27, 1285.16, 569.12], "bbox_id": "c876922ffc", "file": "TimesVirginian_1976_0191.pdf", "page": 1, "text": "The above FFA members were recognized at a special meeting of the Appomattox County High School FFA Chapter on May 1, 1976 , tor their outstanding academic achievement for the past year. Each of these students has made the honor roll four out of five times this school term. They were 1st row left to right Steve Cawthorn, Lelia Maxwell, Tim Guilfr Richard Guill, Andrew Kelso, Robert Dyess, 2nd. row, Jimmy Baxter, Karen Carter, Danny Carson, Kent Hodges, Hunter Marshall, David Stratton, Jon Faulkner, Andy Poole, 3rd row David Kembel, Timmy Martin, Donald Parris, Bobby Harris, Donnie Thornhill, Tony Story, Ronnie Richardson, and Chris Johnson. BILLS PASTRY SHOP m m a m i m k 7"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Kembel, Timmy Martin, Donald <mark>Parris</mark>, Bobby Harris, Donnie Thornhill,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Kembel, Timmy Martin, Donald <mark>Parris</mark>, Bobby Harris, Donnie Thornhill,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [277.7, 980.46, 419.4, 1157.45], "bbox_id": "a5bb20b491", "file": "AppomattoxNewspapers_1974-1975a_0321.pdf", "page": 1, "text": "The 1975 Appomattox 4-H Dog Show was held Tuesday night, June 3 on the Appomat tox Middle School Football Field. There were 41 dogs entered by 39 different 4-H members in this years show. The top award Best in Show went to Pam Moore with her Bassett Hound Snoopy. Pam also won the hound clau. W inners in each class, receiving ribbons and trophies were as follows Sporting Dogs Susan Parris English setter Working Dogs Bobbie McFa den Collie Non-Sporting"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "follows Sporting Dogs Susan <mark>Parris</mark> English setter Working Dogs"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "follows Sporting Dogs Susan <mark>Parris</mark> English setter Working Dogs"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2032.78, 159.69, 2184.46, 643.22], "bbox_id": "0025428c79", "file": "AppomattoxNewspapers_1974-1975a_0412.pdf", "page": 1, "text": "the 14 and over age group. The girls appeared in pantsuits, mock tops, school and church wear and Bicentennial fashion ed dresses. The parade of fashions was narrated by Mrljn,u Wampler and music was provided by Daniel Stratton. The judges were Dr. Beatrice Kalka, VPI  SU Clothing Specialist, Mrs. Made line Thomas. Appomattox High 8ehool Home Economics teach er, and Mrs. Marilyn Tutwiler, former Georgia State 4-H Dress Revue winner. Each girl was awarded a ribbon based on her construction techniques, poise, modeling and knowledge of the clothing aspects. The top three models selected in the under 14 age group were First place- Cheryl Walton Second place - Elizabeth Coffey and Third plf, . Laurie McLean. In the other 14 group Vicki Glover placed first, and will represent the county at the District Dress Revue in the Spring. Placing second was Marlene Moore and third was Beverly Harvey. The other models were Under 14  Sharon Davis, Beverly Cole man, Jeanne Baldwin, Jane Guill, Donna Robinson, Sharon Guill, Tina Long, Shelia Roach, Janis Richardson, Laura Wal ton, Nancy Taylor, Angela Richardson, Gwen Maria King. Wendy Lee, Angela Moore, Debbie Baldwin and Lisa Moore. Other models, 14 and over were Susan Parris, Berneta Moore and Mary Dyess. We would like to thank the"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and over were Susan <mark>Parris</mark>, Berneta Moore and Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and over were Susan <mark>Parris</mark>, Berneta Moore and Mary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.07, 221.38, 1682.84, 579.62], "bbox_id": "097f3190f9", "file": "TimesVirginian_1980a_0033.pdf", "page": 1, "text": "that were befog gained from this service. AU nominations were sent to the Virginia Division for Children, Rich mond, and were reviewed by a five-member awards commit tee. Susan Parris, daughter of Mr and Mrs. R. B. Parris, Jr. and a senior at Appomattox County High School, was nominated by the Appomattox County Ex tension Service for her work with children through 4-H activities. Susan received a certificate of merit for her involvement and service thr ough 4-H. Also receiving certificates of merit were Sandra Ferguson, a senior at ACHS, and Stephanie Ferguson, a junior this year. Sandra, daughter of Mr. and M rs. John Ferguson, . and Stephanie, daughter of Mr. and Mrs. Herman Ferguson, were both nominated by the Lynch burg Junior Volunteer Service. Both Sandra and Stephanie have unselfishly given time and talent as volunteer aides at Lynchburg-General Marshall"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "awards commit tee. Susan <mark>Parris</mark>, daughter of Mr and"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "awards commit tee. Susan <mark>Parris</mark>, daughter of Mr and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.89, 990.1, 1583.7, 1343.33], "bbox_id": "dd51917c82", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "Thanks to Mayor-deal Ron nie C. Spiggle for bringing me copies of several newspapers from the Eastern Carolines. Briefs .-Don Parris has a likely young black dog named Tfa. Will be an excellent retriever, says Don. And I met a friend from Baltimore who said gnats w ere bad up thattaway top,   -  Browsing in my basement, I came upon a box of pictures, letters and clippings left by my late father, the Rev. B. F. Robinson. One valued item was a tintype picture of my great grandmother, who was born November 18, 1811, and died Septem ber 17, 1880. My maternal  great grandmother, that is, Margaret Howell. And a dipping of a sériés of sermons by my- father on subjects suggested by beloved hym ns.. Love Lifted Me, There is a Fountain Filled with Blood, Brighten the Corner Where You Are, Lifes Railway to Heaven and Oh, Think of the Borne Over There."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Eastern Carolines. Briefs .-Don <mark>Parris</mark> has a likely young"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Eastern Carolines. Briefs .-Don <mark>Parris</mark> has a likely young"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [408.95, 489.46, 543.84, 643.26], "bbox_id": "3d8b436bad", "file": "TimesVirginian_1980a_0340.pdf", "page": 1, "text": "Terri Nash, and Susan . Parris.   4-H Share-the-Fun , prog rams will be held in late - November. Share-the-Fun provides an opportunity for members to display their talents, creativity, original ity, and to develop an appreciation performing on stage. Details will be announced to all 4-Hers during October and Novem ber 4-H meetings."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Terri Nash, and Susan . <mark>Parris</mark>.   4-H Share-the-Fun , prog rams"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Terri Nash, and Susan . <mark>Parris</mark>.   4-H Share-the-Fun , prog rams"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1013.48, 265.7, 1174.63, 533.0], "bbox_id": "61cfd5cfaa", "file": "AppomattoxNewspapers_1892-1898a_0538.pdf", "page": 1, "text": "tended the commencement at West Appomattox and spent the reusin der of the Week visiting friends here. We re glad to say that Mrs. David Bales is again convalescent Miss Ada Whitaker has returned from Crewe. While there she suf fered very much with rheumatism, she is improvin now.  Miss Mol tie K. Cheatham is visit ing relatives in Portsmouth. Rev. J. W. Parris filled his appoint ment at Salem, Sunday evening. The death of M rs. Mason which occurred some time ago was very sad indeed. Her health began to fail aud she was carried to Brookueai Instead of getting better she grew worse and died leaving husband and children to mourn her death. Her youngest child being only one year They have the sympathy of"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Portsmouth. Rev. J. W. <mark>Parris</mark> filled his appoint ment"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Portsmouth. Rev. J. W. <mark>Parris</mark> filled his appoint ment"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.64, 846.59, 2295.74, 917.53], "bbox_id": "2c620a9ebe", "file": "AppomattoxNewspapers_1974-1975a_0121.pdf", "page": 1, "text": "tax burden. Admittedly, a 6-5 percent unemployment rate is bad if you are among those out of work, you are 100 percent m B Goldman, Extension Agent, awards Achieve- ils to left to right Mike Hancock, Mary Parris, Pam Donna Paulette."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "right Mike Hancock, Mary <mark>Parris</mark>, Pam Donna Paulette."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "right Mike Hancock, Mary <mark>Parris</mark>, Pam Donna Paulette."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.81, 960.56, 1714.66, 1368.23], "bbox_id": "6f254d96dd", "file": "AppomattoxNewspapers_1974-1975a_0121.pdf", "page": 1, "text": "Tamara Nash, Billy Washburn, J r. Swine David Robinson, Patty Harris, Pam Shrock V eterinary Science Robert Dyess Citizenship Mary Par ris Dress Revue Paula Frank lin and Recreation Al John son. A special award to an outstanding Senior boy and girl 4-H member was donated by the American Youth Founda tion. The awards, consisting of a book written by William H. Danforth entitled I Dare You, were presented to Mary Louise Parris and Mike Hancock. The award recognized outstanding traits of leadership and citizen ship. These awards were presented by Extension Agents C. B. Goldman and F. H. Sweet. Mrs. Shirley W. Walton, Extension Agent, presented a special Foods and Nutrition Award donated by the Foley M anufacturing Company to Cynthia Hix. The award con sisted of approximately 25.00 worth of houseware. Special Recognition Plaques were awarded to Mrs. Sadie Bright well, Mrs. Anne Coffey, and Mrs. Alease Cobb for their contributions to 4-H as Adult Volunteer Leaders. The awards were sponsored in part by National Auto Parts of Appo-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "presented to Mary Louise <mark>Parris</mark> and Mike Hancock. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "presented to Mary Louise <mark>Parris</mark> and Mike Hancock. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1057.9, 756.91, 1198.15, 1015.75], "bbox_id": "ff0192e7ca", "file": "AppomattoxNewspapers_1974-1975a_0253.pdf", "page": 1, "text": "Tam ara Nash, Secretary, called the roll and called for old business. We discussed the plaque we were hanging in the gym in the honor of Coach James Eckhardt. We talked about how much it would cost. We decided to let Donald Parris be in charge of buying the plaque. Then we discussed the election for 1975-76 SCA officers. We picked an election committee to meet on their lunch shift to discuss the elections. We discussed that everyone who wanted to run for election has to write an essay on why he or she wants to, be_anofficer in ijjte SCA, The last thing we discussed was the 50s day. We discussed on having the 50s day on May 2. We also elected a committee for the 50s day. Bill Vaughan, Reporter"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "decided to let Donald <mark>Parris</mark> be in charge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "decided to let Donald <mark>Parris</mark> be in charge of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [915.85, 501.04, 1061.87, 863.42], "bbox_id": "2449da421f", "file": "TimesVirginian_1981a_0228.pdf", "page": 1, "text": "t y , the 4-ITers from Wisconsin had the opportunity to visit Holiday Lake 4-H Camp, Holiday Lake State Park, Buckingham - Appomattox State Forest H eadquarters, Montieello, S her an do Lake Recreation Area, the Blue Ridge Parkway and the Peaks of Otter. In addition the 4-H visitors had the opportunity to experience life with their respective host family during several free days. Families hosting the visitors from Wisconsin included Mr. and Mrs. R. B. Parris, Jr. Mr. and Mrs. J. A, Smith Mr. and Mbs. John W. Hix Mr. and Mrs. Marvin A. Glover, Jr. Mr. and Mrs. Richard Krantz Mr. and Mrs. L. E. Nash Mr. and Mrs. Lloyd Walton and Mr. and Mrs, Ronnie Stevens. Next summer a group of teenage 4-ITers from Appomat tox will have the opportunity to travel and visit in Wisconsin as the exchange trip is completed. Appomattox 4-ITers have been involved with interstate exchange trips in the past with groups from Tennessee, Mary land, Pennsylvania, South Dakota and Nebraska."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "and Mrs. R. B. <mark>Parris</mark>, Jr. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "and Mrs. R. B. <mark>Parris</mark>, Jr. Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1538.59, 164.22, 1842.2, 539.5], "bbox_id": "02a74ed5d4", "file": "TimesVirginian_1978_0373.pdf", "page": 1, "text": "T urner, M ichelle Tweedy, Mayberry, Lulu McCoy, Mattie I Gladys Walker, Jill Walton, McCoy, Terry McCoy, Virginia Theresa W atts, Barbara Wen- McCoy, Vivian M cFadden, ning, Brenda W est, Julie Laurie McLean, Carolyn Meg- White, Lisa White, Bonnie ginson, Barbara Miller, Yolanda Williams. M iller. Lori M itchell, Lisa Homeroom 318 .Mark Moore. Chevalier, Lonnie Hix, Ronnie Homeroom 308  M ark I Hodnett, Paul KrajewSki, Tho- Paulette, PhQ Paulette, Miehael mas Randolph, Kerry Richard- Phelps, Tony Phelps, Mark son. Bill Vaughan, Randy Pierce, David Price, Greg W aterm an, Carol W atson, Pugh, Ronnie Quaintance, Sammy Webber, Robert West, Charles Rixey, Michael Robin- Dave Williams, Marcell Wfl- son, Ronnie Robinson, Byron liams, H. L. Williamson, Jerry Roach, Rhonda Nash, Cheryl j Woods, Sharon Overton, Ar- N otestein, Beverly Oxner,  lene Pankey, Pam Sm ith, Janice Pankey, Martha Petty, Renee Williams, Connie Wood- Susan Parris, Cynthia Powell, son, Sharon Woody, Dee Ann Arlene Preston, Sherri Repass, Wooten. Angie Richardson, B rigette Homeroom 328 - R. L. Richardson, Sara Richardson. Cordell, Mark Hunter, Chris Homeroom 309 - Clarence Johnson, Reed Johnson, Irby Rosser, Darrell Schrock, Ger- Jones, Jeremiah Jones, Na- aid Sharp, Kenny Shorter, thaniel Jones, Richard Keeler, Craig Smith, DanreU Smith, Andrew Kelso, David Kembel, Troy Stanley, Scott Stevens, Marcus Kidd, Roger King, June Herbert Thornton, Jerry Tr- Harris, Priscilla Harris, Sherri ent, James Vassar, Debbie Harris, Machelle Harvey, Missy Roach, Linda St. John, Robbie Harvey, Sarah Harvey, Donna Sayre, Sherry Shorter, Pam Hodges, Theresa Holt, Karen Shrock, Debbie Smith, Shelby Jefferson, K athy Johnson, Smith, Edith Smoak, Robin Spiggle, Irene Story, Renae Thomas. Homeroom 310  James Hash"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Williams, Connie Wood- Susan <mark>Parris</mark>, Cynthia Powell, son, Sharon"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Williams, Connie Wood- Susan <mark>Parris</mark>, Cynthia Powell, son, Sharon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [249.35, 195.08, 725.93, 488.83], "bbox_id": "ebf974a793", "file": "AppomattoxNewspapers_1915-1918a_0552.pdf", "page": 1, "text": "T i m a s V? r a i n ! a n I reltiree or dear one in, or anylment position there. I IU C B- r i r g i u i a u  proapeot o aQj  to be oalled tolher much eucceee. serviceto realize what the I Mieses Earl and Ida Farrar WEDNESDAY, JUNE 12, 1918 I great war means to those who I hare returned from Petersburg, are oalled upon to give up an I where they have been visiting, only son, a brother or any dear! O b Saturday of last week Dr. one. If you are not a parent it I Walker took hie little grand is impossible for you to know I son, Charlie Parris, of Shenan .. cord-cu MU septemb it.i how the mother or father feels. Idoah, to Lynohburg for an  iftTii r r   ,aimnoM-v- lf you have no brother, how opertaion. can you know what a sisters feelings are? Sympathy 1 Ob! that more of us knew the mean tng of the word I Subscription i.oo por annum, su month, so W e w ere so gld to re a d th e tAJ 3 VXRTl 51 MEjrrs Fortnntkntadvoriliemonts SOc I Dice le tte r fro m One o f OUT d e a r r n Inch lo advance CtonUMooo cunt vtt word I. WinoflaM It eeal78c per inch aach Insertion for four weolu I bOySUourtney W lngneia. XI Local or advortlMmcnu aawnx rcadgig allor10c I h fnr thfl home per llite or 2c per word Obltuerletfifty words free, I W 0 U I3 D0  0 0 0 IO a v u v uuixiw MTbil,boi i?yraTip.M ra 4rataijtloi. I folks if th e boyS WOUld W rit M l fre q u e n tly su ch c h e e ry le tte r s  o u r d  st r o y k r s in  u r o p s a n tin ahould bo ant al lb Ik of Mopping th. paper f al llm rate of two cents per week. In changmf your address give old end new office. Wetcb the label on your paper and keep paid up. I the editor It not responsible nor dor, he aheeyel endorse llm views ol articles published outside of the I editorial columns. Fret Inltrchangs of vlrw, on pub lic questions received Address comrnunlcetlooe TIMES-VIRGINIAN. Apponteltox. Va."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "know I son, Charlie <mark>Parris</mark>, of Shenan .. cord-cu MU"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "know I son, Charlie <mark>Parris</mark>, of Shenan .. cord-cu MU"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1730.86, 629.62, 1822.47, 666.15], "bbox_id": "df22cb337f", "file": "AppomattoxNewspapers_1971-1973a_0376.pdf", "page": 1, "text": "t i H  - l m Susan Parris"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "t i H  - l m Susan <mark>Parris</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "t i H  - l m Susan <mark>Parris</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1292.14, 276.31, 1429.54, 349.65], "bbox_id": "82ed03cfd9", "file": "AppomattoxNewspapers_1971-1973a_0329.pdf", "page": 1, "text": "Susan Rosser, Ann Sears, San dy Chambers, Melanie Folks Mary Louise Parris, Gail and Dale Blaine, AnnHerncall, Car ol and Jeannette McFaden, Pat ty White, Beth Lawson, Susan Weatherly and Susan Doss."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Melanie Folks Mary Louise <mark>Parris</mark>, Gail and Dale Blaine,"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Melanie Folks Mary Louise <mark>Parris</mark>, Gail and Dale Blaine,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1607.75, 345.39, 1794.95, 357.66], "bbox_id": "dad867e6ac", "file": "TimesVirginian_1980a_0328.pdf", "page": 1, "text": "Susan Parris Usa Moore"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Susan <mark>Parris</mark> Usa Moore"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Susan <mark>Parris</mark> Usa Moore"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.59, 273.3, 1614.22, 365.1], "bbox_id": "d0ac7e8baf", "file": "TimesVirginian_1980a_0203.pdf", "page": 1, "text": "Susan Parris, Sherri Repass, Pam Shroek, Robin Spigete Gradali A Honor RoO Keith Dickerson, Randy Franklin, Nugene Harvey, Philip Jacobs, Kim Coggins, Jean Thomas,- Kim Wade, Cherjrl Walton"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Susan <mark>Parris</mark>, Sherri Repass, Pam Shroek, Robin Spigete Gradali A Honor RoO Keith Dickerson, Randy Franklin, Nugene Harvey, Philip Jacobs, Kim Coggins, Jean Thomas,- Kim Wade, Cherjrl Walton"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Susan <mark>Parris</mark>, Sherri Repass, Pam Shroek, Robin Spigete Gradali A Honor RoO Keith Dickerson, Randy Franklin, Nugene Harvey, Philip Jacobs, Kim Coggins, Jean Thomas,- Kim Wade, Cherjrl Walton"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [696.49, 842.66, 828.94, 990.45], "bbox_id": "abc009f463", "file": "TimesVirginian_1980a_0191.pdf", "page": 1, "text": "Susan Gay Parris Susan Gay Parris is the daughter of Mr. and Mrs. R. B. Parris, ST of Route 1, Appomattox.  Sudkn is the winner of the 4Rood Citizen Award spon sored by the Blue Ridge Chapter of the Daughters of the American Revolution. The elected Good Citizen exhibits the qualities of leadership, dependability, erricvfOd ptfjptiP ."}, "highlight": {"text": {"matched_tokens": ["Parris", "Parris"], "snippet": "Susan Gay <mark>Parris</mark> Susan Gay <mark>Parris</mark> is"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris", "Parris"], "snippet": "Susan Gay <mark>Parris</mark> Susan Gay <mark>Parris</mark> is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2028.48, 211.38, 2360.74, 414.93], "bbox_id": "1fdf874b9d", "file": "AppomattoxNewspapers_1908-1909a_0291.pdf", "page": 1, "text": "sumrôf Jmôneÿ solely on thelpeople attended the funeral bf judgment of the Secretary ox J little Paulette Cross Parris at the Treasury, ih a speech in!Stonewall Sunday afternon. the House of Representatives I Mr. C. M. Stratten, who has Démocratie Leader Garner de-1 had pleurisy, is able to be out manded that at least one case I again. be taken to the courts to deter-J Misses Elyn Andrews and mine whether these war taxes I Esther Pugh, of Phehix, and are being returned fairly, or I Mr. Bruce Hall, of Hillsville,  whether other taxpayers not so I and Miss Julia Millington, of fortunate, who must make up I Charlotte County, were week- the difference in the xes they lend guests of Mr. S. E. Ander- pay, are being discriminated a-Bon and family, gainst. I Mr. and Mrs. Dünkley Gun ter and son, Bobbie Anderson, One of the fundamental rea-1 visited Mr. Gunters brothers"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "J little Paulette Cross <mark>Parris</mark> at the Treasury, ih"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "J little Paulette Cross <mark>Parris</mark> at the Treasury, ih"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1524.98, 268.44, 1671.17, 675.87], "bbox_id": "92696f1b2f", "file": "TimesVirginian_1978_0275.pdf", "page": 1, "text": "Summer Sewing Classes. All 4-Hers who are enrolled in dothing projects are invited to sign up for these dothing dasses. Registration will be at the Extension Office on Tuesday, June 20, at 1 p.m. or you may sign up at Pamplin Elementary School on June 23 at 9 a.m. The easiest way to register may be to phone us at 352-8244 and let Miss Hudson or Mrs. Walton know you wish to take part. Classes will begin during the week of June 26. These classes will be a good, chance to learn valuable skills. , V   A group of 4-Hers and teen leaders met last week to plan our 4-H Camp program for this year. Helping with the camp planning were Tom Cobb, Jay Stewart, Mike McCoy, Scott Drinkard, Jody Williams, Mike Roach, Sally Coleman, Dana Moore, Becky Bass, Annette Miller, Susan Parris, Rhonda Nash, David Caldwell and Susan Shorter. Were always looking for ideas for camp and well welcome your sug gestions.    4-Hers OF THE WEEK Mary Dyess, Rita Reynolds and Bud Rosser who appeared on Klassroom Quiz."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Bass, Annette Miller, Susan <mark>Parris</mark>, Rhonda Nash, David Caldwell"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Bass, Annette Miller, Susan <mark>Parris</mark>, Rhonda Nash, David Caldwell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2102.66, 1568.43, 2264.44, 1793.46], "bbox_id": "d77a0ad22d", "file": "AppomattoxNewspapers_1926-1933a_0516.pdf", "page": 1, "text": "STONEWALL o- 0 STONEWALL,Little Ty Cobb Drinkard, young son cf Mr. and Mrs. Clayton Drink ard, of Stapleton, is critically ill at the Baptist hospital. Mr. Drinkard is with him. Mrs. W. D. Parris is a pa tient at the Baptist hospital. She is improving and expects to leave soon. Mrs. Brent Stratton enter tained the Stonewall Circle of Hebron W. Wednesday afternoon with a large -number present. After an interesting program.the hostess served.a luncheon coursgii assited  by Miss Virginia Cmok . k-"}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "him. Mrs. W. D. <mark>Parris</mark> is a pa tient"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "him. Mrs. W. D. <mark>Parris</mark> is a pa tient"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1504.72, 1322.47, 1780.82, 1418.21], "bbox_id": "4bcbadab58", "file": "AppomattoxNewspapers_1974-1975a_0477.pdf", "page": 1, "text": "Steve Cobb, David Caldwell and Philip Jacobs receive county awards from C. B. Goldman for excellence in the electric project. These awards along with many others were made at the annual 4-H Awards Banquet in December. Kim Carter front is pictured with the ten-speed bicycle which she won as top fund raiser in the 4-H Walkathon for Muscular Dystrophy. Pictured with Kim are committee members Shelia Goin and Mary Parris and Cynthia Hix with Mr. Jim Beaty, of Poe Hardware Company."}, "highlight": {"text": {"matched_tokens": ["Parris"], "snippet": "Shelia Goin and Mary <mark>Parris</mark> and Cynthia Hix with"}}, "highlights": [{"field": "text", "matched_tokens": ["Parris"], "snippet": "Shelia Goin and Mary <mark>Parris</mark> and Cynthia Hix with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
