{"document": {"bbox": [1183.9, 1154.24, 1312.49, 1306.63], "bbox_id": "8c876f32c7", "file": "AppomattoxNewspapers_1902-1905a_0065.pdf", "page": 1, "text": "YOU NEED THESE I I L cake of Roger and GailsttS  A cake of Packers Tar Soap. 1 A oak of Pears Glyoeriie 8  A oake of Peers Unscented It Aeake af Colgates Palm lea A oaks of Colgates Turkish I A cake of Armonr  Palm, 5a A cake of Alsu ends fiard Ws A oake ef Unele lams Tar 9cs 3 cakes of Clycsrine Soap, flo- ? Sfkieh Bath Sosa 1 box 500 Toothpicks, 5 o 1 bottle olachins OIL 5 c.  1 Quart battle Ammonia, 9. 8 1 lGc- bottle Vaseline for 60 -"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "8  A oake of <mark>Peers</mark> Unscented It Aeake af"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "8  A oake of <mark>Peers</mark> Unscented It Aeake af"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1958.24, 1365.51, 2037.47, 1390.76], "bbox_id": "f17176a37a", "file": "AppomattoxNewspapers_1974-1975a_0420.pdf", "page": 1, "text": "Yomg Faamors Young a m fron 10-35 peers o f age"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "Yomg Faamors Young a m fron 10-35 <mark>peers</mark> o f age"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "Yomg Faamors Young a m fron 10-35 <mark>peers</mark> o f age"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1387.17, 948.69, 1536.82, 1152.68], "bbox_id": "13b27ce941", "file": "TimesVirginian_1981a_0354.pdf", "page": 1, "text": "years, received the certificate from Ethel L. Johnson, district director of Epsilon Sigma Phi and Halifax County agent. Mrs. Johnson is an Extension agent in Halifax County. Mrs. Torrence began her career in Buckingham County and transferred to the District office in 1955. A charter member and first president of the East Central District Extension Secretaries Associa tion, she is highly respected by her peers who look to her for leadership. H er advice is sought by the secretaries on job responsibilities because of her exceptional knowledge of the"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "highly respected by her <mark>peers</mark> who look to her"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "highly respected by her <mark>peers</mark> who look to her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [461.05, 539.81, 600.6, 893.69], "bbox_id": "fb5516c5a2", "file": "AppomattoxNewspapers_1974-1975a_0246.pdf", "page": 1, "text": "years, delights in telling her i story of the surrender which , took place here April 9, 1865, j just 77 years ago Thursday. Aunt Millie, quaint, timid, and full of interest in her white and negro friends, was active for her age until last spring when she was struck by a bolt of lightning while in bed. She now walks with the aid of a eane, keeps house for her only son. Uncle Bob Craig, who has served as janitor at Appomattox High School for several generations. Aunt Millie was 13 at the time of the surrender and was the nurse maid of Charlie Sackett Peers, six month old son of Mr. and Mrs. George T. Peers. Mr. Peers was at the time clerk of the Court of Appomattox and was living near the scene of the surrender. I was walking de floor, patting my baby to sleep, when those yankee soldiers came bustin in Marse Georges house. The soldiers hollered for everybody to leave de house cause the worst battle ever fought was starting right den. Marse George fetched Miss"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "maid of Charlie Sackett <mark>Peers</mark>, six month old son"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "maid of Charlie Sackett <mark>Peers</mark>, six month old son"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1323.36, 676.75, 1471.46, 711.2], "bbox_id": "b6da3b8c3f", "file": "AppomattoxNewspapers_1892-1898a_0326.pdf", "page": 1, "text": "ye are glad to state th at Mrs Geo. T. Peers, who lias been quite, sick for several weeks,is now improv"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "ye are glad to state th at Mrs Geo. T. <mark>Peers</mark>, who lias been quite, sick for several weeks,is now improv"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "ye are glad to state th at Mrs Geo. T. <mark>Peers</mark>, who lias been quite, sick for several weeks,is now improv"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1802.58, 1452.45, 1845.02, 1619.85], "bbox_id": "3f6ae3045c", "file": "AppomattoxNewspapers_1898-1902a_0029.pdf", "page": 1, "text": "Worl hotel of re 8 idencl ing pusl under Ernest let to col Peers anl handsonl Smith l Burke beautiful complete! mattox"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Worl hotel of re 8 idencl ing pusl under Ernest let to col <mark>Peers</mark> anl handsonl Smith l Burke beautiful complete! mattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Worl hotel of re 8 idencl ing pusl under Ernest let to col <mark>Peers</mark> anl handsonl Smith l Burke beautiful complete! mattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [649.7, 1457.93, 808.53, 1626.08], "bbox_id": "14cfebef48", "file": "AppomattoxNewspapers_1898-1902a_0030.pdf", "page": 1, "text": "Work is being pushed on the naw hotel of Mr. T. A. Smith. The new residence of Mr. T. A. Walton is be ing pushed to completion and will be under roof in a few days. Mr. Ernest Gills fine residence has been let to contract. Messrs. George T. Peers and E. W. Taylor will build a handsome residence on a part of the Smith lot, adjoining -Messrs. Hill, Burke and Miss Lelia Inge. The beautiful new Baptist church is completed. Who says West Appo mattox is not forging ahead."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "contract. Messrs. George T. <mark>Peers</mark> and E. W. Taylor"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "contract. Messrs. George T. <mark>Peers</mark> and E. W. Taylor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [547.47, 1272.82, 707.86, 1449.81], "bbox_id": "69f469ea46", "file": "AppomattoxNewspapers_1902-1905a_0146.pdf", "page": 1, "text": "Womans lights ? What does t woman want iv rights, whin she has pnv leges? Rights is th  last thing we get in this wjirruld. Theyre the nex tlnngs to wrongs. They are wrongs turned inside out. We have n right to be sued fr debt, instead v lettin th  bill .run. which is a m y lege. . We have th  right to tlinle be a jury iv our peers, a right to pay taxes, an a right to wnrruk. 0 n e m, ,se t iuS 8 is .anny good to me. Iheys no fun in thim. All th rights I injve I dont in- jye, I injye ch -2 right to get money, but I nrver have had anuy money to spind. Tfl Lonstichooshon guaran tees me th  right to jife, but I die-"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "a jury iv our <mark>peers</mark>, a right to pay"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "a jury iv our <mark>peers</mark>, a right to pay"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2394.25, 1190.68, 2559.45, 1688.12], "bbox_id": "45cb8dd959", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "wm broughttwfore themeetina and broughtbefore the meeting and accepted the nomination. He a m that he wm Democrat, and would do his utmost to scour a victory for the Democratic patty in this oontest and if elected would render the beat service in his power to the people of the Bounty, Speeches were then made by H. D. Flood, T. J. Stratton, J. W. Flood, W, J. Trent, J. H. Abbitt, and Dr. Morton. All of these gen tlemen regretted the attitude of Mr. Peers in this contest and urged Upon all Democrats the duty of support ing the nominees oi the meeting. Dr. Morton said that he wm a Peers man before the nomination, butneup he was lo t the namiaeek AbbHt H. D. Flood gave a history of the consideration shown Mr. Peers, by the Democratic committee before they decided to have  nomiaatim deferring action in defacenoe to lb wishes until our opponents hud pot a ticket in the field, and of the num ber of proposition made h ty Mr. Abbitt, by which Peers ooulu have become the Demoorotie nomi nee all of which he declined, life. - Flood said if the party desmed fo  maintain its organisation and ft self-respect and n tein the resptetef jrave and true men, there was but one course and that wm the course pursued by the party. the full ticKet put in the field by the meeting would be elected, but if it went down in defeat it would have the respect alike of M end ipd fori The meeting then adjourned amid .great enthusiasm. a"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "the attitude of Mr. <mark>Peers</mark> in this contest and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "the attitude of Mr. <mark>Peers</mark> in this contest and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1963.9, 1379.64, 2122.57, 1508.85], "bbox_id": "d162318cd1", "file": "AppomattoxNewspapers_1892-1898a_0292.pdf", "page": 1, "text": "Wm. A, White, the Smith Bros, and others, and known as the Jos. B. Coleman place, containing 3624 acres of land. This Isa very valuable place and has a good residence and outbuilding on It. Any Infor mation gladlr glvon by Commissioners. Terms of rale  One-third cash  balance at one and two years from day of rale, with ln- terest, bonds to be given by purchaser and title retained until full purchase moi paid conveyance directed by the Court. D. A. CHRISTIAN, H. D. FLOOD. Commissioners. The bond required by the decree in the suit of Colemans Administrators 4m., has been given by H. D. Flood Commissioner. Teste 8-26-7t. GBO. T. PEERS, Clerk,"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "Teste 8-26-7t. GBO. T. <mark>PEERS</mark>, Clerk,"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "Teste 8-26-7t. GBO. T. <mark>PEERS</mark>, Clerk,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.74, 205.09, 1000.52, 444.58], "bbox_id": "640bcc5a5d", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "Wm. A. Moses true bill. Ann Maria Wheeler  true bill. Alexander Christian  not a true bill. Will of Mrs. L. A. Owen admitted to record. A. H. Clement on motion allowed  to practice the law in this court.  F. W. McKinney qualified as con stable for Clover Hill district, with J. W. McKinney. C. II. Sackett, and Geo. T. Peers as suretiesbond  2,000 D. P. Ferguson, Overseer Poor m Clover Hill district, qualified, with w S. L. Ferguson as surety, bond 500. Fnris, O. W. Blanton, ir., W. _. W. II. Ligon, Supervisor for  Jackson, B. A. Wilson, W. A. W Clover Hill district, qualified with S. C. Stratton as surety, bond 1,000. S. C. Stratton, Supervisor for"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Sackett, and Geo. T. <mark>Peers</mark> as suretiesbond  2,000 D."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Sackett, and Geo. T. <mark>Peers</mark> as suretiesbond  2,000 D."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [443.33, 582.07, 762.75, 665.47], "bbox_id": "aadc9a47f6", "file": "AppomattoxNewspapers_1898-1902a_0667.pdf", "page": 1, "text": "Wil r ver bet 80 w eap I da-8 with her daughter, Mrs. A. H. again  choice of three route. Write I pi . for ratiand schedules, say to what j  tn,ent point yon re going and your nearest  Clerk Peers station ttjftbis line. See any Agent N.  W. Ry. or W. B. Belli 1 M. F. Bragg, Gen. P a A g t. Trav. Pass. Agt. m Roanoke, Va."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "and your nearest  Clerk <mark>Peers</mark> station ttjftbis line. See"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "and your nearest  Clerk <mark>Peers</mark> station ttjftbis line. See"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.14, 1624.72, 1851.01, 1660.32], "bbox_id": "6af7df1be1", "file": "AppomattoxNewspapers_1902-1905a_0139.pdf", "page": 1, "text": "who have beer created peers t-y Queen Victoria and King Edward for special services ren dered to the crown."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "who have beer created <mark>peers</mark> t-y Queen Victoria and King Edward for special services ren dered to the crown."}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "who have beer created <mark>peers</mark> t-y Queen Victoria and King Edward for special services ren dered to the crown."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.0, 419.83, 1895.4, 799.18], "bbox_id": "6d2a249141", "file": "AppomattoxNewspapers_1892-1898a_0094.pdf", "page": 1, "text": "what party yon belong. Come and we can assure a pleasant and enjoya ble day. It is an opportunity that no one should miss. If you are on the fence, yon may hear somethihg that may decide yon. Be sure to contribute promptly. The committee on edibles will take charge of whatever yon may feel dis posed to give. Let ns all unite in making this day a grand success. . On Saturday Sept. 23rd a mssa meeting was held at this place and after a very harmonious and pleasant discussion the following committees were appointed Committee on EdiblesT. A. Smith, chairman, W. A. Moses, S. P. Coleman, Mrs. J. R. Atwood, Miss Sallie Burke and Miss Kate OCon ner. Finance CommitteeJ. B. Taylor, chairman, J. H. Abbitt, R. F. Burke. Committee, of ArrangementsJ. R. Atwood, chairman, J. M. Miles, W. J. Trent, Miss Anna Jones, Miss Mary Statham, MiasLizzie David son, Mrs. J. W. Flood, Miss Fannie Johns and Miss Lonlie Peers. Committee on SpeakersW. J. Trent, chairman, R. C. Harvy and R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Johns and Miss Lonlie <mark>Peers</mark>. Committee on SpeakersW. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Johns and Miss Lonlie <mark>Peers</mark>. Committee on SpeakersW. J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.91, 377.54, 1712.51, 1276.23], "bbox_id": "664c51823f", "file": "AppomattoxNewspapers_1912-1915a_0497.pdf", "page": 1, "text": "What is the meaning ofall this? What are you after? Why art you raking up these bygones, which only make the .present condition, of affairs darker and more hopeless? Oliver Ostrander, under no circumstances and by means of no sophistries, can ever, marry the daughter of John S co- ville. I should think yon would see that for yourself. But if John, should be proved to have Buffered wrongfully? If he should be shown to have been innocent? His rebake was qnick, instant. With a force and earnestness which recalled tbe courtroom be replied Madam, your hopes and wishes 1 have misled you. Your husband was a guilty man as guilty a man as any judge ever passed sentence upon. But he swore the dáy 1 last vis ited him tat the prison, with his arms presse tight about mte and his eye looking straight into mine as you aré looking now, that he never struck that blow. I did not believe him then there were too many dark spots in my memory of old lies premeditated and destructive of my happiness but believed him later, and. 1 believe him now. - i Madam, this is quite unprofitable. A jury of his peers condemned him as guilty and the law compelled me to pass sentence upon him. The inev itable must be accepted. I have said my last word. - But not beard mine, she panted For me to acknowledge the inevitable where my daughters life and happi ness are concerned would make me seem a coward in my own eyes. Helped or unhelped, with the sympathy or without thé sympathy of one who hoped would show himself my friend, shall proceed with the task to which I have dedicated myself. You will forgive me, judge. You see that Johni  last declaration of innpcence goes fur ther with me than your belief, backed as it is by the full weight of the law. Gazing at her as at one gone, sud denly demented, he said I fail to understand you, Mrs.-- wil call you Mrs. Averill. You speak of a task. What task? The only one I have a heart for- the proving that Reuther is not the child of a willful murderer that an other man did the deed for which he suffered. I ean do it. I feel confident that 1 can do it and if you will not help me Help you! After what I have said and reiterated that he is guilty, guilty, guilty? Advancing upon her with each repè- tion of the word, he towered before her, an imposing, almost formidable figure. She fáced again His anger, which might well be righteous, . and with almost preternatural insight bold ly declared Yon are too vehement to quite con vince me. Judge Ostrander. Acknowl edge it or not, there is - more doubt than certainty in yonr mind  a doubt which ultimately will lead you to help me. Then my way should broaden a way, at the end of which I see a united couplemy daughter and your son. Oh, she is worthy of him, tbe woman broke forth, as he made an other repellent and imperative ges ture, ask anyone in the town where we have lived. Abruptly and without apology for his rudeness. Judge Ostrander turned his back, then with a quick whirl about which brought him face to face with her once more, he impetuously asked Madam, you were in my house this morning. You came in through the gate which Bela had left unlocked Vill you explain how you came to do"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "A jury of his <mark>peers</mark> condemned him as guilty"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "A jury of his <mark>peers</mark> condemned him as guilty"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1870.79, 1255.51, 2074.89, 1643.46], "bbox_id": "0db35c085f", "file": "AppomattoxNewspapers_1892-1898a_0050.pdf", "page": 1, "text": "Wert Letter. WERt, V a ., May 18.The con servative people feel gratified that the difference between Abbitt and Peers has been settled, and if the ar rangement is satisfactory to Messrs, Abbitt aud Peers I cant see how any of their friends can find fault and refuse to support the ticket. But you will always find a certain ele ment thats ever ready to damn you if you do and damn you if you dont. Its a personal matter between the two parties and their friends have no right to complain. Their honest friends and followers will as loyally support the ticket as if it were head ed by their favorite. There is an other element that would now like to bicker. That class was never sin cere in their profession and they wanted an excuse to withdraw their support nothing can be lost by it. Its best for a man to know his friends he is never long in finding his enemies. The attitude of some men in Appomattox looks strange. Men whose fealty to Democracy a few years hack dared to be question ed, now I am of Paul, I am of Apol- los and I of Cephas, but they were no more the image of real Democ- because racy than was the image which Neb"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "difference between Abbitt and <mark>Peers</mark> has been settled, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "difference between Abbitt and <mark>Peers</mark> has been settled, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1908.66, 440.86, 2069.56, 640.96], "bbox_id": "3a7d7b41e7", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "We are truly glad to see that there are now only two candidates for county -clerk in old Appomattox. Get to work, boys, and eleot Mr. Geo. T. Peers clerkone who has been tried who has a high standing as clerk knows his business well, and will do the work of the Office up to the scratch. This is the most im portant county office we haveit concerns everybodyand in endeav oring to eleot a man for this position we should try at this period to put a man in who has nothing to learn, but Simply to take hold and do the work as it should b e and if Mi. Geo. T. Peers cant do. it, who can ?"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "eleot Mr. Geo. T. <mark>Peers</mark> clerkone who has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "eleot Mr. Geo. T. <mark>Peers</mark> clerkone who has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1907.97, 420.23, 2072.51, 620.08], "bbox_id": "28d5dc6301", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "We are trnly glad to see that there are now only two candidates for county clerk in old Appomattox. Get to work, boys, and elect Mr. Geo. T. Peers clerkone who has been tried  who has a high standing as clerk knows his business, well, and will do the work of the office up to the scratch. This is the most im portant county office we haveit concerns everybodyand in endeav oring to eleot a man for this position we should try atr this period to put a man in who has nothing to learn, but simply to take hold and do the work as it should he and if Mr. Geo. T. Peers cant do it, who can P"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "elect Mr. Geo. T. <mark>Peers</mark> clerkone who has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "elect Mr. Geo. T. <mark>Peers</mark> clerkone who has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1972.81, 393.85, 2140.91, 969.04], "bbox_id": "7aec9677f1", "file": "AppomattoxNewspapers_1952-1954a_0497.pdf", "page": 1, "text": "was cute and would often ask him to say certain things before guests. Later they began teasing him about his speech. The first grade teacher said that she was unable to under stand him and recommended re peating the grade. The mother took Jackie to the family doctor who said that he would outgrow his speech difficulties and that there was no need to be alarm ed. But Jackie continued to be more shy and withdrawn, until at the time he entered the Clinic, he was talking very little with anyone. He participated little in class dis cussions although some of his writ ten work showed evidence of under standing. When Jackie arrived at the Clinic, he was taken to the playroom and told that he would probably find some books, toys, or games that he might enjoy. At first he looked casu ally at objects in the room, but later became interested in a phonetic chart with pictures representing the sounds of the alphabet. He asked the therapist about the chart and a pho netic game began. His interest in creased as the game continued and when the letter J  was sounded, he was asked to say his own name, to which he replied, Ackie. With some help he made the J  sound and used it in front of his name. He then turned to the therapist and said, Thats the fiist time I have ever said my real name. After that be became more animated and talk ed at length, stating that no one ever understood him or liked him at school. When he was told that he could learn to say words as other children, he appeared very pleased and asked to continue playing the sound game. When a psychological examination was administered, Jackie was found to have average ability. His first psychiatric interview revealed anxie ty, largely due to his feeling that he was not accepted by his peers. The Clinic team set to work to re educate Jackies family and to help the school understand some of Jackies problems. An effort was made to help the family sense the"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "not accepted by his <mark>peers</mark>. The Clinic team set"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "not accepted by his <mark>peers</mark>. The Clinic team set"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.89, 1039.81, 1656.63, 1733.23], "bbox_id": "3f7d380ad5", "file": "AppomattoxNewspapers_1902-1905a_0053.pdf", "page": 1, "text": "ward LeGrand,  Sr., died very suddenly of heart disease, at his home three miles oast of here. Mr, LeGrand, a few dys before, attempted to hew some rai road ties near his residence, and had the mis fortune to cut his knee very badly with the axe this, however, was net the cause if his death. It has been known for years that his heart wasseriously affected, and while his death was a great shook to . his relatives and friends, they have rather xpected that the end would come sud- lenly. His father and one of iiis brothers jassed away in the same mannerwith, mt a moments warningfrom heart disease. The deceased was 62 years of vge, and had spent his whole life in this his native county. He comes from one of the old Virginia families, and is tho last son of fifteen children horn unto Caroline Hunter and Archer Alex. Lc- ttvand. He connected himself with Lib erty Baptist church when quite a young man _ 45 years ago, and his walk in life has been upright and correct, full of Christian love for his neighbor and fel- lcwman. It is said there are only two other members of Liberty who have wor shipped with the church longer than the deceased,  ind they a-r Messrs. M. H. Golem an and T. H. A. Clieathain. Hu served the Confederacy with distinction to himself and fidelity to the cause. He was several times wounded, and was promoted to theoffice Lieutenant for bravery am.proticcn cy. He has held positions of honor and trust j since the war. the latest position that of Sup- I intcmlcut oi the County Aims House and farm, in all of these positions lii .1 character, shown out as a great power and influence for good. Thirty-six years ago he married Mi6S Sarah Ann Smithsister of T. A. Smith, of this place. As a result of this marriage six child rensurvive him, together with his widow as d II ows ! Mrs. IV. M. Hancock,of this piu.cvj  E. LeGrand, Jr., Evergreen Mrs. W. A. Keilv, Crewe L. B. LeGrand, Lynchburg, Ya. Mis. W. D. Mason, Pam pi in City, and Josiah LeGrand, who remainsst horn. lie. s also survived by live sister Mrs. C. V Hancock, Mrs. C. A. Abbitt, of this place Mrs. S. H. Kelly, of Crewe Mrs. W. H.Iiay- ick, of Washington, D. t, and Mrs. Kh-.h- d Bright, of Kansas City, Mo. His funeral was preached by his pastor, Dr. G. B. Taylor, to a large assemblage of sorrowing friends and relatives in a tender and consoling style, and the interment was had Tuesday evening at Liberty Cemetery in the presence of a large crowd of his old friends. The pall-bearers were J. R. Atwood, K. F. Burke, R. 8. Jenkins, H. W. McKinney, J. F. Dickerson, and Jennings Ferguson. George T. Peers, Jno. G. Fisher and Misses Vera Burke and Virgilia Atwood sang a very appropriate song. The sod never rested over a nobler charuc ter than Ned LeGrand. He w as our friend he was a friend to everybody. There is none to take his place."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Jennings Ferguson. George T. <mark>Peers</mark>, Jno. G. Fisher and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Jennings Ferguson. George T. <mark>Peers</mark>, Jno. G. Fisher and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [315.59, 507.79, 485.44, 1260.52], "bbox_id": "f72d84fa25", "file": "AppomattoxNewspapers_1915-1918a_0297.pdf", "page": 1, "text": "W ith th e help of m em ory naat review s th e past and w ith   b e h e ip o f hope be peers into a  fu tu re. Memory reproduces ffco pass w ith fu ln e ss a n d faith fu lly , w hile hope simply stirs hopes. The y ear jus closed brought a benediction to th is country, th is C om m onw ealth and this com m unity. U nder the bless ings of God and the adm inis tratio n of W oodrow ü tison we have been blessed w ith peace, prosperity and progress. As w e look back w e lam ent fa il ures an d follies, and this em  phasises th e fa c t th a t we are s o t creatu res of chance nor driven by blind destiny. W e have to do w ith the des tin y th a t shapes our e n d s God rules i s heaven and upon earth and y e t m an is a free agent, as m ysterious as it seems. The sn 1 i1 rl word of tongue or pen  is th a t it m ight h av e been m ight have been better, a vic tory ra th e r h a s failure a day of su n sh in e in the h eart, th o r clouds obscured th e heavens la Europe, blood has stained th e year and w ith us th e high cost of liv in g has m ade 1915 m ém orable. A nd, yet, w e are living and w ith g rit and w hat ever o f genius God has endow  ed us w e can m ake th e year now opening th e best of all years w e have lived and this, w hether in sunshine or storm , sickness o r health , w inning victories, or losing on every field of fight. V ictors a re not alw ays th e w orlds best bene facto rs and those m ost highly honored are no t alw ays e a rth s best helpers The m an who does his beet does wellhie best, rem em ber, and no t his second best his best of hand an d h eart, and n o t of hand on ly nor of h e a rt alone. Strike high, th en , for 1917, and while strik in g high you neednt lose your hatchet. Y ou m ay hitch your w agon to a star but well to rem em ber youll w alk th e earth , and not am ong th e stars G et th e best, give th e best an m ake th e w orld th e better for your liv in g in it. F or the readers, patrons an d friends of the Tim es-V irginian our w ish is for a happy, pros perous and peaceful new year."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "o f hope be <mark>peers</mark> into a  fu tu"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "o f hope be <mark>peers</mark> into a  fu tu"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [660.48, 359.55, 1161.28, 437.95], "bbox_id": "5a674ccd8d", "file": "AppomattoxNewspapers_1952-1954a_0170.pdf", "page": 1, "text": "W ILLIAMSBURG, Jan 14  A , peers wear when an English sove-jwhoch Queen Mother Elizabeth wore fashion preview of the coming coro-1 reign p crowned. The bowing will I  that time at her own coronation, nation and a first-hand report on j include the dress Britians Princess! The Antiques Forum, co-sponsored what happens when a nobleman opens Margaret wore in 1U37 at the coro- by Colonial Williamsburg and An his ancestral castle to the public are nation of the late King George Vltique magazine, is being hold her among the highlights of the 1953 anj the ermine and gold laden gown for the fifth consecutive year. Williamsburg Antiques Forum which opens here Monday."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "ILLIAMSBURG, Jan 14  A , <mark>peers</mark> wear when an English"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "ILLIAMSBURG, Jan 14  A , <mark>peers</mark> wear when an English"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1909.45, 1239.4, 2078.0, 1747.35], "bbox_id": "ce6c072b68", "file": "AppomattoxNewspapers_1892-1898a_0049.pdf", "page": 1, "text": "W ert Letter. W e r t , V a ., May 1 8. The con servative people feel gratified that the difference between Abbitt and Peers has been settled, and if the ar rangement is satisfactory to Messrs. Abbitt and Peers 1 cant see how any of their friends can find fault and refuse to support the ticket. But you will always find a certain ele ment thats ever ready to damn you if you do and damn you if you dout. Its a personal matter between the two parties and their friends have no right to complain. Their honest friends and followers will as loyally support the ticket as if it were head ed by their favorite. There is an other element that would now like to bicker. That class was never sin cere in their profession and they wanted an excuse to withdraw their support nothing can be lost by it. Its best for a man to know his friends he is never long in finding his enemies. The attitude of some men in Appomattox looks strange. Men whose fealty to Democracy a few years back dared to be question ed, now I am of Paul, I am of Apol- los and I of Cephas, but they were J no more the image of real Democ racy than was the image which Neb uchadnezzar set up in Babylon a likeness of the true God. All such are liable to the imputation of double dealing. Junius has wjjsaid The feather that adorns the bird sap- j ports his flight.  The T im e s , after an absence of j some weeks, put in its appearance j last Saturday, clothed in a new dress. j We now fully realize that Appomat-"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "difference between Abbitt and <mark>Peers</mark> has been settled, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "difference between Abbitt and <mark>Peers</mark> has been settled, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [994.29, 1301.16, 1153.87, 1377.37], "bbox_id": "4e4927c4c4", "file": "AppomattoxNewspapers_1902-1905a_0153.pdf", "page": 1, "text": "Vtn it,n  . -iv. _ _ u .ia u v n 11 , th lo UitlCXCQ that they do appear here within fifteen days alter due publication hereof, and do what may be necessary to protect their interest i this suit. And it is further ordered that copy hereof be published once four successive weeks in the Buckingham T i m e s , a newot,yer puo- nfkuLiw .1, tare cod til at a copy Be posted at the front door of the courthouse on the first day of the next term of the county court A copy. Teste GEO. T. PEERS. Clerk. H. C lem en t ,"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>. Clerk. H. C lem"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>. Clerk. H. C lem"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.55, 1466.18, 2443.35, 1517.6], "bbox_id": "a293bd3f70", "file": "AppomattoxNewspapers_1892-1898a_0146.pdf", "page": 1, "text": "vox. HI tnu cuwtinwuoo vuv.vw.,  holien for sold Court, on tba Arat MondW to May next to answer JorephJ.Bmito ofap l of trespass on toe case In umpsit. M K  600. and have then there tale writ, vvjraeee Geo. T, Peers, Clerk of our saW Court, at toe court-4ouse, the 85th day of April l884, and in tho 118th year of the ciesfc"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "writ, vvjraeee Geo. T, <mark>Peers</mark>, Clerk of our saW"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "writ, vvjraeee Geo. T, <mark>Peers</mark>, Clerk of our saW"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2296.53, 597.41, 2506.18, 1103.25], "bbox_id": "c191cfeeec", "file": "AppomattoxNewspapers_1952-1954a_0468.pdf", "page": 1, "text": "visited Work has started on the restora- n House tion of the Peers House at Old Ap- ealed at pomattox Court House, and several lal Park other National Park Service projects increase are well advanced either in actual over the process or in the advanced planning stage. bits and The Peers House was constructed ation of in 1856 and was the home of George an en- T. Peers, clerk of the county court national during the Civil War. The dwelling ox have has definite association with the his- iponsible tone peace made here in 1865. The d more exterior ef the dwelling will be re stored to its actual appearance as of ight be April 9, 1865. The interior of the saw im- dwelling will be converted into an the Ap- employees residence. Local work- omodate men, under Enos  Mclnturffff, are  courts being used on the project. It is esti- here has mated that the restoration will re-  in fa- quire five months for completion. Feeding H. A. Gurney, park superinten- jme im- dent, today estimated that work on restoration of the Tavern at the Old cal citi- Court House is 25 completed. Lo- ning to cal workmen are employed on this inducing project. Work has now reached the ho come stage of being ready for installation in over- a heating system. When finished, gateway pert of the Tavern will be used to nd near house the Park Museum, now in the office df the superintendent. Work is also in process on restor ation of the slave quarters at the rear of the Tavern. Modern rest rooms will be located in these quar ters. Plaqp for the proposed by-pass road which will relocate the high way around the Old Court House village, are in an advanced stage, and work on this may start soon. Mr. Gurney also announced that 6,000 has been made available to build a utility building jut east of the Peers House. This will be of masonry block, and will he used for storage and housing t uipment. and as a work shop. Plans fdr the building have been prepared."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "House tion of the <mark>Peers</mark> House at Old Ap-"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "House tion of the <mark>Peers</mark> House at Old Ap-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [876.22, 942.95, 1035.87, 1142.2], "bbox_id": "57b742e00e", "file": "AppomattoxNewspapers_1892-1898a_0264.pdf", "page": 1, "text": "VIRGINIAto wit In the Clerks Office of the Circuit Court of Appomattox County in vacation, October 22nd. 1836, Fannie B. Bigbie, Martha Walker John A. Bigbie, W. N . Bigbie, R, L. Bigbie, W. B. Bigbe, John D. Bigbie and Sallie Bigbie A gainst  In Chancery. Geo. C. Bigbie and the heirs of Martha Bigbi . who intermarried w ith one Edwin Bright the last named defendants being unknown, and made parties to this suit as unknown parties. The object of this suit is to partition the real estate of which W illiam Bigbie, Georgi Bigbie. Archy Bigbie, Nancy Bigbie and Salfit Bigbie, died, seized and possessed, situated in the County of Appomattox, among the par ties entitled thereto. And it appearing by affidavit filed that the heirs o f Martha Bigbie, who intermarried with Edwin Bright are unknown, it is order ed that they do. appear here w ithin fifteen days after due publication of this order and do whatever may be necessary to protect their interest in the premises and that a cop of this order be published once a week ror four successive weeks in the A ppomattox and B uckingham T imes , a newspaper pub- lishee in this State. 43-4t A CopyTeste, GEO. T. D. CHRISTIAN, p. q. T. PEERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "CHRISTIAN, p. q. T. <mark>PEERS</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "CHRISTIAN, p. q. T. <mark>PEERS</mark>, Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1436.4, 583.52, 1986.7, 752.32], "bbox_id": "eee27fe572", "file": "AppomattoxNewspapers_1908-1909a_0193.pdf", "page": 1, "text": "var I e t ? London.The Idea which Is preva lent among many people that the house of lords la the usual type of legislative body made up of leisurely gentlemen o f title has been dissipated by Prof. Harold Laski Ja a recent dls- cusslon o f the proposed reform of that body. Few people are aware, for example, that 8 peers seat in the honse of lords can no mòra be taken from him, than w his name, regardless of how little attention he mag give lb As a, result it is ..revealed that, 412 mem- bem of the bouse have never spoken in debate. Indeed, the average attend ance since 1918 has been 66, and only on six occasions since then bav more"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "for example, that 8 <mark>peers</mark> seat in the honse"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "for example, that 8 <mark>peers</mark> seat in the honse"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [844.75, 860.47, 1001.8, 1048.47], "bbox_id": "84dd031390", "file": "AppomattoxNewspapers_1892-1898a_0262.pdf", "page": 1, "text": "V IRG IN IA to w it In the Clerks OiHce of the Circuit C ourt of A ppom attox County in vacation, October 22nd, 1895, Fannie B. Bigbie, M artha W alker John A. Bigbie, W. N. Bigbie, It, S. Bigbie. W. B. Bigbie, John D. Bigbie and .Sarah Bigbie A gainst Geo. C. Bigbie and the heirs of M artha Bigbie who interm arried w ith one Edwin Bright th e last named defendants befog unknown, and made parties to this suit as unknown parties. The object of this suit is to partitioni-he real estate of which W illiam Bigbie, George Bigbie. A rchy Bigbie, Nancy Bigbie and Sallie Bigbie, died, seized and possessed, situated in th e County of Appom attox, among the par ties entitled thereto. And it appearing by affidavit filed th a t the heirs of M artha Bigbie, who interm arried w ith Edwin Bright are unknown, it is order ed th a t they do appear here w ithin fifteen days a fte r due publication of this order and do w hatever m ay be necessary to protect th eir interest in th e prem ises and th at a copy of this order be p u b lish ed once a week for fo u r successive weeks in the A ppomattox and  B uckingham T im es , a new spaper pub- lishec in this State. A CopyTeste, 43-4t GEO. T. PEERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "CopyTeste, 43-4t GEO. T. <mark>PEERS</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "CopyTeste, 43-4t GEO. T. <mark>PEERS</mark>, Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [87.59, 1168.39, 242.39, 1389.23], "bbox_id": "b3d95a1178", "file": "AppomattoxNewspapers_1898-1902a_0543.pdf", "page": 1, "text": "V IRG IN IA AT RCLES HELD IN THB I Clerks office of the Circuit Court of Ap pomattox. beginning- on the third Monday in July. 1901 Mary E. England, Matthew W. Brown, and Cary T. Brown ................................. Plaintiffs, against Clementine Wrinkle, late widow of James Brown, deceased the widow and heirs of y m. Brown, deoeased names unknown the widow and heirs of Charles Brown, de ceased names unknown Anna Bamsep, Alice Schroder, and Ann B. Davis, Defenta, I n C hanckky . The object of this suit is to obtain a decree for the sale of certain real estate situated in the county of Appomattox, being the estate in which Samuel A. Brown, deceased was in terested, and a distribution of the proceeds of said saje among the parties entitled there to. And it appearing by affidavit made that the defendants Clementine Wrinkle and the widow and heirs of William Brown, deceased, and of Charles Brown, deceased. are not resi dents of this State, and that the names of the said widows and heirs are unknown, it is or dered that they do appear here within Ufteen days after due publication of this order once a week for four successive weeks in ihe Ap pomattox and Buckingham Times, a news paper published in this State, aad do what ever may be necessary to protect their .nter- ests in this suit. A copy. Teste GKO. T. PEERS, Clerk. F lood A F ikocson , p. q. 7-31-4t"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GKO. T. <mark>PEERS</mark>, Clerk. F lood A"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GKO. T. <mark>PEERS</mark>, Clerk. F lood A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2299.16, 342.54, 2468.71, 555.83], "bbox_id": "136d706f23", "file": "AppomattoxNewspapers_1952-1954a_0011.pdf", "page": 1, "text": "urday 830 to 430. Sunday from 930 to 530. The contract for repainting four buildings at the Old Court House has been awarded to G. L. Doss. The buildings are Plunkett-Meeks House, Peers House, Wright House, and tlv Jones Law Office. On June 5, a group of 24 from the Marvin Bass School in Lynch burg visited the McLean House. The teacher in charge was Miss Sidna Chockey. . On June 5, a group of 25 from the Canaan Negro School in Appo mattox County visited the grounds. Josephine C. Webb was in charge. June 6, Mrs. K. C. Gregory brought a group of 45 from the first grade of A. H. S. down for a picnic and sight-seeing tour."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "buildings are Plunkett-Meeks House, <mark>Peers</mark> House, Wright House, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "buildings are Plunkett-Meeks House, <mark>Peers</mark> House, Wright House, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.77, 1473.49, 1779.33, 1774.48], "bbox_id": "1fd7cfd8c0", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "uents. One of these stops was at the Court House. During he year 1851 or 1852, the Atlantic, Mississippi  Ohio Railroad vas constructed through the County. The first passenger train roing through to Roanoke was in November, 1852. This, of ourse, was a great boon to the transportation and development lf the County. At that time the engines were fired with wood cut, hauled and stacked along the track. I The New Constitution above referred to, provided for the election of officers by a vote of the people, rather than by ap- Pointment, and in May of that year the first election was held.  1 I860 Geo. T. Peers became the County Clerk, Wilson BHix, Sheriff, Samuel J. Walker Commissioner of the Revenue, l and L. D. Isbell, Commonwealth Attorney. It was a time marked by great national issues and fateful  visions. Two conceptions of Government were clashing, one, the South adhered to States Rights, and followed the poli-  ical philosophy of Thomas Jefferson the otherthe North,  avored Centralized Government, and adopted the principles  f Government of Alexander Hamilton. Questions of Slavery  States Rights were major topics. Excitement reached a cli-  uiax in the Presidential election of 1860, when Abraham Lin-  Coln Was elected President.  ttc, APPmattox County sent Lewis D. Isbell, an announced"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "1 I860 Geo. T. <mark>Peers</mark> became the County Clerk,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "1 I860 Geo. T. <mark>Peers</mark> became the County Clerk,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1159.45, 228.31, 1985.45, 799.58], "bbox_id": "f7ad47093b", "file": "AppomattoxNewspapers_1971-1973a_0195.pdf", "page": 1, "text": "Two new directors were el ected Thursday, Jan. 20 at the annual members meeting of Co- operativeBuilding and Loan As sociation, Lynchburg. Members of the Appomattox Chapter, United Daughter of the Confederacy, meeting Thursday evening at Maudes for their annual dinner honoring Confed erate heroes Lee, Jackson and Maury, expressed disappoint ment that the scheduled speak er could not appear, but they were rewarded, otherwise, in the substitute speakers who presented historical papers and facts of interest. Mr. Jerry A. Burke, Appo mattox businessman and retired superintendent of Appomattox schools, found that he could not be present. Three chapter members volunteered to be a part of the evening  Mrs. Rachel F. Lawson, who read an account of Surrender at Appo mattox on April 9, 1865 M rs. Lucille Ferrell, who read an account concerning R . E. Lees mother and Mrs. Wiley Morris, who dipped even further back into history to read the will of General George Washingtons mother. Mrs. Clifford Plunkett, re gistrar for the Va. Division, was in charge of registration of members and guests for the ev ening affair. Mrs. Lawsons paper was a copy of a personal interview she held with Martha Mildred Ste vens Craig, an interview which was printed about 31 years ago. In the account Martha Mildred  Aunt Millie , told of her en counters with Union troops in the old village of Appomattox on April 9, 1865. She was nurse maid to Charles Sackett Peers at the time. Little Charles father, George Peers, was clerk of court. The faithful nursemaid hid herself and the child until the shooting ceased in the village."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "maid to Charles Sackett <mark>Peers</mark> at the time. Little"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "maid to Charles Sackett <mark>Peers</mark> at the time. Little"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1625.74, 1212.12, 1785.69, 1450.52], "bbox_id": "88b0a44227", "file": "AppomattoxNewspapers_1892-1898a_0147.pdf", "page": 1, "text": "Trio Found Guilty The three leaders of the Common weal. Gen. Jacob Seiche Coxey, Marshal Browne and Christopher Columbus Jones, have been found guilty of violating the laws by a jury of their peers, and will have to submit to a sentence hereafter to be imposed by the court for their recent demonstra tionon the Capitol ground. All three were convicted on the first count of the indictment, which charged them with displaying in the Capitol grounds the banner of Coxeys Good Roads Association. Jones, of Philadelphia, was acquitted of the second count, which accused him of treading on the grass, bntCoxey and Browne were convicted."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "a jury of their <mark>peers</mark>, and will have to"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "a jury of their <mark>peers</mark>, and will have to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [234.0, 494.61, 898.36, 795.0], "bbox_id": "62c1e9fdd5", "file": "AppomattoxNewspapers_1892-1898a_0251.pdf", "page": 1, "text": "tradc mu manufactures is very peers saw him and at once demand- drel and is in hell to day. marked and i he evidences of return ed the restoration of the part remov- Some of you say that these young ing prosperity are so numerous and ed The gentleman stands so high men who pass among you as teac - convincing that the croaker has as a man of honor in his profession ers of Mormanism are sincere. Tha ceased 10 croak. It is indeed satis- that we cannot account for such may be true. So are many o t e factory to know that since April condnet except upon the ground of Mahomedans. So are many t  . . . 300 manufacturing establishments temporary insanity. As an experi- Budhists. So are many image-wor-1 the above question. Here! have increased the wages of their eDCed and learned lawyer, he, if shippers in Africa. So are t .. are some of the answers received.I employes which number 500,000 sane, must have understood the mothers who to day throw their chil-jTijey are highly significant j workmen, and as a result there is gravity of his act It is certain that dren in the Ganges but their being j fcE are n0 happier when rich! less of disquiet and dissatisfaction the record was mutilated and our honest does not entitle them to come I poor. How can they be? Do I among workmen than for any time County Judge is not the man to pass into my home and sow in the hearts l Qn think some great millionaire isl in the last ten years.  such a matter over without making of my family erroneous teachl8, any happier driving some famous! Iron being the barometer of trade the fullest investigation. I as much believe a Mormau e er I trotter who enjoys a national reputa-1 in this country, when it is prosper- We have honored this gentleman to be an emissary of the Devil  1 tion and has cost his owner several! ous other brauches of industry arc and sincerely trust that investiga-1 believe Judas Iscariot to have been j thousand dollars than a 15 a week generally in good condition. tion will acquit him of any improp- j his emissary. If they come to clerk hiring a livery stable horse and I Following is the record for only er intent. door, meet them as understand a driviugf out with his best girl? Not a single week of the advance in Onr readers shall be kept fully Baptist Preacher of this county met I por 150 a poor man can wages in 1ennsylvunia, as given by informed as to this matter and full them. Meet them and tell them that I n a horge thatwill give him just the Philadelphia Times, of the 24th justice done all parties. they can get something to eat an a Jg much pleasure as a 40,000 Maud i,gt.  ___________________ -  I place to sleep, but that they are the j g There you have the whole thing Puddling rates at Pottstown were Ayers Pills promote the natural enemies of your God andyonr moth- jin  nntghell R ussel a . A lger . advanced 35 cents per ton, to take motion of the bowels, without which I ers Bible and that they cannot open effect Jnlv 8 the Lackawanna Iron there can be no regular, healthy  their mouths as teachers. Si eel Company, at Scranton, operators. For the cure of bilious-"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "mu manufactures is very <mark>peers</mark> saw him and at"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "mu manufactures is very <mark>peers</mark> saw him and at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [983.75, 563.28, 1148.5, 631.28], "bbox_id": "e39d5ceba1", "file": "AppomattoxNewspapers_1898-1902a_0242.pdf", "page": 1, "text": "Total .................................................. 7,550.00 LUDNTY LEVY FOR 1899-1900. On tit halite persons, each...................... o n each 100 worth of land, propety, railroad, and telegraph value For county purposes............................. J For road purposes.................................. ! For schools, county and district.. .1 Teste GKO. T. PEERS, Clerk of itoard of Supervisors."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "1 Teste GKO. T. <mark>PEERS</mark>, Clerk of itoard of"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "1 Teste GKO. T. <mark>PEERS</mark>, Clerk of itoard of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2136.96, 1085.15, 2262.85, 1122.7], "bbox_id": "95eb35aa8f", "file": "AppomattoxNewspapers_1892-1898a_0178.pdf", "page": 1, "text": "Total ....................................... 5.688. Teste GEO. T. PEERS, Clerk Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "Total ....................................... 5.688. Teste GEO. T. <mark>PEERS</mark>, Clerk Board of Supervisors."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "Total ....................................... 5.688. Teste GEO. T. <mark>PEERS</mark>, Clerk Board of Supervisors."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2259.36, 1785.46, 2399.21, 1812.2], "bbox_id": "38beb3f055", "file": "AppomattoxNewspapers_1892-1898a_0073.pdf", "page": 1, "text": "Total....................... . ................... 8,368.00 TesteGB. T. PEERS, Clerk Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "Total....................... . ................... 8,368.00 TesteGB. T. <mark>PEERS</mark>, Clerk Board of Supervisors."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "Total....................... . ................... 8,368.00 TesteGB. T. <mark>PEERS</mark>, Clerk Board of Supervisors."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1359.6, 443.45, 1502.3, 465.95], "bbox_id": "7ce888ea5c", "file": "AppomattoxNewspapers_1922-1923a_0284.pdf", "page": 1, "text": "tor. G. T. Peers took in the f i  ssion to Richmond Saturday."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "tor. G. T. <mark>Peers</mark> took in the f i  ssion to Richmond Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "tor. G. T. <mark>Peers</mark> took in the f i  ssion to Richmond Saturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1381.16, 904.39, 1617.29, 1062.94], "bbox_id": "9e6b402e1a", "file": "AppomattoxNewspapers_1962-1965a_0403.pdf", "page": 1, "text": "too. The manager s of his fine three show. After dinner ok me along to visit lends, Mrs. Gertrude y and Chloe in their !e, met Chloes hus- Blair and their fine y, who was trilled ng a swanky sports high school gradua- have a wonderful Service, Almond worked first on urtng Civil War books I the Peers House, and in 1957, a hebby of collecting j and while helping with the exca vation of the site of the old kitchen once attached to Clover Hill Tavern, he found an 1853"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "War books I the <mark>Peers</mark> House, and in 1957,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "War books I the <mark>Peers</mark> House, and in 1957,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1222.74, 552.37, 1389.51, 987.66], "bbox_id": "04c4a00c59", "file": "AppomattoxNewspapers_1947-1949a_0193.pdf", "page": 1, "text": "TOKYO.  Returning to Japan for her second year tutoring Crown Prince Akihito, Mrs. Elizabeth Gray Vining thinks very highly of her pu pil. She considers him a very prom ising boy, intelligent, reasonable, friendly and honest. Mrs. Vining says she feels the prince will acquire a closer sympathy foy west ern democracy as he learns Eng lish. Mrs. Vining thinks her new post is the grandest thing that ever hap pened to me. She receives a salary equivalent to about 2,000 a year, is provided with a western style home, an auto mobile, both American army and native food, and in addition, she has a secretary. Besides tutoring the prince three hours a week, she gives English lessons to the princes mother, to his younger brother and three sis ters, and instructs at the peers and peeresses schools. More than 130 Japanese children are receiving instruction from her. Mrs. Vining believes that the firm and wise education policies of the occupation may lead Japa nese children to a more liberal and democratic education than they ever have known. She said that the years of com pulsory education have been in creased from six to nine and that new textbooks have replaced many older ones, all approved by General MacArthurs headquarters. And, says Mrs. Vining, teaching the Japanese has been fun  they are eager, friendly and intelligent. There has been no self pity, and all-in-all the Nippons have been a cheerful lot."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "and instructs at the <mark>peers</mark> and peeresses schools. More"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "and instructs at the <mark>peers</mark> and peeresses schools. More"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [830.15, 410.77, 998.25, 1283.51], "bbox_id": "924d1082b1", "file": "AppomattoxNewspapers_1912-1915a_0407.pdf", "page": 1, "text": "Tokio.Japan sent an ultimatumto  Germany demanding the withdrawal of German warships from the Orient and the evacuation of Kiaucbau and giving Germany until Sunday, August 23, to comply with the demand. Otherwise, the ultimatum states, Japan will take action. The general expectation here is that the ultimatum will be followed by war. Takaaki Kato, the Japanese Foreign Minister, simultaneously with the dis patch of the ultimatum, conferred with George W. Guthrie, the American Am bassador, and made to him a broad statement calculated to assure te United States that American interests in the Far East would be safeguarded and the integrity of China upheld. Count Okuma, the Japanese Premier, Sunday invited the peers, the newspaper men and the leading busi ness men of Tokio to come to his office at noon, at 4 and at 6 oclock in tjhe afternoon, respectively, when he made known to them the terms of the ultimatum and announced that he would give out the negotiations in con nection with the alliance. Ultimatum Given. The ultimatum follows  We consider it highly Important and necessary in the present situa tion to take measures to remove the causes of all disturbances of the peace In the Far East and o safeguard the general interests as contemplated by the agreement .of alliance between Japan aid Great Britain.   In orderto Secure a firm and en during peace in Eastern , Asia, the establishment of which is the aim of the said agreement, tttolmperial Jap anese Government sinedrefy-believes it to be its duty to give the advice to the Imperial German Government to carry out the following two propositions FirstTo withdraw immediately from- Japanese -and Chinese Waters German men-of-war and armed vessels of all kinds and to disarm at . once those which cannot be so withdrawn.   SecondTo deliveron a date not later than September 15 to the. Im perial Japanese authorities without condition or compensation the entire leased territory of Kiachau with a view to the eventual restoration of the same to China. The Imperial Japanese Government announces at. the same time that in the event of it not receiving by noon on August 23, 1914, an answer from the Imperial German Government signifying its unconditional accept ance of-the above advice offered by the . Imperial Japanese Government Japan will be compelled to take such action as she may deem necessary to meet the situation. Urged On By Great Britain. Inspired utterances express regret at the inability to maintain neutrality, but say that Great Britain,, the ally of Japan, Is compelled to defend herself against the aggressions of Germany. Moreover, it Is pointed out that Ger many is making preparations day and night at Kiauchau, where it is storing provisions, while its warships are scouring the seas of Eastern Asia, to the great detriment of commerce, and that its converted cruisers are seizing English merchant vessels. Such actions, It is argued, are direct ly calculated to disturb the peace of Eastern Asia, and accordingly, after full and frank communication with Great Britain, Japan has found her self compelled to send an ultimatum to Germany."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "Premier, Sunday invited the <mark>peers</mark>, the newspaper men and"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "Premier, Sunday invited the <mark>peers</mark>, the newspaper men and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1767.84, 1659.76, 1929.52, 1731.41], "bbox_id": "542780a7bd", "file": "AppomattoxNewspapers_1905-1912a_0056.pdf", "page": 1, "text": "to Newsy Gleanings. British peers were announced speak at 116 meetings. Mayor Gonzales, of Hoboken N. J made his first Sunday in office  blue. Zelaya offered Mexico a plan to an nex all the Central American repub lics to that Government."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "to Newsy Gleanings. British <mark>peers</mark> were announced speak at"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "to Newsy Gleanings. British <mark>peers</mark> were announced speak at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1106.4, 1780.51, 1264.65, 1983.59], "bbox_id": "0063565dff", "file": "AppomattoxNewspapers_1898-1902a_0161.pdf", "page": 1, "text": "TN VACATION OF THE CIRCUIT COURT 1 of Appomattox county, February 22d, 1899. The District School Board of Stonewall D is trict of Appomattox county ............ Plaintiff, against _ _ Samuel Jones, Alexander Jones, Wm. E- Jones, the last named a convict In the Pen itentiary o f Virginia and 8. P. Coleman. Sheriff, and Committee of said Wm, E Jones, John Jones, Ellen W est. Albert Jones, Mary F. Jones, widow, and other heirs of Alfred Jones, decd..... Defendants. The object of this suic is to secure a con veyance of real estate sold by Alfred Jones, to the pi .intiff and which was paid for by the plaintiff in the life time of said Alfred Jones. And it appearing by affidavit that the de fendant w m . K. Jones is a convict In the Penitentiary o f Virginia, and that the defen dants John Jones, Ellen W est and Albert Jones are not residents o f this State, and that the residence  f Frederick Jones is unknown. It is ordered that they do appear here withm fifteen days after due publication i f this or der once a week for four successive weeks the Appomattox and Buckingham T imes , newspaper published in tbis State, and do whatever is neoetsarj to protect tbeir Inter est is this suit. A copyTeste  GEO. T. PEERS, Clerk. H. D. F ivood , l _ - 8, L. F erguson , f p  2-23-4w"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "A copyTeste  GEO. T. <mark>PEERS</mark>, Clerk. H. D. F"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "A copyTeste  GEO. T. <mark>PEERS</mark>, Clerk. H. D. F"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1105.22, 1570.51, 1262.24, 1772.39], "bbox_id": "c1bf0d4a99", "file": "AppomattoxNewspapers_1898-1902a_0161.pdf", "page": 1, "text": "TN VACATION OF THE CIRCUI t COURT 1 of Appomattox county, February 22d, 1899. S. B. Stephens ........................................ Plaintiff, against n , Samuel Jones, Alexander Jones,  m. E. Jones the last named a convict in the Penitenti ary of Virginia, and s. P. Colemau, Sheriff and Committee of said Wm. K. Jones, John Jones, Ellen West. Albert Jones, Mary F. Jones, widow, and oiher heirs of Alfred Jones, decd .. ............................. Defendants. The object of this suit is to secure a eon veyance of real estate sold by Alfred Jones to the plaintiff aud which was paid for by the plaintiff in the life tim e of the suid Alfred Jones. And it appearing by affidavit that the de fendant, wm- E. Jones, is a convict in the Penitentiary of Virginiaand that th i defend ants John Jones, Ellen West, and Albert Jones, are not residence of this State, and that the residence of Frederick Jones is unknown, it is ordered that they do appear here within fifteen days after due publication of this or der once a week for four successive weeks in the Appomattex and Buckingnam T imes , a newspaper published in this State, and do whatever la necessary to protect their inter est in this suit. A copyTeste GEO. T. PEERS, Clerk. H .D .F lood , i _  . L. F erguson , f v H"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "A copyTeste GEO. T. <mark>PEERS</mark>, Clerk. H .D .F"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "A copyTeste GEO. T. <mark>PEERS</mark>, Clerk. H .D .F"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [516.5, 1066.51, 681.61, 1322.0], "bbox_id": "2b91d44588", "file": "AppomattoxNewspapers_1892-1898a_0155.pdf", "page": 1, "text": "Tn the Clerks office of the Circuit Court of 1 Appomattox County in vacation, April 25th 1891. ,   The Commonwealth of Virginia, to the Sheriff of the County of Appomattox, Greet ing We comma nil you to summon The Ap pomattox Surrender House and National War Museum Co., to appear at the clerks office of our Circuit Court of the County of Appomat tox, at the court-house thereof, at Rules to be holden for said Court, on tho first Monday in May next to answer Joseph J. Smit.n of a plea  of trespass on the case in assumpsit. Damage 500, and have then there this writ. Witness Geo. T, Peers, Clerk of our said Court, at the court-house, the 25th day of April 1894, and in the 118th year of the Commonwealth. Geo, T. P eeks , Clerk. The object of this suit is to recover of the defendant the sum of 30o.vith interest there on from the loth day of April 1894, and to at tach the estate of the said defendant in this state and subject the same to the payment of said debt, and it appearing by an affidavit made and filed that the defendant is a foreign cor poration, and not a resident of this State that there is no person in said county designated by law as representative of said corporation, nor is there any agent of said defendant in said county, nor any other person in said county on whom there can be service of process, it is or dered that a copy of the process in this case be published once a week for four successive jeksinTiiEArpoMATTOx and B uckingham x MES, a newspaper printed in this State, and posted at the front door of the court L iiise of said county. A Copy of Process and order. Test H. S ackett , p . q. G eo . T. P eeks , Clerk."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "writ. Witness Geo. T, <mark>Peers</mark>, Clerk of our said"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "writ. Witness Geo. T, <mark>Peers</mark>, Clerk of our said"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2283.11, 1042.45, 2448.7, 1275.38], "bbox_id": "f196360b56", "file": "AppomattoxNewspapers_1892-1898a_0148.pdf", "page": 1, "text": "Tn the Clerks office of the Circuit Court of  JL Appomattox County in vacation, April Sth 1804.The Commonwealth of Virginia, to the Sheriff of the County of Appomattox. Greet log We command you to summon rheAp- K mattox Surrender House and National war usoum Co to appear at tbe olerks office of our Circuit Court of the County of AppOBat- tox, at tbe court-house thereof, at Rules to be bolaen for said Court, on tbe first Monday in May next to answer Joseph J. Smith of ajle of trespass on the case In assumpsit. M m m 600, and have then there this writ. Witness Geo. T. Peers, Clerk of our said Court, at the court-house, the 26th day of April 1884, aud tn the 118th year of the Commonwealth. Goo, T. P nas, Clerk, Tbe object of this suit Is to reoover of the defendant the sum of 865,with interest there on from the 16th day of April INL and, to at tach the estate of the said defendant In tUa state and subject tbe same to the payment of said debt, and it appearing by an affidavit mode and filed that the defendant Is a foreign cor poration, and not a resident of this State that there is no person In said county designated by law as representative of said corporation, nor is there any agent of said defendant in said county, nor any other person In said county on whom there son bo service of prooess, it is or dered thatacopyof the process In this onse be published once a week for four successive weekslnTHiAppouATTOx and B uckingham T imes , a newspaper printed In this State, and posted at the front door of the court house of said county. A Copy of Process and order, Test"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "writ. Witness Geo. T. <mark>Peers</mark>, Clerk of our said"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "writ. Witness Geo. T. <mark>Peers</mark>, Clerk of our said"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1273.94, 989.08, 1431.77, 1190.98], "bbox_id": "576c39fc63", "file": "AppomattoxNewspapers_1898-1902a_0238.pdf", "page": 1, "text": "TN THE CLERKS OFFICE OF THE CII 1 CUIT COURT OF THE COUNTY OF AI POMATTOX, on th 22d .ay of August, 189. Alexandria Jones, ................................ Piaintii against Samuel Jones, Mary E. Beasley and Waite H. Beasley, her husban l  William E. Join the last-named a convict in the penitet tiary of Virginia 8. P. Coleman, sherii and committee of said Win. K. Jones .oh Jones, Frederick Jones, Albert Jones, an ether heirs of Alfred Jones, deceased, ........................................................Defend.i lit. The object of this suit is to secure a cot. eyance of real estate sold by Allred J me to the plaintiff, and which was paid A-b. the plaintiff lo thesaid Alfred Jones in hi lifetime- And an affidavit having been made aud lilt that the defendant Fr derick Jones s rts deuce is unknown, aud ihut John Jones an Albert Jones are not residents of the biat of Virginia, it is or iered that tiiey do uppea here within iifteen days altei due public, tion hereof, and do what may be necessar. to protect their interest in this suit. And j is tu rtf er ordered that a copy hereof be pul- lished once a week lor four successive week n th e Appomattox,and Buckingham T ime  and that a copy beposted at the front doo of tl.e courthouse of thiscouuty on the kr.- iiay of the next term of the county court.- A copy. Teste GEO. T, PEERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T, <mark>PEERS</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T, <mark>PEERS</mark>, Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1275.61, 834.13, 1429.99, 981.93], "bbox_id": "bcc0fed13f", "file": "AppomattoxNewspapers_1898-1902a_0238.pdf", "page": 1, "text": "TN THE CLERKS OFFICE OF THE CI li 1 CUIT COURT oF THE COUNTY OF A1 POM A TT- X, oil the 22d day of August, IfeU BerLice Colly ........ ..................................Piaintii against C. C. Colly,.. ..................................... Defendant The object ol this suit is to secure a dec re for alimony and other allowances against tl defendant in fuvol of the. plain nil. And an altid. vit having tieen made and ilk that the defendant. C. C. Jolly, is not a res dent of the State of Virginia, it is orden that he do appear here within titteeu da after due publication here f, and do win- may be necessary to protect his int rest i this suit. And it is further ordered that copy hereof be published once a ek 1 four successive weeks in the Appoiuutto and Buckingham T im e s , auu that a copy f posted at the front door of the courthouse t this county on the first day ol the next ten oi the county court.A copy. Teste GEO. T. PEERS, Clerk. H. D. F lood , p. q. b-244t."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>, Clerk. H. D. F"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>, Clerk. H. D. F"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [782.66, 1337.08, 941.99, 1524.12], "bbox_id": "62808b6fb7", "file": "AppomattoxNewspapers_1898-1902a_0642.pdf", "page": 1, "text": "TN THE CLERKS OFFICE OF APPOMAT- 1 TOX CIRCUIT COURT, February 7, 1902 ft. W. Fleshman ................................ Plaintiff, against It. L. Marshall.............................Defendant A ction of T respass on the C ase in A s  sum psit and on A ttachment  D amages , 400.00. The object of this suit Is to recover of the defendant, li. L, Marshall, the sum of 360.00, due to the p aintiff, It. W, Fleshman, for the board of the defendants wife and two child ren from the 1st of January, 1900, to the 1st of January, 1902, s.nd to attach the effects of the said defendant in the hands of J. T, Moses, trustee. And affidavit having been made that the said claim is just aud uupaid. and that the plaintiff is entitled to, and ought to recover, the same, and that said li, L. Marshall is h non-resident of this State, It is ordered that he do api-ear here within fifteen days after due publication of this order once a week for four consecutive weeks in the Appomattox and Buckingham Times, a newspaper pub lished in this State, and do whatever may be necessary to protect his interests iu the pre mises.A copy. Teste GEORGE T. PEERS, Clerk. J. P. L, F leshman , p. q. 2-12-4t"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GEORGE T. <mark>PEERS</mark>, Clerk. J. P. L,"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GEORGE T. <mark>PEERS</mark>, Clerk. J. P. L,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1070.15, 772.83, 1225.14, 945.96], "bbox_id": "c29701c789", "file": "AppomattoxNewspapers_1898-1902a_0694.pdf", "page": 1, "text": "TN THE CIRCUIT COURT of Appomattox 1 Couot.y. in vacation, May 26, 1902 A. H. Clement, .................................... Plaintiff, against Lettenia Carjon, Edna Carson, J. M. Abbott, Rachel M. Abbott, and the unknown child ren of said Rachel M. Abbott, Defendants I n C hancery . The object of this suit is to set aside a deed of conveyance to 5 acres of land in Appo mattox county, executed by J. M. Abbott to Rachel M. Abbott and her unnamed children on tha 18th day of April, 1901, and to subject the same to ihe lien of a judgment of the plaintiff against the said J. M. Abbott. And it appearing by affidavit that the child ren of the said Rachel M. Abbott and their residences are unknown, and that the defend ant Lettenia Carson is not a resident of this State, it is ordered that they do appear here within fifteen days after due publication of this ordei once a week for rour successive weeks iu the Appomattox and buckinghum Times, a newspaper published in this State, and do whatever may be necessary to protect their interests in the premises. A copy. Teste GEO. T. PEERS, Clerk. J. P. L. F lush man , p. q. 5 28 4t"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>, Clerk. J. P. L."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "copy. Teste GEO. T. <mark>PEERS</mark>, Clerk. J. P. L."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.84, 991.68, 1876.49, 1322.05], "bbox_id": "3b53681e83", "file": "TimesVirginian_1980a_0333.pdf", "page": 1, "text": "tive director .of the Central Virginia Commission on Aging, the state government is currently focusing its efforts on improving provisions for jong-term care of the- elderly in . Virginia. Clair says Governor Dalton has appointed a committee composed of representatives of the Department of Public Health, the Department of Mental Health, the Department of Health and Welfare, and the Virginia Office on Aging, to draw up legislation aimed at defining a structure for elderly care in the coming vears. House Joint Resolution 162. the bill which will advocate and delineate programs for long-term care of the elderly, is currently on the boards and is expected to be submitted for subcommittee review by Dec. 1, before the state legislature comes into session in January.. HJR 162 is primarily concerned with getting people to take eare of with getting people To take care of the ir peers, establishing long-term home- in elderly citizens homes and in Guy Farley"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "care of the ir <mark>peers</mark>, establishing long-term home- in"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "care of the ir <mark>peers</mark>, establishing long-term home- in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [863.75, 1603.65, 1021.01, 1739.6], "bbox_id": "f0bb702b18", "file": "AppomattoxNewspapers_1933-1936a_0211.pdf", "page": 1, "text": "times, he was exceedingly irate and wanted to call off the whole affair. Tills could not be done, but the cele bration will be nothing like what the cabinet committee had Intended. i he king has forbidden garter king at arms, the duke of Norfolk, and oth er high officers of state of the cere monial department to have anything to do with the jubilee. He ha 3 refused to have the peers of the realm in their robes for the. presentation of addresses from the houses of parliament. He has refused to robe himself for the oc casion."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "refused to have the <mark>peers</mark> of the realm in"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "refused to have the <mark>peers</mark> of the realm in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [644.69, 292.36, 960.2, 340.5], "bbox_id": "72a1d160e1", "file": "AppomattoxNewspapers_1898-1902a_0580.pdf", "page": 1, "text": "Time to plant onions. Campaign Working Committee. Dont fail to register Saturday. j Below is printed the Campaign Clerk Peers is at tending the Farm - j Working Committee for Appomattox ville Fair. county, each member of which is"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "printed the Campaign Clerk <mark>Peers</mark> is at tending the"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "printed the Campaign Clerk <mark>Peers</mark> is at tending the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [190.55, 538.87, 346.9, 678.92], "bbox_id": "6f4a79bc58", "file": "AppomattoxNewspapers_1902-1905a_0519.pdf", "page": 1, "text": "Thursday night at Lynchburg Governor Montague was given a great ovation at the Academy of M tisic. On the stage we noticed many Appomattox citizensClerk G. T. Peers. Sheriff F. W. McKin ney, 0. W. Hancock, A. II. Clemen 1 and others. The house was packed and many left unable to secure seats. The friends of Mr. Monta gue confidently expect him to car ry the city."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Appomattox citizensClerk G. T. <mark>Peers</mark>. Sheriff F. W. McKin"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Appomattox citizensClerk G. T. <mark>Peers</mark>. Sheriff F. W. McKin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [949.51, 1555.59, 1106.18, 1665.82], "bbox_id": "0d579a35b4", "file": "AppomattoxNewspapers_1898-1902a_0089.pdf", "page": 1, "text": "This property is situated on what is known as Church street, and is in all respects one of the most desirable places in the village. TERMS One-third cash, balance on a credit of six and twelve months, purchaser to give bonas bearing interest for the deferred payments. Sale subject to confirmation by the court. For further particulars, apply to the under signed. W. C. FRANKLIN. ROBERT D. YANCEY, Commissioners The bond required of the commissioners in the suit of Bettie E. Couch vs. J. M. Durphey Ac., by tbe decree therein of October, 1898, has been given by W. C. Franklin, one of tbe commie loners. Teste GEO. T. PEERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "loners. Teste GEO. T. <mark>PEERS</mark>, Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "loners. Teste GEO. T. <mark>PEERS</mark>, Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1033.9, 265.84, 1179.5, 717.22], "bbox_id": "50f9fccf57", "file": "TimesVirginian_1984a_0053.pdf", "page": 1, "text": "Thf Consumer and Home- maki T program - at . Appomattox Middle k Sdw op atte ap to to help students develop positive ritttM bb J toward themscfves their peers, their patonto, and their future This .flri  is  interrelated hi every urit taught throughout the COW- se. We emphasize eommuni cation skiUs in both written and verbal fonns. Some Of the actual irita taw A t a to as follow Developing the Individual This unit is divided into three areas Relating to SrifeoverS such areas as tofidfag  positive self-concept, dealing with criticism and pwaonal chan- ges Relating to Others deals with friendship, gr oups, conversations, -and expressing emotions Relat ing to Family includes all types of family relation ships. A 2nd major unit taught is Clothing Selection and Construction. Students are given an opportunity for - hands-on went during this unit. They learnthe correct operation M a Singer aetring machine and construct a garment made from- a commercial pattern. Stu dents have an opportunity to utilize consumer dedsions m the selection of their patterns, fabrics, and no-"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "J toward themscfves their <mark>peers</mark>, their patonto, and their"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "J toward themscfves their <mark>peers</mark>, their patonto, and their"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [304.53, 1697.36, 596.56, 1725.33], "bbox_id": "d2e2111132", "file": "AppomattoxNewspapers_1898-1902a_0177.pdf", "page": 1, "text": "There is scarcely anything doing  m y c la im s tO in y vye quote 14 ft if J GEO. T. PEERS. Unwashed, . Washed,"}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "There is scarcely anything doing  m y c la im s tO in y vye quote 14 ft if J GEO. T. <mark>PEERS</mark>. Unwashed, . Washed,"}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "There is scarcely anything doing  m y c la im s tO in y vye quote 14 ft if J GEO. T. <mark>PEERS</mark>. Unwashed, . Washed,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1495.42, 1438.86, 1654.34, 1603.41], "bbox_id": "2cb0b18334", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "There are some of our citizens who are wiser than they have per haps ever been before. It has been said that a man will loose his hair and both of his eyes to see the cir cus  it appears that a great many lost their pocket books. Messrs, Dick Ferguson, Allen OBrien Hector Cawthorn, Ollie Smith, Jack Atwood, Cbas. Hunter Coon Harvey and others had their pockets picked and lost their money at the circus in Lynchburg Saturday. Clerk Peers lost his at the horse show."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "in Lynchburg Saturday. Clerk <mark>Peers</mark> lost his at the"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "in Lynchburg Saturday. Clerk <mark>Peers</mark> lost his at the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [551.52, 346.56, 869.87, 420.41], "bbox_id": "b8fefccc94", "file": "AppomattoxNewspapers_1898-1902a_0527.pdf", "page": 1, "text": "The uew mill is now ready for the Julian Ahbitt. machinery, which will be put into The District Conference will he its place tins weak. j held at Salem church, commencing Clerk George T. Peers will leave I nex Wednesday, to-morrow for Blue-Ridge Springs,  Mr. and Mrs for a little needed vacation."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "commencing Clerk George T. <mark>Peers</mark> will leave I nex"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "commencing Clerk George T. <mark>Peers</mark> will leave I nex"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [760.54, 1710.31, 920.5, 2003.54], "bbox_id": "2623d65229", "file": "AppomattoxNewspapers_1898-1902a_0271.pdf", "page": 1, "text": "The Tournament. About 500 people witnessed the riding at the tournameut here last Friday, The riding was spirted and the Knigbts in their gay costumes presented a handsome appearance. Senator H. D. Flood charged the Knights in a few well-chosen re marks. W. A. Moses, T. A. Smith, Geo. T. Peers, S. L. Ferguson and A. H. Clement acted as judges. R. F. Burke . whs chief-uiarshall with F. W. McKiuuey, W. J. Treut, J. G. Fisher aud J. R. Cheriiault as aides. The following Knights entered the tournament with these results, each having three rides J. B. TaylorNo Hope... jus. PayneNo Practice ........... 5 L. B. LeGrandVirginia......... 8 J , Hunter AbbitBlack Hawk 7 Daniel BrowniugA. H. S., ...... 7"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "A. Smith, Geo. T. <mark>Peers</mark>, S. L. Ferguson and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "A. Smith, Geo. T. <mark>Peers</mark>, S. L. Ferguson and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1629.85, 1018.36, 1787.6, 1206.66], "bbox_id": "39061bfc04", "file": "AppomattoxNewspapers_1892-1898a_0129.pdf", "page": 1, "text": "The third reading of the Habeas Corpus act in 1679 in the English House of Lords is said to have been carried by an accident. The num bers declared at the division were 57 for it and 55 against it, though ac cording to the minute book, there were only 107 peers in the House. The discrepancy is thus explained One of the lords who voted in favqr of the bill was as a very big mam, and in jest, the teller for his side pro posed to connt him as six. Perceiv ing that the other teller did not see the joke, he quietly added up the numbers accordingly."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "there were only 107 <mark>peers</mark> in the House. The"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "there were only 107 <mark>peers</mark> in the House. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [166.1, 797.38, 488.0, 894.88], "bbox_id": "74924389ae", "file": "AppomattoxNewspapers_1926-1933a_0560.pdf", "page": 1, "text": "The selection o. Swanson - UP ___ _ Joutstemiing tary of the navy, elevates   n8m to be Virginians of his age. All tnfc -.irjgt one of theJP honor. ? take And when Harry Flood Byrd goes to The vacated seat of Swanson, Virginia will have national life who are the equal or peers of other state. Glass-Swanson-Byrdwhat a brilliant combina tion. ___________ _"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "are the equal or <mark>peers</mark> of other state. Glass-Swanson-Byrdwhat"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "are the equal or <mark>peers</mark> of other state. Glass-Swanson-Byrdwhat"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [410.92, 427.64, 570.81, 720.79], "bbox_id": "5e01b052b3", "file": "AppomattoxNewspapers_1898-1902a_0189.pdf", "page": 1, "text": "THE PRIMARY PLEDGE.  We, the white Democratic voters of Appomattox county who partici pate ill the primary election to be held April 29th, 1899, agree, by otu action, to support the ticket nomi nated by said primary. The above is tiie pledge taken by every voter who participated in the primary election on April 29th, even though he voted for only one man on that day. Without, taking this pledge no man wa. to he permitted to vote. A ll of the candidates agreed to this when they met anti agieed upon the plan of the primary, which was drafted by Mr. Geo. T. Peers. The Democratic committee adopted the plan agreed upon by the candidates. The question of who shall be per- milted to vote in a primary election is entirely in the discretion of the Executive Committee of the party which bolds the primary."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "by Mr. Geo. T. <mark>Peers</mark>. The Democratic committee adopted"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "by Mr. Geo. T. <mark>Peers</mark>. The Democratic committee adopted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1846.81, 242.02, 2015.32, 336.72], "bbox_id": "32939c3e8a", "file": "AppomattoxNewspapers_1922-1923a_0259.pdf", "page": 1, "text": "The party was in oharge of Mr. j Jas. E. Prindle, one of the travel ina passenger agents of the N.  W. Messrs. Peers and Clement met the party at the depot aud showed them over the surrender grounds. It was a very fine body of men, and we hope they will come again."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "the N.  W. Messrs. <mark>Peers</mark> and Clement met the"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "the N.  W. Messrs. <mark>Peers</mark> and Clement met the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [616.32, 1005.86, 777.02, 1482.79], "bbox_id": "7a61488471", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "The outlook for wheat is bad. Not more than a half crop can possibly be harvested. MisaeB Lucy and Nannie Dawson left last Tuesday for their home in Georgia, very much to the regret of a score of onr young gents. They go about with long facesheads bowed down, and refuse to be com forted. The only ray of light that illumines their pathway is a promise from the ladies that they will come again next summer. The regular quarterly conference of the Appomattox circuit was held at Trinity Church last 8aturday,and on Sunday Dr. J.P. Garland preached to a very large and appreciative au dience. Rev. D. P. Rodgers, the new pas tor at Stonewall, preached his first sermon on Sunday at 11 a. m. The voters of this section heartily favor the compromise suggested by mutual friends and ratified by Messrs. Peers and Abbitt. Mr. Peers will receive the full vote at Stonewall. Miss Lizzie Rice is visiting Mias Belle Porter, of Farmville. Miss Carrie Lewis, of Buckingham county, is in the neighborhood, the guest of Mr. and Mrs. C. H. Coleman. Miss Lillian Vaughan, of Notto way county, is staying with her annt Mrs. Mclvor. The public schools have all closed, much to the joy of the small boy. Our land procession are nearing the end of their labors. S tonew all"}, "highlight": {"text": {"matched_tokens": ["Peers", "Peers"], "snippet": "and ratified by Messrs. <mark>Peers</mark> and Abbitt. Mr. <mark>Peers</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers", "Peers"], "snippet": "and ratified by Messrs. <mark>Peers</mark> and Abbitt. Mr. <mark>Peers</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1481.33, 1457.7, 1588.8, 1514.04], "bbox_id": "0a67c9f18d", "file": "AppomattoxNewspapers_1949-1952a_0407.pdf", "page": 1, "text": "the name of Casey iV10 horseshoe pitching f week at the Wisconsin me set a new record of u l peers. He tossed 36 i shots."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "the name of Casey iV10 horseshoe pitching f week at the Wisconsin me set a new record of u l <mark>peers</mark>. He tossed 36 i shots."}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "the name of Casey iV10 horseshoe pitching f week at the Wisconsin me set a new record of u l <mark>peers</mark>. He tossed 36 i shots."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.29, 635.07, 1788.49, 802.51], "bbox_id": "68181e12b2", "file": "AppomattoxNewspapers_1933-1936a_0430.pdf", "page": 1, "text": "The late Hon. George l.F e ers one of Appomattoxs most famous citizens, who died some years ago, is said to have been of those who actually saw the Surrender here. He lived at the Old Court House, in the residue now occupied by Mr.Cabell Carter and family. Mr Peers Peers became clerk of Appomattox county in 1860, and took offhe July first of that year. In 186G he was renamed clerk under fe Underwood government Vat did not qualify ,r.t fhst and T.Virifc P Patterson served for f"}, "highlight": {"text": {"matched_tokens": ["Peers", "Peers"], "snippet": "Carter and family. Mr <mark>Peers</mark> <mark>Peers</mark> became clerk of"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers", "Peers"], "snippet": "Carter and family. Mr <mark>Peers</mark> <mark>Peers</mark> became clerk of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.96, 1238.33, 1741.03, 1331.62], "bbox_id": "70e895f71c", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "The hearts of ye printers were made to palpitate with unusual ra pidity today by a visit from six most beautiful young ladies from this and adjoining counties. They were  Misses Carrie Lee Davis, Loulie Peers, Elma Shearer, Viola Shearer, Ella and Bessie Rosser."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Carrie Lee Davis, Loulie <mark>Peers</mark>, Elma Shearer, Viola Shearer,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Carrie Lee Davis, Loulie <mark>Peers</mark>, Elma Shearer, Viola Shearer,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1688.65, 531.51, 1848.92, 589.01], "bbox_id": "d7a110f97f", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "The handsome new residence of Clerk Geo. T. Peers is nearly ready to be occupied. His daughter, Mrs. E. W. Taylor, will move into it in a few days."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "The handsome new residence of Clerk Geo. T. <mark>Peers</mark> is nearly ready to be occupied. His daughter, Mrs. E. W. Taylor, will move into it in a few days."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "The handsome new residence of Clerk Geo. T. <mark>Peers</mark> is nearly ready to be occupied. His daughter, Mrs. E. W. Taylor, will move into it in a few days."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.84, 547.83, 2054.61, 634.67], "bbox_id": "a6ae367663", "file": "AppomattoxNewspapers_1952-1954a_0090.pdf", "page": 1, "text": "The group will meet at the Old Court House at 130 for a guided toUr ot buildings and grounds, be ginning with the otfice, and from there to the Tavern, Jail, the Peers House and the McLean House. The group will then assemble on the north tide of the Circle for a program, beginning at 215 P. M."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "the Tavern, Jail, the <mark>Peers</mark> House and the McLean"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "the Tavern, Jail, the <mark>Peers</mark> House and the McLean"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1332.47, 794.2, 1480.37, 830.35], "bbox_id": "8383f9a663", "file": "AppomattoxNewspapers_1892-1898a_0278.pdf", "page": 1, "text": "The friends of Mrs. Geo. T. Peers will be glad to learn that she is much better."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "The friends of Mrs. Geo. T. <mark>Peers</mark> will be glad to learn that she is much better."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "The friends of Mrs. Geo. T. <mark>Peers</mark> will be glad to learn that she is much better."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [584.62, 1553.76, 742.87, 1996.45], "bbox_id": "45a84d4b79", "file": "AppomattoxNewspapers_1898-1902a_0438.pdf", "page": 1, "text": "The friends of Mr. Charless H. Sackett will be glad to learn that Judge J. IT. Christian has appoint ed him to fill out the unexpired term of the late Judge Wingfield, which term expires in 1906. The pay of the office depends largely on fees and ranges from 3,000 to 5.000. Mr, Sackett is perhi ps as well quali fied as auy man in Virginia to as- sum the duties of the office. He has served under our veteran clerk Geo. T. Peers as deputy, and there uo doubt received competent instruc tion. One of the leading farmers of the county congratulated ye editor on his efforts iu trying to get some in dustries here aud said whenever the promoters got ready for the ware house he wanted a block of the stock, aud that not only would he sell at it, but he would buy every pound offered or make it bring the market price. This sounds like business. How many more of our farmers will aid in establishing a market at home for our leaf. There is no doubt about haring buyers to attend the sales. The merchants here would be greatly benefited, but we doubt seriously whether they will take hold pf tbe enterprise until its success is assured beyopd any doubt, Unfortunately they are not as pro gressive B8 vve would love to see"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "veteran clerk Geo. T. <mark>Peers</mark> as deputy, and there"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "veteran clerk Geo. T. <mark>Peers</mark> as deputy, and there"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [596.39, 1612.34, 753.77, 1795.39], "bbox_id": "dc56f1334f", "file": "AppomattoxNewspapers_1898-1902a_0437.pdf", "page": 1, "text": "The friends of Mr. Charless H. Sackett will be glad to learn that Judge J . H. Christian has appoint ed him to fill out the unexpired term of the late Judge Wingfield, which term expires iu 1906. The pay of the office depends largely on fees and ranges from 3,000 to 5.000. Mr. Sackett is perhi ps as well quali fied as auy man in Virginia to as- sum the duties of the office. He has served under our veteran clerk Geo. T. Peers as deputy, and there no doubt received competent instruc tion."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "veteran clerk Geo. T. <mark>Peers</mark> as deputy, and there"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "veteran clerk Geo. T. <mark>Peers</mark> as deputy, and there"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1342.55, 433.47, 1493.4, 546.92], "bbox_id": "e54f828710", "file": "AppomattoxNewspapers_1905-1912a_0009.pdf", "page": 1, "text": "The corner-Btone has been laid in LfroodoU Ap cmattox sty la oil p ig thin8. jlr. B. E. Gills is completing an j pition of two rooms to his pretty  jjeadeoce. Clerk Geo. T. Peers is spending a cation in South Carolina. He is i jotuneasy about the yellow feve . j"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "jjeadeoce. Clerk Geo. T. <mark>Peers</mark> is spending a cation"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "jjeadeoce. Clerk Geo. T. <mark>Peers</mark> is spending a cation"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [575.49, 1038.68, 732.54, 1096.38], "bbox_id": "58cf4c3b44", "file": "AppomattoxNewspapers_1898-1902a_0523.pdf", "page": 1, "text": "The board of supervisors met ou yesterday, and made the county levy the same as last year. Clerk Peers will have his annual statement ready foi publication next week."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "The board of supervisors met ou yesterday, and made the county levy the same as last year. Clerk <mark>Peers</mark> will have his annual statement ready foi publication next week."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "The board of supervisors met ou yesterday, and made the county levy the same as last year. Clerk <mark>Peers</mark> will have his annual statement ready foi publication next week."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [514.29, 961.38, 676.63, 1811.37], "bbox_id": "daad900fcb", "file": "AppomattoxNewspapers_1922-1923a_0545.pdf", "page": 1, "text": "The bicycle craze has at last reach -  ed the Mexican city of Vera Cruz. There, is also a motor cycle in town. The proposed extension of the Yokohama gas works, at a cost of 312,000 gold, is stated in a Japan ese newspaper extract forwarded by Consul General Miller. A woman, 71 years old, accused at Feltham , England, of intoxication and disorderly conduct, said she hail been keeping up her m others birthday. Her mother was 98. The cloud formation known at  m ares tails and mackefel sky are invariably three miles high. The highest clouds are 10 miles high and these are composed of minute par ticles of ice. Consul L. E. Dudley, of Vancou ver, calls attention to the opening afforded for the establishm ent of a plant to utilize the waste offal of fish in the m anufacture of guano in British Columbia. The P i l g r i m Congregational Church, near London, founded in 1616, is the oldest of the denomina tion in the empire, and it was from it that the London contingent of the men of the Mayflower was recruit ed. There are a thousand acres of sub m arine coal mines being worked around Cape Breton. The charac ter of the soil overlaying these dig gings enables them to be worked without interference from the water above. A railroad will soon be completed which will extend from Puerto Bar rios, on the Atlantic Coast, to the city of Guatemala, putting the capi tal of the Central American Repub lic within five-days steam communi cation of New Orleans. Glassless goggles for drivers of motor vehicles have thin steel plates in place of the usual lenses. There is nothing brittle to break, endanger ing the eyes, and three ingeniously arranged slits enable the wearer to seen everything in front of him. The Hampstead London borough council has instructed a committee to draft bylaws dealing with street noises, especially the intolerable nuisance of organ grinding and church bells. During 1906, the m erchant marine of Chili was increased by 34 vessels, with a tonnage of more than 30.000. The Chilian m erchant m arine now consists of 85 steam ers and 90 sail ing vessels, with a tonnage of 110,- 000 tons. There are upwards of 8,000,000 separate freeholds in France, as com pared with about 300,000 in Great Britain, a fact which in itself speaks volumes. A Frenchman will part with anything rather than land. New York City is receiving a daily average of 740 Italian immigrants, including those from Italy, Sicily and Sardinia. University statistics of Europe seem to indicate that men are de serting the practice of medicine and women are taking it up. In Belgium girls are expected to give five weeks out of each school year to learning housework. The girl is required to know not only how to cook a dinner, but how to clean up and care for a kt hen, do marketing, wash, and iron The grand jury of New York County returns on an average 64 in dictments each day. Four peers, 11 baronets and 35 knights were created by the King of Great Britain on his last birthday. Nominally, the King did it in rea lity, the Liberal ministry did it. the birthday honors being one of the perquisites of office. The ancient city of Lyons, the third city in France. wfth a popula tion of 500,000, vies with Milan in importance in the worlds silk indus try. No fewer than 40,000 people __ men, women and children are em ployed in the factories."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "dictments each day. Four <mark>peers</mark>, 11 baronets and 35"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "dictments each day. Four <mark>peers</mark>, 11 baronets and 35"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [839.97, 322.15, 1373.13, 981.0], "bbox_id": "a410aa2df4", "file": "TimesVirginian_1981a_0424.pdf", "page": 1, "text": "Thé Appomattox County School System includes .drug education a s . a part of its curriculum. Education is con sidered the key to. drug prevention. Therefore, the . instructional program in the school system is designed to . strengthen the individuals value system and to assess the consequences associated with drug abuse. From kindergarten through grade twelve drug education is incorporated as an integral part of a comprehen sive health education program. Another area of importance in drug prevention is supervi sion. The school system provides supervision to protect students from intruders and from peers who may be tempted to violate school rules and regulations.  The effectiveness of school activities in preventing drug problems is dependent upon-the assistance, and cooperation Of parents and agencies within the community. The relationship has been exceUent in the past which accounts for the progress which,has been made in drug prevention. However, the neéd for assessment of problems arid community educational activi ties does not lessen. The school system will continue to exercise its responsibility to maintain An environment in which students are protected from dnigs and drug related activities.  You are invited to express your concerns and to make your recommendations to the Ap pomattox County School Board. You may call the office at 3528251 or send written correspondence to P. 0. Box 548, Appomattox, Virginia 24522. Give Them"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "from intruders and from <mark>peers</mark> who may be tempted"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "from intruders and from <mark>peers</mark> who may be tempted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2130.3, 1369.48, 2290.9, 1596.24], "bbox_id": "f3a635a0d7", "file": "AppomattoxNewspapers_1892-1898a_0193.pdf", "page": 1, "text": "ThcCom monwealth of Virginia, to the sheriff of the County of Appomattox, itrcet- init We command you to summon, as you hal o heretofore been commanded to summon, the Appomattox Surrender House and na tional War Museum Co., to appear a t the clerks office of the circuit court of the County of Appomattox at the court-housc thcrco . at rules to 1,0 holden for said court, oil the third Monday in November next to answer Joseph J. Smith of a plea of trespass on the ense in assumpsit- Damage 500. and have then ihm e this writ , witness, Goo. T. Peers, Clerk of our said cult, at the court-house, the 16th day of October ttv.it, and iu the tllM.li year of tire Commonwealth. Guo. T. I xkks , i The object of this suit is to recover of tlio defendant company the sum of wmi I interest thereon from the 1 SU 1 day of April 18111 und tci attach the estate ot the said defem- I lyntcompuny in tins stale and subject trie s-une to 1 he payment of said debt, and it ap- iieurlnjf byanailidav it made and mod that the I said defendant company is a foreign eorponi-  Hon und not a resident of tills c it,. , that there is no person in said county designated I by law as representative ot said corporation, nor is t herd any agent of said delendunt com pany in said county, nor any other person in said county on whom there can be service at nroeess.it is ordered that aeopy of the pro- c ss in hi case bo published once a week tor four successive weeks in the A i  i  omattox a m  Bun king hum TIMES, a nowpaiMT printed in this State, and posted at front door ot the court-house of said count y. A copy of process and order."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "writ , witness, Goo. T. <mark>Peers</mark>, Clerk of our said"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "writ , witness, Goo. T. <mark>Peers</mark>, Clerk of our said"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1314.68, 1414.98, 1472.87, 1702.39], "bbox_id": "e6f054deb8", "file": "AppomattoxNewspapers_1892-1898a_0320.pdf", "page": 1, "text": "Th Proakyterlan Church.  Aecordiug to appointment, the i Presdyteriaus met at the ConrtHouae j building last Saturday night. The  tjct of the meeting was to revive n a business basis, the movement to foenre a church building at this place. The following bnilding com itteewas appointed Rev. J . C, kps, Messrs. Randolph Caldwell,W Trent, F. W. McKinney, Jos, Button,Geo. Wilkerson,I. O. Abbitt, H. D. Flood. It ii requested that this committee tewt as goon as practicable. The Presbyterians wish to say to their friends in the oonnty that they tend to build. They will start as n as sufficient fnnds are secured yon not want to help in the Pd cause ? Send your contnbu to Mrs. G. T. Peers, Treasure fet Appomattox, or Rev. J . I P Pamplin City."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "to Mrs. G. T. <mark>Peers</mark>, Treasure fet Appomattox, or"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "to Mrs. G. T. <mark>Peers</mark>, Treasure fet Appomattox, or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [724.77, 336.89, 891.93, 867.18], "bbox_id": "5130a38ccb", "file": "AppomattoxNewspapers_1898-1902a_0264.pdf", "page": 1, "text": "th, Greeting from sister Baptist hurdles Red Oak, .Jno. Hughes, F,sq., Liberty, Geo. T . Peers, Esq. Tth. Greeting from churches of Ap- inattox Association, Rev. J . FT.  birch. 8 th, Greeting from the Virginia Baptists Progress of Vir- rinia Baptists during the last So prs. Rev. Dr. G. F , Bagbv. 9 . limitary by the choir. 10 . Greet ing from sister denominations  Re rictus progress in Virginia during 0 years, J . R. Iloislev. 11 . Hvmn. 1 .. Greeting from former pastor.  3. Roll call of constituent mem bers still living. 14, Hvmn. Afternoon Session 1 , Hvmn  2 , criptnre 3, Prayer 4, Voluntary . Duty of a church member to his burch. Rev Dr. A. A . Rice 6 , A vide awake church, Rev. C. Tompson  7, Hymn  8 . The local church and the worlds evangeliza ion, Rev. Dr. If. W Tribble 9, Hvmn  10 , Benediction, The committees having charge of be celebration are  General Com mittee. T. 0 . Davidson, J . W Cr- - n and Dr. Taylor  Committee on MusicPeter Stratton, Tom Taylor, Mrs. W. W. Carson, Miss Annie Davids n  invitationT . J . Strut-   m Mrs. L . Q. Melver. The Hebron people hope that  heir friends. Baptists and other de lominations will come and join  it li them in this celebration. Rev. Dr. Pitt, of., thc Religion . Herald and Rev. Dr. Boatwright I have been invited to be present i and if they come will be place I in i the programme. Fores Store. Farmers are about through hous ing corn and"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "F,sq., Liberty, Geo. T . <mark>Peers</mark>, Esq. Tth. Greeting from"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "F,sq., Liberty, Geo. T . <mark>Peers</mark>, Esq. Tth. Greeting from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [249.07, 447.91, 413.06, 1223.26], "bbox_id": "1024d6fe6d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "TH E COUNTY CLERKSHIP. A right pretty political fight is to take place in this county for the clerkship, which is the best-paid office within the gift of our jieople The present clerk holds od for two more years, and then the will be made for an eight-year term Dr. D. Mott Robertson, late county- treasurer, who resigned that office last summer, has announced to sono of his friends that he will stand fo the Democratic nomination for tb clerkship, and that he will, if elect ed, run the office for the fees alone This would be a saving to the tax payers of nearly 600 per annum, or nearly 5,000 for thè term. The election is some distance be fore us, and it is not our purpose to stir up the candidates or the people upon the subject thus early  but we shall fill the field of a newspaper and keep our readers informsd of events as they occur. Among tbi possible candidates we feel warrant ed in mentioning our present sheriff. Mr. S. P. Coleman, who would be u formidable opponent for any aspir ant H. Winston McKinney, the ef ficient deputy clerk, who is perhapi more familiar with the duties of the office, and better qualified for theii discharge, than any other available man. Should he enter the race, he would undoubtedly have the warm support of Mr. George T. Peers, the present clerk  and Mr. Peers would, no doubt, remain in the office for a time to aid him in his work. Mr. J Rolfe Horsley, whom Mr. Peers de feated for the office in 1899, is also likely to be a candidate. Mr. Hors ley last Week resigned the position of private secretary to Congressman Flood, which oarried a salary of 1, 200 per annum paid by Congress and assumed the management of the Southside Virginian. The resigna tion of Mr. Horsley probably caused Dr. Robertsons early announcement of his candidacy. We are satisfied that there will be other candidates. The people are being quietly sounded as to thiB and that man, bat the great majority of them will hardly bind themselves to any one at this stage of the game- none, perhaps, except a few whc be lieve that they ought to be allowed  to shape all the public policies of the connty, and to name all of the officeholders years in advance of the election. We respectfully dissent, and Bhall await developments before we bind ourselves to the tail of any"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "of Mr. George T. <mark>Peers</mark>, the present clerk  and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "of Mr. George T. <mark>Peers</mark>, the present clerk  and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [162.96, 447.06, 323.72, 815.84], "bbox_id": "4e74e70347", "file": "AppomattoxNewspapers_1902-1905a_0462.pdf", "page": 1, "text": "TH E COMING PRIM ARY Soon the candidates will begin to call upon the dear people. In Ap pomattox, Mr. George T. Peers, who has been clerk of the county fo nearly forty years, with an interi um of one term, will not stand for re-election. There will be several candidates for the place. The member of the House of Delegates from this connty will not be elected without a contest. The Connty Democratic Committee ia to he elect ed also at the primary to be held some time in August. As soon as the State Committee decides the date for holding the primary, the candidates will begin to come out, and with the above lo cal fights on band and the warm contest to be waged for U. S, vena- tor and Gorernor and other State officers, the contest will prove to be the warmest election held in old Appomattox for many years. Ev ery Democrat will have a chance to vote for the man of bis choice, and it behooves each voter to oast hie hallo in the interest of his state and county. Dont pledga your support .00 early in the fight"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "pomattox, Mr. George T. <mark>Peers</mark>, who has been clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "pomattox, Mr. George T. <mark>Peers</mark>, who has been clerk"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1200.26, 861.38, 1334.87, 1290.58], "bbox_id": "8feef8a5f1", "file": "AppomattoxNewspapers_1922-1923a_0254.pdf", "page": 1, "text": "Texas girls are forming anti clubs. Ouida dresses in white both i and summer. Mrs. Osbima is one of the m cient native Christian workers hi pan. Mrs. Charles P. Frey won the pionship In the Womens Chen gress. It is Interesting to note that in ern times seven British peers married actresses. The Congress of the Daughter the American Revolution broke npf row at Washington. Princess Ena of Battenberg it only royal child born In Scotland! more than 300 years. Barnard College received Jf from an nnnnmed giver, to bee ed on a new dormitory. The private secretary of the Enr of Japan Is a Christian woman member of the Congregational Ct Girl athletes belonging to the of 1909 at Barnard College won championship in the annual field sports. The new building of the He Technical School for Girls, in York City, was formally dedicate the presence of some 500 friendin institution. Like many other of the hand and most popular of the Britis esses, the Countess of Clancarty claimed the publics attention from hind the footlights. The Society of American WouC London is trying to raise a in give American girls advantages if to those enjoyed by young men the Rhodes scholarship scheme. The Vicar-General of the L has Induced ex-Empress Eugeni place her whole fortune at the dU of the Church. The former Eopd wealth is estimated, at MfLOCKLOOft"}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "ern times seven British <mark>peers</mark> married actresses. The Congress"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "ern times seven British <mark>peers</mark> married actresses. The Congress"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1743.58, 801.14, 1906.68, 980.84], "bbox_id": "9583053cef", "file": "AppomattoxNewspapers_1892-1898a_0053.pdf", "page": 1, "text": "Telegram of Congratulation, Below we give one among the many congratulatory letters and tele grams received by Mr. George T. Peers, who was elected Clerk of the County Court at the late election pplll St -G eo . T. P eers , Appomattox, Va. Durham oounty congratulates yon and through you the people of Ap pomattox, upon the triumph of vir tue, justice, honesty and truth. C aleb B, G reen , Clerk of Durham Superior Court."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "by Mr. George T. <mark>Peers</mark>, who was elected Clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "by Mr. George T. <mark>Peers</mark>, who was elected Clerk"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [540.0, 802.1, 698.94, 873.05], "bbox_id": "7161d30db2", "file": "AppomattoxNewspapers_1898-1902a_0410.pdf", "page": 1, "text": "Tbe following marriage licenses hpve been issued by Clerk Peers this week Chas. R. Ferguson to Addie C. Fitzgerald, to be married on Dec. 20th Robt. W. Phelps to Jennie E. Page, to be married on the 19th."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "been issued by Clerk <mark>Peers</mark> this week Chas. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "been issued by Clerk <mark>Peers</mark> this week Chas. R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2393.48, 1194.26, 2565.18, 1667.71], "bbox_id": "55fc084361", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "tbat he was a Democrat, and would do his utmost to secure a victory for the Democratic party in this contest and if elected wonld render the best service in his power to the people of the eonnty. Speeches were then made by H. D. Flood, T. J. Stratton,. J. W. Flood, W. J . Trent, J. H. Abbitt, and Dr. Morton, All of these gen tlemen regretted the attitude of Mr. Peers in this contest, and urged upon  all Democrats the duty of support ing the nominees of the meeting. Dr. Morton said that he Was a Peers man before the nomination, bnt now he was for the nominee Abbitt. H. D. Flood gave a history of the consideration shown Mr. Peers by the Democratic committee before they decided to harp a nomination, deferring action in deference to his wishes nntil our opponents had pnt a ticket in the field, and of the num ber of propositions made him tty Mr. Abbitt, by which Peers coufT have become the Democratic nisirt nee, all of whioh he declined. Mi, Flood said if the party desired to ! maintain its organization and its self-respect and retain the respect of brave and trne men, there WUShuf r one course and that was the coarse pursued by the party. He believed the full ticxet put in the field by the meeting wonld he elected, hut if  it went down in defeat it wonld hays i the respect alike of friend and fri The meeting then adjouKiMM Mnim. great enthusiasm."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "the attitude of Mr. <mark>Peers</mark> in this contest, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "the attitude of Mr. <mark>Peers</mark> in this contest, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.09, 639.8, 1959.28, 699.31], "bbox_id": "e3456e95ec", "file": "AppomattoxNewspapers_1915-1918a_0554.pdf", "page": 1, "text": "Taylors T h eir B ack F rom H oneym oon From Los Angeles Times Mr. and Mrs. Cnrtis Peers  i5 ooo Taylor, whose marriage was an"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Taylors T h eir B ack F rom H oneym oon From Los Angeles Times Mr. and Mrs. Cnrtis <mark>Peers</mark>  i5 ooo Taylor, whose marriage was an"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Taylors T h eir B ack F rom H oneym oon From Los Angeles Times Mr. and Mrs. Cnrtis <mark>Peers</mark>  i5 ooo Taylor, whose marriage was an"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.0, 802.36, 1559.23, 881.06], "bbox_id": "4518710069", "file": "AppomattoxNewspapers_1892-1898a_0057.pdf", "page": 1, "text": "T. Peers will be glad to of goods off at and be- he will sell the whole one desiring a. small of goods at a very low tore at the Old Court-"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "T. <mark>Peers</mark> will be glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "T. <mark>Peers</mark> will be glad to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1461.84, 240.06, 1618.72, 324.21], "bbox_id": "d57274570c", "file": "AppomattoxNewspapers_1892-1898a_0333.pdf", "page": 1, "text": "T. Peers returned on m Blueridge Springs Mr. Qeo. Monday i. Va., where he went several days ago, to take his wife who has been unwell tor sometime. Mr.s Pears is now in Lynchburg and we hope that she will soon be at home and well again,"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "T. <mark>Peers</mark> returned on m Blueridge"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "T. <mark>Peers</mark> returned on m Blueridge"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1507.68, 1913.81, 1543.86, 1923.81], "bbox_id": "29f79701bb", "file": "AppomattoxNewspapers_1898-1902a_0020.pdf", "page": 1, "text": "T Peers,"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "T <mark>Peers</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "T <mark>Peers</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2379.35, 1306.08, 2513.14, 1331.63], "bbox_id": "0cfeedf428", "file": "AppomattoxNewspapers_1892-1898a_0067.pdf", "page": 1, "text": "T otal ............................................... 80840 T este GEO. T. PEERS, Clerk B oardof Supervisors."}, "highlight": {"text": {"matched_tokens": ["PEERS"], "snippet": "T otal ............................................... 80840 T este GEO. T. <mark>PEERS</mark>, Clerk B oardof Supervisors."}}, "highlights": [{"field": "text", "matched_tokens": ["PEERS"], "snippet": "T otal ............................................... 80840 T este GEO. T. <mark>PEERS</mark>, Clerk B oardof Supervisors."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1375.18, 1234.07, 1532.72, 1317.81], "bbox_id": "f429094db0", "file": "AppomattoxNewspapers_1892-1898a_0455.pdf", "page": 1, "text": "t Miss Virginia McKinney of Lynchburg, will be married to-day at the Presbyterian Church in that city to Mr. F. M. Duniiigton. Miss McKioney is a daughter of Mr. Walter McKinney aud a grand daughter pf Mr. G- Peers."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "daughter pf Mr. G- <mark>Peers</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "daughter pf Mr. G- <mark>Peers</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [447.6, 389.58, 612.1, 566.38], "bbox_id": "5ba5f6547e", "file": "AppomattoxNewspapers_1892-1898a_0053.pdf", "page": 1, "text": "T he people of Appomattox have much to congratulate themselves upon on the result of the late eloc- tion. Mr. Peers incumbency of the clerkship will he a comfort to every person who has business at the Court House. We now have a Board of Supervisors of three men instead of one, and a Board that will carefully gnard the interests of the county. In addition to this it was a signal Democratic victory, and assures us  the easy success for the future. The Democratic majority on the basis of the vote for Supervisors was 230."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "late eloc- tion. Mr. <mark>Peers</mark> incumbency of the clerkship"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "late eloc- tion. Mr. <mark>Peers</mark> incumbency of the clerkship"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.21, 1134.37, 1614.36, 1792.07], "bbox_id": "81e67734d9", "file": "AppomattoxNewspapers_1892-1898a_0121.pdf", "page": 1, "text": "T he D ea th o f M rs. M cK inney. Seldom has a death of a member of our community affected everyone so sadly as that of Mrs. Lelia McKin ney, wife of Mr. Frank W. McKin ney. The announcement of her death and its suddenness sent a shock through the entire community. On Monday last she was taken very ill at about 11 oclock at night, and the conditions being very alarming,riders were sent out in all directions for physicians. Drs. W. H. Abbitt and A. A. Rice were found and promptly responded to the summons. They did all that was possible to alleviate her sufferings and to tide her over the dangerous illness, but when the evening shades of Tuesday began to fall, Mrs McKinney passed away. The hour of her death was 5 oclock Many of her friends were telegraphed for from Lynchburg and Richmond and among those who came by the earliest train were Mr. and Mrs. Wal ter McKinney,Mrs. Poore, of Lynch burg, and Mr. Charles Peers, of Rich mond. The funeral services, which oc curred yesterday at 4 oclock, were conducted by Rev. E. M. Craig, as sisted by Rev. W. S. Royall. The re mains of the deceased were interred in the old family cemetery, just the rear of the house. A very large number of friends and relatives were present to witness the last sad rites. Mrs. McKinney was a native of Appomattox, having passed her life, until a few months ago, at OldAp- pomattox Court-House. She was a daughter of Mr. Geb. Peers, our pre sent county clerk. She was married only last May, and at the time of her death was thirty-three years of age. She was a member of the Presby terian church, and her character as a Christian and as a womanwas sfffih that it would be almost an intrusion to touch upon it. As her pastor, Mr. Craig, said, she never let a day pass without showing by some kindly j act the impress of Christs spirit ppon her."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "burg, and Mr. Charles <mark>Peers</mark>, of Rich mond. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "burg, and Mr. Charles <mark>Peers</mark>, of Rich mond. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [452.66, 1189.83, 615.46, 1786.5], "bbox_id": "51ed89a1db", "file": "AppomattoxNewspapers_1892-1898a_0047.pdf", "page": 1, "text": "T H E C O M PR O M ISE. The compromise arranged between Messrs. Peers and Abbitt, whereby Mr. Abbitt resigns the Democratic nomination and Mr. Peers takes his place on the ticket, should unite the Democratic vote for the head of the ticket. The Democrats who were going to follow the fortunes of Mr. Peers, even against the nominee of their party, are no doubt well pleased at the turn affairs have taken in behalf of their favorite. Those who be lieved in adhering to party lines, and for that reason were supporting Ab bitt, though primarily for Peers, are doubtless rejoicing th at affairs have so shaped themselves that they can vote for their original choice. Those who had no choice as between the Democratic aspirants, but who be came Abbitt men as soon as he was nominated, should as willingly sup port Peers, for now he is the nomi nee. Those who were warm friends of Abbitt, and were loyally support ing him for that reason as well as because he was the party nominee, should aB loyally follow his unsel fish example. He saw that the fight between two Democrats was leading to a bitterness in the party that wonld be detrimental to its success in the future, and th at he was bnt doing the duty of a patriotic Demo crat When he sacrificed his interest for the good of the party. No man will support Peers more loyally than A H. Abbitt. Let all Democrats bury their dif ferences aB these two gentlemen have dime. Let them remember th at it is not only Geo. T. Peers, bnt the Democratic party they are voting for. Let them remember that they are Democrats, and give a long pull and a strong pull for the whole ticket, that there may be cause for rejoicing on the morning of May 26th."}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "compromise arranged between Messrs. <mark>Peers</mark> and Abbitt, whereby Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "compromise arranged between Messrs. <mark>Peers</mark> and Abbitt, whereby Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [562.78, 666.24, 701.21, 864.18], "bbox_id": "8e05ccc3a8", "file": "AppomattoxNewspapers_1974-1975a_0311.pdf", "page": 1, "text": "T. Gills c. L. D. Guillaume 4. Thomas Lovell 2. Home at Historic park supposedly haunted a. Peers b. Meeks c. McLean d. Isbell 3. Author of My Health Is Better In November a. Havilah Babcock b. Albert Fratrick c. Eliz. Kinsey d. Josiah Megginson 4. Church moved to near Piney Mountain a. Liberty Chapel b. Hermon c. Wesley d. Bethel 5. Name of old stage road in county a. Concord b. Piney River c. Oakville d. Enonville"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "park supposedly haunted a. <mark>Peers</mark> b. Meeks c. McLean"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "park supposedly haunted a. <mark>Peers</mark> b. Meeks c. McLean"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [510.23, 353.57, 583.43, 593.71], "bbox_id": "1a9384a670", "file": "AppomattoxNewspapers_1892-1898a_0434.pdf", "page": 1, "text": "T A Cald well, A II Clement, F W McKinney, J R Hill. T A Smith,  It V Smith, L E Smith, J T Lee, L E Martin, iV JI Burke, Geo T Peers, C D Mitchell, I LChernault, li F Durruin, J 1 Cnmby, V S Cumby, C N Garrett, C S Seay, .1 L Davidson, U T Smith, E W Taylor, C R Dowell, W S Garrett, N T Harvey,"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "JI Burke, Geo T <mark>Peers</mark>, C D Mitchell, I"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "JI Burke, Geo T <mark>Peers</mark>, C D Mitchell, I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [613.7, 261.08, 757.58, 491.67], "bbox_id": "d630962f78", "file": "TimesVirginian_1981a_0220.pdf", "page": 1, "text": "suspension of all non-military projects. Repair of Clover Hill Tavern was started in 1953. By 1954 renovation had been completed, public comfort stations install ed and . reconstruction of the Tavern Slave Quarters and Peers House and a Maintenan ce Compound completed. Also completed in 1954 was the by-pass road begun in 1941. This work was dime by the State Highway Department with fonds provided by the National Park Service. On April 6, 1954, President Eisenhower approved a Bill, sponsored by Congressman W. M. Abbitt, to change the name of the area to Appomattox Court House National Histori-"}, "highlight": {"text": {"matched_tokens": ["Peers"], "snippet": "Tavern Slave Quarters and <mark>Peers</mark> House and a Maintenan"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers"], "snippet": "Tavern Slave Quarters and <mark>Peers</mark> House and a Maintenan"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2009.29, 1586.23, 2173.54, 1703.28], "bbox_id": "c33246bb95", "file": "AppomattoxNewspapers_1933-1936a_0387.pdf", "page": 1, "text": "Sunday was Ground Hog day. The theory is that if this little seen animal peers forth from his winter lair to behold his shadow, he straightway scampers back to dig ini fori forty daya of pad weather. . . . . . . .... If Brer Ground Hog looked out Sunday, all he saw was snow and ice, not any part of a shadow. Tis onb ime wed like to he l superstitious and be all set for fair and warmer weather."}, "highlight": {"text": {"matched_tokens": ["peers"], "snippet": "this little seen animal <mark>peers</mark> forth from his winter"}}, "highlights": [{"field": "text", "matched_tokens": ["peers"], "snippet": "this little seen animal <mark>peers</mark> forth from his winter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
