{"document": {"bbox": [1711.88, 790.25, 1878.71, 952.65], "bbox_id": "5d249dc92e", "file": "AppomattoxNewspapers_1939-1943a_0230.pdf", "page": 1, "text": "The exploits of Peter Francisco, mown as the Hercules of the Amer ican Revolution, as wall as the dramatic meeting between General Le and General Grant at Appo- nrttox, are highlights of the seventh nortocast of the Virginia Travel- r sérias to be heard Wednesday, February 12 at 1015 P.M. over adio station WRVA, Richmond. Dr. Edgar C. Gammon, president of Hampden Sydney Collage, will be the guest speaker on this program, which is prssened by the Virginia Writers Project of the Work Pro jects Administration in cooperation with the Virginia Conservation Com mission ."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "The exploits of <mark>Peter</mark> <mark>Francisco</mark>, mown as the Hercules"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "The exploits of <mark>Peter</mark> <mark>Francisco</mark>, mown as the Hercules"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1525.21, 1621.15, 1846.45, 1760.15], "bbox_id": "fc3f836ee9", "file": "AppomattoxNewspapers_1926-1933a_0369.pdf", "page": 1, "text": "tavern in Amelia county. It was a plundering party of nine One of them de- his knee buckles. Caldwell farm just a mile west Francisco put out his leg and Laiaweu iarm J thntltold the trooper to take them of Appomattox C. H., at tnatJ0ff The man advanced and time a part of Buckingham Jbegan to take them off, when county. Peter Francisco, I Francisco seized his sword and the I struck him dead. He killed strong young man, was one of  two others of the party, iRclud- the most noted characters in ling one who was on horseback Virginia during the latter p_artand who had snapped his gun"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco", "Francisco"], "snippet": "them off, when county. <mark>Peter</mark> <mark>Francisco</mark>, I <mark>Francisco</mark> seized his"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco", "Francisco"], "snippet": "them off, when county. <mark>Peter</mark> <mark>Francisco</mark>, I <mark>Francisco</mark> seized his"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.63, 738.19, 1871.18, 781.01], "bbox_id": "6f211ab2d1", "file": "AppomattoxNewspapers_1939-1943a_0230.pdf", "page": 1, "text": "Radio Program On Peter Francisco"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "Radio Program On <mark>Peter</mark> <mark>Francisco</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "Radio Program On <mark>Peter</mark> <mark>Francisco</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.72, 1569.1, 1651.6, 1615.15], "bbox_id": "42d61e2260", "file": "AppomattoxNewspapers_1926-1933a_0369.pdf", "page": 1, "text": "Peter Francisco According to an announce- ____ ment by R. T. Carroll, in f0i0wing article charge of the Navy Recruiting written many years ago"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "<mark>Peter</mark> <mark>Francisco</mark> According to an announce- ____ ment by R. T. Carroll, in f0i0wing article charge of the Navy Recruiting written many years ago"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "<mark>Peter</mark> <mark>Francisco</mark> According to an announce- ____ ment by R. T. Carroll, in f0i0wing article charge of the Navy Recruiting written many years ago"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.2, 1038.87, 1509.96, 1169.11], "bbox_id": "7becfbaa9a", "file": "TimesVirginian_1976_0096.pdf", "page": 1, "text": "Our neighboring paper, The Farmville HERALD, came out last week with a lengthy, well-written, illustrated and well worth saving feature on the famous Peter Francisco. They should reprint it in book form. Francisco, the incredible strong mail of the American Revolution is closely associated with this area and his fame has persisted for two centuries."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "feature on the famous <mark>Peter</mark> <mark>Francisco</mark>. They should reprint it"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "feature on the famous <mark>Peter</mark> <mark>Francisco</mark>. They should reprint it"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1814.89, 241.91, 1994.06, 1294.95], "bbox_id": "561f8871d7", "file": "AppomattoxNewspapers_1926-1933a_0369.pdf", "page": 1, "text": "on him. Tarletons troop of four hundred men now came in sight and Francisco thought it time to get away. He frightened the remaining six by crying out, Come on boys, and making them believe that the Americans were coming, le then mounted one of the horses and drove the others before him.- Tartelon soon came up and sent a party to capture him, offering a reward for his head. Francisco evaded his pursuers by turning down an obscure road, and got away with his booty. He sold the horses at Prince Ed ward Courthouse, except one, which he kept for many years and named Tarleton. When the war was over, Francisco settled lown to peaceful pursuits. Thre was nothing of the bully about him. On the contrary, he was so good-natured that it was not easy to provoke him to a quar rel. In the year 1806 Fran cisco was keeping a tavern in Amelia county. A man rode up to the gate, and Francisco went out to welcome the guest. The man inquired whether he was Peter Francisco. On learning he was, he said that he had come all the way from Kentucky to whip him. Peter called to a boy and sent him to bring a bunch of willows. When they were brought, he handed them to the man, say ing, Now lash me over the shoulders, and you can go home and tell that you have done your errand. The man finding him hard to provoke, dismounted and requested to feel his weight. He lifted Francisco twice and remarked that he was quite heavy. Ahen Francisco requested to lift him He picked him up and easily threw him over the fence. The man was somewhat hurt by the fall, but picked himself up an dsaid, Now, if you will throw my horse over, I will thank you,Francisco immedi ately complied with his re quest, throwing the horse over the fence without any difficul ty. The man mounted his horse and rode away perfectly satisfied witth his experience. This tale was told to Henry Clay when he visited Francisco in 1826 and greatly amused him. Mr. Clay laughingly re marked that he was glad one of the mischievous Pamphlet family had come to gnf This was a playful allusion to the political pamphlets written against him. Many anecdotes are related of him, illustrating his good nature and his kindness to his poorer neighbors, which I have not space to recount. Francisco was thrice mar ried. His second wife only left children. They were two sons and two daughters. All of them married into good families and their numerous decendants may be counted among the best citizens of the Old Dominion. Peter Francisco died in 1882 and was buried on Shockoe Hill, in Richmond, not very far from the spot on which he first landed in the State. One of the districts of Buckingham county is named after him and his portrait was hung in the courthouse. I regret to add that the portrait together with the courthouse was destroyer by fire a few years ago."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "inquired whether he was <mark>Peter</mark> <mark>Francisco</mark>. On learning he was,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "inquired whether he was <mark>Peter</mark> <mark>Francisco</mark>. On learning he was,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [913.7, 383.11, 1074.75, 619.7], "bbox_id": "19446fdf22", "file": "AppomattoxNewspapers_1898-1902a_0690.pdf", "page": 1, "text": "Mrs. Edward A. Whitaker and Harry Francisco were married in the City Hall on Monday morning May- 19. Francisco is a direct descend ant of Peter Francisco, a Revolu tionary hero, whose lody lies in Shockoe-H il Cemetery, Richmond, Va. He was until recently a resi dent of that city, but is now secre tary to one of the officials of the Metropolitan Street-Railway Co. Five months ago Mrs. Whitakers husband, a conductor ou thT Chesa peake  Ohio Railway, lost his life in a wreck near Lynchburg. Mrs. Whitaker, who is 31 years of age, has known Francisco for years. He is just 21 years old. She came here recently to visit his mother, and their meeting was soon followed by an en gagement. The bride has four little children in Richmond.New York letter to the Baltimore Sun."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "direct descend ant of <mark>Peter</mark> <mark>Francisco</mark>, a Revolu tionary hero,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "direct descend ant of <mark>Peter</mark> <mark>Francisco</mark>, a Revolu tionary hero,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [570.17, 272.82, 707.77, 550.65], "bbox_id": "ec45e62fd7", "file": "TimesVirginian_1976_0434.pdf", "page": 1, "text": "Moore Publishing Company of Durham, North Carolina is proud to announce the publica tion of PETER FRANCISCO VIRGINIA GIANT by Janet Shaffer, a resident of Lynch burg, Virginia. Tile childhood origin of Peter Francisco who grew up to become the Virginia. Giant of Revolutionary War fame, ré mains one of the unsolved riddles of history, even today. Despite speculation, research and fanciful theories, the mysterious events which led up to his abandonment on . the shores of City Point, Virginia, by sailors on a mystery ship still intrigue the imagination, as do his exploits as the ward of Judge Anthony Winston of Buckingham, and later as a Paul Bunyan-like character in war and peace. Peter was only sixteen years old when he enlisted in the"}, "highlight": {"text": {"matched_tokens": ["PETER", "FRANCISCO"], "snippet": "the publica tion of <mark>PETER</mark> <mark>FRANCISCO</mark> VIRGINIA GIANT by Janet"}}, "highlights": [{"field": "text", "matched_tokens": ["PETER", "FRANCISCO"], "snippet": "the publica tion of <mark>PETER</mark> <mark>FRANCISCO</mark> VIRGINIA GIANT by Janet"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [778.53, 438.74, 943.7, 1184.8], "bbox_id": "3ab717e6f4", "file": "AppomattoxNewspapers_1898-1902a_0526.pdf", "page": 1, "text": "j father of Mr. L. D. Jones, for a short  time, until the continental army un- I der General Gates, going south after j the surrender of Burgoyne, passed I by, and he joined in his shirtsleeves j and barefooted. He distinguished j himself by his prowess and gallant r y , especially at the battle of Qow- i pens, where re charged through  I whole regiment of British cavalry I on his splendid horse, cutting down a wide swathe of them with his big I broadsword. He also, while scout- ling alone, took prisoners six British j soldiers at one lime, and marched  thiiu into the American camp. He was a messmate and particu lar friend of the late Mr. A. Forbes, lor., and many were the tales he used to tell of  Peter the Great, as the boys dubbed him. One of these was that he and Peter, while foraging once in South Carolina, came to a springhouse, which was in those days a log structure over the branch close to the spring, with door, lock, and key, foi the reception of fresh meat, butter, milk, pies, etc. There being no other way of gaining admittance except by breaking the lock, which was a capital offence in those days. Peter raised up one corner of the house, and through the hole Forbes entered, and banded not the provis- ioi s. After satisfying his appetite, Peter let down the corner, leaving Forbes to his fate, which was a good cudgeling over the head with u broomstick by Madam Shackelford, the lady and propietress of the farm. After the war Peter Francisco set tled for some years at the New Store, keeping a tavern, a small store, etc. Then he moved to a farm 2 miles from New Store, on Willis River the farm on which Capt. Sam Jones now resides. By the way, Captain Sam, though smartly ou the rise of eighty, was a short time ago joined in holy wcdlopk to u buxom widow. The farm joins the Woodlnwn farm, now owned by the Chappells, form erly by my great-uncle, Capt. Sam! Branch. Wood lawn is sacred in nn memory as the home of nty great grandmother, as the childhood home of my brother Sam Hales, deceased, and as containing the burial ground of my great-grandmother, uncle, aunt, cousins, mother, father, broth er Peter, and others. Mr. Francisco was a frequent visitor at mv uncles, and many were the stories told by cousins of Isis Qve of fut uud de light m showing his great Strength One of them was that a great bully from a distance probably from Pow hatan once came to fight him. Ho arrived in the neighborhood about dusk, spent the night with one qf Mr. Franciscos neighbors, and next moniinji sallied forth in searuh of"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "farm. After the war <mark>Peter</mark> <mark>Francisco</mark> set tled for some"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "farm. After the war <mark>Peter</mark> <mark>Francisco</mark> set tled for some"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.65, 1561.4, 1823.66, 1607.8], "bbox_id": "ee97bde683", "file": "AppomattoxNewspapers_1908-1909a_0369.pdf", "page": 1, "text": "i Peter Francisco according to an announce- it by R. T. Carroll, in --ue iouowing u u u c - rge of the Navy Recruiting .. manv years ago forli- ---- --- --- r- , ."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "i <mark>Peter</mark> <mark>Francisco</mark> according to an announce- it by R. T. Carroll, in --ue iouowing u u u c - rge of the Navy Recruiting .. manv years ago forli- ---- --- --- r- , ."}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "i <mark>Peter</mark> <mark>Francisco</mark> according to an announce- it by R. T. Carroll, in --ue iouowing u u u c - rge of the Navy Recruiting .. manv years ago forli- ---- --- --- r- , ."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.45, 633.16, 1612.4, 1407.02], "bbox_id": "fb2765e6f9", "file": "AppomattoxNewspapers_1971-1973a_0625.pdf", "page": 1, "text": "h 1972 the Robert E. Lee 1 and Water Conservation strict initated some of the st drastic changes since its banization in 1940. On Janu- L l, 1973, the five-county dis- ct divided and became two btricts. Buc ki ngha m and mberland Counties formed i new Peter Francisco Soil d Water Conservation Dis- ct. Lynchburg has joined with pherst, Appomattox and mpbell Counties and will re- iin as the Robert E. Lee Soil j Water Conservation D is- ct. Reorganization ofthedis- cts was done after careful psideration. Conservation ef ts can now be concentrated local problems with more al people being involved. Since its conception the dis- jet has dealt mainly with in- idual land owners and land prs. While the conservation Bds of these individuals will served, greater emphasis is Ing given to serving groups h as watershed associations i local units of government, ire emphasis is to be placed the prevention rather than  cure. mall watershed projects in- Iving improved conservation the land and small flood con- 1 dams is a good example of revention . These projects b often more economical and pirable than restoring areas lowing flooding. Flood con- l dams were severely tested p year. Not one watershed pi in the district or anywhere the entire country failed to luce flooding.  good example of flood pro- tion cost verses benefits was amatized by the town of mville. On June 21 Farm- e sustained 3 to 4 million dol ls dajnage to business and in- try. Agricultural da ma ge low potential floodwater re ping dams was estimated to n additional several million ars. Soil Conservation Ser-  engineers have estimated struction cost of small wat- ed dams for flood protection e about 1 12 million dol-  It stands to reason says Steak, spokesman for the mville business group, t flood protection on the Up- Appomattox River is econo- Uy sound. Accomplishments e Robert E. Lee Soil and per Conservation D i s t r i c t a pioneer in watershed rams. Virginias first wat- ltj.ed Project Pilot Water -"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "Counties formed i new <mark>Peter</mark> <mark>Francisco</mark> Soil d Water Conservation"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "Counties formed i new <mark>Peter</mark> <mark>Francisco</mark> Soil d Water Conservation"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [506.64, 822.77, 650.24, 1004.14], "bbox_id": "7340db1893", "file": "AppomattoxNewspapers_1971-1973a_0326.pdf", "page": 1, "text": "FRANCISCO HOME IN REGISTER The Peter Francisco House n e a r Dillwyn, Buckingham county, was entered recently in the National Register of His toric Places. This historic pro perty was nominated by the State Liason officer responsi ble for Virginias implementat ion of the National Historic Pre servation Act of 1966. Peter Francsico was a leg endary hero of the American Revolution, noted for his height and physical strength and prow- ess.______________________ _"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "HOME IN REGISTER The <mark>Peter</mark> <mark>Francisco</mark> House n e a"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "HOME IN REGISTER The <mark>Peter</mark> <mark>Francisco</mark> House n e a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1355.05, 760.41, 1525.9, 1796.11], "bbox_id": "5e3338bbd0", "file": "TimesVirginian_1976_0363.pdf", "page": 1, "text": "Father Darkleaf is aglow lfeith pride. A friend brought me a copy of the editorial page f The Chicago Tribune, of Sept. 23 and it had a feature article by reporter Frank Starr on Calvin Robinson, of Appo mattox. Bro. Starr dropped by to see m e while on a tour of Dixie and we talked about Appomattox history and Joe Sweeneys invention of the   j five-string banjo. Plus the G row ing Town, of modern Appomattox. Might add that thé Tribune is one of the largest and greatest American news papers. It would be nice to have Joe Sweeneys cabin restored 4gBd. Ban jo Museum here at Appomattox.  ,5  to,   -   Upcoming annual Railroad t a Day is getting lots of attention and many committees are at work to make it another succesful one. Good luck.      .... Have just read a new book, Peter Francisco - Virginia Giant by Janet Shaffer. The author lives in Lynchburg. It is well written and merits wide attention.     Ah yes, be it noted that Gen. Robt. E. Lee died in Lexington on October 12,1870.    My friend and fellow sports fen, Robert L Scott, Jr. came by for a visit and loaned me a fascinating book, Speakers Treasury of Sports Stories by Herman Masin. The book had come from the collection of W alter Wheley, outstanding coach at Fredricksburg, and friend of Scott. The book is loaded with famous stories told by famous coaches. Successful coaches have to . make many after-banquet speeches and usually adorn them w ith accounts of odd and humorous incidents in games. Football, boxing, baseball, golf..jf yo u . are interested in sports, this is Hie book for you. Wish space would permit me to pass on some of these stories. Inddent- ly for one-sided games how about 1916 when Georgia Tech defeated Cumberland 220 - 0. V   Cooler weather is not just on the way, it is here. My porch . thermometer Monday morning v?as on thirty-nine. Fireplace weather it is, but I do not have  fireplace, so turned on the oil burner. And soon we will be talking about Thanksgiving Qirkey, and making up Christ mas lists. Have already seen a few toy advertisements, a   .. The field is open for someone to write a book about How, When and Why of nicknames fear football  teams. I jotted down a few names Rice Owls, Georgia Bulldogs, P itt Panth ers, Maryland Terrapins, VPI Hoakies, Delaware Blue Hens, Colorado Jack Rabbits, Rich mond Spiders, N. C. State Wolfpack, Carolina Tar Heels, Texas Longhorns, Clemson and f Princeton Tigers, Ohio Buck eyes, Duke Blue Devils, etc. Ahd The AppomattoxRaiders.    Help The Rescue Squad with a donation. Thanks tar reading and seeya next week."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "read a new book, <mark>Peter</mark> <mark>Francisco</mark> - Virginia Giant by Janet"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "read a new book, <mark>Peter</mark> <mark>Francisco</mark> - Virginia Giant by Janet"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1770.93, 981.43, 2257.55, 1231.17], "bbox_id": "3aabb3e57b", "file": "AppomattoxNewspapers_1892-1898a_0140.pdf", "page": 1, "text": "done his all, and all was lost, save, I will be held at New Concord Church honor!    And so the Army of I commenceing the 11th inst., and Northern Virginia, never broken in I continuing several days. battle, passed from action into His-1 Mrs. W. Simpson, of Naruna,    _ ______ ____ _ __ _ _ tory so it perished by the flashing is visiting at the home of her father,  oa bell successively. These in structed their pupils in the myster ies of the three R.s, sometimes enforcing their arguments in a very summary manner to the great injury of the young dogwood bushes that grew hard by, besides hurting the boys feelings. This building also has.long since been abandoned. Af ter leaving the Academy the stranger will come to the store bouse in whioh McKinney Bros, once did a flourish ing business. Just opposite once stood the house in whioh the famous Peter Francisco resided. It too has long since passed into ashes and Passing down, the"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "in whioh the famous <mark>Peter</mark> <mark>Francisco</mark> resided. It too has"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "in whioh the famous <mark>Peter</mark> <mark>Francisco</mark> resided. It too has"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.65, 1622.15, 1837.51, 1733.25], "bbox_id": "ebf91f57e2", "file": "AppomattoxNewspapers_1908-1909a_0369.pdf", "page": 1, "text": "Caddie, who enlisted in Miller, of Lynchburg. I tw as a plundering part- of nine vy on April 18, 1929, has . pfanciflco livedtroopers.. One of them de- in selected for entran- j Qn be farm known as James Jmanded his knee buckles. to the musicians school a tGaidwen farm just a mile west Francisco put out has leg and mntoi, Roads Young Cau- f , IT n vr t tW told the trooper to take them mpton Roads. Young oa i f Appomattox C. H., at th atoff The man d a n c e d and is the son of Rev. Arthur  Ujme a part of Buckingham I began to take them off, when an1County. Francisco seized his sword and Peter Francisco, thelstruck him dead. _ JIe killed rtrong young man, was one"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "seized his sword and <mark>Peter</mark> <mark>Francisco</mark>, thelstruck him dead. _ JIe"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "seized his sword and <mark>Peter</mark> <mark>Francisco</mark>, thelstruck him dead. _ JIe"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [780.0, 266.81, 1437.56, 356.37], "bbox_id": "481a657623", "file": "AppomattoxNewspapers_1898-1902a_0526.pdf", "page": 1, "text": "C. H. EVANS, Concord Depot, I E tJG E N E WOODY, j t a t e o í K. C. T u rn er Eroi Peter Francisco, Buckinghams Hero of the Revolution. The facts which 1 have been able to gather in regard to the life and deeds of this distinguished man are meagre, traditional, and unsatisfac tory. It is said that he was a Nor-  by birth, and was brought"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "u rn er Eroi <mark>Peter</mark> <mark>Francisco</mark>, Buckinghams Hero of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "u rn er Eroi <mark>Peter</mark> <mark>Francisco</mark>, Buckinghams Hero of the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1808.41, 287.75, 1987.81, 1288.0], "bbox_id": "b7ec14769e", "file": "AppomattoxNewspapers_1908-1909a_0369.pdf", "page": 1, "text": "by crying out, Come on Doys, and making them believe that the Americans were coming. He then mounted one of the horses and drove the others before him.- Tartelon soon came up and sent a party to capture him, offering a reward for his head. Francisco evaded his pursuers by turning down an obscure road, and got away with hjB booty. He sold the horses at Prince Ed ward Courthouse, except one which he kept for many years and named Tarletori. When the war was over Francisco settled lown to peaceful pursuits. Thye was nothing of the bully about him On the contrary, he was so good-natured that it was not easy to provoke him to a quar rel. In the year 1806 Fran cisco was keeping a tavern in Amelia county. A man rode up to the gate, and Francisco went out to welcome the guest. The man inquired whether he was Peter Francisco. . On learning he was, he said that he had come all the way from Kentucky to whip him. Peter called to a boy and sent him to bring a bunch of willows. When they, were brought, he handed them to the man, say ing, Now lash me over the shoulders, and you can go home and tell that you have done your errand. The man finding him hard -to provoke, dismounted and requested to feel his weight. He lifted Francisco twice and remarked that he was quite heavy. Ahen Francisco requested to lift him He picked him up and easily threw him over the fence. The man was somewhat hurt by the fall, but picked himself up an dsaid, Now, if you will throw my horse over, I will thank you,Francisco immedi ately complied with his re quest, throwing the horse over the fence without any difficul ty. The man mounted his horse and rode away perfectly satisfied witth his experience. This tale was told to Henry Clay when he visited Francisco in 1826 and greatly amused him. Mr. Clay laughingly re marked that he was glad one of the mischievous Pamphlet family had come to grief. This was a playlful allusion to the political pamphlets . written against him. Many anecdotes, are relatec of him, illustrating his gooc nature and his kindness to his poorer neighbors, which I have not space to recount. Francisco was thrice mar ried. His second wife only left children. They were two sons and two daughters. A1 of them, married into gooc families and their numerous deceridants may be countec among the best citizens of the Old Dominion. Peter Francisco died in 1882 and was buried ori Shockoe Hill, in Richmond, not very far from the spot on which he first landed in the State. One of the districts of Buckingham county is named after him and his portrait was hung in the courthouse. I regret to add that the portrait together with the courthouse was destroyer by fire a few years ago."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "inquired whether he was <mark>Peter</mark> <mark>Francisco</mark>. . On learning he was,"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "inquired whether he was <mark>Peter</mark> <mark>Francisco</mark>. . On learning he was,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1367.0, 490.21, 1547.52, 888.55], "bbox_id": "f55d906e38", "file": "TimesVirginian_1980a_0201.pdf", "page": 1, "text": "By BILL SHERROD The destructive forces of Mother Nature are sometimes irresistible, such as in the recent debacle at Mount Saint Helens in Washington state. More often, man copes with natures anomalies - floods, hurricanes, hail storms and droughts  with the degree of ingenuity that distinguishes him from the other v species in Mother Natures realm., T Appomattox County and the town of Appomattox are currently involved in planning a watershed project to protect against one of natures more common quirks flooding. The Upper Appomattox Oliver Watershed Association actually con sists of representatives from this town and county, as well as the town of Farmville, and the counties of Cumberland, Buckingham-and Prince. Edward. Three soil and water conservation districts - Robert E. Lee, Peter Francisco and Piedmont - are also working .toward developing a water shed systAn for the Appomattox River and 1 er tributaries. The watershed association was formed eight years ago, after multi-million-dollar property losses caused by floods in 1971. In 1972, even greater damage was caused by floods following Hurricane Agnes, which occured almost eight years ago to the day, on June 21. To date, ten sites suitable for flood-control structures have been"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "districts - Robert E. Lee, <mark>Peter</mark> <mark>Francisco</mark> and Piedmont - are also"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "districts - Robert E. Lee, <mark>Peter</mark> <mark>Francisco</mark> and Piedmont - are also"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [640.53, 653.77, 781.53, 968.8], "bbox_id": "feef519de5", "file": "AppomattoxNewspapers_1971-1973a_0311.pdf", "page": 1, "text": "BROOKNEAL - The Staunton River Historical Society will meet at the Brookneal Com munity Center Thursday, May 11 at 8 p.m. Dr. Mervyn Williamson, pro fessor of English at Lynchburg College, writer and historian, will be the guest speaker, using as his subject,  The Search for the Real Peter Francisco. He will discuss some of the re search he has done on this sub ject. Dr. Williamson is a nat ive of Appomattox. Peter Francisco, the Vir ginia Giant of the American Revolution, at one time lived at Old, Aspenwall in Charlotte County near Brookneal. It is said that he carried the logs to build his house there on his huge shoulders. A spring on the place from which he is said to have gotten his drinking water is still known as Franciscos spring. The meeting is open to the public and friends of the His torical Society."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "Search for the Real <mark>Peter</mark> <mark>Francisco</mark>. He will discuss some"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "Search for the Real <mark>Peter</mark> <mark>Francisco</mark>. He will discuss some"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.18, 259.39, 1746.12, 638.67], "bbox_id": "25ee5128af", "file": "AppomattoxNewspapers_1974-1975a_0317.pdf", "page": 1, "text": "blessing and protection. W ith an increasing admira tion of your constancy and devotion to your country, and a grateful remembrance of your kind and generous considera tions for myself, I bid you all an affectionate farewell. R .E . Lee Genl. LO O KIN G B A C K ... 1. Revolutionary W ar hero from the area a. Ethan Eldrange b. Peter Francisco c. Carlton Agee d. Daniel Bonner 2. Population of county in 1920 a. 8489 b. 9828 c. 7532 d. 9255 3. There were how many marriages in 1932? a. 25 b. 104 c. 39 d. 67 4. Form er location of a junior high school a. Hixburg b. Vera c. Liberty Chapel d. Spout Spring 5. Never a county grade school a. Buck Hollow b. Pettys Fork c. Iron H ill d. Falling River A N SW ER S M b 2.  d 3.  d 4. c 5.  d"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "a. Ethan Eldrange b. <mark>Peter</mark> <mark>Francisco</mark> c. Carlton Agee d."}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "a. Ethan Eldrange b. <mark>Peter</mark> <mark>Francisco</mark> c. Carlton Agee d."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [569.92, 249.02, 805.52, 263.02], "bbox_id": "f8935cc05e", "file": "TimesVirginian_1976_0434.pdf", "page": 1, "text": "About Virginias Peter Francisco"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "About Virginias <mark>Peter</mark> <mark>Francisco</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "About Virginias <mark>Peter</mark> <mark>Francisco</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1456.25, 1223.32, 1593.65, 1318.02], "bbox_id": "6b9fe82dc5", "file": "AppomattoxNewspapers_1974-1975a_0339.pdf", "page": 1, "text": "A man of legendary strength and courage, Peter Francisco was never more than a private soldier it is said that he refused a commission because he thought he lacked sufficient education. He numbered among his friends, however, Washing ton, Lafayette, and Greene."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "legendary strength and courage, <mark>Peter</mark> <mark>Francisco</mark> was never more than"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "legendary strength and courage, <mark>Peter</mark> <mark>Francisco</mark> was never more than"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [187.71, 743.36, 360.21, 1091.01], "bbox_id": "5be217b188", "file": "AppomattoxNewspapers_1892-1898a_0427.pdf", "page": 1, "text": "B u c k in g h a m D e m o c r a ts . Old Buckingham covered herself in glory Saturday and stood by her daughter Appomattox in seuding a solid Tyler delegation to the guber- natorial convention. The delegates for attorney-geueral are divided be tween Mann and Hundley for first choice, and for Mann afterwards. C. H . District endorsed Major Mann Page for Lient-Governor. The delegates are j. H . DistrictJudge Jno. B . Moss and Peter A. Forbes. Francisco DistrictAlex. Forbes, Curdsville DistrictE. W Hnbard aDd Nicholas Crnte. Marshall District Dr. W. B, Pettitt and David Stinson. Slate River DistrictWm Williams, F . C. Moon and M. L . A Moseley. James River District Hon Camm Patteson and Judge A. Hall. The Comity Executive Committee was reorganized as follows C. li. DistrictDr. W. E. Pratt, Jno. R. Moss and N . B."}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "Jno. B . Moss and <mark>Peter</mark> A. Forbes. <mark>Francisco</mark> DistrictAlex. Forbes, Curdsville DistrictE."}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "Jno. B . Moss and <mark>Peter</mark> A. Forbes. <mark>Francisco</mark> DistrictAlex. Forbes, Curdsville DistrictE."}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1074.26, 1074.94, 1232.54, 1292.94], "bbox_id": "e4051b7e93", "file": "AppomattoxNewspapers_1898-1902a_0301.pdf", "page": 1, "text": "Arrangements were completed for trans porting 1,483 Cuban sohool teachers to Har vard University lor a summer course. Tho President issued a commission to Lieutenant General Miles and Major General tjprbio. Both houses of Congress adjourned fortho session, the House having surrendered to the Senate on the nival survey provision of the Naval Appropriation bill, which was the only big Mil still to be disposed of. There was singing ln the House and a lovefeast in the Senate. Orders were issued for ths first squadron of the Sixth Cavalry to proceed to San Francisco for transportation to the Philip pines. Captain Peter C. Doming, convicted of embezzlement, was sentenced to dismissal and a term ln the penitentiary. It was stated that Chairman Hanna will succeed himself as chairman of the Bepubii- can National Committee. Benor Francisco Vasquez, thnew minis ter from San Domingo, presented his cre dentials to President McKinley."}, "highlight": {"text": {"matched_tokens": ["Francisco", "Peter"], "snippet": "to proceed to San <mark>Francisco</mark> for transportation to the Philip pines. Captain <mark>Peter</mark> C. Doming, convicted of"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco", "Peter"], "snippet": "to proceed to San <mark>Francisco</mark> for transportation to the Philip pines. Captain <mark>Peter</mark> C. Doming, convicted of"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [845.75, 435.21, 1019.04, 1626.52], "bbox_id": "e94b613327", "file": "AppomattoxNewspapers_1902-1905a_0030.pdf", "page": 1, "text": "ing poll books to Clerks office ........... Bryant, D. M. do Judge .... Moore, W. R. do do .... Swan, F. W do Clerk .... Spencer, Eugene do do Kid ridge. Itolfe do Judge and tak- . ing poll books to Clerks office....    40 Twyman, 8. H. do and Com- missioner.................................................... 8 w Spencer, J. T. do do .... Gilliam, J. E. do Clerk .... Spencer. A. P. do do  Hooper, U. Y. do Judge and tak ing poll books to Clerks office.....  Woolnridge, B. C. do do and Cum mifflionor. . .................................................. Morris. J. O. do do .................. MoCraw, W. E. do Clerk.................. J Jg 41118, I.eon P. do do ........  100 Dunevant. E. P. do Judge and tak ing poll boons to Clerks office ............. Matthews, Jno. A. do do ................ Bailey, W. E. do do ................. . Farley, J. W. do Clerk .................. Cruto, J. N. do do ....... Smith. W. A. do Judge and tak Ing poll books to Clerks office ....... Bransford, J. T. do .................. Elam, G. T. do .................. Ayres, J. R. do Clerk .................. Thomas. T. H. do do ............... Walden, N. A. do Judge and talk ing poll boc-is to Clerk8 office .............. Farter, J. J. do - Williams, S. E. do  Smith, Julian do Clerk ................... Smith, A. Rolfe do do .........  Srlnson, D. W. do Judge and tak ing polls books to Clerks office............ l.cSueur, L B., Sr. do ................ Wootien, W. H. do .............. Miller, R.H. do Clerk ............... Mann. T. M. do do .................. Harris, B. J. do Judge and tak ing poll books to Clerks office Norvell. T. F. do .................. Tapscoa, Li T. do .................. Tapscott. G. A. do Clerk ............ 1 00 Damron, Jas. W. do do .................... 1 00 Agee, K. B. do Judge and tak ing poll books to Clerks office, Ayres, Jas. E. do .............. Oslin. j. M. do .................. Agee. J. B. do Clerk ............... Ayres, Mayo G. do do .................... El is..W. p., copying registration books, James River D ist ............................ . ........ .Tones. L. D.. rent of room fer registrars and swearing registrars, Francisco Dis. Williams. Lewis, live days service on Electoral Roard........................................ 10 00 Kppes and Snider, one record of voters.. 3 75 Davidson, W. B., rations for Mrs. D. W. Morris. Francisco D ist .......................... 12 00 Harris. J. H., do do Elizabeth Spencer.James River D ist ....................... 8 00 Johnson.C.l.A Bon.dn do Polly Byrantand Martha McFadden, James River Dist ............................. 8 to Jones, P. M rations for Mary Catkins, Nancv Harris, Keziah Jones. Fran cisco Dist................................................... 3 10 Harri88. H.M.. rations for Wash Hocker. Sidney Perkins and Simon Bennett, James River Dist ...................... 6 Anlerson. J. W.  Co., rations for Au  gust us Lee. Francisco Dist. ............ . 4 Garnett, A. C. Sr Son. rations for Peter Adams. Ned Munford and wife and Harriet Gamble, Curdsville Dist ........ 28 patteson. w . I,.. Snpt. Poor, part of salary 1902 and 1908 ............................ ...100 Nowlin.Dr. J. Burton, services rendered in lunacy trials ......................................... 5 Glover. Dr. Perkins. do do prisoners in jail and lunacy trials ........ 11 Worley. S. R.. repairing jaJl... 2 Everett Wnddey Co., st tionery for Clerks office ........ 14 Tanseott. T.. T working t ublic roads. Slate River Dist ...................................... 72 price. Robt H.. am oving fallen trr-ea out of roads, Curdsville Dist ................ 8 00 Moss, W. A.. do do 1 0 Glover, Robert, repairing road. Curds- vllle 1st..................................................... 1 i0 Richardson. Mnyo C.. CommisMoiier of Roads. Dist. No. 2 .................................... 80 fO Pule, Wm building bridge across Plate River, Mayville Dist .................. 46 79 Catlett, J.W ., do. do n Curdsville Dist ................................ 7 75 Dowdy. Thos. E.. do do do 20 00 Moss. P. E.. lumber for bridge, Mays- ville Dist..................................................... 50 17 Hubard, E. W., att- rney fo Corawlth salary from July 1st, 1906, to January 1st, 190ft ........................................................ 200 01 Forbes, P. A., clerk county court allow ance frr-m July 1st, lvo2. to January, 1st, 19o3 ........................................ 200 00 Same, clerk circuit court, allowance from July 1st. 19o2, to Jan. 1st. 19o3.... 50 0C Same, clerk of Board of Supervisors, from July 1st, 19o2, to Jan. 1st 19o8.... 15 00 Same, firewood for clerks office, from July 1st, 19o2, to Jan. 1st, 19o3 ............... 20 00 Williams, Wm., sheriff allowance, from July 1st, 19o2, to Jan. 1st, 19o3............ 200 00 Griffin,Zack,Over8eer of Poor allowance from July 1st, 19o2, Jan. 1st. 19o8, ........ 7 50 Bryant, D. M Overseer of Poor allow- ance for same period................................ 7 60 Pollard. D. E., do do 7 50 Smith, J. W do do 7 50 Atkinson, Robt. do do 7 60 Baber, J. W., do do 7 50 Grigg. P. A., attending Board of Super-  visors one day ............................................  Wood, Allie C do and mileage. 3 80 Forbes, Alex., do do 4 50 Guthrie, Forrest, do do 4 50 The order of the County Court of Bucking ham county entered at the November term, thereof, 19 o 2, deciding that a bridge across James River at Wingina was a public neces sity, and should be built, and ascertain ing and determining the amount of the ex penditure to be made by the county in con structing  id bridge to be 4,ooo.oo was duly certified to he Board of Supervisors ana  eonsidered by said Board. It was then moved  by a member of the Board that no action be I taken at this time on the order of the court, and that the further consideration of th e , question be postponed until the next meet ing of the Boara. On this motion Forrest  Guthrie and Alex. Forbes voted in the affima- tive. and P. A. Grigg and A. C. Wood in the negative. The vote being a tie. Judge Jno. R. Moss being present, voted in the negative. A. C. Wood, supervisor, then offered the fol lowing resolution Resolved, That the Board of Supervisors deem the expenditure of 4.ooo.oo by the county of Buckingham for the purpose of constructing abridge across James River at Wingina. a proper expendl- ture. _ . _ , . . n On this resolution P. A. Grigg and A. C. Wood voted in the affirmative, and Forrest Guthrie and Alexander Forbes in the.nega tive. On motion it is ordered that this action of the Board of Supervisors be certi fied to the county court of this county a t the December term thereof, 19o2. __ On motion of Forrest Guthrie, Supervisor, it is ordered that the usual allowance be made to all the county officers. The account of C. I.Johnson  Son amount ing to 521.81 for road work was not allowed, said account not being endorsed by Judge John R. Moss and Wm. Peile, road commis sioner. -  . . . Ordered that W. L. Patteson, Superintend ent of Poor be allowed floo.oo on his salary. Resolved, That the Board of Supervisors adjourn to the 3rd Monday in this month lor the purpose of examing aud passing upon the reports of the several road surveyors, and that each road surveyor be notified by the clerk or this meeting of the Board. L n j Ordered that the Board adjourn to the 3rd Mondaytin December. 19o2. P. A. Grigg, chairman. A Copyteste P. A. Forbes, clerk. Things We Like Best"}, "highlight": {"text": {"matched_tokens": ["Francisco", "Peter"], "snippet": "Au  gust us Lee. <mark>Francisco</mark> Dist. ............ . 4 Garnett, A. C. Sr Son. rations for <mark>Peter</mark> Adams. Ned Munford and"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco", "Peter"], "snippet": "Au  gust us Lee. <mark>Francisco</mark> Dist. ............ . 4 Garnett, A. C. Sr Son. rations for <mark>Peter</mark> Adams. Ned Munford and"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1451.0, 1022.43, 1565.35, 1042.53], "bbox_id": "3a828fc223", "file": "AppomattoxNewspapers_1974-1975a_0339.pdf", "page": 1, "text": "DRAMA ABOUT PETER FRANCISCO-JULY4"}, "highlight": {"text": {"matched_tokens": ["PETER", "FRANCISCO"], "snippet": "DRAMA ABOUT <mark>PETER</mark> <mark>FRANCISCO</mark>-JULY4"}}, "highlights": [{"field": "text", "matched_tokens": ["PETER", "FRANCISCO"], "snippet": "DRAMA ABOUT <mark>PETER</mark> <mark>FRANCISCO</mark>-JULY4"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1906.79, 924.18, 2055.74, 1070.67], "bbox_id": "8304ab5cb9", "file": "AppomattoxNewspapers_1933-1936a_0091.pdf", "page": 1, "text": "Man Turns Robber l to Pay for Divorce j San FranciscoA ro b b 1 n g  Peter to pay Paul defense failed Harry Schilder In Su perior court here and he must serve one year to life in ban Quentin penitentiary. M Schilder. a baker, told the court that be had hold up  man In order to pay a divorce attorney fees. I had no other way to get the money, he said, and court had ordered me to pay U."}, "highlight": {"text": {"matched_tokens": ["Francisco", "Peter"], "snippet": "for Divorce j San <mark>Francisco</mark>A ro b b 1 n g  <mark>Peter</mark> to pay Paul defense"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco", "Peter"], "snippet": "for Divorce j San <mark>Francisco</mark>A ro b b 1 n g  <mark>Peter</mark> to pay Paul defense"}], "text_match": 1157451436276056185, "text_match_info": {"best_field_score": "2211880697856", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436276056185", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1234.09, 1459.07, 1402.77, 1499.57], "bbox_id": "e90420c739", "file": "AppomattoxNewspapers_1947-1949a_0226.pdf", "page": 1, "text": "Peter Leviis thrilling dramatiza tion of one of San Franciscos weir est mysteries, in the April 18 th issue of"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "<mark>Peter</mark> Leviis thrilling dramatiza tion of one of San <mark>Francisco</mark>s weir est mysteries, in the April 18 th issue of"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "<mark>Peter</mark> Leviis thrilling dramatiza tion of one of San <mark>Francisco</mark>s weir est mysteries, in the April 18 th issue of"}], "text_match": 1157451436007620729, "text_match_info": {"best_field_score": "2211880566784", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436007620729", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [600.96, 364.49, 767.4, 778.63], "bbox_id": "f469a246f1", "file": "AppomattoxNewspapers_1955-1957a_0126.pdf", "page": 1, "text": "and horse decamped from those parts in double quick time, having had glory enough for once in their lives. While living on this farm Peter went to school to Me. Frank Mc- Craw, an old fashioned pedagogue, who, though a very diminutive speci men of humanity, believed in the old time customs and especially in using the rod upon all occasions of disobedience. It is said that on one occasion he ordered Peter to draw his coat, which was promptly done, and Marse Frank gave him a power ful drubbing with a very keen hick ory, for which Peter thanked him with tears in his eyes. But Mr. Franciscos private life was now drawing to a close, for, in consideration of his gallant services in the war, he received the appoint ment of sergeant-at-arms to the Virginia House of Delegates, a po sition in which he served faithfully to the day of his death which occur red in 1833. J Thus ended the life of one of Buckinghams most remarkable men. He was of great stature, of a powerful, muscular frame, and of almost superhuman strength. It is said that when Lafay ette visited Richmond in 1825, the citizens wished to salute him with a cannon in the capitol square, but the cannon was down at Rocketts, and there was no convenient means of hauling it up, so Peter Francis co shouldered it and carried it up. It weighed 1,100 pounds. He was of jovial disposition, full of fun, fond of playing pranks upon"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "hick ory, for which <mark>Peter</mark> thanked him with tears in his eyes. But Mr. <mark>Francisco</mark>s private life was now"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "hick ory, for which <mark>Peter</mark> thanked him with tears in his eyes. But Mr. <mark>Francisco</mark>s private life was now"}], "text_match": 1157451435873403001, "text_match_info": {"best_field_score": "2211880501248", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451435873403001", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1810.16, 262.93, 1975.23, 1373.56], "bbox_id": "aa22069fb3", "file": "AppomattoxNewspapers_1922-1923a_0451.pdf", "page": 1, "text": "with two good looking boys came in the coach and took a seat just be hind the one I was iu, and a friend who was on the same errand as I took a seat just iu front. He and I talked for some time and my curio sity was to know the woman just behind me, and I turned to get better look and to my surprise found a negro woman, who lived within five miles of my home. She and her boys looked so genteel and be haved so nicely the conductor no donbt said, All coons look a like to me. Talking about my city cou sin, walking down the street in one of the principal ones with a dear little fellow five years old- holding my hand, he looked up and said, Uncle V you look like a country hay-seed. By chance I looked in to the mirror and thought the little fellow wasnt far wrong and I never loved him less for commenting on my looks. Eddie Anderson commenced to plant corn a few days ago with a new corn planter, a 13.50 one painted up pretty red, yesterday he left his horse to go a few steps for a bag of guano, and the horse looked back and saw the sun shin- iug on t le red planter and gave one spring and away he went over a five foot fence with planter high in the air, and 30on out of sight down a cart road and through a piece of woods for half a mile, and by some means got unhooked, and ran a few hundred yards farther and stopped. Strange to say but little damage was done to horse or planter. An other piece of advice. Boys dont leave yonr horse hitched. Mr. Henry Chappell closed up James River District assessment yesterday, Joel Elcan finished this, Francisco, district some time ago. Eddie McCraw is home for a few days. He will leave again next week. Miss Lucy McCraw is home after spending the winter in Florida. Mrs. Annie Anderson is on a visit to Crew. Mrs. Mamie and Nannie Ander son are visiting Mrs. W- K. Saund ers today. Mrs. Alice Flood started to see her children in Richmond to-day. Tabernacle meeting, August 18th to 28th. Everybody come. Miss Ellen Steger is still under the care of Dr. Nowlin. Glad to say she is improving. Charley Wingo, the mail carrier from this office to Evergreen, who was thrown from his horse at Ever green last Saturday, is still suffering very much. Dr. Morris replaced his Bhoulder and found several other bones broken. Trouble dont come single hand ed. Monday came orders from the department for his suspension as carrier. A petition is now being circulated for h8 reinstatemsnt as carrier. It is believed be gives en tire satisfaction to a large majority of the patrons on the route. He is a cripple, a poor, but honest man. He has the sympathy of many. Route 1 from this office-has been ordered extended, beginning May 16, from Cattersons Corner up the Pickshin to Peter Goius road, re tracing thence along old route. Sorry to say Mr. T. H. Bryants wife is still sick and has been under the care of the doctor several mouths."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "Joel Elcan finished this, <mark>Francisco</mark>, district some time ago."}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "Joel Elcan finished this, <mark>Francisco</mark>, district some time ago."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [637.89, 541.68, 796.72, 2011.28], "bbox_id": "9d95537482", "file": "AppomattoxNewspapers_1898-1902a_0616.pdf", "page": 1, "text": "W a s h in g t o n , D. C.In this discourse Dr. Talmage urges thoughtfulness for oth ers, and shows how such a benignant spirit may be fostered text, I Peter ii, 8, Be courteous. In an age when bluntness has been ca nonized as a virtue it may be useful to ex tol one of the most beautiful of all the royal family of gracescourtesy. It is graciousness, deference to the wishes of others, good manners, affability, willing ness to deny ourselves somewhat for the advantage of others, urbanity. But what is the use of my defining the grace of cour tesy when we all know so well what it ia? The botanist might say aome very inter- eating things about a rose, and the chem ist might discourse about water or light, but without ever seeing a botanist or a chemist we know what a rose is and what water and light are. Do not take our time in telling us what courtesy is. Only show us how we may get more of it and avoid what are its counterfeits. Mark you, it cannot be put on or dramatized suces fully for a long while. We may. ba ful oJ hows and genuflections, and smiles an? complimentary phrase, and have nothing of genuine courtesy either in our make-up or m our demeanor. A backswoodsman who never saw a drawing room or a danc ing master or a caterer or a fold of drap ery may with his big soul and hard hand and awkward salutation exercise the grace, while one bora under richest upholstery and educated in foreign schools, and both ered to know which of ten garments he will take from a royal wardrobe, may he as barren of the spirit of courtesy as the great Sahara desert is of green meadows and tossing fountains. - Christian courtesy is born in the heart by the power of the Holy Ghost, who has transformed and illumined and glorified ones nature. Mark you, I am speaking of the highest kind of courtesy, which is Christian courtesy. Something like itor dinary politenessmay grow up with us under the direction of intelligent and watchful parentage, but I am not speaking of that which is merely agreeableness of conversation and behavior. All that may be a matter of tutelage and fine surround ing and show itself in lifting the hat to passers-by and in a graceful way of asking about your health and sending the right kind of acceptance when you cannot go and understanding all the laws of prefer ence at table and parlor door, all of which is well. I am speaking of a principle of courtesy so imdanted in ones nature that his suavity of conversation And manner shall be the outburst of what he feels for the happiness aad welfare of others, a principle that will work in the next world as well as in this, and will he as appro priate in the mansions of heaven as in earthly dwelling places. Now, you know as well as I do that some of the most undesirable people have been seeming incarnations of courtesy. In our early American history there arose a man of wonderful talent, an impersonation of all that can charm drawing rooms and cultivated circles. Aged men who knew him in their youth have told me that he was the most irresistible man they ever met, his voice silvery, his smile bewitch ing, his glove immaculate, his eye piercing, his high forehead wreathed in curls, lus attire a fascination. He became Vice-Pres ident of the United States and within one vote of being President. Men threw away their fortunes to help him in his political aspirations and to forward him in a con spiracy to overthrow the Government of the United States, he trying to do in America what Napoleon at that very time was trying to do in Europeestablish a throne for himself. But he was immoral and corrupt. He was the serpent that wound its way into many a domestic par adise. He shot to death one of the great est of Americans  Alexander Hamilton. The world found out long ago before he left it that the offender I speak of was an embodiment of dissoluteness and base am bition. He was the best illustration that I know of the fact that a man may have the appearance of courtesy while within he is all wrong. Absalom, a Bible character, was a speci men of a man of polish outside and of rot- tenness inside. Beautiful, brilliant and with such wealth of hair that when it was cut in each December as a matter of pride he had it weighed, and it weighed 200 shekels. He captured all who came near him. But, oh, what a heart he hadfull of treachery and unfilial spirit and base ness! He was as bad as ne was alluring and charming. . ,. In the famous Athenian Alcibiades his tory discourses of the same splendor of manner covering utter depravity. Noble pedigree, transcendent abilities, radiant personality, eloquent tongue, triumphant warrior, victor at Olympic games, hut a debauchee and an impersonation of all the vices. Alas, that all up and down history and clear on into our day there are so many of what Christ called  wolves in sheeps clothing   whitewashed sepul chers, full of dead mens bond and all un- cleanness! Gilded abominations, walk ing lazerettos, attired in Vermillion and goTd. Perdition hanging out the banners of heaven. As far as possible are they re moved from all genuine courtesy. I like what John Wesley said to a man when their carriages met on the road, The ruffian, knowing Mr. Wesley and dis liking him, did not turn out, but kept the middle of the road. Mr. Wesley cheerfully gave the man all the road, himself riding into the ditch. As they passed each other the ruffian said,  I never turn out for fools, and Mr. Wesley said,  I always do. I like the reproof which a Chinaman in San Francisco gave an American. The American pushed him off the sidewalk untii he fell into the mud. The Chinaman on rising began to brush off the mud and said to the American You Christian me ! heathen. Good-bye. A stranger entered ! a church in one of the cities and was al-  lowed to stand a long while, although thers was plenty of room. No one offered a seat. The stranger after awhile said to one of the brethren, What church is this? The answer was.  Christs church, sir. Is He in? said the stranger. The officer of the church understood what was meant and gave him a seat. We want more cour tesy in places of business, more courtesy in our homes. But heart courtesy must precede hand and head and foot courtesy. Cultivation of it should begin in the fathers house. You often notice that brothers and sisters are often gruff and snappy and say things and do things that they would not hare the outside world know about. Rough things are sometimes said in households which ought never to be said at allteasing and recrimination and fault-finding and harsh criticisms, which will have their echo thirty and forty and fifty years afterward. In the sleet driven by the east wind no sweet flowers of kindness and geniality will grow. Let children hear their parents picking at each other, and those children will be found picking at each other, and far down the road of life will be seen the same dis position to nick at others. Better than this habit of picking at children, which so many parents indulge in, would be one good, healthy application of the rod. Bet ter a shower that lasts a few minutes than the cold drizzle of many days. We never S et over our first home, however many ouses we may have afterward. Uet us all cultivate the grace of Chris tian courtesy by indulging in the habit of praise instead of the habit of blame. There are evils in the world that we must de nounce, and there are men and women who oughc to be chastised, hut never let us allow the opportunity of applauding good deeds pass unimproved. There are two sides to every mans char actera good side and an evil side. The good see only the good and the evil only the evil, and the probability is that a me dium opinion is the right. opinion. Most of the people whom I know are doing about as well as thev can under the cir cumstances. When f see people who are worse than I am, I conclude tnat if I had the same bad influences around me all my life that they have had I would probably have been worse than they now are. The work of reform is the most important work, but many of the reformers, dwell ing on one evil, see nothing but evil, and Ihev set so used to anathema thev forznt"}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "be fostered text, I <mark>Peter</mark> ii, 8, Be courteous."}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "be fostered text, I <mark>Peter</mark> ii, 8, Be courteous."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [770.66, 364.23, 937.71, 675.68], "bbox_id": "1489671369", "file": "AppomattoxNewspapers_1955-1957a_0126.pdf", "page": 1, "text": "unsuspecting people. He was twice married, the last time to a Miss West, a resident of what was formerly a part of Buckingham but now a part of Appomattox. He had several children of both sexes, but not -one of them inherited his great strength, though the girls were said to l predominate in this respect.  A number of histories which touch upon Peters life state that he always believed himself to be Irish, and that Portuguese sailors had kid napped him fTom Ireland in his in fancy. His earliest distinct recollec tions were of his life among Portu guese sailors, and from them he ac quired the name Francisco. He never knew what was the real family name of his parents.  Peter died in Richmond, and his body rests in old Shockoe - Hill Cemetery. Not far from him rest Other Virginia worthies, among them Major Gibbons, an old officer,of the Revolution Chief Justice Marshall and his wife John Hampden Pleas ants, the noted editor of the Rich mond Whig and his brother Hugh Rose Pleasants, long a noted editor of the Richmond Dispatch."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "ac quired the name <mark>Francisco</mark>. He never knew what"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "ac quired the name <mark>Francisco</mark>. He never knew what"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [660.52, 455.13, 824.54, 2006.81], "bbox_id": "a31e8401f9", "file": "AppomattoxNewspapers_1898-1902a_0390.pdf", "page": 1, "text": "Two Mexicans were arrested in New York on the charge of smuggling into this country Borne of the famous jewels once worn by Empress Carlotta. . Henry Villard, the railroad magnate and financier, died at his summer resi dence atDobbs Ferry, in New York State. Captain. Lawrence, M. Murray, who commanded the famous Confederate cniieef Nashville, died at Malden, N. Y. , The wrecked schooner Myra B. Wea ver, -With the bodies of three victims, was found and towed into Vineyard Haven. Thç overdue British steamer Angle sey arrived at San Francisco, having tost a seaman during the storm. The large barn on the farm of David Brandt, near Big Spring, P a , was burned, with all its contents. x Peter Schmitt was killed in Chicago by his wife, whom he had driven to desperation by his conduct. Thè Salt Trust has advanced the price of table salt from 1.10 per 100 pounds to 2.50. Admiral Richard, commanding the French Squadron now in American waters, and his Staff, accompanied by Mr. Thiebàut, the French charge daf faires, called upon the Cabinet officials and the President. The annual report of Treasurer Rob erts shows that the ordinary revenues of the government were the largest in the history of the country. A warship has been ordered tó Morocco to enforce payment ef a United States demand for indemnity. The report of Major General Mac- Arthur shows that during the past year the casualties in the Philippines were 268 killed, 750 wounded and 55 prisoners, while the Filipinos lost 3227 killed, ,694 .wounded and 2864 captured. There, was ,no solution to the mys tery sucroundlng the case of Sally Val entine, coldred, who was found dying -in a little room, in Hulchèrs alley, Richmond!, Va.- Lieutenant de Faraniond, the French naval attache at Washington, has- been making inquiries as .to the value of A merlcin coal, for .usci, ton French war ships,    1 i I Miss Clara Barton, In  a report hn the conditions at Galveston, says that thousands of people -are still homeless and livihfe- in TentS.on the Beach.  W. W. ,Steinbiss. . president o the National,Building Trades Council-, tes tified before the Industrial Commis sion in Washington w    t  .The body of First Lieutenant F. Key Mèade, who died in  the Philippines, was buried in historic Old Chapel, in Clark .county, Va. The jury in New York brought in a verdict for 5000 in favdr of Mowbray, the discharged valet against Howard Gduld. It was reported in New York that Secretary Gagé would hot- be in Presi dent McKinleys next Cabinet.-.  Rev. Ransom Dunn, who was an in structor of President Garfield, died at his home in Scranton, Pennsylvania. Frank May Was shot and killed in Bedford, Pa., by Warren Mills, who did not know the gun was loaded. Gustave Erickson was dragged from his bed and killed by some unknown assassin in Worcester Mass. - Chicago has officially tendered its 34,000,000 drainage canal to the United States government. The number of known victims of the steamer City of Monticellb,  Which, went downiii a gale off Cape Yar mouth, N. S., is 32. There are foqr survivors. Twenty-five corpses, hor-  ribly Wangled by the duri, have been cast ashore. .   Ex-Senator Quay arrived at his win- ter. home in Florida.  He stated that he was certain of 150 votes, on joint ballot in the Pennsylvania Legislature for senator. A collision occurred at a crossing near Omaha between a passenger and a freight train. One passenger was fatally injured aud Engineer Wells Was bàdly cut. The case against 51 Democrats of Johnston county, N. C., for alleged in terference with thé state election in August, has. heen. abandoned by the. government. -    j,  The car baril,  powerhouse and .60 cars of the Norfolk Railway and Elec tric Light Company were destroyed by .fire. The loss is .250,00,0. No light has heen shed upon the motive for the shooting of Samuel Mc- Fetridge in Philadelphia by Miss Anna M. Murray, his fiance. , A visitorto the Willird Home, the orphanage established in Ocean City, N. -, J., by Rev. Dr. Wharton, found the inmates starving..  -,  . ..    James A. Wood fell from a freight train in the Philadelphia and Reading yard? in Shippensburg and his body was cut In two.   - Amos Dice shot and fatally wounded is wife, who had applied for a dl- y.orro, and then cut his throat, at Bucyrus, O. j Henry Lemaire, who  wnhideef- hunting in the Lyon Mountain. N.Y., died during aisnoW 8tdtin from ex posure. i I Thomas Tucker . and C, Willlains vjCte killed ifi accidents, in the ifiPf Jolk Navy Yard. , - v  Eleven families were d,riven,rout of vtheir homes in Jersey City by fire.  -fRos6lvp.FWfSil. Nile- murdered ex press messenger Lane in August, was .sentenced at Marysville, O., to be electrocuted on March 1. . Æfép, El well S.. Otj.8 arrived - a t Çhl- cagij to take coifraÀ of the. DepaHt mbht of the. Lakes.   Elijah Martin aged- 95  years, who was the olst jfean.Jn Wood county W.Wa., is dead. A coal company has beet formed eat Pittsburg with a capital of 10,000,000. The, gymnast am at ihq Uciversiy of Notra Dame, Indiana, was burned Mrs. Selma Coe Kerr, wiiq whs aebi- desttaiiy shot last summer In the AditonflaekS.bY-IhvGhAfles J Dade, of New York, was marriedfim New, YDik, t Charles B. Bailey, of.PBiladelpia. I  A loose car on the. Séâboard Air Line  .striSck a hand car 30 miles from ÇWaw,,.S. -.G.,, and - killed the seption .infister, nàiri,éd Boyd aind two handg. The tonédo-iqat Lawrence was launched at Bfàintree, Mask. Lewis Sunday, agfed 35, Was killed hy a mule at Carlisle,. Pa- Frank Fink, aged 60, of Meçbàniçsburg, Pa., wps killed by a train t   Martin Fry, convicted of murdering his brothmSUMaw, James E. Collins, near Newville, Pa.,-was sentenced to be ltange.d.  , . - . . . It is reported that thè rich Portland gold mine a t Cripple Creek, Colorado -bas béén sold -to an English syndicate fqr 15,000,000 The rebuilt cruiser Atlanta sailed froM New York m t South America to foin Admiral Schleys Squadron. . Mrs. Elisabeth .Gardner, aged 79, committed Suklde In York, Pa."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "sey arrived at San <mark>Francisco</mark>, having tost a seaman"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "sey arrived at San <mark>Francisco</mark>, having tost a seaman"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1462.36, 1451.96, 1537.86, 1554.61], "bbox_id": "9abe17b86f", "file": "AppomattoxNewspapers_1974-1975a_0202.pdf", "page": 1, "text": "torative postage ig Peter Francis- ed March 25. It is cent postage the BiCentennial Contributors to Francisco, the mg Man of the volution, resided at is now Appo-"}, "highlight": {"text": {"matched_tokens": ["Peter", "Francisco"], "snippet": "torative postage ig <mark>Peter</mark> Francis- ed March 25. It is cent postage the BiCentennial Contributors to <mark>Francisco</mark>, the mg Man of the volution, resided at is now Appo-"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter", "Francisco"], "snippet": "torative postage ig <mark>Peter</mark> Francis- ed March 25. It is cent postage the BiCentennial Contributors to <mark>Francisco</mark>, the mg Man of the volution, resided at is now Appo-"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [747.11, 378.66, 910.1, 1688.9], "bbox_id": "f9dc9e2509", "file": "AppomattoxNewspapers_1898-1902a_0528.pdf", "page": 1, "text": "These pensions were granted Virgin ians during the week Ellison Harman- son, Eastville, 6 John McManus, Na tional Military Home, Elizabeth City, 6 John Williams, Waterway, io Gil ead Carter, National Soldiers Home, Elizabeth City, io Woodson Hicker- son, Comorn, io Peter Schwinn, Na tional Soldiers Home, Elizabeth City, 12 Sitty Saunders, Bay View,  13  Frederick Schlee, National Soldiers Home, Elizabeth City, io Joseph Eley, Portsmouth, 6 William Shagerford, National Soldiers Home, Elizabeth City, 6 Christian Binder, National Military Home, Elizabeth City, 8 Allen Redd, Martinsville, 12 George E. Newcomb, Berkley. 8 William H. Pepper, Na tional Soldiers Home, Elizabeth City, 6 Samuel Poole, Broad Creek. 6 Thomas Knock, Temperanceville, 8. The word  Christian will remain in the Virginia Bill of Rights. That was the decision of the committee on the Bill of Rights by a vote of 7 to 4. No sub ject which has been brought to the at tention of the convention, or any other legislative body in this State for the past quarter of a century, has attracted so much attention. From the time Mr. Garland Pollard of Richmond introduc ed his resolution in the convention, pro viding for striking out this word, there has been a perfect storm of protests coming from all parts of the com monwealth. At the meeting of the com mittee of the Methodist and Episcopal Churches Dr. Spooner and Dr. Evans were before the committee to oppose the elimination of the word. Mr. Pollard the author of the resolution, and Rev. Dr. Jones, of the Leigh Street Baptist Church, made forcible speeches in ad vocacy of its omission. Their conten tion was that it at least commended the Christian religion to the people, which the law should not undertake to do. About 3 oclock in the morning fire broke out in a warehouse at Fredericks burg belonging to Capt. S. C. Peyton and the flajnes spread so rapidly that it was soon entirely destroyed. Three new binders, 2 mowers, 25 tons of coal and a lot of hay and oats were also de stroyed, and large hay scales in front of the building badly damaged. The loss is partly covered by insurance. The fire created much excitement, as it was ne.u the Episcopal Female Charity School, the Christian Church, Captain Peytons dwelling and other buildings, but a heavy rain early in the night had so thoroughly wet the roofs that none of them caught. The American Locomotive Associa tion, of which the works in Richmond form a part, has determined to make a strong fight for the trade of Europe and the world. On August 15 this associa tion will start out a general solicitor on a trip around the world for the purpose of interesting capitalists and others. He will carry with him an interpreter whe speaks many languages. This fight i regarded as war upon the Baldwin Works, of Philadelphia, which is not a member of the combination. The strike of the Clifton Laundry girls at Newport News has been practi cally settled. The proprietor promised to look over his books and see if be could raise the wages of the operatives. This is understood to mean that the de mands will be granted. The girls will be unionized, nevertheless. The total value of taxable property in Petersburg for the year 1901 under the new assessment is as follows Personal property,  3 , 933.7551 the tax on this is 69,888. Real estate, 6,724,047, the tax on which is 107,583- A heavy rain and wind storm in Lex ington did considerable damage to crops in that vicinity. A large brick building on Main street was unroofed. The elec tric light plant was injured and every thing is in darkness. Mr. Leroy M. Edwards, the principal of the Bellevue School in Richmond and a well-known educator, is critically ill. Mr. Edwards is a son of the late Dr. John E. Edwards, one of the best-known Methodist divines in Virginia. Mr. Ernest F. Deacon, a graduate of Washington and Lee University, sailed i from San Francisco for Manila, where he will teach in the Government schools for three years. Mr. Deacon is a native of Rockbridge county. The grand jury of the Hustings Court of Petersburg found a present ment against John Hitchcock, a white man, for the murder of Frank McAllis-  ter, an old negro, at the almshouse. William Caruthers, who at one time conducted a school at Fredericksburg, is dead. He was a grandson of Rev. Sam uel B. Wilson, founder of the Freder icksburg Presbyterian Church. Mr. D. Lawrence Groner, of Norfolk, a prominent young lawyer, has an nounced his candidacy for the Lieuten ant-Governorship on the Republican ticket. A walk of vitrified brick is being laid alongside the parade grounds at the Vir ginia Military Institute from the en trance to the cadet barracks. Plans for the new hospital in Win chester have been adopted and the work of construction will begin at an early day. Patrick Reilly, of Woodstock, ied Tuesday, aged 83 years. He was a na tive of Ireland. Four sons and four daughters survive him. J. P. Mausey, for nine years principal in Roanoke, ivas elected principal of Suffolk High School. The Point Flouring Mills, at East Lexington, recently rebuilt and enlarg ed by Moses Bros., will soon be ready for business. At Balcony Falls, at the juncture ot North and James rivers, a number of bears have been seen crossing the mountains. John R. Miley shipped front Rom ney three carloads of export cattle which weighed over 1700 pounds per head. Burglars smashed two plate glasses in Lipmans clothing store in Suffolk and carried off clothing and a small amount of cash."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "Hicker- son, Comorn, io <mark>Peter</mark> Schwinn, Na tional Soldiers"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "Hicker- son, Comorn, io <mark>Peter</mark> Schwinn, Na tional Soldiers"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [811.67, 381.62, 975.03, 1239.91], "bbox_id": "50ca9522b5", "file": "AppomattoxNewspapers_1898-1902a_0079.pdf", "page": 1, "text": "The villa of Mr. Royal Phelps Oarroli, at Newport, B, L, caught fire and the house hold had narrow escapes. Valuable bunt ing troffliles were rained by smoke and water. The war investigating commission ended Its 8onthern trip by hearing spicy testimony about Oblckamauga Camp at Knoxville and Lexingtoq. Bev. Mr. Haase, of Wheeling, W. V a , aided tbe Chicago detectives in establishing a belief that a prisoner now held there on charges of polygamy murdered a Wheel ing woman three years ago. As the result of an exciting corner in beef fa Chicago, Mr. P. D. Armour is said to have dropped muoh money to an opposing syndicate. A Cbieago woman says she believes her husband was murdered in tbe Yukon terri tory, because she bas received conflicting stories regarding him In anonymous com munications mailed iu the gold fields. Mbs Mabel Gordon, youngest daughter of Gen. W. W. Gordon, was married at Savan nah to Hon. Mr. Rowland Leigh, son of Lord Leigh, ot England. The American peace commissioners at Paris formally presented a demand for all tbe Philippine Islands. Delegates to tbe Cuban Assembly at Santa Cruz del Sur are said to be In favor of dis solving the insurgent government and put ting themselves at the disposal ol the United States. A thousand Spanish troops sailed from Cienfuegos for home and 35,000 are to follow them from that port. General Wood, military governor of San tiago, is said to be milking himself popular with all classes. Heavy storms are prevailing on the Onbau coast and fears are expressed for the cruiser Marla Teresa, which Is on her way from Caimancra to Norfolk. A special dispatch from Raleigh, N. C., de scribes tbe eontest in politics there ns the severest ever known iiftbat States his tory, and Is upon the sole Issues of white supremacy. It is stated that South Carolinas Legisla ture will repeal the dispensary law when it meets and probably enaet a local-option measure. Allan D. Chandler was inaugurated Gov ernor of Georgia, and la his inaugural de clared that the South must stand np for Slates rights. Mrs. Cordelia Botkin was formally ar raigned in San Francisco on the charge of murdering Mrs. John P. Dunning, of Dover, Del., and pleaded not guilty. Ensign Arthur L. Willlard, a Maryland naval officer, now on the Maohlas, has re ceived a 100 prize offered by William B. Gaglz, oi New York, to tbe first man who should raise the stars and stripes on Cuban soil ln the Spanish war. Gen. Wesley Merritt and Mrs. Merritt are still in London. Mrs. Merritt, is suffering from typhoid fever. Although her condi tion is not serious her sickness will necessi tate her remaining there for some time. Tim Illinois Supreme Court has sustalne the legality ot State proceedings to compel be Pullman Company to give up many o its enterprises and stick to the business of making, leasing and selling oars. Tbe war investigating commission beard much testimony about bad conditions at Cbickamauga from officers at Anniston, Ala., and then wont to Huntsville. Governor Bussell, of North Carolina, hss Issued a proclamation alleging political out rages in some counties and calling upon armed men who have entered the State to leave at once. In a storm at Chicago the wind blew so trongly as to vibrate tall office buildings to such an  xtent that clocks inside were stopped. Tho schooner St. Peter was sunk during n storm on Lake Ontario just as help was drawing near. The captain was picked up fion the water, but nine others, including bis wife, were drowned. The will of Miss Winnie Davis was filed for probate In New Orleans. It lenves every thing to her mother. Tbe National Council ot Women in ses sion at Omaha, determined to Issue a state- ment showing that Its purposes were differ ent from the General Federation of Womens Clubs."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "ar raigned in San <mark>Francisco</mark> on the charge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "ar raigned in San <mark>Francisco</mark> on the charge of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.71, 916.0, 1645.75, 1625.78], "bbox_id": "f5e8b428db", "file": "AppomattoxNewspapers_1892-1898a_0353.pdf", "page": 1, "text": "The University of California Is to be made richer by 4,000,000 in gifts from various persona, chief among whom is Mrs. Phoebe Hearst, widow of the millionaire Senator from California. ----- By the running away of mine-car on the Midvalley Colliery Rail road, Bhamokin, Peter Gulllck, a miner, was killed, his brains being dashed out against a telegraph .pole. Jobh H. Hublot, Andrew Gerber, James Trewitt and Michael Dutchke laborers, sustained Injuries that may prove fatal. The runaway car crashed into several loaded cars at the foot of a steep decline. ----- The joint seleot committee created at the last session of Congress to Investigate and report upon the question of the use of alco hol free of tax in the manufacture and arts will assemble In Washington soon after the middle of November for the purpose of form- glatlng a report to Congress. This will bo accompanied by the draft of a law which Will place domestic Industries on as favor able a basis as similar industries in foreigp countries. During their sessions In Wash ington hearings will probably be given in order to supplement the information obtained through Interrogatories to be sent out ----- Tbe call for the next annual Farmers National Congress was Issued by President H F. Clayton, of Indianola, Iona, and Sec retary John M. Stahl, of Chicago The con gress will be held at Indianapolis, Ind., November 10-13, The regular delegates from each State are one from each congres sional district and two at large, appointed by the Governor. The heads of all agricul tural colleges and State agricultural boards are members of the congress by virtue of their offices. The British steamer Alene, Captain Zeid- jrs, which arrived from Port Llmon at New York, brought Capt Chas F. Bunker and six of the orew of the Boston steamer F. T. Driskow, whioh was dismasted in the hurri cane which swept over the North Atlantic on O.tober 11 and was abandoned almost water logged on October 25 iu latitude 32 degrees 15 minutes, longitude 75 degrees 50 minutes, when the Alenes boat took off the orew. The whaling bark John Winthroj has re turned to the port of San Francisco after an absence of thirty-one months, during tbe greater portion of which time she was with in the Arctic clrole. There Is not a barrel of oil ln her hold or a pound of whalebone, and Captain A. T. Simmons logbook shows only hard look. ----- In the United States Court of Appeals at BL Paul opinion was rendered by Judge Sanborn In the case of the Adams Electric Railway Company against the Ltu- dell Railway Company, of SL Louis. The court bolds that the Sprague electric motor Is not an Infringement ----- Judge James W. Locke, in the United States Court, at Jack sonville, Fla., ordered a postponement of tbe sale of the Jacksonville, Tampa and Key West Railway until the first Monday in Marob, 1997. The sale was to have taken place November 2, but the complainant, tho Pennsylvania Company, for insurance on Uvea and granting annuities, petitioned for the change on account of the disordered condition of the money market ----- Eleva tors A and B, of the Paoifle Elevator Com pany, at the Intersection of Hines street and the North Branch of the Chicago river, were destroyed by fire. The loss Is about 1,000,009."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "Colliery Rail road, Bhamokin, <mark>Peter</mark> Gulllck, a miner, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "Colliery Rail road, Bhamokin, <mark>Peter</mark> Gulllck, a miner, was"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [357.58, 304.25, 513.24, 1188.95], "bbox_id": "db28442355", "file": "AppomattoxNewspapers_1902-1905a_0304.pdf", "page": 1, "text": "The charges of heresy against the Garrett Biblical Institute and the Boston School of T heology caused a lively debate at the M ethodist Gen eral Conference, in Los Angeles, Cal. The Southern Baptist Convention opened at Nashville, Tenn., with nearly 2,000 delegates present. Gov ernor Eagle, of Alabam a, was elected president tor the third time. An explosion of sawdust in the furnace of the D ay Lum ber Com  panys mill, in Portland, Ore., started a fire which destroyed property valued at 250,000. Charles Stratton, a form er police man at Seaside Highlands, was shot and killed by George  asso n , an ar tilleryman of the Fort H ancock gar rison. Fire started from burning leaves at the Silver Lake Assem bly grounds, at Perry, N. Y., and in a short time 16 cottages were destroyed. By an explosion of gas in the Lacka wanna Coal Companys No. 3 Mine, near Vintondale, Pa., three men were instantly killed. Edward F. Shaw, postm aster in Three Rivers, Mass., was arrested for the alleged embezzlement of 1,500. W hitney, Pousland  Co., the lead ing commission firm of Boston, filed a voluntary petition in bankruptcy. James Gray Thom as, a prominent physician and surgeon of Mobile, Ala., died there, aged 69 years. Everett Abbott, form er treasurer of the American Marine Transportation Company of Boston, who left that city on March 15, was arrested in San Francisco on a charge of having embezzled from his em ployers 5,852. The committee on state of the church has decided to recommend to the Methodist General Conference a relaxation in the present prohibition of certain amusements. T w o officers and 15 enlisted men of Company F, Seventeenth Infantry, which was ambuscaded by the Moros in the Philippines, were killed. The nominating committee has de cided on Judge George Gray, of Del aware, as president of the National Civic Federation. The body of Josephine M cCahill, the abducted child, was found near the top of the chimney of her home, in New York. Fire destroyed a Canadian Pacific grain elevator at Fort W illiam , Ont. The loss is estimated at 250,000. It was officially announced that the New Y ork Central Railroad would is sue a 50,000,000 loan. The Indiana State Convention in structed its delegates for Parker and adopted the unit rule. I h e sensational libel suit brought by R. S. Siever against Sir James Duke was concluded in London with a verdictTor Sir James, the cost being assessed on the plantiff.  Miss Bell Crane, of Decatur, G., told consul General Gowdy, in Paris, that she had been locked up by a man who took her out automibile riding. In the Reichstag, the arm y govern ment was censured for dism issing three members of the court-martial that had tried Lieutenant Biltse. The government of France has made M. Philippe Bunau-Varilla an officer of the Legion of Honor. Members of the W hite party have blown up two railroad bridges, which were poorly guarded, a short distance from Montevideo, Uruguay. K ing Peter of Servia has emphatic ally declared that he will not abdicate the Servian throne. There was a riot at Chinkiang. The mob burned the quarters of the new police force. , The Chilian government has sold two cruisers to Charles R. Flint, of New York. There was a strike of journeymen bakers in Berlin. The charges of heresy which have been made against high church offi cials are destined to provoke a spirited debate at the M ethodist Gen eral Conference. George M. Porteons, who intro duced the bertillon system in the United States, has been arrested at Chicago, charged with embezzlement. The sixth biennial convention of the International Brotherhood of L o comotive Engineers assembled at Los Angeles."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "was arrested in San <mark>Francisco</mark> on a charge of"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "was arrested in San <mark>Francisco</mark> on a charge of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [321.6, 1525.51, 476.05, 1654.26], "bbox_id": "bee875ecbf", "file": "AppomattoxNewspapers_1902-1905a_0389.pdf", "page": 1, "text": "The anointing of King Peter of Servia was performed at Zicha with great ceremony. The steamer Mineola, owned by the Pacific Improvement Company of San Francisco, which had taken to Siberia supplies for the Russian Army and was returning with a cargo of valuable furs, was wrecked on a reef. Three shells exploded in Fort St. Marie, at Calloo, Belgium, and n sol diers were killed and many injured. Mont Pelee, on the Island of Mar tinique, is in eruption again, but thus far no damage has been done."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "The anointing of King <mark>Peter</mark> of Servia was performed"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "The anointing of King <mark>Peter</mark> of Servia was performed"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [332.65, 254.67, 520.03, 1680.56], "bbox_id": "f8c8122608", "file": "AppomattoxNewspapers_1892-1898a_0416.pdf", "page": 1, "text": "The advance statem ent furnished the Treasury Department by Collector of Customs L. P. Stearns, at Newport News, shows the total value of exports during the month of May to be 2,104,201, which is considered a most favorable showing. During the month 2,335 head of cattle were exported. The grain exportations were lighter than usual, only 88,419 bushels of corn and 30,000 bushels of oats being taken for foreign ports. The exports are divided as follows Bread- stuffs. 850,053 meat and meat products, 431,698. At a special meeting of the board of directors of the Business Mens Association, of Newport News, a committee, composed of W. B. Vest, Robert P. Orr, R. G. Blackford, J. A. Htrshberg and Elias Peyser, was ap pointed to take such action as It might deem advisable toward securlpg the passage of the bill now before Congress appropriating  100.000 for the erection of a government building in th at city. At a special meeting of the common council, a sim ilar committee was appointed. Justice B. C. Fitzhue, at Fredericksburg, issued a w arrant for Wm. Stratton, of Stafford county, who, it Is alleged, had threatened the lives of Joseph Bakers family, and deputized John Bowling, to make the arrest. Bowling m et Stratton near Bakers house. Baker saw the two men and mounted his horse to go to Bowlings assist ance. In doing so his pistol was discharged, and Stratton, thinking the shot Intended for him, returned the fire. Several shots wore exchanged, bnt by dodging behind trees both men escaped Injury. Stratton finally mado his escape, and having taken the warrant to look at it carried th at with him, and Bowling returned without his prisoner. Stratton Is a suitor for the hand of Bakers  daughter. The safe In the Southern Railroad and Express office at Woodstock was cracked and emptied of Its contents. An entrance was effected by breaking a glass and turning a window-catch. Tho door of the safe was completely blown asunder, and about 15 was all the burglar got for his trouble. When Agent Chapman arrived at the station he found everything In confusion and burnt powder nil over the office. Jamee G. Bucker, who has been connected with tobacco warehouses In Lynchburg for m any years, was killed on the Norfolk and Western tracks. A freight train was stand ing at the crossing, at Amherst bridge when Mr. Bucker undertook to climb between two of the cars. Just as he got his foot on the bum per the train started and he was throw n to the track and one wheel passed over him and he was dragged some distance. He lived only a few minutes. He was nearly sixty years old and leaves a wife and six children. Peter Peoples, who was in a small boat fishing on the flats off Newport News, was run Into by a barge which was In tow of the Chesapeake and Ohio tug Hinton, and thrown Into the water. He sank from sight at once and nothing more was seen of him. At a recent meeting of the directors of the  Morgans Orove fair, Shepherdstown, W. Va., It was resolved to charge 25 cents ad mission to the exhibition this year, the ln- I crease being made necessary by the growing needs of the association and the desire to provide additional attractions. The sales of leaf tobacco In Danville from October 1 to May 1, Inclusive, were 35,848,340 pounds. Bales for tho same period of tho last tobacco year, 30,129,133 pounds. In crease during tho eight months of the pres ent tobacco year over last year, 6,714,202. Mr. Joseph Seffrles, a well-known citizen of Fauquier county, died last week, aged eighty-one years. R. Lee Hoffman, who a few days ago went to Newport News from Roanoke to establish a drug store, was found dead in the rear part of the establishment he had fitted up and which his  dodgers had announced would be open on June 1. When found It was evident that tho deceased bod teen dead for several hours, If not days. Near him was a half-filled bottle of chloroform. Mr. Hoff man was about thirty years of ago and leaves a young wife, whom he recently married. The deceased was at one time engaged In the drug business In Roanoke, where he hod ns a partner, Wm. F. Kaufman, whose body was found floating in the river. It was said at the time that ho had been drowned by the upsetting of a boat. Rev. A. J. Fristoe, pastor of the Second Baptist Church, of Petersburg, has received an Invitation from Rev. H. M. W harton, of Baltimore, inviting him to join him in his evangelistic work, and also to represent Luray College for Young Ladies, of which Mr. W harton is president. Mrs. Elizabeth Baker, widow of the late Isaac Baker, died at her home In Winchester after a lingering illness, aged fifty-nine years. A son and four daughters survive her. Jam es Henson, a large land owner and grazer of Russel1 county, was found dead In White Horse Cove at the bottom of a 200-foot precipice. His horse was found grazing at the top. He lived In Hensonvllle, was eighty- seven years of age, was worth at least a tenth of a million and leaves a large family. The jury In tho case of Mrs. E dna Hyer against the city of Staunton for damages for loss of a house in the flood of last fall could not agree and were discharged. The sales of leal tobacco in tho Lynchburg warehouses since October 1, aggregate 20,- 972,400 pounds, an Increase of 4,639,300 com- pared with previous year. Stonewall Jackson Camp, Sons of Confed- erate Veterans, has been organized In Btaun- ton. John Baldwin Ranson was elected cap tain. Dr. William Rives Patton, son of Col. John M. Patton, of Albemarle county, died a few days ago in San Francisco, Cal. Hancock A Myers, grocers, of Lynchburg, have made an assignment. Liabilities about 3,400. One of the most notable plants ever estab lished in Alexandria tvas offered for sale at auction Monday. The Cleveland Shipbuild ing Company having secured a degree against tho Haskins Wood Vulcanizing Com- puny, or the sale of their real estate to pay their debts the commissioners offered at auction tho ground comprised within the square bounded by Wolfe, Wilkes and Union streets and tbo rotom ao river, upon which are situated the tanks, boilers, condensers, air-heaters, Ac., said to have oost Over  100,000, the plant being an Immense one. This land comprises the area formerly occu pied by the locomotive works of Smith A Perkins, tho Alexander Brewery of Irwin A Co. and Hunters ship-yard. As the Pioneer Mills was owned by the Hoskins Company-, it was included iu the decree of sale. The Haskins vulcanizing lots and plant sold for 26,009 to Mr. Enoch White, trustee, and the Pioneer Mills for 2,100 to Charles Norment, ot Washington, trustee. These trustees, it is understood, represent syndicates having in terests connected with the property. At Marion. W. D. Wllmore, a popular citizen, was shot and perhaps fatally wounded by. an unknown man supposed to be de ranged. Tho stranger arrived in the town only a few minutes prior to tho shooting, having eomo from Max-Meadows. He was arrested."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "wife and six children. <mark>Peter</mark> Peoples, who was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "wife and six children. <mark>Peter</mark> Peoples, who was in"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [830.4, 1679.52, 986.17, 1798.69], "bbox_id": "d212fb0e86", "file": "AppomattoxNewspapers_1898-1902a_0133.pdf", "page": 1, "text": "Th highwaymen tied Mr. Peter to fence, jumped into hi. wagon nd drov. mile up the mountain road, where they hitched the home. - Hn. Peter to the meantime released her husband. They oon found their team and returned home ___ __________ Troop Off For M anila. San Francisco, Cal., 8PsR transports Seandia and Morgan City m UJ4 for ManllA On hoard the Seandia were tho Second and Third Battalion of the Twen tieth United Bute Infantry, from Fort Leavenworth. _________ ____"}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "Th highwaymen tied Mr. <mark>Peter</mark> to fence, jumped into"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "Th highwaymen tied Mr. <mark>Peter</mark> to fence, jumped into"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [563.5, 801.24, 701.86, 874.54], "bbox_id": "8fd2ba3ba4", "file": "AppomattoxNewspapers_1902-1905a_0169.pdf", "page": 1, "text": "son. Polly Watkins, Mary Harris, and Kizzie Jones, Francisco district ........ I Harris, H. M., rations for Wash. Hook er and Simou Bennett, James Blver district............................................  Lewis, J. H., rations for Salina Borrow, Doriuda Borrow, and Mary Webb, iu James-Kiver district ............ ........... I Garnet, A. C., c., rations ior Ned Muu ford, Harriet Gamble, Peter Adams, Tenor Kichardson and wife. Curds Ue district........"}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "Harris, and Kizzie Jones, <mark>Francisco</mark> district ........ I Harris, H."}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "Harris, and Kizzie Jones, <mark>Francisco</mark> district ........ I Harris, H."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1204.29, 847.63, 1339.44, 1274.72], "bbox_id": "9b1c19ab8c", "file": "AppomattoxNewspapers_1922-1923a_0291.pdf", "page": 1, "text": "Several  battalions ot Kata sacks have been disbanded. Cities in New Mexico and El Tex., were shaken by earthqual An incipient mutiny cccurrc the fortress of Saints Peter and J in St. Petersburg. Complaints of favoritism andf competency are being made 1 distributors of San Francisco 1 funds. Three aldermen of New Roci N. Y., surrendered and were 1 bail to answer charges of attenf bribery. Conditions in Russia are appa ly growing worse members of liament are campaigning amongi peasants. The National Convention of Posters in session at Chicago bai from the billboards pictures of in whatever form. Advices from Rio Janeiro said the rebellion in Matto Gross practically over and that no f trouble was expected. The coroners jury at Salis brought in a verdict that the of the Plymouth express, on Ji was due to high seepd. B. F. Yoakum outlines the ft, of the St. Louis, Brownsville i Mexico Railway as the longest grade line in the country. The Navy Department mends an international agree requiring wireless telegraph s to exchange messages at sea. President Roosevelt offered Marblehead as a neutral ground peace negotiations between mala, Salvador and Honduras. Counsel for both sides ini Hartje divoroe case were severe buked by the trial judge for i ing too much sensationalism the trial."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "the fortress of Saints <mark>Peter</mark> and J in St."}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "the fortress of Saints <mark>Peter</mark> and J in St."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [863.47, 246.43, 1026.46, 1237.73], "bbox_id": "ccabb1badc", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "principles. Mr. Hnbard warmed up his auditors and stirred them to en thusiasm. He was also the recipient of a handsome bouquet. The same resolutions offered in the senatorial convention were then adopted, after which the convention adjourned. The conventions were largely at tended, aud many ladies graced them with their presence. After the conventions adjourned the Comity Committee was called together bv Chairman Pratt. As it now stands, the committee for the several districts is as follows MarshallA. J. Terrill, chair man  no new members. James-RiverW. S. Ellis, chair man  W. R. Moore, E. M. Miles. Slate-RiverWilliam Williams, chairman M. L. A. Moseley, F. L. Agee. FrancDcoE. C. Wooldridge, chairman J. H. OBrien, W. C, Chappel. MaysvilleW. E. Pratt, chair man  Wm. Peal, Wilev Haskins. CurasvilleE. W. Hubard, chair man  Jeff. Davis, H. M. White. Judge Hall, who was a candidate for the nomination, would not allow his name to go before the conven tion Mr. Hebditch, who was also a candidate for the nomination, was not present so both nominations were made by acclamation. The party appears to he in good shape for a grand victory, and little importance is attached to rumors of an independent. Peter Saunders, the old ferryman at Wingina, accidentally shot and killed a woman thereon Friday last, Both are colored people. Peter has not been arrested, and it is not cer tain that he will he, as there seems to he no doubt that the killing was accidental. Mr. Samuel Lewellen, who resides near Mt. Vinco, has a son who was shot hy a negro while Mr. Lewellen us attempting tc arrest the latter, The negro resembled a fugitive from justice for whom Mr. Lewellen had t warrant. When the attempt was made to arrest him, the negro fired on Mr. Lewellen. The affair hap pened on Sunday night, while young .Mr. Lewellen was returning from church. Dr. Boudurant extracted the bullet, and the wounded man is doing well. The negro is at latge. The Buckingham County School- hoard held an interesting meeting, and, among other things, adopted the following Salaries of teachejs, 15, 20, and 25, according to grade of certificate, Every public school teacher in the countv was given a years subscrip tion to the Virginia School Journal Schools will open October 9. The district boards will shortly meet to appoint teachers and to ar range for tne graded schools. By a fire on Thursday last John Kinloch lost everything that he had He lived on T. J. Appersons place, near Alpha. Mr. John Eldridgeisan applicant to snceed the late J. T. Moorman as road overseer in Francisco district. No court business was transacted, his Honor Judge Moss, who is not well, giving politics right f way, There are several seduction cases set for the term, which will be tried some day this week. A C orrection . Last week our Slate-River correspondent fell inti error in stating that Dr. Nash assist ed in the operation performed upon John Chambers. It was Drs. Now- lit, Bondurant, and Winfrev."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "rumors of an independent. <mark>Peter</mark> Saunders, the old ferryman"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "rumors of an independent. <mark>Peter</mark> Saunders, the old ferryman"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [782.14, 1795.03, 942.34, 2011.42], "bbox_id": "d36464a789", "file": "AppomattoxNewspapers_1898-1902a_0526.pdf", "page": 1, "text": "now a part of Appomattox, fie had several children of both sexes, but not one of them inherited his great strength, though the girls were said to predominate in this respect. A number of  historjes whjch touch upon Peters life state that he always believed himself to be Irish, and that Portuguese sailors had kid napped him from Ireland in his in fancy. His earliest distinct recol lections were of his life among Por tuguese sailors, aud from them he acquired the name of Francisco. He pever knew what was the real fapii ily name of his parents, f Peter died in Richmond, ami his body rests in old Shockocrllill Cem etery, Not far from him rest other"}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "acquired the name of <mark>Francisco</mark>. He pever knew what"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "acquired the name of <mark>Francisco</mark>. He pever knew what"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [645.36, 414.48, 809.31, 1972.42], "bbox_id": "726315f23d", "file": "AppomattoxNewspapers_1898-1902a_0163.pdf", "page": 1, "text": "Io an altercation st Tappabannock Capt, A. F. Bagby hot Mr. George It. Soott In the arm. The smallpox Is fait disappearing from Alexandria, Va., and the Inspection of boats and cart between that city am Washington baa bean discontinued. Rev. E. T. Wellford. of Newport News, V 311 a fourth eall to the Pres- byte 1 Th, at Texsrcana, Texas. InA jíjí jicounty, W. Va., Frank M. Simon, e  a n ic k It rich In Klondike, was marriedT o MI ss Franoes Simon, his flfteen- year-old cousin. Reports to the West Virginia boar! of agrleulture show that all crops were badly damaged by tbe cold weather In February. It Is estimated 90 per cent, of the peaches were killed. A large plant for the manufacture of doors, cash, etc., Is to be removed from Os wego, N. Y., to Keyser, W. Va. Mrs. Martha Place was electrocuted at Sing Sing for tbe murder of her stepdaugh ter, Ida Place, being the first woman in New York to suffer death In tbe eiectrio chair. President McKinley, Vice-President Ho bart and Senator Hanna went to Jekyl Is land, Ga., where Speaker Reed is also a guost. Two men were killed at Laredo, Texas, In a tight with Mexicans, wbo resisted meas ures takep to stop tbe spread of smallpox. Tbe Brook lawn Hotel, at Cleveland, Ohio, was partly destroyed by fire, fifty guests es caping without Injury. The funeral of Mayor Patrlok Welsh, of Augusta, took place with imposing cere monies. Herbert Putnam, librarian of tbe Boston public library, 111 accept the appointment as librarian of Congress. Dr. Oliver Marcy, dean of the Northwest ern University, Chicago, and professor of natural bistory in that institution, died at his home, in Evanston, after a long Illness, aged seventy-nine. Joseph Nefmeth, of Wilkes-Barre, Pa., has confessed to having murdered John Giveon- ouskl, who was struck on the head by a stone while returning from a political meet ing at Durlca, in 1896. - The passenger train on the Cheyenne and Northern, which has been stalled for a month near.Iron Mountain, Wyo., with a number of passengers, has been released from its prison In tbe snow. The auxiliary cruiser Dixie arrived at New York to be fitted out as an army trans port, with accommodations for about 1,000 men. As soon as tbe necessary alterations ure completed she will sail for Manila. News has reached S eattle, Wash., that five Finlanders say they have discovered evi dences of tbe origin of the Russian bound ary line Inscribed in a series of old mounds, wbiob, if established, will place the Klon dike country within tbe United States. A now satellite of tbe Planet Saturn has been discovered by Prof. William H. Bicker ing at tbe Harvard observatory, Cambridge, Mass. The last disaovery among the satel lites of Saturn was made in September, 1818, by Professor George P. Rond, at that time director of tbe Harvard College Observatory. Tbe American steamer Mariposa, Capt. Hayward, has sailed from Sydney, N. 8 . W., lor San Francisco, having on board  1 , 000 ,- 000 in gold. Tbe town of Woodlawn near Birmingham, Ala., was visited by a severe windstorm, and a church and several dwellings were dam aged. Judge Walter C. Ong, of the Common Pleas Court of Cleveland, Ohio, filed a peti tion in voluntary bankruptcy lu the United States Circuit Cour His liabilities are placed at 35,000. Assets are given at 29,000. The Japanese cruiser Chitóse will salí from San Francisco for Yokohama this week. Tbe report that she has met with sev eral mishaps to her machinery since being turned over to her Japanese crew, Is denied by ber engineers. Two members of the Syracuse N. Y. Fire Department were severely Injured while working at a fire. They were Captain Geo. T. Sbean and Lndderman Patrick Dee. A little later Charles Brooker, driver for the Assistant Chief, collided with a mail wagon and was badly injured. Reports from White Books Agency, in Utah are to tbe effect that the Indian leaders there are restless, and very serious trouble Is anticipated by Indian Agent Myton, by reason of the fact that the men who control the chiefs desire to return to the former res ervation in Colorado. A run was started on tbe Cincinnati. Sav ings Society without apparent cause, which was promptly met by tbe payment of all checks presented, the officers of the bank at tributing tbe run to the malice of a deposi tor wbo had a dispute in settling his ac count, and wbo threatened to get even. Residents of tbe mining town of Hayden Hill, Lassen eonnty, in the extreme north eastern portion of California, are greatly ex cited over an exceedingly rich strike of gold ore, tbe vein being about fifteen lnobes wide, bout twenty-nine feet from tbe surface, and said to prospect from 7,000 to 12,000 per ton. The machine twist manufacturers of New York have voted a further advance of 10 per cent, in tbe prices ol their products. Pate Jones was shot and killed at Elkton, Ky., and Will Grn was wounded In a fight between Jones, his son, Charlie, and Will Gray, three countrymen and the city po lice. Tbe Appellate Court at Chicago, unani mously sustained the decision rendered by Judge Tnley last summer that express com-, panics are obliged to furnish war revenue stamps to all shippers.  Tbe United States refrigerating steamer Glacier was put in commission at the Brook lyn Navy Yard, and was placed in dry dock No. 2 to have her hull scraped and painted preparatory to her being fitted ont for her voyage to Manila. Thrasher Meade, tbe notorious negro.trnin robber, safe blower and bandit, has been sentenced in. tbe United States Court at Mar idan, Miss., to twenty years In the Federal penitentiary. In passing sentence Judge Niles expressed regret that ha conld not un der the law sentence Meade to death. , Tbe Mayor and health officials of Los Angeles, Cul., have issued a statement re garding the sinaC-pox situation In that city that there have been seventy-six cases since tbe first appearance of tbe disease In Sep tember, and there are now 11 caaes and 33 convalescents under quarantine Peter D. Lark, for many years captain of the private polioe of Greenwood Cemetery, New York, committed suicide at his borne in the cemetery ground. In Detroit George J. Mink, aged 10, was stabbed under the left shoulder blade by Xavier Glombln, a 12-year-old boy, wbo, it seems, started a quarrel with him, the knife penetrating a lungt with probable iatal re sults. The Esparanxa. mine at El Oro, one of tbo famous mines In Mexico, has been bonded io an English syndicate, which pots up 1,000,- 000 forfeit money. Tbe price of the mine is fixed at 3,000,100, gold, and tho option ex pires on April 25. For the murder ol Charles Haynes, Robert Lewis was banged at Atlanta, G a , on tbs gallows built by him two yean ago when employed as a workman. A rich gold strifce is reported to have been made on Granite Creek, near Alblnl, on tbo wSt coast of Vancouver Islands. Assays show 5,8.0 to tbo ton. Jamas Patterson, a well-known character, and prominent In local politics In Cincin nati, woe fatally shot by James DePugb, a lookout at one of tho gambling establish ments In that city. Patterson was standing at hie front door with his wife when pe Pugh fired five times at him. The fats wound is in the abdomen. Mrs. Patterson 7raMlqtl!bWJJ"}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "8 . W., lor San <mark>Francisco</mark>, having on board  1"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "8 . W., lor San <mark>Francisco</mark>, having on board  1"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [767.75, 457.68, 929.43, 2008.68], "bbox_id": "eaa0837617", "file": "AppomattoxNewspapers_1898-1902a_0517.pdf", "page": 1, "text": "Governor Oates, in the Alabama Con stitutional Convention, denounced the bribing of grand juries, declaring that if a man had money or friends he was insured against action by a grand jiry if he had killed a negro. The Cleveland court granted a tem porary injunction enjoining the strik ing employees of the Cle.-elan 1 Punch and Shear Company from patrolling or picketing the works of- the company. Edward Park Deacon, member of a prominent Boston family, who shot and killed Emile Abeille in Mrs. Deacons apartments in Paris some years ago, died in Boston of brain trouble. _ The nominating committee decided to recommend John O. Billings, of the New York Library, for president of the American Library Association. Ex-Governor Pingree, of Michigan, was buried in Detroit with official hon ors, a large number being present to pay their tribute. Herbert Massey was killed and sev eral others knocked unconscious by lightning near Winchester, Va., during the storm. The cruiser Newark, with Captain McCalla on board, arrived at New York from Hongkong. All the independent iron and steel companies in Pittsurg have signed the Amalgamated scale. Peter Tidman cut his wifes throat and killed himself at hi3 ranch near Elsi- nora, Cal. Mother Jones is now engaged in or ganizing servant girls unions in Chi cago. President Shaffer, of the Amalgamat ed Association, said he would not hesi tate to order a general tie-up of the United States Steel Corporation plants, if necessary, but he believed the trouble would be settled without such action. In Porto Rico and in Cuba the Fourth was celebrated. There was an excursion to the wrecks of the Spanish ships at Santiago, and an oration was delivered by a loyal Spaniard on the wreck of the Almirante Oquendo. The Morgan interests are said to have secured the Northern Pacifie Steamship Company and the Washington and Alaska Company, which gives them a belt line around the world. Colonel Julian Scott, the artist, who served during the Civil War on the staff of General  Baldy Smith, died at his home in Plainfield, N. J. John R. G. Pitkin, former postmaster of New Orleans and prominent in Loui siana politics in reconstruction days, died in New Orleans. Mrs. Emma Ryley, of Newark, N. J., while seated at a window, was shot and killed by a piece of lead fired from a toy cannon. Postmaster General Smith has decided upon a stricter enforcement of the law bearing upon the sendingof second-class mail matter. The body of John Edwards, a farmer, was found in a cavern on his premises, near Stouchsburg, Pa. He had been murdered. The robbers who held up the Great Northern express train near _ Malta, Mont., secured 40,000 in cash in addi tion to securities. The delegates from King George coun ty, Va., were instructed to cast their votes for Montague, Williard and Jef feries. Sergeant Albert Johnson killed Ser geant Thos. Spaulding at the Columbus Barracks and then committed suicide. The dressed beef storage warehouse of A. A. Jewett  Co., in Philadelphia, was destroyed by fire loss 300,000. Professor John Fiske, of Cambridge, Mass., historian and lecturer, died from the effects of the heat. The new waterworks system in Wood- stock, Va., was inaugurated and two new hotels opened. Six bags of gold, containing 30,000, have disappeared from the branch mint in San Francisco. Three persons were drowned while rowing on the river at Walbridge Park, in Toledo. Ashton W. Graves was married in Newport News, Va., to Miss Marietta Holmes. _ . . . Martin Miller was killed by lightning near Wheeling, W. Va. foreign. - The British cruisers Minerva and Hyacinth sailed for Gibraltar for the purpose of testing the respective merits of the Belleville and Scotch boilers, about which there is so much controver sy in British naval circles. It is reported that President Kruger is being urged to notify the powers that unless they intervene he will issue let ters of marque. Mr. Kruger has here tofore declined to entertain the propo sition. The University of Pennsylvania crew was entertained by the Mayor and Cor poration at Henley and subsequently left for Dublin, where they will race the Dublin crew. A dispatch front Liverpool says the officials of the British Salt Union are considering an arrangement with the American Salt Trust. The Dowager Empress Frederick of j Germany, who has been an invalid for some time, has been suffering greatly of late. I The Waldeck-Rousseau ministry of ! France is certain to beat the record of French cabinets in length of service. As a result of the differences between I the United States and the Russian gov ernment on the sugar duties an offer from American interests of 40,000,000 to construct the Viatka Railroad, condi tional that a certain proportion of American materials be used, was turned down by the Russian government. There were 500 guests at the banquet of the American Society in I-ondon. Every part of the British empire was represented. Speeches were made by Ambassador Choate, Robert Hanbury, Dr. Joseph Parker and others. The list of victims of the Leipziger Bank failure increases. A clergyman has become insane from losing all his money. The Cassel Grain Drying Company made an assignment as result of the banks failure. At the annual banquet of the American Chamber of Commerce in Paris General Porter, Chauncey Depew and J. W. Alexander, of New York, were among the speakers. The Filipino delegates handed to the Nuncio in Madrid an address to the Pope demanding that the clergy in the Philippines be selected from the native clergy. An officer and two sailors were killed and17 men injured by the explosion of a torpedo at Cadiz, Spain . The failure of the Kharkoff Commer cial Bank caused a financial- panic in Southern Russia. ______ Financial. Samuel Rea, fourth vice-president of the Pennsylvania Railroad Company, has been elected a director of the Balti more and Ohio. It is estimated that the American Lin seed, by maintaining the new price, can show earnings of 20 per cent, on the common stock. The output of gold in Cripple Creek district, Colorado, for six months ending June 30, 1901, was 12,583.900, making a total since 1891 of 104,365,210. A street dispatch says that unless more rain falls soon there will be a great reduction in the corn crop except i in Illinois, Nebraska and Iowa."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "signed the Amalgamated scale. <mark>Peter</mark> Tidman cut his wifes"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "signed the Amalgamated scale. <mark>Peter</mark> Tidman cut his wifes"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [425.99, 351.48, 599.38, 1342.39], "bbox_id": "f232906cd9", "file": "AppomattoxNewspapers_1955-1957a_0126.pdf", "page": 1, "text": "Editors Note The following sketch on the fabulous Peter Fran- csrco, was written by Dr. Robert Hales, of New Store, Buckingham County, Virginia, for the Appomat tox and Buckingham Times, prede cessor of the Times-Virginian, of July 24 1901. A copy of the manu script haa been furnished by U. 0. Rothgeb, local Vepco representa tive. We suggest that many readers will desire to clip and preserve this article. , The facts which I have been able to gather in regard to the life and deeds of this distinguished man are meagre, traditional and unsatis factory. It is said that he was a Norweigian  by birth and was brought aver to this country as a slave, by one Jonathan Dumfries. Probably mistaken in this. He stayed with Dumfries until he was 16 years old, and located with Mr. LeGrand, the grandfather of Mr. L. D. Jones, for  short time, until the continental army under General Gates, going south after the sur render of Burgoyne, passed by, and he joined in his shirtsleeves and barefooted. He distinguished him- sfclf by his prowess and gallantry, especially at the Battle of Cow- pens, where he charged through a whole regiment of British cavalry on his splendid horse, cutting down a wide swathe of them with his big broadsword. He also, while scouting alone, took prisoners six British soldiers at one time, and marched them into the American camp. He was a messmate and particular friend of the late Mr. A. Forbes, Sr., and many were the tales he used to tell of Peter the Great as the boys duhibed him. One of these was that he and Peter, while foraging once in South Carolina, came to a springhouse, which was in those days a log structure over the branch close to the spring, with door, lock, and key, for the reception of fresh meat, butter, milk, pies, etc. There being no other way of gaining ad mittance except by breaking the lock, whiah was a capital offense in those days, Peter raised up the corner of the house, and through the hole Forbes entered, and hand ed out the provisions. After satisfy-  ing his appetite, Peter let down the corner, leaving Fonbes to his fate, which was a good cudgeling over the head with a broomstick by Madam Shackelford, the lady and proprietress of the fanm. After the war Peter settled for some years at the New Store, keep ing a tavern, a small store, etc. Then he moved to a farm 2 1-2 miles froim New Store, on Willis River  the farm on which Capt. Sam Jones now resides. The- farm joins the Wood-  lawn farm, now owned by the Chap-  pels, formerly by my great uncle, Captain Samuel Branch .......... Mr. Francisco was a frequent visitor at my uncles, and many were the stories told by cousins of his love of fun and delight in showing his great strength. One of them was that a groat bully from a distance probably from Powhatan once came to fight him. He arrived in the neighborhood about dusk, spent the night with one of Mr. Franciscos neighbors and next morning sallied forth in search of his opponent. He had to go -through a lane with a ten-rail fence on each side, as he approached Mr. Franscisos prom ises, Peter met him at the yard gate, and, as he was dismounting from his horse caught him by the seat of his breeches with one hand, and threw him over the fence. The man was situnned for a considerable time, but finally recovering, asked Peter for his horse, as he purposed moving back. Peiter, seising the horse, threw him over the fence, and both master"}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "sketch on the fabulous <mark>Peter</mark> Fran- csrco, was written"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "sketch on the fabulous <mark>Peter</mark> Fran- csrco, was written"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [469.39, 912.73, 629.49, 1022.73], "bbox_id": "bd042d0fac", "file": "AppomattoxNewspapers_1902-1905a_0312.pdf", "page": 1, "text": "edge at San Francisco. Mrs. Frank Burt, who shot her husband, the well-known theatrical manager, has been arraigned on a charge of shooting with intent to kill. Frank H. Slyder, superintendent of county schools from 1887 to 1893, com mitted suicide in 4he attic of his home, near Chambersburg, Pa. Peter O. Elliott, the crank who caused a stir several weeks ago among the White House police, committed j suicide in Minneapolis. David Rothschild, the New York"}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "edge at San <mark>Francisco</mark>. Mrs. Frank Burt, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "edge at San <mark>Francisco</mark>. Mrs. Frank Burt, who"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [322.78, 245.36, 494.25, 1283.71], "bbox_id": "25778aa2c3", "file": "AppomattoxNewspapers_1922-1923a_0380.pdf", "page": 1, "text": "Domestic. Joseph D. Sulsona was arranged before the United States commis sioner in New York and held in 5,000 bail as a confederate or Boehm and Ochera, who were ar rested last week on a charge of mak ing and attempting to make counter feit peso notes of the Republic of Columbia. . Mrs. Jeanne Trautman, wife or Dr. Alexander Trautman, a promi nent physician, who was arrested on complaint of Peter J. Hogan, who declared she was a street walker, who had stolen 13 from him, was honorably discharged in a New York police court. A call for a second conference of the growers and manufacturers of cotton in October, 1907, has been sent out by James R. MacColl, the president of the National Association of Cotton Manufacturers. Former President Grover Cleve land and other Princeton residents have made application to the na tional government to stock Carnegie Lake at Princeton with game fish. A grand Jury of New York has found indictments against two for mer officials of the New York Life Insurance Company, charging forg ery.An Indian massacre, in which Yaqui Indians attacked a party of Americans and Mexicans and killed eight, has occurred in Mexico. W. J. Atkinson, president of the defunct Lincoln Bank of Morton Park, was sent to jail in Chicago in default of 25,000 bail. Dr. Marker G. Dadarian, of New York, has been threatened with as sassination by the Black Hand unless he gives up 10,000. The Lackawanna Steel Company has purchased the Ellsworth Coal Companys properties in the P itts burg district. In Dayton,- O., Roy Fowler was sentenced to die in electric .chair for the murder of his sweet-heart. An effort is being made in St. Petersburg to compel the authorities to investigate the naval scandals of the Grand Ducal regime, which are said to be largely responsible for the defeat of the Russians at the battle of the Sea of Japan. Judge Duncan, of Ohio, in a decis ion rendered in the Standard Oil cases, decided that the probate court has no jurisdiction to try criminal prosecu tions under th i Valentine Anti-trust Law. The 5,000 finé imposed upon the Standard Oil Company is there fore invalid, as well as all the pro ceedings in the Probate Court. The case will be carried to the Circuit and Supreme Courts. A mass meeting of citizens of San Francisco denounced the position of President Roosevelt and Secretary Metcalf on the Califorina Bcbool ques tion, declaring that states rights is now the paramount issue. J. G. Phelps Stokes, the million aire, has refused to make his annual donation to the Y. M. C. A., because of the creation of a class in real eb- eate and stock investment. D. J. Beresford, a brother of Ad miral Lord Beresford, of the English Navy, was killed In a train wreck in North Dakota.  Nicolai de Raylan, the Russian woman who masqueraded as a man, was of noble birth and a mother. Ten persons died or were over come by the cold in New York. The Washington and Florida ex press on the Southern Railway, which ran into the private car of Samuel Spencer, Thanksgiving Day, was wrecked in the South, owing to a misunderstanding over signals. The fireman was killed and the engineer badly scalded. Five hundred horses and mules were burned in a Harper Brothers livery stable, Atlanta, Ga. The loss is about 100,000. The fire was started by safe-blowers, who explod ed the safe in the office, the shock overturning a lamp. T. E. Brady, a Great Falls lawyer, has been indicted by the federal grand jury in Helena, Mont., on a charge of unlawfully fencing a 13,- 16 7-acre tract of public land in Val ley County. J. Pierpont Morgan, Dr. Lyman Abbott and other prominent citizens of New York, have addressed a letter to Secretary Root, calling attention to conditions in the Congo Free State. Frederick J. Schaffhauer, consider ed the most important witness in the suit of the city of Philadelphia to re cover 5,000,000 from .Tas. P. Mc- Nichol on the filtration contract, is dead."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "arrested on complaint of <mark>Peter</mark> J. Hogan, who declared"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "arrested on complaint of <mark>Peter</mark> J. Hogan, who declared"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [319.18, 268.67, 489.59, 969.66], "bbox_id": "70a680ecb5", "file": "AppomattoxNewspapers_1902-1905a_0204.pdf", "page": 1, "text": "Domestic. Charles McCormack, superintendent, and Melvin Beck, a miner, were killed by the explosion of an infernal machine in the Vindicator Mine, at Cripple Creek Col., and militia have been placed on guard. Six members of the Louisville Fire De partment were summoned to answer a charge that they looted the building m which a fire was raging and took valu able articles to the enginehouse with them. , Three persons were burned to death 11 a fire which destroyed the powerhouse of the sanitarium at Markleton, ra. The residence of Mrs. Mary Baker U. Jxldy, the founder of Christian Science, was looted by burglars. .he steamer Baldwin was pierced by the ice m Green Bay, Wis., and sunk. The crew was rescued. Samuel Goinpers was re-elected presi dent of the American Federation of La bor by a large plurality. Warrants were issued for the arrest of the former mayor ami board of aider- men of Grand Rapid. M The transport Sumner arrived at ew York with officers and troops from Ma nila. , _ , The Reading Railroad Company ot fered a reward of  5  fr tbe arrest and conviction of the men who bound, chloroformed and robbed Station Agent Hafer, of Allenwood. Peter Montenson, convicted in Salt Lake, Utah, of the murder of James R. Hay, was shot to death at the state prison. , Hart P. Danks, the composer o Silver Threads Among the Gold, died in Philadelphia at his boardinghouse. The Twentieth United States Intan try left Fort Sheridan for San Francisco en route to the Philippines. the steamer Discovery, which lett Nome October 14 with 31 passengers is believed to have been lost. Fire destroyed the Park Theatre and adjacent property in Butler, Pa., to the value of 300,000. Francis M. Drake, former governor of Iowa, died at his home, in Center ville, in that State. _ . Robbers terrorized the Town ot Green Mountain, la., and secured 1000 from the bank. . . _ Antonio Roman was hanged in Gen-  eva, 111 ., for the murder of Nicholas Tomaso. a ,, , Eight cases of typhoid fever arc re ported to have broken out at Williams College. ,. _ r . _ Fire destroyed the old Masonic lem- pie and other valuable property in Louisville. _ , The Indiana National Bank, of Elk hart, Ind., and the Farmers National Bank, of Henrietta, Tex., were closed by order of the Comptroller of the Currency, and the bank examiners were placed in charge. Advices from Bogota state the Co lombian people protest and appeal to the American people against the con duct of the United States government in the Panama matter. The various Eastern railroad com- panies at a conference in New York decided ta grant a reduction of 33 j 3 per cent, on all the steel products in tended for export. Mrs. Lulu W. Brennan, of Denver, Col., whose facial beauty was destroy ed by blood-poisoning, committed sui cide at the Delprado Hotel, in Chicago."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "Agent Hafer, of Allenwood. <mark>Peter</mark> Montenson, convicted in Salt"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "Agent Hafer, of Allenwood. <mark>Peter</mark> Montenson, convicted in Salt"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [692.88, 220.67, 853.78, 824.28], "bbox_id": "0cf95481e3", "file": "AppomattoxNewspapers_1892-1898a_0401.pdf", "page": 1, "text": "Convention in Buckingham. A primary Convention was held at New Store on the 24th inst. by the Democrats as per order of the Dem ocratic county chairman to nomin ate officers for Francisco District. There were quite a number present aud Mr. L. D. Jones Sr. was made cliairuim and at once called the meeting to order and Mr. F. S. Saun ders was elected secretary. The first officers to be nominated being for Supervisor, the following named gentleman were placed in nomina tion  Messrs George Gillispie, sr., W. M. G. Ranson and G. M. Pollard. Mr. Pollard received the largest vote by one while Mr. Ranson received the next largest and .Mr. .Ppllard. was therefore declared the nominee for Supervisor, with the understand ing that in case Mr. Pollard refused the nomination he not being pres ent that Mr. Ranson would be the nominee. Mr. Pollard afterward, declined the nomination. Mr. Ran son is therefore the Democratic nominee for Supervisor for this Francisco District. MagistratesMessrs. L. D. Jones, sr., P M. Jones, Alexander Forbes, and Mr. W. C. Chappell were placed in nomination and Messrs L. D. and P. M. Jones and Alexander Forbes were declared by the chairman nouiinaied, Mr. Chappells name having been withdrawn. ConstableMr. Peter Hales the present incumbent received the nomination, there being no opposi tion. Overseer of the poorMessrs. Jas. H. Morris and John H. Gilliam were placed before the convention, and Mr. Morris was declared elected. There being no other business before the convention a motion was made to adjourn, which was carried. L. D. J ones , Chairman. F. S. S aunders , Secretary."}, "highlight": {"text": {"matched_tokens": ["Francisco"], "snippet": "nomin ate officers for <mark>Francisco</mark> District. There were quite"}}, "highlights": [{"field": "text", "matched_tokens": ["Francisco"], "snippet": "nomin ate officers for <mark>Francisco</mark> District. There were quite"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [351.09, 284.0, 510.09, 1270.85], "bbox_id": "01aada8b43", "file": "AppomattoxNewspapers_1902-1905a_0510.pdf", "page": 1, "text": "Cones tic. Dr. I.. O. Dawson startled the South ern Baptist Convention in his report 011 work among the negroes by declaring that it vas no affair of the convention to solve the so-called negro problem. Judge Peter V. Voorhees, lay judge of the Court of Errors and Appeals, in Camden, N. J., announced that he had sent his resignation to Governor Stokes. The transport Warren sailed from San Francisco for Manila with a big cargo of supplies for the government sta tions in the Philippines and at Guam. Five of the unidentified victims of the railroad wreck at Harrisburg, Pa., were bured in a lot selected by the railroad company officials. Two fast freights on the Chautauqua Division of the Pennsylvania Rialroad collided head on. Two trainmen were killed and several injured. The report of the General Sabbath School Board was submitted to the Uni ted Brethren Conference, in session in Topeka, Kan. .Miss Edith I. Gibney secured in Pitts burg a verdict for 1,3,925 in her breach of promise suit against Klaus J. Steiner. President F. 1 . Underwood, of the Erie Railroad Company, denied that that company was paying rebates. Northern Texas has again been flood ed by a heavy rainstorm and telegraph wires arc nearly all useless. Abe Weinberg, aged .32 years, was stabbed to death by John Daly ill a lodging-house in Philadelphia. A. Brightman shot and killed Mrs. Charles H. Gurney in Los Angeles, Cal., and then committed suicide. All of the negroes and men imported by the Employers Association to take the places of the strikers in Chicago arc being vaccinated by the Chicago Board of Health Department. Twenty inspec tors are working among the strike-break ers. There arc at present too smallpox patients in the Isolation Hospital. Papers have been served on James W. Alexander, president of the Equita ble Life Assurance Society, in the suit of James H. Hyde to have him removed as trustee of the Hyde stock. Herbert V. Croker, a son of Richard Crokcr, of New York city, was found dead in a ear on the southbound At chison, Topeka and Santa Fe Railroad when it reached Newton, Kan. Several persons were injured and two cars demolished in a collision between a locomotive and a passenger train on the Chicago and Northwestern in Chi cago. The felt hat factory of Jonas  Naum- berg, 516 to 522 West Thirty-fifth street, New York was damaged 100,000 by fire. Two hundred men and women escaped. Five men have been killed and two injured in an explosion in a mine belong ing to the Heinze property at Butte, Mont. In a wreck on the Cotton Belt Rail way the train was ditched and four per sons are reported killed. Emerson E. Bennett, a well-known writer and composer, of Philadelphia, is dead. At the Convention of the American Stock-growers Association in Denver resolutions were adopted indorsing the Presidents attitude toward fair rialroad rates. Las Vegas, N. M., has been selected as the location of a national sanitarium, over 1,000,000 having been donated in land, buildings and cash for the purpose. At the Convention of the National Board of Fire Underwriters President Washburn referred to the immense loss that had been sustained during the year. Trueman Mason, aged 65, shot and mortally wounded Dr. V. Davis in Wa- pelln. 111., and then shot himself in the head, death ensuing almost instantly. Edward Gottschalk was convicted in St. Paul, Minn., of the murder of Chris tian H. Schindeldecker and sentenced to be hanged. The New Jersey Board of Pardons has refused to pardon Libbie Garrabrant, who has served 30 years of a life sentence for murder. Thirty men who went to Panama as employes of the Canal Commission re turned, fearful of the fever prevailing there. Wallace MacCreary, once a well-known comic-opera singer, committed suicide by leaping from a New York ferryboat. For unrequitted love Peter Kathesizer killed Miss Grace Townsley in Lin coln, Neb., and then killed himself. John Hewitt, of Adel, Ga killed his wife, wounded her sister and brother, and then killed himself. Mrs. Alexander Schaffer and her six- year-old son were killed by lightning in Lancaster, O."}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "so-called negro problem. Judge <mark>Peter</mark> V. Voorhees, lay judge"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "so-called negro problem. Judge <mark>Peter</mark> V. Voorhees, lay judge"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.63, 669.29, 2110.46, 737.33], "bbox_id": "3ea716ff2e", "file": "AppomattoxNewspapers_1905-1912a_0290.pdf", "page": 1, "text": ", j the prosecution in the Jones-Per -1 For the following sketch of, Peter brought here to be re sentenced nn -1 ing Cftge when it comes up for trial Francisco I am indebted an old til after the trial of Richard Prin the Richm0nd court, and that history published sixty-five years kms and Ed. Jones, which takes I Boafd of Supervisors shou,dago place at some future time   . a him there for that purpose city of Richmond. Judge Witt"}, "highlight": {"text": {"matched_tokens": ["Peter"], "snippet": "the following sketch of, <mark>Peter</mark> brought here to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Peter"], "snippet": "the following sketch of, <mark>Peter</mark> brought here to be"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
