{"document": {"bbox": [738.5, 568.71, 748.0, 603.85], "bbox_id": "f66cd2998b", "file": "AppomattoxNewspapers_1971-1973a_0103.pdf", "page": 1, "text": "Plunkett"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "<mark>Plunkett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "<mark>Plunkett</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2156.4, 1625.73, 2165.9, 1662.5], "bbox_id": "81cbda867f", "file": "AppomattoxNewspapers_1955-1957a_0007.pdf", "page": 1, "text": "Plunkett"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "<mark>Plunkett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "<mark>Plunkett</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [662.16, 1705.41, 1071.59, 1756.75], "bbox_id": "1ad521368d", "file": "AppomattoxNewspapers_1971-1973a_0089.pdf", "page": 1, "text": "Your Vote ane Influence will be appreciated John G. Plunkett"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Your Vote ane Influence will be appreciated John G. <mark>Plunkett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Your Vote ane Influence will be appreciated John G. <mark>Plunkett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2210.07, 512.61, 2384.54, 1784.53], "bbox_id": "f0e8e31832", "file": "AppomattoxNewspapers_1954-1955a_0217.pdf", "page": 1, "text": "Yesterday was the 100th a n n i versary of the establishment of a U. iS. Post Office at what is bow Appo mattox, Virginia. Information secured from Nation al Archives and the Post Office De partment, Washington, D. C., tells an interesting story of a full cen tury of mail service here. There have been 20 postmaster andor acting postmaster ap pointments in the 100 years of operation and the incumbent, E. LeRoy Smith, has served longer than any other. The name of the office has been changed several times. On February 23, 1855, a fourth class post office was established here and was call ed Nebraska, Virginia. The first postmaster was Samuel D. McDear- mon. Salary amounted to 6.01. The office operated under the name of Nebraska, Virginia until September 21, 1894, when it was changed to Appomattox. However, due to confusion with the Old Ap pomattox Court House community, the ñamé of the post office here changed on January 15, 189 to West Appomattox, Virginia. It oper ated under that name until June 27, 1906, when it took the present name of Appomattox, Virginia. The office became third class in 1909 and second class in 1987. In mid-1955 it is scheduled to become first class, due to volume of busi ness. Several years ago it became first class, but reverted to second class due to a shift in parcel post business. The following is a list of post masters and their terms Samuel D. MeDearmon, February 23, 1855 Richard H, Mavin, December 31. 1855 Robert I, Boaz, October 4, 1866 Thomas E. Walton, December 22 1867k D- Hix, April 20, 1869 Willbfo l CoIKntf April 1 , i860 Mrs. Mary J. Atwood, February 10, 1666.  Ada A. Landrum, June 26, 1866 N. H. Gregory, October 30, 1867 Miss Elizftbéth H. Dee, Jániury 21, 188 Rufus Furdum, January 1, 1873 Samuel H. Coleman, July 26, 1889 John S. Plunkett, May 9, 1898 Robert Irby, May 7, 1897 Leslie F. Ferguson, May 20, 1918 Robert Irby, April 28, 1922 Lula G. Irby, Acting Postmaster. Ap ril 21, 921 Alfred R. Harwood, Acting Poet- master, May 15, 7931 Joseph E. Dinwiddle, June 1, 1982 E. LeRoy Smith, Acting Poet- master, June 1, 1034 Regular Appointment, March 8, 1936. However, this was not the first pqst. office in what is now Appomat tox County, Tie following inform ation  supplied by the National Archives and reports of the Post Office Department Appomattox County, Virginia The records show that this office was established on April 1, 1811, under the name of Floods, Buckings ham County, Virginia, with Thomas Trent the first postmaster. It is shown that the name oi the county was changed to Prince Edward on March 22, 1837, that the name of the office was changed to Clover Hill on July 7, 1837 and that the county in which the office was lo cated was changed to Appomattox sometime between September 23, 1845 and June 30, 1849. The re cords show that the name of the office was changed to Appomattox Court House on February 3, 1859 and changed to Appomattox on July 3, 1892.  It therefore appears that the his tory of a post office at what is now without a post office but known as Old Appomattox Court House, is equally interesting. That part of the county was in Buckingham when the post office was established as Floods in 1811. Later it became a part of Prince Edward and finally Appo mattox in 1845. Shortly after the burning of the court house in 1892, the court house was rebuilt at what is now the Town of Appomattox, and final ly the post office at the historic old village was discontinued. It was of ficially Appomattox Court House, Virginia, at the time Gen. Lee sur rendered to Gen. Grant. Undocumented stories often told here relate that in the gold rush days a hundred years and more ago?- some family started out for Ne braska, got this far and liked the place so much that they decided to settle here and call this Nebraska. This newspaper has no proof of that"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "26, 1889 John S. <mark>Plunkett</mark>, May 9, 1898 Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "26, 1889 John S. <mark>Plunkett</mark>, May 9, 1898 Robert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.97, 649.2, 1668.18, 851.94], "bbox_id": "92a54df56a", "file": "AppomattoxNewspapers_1908-1909a_0389.pdf", "page": 1, "text": "year- Hilda Moore, Weselene Young, Nellie Ham ilton, Edith Robertson, Alice Lee Smith, Rachel T Morris, Clarkie Evans, Catherine Luca do, Lulu Drinkard, Ruth Mor ris, Garland Plunkett, Claud- ine OBrien, Ella Lewis, Chap man Chilton, Mandane Ander son, Dorothy Covington, Chris tine Paulett. 7th grade Marshall Bab cock, Elizabeth Cralle, Kather ine Davidson, Thelma iMorris, Leilas Davis, Anne OBrien, Dorothy Tweedy, Elliott j"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Ruth Mor ris, Garland <mark>Plunkett</mark>, Claud- ine OBrien, Ella"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Ruth Mor ris, Garland <mark>Plunkett</mark>, Claud- ine OBrien, Ella"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.71, 1497.04, 1575.19, 1820.78], "bbox_id": "0a361cb1a2", "file": "TimesVirginian_1981a_0311.pdf", "page": 1, "text": "y Clifford Plunkett has return-  ed to his home following  surgery in the Lynchburg R General-Marshall Lodge Hospi- y tal. g ,     Mrs. S. j Evans has X returned from a visit with her 1 son-in-law and daughter, Mr. and Mrs. W. C. Newcomb of jì Toduoaon and also from visiting y with her son-in-law and v daughter, Mr. and Mrs. C. D.  H Thomas of Newport News.    M Recent visitors in the home 5 of Miss Mamie Cullop were Mr. 2 and Mrs. James C. Ferguson, of  Kansas City Kansas and Mrs. Evelyn C. Ferguson of Rich mond. .   Mr. and Mrs. W. C. Newcomb sprat the weekend with his mother, Mrs. Mary Newcomb of Lynchburg. a  .  Mr. and Mrs. Charles Fraley aprat the weekend visiting their children in Narrows and .Bbekaburg."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "y Clifford <mark>Plunkett</mark> has return-  ed to"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "y Clifford <mark>Plunkett</mark> has return-  ed to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2326.09, 283.71, 2457.7, 980.08], "bbox_id": "1d95515f41", "file": "TimesVirginian_1980a_0406.pdf", "page": 1, "text": "Wsyne G arrett. Chesa- peake. Va.. Mrs. bauise Hsnkiey,  Mrs. P tm Br own, Mrs. Daphine Moore, Mrs. Joel Smith Miss, Pat B um ..     .. Those visiting in tfcte home of Mr. and Mrs. JJtoland Smith over the hoBdays wen Mr. and Mrs. Ralph Smith, Richmond, V a.jlr. and Mrs. Joel W. Smith And son, Joel, M rand , Mrs. Curtis Moore and. hoys, Barry and RkharckInch- burg. Vs.,  Mr. and afra. Basil Lucado, Mrs. Clarke Moore, Mrs. Norman-Booth and son, Andy, Mrs. Mpilie Rogers.  -T-. Mr. and Mrs. fearle WQkerson, Mrs. Marshall Martin had Thanksgiviag dinner with Mr. atkilMft. Ray Page. .jS Sunday dinner guests of Mrs. Marshall Martin were Mr. and Mrs. Riley Meggin- son, Mr. and Mrs. Garland Plunkett, Mr. and ..Hfrs. Keith Martin, Nita -and Jason, M r and Mrs. Ray Page. Mr. Jordon Martin called in the afternoon in this home. Mrs. Margaret Marshall and Mr. J. D. Marshall ate lunch Saturday with Mr. and Mrs. Clark Moore. Mrs. Marshall is recuperating nicely from the recent hone injury. i . Mr. and Mrs. Herbert Richardson served Thanks giving dinner to the family. Those attending the festive occasskm were Mr. -and Mrs. Clarence Smith-Mic- hael and Todd. Mr. Bill Richardson. Mr. and lve. O. W. Martin Jr., Mr. and Mrs. Richard Martin, and daugh ter, Laurie Lee, Mis and Mrs. Clarice Lewis, Mir. .and Mrs. Ricky Lewis, Mr, and Mrs. Clarke Moore, Mr. J D. Marshall and Miss Kathy M arshall, Mrs. J, . D. Marshall also visitedvtn this home later in the p it. Mr. and Mrs. Clayton Martin Had as their -dinner guests on Thanksgiving Day, Mrs. Ruth Glapp, Mrs. Graydon Martin, Mrs. Hub bard Moore. Mr. and Mrs. James Lucado, Mr. and Mrs. Gregg M artitvyb. and Mrs"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Mr. and Mrs. Garland <mark>Plunkett</mark>, Mr. and ..Hfrs. Keith"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Mr. and Mrs. Garland <mark>Plunkett</mark>, Mr. and ..Hfrs. Keith"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1857.34, 376.2, 2016.33, 428.85], "bbox_id": "637de661a2", "file": "AppomattoxNewspapers_1933-1936a_0167.pdf", "page": 1, "text": "working on the new highway. Circle No. one of the Liberty Baptist church met with Mrs. d. S. Plunkett Wednesday afternoon. Fred Baldwin, of Maryland vis ited Miss Josie Holycross Friday."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "with Mrs. d. S. <mark>Plunkett</mark> Wednesday afternoon. Fred Baldwin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "with Mrs. d. S. <mark>Plunkett</mark> Wednesday afternoon. Fred Baldwin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.21, 800.54, 2401.56, 961.39], "bbox_id": "a30b34f6a2", "file": "TimesVirginian_1980a_0177.pdf", "page": 1, "text": "Winners of Oscar Mayer 3 Lb. Caned Hams Clyde Nash, Ethel Stjokn, Alice NcDearmon, Robin Price, Rosa Repass, David Baldwin, Fannie Kern, Cliff Plunkett, Rhonda Jones, Virginia Hunter, Webb Babcock, Gloria Bryant."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Baldwin, Fannie Kern, Cliff <mark>Plunkett</mark>, Rhonda Jones, Virginia Hunter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Baldwin, Fannie Kern, Cliff <mark>Plunkett</mark>, Rhonda Jones, Virginia Hunter,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "B. Harvey, J. D. <mark>Plunkett</mark>. Mr. Gills was first"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "B. Harvey, J. D. <mark>Plunkett</mark>. Mr. Gills was first"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.33, 587.44, 2068.79, 855.51], "bbox_id": "d9a303d09b", "file": "AppomattoxNewspapers_1943-1947a_0255.pdf", "page": 1, "text": "William M. Tuck, of Halifax re ceived a clear-cut victory over Moss Plunkett, of Roanoke in Tuesdays p.iniary for the Democratic nomi nation for Governor. However, the Your son Dan was one of the! race for the nomination for  Lieut- first boys to enter the gates and 1 enant Governor developed into a liberate us and I assure you Dan i ding-dong, photo-finish contest be- L 7iUrtjesse L. Tor-. must still be same boy that left tween L. Preston Collins, of Mar- h l f i s i n a hospital home, for he is one of the best ion, and Charles R. Fenwick, .of I 0 boys we have ever met. Arlington. . . , pf40 ____  Dan spoke of you constantly With 1,609 of Virginias 1.715 Torrence, Jr., U. S. NaVy, and you cant imagine the joy he o   Collins I undersUndnbrsom eof the pa- been on Okinawa, has re- got every time be would receive 0,768 v o tes 4 9 ,   of the Appomattox High I th States and is now mail from home. All he can talk It was uniiKeiy tnat in  j o v . t whv certain pupils h i ,  boot is your Southern cykiu, to d .o d d U K o l f - ------- and what a wonderful place Lynch nal tabulation  concensus tourSe cannot enter college. I feel I Torrence, S 2-C, of the burg is. The last  I tew Dsn- eiare FenwLk the winneT senator 1 it proper that I make some stato- Evy, has returned to Samp- ny he was in veiy good he , . Roanoke ran third in this ments regarding this matter which mesj?  y darlfy the - U4 P 1 _ 1 come quite a tea drinker as we are! Appomattox County, for its size first place, it has al- I _ ... q I on Australians and drink it all the and population,had perhaps the ai ways bei,n true that some of the I W. Fran  . . . time. . . . . Enclosed is a picture gest votes cast in the State, a d grajuates each year were not qual- and Mre L. H. Franklin, o m two sisters and myself .. j won the honor of casting the near- ej for couege entrance and main- Lmattox, is back on iduty jt does something to you when est thing to a unanimous vote m so because they did not plan L nos Tntrepid, which was you look back and think of people the State. Collins swept App - g0Qn enougj to go to college and I Hamatred by en- you left behind. So please forgive mattox County 1,610 to  0  0  did not choose their course in high I severuy aamageqvjr _ _ ___ , lc _ __________ j T ___ u a 10"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "clear-cut victory over Moss <mark>Plunkett</mark>, of Roanoke in Tuesdays"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "clear-cut victory over Moss <mark>Plunkett</mark>, of Roanoke in Tuesdays"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.9, 754.25, 2238.1, 1603.29], "bbox_id": "e887c139dc", "file": "AppomattoxNewspapers_1943-1947a_0267.pdf", "page": 1, "text": "William Irving Ayers Albert C. Baldwin Edward H. Baldwin Norman K. Baldwin Walter M. Bates William C. Bell William T. Bowling Clarence W. Brooks Walter B. Brown Willie W. Brown Curtis H. Bucknam Richard F. Burke, III Richard L. Burke, Jr. Robert T. Burks Robert li. Bryant David C. Carter Hubert H. Caldwell, Jr. Carlton D. Canada Charlie B. Carson Frank Chandler William C. Childers Richard C. Childress Andrew B. Chocklett Walter S. Conner Kelly Crum Twyman E. Curaby Marcus H. Cuneo John R. Crawley, Jr. Harry 0. Cyrus Chap L. Davidson Ernest -Davidson -----  Edward R. Doss Paul S. Drinkard Russell H. Eagle Joseph W. Eddins Joseph E. Ferrell Harry D. Ferguson David M. Franklin Kermit Garrett Tyler Garrett Russell T. Gilbert Theodore R. Gilbert Harry B. Giles Lewellyn Giles, Jr. Lewis H. Gobble Herbert L. Godsey Andrew M. Goin Emmett H. Goin Robert E. Gowin Fred W. Grishaw Harry W. Guill Willie E. Guill Charlie Gunter Howard W. Hancock Richard M. Harris Garland Harding Edward W. Harvey William C. Hollins Richard D. Inge Jesse H. Johnson Herman K. Kirkpatrick Arthur C. Layne _ Robert F. Lynch John R. Lawson Asa T. Martin Glenn 5. Martin Clarence J. Mays Carrington A. McCormick Lewis S. McCormick, Jr. Ivanhoe W. McCormick Thomas A. McCormick Garland J- Morris Lyle E. Moses Jerry B. Myers Samuel L. Nuckols Clem O. OBrien Jesse T. Paulette Havilah E. Phelps Lenwood E. PKelps Garland G. Plunkett Jas. W. Ranson Samuel E. Richardson David T. Robertson James G. Robertson Oscar L. Robertson Paul W. Sarver Russell M. Shelton Ira J. Southall Clarence H. Stanley Samuel L. Stanley Dillard Reed"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "E. PKelps Garland G. <mark>Plunkett</mark> Jas. W. Ranson Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "E. PKelps Garland G. <mark>Plunkett</mark> Jas. W. Ranson Samuel"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1623.26, 363.41, 1805.26, 967.16], "bbox_id": "9784f59e78", "file": "AppomattoxNewspapers_1939-1943a_0294.pdf", "page": 1, "text": "will spend the week-end here. Mrs. S. V. Munsey and daughter,! Betty Vaughn, of Haysi, were in I Appomattox Friday evening. Mr. and Mrs. V. H. Gill and child-1 ren will move next week to Wiscon-1 sin, where Mr. Gill has accepted a I position with the DuPont Company. I Professor Gill and his family will 1 se gretly missed in Appomattox, I xnd his many friends join in ex-1 tending thanks for his loyal spirit f civic interest and .work for the jrowth of Appomattox during his sojourn here as agricultural instruc tor at the high school, and wish him very good fortune in his task. Professor Jerry Britton will leave Saturday to spend the summer at iis home in Harrisburg, Pa. Miss Harriett Cale celebrated her jirthday Sunday. Her dinner guests ncluded Misses Helen Mitchell, Re- ec.ca Johnson, Harriett Lee Robert - 1 son and Fannie Mae Cralle. They I motored to Fork Union Military I Academy in the afternoon. Mrs. L. A. Mersereau, of Balti-1 more, spent Friday night here with I her mother, Mlrs. Jennie Johnson. I Ms. Johnson and Miss Marian Jun_-1 Evans accompanied heT to Lynch-1 burg to spend the week-end. Miss Ethelyn Lee, of Richmond, I was home for the week-end. Harry Haley, of San Francisco, California, was a recent guest of Mr. and Mrs. R. B. Haley. Lt. Garland Plunkett, of Mount Solas spent the weekend here. Recent guests of Mr. and Mrs. W. p. Davidson were Mr. and Mrs. W. J. Hurt, of Pamplin. Bom to Mr. and Mrs. Harvey Pulliam a baby girl, May 12. Mrs. Mollie Collins celebrated her 86th birthday last Thursday. Mrs. Gordon Spencer spent the past week at Victoria. Miss Sarah Myers will leave Sat-1 urday for her home in Bridge- water. We are glad to see Lathan Har- ey out again, after undergoing an appendectomy. Edgar Harvey, of Fort Meade, Md., was home for the week-end."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "B. Haley. Lt. Garland <mark>Plunkett</mark>, of Mount Solas spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "B. Haley. Lt. Garland <mark>Plunkett</mark>, of Mount Solas spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1729.43, 1191.81, 2051.74, 1784.11], "bbox_id": "8b66294e05", "file": "AppomattoxNewspapers_1912-1915a_0213.pdf", "page": 1, "text": "who has been visiting her aunt, Mis. J. T. Cole, has returned home. Mr. and Mrs. R. L. Hubbard ard little daughter, Gladys, of Pros pect, parents and sister of Mrs. Geo. W. Coleman Jr., were gnests of Mr. and Mrs Geo. W. Coleman Sr. at Edgewood S inday. Miss Florence Beasley, of Lynch burg, is visiting Miss Bessie Cole man. Miss Florence Morgan, who has been spending simetime at her fat hers here, will retnrn to Crewe to day to begin school. Miss Marguerite Golemaa, who hut been away awhile visiting ber sister Mrs. Paul Warren, of Shaw Toro, N G., returned home yesterday. She seems to have been, charmed with the Tar heels and the  Old North State generally. Mrs. Neal Harveys mother, Mr. Kidd, and brother, Mr. Wm. Kidd and wife, of Prince Edward, were visiting ber las? week. Mrs. E. R. Abbitt is visiting hr son, Ernest, at tbe business colleg in Richmond.. Mr. and Mrs. Fletcher Lon  moved to Lynchburg last week. Mr. T. B. Pretlows mother and sisters, who have been visiting him. have retnrned to their home m Franklin. We are glad to see Miss Mary Plunkett about again. She has been coufined to her room with a badly sprained ankle for th past two weeks. Mrs. Bettie Webb, of Lynchburg, has been visiting her brothers, Msssrs. James and Milard C hat ham, and other relatives here re cently. And so Appomattox ia to have a I --------------------  -----  ---------- Fair. We are ia receipt of the To a tart things coming your splendidly gotten ap program, I way, go after tnern."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "to see Miss Mary <mark>Plunkett</mark> about again. She has"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "to see Miss Mary <mark>Plunkett</mark> about again. She has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1710.2, 1265.1, 1874.21, 1362.9], "bbox_id": "8bb445b113", "file": "AppomattoxNewspapers_1933-1936a_0271.pdf", "page": 1, "text": "Wesley Chapel, August 14.- We regret to hear that Mrs. Anna Ward has blood poison m the hand. Mr. artd Mrs. H T Plunkett, of West Virginia, weree Sunday gu f Mrs H. Ward and were i accompanied home by Ronald Pruitt. Miss Florence Wooten has neen visiting Mr and Mrs C A. Woten. VMr and Mrs W C Lee have been visiting in the home of Mrs. R. vv"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "artd Mrs. H T <mark>Plunkett</mark>, of West Virginia, weree"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "artd Mrs. H T <mark>Plunkett</mark>, of West Virginia, weree"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [387.33, 695.11, 568.88, 1670.83], "bbox_id": "ffd7552000", "file": "AppomattoxNewspapers_1926-1933a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. 5th grade, Louise Lewis, tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, Garland Harding. 1st grade, Mabel Martin, Ola I Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb, Carl Carson. A ppomattox A. H. S. 4th year, Lucille Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary I Jamerson, Louise Scruggs, I Floyd Dinkins. I 2nd year. Verta Simms, Hallie I Chilton, Kathleen Paulette, Dora I Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman tha Pippin, Homer Babcock, Edith OBrien, 1st year, Bertha Rogers Fay Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw ley, John Hesson, James Morris, Charles James, Holcomb Cald well. 7th grade, Lucille Crailt, Eve lyn Dickerson, Adelina Fergu- Ison, Josephine LeGrand. j 6th grade, Mandane Anderson, Nellie Bloxton, Carrie Jamerson, I Hilda Moore, Eloise OBrien, I Claudine OBrien, Mary Smith, I Elizabeth Trent, Billie Hubbard, I Garland Plunket. 5th grade, Ruby Cole, Marion Agee, Margaret Carter, Eliza beth Cralle, Mary Clark, Leilas Davis, Mabel Hall, Thelma Mor ris, ary McNally, Annie Mar shall, Mabel Smith, Dorothy Tweedy, Elliott Torrence, Ray mond Jamersoh, Lawrence Moore, Harry Lee. 4th grade, Geneva Wingfield, Willie Guthrie Anderson, Erna Dickerson, Loraine Handy, Christine Caldwell, Roberta Dinwiddle,  Edith Franklin, Cecil Torrence, Billy Smith, John Cole, Charles Guill, Davie Carter. . 3rd grade, Anna Carter, Yir- I ginia Christian, Edith Cole, Net- I tie Davidson, Olla May Dinkins, Hattie Guill, Virginia Epes Irby, I Edith Lucado, Susie Plunkett,"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "I Edith Lucado, Susie <mark>Plunkett</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "I Edith Lucado, Susie <mark>Plunkett</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.25, 352.31, 1966.09, 530.73], "bbox_id": "9e8f4443ed", "file": "AppomattoxNewspapers_1949-1952a_0585.pdf", "page": 1, "text": "Well, here are some more Apnl birthdays! Miss Frances Smith, April 10. Jane Goih, 2, April 3. Mrs. Albert Baird nee Jessie Fitx- gerald April 2. Rev. W. M. Thompson, April 1. Mrs. Don Moses, April 15. Mrs Wiley Morris, April 16. Miss Lucy Smith, April 26. Mrs. J. F. Harvey, April 18. Kendall Hunter, Jr., April 18. Frank Leigh Burke, April 20. W. H. Guill, April 22 Mrs. Virginia Zastrow, April 12. Pete Plunkett, April 14. Harry G. Plunkett April 10. Susan Elaine Marshall, 1, April 22."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Zastrow, April 12. Pete <mark>Plunkett</mark>, April 14. Harry G."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Zastrow, April 12. Pete <mark>Plunkett</mark>, April 14. Harry G."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1094.63, 979.62, 1265.83, 1451.35], "bbox_id": "1bed35e429", "file": "AppomattoxNewspapers_1954-1955a_0244.pdf", "page": 1, "text": "week H. H. Caldwell, Jr. entered the lists for this office. Commonwealth Attorney It is presumed that the incumbent, G. F. Abbitt, Jr. will file and will be the only candidate. County Treasurer J. Garland Plunkett and Thomas T. Martin ape the announced candidates. David T. Robertson, the incum bent sheriff, was appointed to fill out the term of the late H. W. Mc Kinney, and four years ago won a full term. He was opposed in that election four years ago by Vernell Mitchell. Sheriff Robertson inform ed The Times-Virginian this week that he would be a candidate, and to date no other has announced. The two-way race for Commission er of the Revenue will find H. H. Caldwell, Jr. opposing the veteran incumbent, J. H. OBrien. Mr. Cald- will be making his first bid for public office. He is the son of H. H. Caldwell, of Route 3, Appomattox. He graduated at Appomattox High School in 1943 and entered the Navy as Aviation Cadet August 10 of that year. While in the service he took special courses at the Universities of South Carolina and Georgia. He served on the USS. Bismarck Sea, and was on same when the carrier was sunk by a Jap dive bomber at tack Feb. 23, 1945. He was among the rescued survivors. He entered V. P. I. in the fall of 1945, and re ceived his B. S. degree in 1949. He was president of the civilian student foody his senior year. Since he has been employed with American To bacco Co., Schaffer Pen Co., and since 1954 with Gary Steel Products Corp, Lynchburg, as assistant to the general sales manager.."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "County Treasurer J. Garland <mark>Plunkett</mark> and Thomas T. Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "County Treasurer J. Garland <mark>Plunkett</mark> and Thomas T. Martin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2185.92, 692.69, 2326.11, 747.84], "bbox_id": "6170afa7f3", "file": "AppomattoxNewspapers_1971-1973a_0497.pdf", "page": 1, "text": "Week end visitors in the home of Mr. and Mrs. Cliff Plunkett were Mr. and Mrs. R. B. Plunkett, Sr., of Montgo mery, West Virginia."}, "highlight": {"text": {"matched_tokens": ["Plunkett", "Plunkett"], "snippet": "Week end visitors in the home of Mr. and Mrs. Cliff <mark>Plunkett</mark> were Mr. and Mrs. R. B. <mark>Plunkett</mark>, Sr., of Montgo mery, West Virginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett", "Plunkett"], "snippet": "Week end visitors in the home of Mr. and Mrs. Cliff <mark>Plunkett</mark> were Mr. and Mrs. R. B. <mark>Plunkett</mark>, Sr., of Montgo mery, West Virginia."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.14, 523.64, 2065.38, 1488.08], "bbox_id": "c7ef1ac0da", "file": "AppomattoxNewspapers_1902-1905a_0400.pdf", "page": 1, "text": "We would just lil e to set our eyes ou that Old Coon from Ar- voniu, we would give him such a tongue lashing that he woul t be willing to retract everything he said about his  term marriages. We kuow that he is so crusty and lagreeMble that no one would have him ai d so he thought he would make others dissatisfied. We are old-fashioned enough to be lieve that  what God has joined together let not man put mho oiler, and webelieve that such views .s Ar- voniu expresses are calculated to do harm. This lovely Indian summer weath er is all that one could wish aud the three big frosts of lust week seem to have put new life in some of us, and every one is hustling getting ready for winter, which will soon be here. Not two months till Christmas we can hardly realize it. Time just seems to have taken wings and flown away. 1he schools generally have open ed well, ami the teachers seem foil of eiiihusiaem for their winteis ork. Miss Bertha Woolridge te. ovts a good enrollment. Miss Sadie Coleman ep-nt Sun day at hume. She has a flue School, at Hurt8T!le. Her enrollment is 25 and most of them attend regn- irly. She expresses herself as charmed with tbe people and the neighborhood generally. Rev. Mr. Ellison pieaehed a good sermon at Forest last Sunday. Mr. and Mrs. T W. fi ler arid, Miss Madlaine Coleman visited rela tives near Reedy Springs on Satur day und Sunday. Mr. C. N- Alibi!V little fill, Elizabeth, is quite tick with pm u- monia. The hildrcu o. .Mr. I. O. Abbitt are il also. Mises Bessie and Elvu Col. man had a most enjoyable visit in in llnrtsville neighborhood last week. They visited at the charming home of Mr. Witt Coleman and attended a party given at Mr. Agees Friday night. They report a most delight - ful time, lots of pretty girls, good looking boys and elegant nin.de. There were men bers of five differ ent families of Colemans present. We are sorry to learn of the ser ious illness of little Hamoer, the bright little son of Mr. and Mrs. Edmond Cawthom, of Lynchburg, and trust that a merc.ful  Heavenly Father will spare him to his pa rents. Making molasses is now a thing of the past in this neighborhood,though molasses candy is still very much in evidence and the young folks ate still having sweet old times, es pecially one young man who fell in the skimming hole. We ure sorry to leain oi- the con tinued illness of Mrs. John Evans. Leslie Dixon, the little grandson of Mr. and Mrs. William Mann has been verv sick. We are glad to see Mr. John Plunkett out a ain after quite a bad spell of sickness."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "to see Mr. John <mark>Plunkett</mark> out a ain after"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "to see Mr. John <mark>Plunkett</mark> out a ain after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1354.08, 741.31, 1502.5, 895.61], "bbox_id": "6c69414aac", "file": "AppomattoxNewspapers_1926-1933a_0435.pdf", "page": 1, "text": "We have good prices on under wear, sweaters, outing gowns nd pajamas. 36 inch outing in I colors. I nge  s N ovelty S hoppe . Mr. R. B. Plunkett is expected ome for the hunting season Iso Mr. and Mrs. H. G. Mar- 11, of New Port News. Mr. and Mrs. Harry Richard- on, of Petersburg, were the eek-end guests of Mr. and Mrs. -S. Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "hoppe . Mr. R. B. <mark>Plunkett</mark> is expected ome for"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "hoppe . Mr. R. B. <mark>Plunkett</mark> is expected ome for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1352.65, 721.91, 1497.95, 876.2], "bbox_id": "bb7dc66276", "file": "AppomattoxNewspapers_1908-1909a_0435.pdf", "page": 1, "text": "We have good prices on under ear, sweaters, outing gowns nd pajamas. 36 inch outing in 1 colors. I nge  s N ovelty S h o ppe . Mr. R. B. Plunkett is expected ome for the hunting season Mr. and Mrs. H. G. Mar- hall, of New Port News. Mr. and Mrs. Harry Richard- n, of Petersburg, were the eek-end guests of Mr. and Mrs. S. Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "ppe . Mr. R. B. <mark>Plunkett</mark> is expected ome for"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "ppe . Mr. R. B. <mark>Plunkett</mark> is expected ome for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [244.29, 507.09, 416.64, 1406.11], "bbox_id": "0e717f4bc2", "file": "AppomattoxNewspapers_1908-1909a_0230.pdf", "page": 1, "text": "Watt Stanley h a s returned home after a visit to Peters burg and Richmond- Mrs. Luther Morris spent tht week-end visiting relatives in Nelson County. J. T. Harvey, of Hopewell spent the week-end w i t h his j .family. Lawson Lee, who was pain fully burned in August, im proves slowly. Mrs- J. E. Blackley has been on a visit to relatives in Reidsville, N. C. Mrs. Helen Welch, who has been sick this week is able to J be out, again. A. H. Clement, who has been! on a trip to Roanoke and Lynch burg, returned home Monday- Miss Marion Wagner, of Pearisburg, spent the week-end with her parents, Mr- and Mrs. R- C. Wagner. Miss Frances Fox, of the State Teachers College, was the week-end guest of Miss Mary Trent. Mrs. J. D. Plunkett, who has been a patient in the Baptist hospital, at Lynchburg, has re turned home. Miss Kate OBrien spent the week-end in Richmond, where she attended the V. M. iTand Maryland football game. Miss Alice E. Carter, an in structor in the State Teachers College, spent Sunday as th e gueBt of Mrs. Lindsay Crawley. MI sb Virginia EppeB Irby spent the week-end in Chat ham as the guest of Mrs. Elea nor Scott. Mr. and Mrs. Lemuel Pur- dum, of Danivlle, were guests I last week of the formers sis ter, Mrs. T. A. Walton- Walter - Durham, of Rich-1 mond, was a recent guest of his I sister, Mrs. Alpha Higginboth-I am. Mr. and Mrs. R. C. Wagner and daughter, Miss Elizabeth, were visitors in Washington last week. Mr. and Mrs. C. A. Hancock, of Huntington, W- Va., are spending several days with rel atives. Dr. L. L- Gayle returned home Monday, after a visit of several days to him mother at Fredericksburg. Miss Mary Taylor Gills, of Bedford, spent th e week-end with her parents, Mr. and Mrs W. P. Giiis. Miss Margurite L- Coppage, field nurse for the southside health district, was in town I Monday.  Mrs. W- H Connor, who un derwent an operation at the"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Trent. Mrs. J. D. <mark>Plunkett</mark>, who has been a"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Trent. Mrs. J. D. <mark>Plunkett</mark>, who has been a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [247.19, 528.94, 418.79, 974.13], "bbox_id": "b2bbfe19d7", "file": "AppomattoxNewspapers_1926-1933a_0230.pdf", "page": 1, "text": "Watt Stanley h a s returned home after a visit to Peters burg and Richmond- Mrs. Luther Morris spent thf week-end visiting relatives inj Nelson County. J. T. Harvey, of Hopewell spent the week-end w i t h his family. Lawson Lee, who was pain fully burned in August, im proves siowly. Mrs- J. E. Blackley has been on a visit to relatives in Reidsville, N. C. Mrs. Helen Welch, who has been sick this week is able to be out, again. A. H. Clement, who has been  on a trip to Roanoke and Lynch burg, returned home Monday. 1 Miss Marion Wagner, ot j Pearisburg, spent the week-end j with her parents, Mr- and Mrs. R- C. Wagner. Miss Frances Fox, of the State Teachers College, was the week-end guest of Miss Mary Trent- Mrs. J. D. Plunkett, who has been a patient in the Baptist hospital, at Lynchburg, has re turned home- Miss Kate OBrien spent the week-end in Richmond, where she attended the V. M. I- and Maryland football game."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Trent- Mrs. J. D. <mark>Plunkett</mark>, who has been a"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Trent- Mrs. J. D. <mark>Plunkett</mark>, who has been a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.13, 455.41, 1155.05, 554.21], "bbox_id": "126957c0d8", "file": "AppomattoxNewspapers_1949-1952a_0383.pdf", "page": 1, "text": "was a member of the Liberty t Church, where funeral serv- eie held Friday afternoon at, clock, conducted by the pas-, r. V. W. Sears. Burial was in oleman family cemetery. Ac- ,ail bearers were Dave Plunk- arland Plunkett, Warrick Mar- Robert Odor, Julian Coleman rnest Layne."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "were Dave Plunk- arland <mark>Plunkett</mark>, Warrick Mar- Robert Odor,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "were Dave Plunk- arland <mark>Plunkett</mark>, Warrick Mar- Robert Odor,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1135.18, 1124.85, 1300.83, 1164.54], "bbox_id": "6333e1db8c", "file": "AppomattoxNewspapers_1954-1955a_0300.pdf", "page": 1, "text": "WANTED Woman for house work. White or Colored. Mrs. Anna C. Plunkett, ltp Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "WANTED Woman for house work. White or Colored. Mrs. Anna C. <mark>Plunkett</mark>, ltp Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "WANTED Woman for house work. White or Colored. Mrs. Anna C. <mark>Plunkett</mark>, ltp Appomattox, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1139.29, 1019.23, 1307.96, 1058.47], "bbox_id": "e1e4faf030", "file": "AppomattoxNewspapers_1954-1955a_0021.pdf", "page": 1, "text": "WANTED Settled woman to do housework. White or colored. Mrs. Anna C. Plunkett, Box 401, Appo mattox, Va. itp"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "WANTED Settled woman to do housework. White or colored. Mrs. Anna C. <mark>Plunkett</mark>, Box 401, Appo mattox, Va. itp"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "WANTED Settled woman to do housework. White or colored. Mrs. Anna C. <mark>Plunkett</mark>, Box 401, Appo mattox, Va. itp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [400.38, 942.42, 1345.81, 1046.73], "bbox_id": "8811ddd266", "file": "AppomattoxNewspapers_1954-1955a_0268.pdf", "page": 1, "text": "WANTED Settled woman for house work. All modern convenien ces. Mrs. Anna Plunkett, Box 401, Appomattox, Va. ltp APPOMATT02 Farm ers Supply!"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "WANTED Settled woman for house work. All modern convenien ces. Mrs. Anna <mark>Plunkett</mark>, Box 401, Appomattox, Va. ltp APPOMATT02 Farm ers Supply!"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "WANTED Settled woman for house work. All modern convenien ces. Mrs. Anna <mark>Plunkett</mark>, Box 401, Appomattox, Va. ltp APPOMATT02 Farm ers Supply!"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1143.39, 1314.03, 1311.74, 1360.01], "bbox_id": "cef7727970", "file": "AppomattoxNewspapers_1952-1954a_0602.pdf", "page": 1, "text": "WANTED Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. Plunkett, Appomattox, Va. ltp"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "WANTED Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. <mark>Plunkett</mark>, Appomattox, Va. ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "WANTED Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. <mark>Plunkett</mark>, Appomattox, Va. ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [495.35, 1172.68, 630.0, 1478.73], "bbox_id": "790ea38064", "file": "AppomattoxNewspapers_1912-1915a_0024.pdf", "page": 1, "text": "W T Steele, L M Franklin, labor  C C Gunter,  ............  Loyd Goto.  ............  Jim Jamison,  ............  W V Pnlliam,  ............ Duff Ma tin,  ............ Ed Gunter,  ............  Taylor W right,  ............ Rich. McKinney  .......... Oct. 26, Freight on 6 blade b its for C. H. tt. Board ........................ Nov. 1, Va. Metal Culvert Co. for C. H. culverts......................... Nov. 8,8 A Ferguson, labor............... Nov. 9. Western Wheeled Scraper Co, for C. H. B. Board ............. 1912  , . - Jan. 18, Freight on 2 cars cinder.....  N Sc w By Co, loading cinder Geo D Lee, unloading  L 8 McCormick,   BM Almond, C C Gunter, D L viartln, labor ............... J 8 Plunkett,  .......... .  Appoma.tox H ardware Co, supplies ............................... - Jan. 24, Oscar Hall, labor ...............  W alter Harvey, ............ Mcb. 11, E It Abbltt,  ............... Apr. 1, KJ Tora.n,  ......... - A pr 20, J 8 Plunkett, ............... R B Poore.  ................ 8 w Harvey, ............... Chas Kush,  Tom Lee,  ............... K T Lee.  ............... C B Godsey ....... ........ Bob Craig,  ................. Jno Christian, keep of team May 8, J H Mnrtin. labor ............ May 18. U S Coleman,  ............ June 14, J T Wooldridge,  ........ Travis T Wooldridge, labor Jno Fore, Jno W Overton, B L Dove, 1 a C Maberry, for b ridge... . Ferguson  Smith, supplies L E Smith, frt. on m achines"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "viartln, labor ............... J 8 <mark>Plunkett</mark>,  .......... .  Appoma.tox H ardware Co,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "viartln, labor ............... J 8 <mark>Plunkett</mark>,  .......... .  Appoma.tox H ardware Co,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2321.31, 653.89, 2462.4, 932.98], "bbox_id": "597e93ad25", "file": "AppomattoxNewspapers_1943-1947a_0383.pdf", "page": 1, "text": "W. P. Odor P. O. Paulett N. H. Cheatham Miss Frankie McKinney Miss Janie McKinney J. D. Plunkett Mrs. W., H. S. Barlow L. W. Garrett J. A. Amrhein Mr. and Mrs. H, Frederick Jones Mr. Reynolds Mrs. Bertha Gills Drug Store Employees Cassco Corporation Va. Electric Power Co. Central Va. Electric Co. Anonymous W. S. Taylor Carl Spatz Mr. Coleman H. C. Pulliam Employees, H. C. Pulliam Mr., Mrs. 0. L. Scheffler Mr., Mrs. F. C. Dresser Miss Hilda Carter Mr., Mrs. A. R. Gobble Farmers National Bank Employees, Farmers N, Appox. Hdwe. Co. Inc."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Janie McKinney J. D. <mark>Plunkett</mark> Mrs. W., H. S."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Janie McKinney J. D. <mark>Plunkett</mark> Mrs. W., H. S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1241.96, 1446.51, 1523.51, 1568.77], "bbox_id": "fdd4310936", "file": "TimesVirginian_1978_0270.pdf", "page": 1, "text": "W INNER OF QUILT - Mrs. Shirley Dillard of Route 2, Appomattox, second from left, beams with delight over the quilt she won when her name was drawn from all those making donations to the Log Cabin quilt made by Appomattox County Extension Homemakers, and displayed at the Patchwork Festival June 10 -11,1978. Others in picture are, left to right, Ethel Evans, County Chairman Reba Bruce and Louise Plunkett, Co-Chairman of the Patchwork Festival. Patchworic Festival Quite Successful"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Reba Bruce and Louise <mark>Plunkett</mark>, Co-Chairman of the Patchwork"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Reba Bruce and Louise <mark>Plunkett</mark>, Co-Chairman of the Patchwork"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [673.69, 1260.09, 837.95, 1774.03], "bbox_id": "e7232afd22", "file": "AppomattoxNewspapers_1892-1898a_0519.pdf", "page": 1, "text": "W heat is looking well in th is vi cinity. Some of the farm ers are planting tobacco and some are pre paring the land. Miss Sis Singleton has returned from a ideasant visit to her sister, Mrs, Blanks near Lynchburg. Mrs. David Bates is quite sick. Hope she may soon recover. Miss Evie Jones is ill also, we re gret to say. Miss H attie Brightwell of Concord visited her sister Mrs. W alter Mar tin last week. We are glad to say th at Misses Maccie and Lily Simms are well again. Mr. Samuel W heeler of Brookneal while on a visit to his grandfather, Mr. Abe Singleton, was very badly h u rthe weDt to W est Appomattox and returned on the local, when the train reached Spout Spring it did not stop and Mr. Wheeler aimed to jum p from the train and was very badly injured. It is feared he will loose his arm. Mr. J. B. Plunkett of Prince E d ward paid hi3 sister Mrs. Jno. Rob ertson a visit Saturday. Mr. Glover Harvey and sister and Miss V ira Haryey o f Chap and two Messrs. K id were guests of the Misses Spencer Sunday. The members of Salem church are talking of building a new church as old Salem is looking rather delapi- dated. W ar is talked of everywhere, all we can say is we hope it will soon be over and not mfcny of onr citizens killed. B e a t r ic e ."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "arm. Mr. J. B. <mark>Plunkett</mark> of Prince E d"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "arm. Mr. J. B. <mark>Plunkett</mark> of Prince E d"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1916.89, 340.0, 2084.62, 833.32], "bbox_id": "5700a63d46", "file": "AppomattoxNewspapers_1952-1954a_0553.pdf", "page": 1, "text": "W ELLS . CARTER Miss Mattie Virginia Carter, daughter of Mr. and Mrs. T. R. Carter, Sr., of Appomattox, became the bride of Fred Neal Wells, of Knoxville, Tennessee, son of Mrs. Dorothy Wells and the late Mr. Wells at 800 P. M., Saturday, April 10, 1954, in the New Hope Baptist Church, Vera, Virginia, with the Rev. John P. Leitner, pastor, officiating. The church was decorated with ferns, gladioli and ivy, and lighted with candlehras. Music was render ed by Miss Rosa Mae Wooldridge, soloist Mrs. David Plunkett, violin ist, and Miss Easly Shuford, pianist. Given in marriage by her father, the bride wore a gown of Chantilly lace and satin. Her fingertip veil was caught to a sequin and pearl bandeau. She carried a Bible, with gardenias and stephanatosis. Mrs. Robert M. Morris was matron of honor. She wore a dress of pink taffeta, and carried a bouquet of purple dutch iris and pink roses. Bridesmaids were Mrs. William Rumble, of Phidelaphia, Pa., and Miss Shirley Duncan, of Pulaski. They wore blue and yellow taffeta dresses with net, and carried bou quets of yellow dutch iris and yel low roses. Lois Morris, niece of the bride, was flower girl. Jerry Wells, brother of the bride groom was best man. Groomsmen were David W. Carter and Robert M. Morris. A reception was given in the home of the brides sister. She was assisted in serving by Mrs. Richard Carter and Mrs. William D. OBrien. The bride is a graduate of the Vir ginia Baptist Hospital School of Nursing. After a wedding trip, the couple will make their home at Knox ville, Tennessee."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Wooldridge, soloist Mrs. David <mark>Plunkett</mark>, violin ist, and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Wooldridge, soloist Mrs. David <mark>Plunkett</mark>, violin ist, and Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2212.73, 653.35, 2375.92, 1288.8], "bbox_id": "35fa9bd0ab", "file": "AppomattoxNewspapers_1905-1912a_0396.pdf", "page": 1, "text": "W e hear of m any cases of fever in different sections of the oounty, but so far this im  m ediate neighborhood has es caped. We are glad to note that Mrs. Oscar Cheatham , from near Reedy Springs, who hur been so very fill w ith typhoid fever, is bettor. Mrs. Dougla Marshall is also ab ut well. Mrs. S P Coleman is spend ing some time with hqr daugh ter, Mrs. Clinton Caw thorn, who is sick. Mr. and Mrs. Ben Cole and little Byron, nd Mr. Oseat Cole left Friday to visit re la  tives in Pittsylvania. Miss Florence Morgan and brother, Tunstall, entertained the Social Club most charm  ingly at their fath ers homt near your town recently. Mrs. Paul W arren and child- r n, of South Norfolk, are visit ing her parents at Mountain View. Miss Elvyn Coleman has also returned homo after quite hn extended visit with her sister in Victoria and South Norfolk. Mr. Obie Mann, of High Bridge, visited his parents, Mr. and Mrs. Wm Mann, recently Messrs. Gilliam and Leslie Mann, who have been sick, are out ajgaiu. L ittle Miss Mabel Plunkett, who has been visiting relatives in the Southside, has returned home. Mr. Geo. Coleman, who has been spending the week at home, returned to his work at Petersburg on yesterday. Mr. Allen Odor, of Pocahon tas, W. V a., visited his uncle, Mr. T. W . Odor last week. Rev. Thomas Fitzgerald, of H untington, W. V a., visited his sister, Mrs. A nna Coleman, last week."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "L ittle Miss Mabel <mark>Plunkett</mark>, who has been visiting"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "L ittle Miss Mabel <mark>Plunkett</mark>, who has been visiting"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1154.86, 430.43, 1323.16, 481.47], "bbox_id": "eb5e31fd1e", "file": "AppomattoxNewspapers_1952-1954a_0397.pdf", "page": 1, "text": "W ANTED- Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. Plunkett, Box 401, Appomattox, Va. ltp"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "W ANTED- Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. <mark>Plunkett</mark>, Box 401, Appomattox, Va. ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "W ANTED- Housekeeper, white or colored. All modern conveniences. Mrs. Anna C. <mark>Plunkett</mark>, Box 401, Appomattox, Va. ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.13, 1249.84, 1675.93, 1376.24], "bbox_id": "19af45700e", "file": "AppomattoxNewspapers_1939-1943a_0441.pdf", "page": 1, "text": "W , Mrs. Barry Dahl entertained Wed nesday evening with a handkerchief shower and theatre party in honor of Mrs. Garland Plunkett, who leaves Saturday to join her husband at Fort Benning, Ga. Guests present included Mrs. Dave Plunkett, Miss Alice Harwood,  Mrs. B . F . Moomaw, Misses Louise and Harriett Lee Rob ertson, Mrs. B. G . Anderson, Mrs. C. T j .McDearmon, Miss Beulah Ferrell, Mrs. Hunter Dickerson, Mrs. J , C . Price, Mrs.Robert Lynch and Mrs. Garland Kidd."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "honor of Mrs. Garland <mark>Plunkett</mark>, who leaves Saturday to"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "honor of Mrs. Garland <mark>Plunkett</mark>, who leaves Saturday to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [509.07, 1416.5, 2228.11, 1488.4], "bbox_id": "c76e479607", "file": "AppomattoxNewspapers_1960-1962b_0220.pdf", "page": 1, "text": "W . Covington. For Rent Six-room house fltxaUh, eledtric hot water he wired for electrilp stove and heat. If interested call Mrs. J. Plunkett. Fhjone 35242965, A mattoX, Va. ltp"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "W . Covington. For Rent Six-room house fltxaUh, eledtric hot water he wired for electrilp stove and heat. If interested call Mrs. J. <mark>Plunkett</mark>. Fhjone 35242965, A mattoX, Va. ltp"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "W . Covington. For Rent Six-room house fltxaUh, eledtric hot water he wired for electrilp stove and heat. If interested call Mrs. J. <mark>Plunkett</mark>. Fhjone 35242965, A mattoX, Va. ltp"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [569.3, 365.24, 711.55, 439.99], "bbox_id": "c1be10c8e0", "file": "AppomattoxNewspapers_1962-1965a_0280.pdf", "page": 1, "text": "Visitors ip the home of Mrs. W. F. Grishaw during the vreek end were Curtis V. Nester, Rich ard H. Grishaw and son, Barry Mi, and Mrs. J. B. Thomas Mrs Anna Ward and daughter, Mrs. Plunkett, of West Va., and Jun ior Nester, of Sandston, Va."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Ward and daughter, Mrs. <mark>Plunkett</mark>, of West Va., and"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Ward and daughter, Mrs. <mark>Plunkett</mark>, of West Va., and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2028.55, 702.19, 2167.1, 807.24], "bbox_id": "7e24c4ba8c", "file": "AppomattoxNewspapers_1971-1973a_0373.pdf", "page": 1, "text": "Visiting in the home of Mr. and Mrs. Cliff Plunkett for the holidays were Mr. and Mrs. R. B. Plunkett, Jr. and Libby, and Mrs. Bliss Foster of Bur- lubgtibm B, C,M Nr, abd Nrs, Vernon Goode and son, Jay, of Radford and Mr. and Mrs. R. B. Plunkett, Sr. of Montgomery, West Virginia."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Mr. and Mrs. Cliff <mark>Plunkett</mark> for the holidays were"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Mr. and Mrs. Cliff <mark>Plunkett</mark> for the holidays were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.99, 417.47, 1838.3, 987.16], "bbox_id": "569d86c2a5", "file": "AppomattoxNewspapers_1939-1943a_0408.pdf", "page": 1, "text": "vis Doyle, of Roanoke, were recent guests of Mr. and Mrs. I t. M. Burge. Mr.and Mrs. H. M. Bu.gj, Miss Katherine Burge, Mr arid Mrs. H. E. Burge, and Miss Frunzes Burge, of Petersburg, and the Rev. Loyd Moore, of Hampton, were recent dinner guests of Mr.and Mrs. J..T. Mcore, of Beckham. Walter W. Scott, who is working at Blackstone, is pending some time here. Cameron Seay, of Richmond, spent the week-end in the home of Judge and Mrs. J.W.Flood. Mr. and Mrs W.L.Farmer have purchased the H . G. Johnson resi dence in Hillcrest, and expect to occupy same in February. Mrs. H. P. Davis spent last week , in Richmond.  Mrs. W. H . Conner and son, Billy, were recent visitors in Bed ford. Miss Isabell Ranscn, who has been employed at the Bonnie Beauty Shoppe, has accepted a position in Covington. Friends and relatives gave Mrs. J . N . Phelps a house warming re- . cently. Many useful gifts were re ceived. Recent guests of Mr.and Mrs. Ernest Rogers were Mrs. R. E . Fore and children, of Pamplin, and Miss 3ertha Rogers, of Lynchburg. Private Norman Ferguson recent- y visited his parents, Mr, and Mrs. Marshall Ferguson. Many friends called to see him. Mr. and Mrs. Clinton Cawthom cently visited in the home of Mrs. .S . Plunkett. Other guests were -Irs. H.T.Plunkett and children, of Vngean, W.Va., and Mr.and Mrs. Theodore Zastrow, and children, of Dillwyn. Joe Ferrell, who has been work- ng in Baltimore, has returned home. Mrs. Robert Lynch and Mrs. C. 1. OBrien have returned to their Tomes here after spending a week vith Mr.end Mrs. Herman Swizer, f Elm Grove, W.Va."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "home of Mrs. .S . <mark>Plunkett</mark>. Other guests were -Irs."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "home of Mrs. .S . <mark>Plunkett</mark>. Other guests were -Irs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.3, 762.03, 1769.61, 855.83], "bbox_id": "95ecba865d", "file": "AppomattoxNewspapers_1892-1898a_0119.pdf", "page": 1, "text": "VICE-PRESIDENTS. J. T. Lee,1 T. A. Smith, J. R. Atwood, J. P.L.Fleshman, P. R. Wooldridge, J. S. Plunkett, ___ _  C W.-Hancock. J. R. Hill, Secretary. W. S. Royal, Corresponding Secy. E. M. Craig, Treasurer."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "R. Wooldridge, J. S. <mark>Plunkett</mark>, ___ _  C W.-Hancock. J. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "R. Wooldridge, J. S. <mark>Plunkett</mark>, ___ _  C W.-Hancock. J. R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [197.05, 677.14, 364.68, 1345.19], "bbox_id": "cd755946ab", "file": "AppomattoxNewspapers_1902-1905a_0555.pdf", "page": 1, "text": "VERbeiir I,!je lattonsbull- fiddle played? asked Mc- Feak. the singing school master. Naw, said Tobias  Strong, taking careful aim at a box of ashes already well saturat ed with a fertilizing solution of nico tine, whats a bull-fiddle? Its a contraption calculated to make you wish you were In the here after or hadnt left the heretofore, said MePeak. Wliats it fur? asked Tobias. Fox-drivers, boilings and tilings generally where a noise is wanted, said MePeak. Where! Lije git it? asked Tobias, squinting- his eye at the box of ashes for a more sure aim. Made It, said MePeak. Made it? queried I.ije. Yes, said MePeak, Lije can do anything from knitting a garter to sawing logs. Never saw but one thing In my life that Lije couldnt do if he set out to. Whats that interest. Get away from the Widow Parker. He tried it, lait couldnt make it, said MePeak, with a mournful shake of the head,  twns a great loss to the country when I.ije got married. Whercd he go to? asked Tobias. O, hes living over on Pleasant Ridge, but dont amount to nawthlug, responded MePeak. Sho, MePeak, remonstrated Deacon Plunkett, T.IJs all right. Belns youve r.e-.er married youve no right to judge In such matters. I.ijes settled down like a man orto when hes mar ried. O yes, hes settled down, admitted MePeak, sarcastically, lies settled so hard that ho never cracks a smile unless the linby cuts a tooth or some fool thing like that. Lije used to bo a great one, lie added regretfully, be fore the Widow Barker got hold of him. Ah, well, MePeak, everybody hes to be a fool sometime, drawled Tobias, still eyeing the ash-box. Wheres th bull-fiddle? Yes, where is it? echoed MePeak. Thats what Id like to know. No body knows excepting the Widow Barker, and I guess shed die before shed tell. Wlints she got agin It? asked Tobias. O, wliats any woman got against anything? responded MePeak. es pecially widow women? Now, MePeak, again interposed Deacon Plunkett, you know that the Widow Barker nor no other woman ever liked to hear that bull-fiddle played. They liaint one of em thet ever heard It but would a busted It if sho could. Must be a queer soundin thing, commented Tobias, whats It made"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Sho, MePeak, remonstrated Deacon <mark>Plunkett</mark>, T.IJs all right. Belns"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Sho, MePeak, remonstrated Deacon <mark>Plunkett</mark>, T.IJs all right. Belns"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.17, 993.77, 1679.45, 1182.56], "bbox_id": "fbd9d7f858", "file": "TimesVirginian_1976_0039.pdf", "page": 1, "text": "United States Military Aca demy between 1825 and 1929. He also pointed out that Colonel Lee returned to West Point as its Superintendent from 1852 to 1855 and how his time spent at West -Point rounded out his training as an administrator and gave jiim experience in deaBng with people. , Mrs. Lena Eversole, Presi dent of the local chapter, presided at the meeting and Mrs.Rachel Lawson, Mrs. Cliff Plunkett, and Mrs. Walter FerreU were in charge of arrangements for the dinner."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Mrs.Rachel Lawson, Mrs. Cliff <mark>Plunkett</mark>, and Mrs. Walter FerreU"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Mrs.Rachel Lawson, Mrs. Cliff <mark>Plunkett</mark>, and Mrs. Walter FerreU"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2197.37, 818.76, 2349.12, 1255.79], "bbox_id": "6e66390df8", "file": "AppomattoxNewspapers_1974-1975a_0039.pdf", "page": 1, "text": "UDC Holds Convention The 79th Annual Convention was held this year at the Hilton Inn in Virginia Beach, Virginia. Those attending from Appo m attox were Mrs. Lena I Eversole, president, Appomat tox Chapter, Mrs. Harriett Cunningham, first Vice-presi- I dent, Mrs. Cliff Plunkett, Virginia Division Registrar,  Mr. and Mrs. Calvin Roblnson, Miss Mamie Cultop and Mrs. Rachel Lawson. Memorials were given for all deceased members a t the Galilee Episcopal Church at Virginia Beach and a wreath I was made up of white I carnations on green easil and this wreath was taken to Norfolk and placed at the Confederate Monument there. Our own president made a lovely report on the activities that our chapter has taken part in this year. The banquet waa lovely the setting was Love - colors were - red and green. Mrs. Lawson was such a gracious hostess. She invited us to stay in her cottage and I must say it waa lovely. The ocean breeze, sun rise and sun set was so pretty. Wish I were an artist - with brush and easel The convention next year will be in Arlington, Virginia."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "I dent, Mrs. Cliff <mark>Plunkett</mark>, Virginia Division Registrar,  Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "I dent, Mrs. Cliff <mark>Plunkett</mark>, Virginia Division Registrar,  Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [543.6, 171.25, 688.64, 678.24], "bbox_id": "d20c2b6a30", "file": "TimesVirginian_1976_0193.pdf", "page": 1, "text": "UDC DINNER MEETING The Appomattox Chapter of the United Daughters of the Confederacy met on Thurs., May 20 at6 p.m. at the home of Mrs. Helen Gunter. There were 17 members and one visitor in attendance. Pledges to the United States Flag and salutes of the Virginia Flag and the Confederate Flag were led by the president, Mrs. Lena Eversole. The ritual was read by Mrs. Mary Moore and the Confederate prayer by Mrs. Geneva Childers. An invitation has been extended to members to attend the Massing of the Flags in Richmond on Thurs., June 3. Members are planning to enter a float in the 4th Railroad Festival to be held Oct. 15 and 16. Mrs. Eversole appointed the following committee for this - Mrs. Noma Rae Moore, chairman and Mrs. Harriett Cunningham, Mrs. Lena Ever sole, Mrs. Mary Moore, Mrs. M argaret Lee, Mrs. Ruby Lewis, Mrs. Louise Plunkett and Mrs. Frances Harvey. Cards are being sent to our shut-ins. Mrs. Lucille Ferrell, histor ian, gave an interesting talk on William Ranson Pegram, a colonel during the Civil War, who is described by one of his officers as The Truest Christian, the most faithful and the most superb soldier in all the world. Mrs. Marion Tweedy return ed thanks for our evening meal. A memorial service was then"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Ruby Lewis, Mrs. Louise <mark>Plunkett</mark> and Mrs. Frances Harvey."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Ruby Lewis, Mrs. Louise <mark>Plunkett</mark> and Mrs. Frances Harvey."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1857.6, 1419.47, 2031.04, 1771.99], "bbox_id": "c32b994124", "file": "AppomattoxNewspapers_1954-1955a_0181.pdf", "page": 1, "text": "uary 1, 1954 to December 31, 1954 Cash balance, Dec. 31, 1953. .62.65 Cash Receipts From Campaign Director.. 1419.11 Refund from Medical College of Virginia Hospital, ac count No. B-147-687 . . . . . . 8.25 Total receipts .................. 1490.01 Cash Disbursements Patient care for five cases, stricken before 1954 . . . . 1332.55 General Administrative ex pense ..............................  Total disbursements 1334.69 Cash balance Dec. 31, 1954.. 155.32 Total unpaid bills at Dec. 31, 1964, cases stricken before 1954 3206.25, Total unpaid bills at Dec. 31, 1954, stricken in 1954 .. 1029.40 Total unpaid bills .......... 4235.65 -Mrs. Joel W. Flood, Chapter Treasurer. I have examined the accounting records of Appomattox County Chap ter of the National Foundation for Infantile Paralysis, and in my opin ion the above statement and sup porting schedules present fairly the financial position of the Chapter at December 31, 1954, and the results of its operations for the year then ended. signed J. Garland Plunkett, January 3, 1955. Auditor"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "ended. signed J. Garland <mark>Plunkett</mark>, January 3, 1955. Auditor"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "ended. signed J. Garland <mark>Plunkett</mark>, January 3, 1955. Auditor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.51, 510.23, 1617.03, 549.23], "bbox_id": "fe1e0c673b", "file": "AppomattoxNewspapers_1949-1952a_0369.pdf", "page": 1, "text": "U D. C.will meet with Mrs. Scott June 21 at 3 P. M. ott, Mrs. J D. Plunkett and j ara Davis will be joint hos-"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "U D. C.will meet with Mrs. Scott June 21 at 3 P. M. ott, Mrs. J D. <mark>Plunkett</mark> and j ara Davis will be joint hos-"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "U D. C.will meet with Mrs. Scott June 21 at 3 P. M. ott, Mrs. J D. <mark>Plunkett</mark> and j ara Davis will be joint hos-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [703.92, 638.43, 852.27, 1208.12], "bbox_id": "d6303dc6f1", "file": "TimesVirginian_1976_0147.pdf", "page": 1, "text": "U D C Meeting The Appomattox Chapter of the United Daughters of the Confederacy met on Thursday, April 15, at 730 p.m. at Farmers National Bank, T ri-. angle Plaza Branch. There were 17 members ip attendance. Pledges to the United States Flag and salutes of the Virginia Flag and the Confederate Flag were led by toe president, Mrs. Lena Eversole. The ritual was read by Mrs. Frances Harvey. Also the Confederate Prayer by Mrs. Harvey. Mrs. Frances Harvey, secre tary, read the minutes of the last meeting which were approved. Mrs. Louise Plunkett gave a report on the memorial fund. Members voted. to donate 10.00 to the Skip Island Memorial Fund, ft  t Mrs. Eversole announced that the 3rd District Confer ence will meet on May 22 at 10 a.m. at the Parish House of the Trinity Episcopal Church, Main St., South Boston Va. Mrs. ucille Fertoll, histo Ian, gaVq an interesting talk on EdmundRuffins. Mrs. C. A. Moore led the group in singing southern songs, closing with Blest Be the Tie That Binds. Delicious refreshments were served by the hostesses Mrs. Wiley Moore,  Mrs. Alton Moore, Mrs. Claude A. Moore, Mrs. H. L. Wilkerson, Mrs. E. J. Hillsman and Mrs. B. Curray Harvey. The May meeting will meet on May 20 at 6 p.m. in the home of Mrs, Helen Gunter for a covered dish supper. Mrs. Tilden Lee, U.D.C Publicity"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "were approved. Mrs. Louise <mark>Plunkett</mark> gave a report on"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "were approved. Mrs. Louise <mark>Plunkett</mark> gave a report on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1472.13, 1547.08, 1640.73, 1649.43], "bbox_id": "2532a7fb64", "file": "AppomattoxNewspapers_1955-1957a_0028.pdf", "page": 1, "text": "U. D. C. MEETING The Appomattox Chapter of the United Daughters of the Confeder acy will meet Thursday evening, December 8 , at 8 oclook in the home of Mrs. Jerry A. Burke. Mrs. Burke, Mrs. J. D. Plunkett and Mrs. Joel W. Flood will be joint hostesses. Miss Julia Asher, chapter historian, will have charge of the program."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Burke, Mrs. J. D. <mark>Plunkett</mark> and Mrs. Joel W."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Burke, Mrs. J. D. <mark>Plunkett</mark> and Mrs. Joel W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1159.45, 228.31, 1985.45, 799.58], "bbox_id": "f7ad47093b", "file": "AppomattoxNewspapers_1971-1973a_0195.pdf", "page": 1, "text": "Two new directors were el ected Thursday, Jan. 20 at the annual members meeting of Co- operativeBuilding and Loan As sociation, Lynchburg. Members of the Appomattox Chapter, United Daughter of the Confederacy, meeting Thursday evening at Maudes for their annual dinner honoring Confed erate heroes Lee, Jackson and Maury, expressed disappoint ment that the scheduled speak er could not appear, but they were rewarded, otherwise, in the substitute speakers who presented historical papers and facts of interest. Mr. Jerry A. Burke, Appo mattox businessman and retired superintendent of Appomattox schools, found that he could not be present. Three chapter members volunteered to be a part of the evening  Mrs. Rachel F. Lawson, who read an account of Surrender at Appo mattox on April 9, 1865 M rs. Lucille Ferrell, who read an account concerning R . E. Lees mother and Mrs. Wiley Morris, who dipped even further back into history to read the will of General George Washingtons mother. Mrs. Clifford Plunkett, re gistrar for the Va. Division, was in charge of registration of members and guests for the ev ening affair. Mrs. Lawsons paper was a copy of a personal interview she held with Martha Mildred Ste vens Craig, an interview which was printed about 31 years ago. In the account Martha Mildred  Aunt Millie , told of her en counters with Union troops in the old village of Appomattox on April 9, 1865. She was nurse maid to Charles Sackett Peers at the time. Little Charles father, George Peers, was clerk of court. The faithful nursemaid hid herself and the child until the shooting ceased in the village."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Washingtons mother. Mrs. Clifford <mark>Plunkett</mark>, re gistrar for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Washingtons mother. Mrs. Clifford <mark>Plunkett</mark>, re gistrar for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2229.3, 560.61, 2401.05, 1170.47], "bbox_id": "2027856763", "file": "AppomattoxNewspapers_1952-1954a_0385.pdf", "page": 1, "text": "Tuesday of this week, Sunset at Appomattox, a documentary film,, produced in Hollywood, had its pre miere before a blue ribbon list of dignataries in Lynchiburg. Nearly 200 saw the advance showing, and came away thrilled at the splendid reproduction of the events of April 9, 1865 at Appomattox. At a dinner at the Virginian Ho tel preceding the showing, Represen tative W. M. Abbitt was toastmaster. Fred Helsaibeck, vice-mayor of the City of Lynchburg, gave the invoca tion. Distinguished guests, including educators and historians, were intro duced. Major-General U. S. Grant, III, grandson of Ulyssis S. Grant, spoke briefly, praising the peace at Appomattox reuniting the na tion. Rev. Richard H. Lee, a kinsman of R. E. Lee, spoke in the same vein. William A. Hart, director of adver tising, E. I. DuPont Company, pro ducers of Sunset at Appomattox, told the story of how the film, was made. Conrad L. Wirth, Director, National Park Service, thanked the DuPont Company for this documen tary contribution. Sunset at Appomattox will be televised nationally on DuPonts Cavalcade of America program, over ABC network, Tuesday night, Oct. 20. We understand WLVA - TV, in Lynchburg carries this program at 730 P. M. Attending the luncheon and the Premiere ... from Appomattox were r Mr. and Mrs. W. M. Abbitt, Mr. and Mrs. Chas. T. Moses, Judge and Mrs. Joel W. Flood, Mr. and Mrs. H. A. Gurney, Mr. and Mrs. D. T. Robert son, Mr. and Mrs. George Abbitt, Jr. C. W. Smith, Mr. and Mrs. J. A. Burke, Mr. and Mrs. C. T. Moses, Jr. Mrs. Charles Crawley, Mrs. C. M. Stratton, Mr, and Mrs. Calvin H. Robinson, Miss K u li a Ferrell, Mrs. E. Carroll Smith, Mr. and Mrs. J. H. OBrien, G. B. Buchanan, Miss Illah Buchanan, Mrs. J. C. Caldwell, Mr. and Mrs. W. W. Burke, Mr. and T. DeWitt Evans, Mrs. Richard G. Janatka, Garland Plunkett, Mr. and Mrs. David A. Christian, III Rev. B. T. Price, Mrs. J. R. Lawson, Mrs. F. C. Dresser, Mr. and Mrs, Otis P. Dewberry, Mr and Mrs. Carl A. Collins, Jr. Mr. and Mrs. Richard D. Robinson,"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Richard G. Janatka, Garland <mark>Plunkett</mark>, Mr. and Mrs. David"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Richard G. Janatka, Garland <mark>Plunkett</mark>, Mr. and Mrs. David"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2121.07, 499.97, 2290.17, 982.06], "bbox_id": "b655a36835", "file": "AppomattoxNewspapers_1955-1957a_0001.pdf", "page": 1, "text": "Tuesday, Nov. 8, is General Election day in Virginia, and a last minute effort is being made to get out a sizeable vote for Appomattox County. There are approximately 2,500 eligible voter in the county, but thus far there has been a min imum of interest, and the size of the actual vote is uncertain. To be elected are unopposed candi dates for the State Senate and the House of Delegates, and a slate of unopposed nominees for county of fices. Polling places will open at 6 A. M. and close at 6 P. M. There are ten precincts in the county. The candidates, all Democrats, are as follows For the State Senate, Chas. T. Moses. For the House of Delegates John B. Boatwright. For Commonwealths Attorney George Abbitt, Jr. For County Treasurer John G. Plunkett. For Commissioner of the Revenue J. H. OBrien. For Sheriff David T. Robertson. For Supervisor in Southside Dis trict F. L. Murphy. For Supervisor in the Stonewall District Otho W. Martin, Jr. For Supervisor in the Colver Hill District Richard Webb. For Justice of the Peace, South- side District Cree to be elected T. W. Moses, Mrs. Lucille S. Con ner and E. T Guill. The officials to be elected Tues day will take office in January. In appealing for a good turn-out of voters next Tuesday, the quality of the candidates listed and the im portance of the eounty maintaining a record for a large vote, were cited as reasons for everyone making an effort to cast their ballots."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "County Treasurer John G. <mark>Plunkett</mark>. For Commissioner of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "County Treasurer John G. <mark>Plunkett</mark>. For Commissioner of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.94, 846.01, 1916.55, 1254.32], "bbox_id": "d6284bc2f5", "file": "AppomattoxNewspapers_1933-1936a_0001.pdf", "page": 1, "text": "Tuesday afternoon. Mrs. Thornton read an inteiesting icpUi paper on Judah Phillip Benja- jfriend Jones told  j some interesting facts aboutduct min Miss Anna at Appomattox, Va., Friday, June 16, 1933, 800 P. M. for iConfederate history. 1 G. D the purpose of electing dele- j Roberta Dinwiddie came in-her d gates to the above named con- the chapter as a new mem-!es, M vention and the transaction ot  may i ber. The following were appoint- lían such other business as properly come before this. legates to theetersburg 1 We meeting. conference! son All legally qualified voters, j A Burke, Jr., Richard ! pal regardless of past party affiili-, Lee Burke, j ane Bllrke, Rober-of ations, who are in accord w ith,ta Dinwiddi6 Alpha Higgen- pallbe the principles of the Republi-- botham, Virginia Christian, can party and m symp y Begg Christian, Caroline Moses,  with its aimes and high pui- Virginia Moses, Doris Lucado, i poses, are invited to unite un- Edith Lucado, Willie Guthrie1 der liis call. . I Anderson, Mildred Lawson, E, B. Martin, Co. Chairman.  Lawrence Moore, . Calhoun W. J. Smith, Secretary Moore Susie Plunkett, Kather- 0 c i j ine Burke, Billie Ould Bud Clearance Sale Quid, Cedl Connor, On my entire line of plants. Petunia, Snapdragons, Canter berry Bells, Pansies, Scarlet  Sage and Zenias, 15c per doz. j Some of these plants have j been going at 35c per doz, so , dont delay. Get your supply j while they last. I also have j more nice Hot and Sweet Pep-, pers, Eggplants, Tomato, Cob- bage and Celery Plants. Mrs. L. M. Wilkes Appomattox, Virginia -------------- o---------------"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Smith, Secretary Moore Susie <mark>Plunkett</mark>, Kather- 0 c i"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Smith, Secretary Moore Susie <mark>Plunkett</mark>, Kather- 0 c i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1355.05, 190.87, 1424.25, 253.87], "bbox_id": "2035c5703d", "file": "AppomattoxNewspapers_1971-1973a_0243.pdf", "page": 1, "text": "tTHi Hostesses fo will be Mrs. D, Hunter Jamer Plunkett, Mrs. .and Mrs. A. J."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "tTHi Hostesses fo will be Mrs. D, Hunter Jamer <mark>Plunkett</mark>, Mrs. .and Mrs. A. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "tTHi Hostesses fo will be Mrs. D, Hunter Jamer <mark>Plunkett</mark>, Mrs. .and Mrs. A. J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1337.02, 283.43, 1613.81, 366.92], "bbox_id": "9a6b4d9f5d", "file": "AppomattoxNewspapers_1926-1933a_0343.pdf", "page": 1, "text": "ton McKinney was Wn last week. Mr. and Mrs. Gorman Mar shall, of Hampton, Va., have ie V. Harwood been on a visit to Mr. and Mrs. fweek-end with her J- S. Plunkett. Te. Mr. Nevel Dinkins is in the ie McKinney spent Farmville hospital suffering"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "with her J- S. <mark>Plunkett</mark>. Te. Mr. Nevel Dinkins"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "with her J- S. <mark>Plunkett</mark>. Te. Mr. Nevel Dinkins"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.6, 981.03, 1826.59, 1228.87], "bbox_id": "b9d704da13", "file": "TimesVirginian_1978_0284.pdf", "page": 1, "text": "to the vuginia flag and the Confederate flag. She also read the ritual. The Confederate prayer was read by Mrs. Mary Sue Gordon. The secretary read the minutes of the last meeting and was appointed. Mrs. Louise Plunkett gave a report on the Massing of the Flags she and H arriett Cunningham, and Mrs. Hazel Lee M artin attended in Richmond June 3, on Jefferson Daviss birthday. For entertainm ent, Mrs. H arriet Cunningham, M rs. Rachel Lawson, and Mrs. Lena Eversole read some interesting poems, and jokes. Lucille Ferrell presented an interesting program on Jeffer son Davis."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "was appointed. Mrs. Louise <mark>Plunkett</mark> gave a report on"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "was appointed. Mrs. Louise <mark>Plunkett</mark> gave a report on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [843.45, 741.23, 986.09, 1087.67], "bbox_id": "285bd0a474", "file": "AppomattoxNewspapers_1962-1965a_0268.pdf", "page": 1, "text": "To the Voters of Appomattox County Ladies and Gentlemen Tuesday, November 5, 1963 will be Election Day. This is the day we vote for the elected Demo cratic Nominees of the July Pri mary If you have been voting by ab sentee or mail ballot and expect to be away on that day, and want to vote, which I hope you will, and I humbly ask you to do. Please let me know, or the f o l l o w i n g know, promptly George F. Abbitt, Jr., Common wealth Attorney Watkins M. Abbitt, Congressman John C. Caldwell, Commissioner of Reve nue, John G. Plunkett, Treasur er L. L. Stanley, nominee for Sheriff C. W. Smith, Clerk John C. Cole, Nominee for South- side District Supervisor Otha W. Martin, Jr., Supervisor for Stonewall District Richard M. Webb, Supervisor, Clover Hill District, or D. A. Conner. Go in person if you can. Carry the members of your family who vote, and ask your friends and neighbors to go out and vote Tuesday, Nov. 5, General Elec tion Day. Thanks, Charles T. Moses"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Reve nue, John G. <mark>Plunkett</mark>, Treasur er L. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Reve nue, John G. <mark>Plunkett</mark>, Treasur er L. L."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1142.66, 1492.61, 1311.95, 1594.51], "bbox_id": "b46dd1af05", "file": "AppomattoxNewspapers_1954-1955a_0307.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1966. Your vote and influence will be appreciated. J. Garland Plunkett. 6-5-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 6-5-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 6-5-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [453.82, 1476.17, 622.04, 1577.16], "bbox_id": "ce953755f5", "file": "AppomattoxNewspapers_1954-1955a_0300.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett. 5-5-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [455.33, 1482.58, 622.68, 1582.82], "bbox_id": "fa998e7b07", "file": "AppomattoxNewspapers_1954-1955a_0294.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett. 5-5-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [435.62, 1451.29, 604.92, 1552.28], "bbox_id": "c8b3b19dc0", "file": "AppomattoxNewspapers_1954-1955a_0287.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett. 5-5-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 5-5-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [415.69, 1464.19, 583.54, 1564.94], "bbox_id": "197572677c", "file": "AppomattoxNewspapers_1954-1955a_0281.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett. 3-31-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 3-31-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 3-31-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [414.95, 1195.58, 584.6, 1297.28], "bbox_id": "9600c12d23", "file": "AppomattoxNewspapers_1954-1955a_0275.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett. 3-31-tfc"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 3-31-tfc"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>. 3-31-tfc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1143.84, 1713.62, 1312.98, 1806.67], "bbox_id": "96387f745d", "file": "AppomattoxNewspapers_1954-1955a_0311.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. J. Garland Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "be appreciated. J. Garland <mark>Plunkett</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [788.37, 1053.83, 956.97, 1144.47], "bbox_id": "c6ff55566e", "file": "AppomattoxNewspapers_1954-1955a_0338.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence will be appreciated. 5-5-tfc J. Garland Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [606.49, 641.81, 776.24, 732.46], "bbox_id": "138bb41d01", "file": "AppomattoxNewspapers_1954-1955a_0325.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primary Election to be held on July 12, 1955. Your vote and influence. will be appreciated. 5-5-tfc J. Garland Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [613.19, 615.65, 782.99, 706.5], "bbox_id": "25e1df226d", "file": "AppomattoxNewspapers_1954-1955a_0332.pdf", "page": 1, "text": "TO THE VOTERS OF APPOMATTOX COUNTY I will be a candidate for election to the office of County Treasurer subject to the Primaiy Election to be held on July 12, 1955. Your vote and influence will be appreciated. 5-5-tfc J. Garland Plunkett."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "appreciated. 5-5-tfc J. Garland <mark>Plunkett</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.29, 288.53, 1703.1, 784.8], "bbox_id": "625d7a8b8d", "file": "TimesVirginian_1981a_0226.pdf", "page": 1, "text": "to make their voices heard in the halls of government. The presentation urges co-op mem bers to communicate with their legislators and let them know their views about pending legislation. . Theme of the meeting will be, Involvement .Your Vote for the Future. There will be special recogni tion for local board and Farm Home Advisory Committee members who retire this year. Nominees for the local board are Roy T. Bennett, George D. Franklin, Concord John C. H arris, Evergreen, Archer Webb, Appomattox. Ladies nominated for the Farm Home Advisory Commit tee are Mrs. Ted W. Lane, Mrs. Cliff Plunkett, Appomat tox Mrs. C. G. Ranson, Pamplin Mrs. Kelley 0. Stratton, Concord. The delegate and alternate nominees in Election District F are Hunt P. Hamilton, B. J. Lucado, Appomattox Boyd Thompson, Lynchburg. FHAS Share A Craft display will be a feature of the meeting. Members and their families are urged to. bring handmade crafts for display. The following committee chairmen will assist with the meeting Attendance and telep- hone-M rs. 0. B. G arriss, Appomattox Greeting and ribbons-M rs. Frederick L. Thomas, Appomattox Refresh- ments -Mrs. Hunt P. Hamilton, Appomattox Decorating-Mrs. Ronald Coleman, Appomattox. Homemade ice cream will be 1 served throughout the day."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "W. Lane, Mrs. Cliff <mark>Plunkett</mark>, Appomat tox Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "W. Lane, Mrs. Cliff <mark>Plunkett</mark>, Appomat tox Mrs. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [612.01, 959.18, 1128.1, 1028.03], "bbox_id": "ec58283c0e", "file": "AppomattoxNewspapers_1954-1955a_0407.pdf", "page": 1, "text": "TO ALL QUALIFIED VOTERS OF COURT HOUSE PRECINCT, APPOMATTOX COUNTY FOR RENT Two partly furnish ed rooms with bath, lightsh, hot and cold water. Clifford Plunkett, Box 401, Appomattox, Va. ltp"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "and cold water. Clifford <mark>Plunkett</mark>, Box 401, Appomattox, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "and cold water. Clifford <mark>Plunkett</mark>, Box 401, Appomattox, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2267.74, 906.23, 2530.62, 968.21], "bbox_id": "5ade9b628d", "file": "AppomattoxNewspapers_1960-1962b_0514.pdf", "page": 1, "text": "tion w ith you r application for license. John 6. Plunkett"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "tion w ith you r application for license. John 6. <mark>Plunkett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "tion w ith you r application for license. John 6. <mark>Plunkett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [620.37, 1033.56, 785.5, 1084.36], "bbox_id": "7121c348a1", "file": "AppomattoxNewspapers_1954-1955a_0344.pdf", "page": 1, "text": "tion Tuesday, July 12, and to gratulate Mr. Plunkett on his instion. Thomas Terrell Martin, ltc  ."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "tion Tuesday, July 12, and to gratulate Mr. <mark>Plunkett</mark> on his instion. Thomas Terrell Martin, ltc  ."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "tion Tuesday, July 12, and to gratulate Mr. <mark>Plunkett</mark> on his instion. Thomas Terrell Martin, ltc  ."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1872.52, 795.38, 2199.76, 1019.02], "bbox_id": "2ce0409fb3", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "tinhnr. at va . , . i 1 ou 0Rn fc on?e consumption bui school at Rdgewobd Ac, eniy.  yyo can avoid it and cure every othe- Mr. Rector is having a new stable iorm, oi fcbfdat iung troubles b erected. He is rapidly i m o r o v i n H t,lie u 0l1 Minute Gough his pretty place.    f o rsalohy.P. R. Wooldridge. Mrs. Weightman, of Lynchburg  vfo,pi cud keep warm ihir has moved in the Plunkett house ! w,nEer ono our air Nght There will be ,. r rly n .e e S f e lf f lt, S S b t S f V .. 1 at Salem church th first Sunday - ----- 7 -- - ----- - ------ i- aud Monday in November  T im e s Wanting to cor- Misses Kate Bates and Ada  f ui aker have returned from  io., Lynehbing in regard to sale an extended I of tobacco I looked over your papei visit to Amherst, much to the joy of j to hud their number, but did not eee our youug men. ther advt., in your paper. Please Mr. Nat Moriiss, from beloiy old! r, 1 yu know iu courthouse passed Monday on bis  Mount VR i ? a f  T i l . R. way to Lynchburg with a lot of Buckingham Co., Va.  beeves- Vc knoT,-, of sc such concern in Messrs. E. G. Bright well, of the j Lynchburg, unless it be Chris"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "has moved in the <mark>Plunkett</mark> house ! w,nEer ono our"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "has moved in the <mark>Plunkett</mark> house ! w,nEer ono our"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1730.98, 255.14, 1868.88, 368.59], "bbox_id": "7548365630", "file": "AppomattoxNewspapers_1974-1975a_0161.pdf", "page": 1, "text": "Tim Appomattox Homemak tension Club will meet Tues., Jan. 28, at 10 a.m. in the home of Mrs. Doris Brock well. 1 ne meeting had been schedul ed for Jan. 21 but was cancelled u to weather conditions. Co-hostesses for the meeting Wj . .  rs Louise Plunkett  a ii  usseU Jamerson. Allmembers are urged to"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "meeting Wj . .  rs Louise <mark>Plunkett</mark>  a ii  usseU Jamerson."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "meeting Wj . .  rs Louise <mark>Plunkett</mark>  a ii  usseU Jamerson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [461.07, 298.38, 1373.27, 881.96], "bbox_id": "063d30132f", "file": "AppomattoxNewspapers_1952-1954a_0396.pdf", "page": 1, "text": "THURSDAY THE TIMES-VIRGINIAN, APPOMATTOX, VIRGINIA PAGE TEN Birthday List Clover Hill Club Meets Oakville W. T. Childers, Oct. 7. Mr. Chil ders observed his 70th birth day. Congratulations!. Clyde Childers, Oct. 28. Carolyn Childers, Oct. 5. Mrs. Ida Beale, Oct. 18. Etta Beale, Oct. 6. James Beale, Oct. 26. Bennie Beale, Oct. 29. John Megginson, Oct. 25. Mrs. Robert Gilbert, Oct. 16. Mrs. Rosa Mitchell, Oct. 15. Mrs. iSusie Perdue, Oct. 24. Mrs Paul Cawthorne, Oct. 11. Paul Cawthorne, Oct. 18. Mrs. W. W. Wooldridge, Oct. 24. Robert Willis Almond, Oct. 9. Sgt. WilliamG arrett, Oct. 9. Bill Henry Williamson, Oct. 13. Robert L. Doss, Oct. 13. Watkins M. Abbitt, Jr., Oct. 20. C. S. Jenkins, Oct. 11. J. G. Plunkett, Oct. 6. William McFadden, Oct. 13. Mrs. Roy Robertson, Oct. 1. Mrs. Claude Jennings, Oct. 4. Mrs. Hal Bryant, Oct. 4. Percy George, Oct. 19. Mrs. Leslie Gordon, Jr., Oct. 4. Miss Nina Barlow, Oct. 4. Mrs. Estelle Moore, Oct. 8. Mrs. R. D. Robinson, Oct. 19. Mrs. W. M. Hancock, Oct. 9. John T. Hall, Oct. 10. Rev. D. M. Spence, Oct. 14. Mrs. Jessie Carwile, Oct. 15. W. W. Sweeney, Oct. 22. Mrs. Frank Gilliam, Oct. 23. Miss Mary I. Babcock, Oct. 23. Miss Lula Iriby, Oct. 24. Mrs. F. L. Murphy, Oct. 28. Mrs. Ruth Wheeler, Oct. 28. iMs. George Harris, Oct. 16. Miss Kitty Lou OBrien, Oct. 30. Miss Claudine OBrien, Oct. 30 Mrs. D. E. Torrence, Oct. 17. Mrs. Sylvia iSifferd, Oct. 31. Mrs. A. R. Harwood, Sr., Oct. Mrs. B. B. Harris, Oct. 5. Lloyd Richardson, Oct. 12. Katherine Panson, Oct. 30."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Oct. 11. J. G. <mark>Plunkett</mark>, Oct. 6. William McFadden,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Oct. 11. J. G. <mark>Plunkett</mark>, Oct. 6. William McFadden,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [750.22, 418.63, 2128.92, 509.48], "bbox_id": "ea46609dab", "file": "AppomattoxNewspapers_1933-1936a_0369.pdf", "page": 1, "text": "THURSDAY JANUARY 9, 1936 tTlBMJSHED IN 1892 THE HOME PAPER Garland Plunkett, of V .P .I. has Mrs. J . A. Randolph and Miss been spending the holidays here Dorothy Shipman, Qf Richmond, and with bis parents, Mr.  and Mrs. Mrs. J . P . Love, of Charleston, J . D.Plunkett. i W,. Va., left yesterday after spend o  ing the week with Mrs. D. E . Mutt Cawthorn returned to  Caldwell. Washington Tuesday after visiting j  o  his parents, Mr. and Mrs. F . T . I Miss Mabel Barksdale, of Stewart Cawthorn. I is visiting Mrs. T . M. Trent."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "THE HOME PAPER Garland <mark>Plunkett</mark>, of V .P .I."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "THE HOME PAPER Garland <mark>Plunkett</mark>, of V .P .I."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.62, 1396.02, 2240.67, 1573.16], "bbox_id": "aff94b404d", "file": "AppomattoxNewspapers_1926-1933a_0534.pdf", "page": 1, "text": "throughout the county to ex jt t r i . I plain the n ew contract was fv school library for use Richmond, Va. f an, ,Ahc held Tuesday night at Rocks. A t lk by c  l Plunkett, v TMsCall Frarier Director of K  rower8 sif etd J K representative ofi the History  L M s S m 5 5  Kf Xf  S ent  he Cl e Club on the -EvaluuHon of sion gas tax receinte for the Ioi the meeting _ ________ the American Flag was also year 1930 totaled 11,426,066, part of the chapel program, exceeding the 1929 total of 10,419,420 by 1,006,645. The 1930 gas tax figures ex ceeded the budget estimates ai so by upwards of one million I dollars. License tag receipts for 1930 j totaled 6,050,074, as compar- !ed to 5,701,682 for 1929,!"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "lk by c  l <mark>Plunkett</mark>, v TMsCall Frarier Director"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "lk by c  l <mark>Plunkett</mark>, v TMsCall Frarier Director"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.85, 1565.07, 2227.3, 1665.88], "bbox_id": "5f15064f00", "file": "AppomattoxNewspapers_1943-1947a_0077.pdf", "page": 1, "text": "three types of rationed farm machr- r inery have been lifted by the U. S.  Department of Agriculture. The or- j ders permit manufacturers of farm j cream separators to release 80 p er. cent of their authorized manufac-, YUPed production as allowed by Highway Dept, total 54.00 WPB Order L-l70 and all remain- R. L. Burke ........... ............ 10.00 iqg.. stocks produced under L-26. It Mrs. R. L. Burke ............... 2.00 similarly permits manufacturers of Mr, and Mrs. J D. Plunkett 5.00 power spray pumps and horse .. o r, C. L. Johnson ................. .. 1.00"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "and Mrs. J D. <mark>Plunkett</mark> 5.00 power spray pumps"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "and Mrs. J D. <mark>Plunkett</mark> 5.00 power spray pumps"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1950.68, 898.3, 2113.78, 1459.35], "bbox_id": "e51d9b223b", "file": "AppomattoxNewspapers_1905-1912a_0027.pdf", "page": 1, "text": "Three cheers aud a tiger f r the teacher of the Sunuyside scnuui in ol l Buckingham, It is pleusan. to find oue who nas tue courage ot her convictions and is not afraid to speak out in meeiiug, aud we thiuk every teacher ougUt to render her a vote of thanks for her let er in last weeks TlHE-. As a rul tm teachers of the public school bait a hard road to travel and verny do have The Wot Id, the Flesh lid the Devil to cou-eud with, flail of the patrons of the school seem u think they coufet a great favor on the teacher iu sending ttn-ir chil dren to help make her average, and never seem to thibk uf ib. great advantage lo theuiselve in being able to have their clnlJu-i educa ed at such a small cos. A Miss Compton says it u a siu no to give lie childien all toe educa tional advantages possible, for bo are they o earn a living if they have not some education? Bui Miss Compton has filled the bill- there is nothing more to be said. Well it looks as if grim wiutei were upon us and we are sure that toine have been caught napping from the number of people that .veie getting wood last Tuesday. Mr. T. A. Coleman and Mr. Jno. Cole had their molasses made las. we k. .Vlr. aud Mrs. Conrad Oder, of the Hill City, were tLe guests of M-. T. W. Oder recently. Miss Sadie Coleman, whose school was closed ten days on account of dipiberia, after a pleas tut visit to relatives in Lyuchburg, returned to her t-chool on Tuesday. Mr. aud Mrs. J. S. Plunkett aud children returned Monday from a delightful visit to Mr. A Plonket"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "aud Mrs. J. S. <mark>Plunkett</mark> aud children returned Monday"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "aud Mrs. J. S. <mark>Plunkett</mark> aud children returned Monday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.5, 416.11, 1495.16, 506.26], "bbox_id": "c0f1531907", "file": "AppomattoxNewspapers_1939-1943a_0168.pdf", "page": 1, "text": "Those from Pamplin attending the wedding o f Miss Virginia Plunkett, were Mrs L . N . Ligon, Misses Margaret Ligon, Jane Gray Paulette Elizabeth Rucker and Mrs. JT C  Ligon 1 1 c. E L. Paulette, who has ben working ,witth a road contractor fa at nome for the winter, months"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "o f Miss Virginia <mark>Plunkett</mark>, were Mrs L . N"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "o f Miss Virginia <mark>Plunkett</mark>, were Mrs L . N"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1293.11, 826.08, 1421.41, 925.13], "bbox_id": "c7d1656e55", "file": "AppomattoxNewspapers_1892-1898a_0165.pdf", "page": 1, "text": "Thos. Harvey, of Spring land Mrs. Addie B. Plunkett, ksouri spent yesterday with j. W. Hunter. Anna Jones, of this county, ednesday for Roanoke, where meets to spend the next two with her brother."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "land Mrs. Addie B. <mark>Plunkett</mark>, ksouri spent yesterday with"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "land Mrs. Addie B. <mark>Plunkett</mark>, ksouri spent yesterday with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [612.23, 1346.36, 773.62, 1667.2], "bbox_id": "e9f2d138bb", "file": "AppomattoxNewspapers_1926-1933a_0186.pdf", "page": 1, "text": "Thomas Butler Pretlow born in Southampton Co. 63 years ago, Mother, Ann Elizabeth Butler, of Dinwiddie Co. Father, Hon, Joshua Pretlow, of Southampton Co. Mr. Pretlows father serve in congress before and during Civil War. Mr. Pretlow served during the Spanish American War. He came to this county 16 years ago. He married Miss Annie Abbitt daughter of the late Dr. William H. Abbitt and Sarah Frances Plunkett Abbitt. Survived by wife and two children, Sarah Frances Pretlow age 12,and Joshua Pretlow age9. Relatives who attended funeral from a distance were Miss Mary Denson Pretlow and Mrs. John D. Abbitt of Norfolk, Va., Mrs. C. W. Darden of Franklin, Va., and Mrs. William Woodley of New Ben, N. C. all sisters of the deceased. Mrs. Thomas N. White, Miss Fannie Pretlow, Messrs. J. A., R. J. and Barclay Pretlow all of Franklin, Va., Mrs. G. A. Coleman, Dr. and Mrs. J. B. Abbitt and Miss Edith Abbitt, Norfolk, Va."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Abbitt and Sarah Frances <mark>Plunkett</mark> Abbitt. Survived by wife"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Abbitt and Sarah Frances <mark>Plunkett</mark> Abbitt. Survived by wife"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.16, 1003.95, 1577.56, 1026.45], "bbox_id": "945f638e59", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "thn S. Plunkett and wife lynchburg this week on"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "thn S. <mark>Plunkett</mark> and wife lynchburg this week on"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "thn S. <mark>Plunkett</mark> and wife lynchburg this week on"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1367.51, 786.51, 1534.77, 1109.0], "bbox_id": "ddacd59afd", "file": "AppomattoxNewspapers_1926-1933a_0462.pdf", "page": 1, "text": "This highly esteemed citizen of Appomattox passed away at Staunton Hospital Saturday. Deceased served this county as sheriff for 16 years and was a popular and prominent citizen. He was born July 26, 1847 ini this county and never lived at any other place. His remains were interred at the family grave yard at his late home Sunday afternoon in the presence of a large crowd of friends and relatives. Deceased is survived by the following children Mrs. J. S. Plunkett, Mrs. T. W. Odor, H. S. and J. T. Coleman, Mrs. C. T. Cawthorn, W. p. and Miss Emma Sue Coleman, all of Ap pomattox County. Rev. W. M. Thompson con ducted the service and Senator Ferguson spoke of the service and record of deceased at the  grave. He was a confederate  soldier. ."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "children Mrs. J. S. <mark>Plunkett</mark>, Mrs. T. W. Odor,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "children Mrs. J. S. <mark>Plunkett</mark>, Mrs. T. W. Odor,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.45, 763.2, 1526.52, 1084.75], "bbox_id": "6979e558cc", "file": "AppomattoxNewspapers_1908-1909a_0462.pdf", "page": 1, "text": "This highly esteemed citizen of Appomattox passed away at Staunton Hospital Saturday. Deceased served this county as sheriff for 16 years and was a popular and prominent citizen. He was born July 26, 1847 in this county and never lived at j any other plA  His remains, were interred at the family grave yard at his late home Sunday afternoon in the presence of a large . crowd of  friends and relatives. Deceased is survived by the i following children Mrs. J. S. Plunkett, Mrs. T. W. Odor, H. I S. and J. T. Coleman, Mrs. C. T. Cawthorn, W. P. and Miss Emma Sue Coleman, all of Ap pomattox County. Rev. W. M. Thompson con-1 ducted the service .and Senator Fergun. spoke of., the service I and record of deceased at the grave. He was a confederate Boldier."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "children Mrs. J. S. <mark>Plunkett</mark>, Mrs. T. W. Odor,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "children Mrs. J. S. <mark>Plunkett</mark>, Mrs. T. W. Odor,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [402.22, 1461.97, 2111.37, 1608.67], "bbox_id": "9ef0b3ad5a", "file": "AppomattoxNewspapers_1908-1909a_0209.pdf", "page": 1, "text": "These prices are for first half of January defivy. 7- We book your order and deliver same up to March lgt, for Small ad. 25 YEARa A go ditional cost, Dr. W. C Eikner Dr. G- B- Arnold, Robt. G. Shelton Geo Vqiles Ed Evans k K. E. Meggirison W. L Brown Dr?W. L. Ould D A. Conner, H. M. BÜRGE CO., Inc IN THE APPOMATTOX 4k BUCKINGHAM TIMES j- Jan. R -1908 4  j y v Miss Mary Plunkett enter tained a number of her friends Wednesday night arid a num ber of visitors hadjia merry"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "y v Miss Mary <mark>Plunkett</mark> enter tained a number"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "y v Miss Mary <mark>Plunkett</mark> enter tained a number"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1862.16, 725.11, 2007.57, 962.15], "bbox_id": "8d342df3db", "file": "TimesVirginian_1978_0236.pdf", "page": 1, "text": "There are great things happening in Appomattox County and you will learn about some of them if you tune in the Farm and Home Show, on WSET Channel 13, at 8 a.m. this Saturday, June 3. The show will feature Mr. Raymond Dickerson telling about the Pamplin Pipe Factory Mrs. H arriett Robin son sharing information about the Arts and Crafts Center and Mrs. Ethel Evans, Mrs. Louise Plunkett, and Mrs. Reba Bruce talking about the Patchwork Festival. Mrs. Shirley Walton and Miss Pat Hudson, Extension Agents in Appomattox County, will be hostessing the program. Dont miss it."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Ethel Evans, Mrs. Louise <mark>Plunkett</mark>, and Mrs. Reba Bruce"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Ethel Evans, Mrs. Louise <mark>Plunkett</mark>, and Mrs. Reba Bruce"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2197.86, 683.77, 2375.49, 1187.95], "bbox_id": "7cacacac04", "file": "AppomattoxNewspapers_1954-1955a_0334.pdf", "page": 1, "text": "There are four contests awaiting the decision of the voters. In Stonewall Magisterial District there is a three-way race for the office of supervisor. Incumbent John P. Alvis, Jr., is being opposed by O. W. Martin, Jr., and Hpbert B. Scruggs. Over 800 votes are expect ed at the three precincts in Stone wall District. Veteran incumbent James H. OBrien is being opposed for nomi nation for another-term as Commis sioner of the Revenue by H. H. Caldwell, Jr. - Incumbent David T. Robertson is being opposed for Sheriff by J. Alex Bingham, a retired State Police Lieutenant. Deputy Treasurer John Garland Plunkett and Thomas Terrill Martin, are vieing for the nomination for County Treasurer. These contests have been the oc casion of active campaigns, both by the contestants and their friends. Many letters have been mailed to the voters and personal appeals have kept all hands on the go fonthe past three months. Predictions as to the outcome de pend on which side you question, but the overa-all conclusion is that there will be a heavy vote and that at least some of the contests will be close. Most contestants are preparing their workers for a major effort on1! election day and will try to see that no eligible voter fails to go to the polls. There are ten voting precincts in Appomattox County. Election offi cials, aeording to a list secured by this newspaper yesterday, will be as follows Court House Precinct Judges J. H. Lucado, L J. Mor ris and J. W. Durrum. Clerks Mrs. L. L. Stanley and Mrs. Lou C. Rog ers."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Deputy Treasurer John Garland <mark>Plunkett</mark> and Thomas Terrill Martin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Deputy Treasurer John Garland <mark>Plunkett</mark> and Thomas Terrill Martin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [108.0, 264.14, 247.38, 524.23], "bbox_id": "3ec1e7dae5", "file": "TimesVirginian_1976_0052.pdf", "page": 1, "text": "Theodore Edward Zastrow, 76. of Paoli, Ind.. died Tuesday in a Paoli hospital. He was the husband of Alma Virginia Plunkett. Zastrow. formerly of Appomattox. Born in Merrimae, Wis., he was the son of William G. Zastrow and Julia Anna Zastrow. In addition to his wife, he is survived by two daughters, Alma Zastrow and Velma Louise Zastrow of Paoli two brothers Albert Zastrow of Spout Spring and George Zastrow of Atlanta, Mich., and three sisters, Mrs. Emma Riegler and Mrs. Dorothy Johnson of Baraboo, Wis., and Mrs. Helen Rischinuller of Mer- rimac. Funeral services were held in Paoli."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "husband of Alma Virginia <mark>Plunkett</mark>. Zastrow. formerly of Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "husband of Alma Virginia <mark>Plunkett</mark>. Zastrow. formerly of Appomattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1710.83, 828.02, 1861.96, 1151.46], "bbox_id": "c262cf447c", "file": "TimesVirginian_1978_0312.pdf", "page": 1, "text": "The workshops will include The Life You Save May Be Your Own Let the Real You Come Through Virginia Wo men and the Changing Law Liberated From - - Liberated For? Women and Sexuality Black Heritage Preserved Energy-Choice Not Chance The Crisis of Mid-Life Youre Where Its At and Creative Club Reporting. The program is designed by representatives from a number of statewide organizations, including the Garden Clubs of Virginia Young Homemakers of Virginia American Cancer Society Department of Wel fare and others. About 500 participants are expected to attend. Attending from Appo mattox County are Mrs. Ethel Evans, Mrs. Margaret Lee, Mrs. Geraldine Marshall, Mrs. Louise Plunkett and Mrs. Mae Zimmerman. More information is available at the Appomattox County Extension Office 352-8244."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Geraldine Marshall, Mrs. Louise <mark>Plunkett</mark> and Mrs. Mae Zimmerman."}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Geraldine Marshall, Mrs. Louise <mark>Plunkett</mark> and Mrs. Mae Zimmerman."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.9, 1008.26, 1698.35, 1165.7], "bbox_id": "5ff4d57f15", "file": "AppomattoxNewspapers_1926-1933a_0237.pdf", "page": 1, "text": "The True Blues of Liberty Baptists church were hostesses at a shower given in the home if Mrs. Dave Plunkett Friday evening in honor o f  Mrs. fhomas Ferguson, a recent iride. Several contests were mjoyed by the guests. Miss Caroline Smith won the .prize n the Advertisement contest H o w to handle a husband, contributed by the young mar led women and  Why I never married, written by the sin gle girls caused much merri"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "home if Mrs. Dave <mark>Plunkett</mark> Friday evening in honor"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "home if Mrs. Dave <mark>Plunkett</mark> Friday evening in honor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.17, 1009.41, 1697.88, 1157.0], "bbox_id": "0ddb012c79", "file": "AppomattoxNewspapers_1926-1933a_0238.pdf", "page": 1, "text": "The True Blues of Liberty Baptists church were hostesses at a shower given in the home f Mrs. Dave Plunkett Friday avening in honor of  Mrs. Thomas Ferguson, a recent jride. Several contests were anjoyed by the guests. Miss Caroline Smith won the .prize n the Advertisement contest H o w to handle a husband, contributed by the young mar led women and Why I never married, written by the sin-"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "home f Mrs. Dave <mark>Plunkett</mark> Friday avening in honor"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "home f Mrs. Dave <mark>Plunkett</mark> Friday avening in honor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1731.32, 324.4, 1875.09, 979.73], "bbox_id": "2596cea6bc", "file": "AppomattoxNewspapers_1971-1973a_0479.pdf", "page": 1, "text": "The Seventy-Seventh An nual Convention, Virginia Div ision of the United Daughters of the Confederacy was held in Williamsburg, Virginia, on October 3rd, and October 4th, at the Williamsburg colony Motor Inn. A Memorial Service was held in the Bruton Parish Episcopal Church honoring the deceased members of the entire Virginia Division. The total deceased members were 105, and as each name of the deceased member was called a white carnation was placed on a green wreath which was accepted by Mrs. Russell B. Frost, President of the Vir ginia Division, and was placed at the Confederate Monument in the church yard. Tuesday was Historical night and a Grand March honored the Virginia Division and General Officers. Wednesday was Chapter Presidents night, beginning with the Grand March of Presidents of all Chapters, at which time the Historians and Recorders of the Crosses of each Chapter were also recognized. The Appomattox Chapter was awarded two prizes. One, a 5.00 prize, was awarded the local Chapter for enrolling the second largest number of new members in the Virginia Div ision. The - ond, a 10.00 prize, was aw. .ed Appomat tox Chapter for giving the largest number of books to the library. Members attending from the Appomattox Chapter of the United Daughters of the con federacy were Mrs. Albert Zastrow, Chapter President Mrs. Johnnie Cyrus and her daughter, Dale Mrs. Lena Eversole, Second Vice-Presi dent Appomattox chapter Mrs. Cliff Plunkett, Virginia Divison Registrar and Mr. and Mrs. Orie Schaubach of Crewe, Virginia. 1 t-"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "Appomattox chapter Mrs. Cliff <mark>Plunkett</mark>, Virginia Divison Registrar and"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "Appomattox chapter Mrs. Cliff <mark>Plunkett</mark>, Virginia Divison Registrar and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2021.01, 832.92, 2190.96, 872.72], "bbox_id": "1c31bef6dc", "file": "AppomattoxNewspapers_1947-1949a_0317.pdf", "page": 1, "text": "The selections Because . and At Djawning were played by Mrs. J. Dave Plunkett, of Appo mattox,"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "The selections Because . and At Djawning were played by Mrs. J. Dave <mark>Plunkett</mark>, of Appo mattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "The selections Because . and At Djawning were played by Mrs. J. Dave <mark>Plunkett</mark>, of Appo mattox,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1767.31, 1106.82, 1934.42, 1701.71], "bbox_id": "b7ed5148b8", "file": "AppomattoxNewspapers_1952-1954a_0519.pdf", "page": 1, "text": "the schedule, which is the biggest job in the beginning. Mrs. S. S. Shouse, an expert at staging flower shows, since he is an accredited flower show judge, is serving as program chairman for the show, which will be built around the Old Country Store theme. She presented a unique way of print ing the program. Mrs. W. W. Burke, and Mrs. R. C. Hubbard, co-chairman of the schedule committee, brought in a listing of items which would be of interest and typical of a Country Store. They suggested that mem bers beg or borrow such items as an Old Tobacco Plug Cutter, Old Ladies Bonnets, Home Made Lye Soap, High Top Lace Shoes, A Wooden Churn, Lamp Chimneys, etc. They would .be _used in creating the Country Store Atmosphere in staging the show. Doesnt sound much like flow ers does it? Well, just you wait and see what these ladies will do with themand the flowers. Mrs. Harwood has chosen her chairmen wisely and well in order to make this the biggest and most beautiful flower show Appomattox has ever hada show to do justice to the countys rich heritage. And it is bound  to be just that. The flo-wer show will be staged at the Old Plunkett-Meeks House at Old Appomattox Court House on April 24 and 25. Arrangements will be in keeping with the period around 1865. So whether you know it or not, all of Appomattox is going to be turned upside down in the next two months by Garden Club members rummag ing for heirlooms and other pieces of historic interest to be used in some of the rooms and in arrange ments. The ladies finally adjourned and the next visit will be to the Plunkett- Meeks House, where they will decide on placements of various types of exhibits. Here the other committees will take over, a complete listing of which will appear in a couple of weeks. You can just bet that these Garden Clubbers intend to go al out in making an outstanding event of the year in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "will be to the <mark>Plunkett</mark>- Meeks House, where they"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "will be to the <mark>Plunkett</mark>- Meeks House, where they"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2332.36, 1447.64, 2500.12, 1532.53], "bbox_id": "28191f2212", "file": "AppomattoxNewspapers_1939-1943a_0322.pdf", "page": 1, "text": "The results of the election were interpreted as a rousing victory for the organization headed by Uni ted States Senator Harry Flood Byrd. The Appomattox vote listed by precincts Precinct Tuck Plunkett"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "by precincts Precinct Tuck <mark>Plunkett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "by precincts Precinct Tuck <mark>Plunkett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2072.28, 946.68, 2400.22, 1030.37], "bbox_id": "f668d39645", "file": "TimesVirginian_1983a_0328.pdf", "page": 1, "text": "THE NEWLY ELECTED officer of the Appomattox Chapter of the UDC for 1953 to 1985 left to right Historian, Mrs. Lucille Ferrell Treasurer of Memorial Fund and Registrar - Mrs. Louise Plunkett Corresponding Secretary,,Mrs. Mary 8ue Gordon Recording Secretary, Mrs. Margaret Lee Vice President and Recorder of Cnowet,MrT. M. Cunningham Second Vice President, Mrs. Hubert L. Wilkerson and President, Mrs. O. W. Martin, Jr. Treasurer of General Fund, Mrs. Frances P. Harvey Net Pictured."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "and Registrar - Mrs. Louise <mark>Plunkett</mark> Corresponding Secretary,,Mrs. Mary 8ue"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "and Registrar - Mrs. Louise <mark>Plunkett</mark> Corresponding Secretary,,Mrs. Mary 8ue"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1704.95, 1291.47, 2037.43, 1421.77], "bbox_id": "60e809f3ad", "file": "AppomattoxNewspapers_1908-1909a_0307.pdf", "page": 1, "text": "The members of the senior children, John and Nicholas  3. Y. P. U. of Liberty Church Cyrus and Mrs. Amy Rosser, j will be guest of Mr. Dave all of Campbell County. I Plunkett at an oyster supper I o be given in the parlors Fri- I lay, February 7th, at 6 30 p. m. Dr. T. Claggett Skinner of I Lynchburg, W ill be the after dinner speaker. - g gmlthy-SupE 1 Messrs. T. A. Walton, Dave L"}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "of Campbell County. I <mark>Plunkett</mark> at an oyster supper"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "of Campbell County. I <mark>Plunkett</mark> at an oyster supper"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.64, 1314.25, 1877.58, 1494.94], "bbox_id": "85f722e697", "file": "AppomattoxNewspapers_1926-1933a_0307.pdf", "page": 1, "text": "The members of the senior 3. Y. P. U. of Liberty Church will be guest of Mr. Dave Plunkett at an oyster supper o be given in the parlors Fri day, February 7th, at 630 p m. Dr. T. Claggett Skinner of Lvnchburg, will be the after dinner speaker. Messrs. T. A. Walton, Dave Plunkett and F. L. Murphy Will be ordained to the diacon ate of Liberty Baptist Church Sunday morning, Feb. 9th."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "guest of Mr. Dave <mark>Plunkett</mark> at an oyster supper"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "guest of Mr. Dave <mark>Plunkett</mark> at an oyster supper"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [618.67, 714.0, 757.91, 797.9], "bbox_id": "d35f11ab42", "file": "AppomattoxNewspapers_1971-1973a_0066.pdf", "page": 1, "text": "The meeting was opened by the President, Mrs. L o ui s e Plunkett using the Homemaker Prayer and Creed. We decided to continue our meetings on the third Tuesday at 1000 a.m. The next meeting to be held at Mrs. Schuyler Marshalls home."}, "highlight": {"text": {"matched_tokens": ["Plunkett"], "snippet": "o ui s e <mark>Plunkett</mark> using the Homemaker Prayer"}}, "highlights": [{"field": "text", "matched_tokens": ["Plunkett"], "snippet": "o ui s e <mark>Plunkett</mark> using the Homemaker Prayer"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
