{"document": {"bbox": [1378.81, 627.13, 1496.11, 637.63], "bbox_id": "59c24f65d1", "file": "AppomattoxNewspapers_1962-1965a_0584.pdf", "page": 1, "text": "POLICE DEPARTMENT"}, "highlight": {"text": {"matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}], "text_match": 1157451471441625209, "text_match_info": {"best_field_score": "2211897868544", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441625209", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1917.6, 1250.4, 2029.66, 1259.9], "bbox_id": "43beed0e42", "file": "AppomattoxNewspapers_1960-1962b_0007.pdf", "page": 1, "text": "POLICE DEPARTMENT"}, "highlight": {"text": {"matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}], "text_match": 1157451471441625209, "text_match_info": {"best_field_score": "2211897868544", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441625209", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [459.86, 1236.66, 569.15, 1246.16], "bbox_id": "621ed19e2e", "file": "AppomattoxNewspapers_1974-1975a_0142.pdf", "page": 1, "text": "POLICE DEPARTMENT"}, "highlight": {"text": {"matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "<mark>POLICE</mark> <mark>DEPARTMENT</mark>"}], "text_match": 1157451471441625209, "text_match_info": {"best_field_score": "2211897868544", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441625209", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [947.28, 603.82, 1343.24, 752.96], "bbox_id": "b064b58be9", "file": "AppomattoxNewspapers_1962-1965a_0326.pdf", "page": 1, "text": "with the appointment of com- j General Repairs  Supplies missioners, they shall file their I C h arlie M ayberry .............. answer and grounds of defense V acation Pay designating the property in which they claim to be interested, the iy y - a  Q grounds of any objection or de-1 u ............................................................... fense to the taking or damaging! POLICE DEPARTMENT of their property or to the juris diction of the Court to hear the Salary  Regular Police .................................. 2,8 case and to proceed with the j a j Cost, Clothes  Blood Test  School ...... appointment of Commissioners J ucge s Salary for the determination of j u s t Ronnrc ..........................................  compensation, or to the entry of, an order permitting Petitioner  _ to enter upon said lands and pro-1 i Pec,Q ceed with the construction of its Police 5"}, "highlight": {"text": {"matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "the taking or damaging! <mark>POLICE</mark> <mark>DEPARTMENT</mark> of their property or"}}, "highlights": [{"field": "text", "matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "the taking or damaging! <mark>POLICE</mark> <mark>DEPARTMENT</mark> of their property or"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [343.43, 1089.65, 508.88, 1301.25], "bbox_id": "677906371d", "file": "AppomattoxNewspapers_1922-1923a_0497.pdf", "page": 1, "text": "Winchester.Henry H. Coffman and Miss Blanche E. Gruver were married at the brides home, at Stephen City, this county. Rev. E. A. Stanton, of the United Brethren Church, officiating. Richmond.  Miss Emily Savage Crump and Frank Irving Starke, both of this city, were married at St. Johns Episcopal Church by the rector, the Rev. Robert A. Goodwin. Fredericksburg.  W i l l i a m T. Bland, of this city, and Miss Clara B. Thacker, of Spottsylvania County, were married at the residence, at Spottsylvania Court House, of Rev. J. H. P. Crismoud, who performed the ceremony. Roanoke.Hugh Haley, of Roa noke. and Miss Annie Griffin, daugh ter of Detective Sergeant A. H. Grif fin, of the police department, were married at St. Andrews Catholic Church, Rev. Father J. W. Lynch officiating."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Grif fin, of the <mark>police</mark> <mark>department</mark>, were married at St."}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Grif fin, of the <mark>police</mark> <mark>department</mark>, were married at St."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [360.92, 1097.03, 524.47, 1309.12], "bbox_id": "5eea56e3c7", "file": "AppomattoxNewspapers_1922-1923a_0501.pdf", "page": 1, "text": "Winchester.Henry H. Coffman and Miss Blanche E. Gruver were married at the brides home, at Stephen City, this county. Rev. E. A. Stanton, of the United Brethren Church, officiating. Richmond.  Miss Emily Savage Crump and Frank Irving Starke, both of this city, were married at St. Johns Episcopal Church by the rector, the Rev, Robert A. Goodwin. Fredericksburg.  W i l l i a m T. Bland, of this city, and Miss Clara B. Thacker, of Spottsylvania County, were married at the residence, at Spottsylvania Court House, of Rev. J. H. P. Crismond, who performed the ceremony. Roanoke.Hugh Haley, of Roa noke. and Miss Annie Griffin, daugh ter of Detective Sergeant A. H. Grif fin, of the police department, were married at St. Andrews Catholic Church, Rev. Father J. W. Lynch officiating."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Grif fin, of the <mark>police</mark> <mark>department</mark>, were married at St."}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Grif fin, of the <mark>police</mark> <mark>department</mark>, were married at St."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.24, 666.47, 2012.69, 983.42], "bbox_id": "456c891c81", "file": "AppomattoxNewspapers_1949-1952a_0285.pdf", "page": 1, "text": "win, John M. Blakney, Addie L. Ba ker, W. C. Bell, Grover P. Beasley, Jr. W. V. Bryant, Lloyd M. Bryant, Robert B. Boney, Jr. C. S. Booth, Concretely, Co.el Woodson gave! Berkley H. Guill, W. T. Coleman, consistent bad weather as a reason! Mrs. C. M. Carter, Maude Casey, for the saving of these lives, since John C. Caldwell, Bill J. Covington, during bud weather most drivers! Jr. Mrs. Frances F. Carr, Mr. John make allowances for dangerous con- C. Cole, Mrs. Verna F. Conner, ditions. He stated also that the re-! Chas. F. P. Crawley, H. W. Conner, duction is all the more commend- Wi S. Conner, Joel Carter, Henry able in that bad weather failed to T. Chernault, Jessy J. Chernault, prevent a 1 per cent rise in traf-. Edith L. Drew, T. Hunter Dicker- fic volumes. sun Fleming W. Drinkard, Otis P. n .. . , n , , , Dewberry, J. R. Davidson, Crawford On the other hand, Colonel Wood- L_ Davidson, Annie T. Davidson, son felt that the sterner attitudes 011ie j. Davidson, Curtis L. Eagle, of many Virginia courts coupled claude Elder Robert Englander, with the full realization of Virginias John Thomas Ferguson, Samuel L. disgraceful 19o0 record no doubt FergUSOn, D. J. Franklin, C. R. Fer- had their impacts. guson, Mary S. Fuller, Billy Fergu- At the same time, Colonel Wood-  son Carl Ferguson, Harry Fergu son announced that Virginias 1950 1 0n J -  Tucker Ferguson, George toll had dropped from the first Farrar, Hubert A. Gurney, E. tabulation of 908 to 905 but that j Guill, Georgia Garrett, and late reports quite possibly could  P. A Garrett, Mrs. Edna Gains, bring it even higher than 1908. R. B Gilbert, J. L. Gordon, John W. The reduction was occasioned by! Gunter, Mrs. Peggy M. Harvey, Mrs. an erroneous report from another  Harris, William Frank Hanen- police department which listed two rat, Alma Harris, Lewis Harvey, injured persons as dead and a pe- yiliam C. Hubbard, Mrs. Mary S. destrian death which was ruled of- Hudson, A. R. Harwcod, Jr. Mrs."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Harris, William Frank Hanen- <mark>police</mark> <mark>department</mark> which listed two rat,"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Harris, William Frank Hanen- <mark>police</mark> <mark>department</mark> which listed two rat,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1029.08, 562.67, 1197.68, 1023.98], "bbox_id": "7ce032d898", "file": "TimesVirginian_1983a_0101.pdf", "page": 1, "text": "wife, Barbara Geason A rthur, reside in Spout Spring, Vfrginia. The rigorous eleven-week school that Commander Arthur completed is accredited by the University Of Virginia and is directed at management-level law enforcement officers. Accompanying Commander Ar thur in the 182nd Session were officers from each of the fifty states, the District of Columbia, Puerto Rico, the U.S. Virgin Islands, and tight foreign countries. Principal speaker at the gradua tion exercises was Mr. Leo Callahan, Chief of Police in Fort Lauderdale, Florida, and President of the International Association of Chiefs of Police. Represent ing the students as spokesman was Chief Inspector Alan John Englefitid of the Thomas Valley Police, Kidlington, England. Commander Arthur wins several other notable Lynchburg Police Department commanders who are alumni of the Natfamal Academy, as is Chief of Police Calvin E. Robertson. Canaan Baptist news nates"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "several other notable Lynchburg <mark>Police</mark> <mark>Department</mark> commanders who are alumni"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "several other notable Lynchburg <mark>Police</mark> <mark>Department</mark> commanders who are alumni"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.35, 375.85, 1776.14, 1785.29], "bbox_id": "9df885d954", "file": "AppomattoxNewspapers_1892-1898a_0122.pdf", "page": 1, "text": "who was the actual assassin ? It was absurd to suppose that a frail, slight woman like the Baroness Woronsko could overcome a strong, courageous man like Paul Pelaufski. I had one cine, a clue so slight that it had been overlooked by the Russian police, but one which no really first-class detective would have passed unnoticed. On the dead mans throat were the black marks of the fingers which had strangled him. The thumb of the right hand had been pressed violently into the skin of the neck, so as to produce a deep abrasion. I at once took a careful cast of this thumb-mark with the finest wax, thus reproducing every line exactly. I know that the impression of no two thumbs in the world are alike. It is the prison-mask in China, re member, and there serves the same purpose as the Rogues Gallery in America to identify a criminal. One other clue I had to guide me. A plain twisted ring, worn by the murderer,had left its mark distinctly on the flesh. I caused the impres sion of the hand, ring and all, to be photographed. Furnished only with these slight clues, I now set out to find the mur derer of Paul Pelaufski. Instinct toU me, I suppose, to look for him in the best society of the capital. My Parisian letters of introduction easily opened to me the best houses. In particular I sought the society of the Baroness. I K soon discovered that she was an abandoned intrigu ante. During her husbands absence on his country estates she unscrupu lously amused herself with a lover, one Rudolph Pfesh, a Hungarian of handsome appearance and very finely educated. I soon discovered this man to be a red-hot Nihilist. The Baroness for the time was absolutely infatuated with him. During all this time you may sup pose that 1 kept a sharp lookout for the twisted ring. I did nothing of the kind. Amid the mass of jewelry nightly displayed in the drawing rooms of St. Petersburg one might as well have searched for a needle in a bundle of hay. No, I only hoped to use that as confirmatory evidence when I had found my man. And I was fast finding him. Al ready I had gained, the confidence of the Nihilists. During the third month Rudolph Pfesh confided to .me the outline of a plot to assassinate the Czar. Bombs were to cut no figure in this last attempt. A peculiarly and singularly treacherous method was to be employed. People would never, perhaps, know how the emperor met his death. But who was to inflict it? The circle to which I now belonged, so Pfesh told me, had drawn lots to decide this, and the choice had fallen oh me. 1 was to become the assassin. But the details would not be confided to me until the night before the day set for the execution of the plot. That evening I was to attend at the house of the Baroness Woronsko, when I should receive full instruc tions. The Baronesss house was in the Nevskoi Prospect. It was a huge mansion surrounded by ornamental grounds. Before noon, completely disguised, Pierre Chauffaud took.oc casion to thoroughly reconnoitre the place. Night came. A brilliant ball was in progress. The Baroness had never looked so lovely. In the prime of her womanhood, her figure was displayed to the greatest advantage in evening dreSs. I looked around me. Pfesh, Dakoutsk, Phloblosh and Chenkaminall were there. The gathering was honeycombed with the Nihilistic element. I felt my hand suddenly grasped, and turning around was confronted hyGurloff. He was without dis guise of any kind. I regarded him with wonderment.  The second in command of secret police, he must be well known to these people. Then suddenly it flashed across me. Gurloff is also one of them. Nihilism has penetrated to the police department. I had the fourth dance with the Baroness Woronsko. It was marked a waltz on my programme. She danced superbly. I myself under stood the divine art. As to the strains of enchanting music we floated down"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "has penetrated to the <mark>police</mark> <mark>department</mark>. I had the fourth"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "has penetrated to the <mark>police</mark> <mark>department</mark>. I had the fourth"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1979.31, 1106.24, 2144.54, 1403.74], "bbox_id": "977e3f3f48", "file": "AppomattoxNewspapers_1902-1905a_0025.pdf", "page": 1, "text": "W ork of Private Detectives. Doutless not one person in a thou sand has a correct idea of the character or significance of this most singular outgrowth, of ultra-civilized conditions. The detective connected with the police department is complimented by the press whenever he captures a gang of thieves or discovers an incendiary, but with the private detective the case is different. Long before he embarks in the business he must above all things, learn he derj himself the sweets of praise and the joys oi fame. He must lay aside personal vanity, for his suc cess lies not in forcing himself to the front, but remaining as much as pos sible in the background. He need nave no fear that customers will forget him, for, like a six-shooter, a private detec tive is one of the things that, when needed, is required instanterif not sooner. A modest sign, which the average well-behaved and well-condi- j tioned person might pass every day for j years without noticing, but which looms  up as big as a barn to the jealous wife 1 who wants her husband shadowed, is all  the advertising he needs. He need not be alarmed for fear his clients will not find his room, and take a suite of large and conspicuous apartments in the front of the building he occupies, for when the man who is being bled and blackmailed starts out to hunt up a pri vate detective he will find him if he has to get out a search warrant."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "detective connected with the <mark>police</mark> <mark>department</mark> is complimented by the"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "detective connected with the <mark>police</mark> <mark>department</mark> is complimented by the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1527.81, 727.32, 1706.29, 1183.75], "bbox_id": "47546c7cb1", "file": "TimesVirginian_1980a_0254.pdf", "page": 1, "text": "vandalism, which occured Aug. 3-5 in the Spring Mill, Spout Spring, Stonewall and Oakville communities. Deputy Sheriff R. W. Baldwin and State Trooper Paul Kvasnicka made the arirests, according to the Sheriffs Office. Ayers and Kress are scheduled to appear in General District Court Aug. 27, and the juveniles will appear in Juvenile-Domestic Court Aug. 28, according to the Sheriffs Department. Police also arrested Groyer Lee Smith, age 19, of Concord and a juvenile last Thursday in connection with a separate vandalism incident in which a number of tombstones were overturned in the Concord Cemetary. Smith was scheduled to appear in court Wednesday, and the juveniles court date was set for Aug. 28. The investigation and arrests were made by C. H. Martin of the county Sheriffs Department. County police also made two arrests in connection with three break-ins, two of which occurred July 29, and one of -which happened Dec. 13 of last year. Valerie Louise Dixon and Brenda Leigh Coleman, both of Farmville, were arrested in connection with break-ins at the homes of Robert Gray two counts and James Frank Ranson, Jr. A break-in occurred at the Gray home on Dec. 13, 1979 and again on July 29 of this year. The Ranson home was broken into July 29 also. Sheriff J. E. Richardson, Deputy Sheriff B. P. S m and Deputy Sheriff C. A. Reynold! vest gated the cast add made the arrests. No court date had been set for the suspects as of press time."}, "highlight": {"text": {"matched_tokens": ["Department", "Police"], "snippet": "according to the Sheriffs <mark>Department</mark>. <mark>Police</mark> also arrested Groyer Lee"}}, "highlights": [{"field": "text", "matched_tokens": ["Department", "Police"], "snippet": "according to the Sheriffs <mark>Department</mark>. <mark>Police</mark> also arrested Groyer Lee"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1926.25, 1683.99, 2101.66, 1806.59], "bbox_id": "df094b31ec", "file": "TimesVirginian_1980a_0291.pdf", "page": 1, "text": "Trooper D. P. Beamon said the two vehicles were headed in opposite directions on Route 719 when the accident occiAed. The driver of the ruck was identified as John William Megginson of Route 1, Appomattox. Trooper Stephensen, who began work with the State Police in March of 1979, came to Appomattox County in the late fall of 1979. He had been employed with the Suffolk City Police Department before joining the State"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "with the Suffolk City <mark>Police</mark> <mark>Department</mark> before joining the State"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "with the Suffolk City <mark>Police</mark> <mark>Department</mark> before joining the State"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2023.69, 541.03, 2191.57, 790.03], "bbox_id": "a0784c3747", "file": "AppomattoxNewspapers_1922-1923a_0313.pdf", "page": 1, "text": "Tried To Burn Babies. The.most cruel attem pt at revenge or the strangest manifestation of in sanity probably ever dealt with by the Police Department was brought to public notice here, when it was learned that twice in four days ef forts have been made to burn in fants in their carriages on the block known as Baby Carriage Row, where, every day, 250 helpless in fants are seen. Because of the work of the maniac mothers will not let their smaller children out of their sight. Died In Undertaking Shop. W aiting into the rear room of an undertakers shop where bodies are prepared for burial, Henry Krekel, a ticket speculator, who was known as Handsome Harry before his dismissal from the police force, com-  mitted suicide by shooting hjmself in the mouth. Krekel was one of he best known ticket speculators in the city and was conspicuous along Broadway, where he conducted a handbook on the races."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "dealt with by the <mark>Police</mark> <mark>Department</mark> was brought to public"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "dealt with by the <mark>Police</mark> <mark>Department</mark> was brought to public"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [849.35, 1381.16, 1015.86, 1563.96], "bbox_id": "6c9bd38213", "file": "AppomattoxNewspapers_1908-1909a_0344.pdf", "page": 1, "text": "TORK 1 to .have a IN mayoralty campaign with live candidates. CongtiSSSn F. JL La Aw if e w to iM wet- woaT-thfeJa- pub!lean nomination,. hnt tffe. .dX publicans began laying plans. to put np a ,ary candidate, i Democrat renominated Jimmy Walker, and Rich- ard Enright, former. .DOjICZ ,CI9 sioner, was pnt np by the Square Deal party, attacking Tammany control of the police department. The fifth cam. dldate is Norman Thom, running as , a Socialist, and he to expected to be stronger than hi party .because dissatisfaction with both LaGuardla and Walker, M ERGER of two of New York1 biggest bapks. the ,National City"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Tammany control of the <mark>police</mark> <mark>department</mark>. The fifth cam. dldate"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Tammany control of the <mark>police</mark> <mark>department</mark>. The fifth cam. dldate"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [352.58, 1377.98, 514.29, 1610.29], "bbox_id": "d118906f70", "file": "AppomattoxNewspapers_1908-1909a_0196.pdf", "page": 1, "text": "to Fight Fake Guides Paris.Determined to rid the Parla boulevards, museums and other pub- He place where tourists gather of  noxious so-called guides who - forelgnere. a group of profea- i atonal courier and guide W -  ganlxed the Interpreters club with , well-defined alma. The prlnclpal ob- Ject of the society la to prevent any- body exercising the profession of guide without a permit delivered by the police department after an ex amination of his capabilities and production of serious references. Complaints have frequently been made by tourists of overcharging la stores, visits to questionable resorts and even regular holdups, for which swarthy, oily Individuals encountered In front of the big hotels In the eve- ning are mainly responsible. The po lice department issued an order two years ago that all guides should be In possession of a permit, but .this"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [823.69, 1571.33, 985.99, 1646.83], "bbox_id": "fcefa88faf", "file": "AppomattoxNewspapers_1912-1915a_0307.pdf", "page": 1, "text": "Three robberies occurred in Lynch burg, a fact that became known- out side the police department The places robbed were Baldwins store, Maloney, Webb  Whitaker, and the Ceneral Pharmacy. The loot was small at each place, the robbers evidently looking for money rather than stock."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "known- out side the <mark>police</mark> <mark>department</mark> The places robbed were"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "known- out side the <mark>police</mark> <mark>department</mark> The places robbed were"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1267.9, 1103.63, 1421.48, 1346.45], "bbox_id": "38a883c50c", "file": "AppomattoxNewspapers_1898-1902a_0472.pdf", "page": 1, "text": "They Kill a Man Whose House They Were Robbing and Kill a Detective. Pittsburg, Pa. Special.Thomas D. Kahney, a grocer at No. 13 Albert St., Mount Washington, about 3 oclock in the morning was shot and almost in stantly killed by burglars who were looting his house. Kahney met his death while trying to rescue his wife from the robbers. Three men had en tered his house and were trying to force a gag in Mrs. Kahneys mouth to pre vent her from giving an alarm. Sev eral shots were fired at Kahney with fatal effect. After the shooting the burglars fled from the house. As soon as the murder of Kahney was reported to the police department Superintendent OMeara put the entire force of detectives to work on the case. Several of the offi cers came upon the three burglars on Fulton street, and immediately the fu gitives opened fire. The officers prompt ly returned the fire, and in the fusilade that followed  Paddy Fitzgerald, one of Pittsburgs oldest and best known de tectives, was almost instantly killed and two other officers are reported wounded."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "was reported to the <mark>police</mark> <mark>department</mark> Superintendent OMeara put the"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "was reported to the <mark>police</mark> <mark>department</mark> Superintendent OMeara put the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.17, 508.0, 1546.7, 844.63], "bbox_id": "1020bd318c", "file": "TimesVirginian_1980a_0401.pdf", "page": 1, "text": "There have been no new develop ments in the slaying of Daniel McKinley Sport Wooldridge, accor ding to the Campbell County Sheriffs Department. Wooldridge, 61, who lived with hia 89 year old mother near Carsons Store at Route 2, Concord, was shot once through the jaw and died instantly when he answered a knock at hia door at approximately 8 p.m. Friday of last week. According to Campbell County Sheriff Page E. Sowell, as of press time Tuesday, no motive had been established for the killing and no suspects had been a i T e s t e d . Sowell, who said the weapon used in the slaying was ihost likely a small . caliber pistol or revolver, activated the Regional Homicide Investigation Squid early Saturday morning. The squad, formed in the mid-1970s  is composed of law enforcement officers from, the Lynchburg Police Department, the Bedford City Police Department, and the Sheriffs depart ments from the counties of Amherst, Appomattox, Bedford, and CampbslL Investigation is continuing with the questioning of individuals who might offer information leading to the identity of the killer."}, "highlight": {"text": {"matched_tokens": ["Police", "Department", "Police"], "snippet": "officers from, the Lynchburg <mark>Police</mark> <mark>Department</mark>, the Bedford City <mark>Police</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department", "Police"], "snippet": "officers from, the Lynchburg <mark>Police</mark> <mark>Department</mark>, the Bedford City <mark>Police</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1813.68, 1200.99, 1971.17, 1227.88], "bbox_id": "16ee3fddf0", "file": "AppomattoxNewspapers_1902-1905a_0025.pdf", "page": 1, "text": "There are more things done without motive In this world than are dreamed of by the police department. ______"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "There are more things done without motive In this world than are dreamed of by the <mark>police</mark> <mark>department</mark>. ______"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "There are more things done without motive In this world than are dreamed of by the <mark>police</mark> <mark>department</mark>. ______"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2102.66, 392.83, 2240.72, 622.37], "bbox_id": "d44478fcf0", "file": "AppomattoxNewspapers_1971-1973a_0002.pdf", "page": 1, "text": "The Town of Farmville will accept s e a l e d bids on three cards One - 1970 Plymouth, 4 Dr. Sedan, with factory air Two- 1969 Fords, 4 Dr. Sedans. Cars can be inspected by con tacting the Town Managers of fice or Police Department. All bids will be addressed to T. W. Bloomfield, Town Manager,Box 368, Farmville, Va. with the words CAR BIDS on the out side of the envelope. Bids must be in the Town Managers office by 100 P.M. August 6, 1971, at which time they will be open ed by a committee of the Town Council. The town reserves the right to reject any or all bids. T. W.Bloomfield, Town Manager. ________________7-29-lt"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Managers of fice or <mark>Police</mark> <mark>Department</mark>. All bids will be"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Managers of fice or <mark>Police</mark> <mark>Department</mark>. All bids will be"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1488.66, 1238.49, 1618.32, 1355.54], "bbox_id": "6ef88d4a95", "file": "TimesVirginian_1980a_0211.pdf", "page": 1, "text": "The principal speaker at the graduation ceremonies was General Robert H. Barrow, Commandant of the U. S. Marine Corps. Rep resenting Lieutenant Mor ris class as spokesman was Inspector NeviU Arthur Stanford of the New South Wales Police Department in Sydney, New South Wales, Australia."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "the New South Wales <mark>Police</mark> <mark>Department</mark> in Sydney, New South"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "the New South Wales <mark>Police</mark> <mark>Department</mark> in Sydney, New South"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.19, 621.8, 1612.02, 714.35], "bbox_id": "d100dcd117", "file": "AppomattoxNewspapers_1912-1915a_0334.pdf", "page": 1, "text": "The police department of Lynchburg Is at its wits end to round up a gang of thieves, which has been pilfering in a most successful manner during tbe past few months. Most of the stealing is provisions In private homes, but oc casionally jewelry is reported missing. It is believed that at least fifty homes have been robbed in the city and itd suburbs .since winter began."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "The <mark>police</mark> <mark>department</mark> of Lynchburg Is at"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "The <mark>police</mark> <mark>department</mark> of Lynchburg Is at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1762.57, 294.11, 1939.38, 1530.95], "bbox_id": "b69eecc0f1", "file": "AppomattoxNewspapers_1902-1905a_0377.pdf", "page": 1, "text": "The first train was run over the railroad between Christiansburg and Blacksburg Friday. The road, which was built by the Virginia Anthracite Coal and Railway Company, is nine miles long and will give regular sched ules connecting with the Norfolk antj Western Railway at Christiansburg. The charter for this road was granted 50 years ago. Now the Virginia Poly technic Institute, at Blacksburg, long handicapped by its inaccessibility, can be reached with ease. The Virginia Anthracite Company has erected a magnificent coatbreaker at its mine. The opening of the new road was sig nalized by a ride over it by President W. J. Payne and a number of invited guests, consisting of leading men of Christiansburg and members of the faculty of the Virginia Polytechnic In stitute. The Governor appointed the follow ing delegates to the farmers congress at St. Louis J. H. C. Beverly, of Up- perville A. O. Mauck, of Yorktown Julian Ruffin, of Old Church Henry M. Wood, of Richmond J. Thomas Goode, of Skipwith J. M. Barker, of Axton John T. Cowan, of Cowans Mills C. W. Heater, of Middletown Edgar M.cCary, of Irene.Frapcis Bell, of Dublin, and W. B. F. Leach, of Oakdale. The United States monitor Florida, in command of Commander John C. Fremont, has reached anchorage in Norfolk harbor after a fierce experi ence on the Chesapeake Bay, during the late coast storm. She had gone to Tangier Island for target practice, when the storm struck her. A. J. Cavanaugh, a new recruit on the receiving ship Franklin, at th Norfolk Navy Yard, was recognized as a former member of the Norfolk Marine Guard, who deserted in Janu ary. Cavanaugh re-enlisted as a naval landsman at Philadelphia last week. He was placed under arrest and is held in prison for court-martial trial. Henry Godfrey, who now stands charged in Princess Anne county, with murder of H. Ham, will not be tried upon this charge, for the reason that Ham, who it was first thought had been shot to death by Godfrey, is now well, and returned to his work. God frey  now in Princess Anne jail, shouted with joy when his wife told him that Ham was alive and out. God frey lay in ambush and shot Hanf through the lung. Robert Steele, 62 years of age, died at his residence, in Norfolk, leaving a widow and several children, among them Hugh Steele, a well-known news, paper man and singer, now of Wesl Virginia. The St. Charles Coal and Coki Company, with 50,000 capital, and th Powells Valley Petroleum Company with 60,000 capital, are two of th latest companies organized in Bristol The former will do business in Le county, and the latter in Kise ana Lee counties. L. R. Johns, a well-known miller was torn to pieces by a bursting fl wheel in the Columbia Milling Com panys mill, at Columbia. The bell slipped from the main wheel, and s accelerated the engine that it war thrown from its foundation, careen ing the big wheel and causing it tc burst. Engineer Johnson was also hurt and the engine-room wrecked. The Lincoln High School, Loudof county, has elected Mrs. M. S. Moffet principal for the session of 1904-5 Mrs. Moffett has hd charge of thr Rockbridge Normal School at Le ington, and is the principal of th teachers training department of thl Virginia School of Methods, held eact summer at the University of V ir ginia  Aunt Jennie Thomas, a coiore woman, was burned to death in Nea Market in a fire which destroyed hef- residence. No cause is known for th fire or of her failure to escape iron! j the burning building. - She was be tween ninety and one hundered year old. Joseph McDonell, whose back wai broken by a fall from a pile of lumbet in Portsmouth on August 28 last, died in the Kings Daughters Hospital McDonells case was the second death within the month resulting from i broken back. Seaman F. K. Fransen, United States Navy, was the other. McDonell was an iron shipbuilder ana was employed in the navy yard. He was 32 years of age and is survived by a widow. In the legal contest at Norfolk, fot the control of the Police Department, the Supreme Court decided in favor of the anti-administration Police Com missioners, and declined to reverse the opinion of Judge Prentis, of the Nor folk Circuit Court, to the effect thal Shultice and Wood were the properly elected Police Commissioners before the new City Councils came in. The new Council have valated the offices and elected Watters and Sterling to the places, and there will be anothet contest to oust the latter commis sioners. Jefferson H. Jones, of Portsmouth, was convicted of involuntary man slaughter in the Hustings Court al t Portsmouth and condemned to 9c days in jail. The trial was on the j charge of killing John J. Morgan, the father-in-law of the defendant. The two men had been enemies for several years, and when they met accidently two months ago Jones struck Morgan, knocking him to the ground and crush- ! ing his skull. Frank Jay Gould, of New York, I principal owner of the properties of j the Virginia Passenger and Power"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "the control of the <mark>Police</mark> <mark>Department</mark>, the Supreme Court decided"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "the control of the <mark>Police</mark> <mark>Department</mark>, the Supreme Court decided"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [573.6, 439.01, 854.66, 588.26], "bbox_id": "6ab243fe35", "file": "TimesVirginian_1978_0019.pdf", "page": 1, "text": "The first meeting of the. new year of the American Association of Retired Persons will take place in Pamplin at Pamplin United Methodist Church at 730 p.m. on January 12th. . Members and guests will be shown slides by Trooper D. P. Beamon of the Virginia State Police Department to enable the viewers to better recognize the various kinds of narcotics and , its users. All those of retiring age are welcome to attend. Thete will be no charge for admission. Shown in photo above are the outgoing president of the A.A.R.P Pamplins Chapter, Horace W. Coleman, Jr., standing to the right, and his successor, William L. Dickerson, left, discussing the meeting of January 12th."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "of the Virginia State <mark>Police</mark> <mark>Department</mark> to enable the viewers"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "of the Virginia State <mark>Police</mark> <mark>Department</mark> to enable the viewers"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [144.02, 1143.47, 288.46, 1251.91], "bbox_id": "bb72548118", "file": "TimesVirginian_1978_0169.pdf", "page": 1, "text": "The Con-Terra Womans Club and the Rustburg Wo mans Club will sponsor a class on Self Defense for Women on April 13th at 730 p.m. Sgt. Toni Purvis from Citizens Services of the Lynchburg Police Department will conduct the talk and show films."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Services of the Lynchburg <mark>Police</mark> <mark>Department</mark> will conduct the talk"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Services of the Lynchburg <mark>Police</mark> <mark>Department</mark> will conduct the talk"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [132.24, 240.53, 301.89, 1341.95], "bbox_id": "79902a212b", "file": "TimesVirginian_1978_0096.pdf", "page": 1, "text": "The Central Virginia Alcohol Safety Action Program in cooperation with the VASAP Special Enforcement Unit of the Lynchburg Police Depart ment, Mr. Carl F. Pinn, Driver Education Specialist and the E. C. Glass High School Driver Education D epartm ent con- ducted a controlled drinking and driving demonstration on Thurs., Feb. 2S, 1978 at E. C. I High School, Lynchburg, Va. The purpose of this I demonstration was to show at blood alcohol levels of .08 and greater an individ uals ability would be severely impaired to operate a motor vehicle. The experiment was done was the Link Driving Simula tors used by the high school to teach Driver Education. The Simulators included a complete Plymouth dashboard, automa tic or manual transmission and foot pedals for acceleration, clutch and brakes. Measure ments would be made and sewed according to errors in braking, steerin g, sign als, lights and speeding. Errors would be scored by three members of the Lynchburg Police Department Blood alco hol concentrations BAC would be measured by a breathalyzer operated by two certified operators and the total experiment would be supervis ed by Mr. Carl F. Pinn, Driver Education Specialist, Lynchb- burg Public Schools. There were eight partici pants ranging in age from 22 to 36 years of age. In order to fam iliarize each participant with the Links Drinking Simulator a practice session was held prior to the actual counting of errors. Once the practice session was concluded each participant operated the Simulator sober with errors being recorded by the police officers. A fter driving the Simulators sober the partici pants were given equal amount of donated alcohol according to body weight in order to achieve a blood alcohol concentration BAC of .08 or higher. Six of the eight participants were measured on a breathalyzer of having a BAC higher than .08. The third phase of the experiment consisted of the participants again taking the Links Driving Simulator Test. This time, of course, each one m easured some degree of intoxication according to the breathalyzer. Consequently, conclusive results were obtain ed from a comparison of driving errors prior to drinking alcohol and driving errors after the consumption of an alcoholic beverage. It is interesting to note that all the participants with a BAC of .08 or higher had a significant degree of impair ment. This ranged from 4 to 71. The range is understand able due to the factors of 1. Individuals sober driving abili ty , 2. Level of .alcohol tolerance. The average impair ment was 27.5 and another significant factor pointed out in the resu lts indicated that steering errors increased 130 after alcohol consumption. IN conclusion, this experi- 1 ment conducted at E . C. Glass High School on Feb. 23, 1978 clearly indicates that someone under the influence of alcohol at .08 BAC or greater is definitely a highway hazard."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "members of the Lynchburg <mark>Police</mark> <mark>Department</mark> Blood alco hol concentrations"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "members of the Lynchburg <mark>Police</mark> <mark>Department</mark> Blood alco hol concentrations"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [788.34, 1043.65, 920.65, 1627.0], "bbox_id": "5c62a2c692", "file": "AppomattoxNewspapers_1922-1923a_0096.pdf", "page": 1, "text": "The Buffalo News says By throwing a kiss by wireless a Buffalo girl will christen the new broadcasting apparatus. Who wants to be kissed in the ear? A Freehold N. J. paper sug gests that some genius arrange a radio set for the farmers plow handles, so he may be enter tained while covering the many weary miles of furrows. The radio presents great pos sibilities in the way of travelless honeymoons. In their little nests the newlyweds can hear the roar of Niagara, the waves beating on the seashore or the clerk in a 10 a day hotel quoting rates. An appropriation of 68,000 has been asked of the city of Chicago to purchase a further supply of radio apparatus for Its police department Chicago claims to be the first city to ap ply radio to police purposes, and it has found this crime-detecting utility a great success. Recognizing the popular de mand for radio outfits, plans for the construction of a new apart ment house in St. Louis, Mo., call for the Installation of a large receiving set on the roof, which will be connected with each turn on a switch and hear radio concerts and programs. An estimate based on manu facturers reports show that more than 5,000,000 a week is being spent on radio equipment In the United States. Since the new art became popular in Can ada the increase In sales has In creased 100 per cent each month since December, the month of April showing an estimated In crease of- several thousand per cent In sales over December, 1919. The unemployment problem of engineers and electrical tech nicians has been solved by the radio boom, according to a re port Issued by the Federated American Engineering Societies. Since January 1 the society has placed In employment more than 900 engineers, and Is continuing Its placemen at the rate of 20 a day. Electrical and mechani cal engineers benefit mostly by the growth, of the new industry."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "radio apparatus for Its <mark>police</mark> <mark>department</mark> Chicago claims to be"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "radio apparatus for Its <mark>police</mark> <mark>department</mark> Chicago claims to be"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2407.14, 492.2, 2561.67, 1333.31], "bbox_id": "2de287b277", "file": "TimesVirginian_1976_0451.pdf", "page": 1, "text": "The Appomattox Town Coun cil approved the budget for 1977 at their meeting on Monday night of this week. The budget, as adopted, calls for operating expenses amount ing to 233,882.00 for 1977 as opposed to a 215,834.00 total budget for 1976. These figures show an increase in the budget for 1977 in the amount of 18,048.00. The 1977 budget shows 30,000.00 expenses for the Appomattox County Schools electric charges. Under an agreement with the Appomat tox County School Board and the Appomattox County Board of Supervisors, the entire 30,000.00 will be reimbursed to the Town of Appomattox. If the rate is unchanged, this amount should be sufficient to cover payment for electricity at all Appomattox County Schools I 148,565.00 was approved for expenditures from the General Fund, 65,317.00 was approved for expenses for the Water Fund, and 20,000.00 was approved for Sewer Fund expenses. Of the 148,565.00 approved and allocated for the General Fund, 69153.00 will go for Administrative expenses 34, 427.00 goes to the Police Department 4,670.00 goes to the Fire D epartm ent 24,222.00 goes to the Street Department and 16,093.00 goes for expenses for the Sshitctiqp Department. fwi Jim May and Mr. lsiph Hines, May-Hlne8 Associates of Farmville, appeared before council to ask approval to submit to the health depart ment in Richmond, on behalf of the Town of Appomattox, plans and specifications for improve ment to the water system. The project, mostly funded by a HUD block grant, would include a water storage tank and foundation and part of a water line to the storage tank. Additional funds will be needed and a local public works application has been sent in for funds. Assuming it is approved, work is to begin within 90 days. If and when the project is advertised for bids it will be in two parts one, storage tank and two, water line. . Council approved the May- Hines request. May-Hines Associates was also given authorization by council to apply for additional funds through HUD for the l next step in the Downtown  Project, that being the recon struction of Harrell Street. In other business, council ! gave approval to purchase a"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "427.00 goes to the <mark>Police</mark> <mark>Department</mark> 4,670.00 goes to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "427.00 goes to the <mark>Police</mark> <mark>Department</mark> 4,670.00 goes to the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2364.02, 437.99, 2518.57, 932.77], "bbox_id": "f14c444416", "file": "AppomattoxNewspapers_1974-1975a_0562.pdf", "page": 1, "text": "The Appomattox Town Coun cil approved the budget for 1976. at their meeting on Monday night of this week at the Town Hall. The budget, as adopted, calls for operating expenses amount ing to 215,834.00 for 1976 as opposed to a 297,280.00 total budget adopted for 1975. These figures show a decrease in the budget of 81,446.00. The 1975 budget included 130,000 expenses for payment on the Appomattox County Schools electric charges, Un der an agreement with the School Board and the Appomat tox County Board of Supervis ors, the entire 130,000 was to be reimbursed, however, the town realized a savings on the budget when VEPCOs request for a rate increase was denied by the State Corporation Commission. The total electric bill paid by the Town of Appomattox and reimbursed by the School Board and Board of Supervisors was approxi mately  40 , 000 . 00 , less than anticipated. If the VEPCO rate is unchanged, the 1976 budget should be sufficient. 134,204.00 was approved for expenditures from the General Fund, 62,230.00 was approved for expenses for the Water Fund, and 19,400.00 was approved for Sew er Fund expenditures. Of the 134,204.00 allocated for the General Fund, 65,340.- 00 will go for Administrative expense 28,510.00 goes toth e Police Department 4,623-00 L  J h  f t r e Depart the"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "28,510.00 goes toth e <mark>Police</mark> <mark>Department</mark> 4,623-00 L  J h"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "28,510.00 goes toth e <mark>Police</mark> <mark>Department</mark> 4,623-00 L  J h"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1700.4, 637.71, 1854.2, 703.75], "bbox_id": "a865a0a7ce", "file": "AppomattoxNewspapers_1908-1909a_0362.pdf", "page": 1, "text": "Tackles Big Job Mexico City.Antonio Rios Zer- tuche, Inspector general, has Institut ed a reform In the police department. For years policemen carried ol! lan terns. Now they have pocket flash lights."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "a reform In the <mark>police</mark> <mark>department</mark>. For years policemen carried"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "a reform In the <mark>police</mark> <mark>department</mark>. For years policemen carried"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.51, 655.72, 1858.43, 721.18], "bbox_id": "4ad07e7246", "file": "AppomattoxNewspapers_1926-1933a_0362.pdf", "page": 1, "text": "Tackles Big Job Mexico City.Antonio Rios Zer- tuche, inspector general, has Institut ed a reform in the police department. For years policemen carried oil lan terns. Now they have pocket flash lights."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "a reform in the <mark>police</mark> <mark>department</mark>. For years policemen carried"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "a reform in the <mark>police</mark> <mark>department</mark>. For years policemen carried"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [351.83, 1466.67, 1833.42, 1685.03], "bbox_id": "e28c3fe824", "file": "AppomattoxNewspapers_1908-1909a_0195.pdf", "page": 1, "text": "t h e F b l p l a i  S b a d e s  a n d j i f the Service W eight. body exercising the profession of guide without a permit delivered by I the police department after an ex- I amlnatlon of bis capablUtles and I production of serious references. Complaints have feequentiy been made by tourists of overcharging in stores, visits to questionable resorts I and even regular holdups, for which swarthy, oily Individuals encountered In front of the big hotels In the eve-  nlng are mainly responsible. The po lice department issued an order two years ago that all guides should be In possession of n permit, but .thia has fallen Into abeyance. I . Guide-Interpreters on the toUrist I autocars bare  been heard - liifiln I travelers that under the lmsuenae col- I umn in the Place Vendomd, which I was constructed by Napoleon, lies  buried Marshal Petaln, who Is still Another explained"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "delivered by I the <mark>police</mark> <mark>department</mark> after an ex- I"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "delivered by I the <mark>police</mark> <mark>department</mark> after an ex- I"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.57, 672.52, 1831.88, 974.11], "bbox_id": "9d2fdca9f4", "file": "TimesVirginian_1976_0257.pdf", "page": 1, "text": "success. A special thanks to Mrs. Shirley Walton, County Extension Agent, for her excellent leadership and to Mrs. Isabelle Coleman, County President for her leadership and her lovely quilts. Thanks to Radio Station WTTX for announcements, to Mr. Lloyd Vaughan, editor of the Times- Virginian to the P.olice Department for extra patrol and to the Appomattox County Board for use of the high school and to the custtxlian for his help. There were 250 spectators and 94 quilts on display. The oldest quilt was made in 1858 and there were others made prior to the 1900s. The Festival was such a complete success that the HUme -Demonstration Clubs plan to -, make this an annual event - so, ladies, get busy and get some quilts made and ready for the 1977 show."}, "highlight": {"text": {"matched_tokens": ["P.olice", "Department"], "snippet": "Times- Virginian to the <mark>P.olice</mark> <mark>Department</mark> for extra patrol and"}}, "highlights": [{"field": "text", "matched_tokens": ["P.olice", "Department"], "snippet": "Times- Virginian to the <mark>P.olice</mark> <mark>Department</mark> for extra patrol and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1020.26, 891.61, 1171.58, 1142.55], "bbox_id": "f8add3f7e2", "file": "AppomattoxNewspapers_1918-1922a_0378.pdf", "page": 1, "text": "Starts Campaign On Tonics. Thomas E. Stone, Supervising Pro hibition Direator for Maryland, Ohio, West Virginia and the District of Co lumbia, is after alleged tonics re ported being sold for beverage pur poses. Mr. Stone was in conference with Commissioner Williams, of the Prohibition Bureau, Washington, and submitted a long list of remedies that, for reason of their alcoholic con tent and because they are being sold promiscuously In soft-drink establish ments, have been placed under ban. Major Harry Guessford, chief of po lice of Washington, has given orders, it was stated, to confiscate all concoc tions used as beverages found on sale there. Mr. Stone said that he had not asked the local police department to po-operaite in the same manner, nor would this be done until samples pur chased here had been analyzed. He said he knew of no Baltimore concerns that are manufacturing the stuff, but that there was considerable of it on the local market."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "not asked the local <mark>police</mark> <mark>department</mark> to po-operaite in the"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "not asked the local <mark>police</mark> <mark>department</mark> to po-operaite in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1013.49, 897.03, 1167.57, 1153.06], "bbox_id": "f8c2b678da", "file": "AppomattoxNewspapers_1918-1922a_0574.pdf", "page": 1, "text": "Starts Campaign On Tonics. Thomas E. Stone, Supervising Pro hibition Direator for Maryland, Ohio, West Virginia and the District of Co lumbia, Is after alleged tonics re ported being sold for beverage pur poses. Mr. Stone was in conference with Commissioner Williams, of the Prohibition Bureau, Washington, and submitted a long list of remedies that, for reason of their alcoholic con tent and because they are being sold promiscuously in soft-drink establish ments, have been placed under ban. Major Harry Guessford, chief of po lice of Washington, has given orders, it was stated, to confiscate all concoc tions used as beverages found on sale there. Mr. Stone said that he had not asked the local police department to co-operate in the same manner, nor would this be done until samples pur chased here had been analyzed. He said he knew of no Baltimore concerns that are manufacturing the stuff, but that there was considerable of it on the local market."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "not asked the local <mark>police</mark> <mark>department</mark> to co-operate in the"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "not asked the local <mark>police</mark> <mark>department</mark> to co-operate in the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [884.11, 1545.57, 1048.04, 1656.52], "bbox_id": "c0d092741a", "file": "AppomattoxNewspapers_1922-1923a_0214.pdf", "page": 1, "text": "St. Louis, Mo., Special. Two ser geants and eight patrolmen were sus pended from the police department by Acting Chief of Police Gillaspy, pend ing investigation of charges, it is said, that will be formally preferred against them before the police board. All the men were until recently on duty in the Central District, which is in the center of the grand jury investigation into charges of grafting."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "sus pended from the <mark>police</mark> <mark>department</mark> by Acting Chief of"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "sus pended from the <mark>police</mark> <mark>department</mark> by Acting Chief of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1645.69, 390.32, 1925.29, 465.61], "bbox_id": "e7fabeb761", "file": "TimesVirginian_1976_0142.pdf", "page": 1, "text": "SGT. Kent, Department of State Police, pictured at the right, explained the many uses of a helicopter to all of the first yee students of the Appomattox Primary School on April 16,1976. Landing and flying techniques were demonstrated to we students. The boys and girls discovered first-hand the friendly partnership existing between the State Police Department and the citizen."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "existing between the State <mark>Police</mark> <mark>Department</mark> and the citizen."}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "existing between the State <mark>Police</mark> <mark>Department</mark> and the citizen."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [290.4, 248.38, 435.94, 557.67], "bbox_id": "19c73a0f30", "file": "TimesVirginian_1981a_0227.pdf", "page": 1, "text": "Sergeant Zebuktri V. Saun ders, Jr., of the Appomattox Office of the Department of State Police has completed the nine-month Traffic Police Adm inistration Training Program conducted by The Traffic Institute, Northwestern Urii- versity, Evanston, Illinois. The management develop ment program began Septem ber 10, 1980, and . was completed on June 13,1961, by 78 police officers that represen ted 65 different law enforce ment agencies. There were 19 students from 14 State Police agencies, 44 from 38 municipal agencies, three from county agencies, one from the Bristol Township Police Department, Pennsylvania, me from the M assachusetts Registry of Motor Vehicles, one student from Bahrain, one from New Zeland, one from Qatar, one from the Royal Hong Kong Police, two from Saipan, one from Capetown, South Africa, and two from Taiwan."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "from the Bristol Township <mark>Police</mark> <mark>Department</mark>, Pennsylvania, me from the"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "from the Bristol Township <mark>Police</mark> <mark>Department</mark>, Pennsylvania, me from the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1398.41, 1340.62, 1537.85, 1540.96], "bbox_id": "901f924aea", "file": "TimesVirginian_1981a_0355.pdf", "page": 1, "text": "Sandy Brown, now associat ed with til American Cancer Society, willpresent a program on Driving, walking, and Home Safety  Tips For Women on October 27 at 730 in the Appomattox High School cafe teria. Ms. Brown trained with the Lynchburg Police Department and has spoken to over 5,000 women. In addition to the safety program, Ms. Brown will eak on the seven warning sals of cancer. The program is being sponsored by the Appomattox Junior Womans Club. The dub invites and encou rages the public tp attend."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "trained with the Lynchburg <mark>Police</mark> <mark>Department</mark> and has spoken to"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "trained with the Lynchburg <mark>Police</mark> <mark>Department</mark> and has spoken to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [320.65, 495.85, 488.77, 830.58], "bbox_id": "0c343620be", "file": "TimesVirginian_1983a_0101.pdf", "page": 1, "text": "Ruby Williamson, manager of the local Popes Family Center in Appomattox, attended the com panys semi-annual management seminar held on March 29 at the Dutch Inn Conference Center in Benson, N.C. All store managers and area supervisors of the company were present. Compsny President William R. Pope opened the seminar by giving a report on the past years all-time record-setting performance of the 82 store chain operating in North CarbUna and Virginia. Loss prevention, store opera tions, merchandising, office proced ures, accounting, and personnel management were among the many topics discussed by the other company exécutives, George T. Pope, Donald R. Pope and Michael R. Parham. The Dunn Police Department provided two detectives to instruct the group in theft prevention, legal aspects of apprehending theft, mid general store security principals. President Pope also announced plans to open the chains 88rd unit in W averly, Virginia, early this summer."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "R. Parham. The Dunn <mark>Police</mark> <mark>Department</mark> provided two detectives to"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "R. Parham. The Dunn <mark>Police</mark> <mark>Department</mark> provided two detectives to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1634.85, 1305.2, 1781.41, 1429.2], "bbox_id": "b631cfb56c", "file": "AppomattoxNewspapers_1918-1922a_0510.pdf", "page": 1, "text": "rk Police Commissioner J f f 1 wrote Mayor Hylan that he  recommended to the District At- Cit re, ff,ufiVe counUea in New York mem U hey eek grand iury indict S a ithe NeW York Herald ior 1-  J Ssemmatlon of false informa- to wncernmgthe Police Department. iD a reCeDt rC8U  Ot biUnJlS1. 11 M and unslvl crimes, Mleged to have made 75 false state- Chapter L10ation of Section 1353,  56 of the laws of 1920."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "false informa- to wncernmgthe <mark>Police</mark> <mark>Department</mark>. iD a reCeDt rC8U"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "false informa- to wncernmgthe <mark>Police</mark> <mark>Department</mark>. iD a reCeDt rC8U"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1896.17, 229.95, 2039.65, 733.64], "bbox_id": "48ec5c6a7d", "file": "AppomattoxNewspapers_1971-1973a_0524.pdf", "page": 1, "text": "Richmond, Va. - The Honor able Wayne A. Whitham. Secretary of Transportation and Public Safety for the Com monwealth of Virgina was the luncheon speaker at the Youth Highway Safety Conference, Friday November 3 at the Hotel Jefferson in Richmond. The one day Conference, which was expected to draw some 200 youths from throu ghout the state, is sponsored by the Highway Safety Division of Virginia in cooper ation with the Virginia High way Safety Commission, the Governors Youth Advisory Council, local Highway Safety Commissions, state h i g h schools, and various school clubs and organizations. Program topics and speakers included keynote address. Miss Mary Lynn Tate, Gover nors Youth Advisory Council Virginias highway safety pro gram, John T. Hanna, director, Highway Safety Divison of Virginia alcohol counter-mea sures, Dr. Robert B. Voas, physical scientist, Office of Alcohol Counter-m e a s u r e s, Dr. Robert B. Voas, physical scientist, Office of Alcohol Counter-measures, National Highway Traffic Safety Ad ministration safety town, Sgt. Henry W. Stanley, Henrico County Police Department and motor vehicle safety standards and the recall program, Thomas C. Samuels, manager, General M o t o r s Training Center, Fairfax."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "W. Stanley, Henrico County <mark>Police</mark> <mark>Department</mark> and motor vehicle safety"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "W. Stanley, Henrico County <mark>Police</mark> <mark>Department</mark> and motor vehicle safety"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.73, 849.39, 1707.13, 1030.27], "bbox_id": "1d1fccd0f3", "file": "AppomattoxNewspapers_1971-1973a_0398.pdf", "page": 1, "text": "RICHMOND - A 125 federal grant was awarded to Ap pomattox County for highway programs during the 1972-73 fiscal year. The allo ca tio n , to be matched with local funds, is available under the U. S. Highway Safety Act of 1966 and ad m in istered by the I Highway Safety Division of Vir-ginia, according to D irec tor John T. Hanna.  The grant will enable the Appomattox County Police Department to purchase equipment for accident in vestigation."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "enable the Appomattox County <mark>Police</mark> <mark>Department</mark> to purchase equipment for"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "enable the Appomattox County <mark>Police</mark> <mark>Department</mark> to purchase equipment for"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [281.05, 711.96, 428.84, 1021.75], "bbox_id": "c3c86b7cfc", "file": "TimesVirginian_1978_0416.pdf", "page": 1, "text": "Richardson, Appomattox Coun ty Sheriff and Sue Holland, Director Drug Abuse Services, Lynchburg. In answer to several ques tions, Mr. Kerr told the group that any drug problem is serious, however, now that the people are becoming aware and want to help he feels that something can he done to help anyone in our county with a drug problem. Sergeant Delp andor representatives from the V irginia S tate Police Department, along with the Sheriffs Department will be able to provide speakers on the Drug Abuse Problem when asked. Kerr said that Alcohol abuse is a major problem in our county but the combination of drugs and alcohol use is on the rise. Superintendent of Appomat- tox -County Schools, Lloyd G. WkiMn iri answering questions before the panel said that in only one case does he know of"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "V irginia S tate <mark>Police</mark> <mark>Department</mark>, along with the Sheriffs"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "V irginia S tate <mark>Police</mark> <mark>Department</mark>, along with the Sheriffs"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1012.31, 762.07, 1179.66, 1253.38], "bbox_id": "2212bc54a7", "file": "AppomattoxNewspapers_1947-1949a_0437.pdf", "page": 1, "text": "Retired Policeman Makes Things Tough for Crooks MOUNT fERNON, N. Y.  Mel vin H. Rauch still is making things tough for the crook even though he has retired from the Mount Vernon police department. Rauch, 48, is not toting a gun or a night stick any longer. His new role in the battle against crime is that of an inventor. His invention is a simple, inex pensive metal device that looks something like a slide rule. With it almost any door can be locked from the inside and no key in the world will open the door from the outside. The invention is aimed at those thieves who use skeleton keys, or pass keys, to open doors in hotels, apartments and private homes. The device also guards against a lock being picked. It operates simply. One hooked end of the device is placed in the strike plate or jam. The door is then closed and most of the device which is a thin strip of metal, ex tends on the inside of the door.  A latch then is slid into tight position against the door. Pronto the door is locked so that no key can open it. The latch is slid back ward when a person desires to re move the device and open the door. Rauch said the idea of the in vention came to him during one of nis many investigations of rob beries by thieves who had used skeleton keys to enter a home. His invention is protected by patents and a large manufacturer now is putting the device into pro duction. The device weighs only a few ounces and is no longer than a tooth brush. It can be carried in a mans pocket or in a womans handbag. Rauch says his invention should prove especially helpful to those who travel."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "from the Mount Vernon <mark>police</mark> <mark>department</mark>. Rauch, 48, is not"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "from the Mount Vernon <mark>police</mark> <mark>department</mark>. Rauch, 48, is not"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [473.52, 687.65, 638.5, 936.9], "bbox_id": "699014a26e", "file": "AppomattoxNewspapers_1905-1912a_0180.pdf", "page": 1, "text": "Refuse to Guard Against Strikers in Columbus, Ohio. Columbus, Ohio Special.Fifty-three members of the Police Department within 24 hours have rebelled against Mayor Marshalls orders to ride on street cars. The mutineers were increased by 20. All of the 20 were men employed as spec ials for strike duty. Unlike the regular officers who mutinied, the 20 specials were not suspended, but upon their re fusal to board cars they were told that by that act they had removed themselves from the service. The Mayor made no call for the return of State troops. Officers of the Fourth Regiment, four companies of which are stationed in Columbus, say they have been told to hold themselves readv for service, hut at the adjutant-generals office it is denied that preparations have been made for calling out troops. Mayor Marshall called for 2,000 vol unteers for police duty. He took the brunt of all criticism made against the manner in which the situation has been handled, but said that if his critics were sincere they would offer to perform police duty."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Special.Fifty-three members of the <mark>Police</mark> <mark>Department</mark> within 24 hours have"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Special.Fifty-three members of the <mark>Police</mark> <mark>Department</mark> within 24 hours have"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.5, 1013.31, 1966.46, 1774.74], "bbox_id": "0ac814963a", "file": "AppomattoxNewspapers_1908-1909a_0439.pdf", "page": 1, "text": "Recently Dr. Conrad, of Roa noke, spoke in the Courthouse here, a report of his speech was published in this paper. He was I attu n es positively nuardedI and unfair in his remarks about Gov. Smith and Tammany H a ll- quoting from M. R. Werners book on Tammany. The real truth is told by a man who knows and is a Republican at that-here it is, and Dr. Con-1 rads authority i s distinctly discredited Editor, Petersburg progress- index Sir. You have printed some references to a republican cam paign document entitled Tam many Hall, written by M. ft I Werner. To prevent any mis understanding, let me say at the outset that I am a republican who cast his first presidential vote for Benjamin Harrison in 1892 and his last for Calvin Cool- idge in 1924 but I hate slander, whether it is republican slander! or democratic slander. This book was published when it became certain that Smith would be nominated and was, certainly intend! to in F l i , piliyn flftle It wan. wJTKZa  wtoQu tg an ig  3       t o i r imnnvprlahftri. ri .ttUf feeing impoverished, and without even protesting? As 1 said before, by suppression here. j exaggeration there, and misrep resentation elsewhere all done with an eye on its effectiveness! . for the campaign, purpose of the Republican National Committee. He presents extracts from the report of the Lexow Committee showing the crimes that were perpetrated u n d e r C r o k e r l through the police force but he I nowhere informs you that the police department was ruled by a four-headed bi-partisan commis sion, and that many of the crimes I had been committed years before b y anti-Tammany administra tions. The official extracts look impressive and the reader may not notice, in his haste, that along with them. Werner prints . other quotations as if they were of equal authority, but which in  fact are mere gossip and mostly mendaoiqus on their face. The reader, seeing that tiie Lexow extracts are authentic, is not likely to notice that the others, for l 39 years New Yorit city hasfput forward with the same gray"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "informs you that the <mark>police</mark> <mark>department</mark> was ruled by a"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "informs you that the <mark>police</mark> <mark>department</mark> was ruled by a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1587.82, 920.75, 1741.13, 1106.14], "bbox_id": "8b70917338", "file": "AppomattoxNewspapers_1902-1905a_0290.pdf", "page": 1, "text": "Powerful Man of Ruftaia. Among the most powerful men li Russia, in foreign as well as iu domes tic affairs, is M. De Plehwe, Ministei of ihe Interior. When promoted t his present office he wns head of tbi Police Department To him perhopi more than to any other member of tbr Imperial Council is credited the stead iness with which Nicholas II. has pur sned tiie greater Russian policy whict has forced the present war after hav ig raised the eagles of the Czar ove inland. Rightly or wrongly, D Plehwe has been charged with liavinf been the agent who instigated the fear ful massacre at Kishinef. He wa prompt to deny, however, that eithei his imperial master or himself gav the nod of permission for the slangb ter."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "wns head of tbi <mark>Police</mark> <mark>Department</mark> To him perhopi more"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "wns head of tbi <mark>Police</mark> <mark>Department</mark> To him perhopi more"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1099.46, 158.15, 1953.33, 641.71], "bbox_id": "3cc1e4b802", "file": "AppomattoxNewspapers_1971-1973a_0130.pdf", "page": 1, "text": "POMATTOX V DECEMBER o ly n who has been on the police f o r c e for some time is now Lie- u t a n t of policewomen, highest 3 r d ranking officer in the Balt i m o r e Police Department. Lets t a k e our hats off to Lieutant R o b in so n . T h e Galilee Baptist Church C h o ir is sponsoring the annual C a n d le Service at the church S u n d a y , December 19th at 800 p . m . We are asking our sister c h u r c h e s to come and share at t h e program with us. If you c a n  t come as a group, please b e represented by one or two i n num ber. We shall be looking f o r w a r d to your coming to us. W e a r e going to be looking for y o u ! M is s Hester Stevens and Mrs. H . F oster attended the Delta S ig m a Theta Sorority meeting i n F o r t Hill Village, Lynchburg r e c e n t ly . They dined at the A m e ricana Restaurant. M r . and Mrs. Julian Hamlet a n d n iece, Mrs. Geneviene Hol m e s spent the Thanksgiving h o lid a y with relatives in Balti m o r e , Md. M r s . Holmes has accepted a p o s it io n with the State Health D ep artm en t as Public Health N u r s e . She has been assigned to C h a r lo tte County and will start h e r new position on December L S h e previously was employed a s h e a d nurse at the Lynchburg T r a in in g School and HospitaL. M r s . Holmes moved to Appo m a t to x from Buffalo, N. Y. a y e a r and a half ago.  See You Around. -"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "m o r e <mark>Police</mark> <mark>Department</mark>. Lets t a k"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "m o r e <mark>Police</mark> <mark>Department</mark>. Lets t a k"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [510.49, 877.71, 672.79, 996.91], "bbox_id": "986ffd7e88", "file": "AppomattoxNewspapers_1922-1923a_0454.pdf", "page": 1, "text": "Police Graft In Missouri. Kansas City, Mo. Special.Fol lowing allegations of corruption in the Police Department here, an in vestigation having the approval of Governor Folk will probably be start ed at once. Governor Folk is quoted as saying If there are crooks in the Department they must be found out, and if they are found out they must be summarily dismissed. There will be no halting. Conditions at Kansas City are not reassuring."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "of corruption in the <mark>Police</mark> <mark>Department</mark> here, an in vestigation"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "of corruption in the <mark>Police</mark> <mark>Department</mark> here, an in vestigation"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [702.25, 1292.39, 857.24, 1419.71], "bbox_id": "17132e85e9", "file": "AppomattoxNewspapers_1918-1922a_0503.pdf", "page": 1, "text": "Police Commissioner Enright Puts Ban On Ledoux. New York.Police Commissioner Enright announced he would not per mit Urban Ledoux to hold his adver tised auction of unemployed here. He said it was unnecessary. The Welfare Bureau of the Police Department is doing what it can to secure work for the unemployed, he said. Anyone who needs help can apply to the bu reau and we will find a man to fill the position."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Welfare Bureau of the <mark>Police</mark> <mark>Department</mark> is doing what it"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Welfare Bureau of the <mark>Police</mark> <mark>Department</mark> is doing what it"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.07, 787.03, 1773.67, 1017.32], "bbox_id": "9cc692eb5a", "file": "AppomattoxNewspapers_1960-1962b_0031.pdf", "page": 1, "text": "Plansftre being made for the 2nd n-ty had paid money to I annual Horse Show, to be co-spon in a total of nearly sored here -by fhe Lions Olub and erson was tried and I the Jaycees. Serving as chairman costs, with a promise for this years event is R. Murrell was 481.74. Buit, the Ferguson, president of the Lions way from custody else-1 Club. He is being assisted by Earl herd the case stood all Agee, of the Jaycees, and S. A But Sheriff Robertson Lawson, of the Lions Olub. Serving open and followed the I as secretary is Mrs. James C. Ar-, s person being arrest-1 thur, Lynchburg, or various offenses. These will be two shows, begin- st week, Sheriff Rob-lndng a t 1 P. M. and 7 0 P. M., on n Richmond, Va. .with l SIaturday, May 28, at the Appomat- his case, and went .byltox Ball Park. Plans have been Police Department to I made to secure stalls for those e-n- e if they had recent I .trante who olan to stay overnight, Whale, he was in the I and will also be made available dur- lice office, a man cameling the day of the show. Ing just selbtiled a easel Tickets will be on ssMe in the very der the influence. At I near future by members of the Robertson c recognized  Lions Club and Jaycees. was apprehended, and"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Park. Plans have been <mark>Police</mark> <mark>Department</mark> to I made to"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Park. Plans have been <mark>Police</mark> <mark>Department</mark> to I made to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [209.75, 1224.28, 370.14, 1339.08], "bbox_id": "f893620b8d", "file": "AppomattoxNewspapers_1902-1905a_0573.pdf", "page": 1, "text": "Pitttsburg, Pa., Special.Ex-Capt. James Wilson, of the Allegheny police department, was sentenced to pay a fine of 100 and to serve a term of six months m the county workhouse, as the result of the convictions in graft cases. His attorneys immediately appealed the case to the Superior Court. This will act as a stay of imprisonment until next spring should the appeal he affirmed. Wilson is the first defendant to be sentenced since the Allegheny graft crusade began. He was tried on two charges of extor-"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Wilson, of the Allegheny <mark>police</mark> <mark>department</mark>, was sentenced to pay"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Wilson, of the Allegheny <mark>police</mark> <mark>department</mark>, was sentenced to pay"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [839.06, 690.73, 998.44, 880.43], "bbox_id": "1547068d2c", "file": "AppomattoxNewspapers_1905-1912a_0012.pdf", "page": 1, "text": "Pistol play of the frontier variety dis turbed the serenity of Wilgerforce Sully, a lawyer, whose life was threatened, he declares, by one Edward Brown. Mr. Sully was seated at his desk when a tall, well-dressed men entered, took a revol ver from his pocket and pointed it at the attorneys head.  I want that money, said the intruder, according to the com plaint, and I want it quick. Mr. Sully persuaded him to talk it over. The two were chatting when Detectives Arm strong and OConnell, who had been summoned from the Wall street bureau of the Police Department, entered and put Brown under arrest. Mr. Sully says he never had any financial transactions with him at all, and that his acquaint ance with the man was very slight. The complainant is a personal friends of Pierre Marshall Brown, a well-known railroad lawyer, who is a brother of the prisoner."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "street bureau of the <mark>Police</mark> <mark>Department</mark>, entered and put Brown"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "street bureau of the <mark>Police</mark> <mark>Department</mark>, entered and put Brown"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [707.31, 216.14, 856.78, 310.38], "bbox_id": "16a7cc3da3", "file": "AppomattoxNewspapers_1971-1973a_0441.pdf", "page": 1, "text": "Payne, a member of the Lynchburg Police Department for nearly 18 years, died at 620 p.m. Monday in Lynch burg General-Marshall Lodge Hospital following a lengthy j illness. He was 44. A resident of 5928 Dublin  St., he was a son of Francis"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "member of the Lynchburg <mark>Police</mark> <mark>Department</mark> for nearly 18 years,"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "member of the Lynchburg <mark>Police</mark> <mark>Department</mark> for nearly 18 years,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [915.85, 1581.04, 1074.5, 1975.19], "bbox_id": "2524a74372", "file": "AppomattoxNewspapers_1898-1902a_0528.pdf", "page": 1, "text": "Pasteboard armor is talked of. Madagascar is importing Chinese. Chicago has a servant girls union. Belfast is Irelands richest and most populous city. The law forbids the Christian Scien tists to practice in Missouri for pay. St. Louis freight handlers wages have been advanced 15 cents per day. A recent rain in Southern California increased the Lompoc Valley mustard crop from three sacks an acre to thirty sacks. France consumes more wine than Ger many, the United States and the United Kingdom put together. Peoria boiler makers srike earned re cognition of union and 8 per cent, in crease in wages. In Norway it is necessary for a wo man to hold a certificate of proficiency in cookery and needlework before b-n  allowed to marry. Viennese hair dressers have held a mass-meeting to protest against the pre vailing masculine fashion of wearing the hair cut short, as being inartistic and un natural. A certain length, say of thirty millimeters, they aver should be main tained. Lawndale, Kan., a town of 2000 inhabi tants, boasts of a police department that has not made a single arrest inthe last eight years. Only about 20 per cent, of the waiters in German hotels and restaurants receive any wages, as they are expected to live on their fees. As a protection against the competi tion of Chicago Chinese and prison la bor the White Broom Manufacturers Association of California has adopted the blue label of the International Broom-makers Union, and will in fu ture refuse to sell goods to dealers who handle the product of prison and Chi nese labor."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "tants, boasts of a <mark>police</mark> <mark>department</mark> that has not made"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "tants, boasts of a <mark>police</mark> <mark>department</mark> that has not made"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [93.6, 347.75, 396.93, 578.95], "bbox_id": "9731812cc7", "file": "TimesVirginian_1981a_0445.pdf", "page": 1, "text": "PARTICIPANTS IN recent Sexual Child Abuse Workshop ore. front row, left to right, Susan Wright, Chairman, Multidiscipline Team Jenny Fratrick, Volunteer Coordinator back row, left to right Mrs. Carol Bradley and Mrs. Rosella Harty, Arrangements Sexual Abuse Task Force Presenter, Ms. Candace Cowlbeck, Protective Social Worker, Lynchburg Department of Social Services Mr. Jack Lewis,Investigator, Lynchburg Police Department Ms. Diane Walker, Child Psychologist, Central Virginia Mental Health Services. Ms. Walker was the coordinator of the Sexual Abuse Task Force. Child abuse studied here"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Mr. Jack Lewis,Investigator, Lynchburg <mark>Police</mark> <mark>Department</mark> Ms. Diane Walker, Child"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Mr. Jack Lewis,Investigator, Lynchburg <mark>Police</mark> <mark>Department</mark> Ms. Diane Walker, Child"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.21, 1004.36, 1796.68, 1118.31], "bbox_id": "07777e5abf", "file": "TimesVirginian_1981a_0140.pdf", "page": 1, "text": "organized in 1962 holds two meeting each year and all members are in some way affiliated with law enforcement. The total membership ihcludes 32 states and two Canadian Provinces, Ontario and Quebec.. The Kenbridge, Virginia Police Department was host for the occasion with Sgt. James F. Whitlow of Kenbridge acting as"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Quebec.. The Kenbridge, Virginia <mark>Police</mark> <mark>Department</mark> was host for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Quebec.. The Kenbridge, Virginia <mark>Police</mark> <mark>Department</mark> was host for the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [352.51, 1390.23, 522.18, 1810.4], "bbox_id": "3692eff80b", "file": "AppomattoxNewspapers_1926-1933a_0195.pdf", "page": 1, "text": "Organize Paris Body to Fight Fake Guides Paris.Determined to rid the Paris boulevards, museums and other pub lic places where tourists gather ot the noxious so-called guides who pester foreigners, a group of profes sional couriers and guides have or ganized the Interpreters club with, well-defined aims. The principal ob ject of the society is to prevent any body exercising the profession of guide without a permit delivered by the police department after an ex amination of bis capabilities and production of serious references. Complaints have frequently been made by tonrlsts of overcharging in stores, visits to questionable resorts and even regular holdups, for which swarthy, oily Individuals encountered in front of the big hotels In the eve ning are mainly responsible. The po- Uce department Issued an order two years ago that aU guides should be In possession of a permit, bnt this has fallen Into abeyance. Guide-Interpreters on the tourist autocars have been heard telling travelers that under the Immense col umn In the Place Vendomd, which was constructed by Napoleon, lies burled Marshal Petaln, who is still very much alive. Another explained to a group of Americans visiting Mal- maison, the palace where the Em press Josephine spent her last days, that Mme. Malmalson was the mother of Napoleon III. Marital Definition The moat hard-boiled business girl hi this neighborhood calls getting married tackling the dummy.Ohio  State Journal."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [353.01, 1376.63, 516.82, 1740.08], "bbox_id": "c9854784ea", "file": "AppomattoxNewspapers_1926-1933a_0196.pdf", "page": 1, "text": "Organize Paris Body to F ight Fake G uides Paris.Determined to rid the Paris boulevards, museums and other pub lic places where tourists gather of the noxious so-called guides who pester foreigners, a group of profes sional couriers and guides have or ganised the Interpreters club with, well-defined alms. The principal ob ject of the society Is to prevent any body exercising the profession of guide without a permit delivered by the police department after an ex amination of his capabilities and production of serious references. Complaints have frequently been made by tourists of overcharging In stores, visits to questionable resorts and even regular holdups, for which swarthy, oily Individuals encountered In front of the big hotels In the eve ning are mainly responsible. The po lice department issued an order two years ago that all guides should be In possession of a permit, bnt this has fallen into abeyance. Guide-Interpreters on the tourist autocars have been heard telling travelers that under the immense col umn In the Place Vendome, which was constructed by Napoleon, lies burled Marshal Petaln, who is still very much alive. Another explained to a group of Americans visiting Mal- malson, the palace where the Em press Josephine spent her last days, that Mme. Malmalson was the mother of Napoleon III."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "permit delivered by the <mark>police</mark> <mark>department</mark> after an ex amination"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [404.63, 974.38, 748.51, 1385.16], "bbox_id": "ce51a5a934", "file": "AppomattoxNewspapers_1954-1955a_0335.pdf", "page": 1, "text": "One of the ironies of recent civilian evacuation tests, involving Wash ington and other U. S. defense centers, i 3 the fact that the American people havent been given adequate information to know what a real attack would mean. For one thing, the destructiveness of the bombs now being made in this country and Russia already make the recently-conducted evacuation drills obsolete. The recent drills were based on the possibility of atomic- bomb attacks. Yet the evacuations practiced would not have afforded protection against an attack with more destructive weapons now being made and available. The fall-out of radio-active ash would have caused casualties almost beyond estimation had the recent evacuation drills been the real thing. There has been a dangerous amount of foot-dragging in giving the American people the facts about the new developments in the hydrogen- bomb field. New bombs are so powerful there is practically no defense against them. In addition, there has been a scandalous delay in the production and distribution of detectors which citizens should have in ample numbers to day they should have had them a year or two ago. Without the de tectors it is impossible for the average citizen to know whether he has been contaminated with radio-active ash or fall-out, or not. Yet it was pointed out in Washington that civilian defense officials had only four radio-active measuring counters, or detectors, in that city the national capital when the recent drill took place. Four when a hundred thousand would have been needed! This is necessary because if a person finds he has been subjected to radio-active fall-out he must act immediately, if he is to save his life. And radio activity cannot be detected by the eye, or by feel, until it is too late! The Administration should immediately okay a simple geiger count er, or detector, for manufacture. They should become a part of the equipment of every fire station, police department, and civilian defense organization in the country. The United States is woefully unprepared in the field of civilian de fense  so unprepared it staggers the imagination to think what would happen if this country actually sustained such an attack. The people need the awful facts, and they need a plentiful supply of portable detectors, and that responsibility rests with the Administration."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "of every fire station, <mark>police</mark> <mark>department</mark>, and civilian defense organization"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "of every fire station, <mark>police</mark> <mark>department</mark>, and civilian defense organization"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.8, 197.68, 1797.81, 457.52], "bbox_id": "c4de7eae3c", "file": "TimesVirginian_1976_0067.pdf", "page": 1, "text": "On February 11, 1976 at an organizaitonal meeting of Area Sheriffs and Chiefs of Police, a discussion was held concerning the tremendous increase in thefts of citizen band radios. Law enforcement agencies are appealing to area citjzqns to contact the sheriffs or police department in their atejji and obtain an engraving tMi and mark their radio to enabll it to be identified in the event it is stolen and later locatft The association noted that there has been a dramatic incratioe of radio thefts in the past several months and in many cases the vehicle is not locked. It was also suggested that the unit be installed in such a manner to permit its easy removal by the owner, thereby eliminating the temptation of theft when the"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "contact the sheriffs or <mark>police</mark> <mark>department</mark> in their atejji and"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "contact the sheriffs or <mark>police</mark> <mark>department</mark> in their atejji and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [778.76, 694.51, 946.49, 794.05], "bbox_id": "cab17a1d86", "file": "AppomattoxNewspapers_1954-1955a_0324.pdf", "page": 1, "text": "Oklahoma City.- Fingerprinting experts of the Police Department were startled when they placed 54- year-old Oran Telfords hands on the fingerprint card, which contains five slots, and discovered there was a finger over. - Telford had six fin gers on each hand, and taking off his shoes, he showed officers he had six toes on each foot."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Fingerprinting experts of the <mark>Police</mark> <mark>Department</mark> were startled when they"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Fingerprinting experts of the <mark>Police</mark> <mark>Department</mark> were startled when they"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.05, 527.08, 1715.67, 976.26], "bbox_id": "73237210ff", "file": "TimesVirginian_1980a_0122.pdf", "page": 1, "text": "now due to the present inflationary times and the economic conditions was made by Councilman Richard L. Bass and seconded by Thomas W. Lawson. All members approved the motion. Plans are for the town to revitalize the present sewer system and make do with what they can afford to pay for without putting a burden on the citizens of the Town of Appomattox. More than 60 per cent of the heads of households in the Town of Appomattox are over 62 years of age and are trying to live oo fixed incomes. The Town of Appomattox has taken a stand, it is fed up with Federal and State mandates, according to the coun cil members. George E. Jones  Sons, Inc. of Amherst has been awarded the con tract to connect the new one-million gallon water storage tank to the existing town water line. Construction is scheduled to begin May 16. M ay Spiggle read a proclamation from the City of Lynchburg thanking them for the assistance given by Town Police Department in carrying, out operation sting. In other business council a conjunction with the A_ ty Board of Supervisors, a support tie Existing Housing Section 8, Rental Subsidy program. Council voted to participate in the anti-litter campaign and will have a truck available on certain days to pick up litter in the corporate limits of the town only. On recommendation from the Street Committee council will turn over 200 feet of Price Land and 400 feet of Ethel Street.to the Virginia Department of Highways. ,v"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "assistance given by Town <mark>Police</mark> <mark>Department</mark> in carrying, out operation"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "assistance given by Town <mark>Police</mark> <mark>Department</mark> in carrying, out operation"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [146.92, 1559.68, 269.27, 1674.08], "bbox_id": "a35dbfd97b", "file": "TimesVirginian_1976_0378.pdf", "page": 1, "text": "Notify your local police department of the dates that youll be away from home and how you can be reached. Leave this same information and keys with a neighbor for emergency .use in case of a burglary or fire."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Notify your local <mark>police</mark> <mark>department</mark> of the dates that"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Notify your local <mark>police</mark> <mark>department</mark> of the dates that"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [612.26, 684.98, 784.21, 814.72], "bbox_id": "c61682c596", "file": "AppomattoxNewspapers_1954-1955a_0357.pdf", "page": 1, "text": "NOTICE I wish to correct a false statement which was circulated re cently concerning J. Alec Bingham, late candidate for the office of Sheriff of Appomattox Co. The statement was to the effect that Mr. Bingham retired from the State Police Department because of his age. This is not the truth Mr. Bingham retired because of seniority of service. By Mrs. J. Alec Bingham. ltc"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "retired from the State <mark>Police</mark> <mark>Department</mark> because of his age."}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "retired from the State <mark>Police</mark> <mark>Department</mark> because of his age."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.41, 329.28, 1722.39, 537.76], "bbox_id": "44709ac3f0", "file": "AppomattoxNewspapers_1922-1923a_0156.pdf", "page": 1, "text": "Norfolk.  New telephone rates, benefltting hundreds of subscribers in the annexed territory, now are effect ive. The reduction will result in a loss of revenue to thhf Chesapeake and Potomac Telephone Company of approximately 10,000 per year, it is estimated by J. C. Brown, local man ager. Petersburg.Linwood Shell, 15-year- old son of Bud Shell, of Nottoway, was accidentally shot and instantly killed while returning from a hunting trip near his home. Mrs. R. R. Rowland, head of the womans bureau of the Petersburg police department, and an aunt of the dead boy, was advised ol the accident, which happened when the boy unintentionally -placed his finger on the trigger of the loaded gun, sending the entire load through his body."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "bureau of the Petersburg <mark>police</mark> <mark>department</mark>, and an aunt of"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "bureau of the Petersburg <mark>police</mark> <mark>department</mark>, and an aunt of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2169.36, 422.96, 2336.26, 506.37], "bbox_id": "0cbceeb952", "file": "AppomattoxNewspapers_1955-1957a_0363.pdf", "page": 1, "text": "NO METERS THERE Austin, Texas.- Parking meters just wont stay put in front of a University of Texas mens dormi tory. Placed there by the police department, they are yanked out before the concrete base hardens, and some meters just disappear."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "Placed there by the <mark>police</mark> <mark>department</mark>, they are yanked out"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "Placed there by the <mark>police</mark> <mark>department</mark>, they are yanked out"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1118.66, 1659.14, 1270.21, 1785.06], "bbox_id": "e9c1e90ac1", "file": "AppomattoxNewspapers_1943-1947a_0184.pdf", "page": 1, "text": "Nice Bracelet Fit Locksmith to Rescue h .  NYERA peace officer left his handcuffs on the front seat of a car he took to a cars at , repinr. The repairmans 15-year! old son saw the cuffs and tried them on. After a fn.iti lea for the Sheri U T S S  - f e  Police department a S r  was caed ,o"}, "highlight": {"text": {"matched_tokens": ["Police", "department"], "snippet": "S S  - f e  <mark>Police</mark> <mark>department</mark> a S r  was"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "department"], "snippet": "S S  - f e  <mark>Police</mark> <mark>department</mark> a S r  was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1507.7, 1264.13, 1828.9, 1595.02], "bbox_id": "2daedd3817", "file": "AppomattoxNewspapers_1892-1898a_0208.pdf", "page": 1, "text": "New York Herald Dr. Park- hurst savagely attacks the Lexow j committee and does not spare its leading counsel, Mr. Goff, for not - ------------ _ handling Superintendent Byrnes asj gislature held Tuesday night United Williams was handled. I States Senator F. O. Wolcott was by He admits that Superintendent I unanimous vote nominated to succeed I Byrnes helped defeat Tammany and j himself. I aided the committee in its work of probing the police department with so much success, but does not hesi tate to declare that iu showing the Superintendent any consideration for that public service the committee and its chief counsel blundered and blundered badly. lt was,he charges, practically a deal. In this connection it is interesting to note that Senator Lexow says that the city was scraped as with a fine tooth comb in ordered to get some evidence against Byrnes,but it could not be found. He was questioned upon all the lines on which the committee or its counsel had any in formation. If any one knew any thing concerning his official career he should have informed us of it."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "work of probing the <mark>police</mark> <mark>department</mark> with so much success,"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "work of probing the <mark>police</mark> <mark>department</mark> with so much success,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2132.83, 1071.28, 2290.08, 1124.85], "bbox_id": "f318cea120", "file": "AppomattoxNewspapers_1892-1898a_0351.pdf", "page": 1, "text": "Navr T rial for a P o lice In sp ecto r. The Court of Appeals granted a new trial and leave to apply fora ohange ot venue to Inspector William W. McLaughlin, at tbe New York Police Department, who wa con victed of extortion us a result of tho Lexow investigation. .wow"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "at tbe New York <mark>Police</mark> <mark>Department</mark>, who wa con victed"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "at tbe New York <mark>Police</mark> <mark>Department</mark>, who wa con victed"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1607.25, 1166.63, 1739.0, 1412.82], "bbox_id": "13b1b0a60a", "file": "TimesVirginian_1980a_0310.pdf", "page": 1, "text": "Mrs. Bgttie L. Thomas attended the guest register for the reception. For her going away outfit, the bride cose a navy blue suit with matching accesso ries. The bride is a graduate of Appomattox County High School and is employed with the . Virginia State Police Department. The bride groom is also a graduate of Appomattox County High School and is a 1979 graduate of Virginia Poly technic Institute and State University where he is a. member of Delta Sigma Pi. He is employed in Williams- burg. After a wedding trip to Florida, the couple will make their homeJjX-fflilliamsbqrg."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "with the . Virginia State <mark>Police</mark> <mark>Department</mark>. The bride groom is"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "with the . Virginia State <mark>Police</mark> <mark>Department</mark>. The bride groom is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1630.76, 640.43, 1760.07, 786.98], "bbox_id": "9cbb0debfe", "file": "TimesVirginian_1980a_0212.pdf", "page": 1, "text": "Mr. and Mrs. Jack D. Layne of Appomattox an nounce the engagement of their daughter. Deborah Gall, to Thomas B. Wheeler, son of Mr. and Mrs. Ben D. Wheeler, also of Appomat tox. Miss Layne is a graduate of Appomattox County High School and is employed with the Virginia State Police Department. Mr. Wheeler is also a graduate of Appomattox"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "with the Virginia State <mark>Police</mark> <mark>Department</mark>. Mr. Wheeler is also"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "with the Virginia State <mark>Police</mark> <mark>Department</mark>. Mr. Wheeler is also"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [284.64, 1409.69, 433.3, 1574.78], "bbox_id": "86785199b4", "file": "TimesVirginian_1981a_0273.pdf", "page": 1, "text": "Moving to Florida, he began working for the police depart ment, performing beach patrol duties near Cocoa Beach, specializing in narcotics traf ficking. In 1970 he moved to San Antonio, Texas here he joined the Alamo Heights Police Department. In 1976 he was named Assistant Police ChieL a position he held until he was named chief of Police in July. Terry and his wife, Patti -have two sons, John 8 and Brian 6."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "joined the Alamo Heights <mark>Police</mark> <mark>Department</mark>. In 1976 he was"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "joined the Alamo Heights <mark>Police</mark> <mark>Department</mark>. In 1976 he was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [618.69, 1155.79, 781.03, 1330.64], "bbox_id": "e3b7fb64a7", "file": "AppomattoxNewspapers_1905-1912a_0086.pdf", "page": 1, "text": "Mobile Police Catch New Yorker Wanted For Tenement Crime. Mobile, Ala. Special. Julius Venner, alias Alexander Klein, alias Johansen, was positively identified here as August Petersen, who has been hunted on the charge of mur dering his wife, Sophie Johansen, in a West Ninety-eighth Street tene ment house in New York February 7 and concealing the body under the floor of the place. The identification was made by a brother of the murdered woman, who arrived here, accompanied by Police Sergeant Van Waganer, of the New York Police Department. Johansen, or Petersen, as he says his real name is, after the identification broke down and confessed."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "of the New York <mark>Police</mark> <mark>Department</mark>. Johansen, or Petersen, as"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "of the New York <mark>Police</mark> <mark>Department</mark>. Johansen, or Petersen, as"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1067.5, 1618.82, 1224.24, 1998.11], "bbox_id": "d961144211", "file": "AppomattoxNewspapers_1898-1902a_0377.pdf", "page": 1, "text": "Memphis, Tens., Police Department has Just inaugurated the eight-hour day. Prussia has among its working classes 7,300,000 men who each earns less than 105 a year. . The miners of the Yukon District, Alaska, it is said, employ 5280 men, who receive an average wage of 1 an hour. A strike of miners a t Baskett, Ky., for recognition of the union, involv ing lower wages, lias been won by the men. The average weekly earnings of farm laborers in England, given by recent reports, is 4.10 in Wales,4.00 in Scotland, 4.40 In Ireland, 2.45. The Pennsylvania Slate Factory In spector estimates that the Industries in the State employed 488,000 more persons in 1900 than they did in 1896. During the second quarter of this year the percentage of unemployed In New York was 20.7, just double the number out of work for the same period last year. There are about 30,000 waiters in New York City, and thicty per cent, of them belong to seven different un ions which formerly affiliated with the Knights of Labor. A pension for old employes, similar to the one adopted last January by the Pennsylvania Railroad east of Pirts- burg, will go into effect on the Penn sylvania road west of n ttsb u rg on January 1, 1901. F ifty je r cent, of the 3000 coke oven In McDowell and Mercer Counties, W. Va., have been put out of Wast, throwing out of employment 1500 men. It ia said to be due to the dull mar ket for the product."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Memphis, Tens., <mark>Police</mark> <mark>Department</mark> has Just inaugurated the"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Memphis, Tens., <mark>Police</mark> <mark>Department</mark> has Just inaugurated the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1237.64, 1326.75, 1861.36, 1468.62], "bbox_id": "29631ce90c", "file": "AppomattoxNewspapers_1943-1947a_0165.pdf", "page": 1, "text": "MEMBER FEDERAL DEPOSIT INSURANCE CORPORATIO Cold Preparations as directed. PHILADELPHIA, PA.  Lieut. Erwin Letak, who has downed four Jap planes and completed more than 109 missions, got his biggest thrill recentlyin the city stables, j As the flyer entered a stall, Paint, j a big, black police department  horse, turned his head, stomped, j and rubbed his nose against the man who rode him when he was a mounted patrolman. Paint had re fused to let any one ride him for the two years Letak has been away. I Now he was ready to go again."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "j a big, black <mark>police</mark> <mark>department</mark>  horse, turned his head,"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "j a big, black <mark>police</mark> <mark>department</mark>  horse, turned his head,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.09, 622.34, 1755.81, 1083.78], "bbox_id": "e77f6c9486", "file": "AppomattoxNewspapers_1955-1957a_0411.pdf", "page": 1, "text": "Mayor Richard D. Robinson has requested The Times-Virginian to publish -the following statement To the citizens and tax payers of the Town of Appomattox It has come to my attention through a number of citizens that several petitions are being circula ted relative to my asking the re signation of Town officer, Mr. E. T. Mitchell. First I would like to state that the action taken is in no way the out-growth of stay personal animos ity what-so-ever. I have never advocated and never will that the Town be self- supporting in its Police Department from the sole support of fines. In my conversation with Mr. Mitchell and telling him of tjie tremendous deficit in this Department, I was in ferring that from the lack of duty he bad not earned his salary. Entirely too much of his em ployment time by the Tiown has been used at his discretion, con trary to prescribed duties. Noi- bly, spending hours of this time at his home, and the assistance in other personal jobs and businesses at the expense of the Town. I be lieve his action in this respect has created an abuse of his duties and obligation to the people of the com munity.  I asked for Mr. Mitchells re signation because, in my opinion, it has been the continued inference of the Town Council to do so, and I felt it my duty as Mayor to take this action. TMa conversation took pla-tP within the Mayors office with Town manager, Mr. C. j. Hunter present, respectfully, Richard D. Robinson, Mayor."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "self- supporting in its <mark>Police</mark> <mark>Department</mark> from the sole support"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "self- supporting in its <mark>Police</mark> <mark>Department</mark> from the sole support"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2377.43, 318.44, 2799.72, 643.57], "bbox_id": "b37861e32d", "file": "AppomattoxNewspapers_1971-1973a_0584.pdf", "page": 1, "text": "Mayor  500.00 Council 1100.00 Payrolls 4866.00  M i l  mm m Ü Ü Tax List 300.00 Town Attorney t 300.00 Auditor 300.00 1 Insurance  Bonds 483.00 Memberships 300.00 Office Supplies, Postage, Box Rent 1000.00 Telephone 300.00 Electricity 200.00 Office Building Supplies  Maintenance 150.00 Publishing Ads - Promotion 200.00  Auto Tags 360.00  s   jäpisijf.i .Wsmmm School Electricity 6000.00 Other Reimbursals 600.00 Equipment 3339.00 Miscellaneous 200.00 ÉSèf- Total 20,498.00 ÈÈÊÊiÊMt POLICE DEPARTMENT Payroll 15,289.00 Salary - Judge 600.00 Car Repair  Maintenance 2100.00 v S P I  WBÈMWIm Insurance 356.00 Prisoner Care, Misc. 1000.00 PPS D.M.V. 100.00 i 8 1 IM H B feì Total 19.445J0 BËËm ÊSËÊÈÊÊ È"}, "highlight": {"text": {"matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "ÉSèf- Total 20,498.00 ÈÈÊÊiÊMt <mark>POLICE</mark> <mark>DEPARTMENT</mark> Payroll 15,289.00 Salary - Judge"}}, "highlights": [{"field": "text", "matched_tokens": ["POLICE", "DEPARTMENT"], "snippet": "ÉSèf- Total 20,498.00 ÈÈÊÊiÊMt <mark>POLICE</mark> <mark>DEPARTMENT</mark> Payroll 15,289.00 Salary - Judge"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.19, 856.63, 1818.35, 1071.33], "bbox_id": "ab42a03f48", "file": "AppomattoxNewspapers_1922-1923a_0429.pdf", "page": 1, "text": "May Be Another Lexow Inquiry. If the police inspectors of New York City should succeed In defeat in g the Bingham police bill they will probably find that they have ru n . their heads into a noose. It may mean another Lexow investigation of the city. On last Monday night there was introduced by Senator Page a bill that probably escaped the at tention of the inspectors. The rea- son of that probably was because the bill was only in the interest of char ter revision, but if the inspectors read that bill they will find that it is of. such a nature that the inspec tors can be placed on the stand and catechised. This bill has the en dorsement of Governor Hughes. The bill provides that the commission, which is to be appointed by the Gov ernor and be composed of nine mem bers, .shall have all the powers of a legislative committee. By this means they can go Into the workings of the Police Department."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "the workings of the <mark>Police</mark> <mark>Department</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "the workings of the <mark>Police</mark> <mark>Department</mark>."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [524.4, 1783.01, 679.45, 1900.93], "bbox_id": "70906cc23d", "file": "AppomattoxNewspapers_1918-1922a_0606.pdf", "page": 1, "text": "Martlnelli Sworn A New York Police - Reserve. New York.The place of Enrico Caruso has been laken by Giovanni Sfartinellinot ig opera, but in the New York Police Department. Mar- tineHl, tenor of the Metropolitan Op era Company, was sworn in aB a mem ber of the reserves, with full rights to wear a shield, carry handcuffs and a pistol. He took the place left vacant when Caruso died-"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "in the New York <mark>Police</mark> <mark>Department</mark>. Mar- tineHl, tenor of"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "in the New York <mark>Police</mark> <mark>Department</mark>. Mar- tineHl, tenor of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.3, 994.49, 1902.6, 1173.04], "bbox_id": "1a0a95d156", "file": "AppomattoxNewspapers_1943-1947a_0539.pdf", "page": 1, "text": "Man With Gun Chase Has Surprise Ending KANKAKEE, ILL.Two stae police squad cars and one front the Kankakee police department threw up a barrier on a high way and closed in on four men. The chase followed a report from a nearby community that one of the four men was carry ing a gun. The investigating police halted the car and found the man had a gun. But they discovered it was all right. He was a Spring- field, 111., detective going to Chi cago for a convention."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "one front the Kankakee <mark>police</mark> <mark>department</mark> threw up a barrier"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "one front the Kankakee <mark>police</mark> <mark>department</mark> threw up a barrier"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1578.95, 1114.86, 1748.75, 1764.47], "bbox_id": "6f958fa4b2", "file": "AppomattoxNewspapers_1905-1912a_0111.pdf", "page": 1, "text": "Maid Saves Brown Family. The heroism of Mary OBrien, a maid, saved the lives of George Hun ter Brown, his wife and his daughter when the- wealthyelubmans home, No. 54 East Fifty-second street, caught fire. With smoke and flame apparently hemming her in on every side, the young woman, an apron over her head, fought her way to the upper floors and Warned Brown of the peril. As he rushed out into the smoke-filled hall in his pajamas the maid sank to the floor in a stupor. An overheated furnace in the base ment under the front ball caused the fire. The OBrien girl smelled smoke and ran through the butlers pantry to find out what was wrong. A draught was made by the opening of the pantry door that fanned the flames under the hall floor fiercely and just as the maid, half stupefied by the smoke, forced her way through it and up to the landing above, the blaze broke through and started for the second story. The young womans warnings gave Brown time to telephone the Police Department and an alarm was rung in so speedily the fire was confined to the first floor. The damage was estimated at 2,000.New York Press. _______ r Penalties for Fugitive Husbands. The sentence of the pretended Ger man boran who was condemned to eight years Imprisonment for marry- I Ing twenty-four women, yields a mathematical comparison with the ! prison terms of fifty wife deserters, i captured in Bethnal Green, London whose sentences aggregate ten years I That section of tbe English metropo i lis is singularly notorious for wife- j desertion. In the last three years no j fewer than 149 men have left their ! families to th-e charity of the work- ! houses. As army and navy deserters I have-a price placed on their capture I in this country, so home-deserters ln ! Iondon are worth 5 each to any per- I son who gives information that leads  to their arrest. Of the 149 who left  their hmes, only fifty have been ar-  rested. Forty-two returned volun-  tarily and just as many were per- I suaded by the officials of the work- j house again to take up their domestic burdens. Fifteen never have been I found by either the police or the offi- j rials. The advertisements setting forth the descriptions of the missing husbands are batched in lots of fifty or more and the promise of the sover- I eign a head for Information has led I to plenty of amateur detective work. I One of the plans that is worked on ! the officials Is to have the runaway"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "time to telephone the <mark>Police</mark> <mark>Department</mark> and an alarm was"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "time to telephone the <mark>Police</mark> <mark>Department</mark> and an alarm was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1177.66, 506.93, 1330.5, 544.53], "bbox_id": "b140ad6155", "file": "AppomattoxNewspapers_1918-1922a_0562.pdf", "page": 1, "text": "Lynchburg.John N. Morris, traffic officer in the police department, has been promoted to the position of first lieutenant in the department."}, "highlight": {"text": {"matched_tokens": ["police", "department", "department"], "snippet": "Lynchburg.John N. Morris, traffic officer in the <mark>police</mark> <mark>department</mark>, has been promoted to the position of first lieutenant in the <mark>department</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department", "department"], "snippet": "Lynchburg.John N. Morris, traffic officer in the <mark>police</mark> <mark>department</mark>, has been promoted to the position of first lieutenant in the <mark>department</mark>."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1212.68, 505.01, 1364.52, 542.11], "bbox_id": "f001dcdcc8", "file": "AppomattoxNewspapers_1918-1922a_0366.pdf", "page": 1, "text": "Lynchburg.John N. Morris, traffic officer in the police department, has been promoted to the position of first lieutenant in the department."}, "highlight": {"text": {"matched_tokens": ["police", "department", "department"], "snippet": "Lynchburg.John N. Morris, traffic officer in the <mark>police</mark> <mark>department</mark>, has been promoted to the position of first lieutenant in the <mark>department</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department", "department"], "snippet": "Lynchburg.John N. Morris, traffic officer in the <mark>police</mark> <mark>department</mark>, has been promoted to the position of first lieutenant in the <mark>department</mark>."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1121.48, 860.16, 1272.07, 952.71], "bbox_id": "29d0c4ab85", "file": "AppomattoxNewspapers_1918-1922a_0483.pdf", "page": 1, "text": "Lynchburg.Chief D. C. Smith, of the police department, is arranging to dispose of the citys stock of con fiscated liquors shortly, and it is prob able that the supply will be turned over to the welfare department of the city for use at the city hospital. The supply has accumulated since early 1919, and Chief Smith thinks it is up wards of 100 gallons."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "C. Smith, of the <mark>police</mark> <mark>department</mark>, is arranging to dispose"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "C. Smith, of the <mark>police</mark> <mark>department</mark>, is arranging to dispose"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [489.37, 835.96, 655.4, 993.76], "bbox_id": "2ff1acab58", "file": "AppomattoxNewspapers_1912-1915a_0326.pdf", "page": 1, "text": "Luther Stratton, a Lynchburg negro, was arrested charged with dynamiting the vault of the Lynchburg Foundry Company several weeks ago. The negro was arrested a few days ago, charged with breaking into the store of D. Moses Company, but he managed to escape from jail. Later, while he was a fugitive, the police department ascertained that there were grounds for a warrant to charge him with the safe-blowing, and he Is now held under the dual charge, that of house-breaking and larceny and the robbery of the pipe companys safe. Stratton, It is alleged, used two sticks of dynamite to blow the safe."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "was a fugitive, the <mark>police</mark> <mark>department</mark> ascertained that there were"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "was a fugitive, the <mark>police</mark> <mark>department</mark> ascertained that there were"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1503.34, 654.56, 1649.14, 1359.02], "bbox_id": "4d9b535ef0", "file": "AppomattoxNewspapers_1971-1973a_0070.pdf", "page": 1, "text": "Lt. L. E. Thomas, well known and well liked lieutenant with the Virginia Department of State Police, has  retired  from his desk and fam iliar sedan with the long antennae based at Dis trict State Police headquarters, but he faces a host of other al ternatives to keep his days and nights filled with activity. Lt. Thomas this year marked his 35th year of service to the Commonwealth as a law en forcement officer. He was first employed in 1936 a s a trooper with the Division of Motor Ve hicles. He took basic training at Va. Beach, Camp Pendleton, plus a, training course at Spotsylvania Court House and was then a s signed to P atrick C o u n t y Stuart, Va.. He was soon promoted to Cor poral and worked in Bristol as a part of the plainclothes and in vestigative unit. Another pro motion followed and the young Sergeant sent to Norton, serving there and at Wythe ville. He was promoted to the office of Lieu tenant as a communications of ficer and was transferred to Staunton. In 1957, Lt. Thomas, M rs. Thomas and daughter, B arbara came to Appomattox where the Lt. has served as field lieuten ant for the past fourteen years. A retirem ent dinner was held for Lt. Thomas and family on Sept. 29 at Holiday Inn, North, Lynchburg. Attending were State Police Department offic ials and friends of the honored family, a set of golf clubs was presented to Lt. Thomas. He calls him self a  duffer but a hole-in-one a few years ago at the  old golf courseandhis very active work toward the e s tablishment of Falling River Country Club would indicate otherwise. For all the Thomases the years have brought m an y hon ors. Mrs. Thomas is a teacher for both high school and adults in the home economics depart ment at Appomattox County High School. Miss B arbara Thomas, winner of the  M iss Appomat tox title and later  Queen of Tobaccoland , holds both a bac calaureate degree and m asters d e g r e e in education a n d is teaching in M artinsville, Va."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Lynchburg. Attending were State <mark>Police</mark> <mark>Department</mark> offic ials and friends"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Lynchburg. Attending were State <mark>Police</mark> <mark>Department</mark> offic ials and friends"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [302.38, 192.14, 484.32, 440.23], "bbox_id": "c46d4eab93", "file": "TimesVirginian_1981a_0006.pdf", "page": 1, "text": "let in. The Doberman, according to Thompson .adapts well to living .inside. A standard is set by the American Kennel Club, explained Thompson, each dog has a standard the AKC tells you exactly how each breed of dog should look, Rusty is a tremendous confirmation dog. Dobermans, which will work faithfully for love and praise, are not born with ears that set at a perky angle. In addition to having the tail cut off when only three days old, the Doberman must have surgery on its earsto give it the appearance we have come to think of as characteristic of th e. Doberman. Len Allen Smith, a member of the Appomattox Town Police Department, assisted Thompson in demonstrating Sampsons ability to attack on command.   Donning a protective attack sleeve."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "of the Appomattox Town <mark>Police</mark> <mark>Department</mark>, assisted Thompson in demonstrating"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "of the Appomattox Town <mark>Police</mark> <mark>Department</mark>, assisted Thompson in demonstrating"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1869.85, 1504.6, 2030.92, 1635.3], "bbox_id": "3556e766c3", "file": "AppomattoxNewspapers_1905-1912a_0361.pdf", "page": 1, "text": "L . L . Gregory Arrested. The police department has been notified of the arrest in Denver of Louis L. Gregory, missing cashier of the Atlantic Coast Line Railway, who is said to be 26,000 short in his at counts. He was arrested in Den ver on a tip furnished by the local police and is willing to return. The American Surety Company, by which he was bonded in the sum of 30,000, had offered 1,000 for his capture. Gregory was one of the best-known young men about town."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "L . Gregory Arrested. The <mark>police</mark> <mark>department</mark> has been notified of"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "L . Gregory Arrested. The <mark>police</mark> <mark>department</mark> has been notified of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [155.05, 472.07, 309.58, 774.12], "bbox_id": "25ce29c311", "file": "AppomattoxNewspapers_1902-1905a_0336.pdf", "page": 1, "text": "JtQVS AX MOYNIHAN was a  V clever scoundrel. Every- O T   body admitted It, from the X C  oil Chorty  street neigh- bors, who remembered and not with pleasureIlls boyish de predations. to genial Frank Walker, who, after four years faithful service at police duty, had been promoted by the decease of old Ned Tyler to the captaincy of Station 4. Captain Walker was young, in fact, only thirty, and perhaps that was the reason be took it so hard. It w as tough, though, that two mornings after his appointment, be should wake to find that the biggest Durglary In ten years history of the Police Department had been commit ted tlm niht before. And the worst of it was, it had occurred in his own district, and In a section patrolled by ono of Uis best officers. For on the cashiers desk of the Forbes National Bank, on that bright October morn ing, when the office boy opened the great doors, lay a brand new kit of burglars tools and a bit of pasteboard. And the pasteboard was not soiled, either, as might have been expected. It was of the conventional size, and on It, in the duintlest of engraving, was the following Mr. Daniel Perry Moynihan."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "years history of the <mark>Police</mark> <mark>Department</mark> had been commit ted"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "years history of the <mark>Police</mark> <mark>Department</mark> had been commit ted"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [864.95, 1411.17, 1021.56, 1521.09], "bbox_id": "4ee0916b1d", "file": "AppomattoxNewspapers_1902-1905a_0377.pdf", "page": 1, "text": "Jewelry Thief Caught. Maripn, Ind. Special. William J. Deevy, a detective of the New York police department, arrested William McKinzy, alias William J. Valentine alias William Stewart, wh,o is wanted on a charge of having robbed New York people of 120,000 worth of jewelry. McKinzy acknowledge that he was the futitive wanted, and told what he had done with the jewelry. It had been sold, to said, in Albany, New York, Chicago, and St. Louis."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "of the New York <mark>police</mark> <mark>department</mark>, arrested William McKinzy, alias"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "of the New York <mark>police</mark> <mark>department</mark>, arrested William McKinzy, alias"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [705.09, 321.98, 857.0, 426.52], "bbox_id": "d2af852bd3", "file": "AppomattoxNewspapers_1971-1973a_0441.pdf", "page": 1, "text": "j Walton Payne. Born in Glad- I stone, he attended Appomat tox High School. He joined the police department here as a j patrolman on Nov. 9, 1954. He was appointed to the j rank of detective sergeant by  Chief R.O. Brooks in August of  1965. A veteran of the U. S. Army, Sgt. Payne was a j"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "School. He joined the <mark>police</mark> <mark>department</mark> here as a j"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "School. He joined the <mark>police</mark> <mark>department</mark> here as a j"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1692.95, 612.65, 1842.52, 890.49], "bbox_id": "f7776a332b", "file": "TimesVirginian_1978_0171.pdf", "page": 1, "text": "j Pledge Walk.  The nominating committee i consisting of Mrs. Charles  Hirtz, Mrs. Eddie Gunter and i Mrs. Lewis Floyd presented  the following slate of officers  for the next two years  President, Mrs. Wiley Warmer ! Vice-President, Mrs. Lewis j Floyd Recording feecetary,  Mrs. Kenneth McCullough Treasurer, Mrs. Otis Hender son Corresponding Secretary, Mrs. Melvin Giles Historian, Mrs. Charles Hirtz. These officers will assume their duties in August. There will be a Womans Self-Defense Class, open to the public, Thursday, April 13, at 730 in the Haber Building of the Rustburg Court House. Co-Sponsorers are the Rust burg Womans Club. Sgt. Toni Purvis of the Lynchburg Police Department will show a film"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "Purvis of the Lynchburg <mark>Police</mark> <mark>Department</mark> will show a film"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "Purvis of the Lynchburg <mark>Police</mark> <mark>Department</mark> will show a film"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.45, 507.58, 1868.63, 560.08], "bbox_id": "ce65dab730", "file": "AppomattoxNewspapers_1974-1975a_0090.pdf", "page": 1, "text": "j e e r Councils purpose is to get a general idea of Whats Happening Out In Life once you h school.   representing the Virginia State Police Department were T. W. Timberlake and S. A. hoopers presented a film pertaining to the duties of the State Police. The film told the hatatroopers life is all about, the duties, training, dedication and responsibilities of a"}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "representing the Virginia State <mark>Police</mark> <mark>Department</mark> were T. W. Timberlake"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "representing the Virginia State <mark>Police</mark> <mark>Department</mark> were T. W. Timberlake"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.77, 631.98, 1892.87, 764.13], "bbox_id": "c15b09f139", "file": "TimesVirginian_1980a_0293.pdf", "page": 1, "text": "in Lynchburg, she is employed by the Lynchburg Police Department,  Terry, a graduate of Appomattox County High School js beginning his third year at Central Virginia Community College in Ly nchhurg- He is employed by Armstrong Furniture in Appomattox. A January wedding is planned."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "employed by the Lynchburg <mark>Police</mark> <mark>Department</mark>,  Terry, a graduate of"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "employed by the Lynchburg <mark>Police</mark> <mark>Department</mark>,  Terry, a graduate of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1799.26, 1368.18, 1977.65, 1798.23], "bbox_id": "69ac9ec774", "file": "AppomattoxNewspapers_1926-1933a_0439.pdf", "page": 1, "text": "i uHW doea Werner prove this obvious.impossibility-the impos- hbihty that any city anywhere could be continuously and mono- tonously robbed for 139 years without going to perdition, with- .out being impoverished, and without even protesting? As 1 said before, by suppression here exaggeration there, and misrep! resentation elsewhere all done with an eye on its effectiveness  for the campaign purpose of the Republican National Committee I He presents extracts from the report of the Lexow Committee showing the crimes that were perpetrated u n d e r C r o k e r through the police force but he I I nowhere informs you that the police department was ruled by a four-headed bi-partisan commis- j  sion, and that many of the crimes had been committed years before b y anti-Tammany administra tions. The official extracts look impressive and the reader may not notice, in his haste, that along with them Werner prints other quotations as if they were of equal authority, but which in fact are mere gossip and mostly mendacious on their face. The reader, seeing that the Lexow extracts are authentic, is not Hkely to notice that the others put forward with the same grav-"}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "informs you that the <mark>police</mark> <mark>department</mark> was ruled by a"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "informs you that the <mark>police</mark> <mark>department</mark> was ruled by a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [176.4, 779.95, 335.42, 1153.54], "bbox_id": "f29abc8861", "file": "AppomattoxNewspapers_1905-1912a_0341.pdf", "page": 1, "text": "I N open court, where justice sits silk gowned, the very embodiment of law and order, and In the cer tain atmosphere of an authority against which no man may raise a hand here. In this very city of New York, witnesses under oath to speak the truth only, have halted with un spoken word on lip and become as mutes at the sight of the sign of death. The sign of death? A fiction? No. A meaningless motion made to dis concert the overtlmid? Again no. A death signa reality? As cer tain as there are courts of law a sign behind mhich lurks the murderous blade In the hand of a killer of men a sign of as malign significance as that of the skull and crossbones on the black flag at the peak of the pirate ship of old. This sign was made in New York, In Justice Faucetts court, and a wit ness quailed and became speechless. It was made again in Justice OSul livans court, and a witness cowered and shook like one with the palsy. What Is this sign of death? Wil liam F. Flynn, head of the detective bureau, second deputy commissioner of the police department, for years a secret service man, shrewd, re sourceful, successful, knows it well. He has seen it. They put one sign of death on the body of a victima sign of death accomplished, for to kill for vengeance without it would not strike terror. The sign about which Chief Flynn tells is the other the warning."}, "highlight": {"text": {"matched_tokens": ["police", "department"], "snippet": "deputy commissioner of the <mark>police</mark> <mark>department</mark>, for years a secret"}}, "highlights": [{"field": "text", "matched_tokens": ["police", "department"], "snippet": "deputy commissioner of the <mark>police</mark> <mark>department</mark>, for years a secret"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2422.3, 763.06, 2574.06, 1107.65], "bbox_id": "428260c590", "file": "TimesVirginian_1976_0406.pdf", "page": 1, "text": "i and it was noted that Mrs. I Betty Crabtree was appointed ! Acting Administrative Town  Manager to fill the position left j vacant due to the resignation of I Mr. William S. Slagle who has ! accepted a position with I Virginia Fibre Corporation. At the special meeting, five members of council were in  attendance with Robert Hub- I bard, T. E. Conner, and Burke J Guill voting yes on the above motion and Ronald Spiggle and ! M..J. House, Jr. voting no on ! the motion. It was further noted that  Harold Nash is serving a Superintendent of Public Works and is manager of all  outside activities. J. T. Guill, owner of a snack j bar on Main Street appeared I before council to request ! permission to sell beer at his , business on Sundays. No action I was taken on this request. In other action, council i approved the purchase of a  portable police radio for the l Town Police Department at an I approximate cost of 900.00."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "for the l Town <mark>Police</mark> <mark>Department</mark> at an I approximate"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "for the l Town <mark>Police</mark> <mark>Department</mark> at an I approximate"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [867.31, 757.09, 1033.76, 973.53], "bbox_id": "a92f66fdb4", "file": "TimesVirginian_1983a_0217.pdf", "page": 1, "text": "Hubert N ub Hubert Nash, 66, to 2115 Indian Hill Road, died Thursday, June 16, in Virginia Baptist Hospital. He was the husband of Lula Bryant Nash. He was born in Campbell County, son of the late Robert H. and Florence Taylor Nash. He was a retired commander of the Lynch burg Police Department, with 34 years of service, and served seven years as a member of Lynchburg City Council. He was a member of Fort Hill United Methodist Church, Fort Hill Lions Club, Marshall Lodge No. 39 AF  AM, Lynchburg Shrine Club, Karim Temple, and was past president of the State Beekeepers Association and the Piedmont Beekeepers Association."}, "highlight": {"text": {"matched_tokens": ["Police", "Department"], "snippet": "of the Lynch burg <mark>Police</mark> <mark>Department</mark>, with 34 years of"}}, "highlights": [{"field": "text", "matched_tokens": ["Police", "Department"], "snippet": "of the Lynch burg <mark>Police</mark> <mark>Department</mark>, with 34 years of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
