{"document": {"bbox": [737.73, 250.45, 904.35, 469.44], "bbox_id": "f4e4c117f6", "file": "AppomattoxNewspapers_1898-1902a_0252.pdf", "page": 1, "text": "Your correspondent is not a ipember_ of any church, but heard him preach uineeen sermons, and not a word. could I condemn. Rev. E . C. T ra - viJlii.li filled Mr. Banks pulpit Sun day very acceptably. Bishop Randolph will preach a t , Glenmore Episcopal church Friday, t be 20th. Where are the candidates for the j Senate and Legislature? they have j forgotten Glenmore. Numbers of j car voters do not know we are to ! have an election next, month, and are j politicians,  how is that ? Well. 1 will close for the present. Wishing the T im es and its readers success. G len m o r e ."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "day very acceptably. Bishop <mark>Randolph</mark> will preach a t"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "day very acceptably. Bishop <mark>Randolph</mark> will preach a t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2132.14, 1540.31, 2426.4, 1716.56], "bbox_id": "5787005f02", "file": "AppomattoxNewspapers_1962-1965a_0332.pdf", "page": 1, "text": "You could make it faster by gyrocopter. But even by truck, its just overnight between Manhattan skyscrapers and Southside Virginia fields. Incidentally, the modern mechanized hay har vesting you see here cuts man-hours by about half. Its one of many reasons this area has growing reserves of manpower to staff new industries. Ask VEPCO for figures on the proven trainability and high per-dollar productivity of these workers. Ask, too, for plant site data and economic studies on this land of pleasant living and Southern production savings thats right on top of your richest markets. Write, wire or phone. J. Randolph Perrow, Manager, Area Development, Electric Building, Richmond, Virginia 23209 Telephone Milton 9-1411 Area Code 703 VIRGINIA ELECTRIC AND POWER COMPANY"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "wire or phone. J. <mark>Randolph</mark> Perrow, Manager, Area Development,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "wire or phone. J. <mark>Randolph</mark> Perrow, Manager, Area Development,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.08, 911.84, 1764.64, 1103.24], "bbox_id": "d586b7d677", "file": "AppomattoxNewspapers_1915-1918a_0171.pdf", "page": 1, "text": "You can start with us with a deposit of one dollar  396 Interest United Loan  Trust Co. Corner Main and Ninth Streets L Y N C H B U R G , V A . OPEN SATURDAY EVENINGS FROM 6 TO S Tie Mi W ta Yon Feel at Hone JAMES W. GEROW, H. T. NICHOLAS,  President Manager I RANDOLPH HARRISON, J. L. NICHOLAS, Vice-President Cashier"}, "highlight": {"text": {"matched_tokens": ["RANDOLPH"], "snippet": "NICHOLAS,  President Manager I <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}}, "highlights": [{"field": "text", "matched_tokens": ["RANDOLPH"], "snippet": "NICHOLAS,  President Manager I <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1441.45, 907.51, 1695.84, 1102.39], "bbox_id": "2a87b51ad1", "file": "AppomattoxNewspapers_1915-1918a_0283.pdf", "page": 1, "text": "You can start with us with a deposit of one dollar  3  Interest United Loan  Trust Co. Com r Main and Ninth Streets LYNCHBURG, VA. O PrN SATURDAY EVENINGS FROM 6 TO 8 Tlis Wi w in Ton Fill n Him JAMES W. G ROW, H. T. NICHOLAS, .resident Manager RANDOLPH HARRISON, J. L. NICHOLAS, Vice President Cashier"}, "highlight": {"text": {"matched_tokens": ["RANDOLPH"], "snippet": "T. NICHOLAS, .resident Manager <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}}, "highlights": [{"field": "text", "matched_tokens": ["RANDOLPH"], "snippet": "T. NICHOLAS, .resident Manager <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.68, 901.39, 1760.48, 1096.3], "bbox_id": "3fcdfa1383", "file": "AppomattoxNewspapers_1915-1918a_0252.pdf", "page": 1, "text": "You can start with us with a deposit erf one dollar  3 Interest United Loan  Trust Co. Corner Main and Ninth Streets LYNCHBURG, V A. OPEN SATURDAY EVENINGS FRQM b TO 8 Tim B 8 M WiieFB T sd Fnl at Hone JAMES W. GEROW, H. T. NICHOLAS, President Manager RANDOLPH HARRISON, J. L. NICHOLAS, Vice-President , Cashier"}, "highlight": {"text": {"matched_tokens": ["RANDOLPH"], "snippet": "T. NICHOLAS, President Manager <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}}, "highlights": [{"field": "text", "matched_tokens": ["RANDOLPH"], "snippet": "T. NICHOLAS, President Manager <mark>RANDOLPH</mark> HARRISON, J. L. NICHOLAS,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [485.5, 791.5, 656.88, 1157.76], "bbox_id": "5a4535bc9d", "file": "TimesVirginian_1983a_0153.pdf", "page": 1, "text": "You are invited to Sunday School classes at Galilee this coming Sunday at 10 a.m. Regular preaching and worship services begin at 11 a.m. Pastor Davis will deliver the morning worship message and the Youth Services. Singers will render the musical selections.  f à X j Ct On that afternoon at 3 p.m., the Mens Club of Galilee will celebrate its thirty-second anniversary. We have prepared a special program for you and a very special surprise awaits those who attend. Come out and let us Praise the Ijord together. Rev. Tim lowing and the Youth Services Singers were special guests of Rev. Boyd Christian and. cOrìfcregalión m thè Mt. ? Obliti Baptists Churih. ReVivàl torVlifek1 are in progress at Mt. Obed this week. Please attend. Mrs. Jacqueline Poteat and family of Baltimore. Md. were in Appomattox for the weekend. Miss Margaret Annette Lampkin of the Chestnut Grovè Community will he married to Mr. Randolph icwis on May 14, The wedding will lake place at the home of Mr. and LACS plans"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "he married to Mr. <mark>Randolph</mark> icwis on May 14,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "he married to Mr. <mark>Randolph</mark> icwis on May 14,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.59, 351.95, 1879.99, 529.95], "bbox_id": "879e76119a", "file": "TimesVirginian_1983a_0317.pdf", "page": 1, "text": "yards rushing against Gretna, and picked up 53 yards passing for 205 yards total offense. Appomattox picked up 10 first downs in the game, and was penalized five times. . Gary Ferguson was the leading rusher for Appomattox, with 17 carries for. 156 yards. Steve Hamlett had 16 carries for 54 yards, and Tyrone Abbitt had two receptions for 19 yards against Gretna. Cuccio also commended the play of Ricky Tinner, who intercepted two passes and had three tackles and three assists on defense. This Friday night, the Raiders will square off against Randolph"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "will square off against <mark>Randolph</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "will square off against <mark>Randolph</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.04, 1040.13, 2241.89, 1735.77], "bbox_id": "5649e92c72", "file": "AppomattoxNewspapers_1902-1905a_0332.pdf", "page": 1, "text": "yard long. I had done bought my I his vacation at his grandfathers, hat, but 1 wanted a black silk with I Mrs. W. E. Warren is no better, slippers to match. But, mam, he I n er Bi8ters, Misses Bailie and Carrie said, This is a gentlemans clothing I Yeaman, of Prince Edward, are with store! Well, and I should hope It I her this week, was said I, for I did not come up heie I Miss Elvyn Coleman, who hat- to deal wit.v poor white folks. 11 been sick for the past-week,is bet wauts to deal with gentlemen OQl,er. . , , , them that witl see justice done me. I Miss Effie Giles and Miss Hall and if . he were gwine to show me I from Pittsylvania are expteted a them things to do so theu. He aid j Mr. John Coles to-day. hey only kept shirts and pants. I We are sorry to hear of theseri- Well, and why didnt you say so and  oag Uheis of Mrs. Nannie Ragland, not keep me here waisting my time.  0f Evergreen. asked, didnt you know young man I Mr. Randolph Coleman and his that there are a whole train of cars I eomia visited friends at Fvergreen and a steam injin hi ched to the ml Friday. waiting for me out in the shade, and 11 Mr. Pane Warren is at home for a gave hinuto know I were not buying a I few foyg. mans bridal outfit, but my own, and Mr. Chapman Simms, of Roanoke, that Mr. Arthur Jennings were t 8 visiting his home people, have a auction on Saturday and 11 Much sympathy is expressed for ish I bad waited aud bought fom Mr. Thornton Moses in his bereave him. Then I jest waiked right out I rnent. when what should I see but a man I Mr. Sam J. Lee is sick with fever going down the street with Lucindas  We hope for him a speed recovery. Rev. Hugh C. Smith preached a good sermon at Forest on Sunday p. m. Rev. Pat. Warreq assisted him in the administration of the Lords Supper. The many friends of Mrs. Wii ilam Cheadte will be sorry to hear that she is ill. Mr. Robert Holycroix, of Hurls- ville, was v siting in this neighbor hood last Sunday. There must be oine extra attraction in this part of the Southside. Miss Alma lwis visited friends ind relatives in Koanoke recently. Evelyn and Colin, the bright lit- 1 le children of Mr. 1.0. Abbitt, have been quite sick this week. Mr. and Mrs. W. L. Coleman, of i he Hill City,are spending their vaca-  ion at bis fathers. Mrs. J. Eleanor Coleman and little on Arthur, Mrs. C. L. McDearmon -nd children and Miss Alma Me Dearmon, of Evergreen, were visi- ors at Mountain View recently. It has been your correspondents -ood pleasure to rusticate for a few days last week beneath the shade of the Ivy Cliffs down on the banks  f old Cub and, Mr. Editor, if you want to havf- tmnA"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "young man I Mr. <mark>Randolph</mark> Coleman and his that"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "young man I Mr. <mark>Randolph</mark> Coleman and his that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.97, 1681.68, 1681.12, 1708.73], "bbox_id": "aeb577b6f0", "file": "AppomattoxNewspapers_1918-1922a_0372.pdf", "page": 1, "text": "X i Y i r C S B t r R C , 7 A , RANDOLPH HARRISON, President H T ND HOLAi, V-Pres J L NICHOLASCashier"}, "highlight": {"text": {"matched_tokens": ["RANDOLPH"], "snippet": "X i Y i r C S B t r R C , 7 A , <mark>RANDOLPH</mark> HARRISON, President H T ND HOLAi, V-Pres J L NICHOLASCashier"}}, "highlights": [{"field": "text", "matched_tokens": ["RANDOLPH"], "snippet": "X i Y i r C S B t r R C , 7 A , <mark>RANDOLPH</mark> HARRISON, President H T ND HOLAi, V-Pres J L NICHOLASCashier"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [201.61, 757.01, 374.01, 1174.06], "bbox_id": "a5c4a0ce62", "file": "AppomattoxNewspapers_1905-1912a_0050.pdf", "page": 1, "text": "Wu Ting Fang, the retiring Chi nese minister sailed for Byope, say ing he will return in 19 Twenty-sevesrfines oL whose were used In Sjtung a fire at 214-218 Sullivajstreet, New York. 1 Charels W. Morse has been denied a new trial.  Louis A. Culllver, attorney for Francis Dolan, who Is charged with having aided in the alleged Tammany many theft of the Independence League machinery In the September primaries, said that he would apply for a warrant for the arrest of Wil liam Randolph Hearst. Col. James Gordon, on whose head was once placed a reward of 10,- 000 on allegations that he was in the plot to assassinate Lincoln, will succeed McLaurin in the United States Senate, Governor Colton, of Porto Rico gave a brilliant reception in honor of United States Secretary of War Dickinson and Brigadier General Ed wards. Bernard H. Ball, second vice president of the Philadelphia and Reading Railroad, was taken vio lently insane while at his office, in Philadelphia. C. H. Smith, a convalescent patient at Bellevue Hospital, and Mrs. L. R. Rotzell were married In a taxicab in the court yard of the hospital. Major General John A. Wiley, prominent in the National Guard of Pennsylvania, died at Franklin, Pa. Madison Square Garden, it Is re ported, has been sold and will be replaced by an office building. The New England Marine Com pany shows liabilities of nearly i,- 400,000, and assets of 8,350. Imports at the port of New York increased over 41,000,000 during the year. The price of hogs in the West has reached 8.75 per hundred pounds."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "arrest of Wil liam <mark>Randolph</mark> Hearst. Col. James Gordon,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "arrest of Wil liam <mark>Randolph</mark> Hearst. Col. James Gordon,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1226.56, 1728.97, 1378.57, 1858.97], "bbox_id": "6969cde977", "file": "AppomattoxNewspapers_1918-1922a_0386.pdf", "page": 1, "text": "Would Build Memorial. Patriotic societies in Virginia have inaugurated a movement to build suitable monument to the memory of George Wythe, great lawyer and first professor of law In the United States, whose grave in old St. Johns church yard is unmarked and almost forgotc ten. Among his pupils may be men tioned Jefferson, Monroe, Marshall, Edmund Randolph and Bishop Madi son. The monument would mark his grave."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe, Marshall, Edmund <mark>Randolph</mark> and Bishop Madi son."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe, Marshall, Edmund <mark>Randolph</mark> and Bishop Madi son."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1169.5, 1765.67, 1324.09, 1896.78], "bbox_id": "23ed25a081", "file": "AppomattoxNewspapers_1918-1922a_0583.pdf", "page": 1, "text": "Would Build Memorial. Patriotic societies in Virginia have inaugurated a movement to build a suitable monument to the memory ot George Wythe, great lawyer and first professor of law in the United States, whose grave In old St. Johns church yard is unmarked and almost forgot ten. Among his pupils may be men tioned Jefferson, Monroe, Marshall, Edmund Randolph and Bishop Madi son. The monument would mark his grave."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe, Marshall, Edmund <mark>Randolph</mark> and Bishop Madi son."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe, Marshall, Edmund <mark>Randolph</mark> and Bishop Madi son."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1043.02, 1722.52, 1349.11, 1852.25], "bbox_id": "c6e33fee83", "file": "AppomattoxNewspapers_1918-1922a_0387.pdf", "page": 1, "text": "Would Build Memorial Patriotic societies in Virginia have Inaugurated a movement to build a suitable monument to the memory ol George Wythe, great lawyer and first professor of law in the United States, whose grave in old St. Johns church yard is nnmarked and almost forgot ten. Among his pupils may be men tioned Jefferson, Monroe. Marshall, Edmund Randolph and Bishop Madi the intention of enlarging his market gon. The monument would mark his oaanectlons in those section.  grave."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe. Marshall, Edmund <mark>Randolph</mark> and Bishop Madi the"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Jefferson, Monroe. Marshall, Edmund <mark>Randolph</mark> and Bishop Madi the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [700.72, 944.74, 860.97, 1046.14], "bbox_id": "ac5a2b7322", "file": "AppomattoxNewspapers_1926-1933a_0320.pdf", "page": 1, "text": "Worth Trying For. New York.If Robert Randolph Ashner la of good moral habits at forty years of age, is married and has children, he will be entitled to most of a 3,000,000 estate. His fa thers will so provides. He Is now twenty-eight years old. If at forty he Is not up to the standard set by the will he will get only 12,000 a year."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "For. New York.If Robert <mark>Randolph</mark> Ashner la of good"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "For. New York.If Robert <mark>Randolph</mark> Ashner la of good"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [696.24, 939.08, 856.06, 1040.98], "bbox_id": "4e63d96cd1", "file": "AppomattoxNewspapers_1908-1909a_0320.pdf", "page": 1, "text": "Worth Trying For. New Fork.If Robert Randolph Ashner la ot good moral habits at forty years of age, is married and haa children, be will be entitled to moat of a 83,000,000 estate. Hla fa thers will so provides. He Is now  I f at forty he la not op to tbe standard set by the will he will get only 812600 a year."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "For. New Fork.If Robert <mark>Randolph</mark> Ashner la ot good"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "For. New Fork.If Robert <mark>Randolph</mark> Ashner la ot good"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [980.65, 639.29, 1314.22, 724.89], "bbox_id": "d966dd73f1", "file": "AppomattoxNewspapers_1949-1952a_0367.pdf", "page": 1, "text": "Worship, preaching by pastor, at Rev. R. I- Randolph  11Q0 A M germon topic, Jonah, Rev. R. L. Randolph will be the Man Who Ran from God. guest preacher at a revival to be _____ _ ____ held at Calvary Baptist Church, at   Concord, from Sunday June 10, through Friday Juno 15, beginning each night at 745 P. M."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "at Rev. R. I- <mark>Randolph</mark>  11Q0 A M germon"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "at Rev. R. I- <mark>Randolph</mark>  11Q0 A M germon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1973.05, 746.08, 2140.16, 831.43], "bbox_id": "c3597bf268", "file": "AppomattoxNewspapers_1949-1952a_0478.pdf", "page": 1, "text": "Worship, preaching by Pastor, 11 A. M. Sermon The Bible the Word of God  Why and How? Wednesday, 730 P. M., Joy Gift Service, with playlet by Mrs. Schweizers Sunday School Class, followed by Social Hour, with Mr. Elliott and Mrs. Randolph hostesses."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mr. Elliott and Mrs. <mark>Randolph</mark> hostesses."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mr. Elliott and Mrs. <mark>Randolph</mark> hostesses."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [172.1, 1387.84, 509.71, 1784.61], "bbox_id": "9fffda77e3", "file": "AppomattoxNewspapers_1922-1923a_0493.pdf", "page": 1, "text": "Women as Well as Men Are Made Miserable by a Kidney aid Bladder Trouble. Kidney trouble preys upon the miud, discourages and lessens ambition beauty, vigor and cheerful ness soon disappear when the kidneys are out of order or dis eased. Kidney trouble has become so prevalent that it is not uncom mon for a child tobe born afflicted with weak kidneys. If the child urinates toooften, if the urine scalds the flesh, or if, when the child reaches an age when it should be able to control the passage, it is yet afflicted with bed-wet ting, depend upon it, the cause of the diffi culty is kidney trouble, aud the first step should be towards the treatment of these important organs. This unpleasant trouble is due to a diseased condition of the kidneys aud bladder and not to á habit as most people suppose. Women as well as men are made miser able with Jridpey and bladder trouble, and both need the same great remedy. The mild and the immediate effect of ............. . . Swamp-Root is soon realized. It is sold Jumped into local politics and asks l by druggists, in fifty- jAa be made Supervisor foi this I ??nt,  eollar  I size bottles. You may diitfict. I have a sample bottle í f Tfré.ald .Randolph hotel will be mail free, also a Bom. oi Smp-Eoot. art.- . - - . t . 1 pamphlet telling all about Swamp-Root,  called Prince Edwardsas I am in-1 including many of the thousands of tssti formed. It has bee iibhavated at I menial letters received from sufferer  1  - r__  j   -it 1  cured. In writing Dr, Kilmer  Co., the cost of many- doRars,   WlIjpftLwnghamton, N, Y ,, be sure and mention elaborately furnished ató . b Dont make any mistake, i ! --i . _____ j iitf.Tifffft rewgmber the name, Bwsmp-Root, aged by an experienced hotel Kilfers fewainp-Root, and the ad  A- Price, who 1 is-  a g r íw e is , V ,, on every"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "bottle í f Tfré.ald .<mark>Randolph</mark> hotel will be mail"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "bottle í f Tfré.ald .<mark>Randolph</mark> hotel will be mail"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2187.56, 527.72, 2327.25, 724.67], "bbox_id": "c03f0c25b0", "file": "AppomattoxNewspapers_1962-1965a_0102.pdf", "page": 1, "text": "With the exception of Ivey Hol land, chairman of the Finance Committee, there are strong in dications that five out of the six Town Councilmen of Appomat tox will seek re - election. Holland last week stated em phatically that he will not seek election again. The others Mrs. Calvin Robinson, Burke Guill, Randolph Gilbert, Henry Pack, and Lewis McDearmon, are eith er uncommitteed at this time, or have stated that they are con sidering running again. Mayor Lawson Dr. S. R. Lawson, town mayor, says that a number of people have asked him to run again, and that he is seriously con sidering it."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Calvin Robinson, Burke Guill, <mark>Randolph</mark> Gilbert, Henry Pack, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Calvin Robinson, Burke Guill, <mark>Randolph</mark> Gilbert, Henry Pack, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1074.69, 632.69, 1237.79, 890.89], "bbox_id": "9d56561ccb", "file": "AppomattoxNewspapers_1933-1936a_0397.pdf", "page": 1, "text": "with J . B . Farrar, club agent. They attended the state corn and grain show where they saw many very fine exhibits of corn, small grains arid truck products. After the banquet they drove to Washington, and the next day spent many hours in the .Smithsonian! Institute and sight seeing around the capitol. They returned home January 31. Last year Coleman Moore, of Oakville, won the state prize in the contest and receive a beaut iful watch from the Barrett Co. He and his father, Clarence Moore were given a trip to Hopewell by the Barrett Company, where they attended the grain show and the 1934 banquet of the Virginia Crop Improvement Association. The other contestants who completed the contest this year, were Coleman .Moore, .Chandler Moore and Russell Moore, of Oak ville Beverly Martin, G.C. Martin an.d Lonnie Reynolds, of .Liberty Chapel and Randolph and Powell Caldwell, of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "of .Liberty Chapel and <mark>Randolph</mark> and Powell Caldwell, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "of .Liberty Chapel and <mark>Randolph</mark> and Powell Caldwell, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [633.85, 353.01, 795.84, 868.2], "bbox_id": "c86e194cfb", "file": "AppomattoxNewspapers_1898-1902a_0106.pdf", "page": 1, "text": "winter quarters and like the bear would not be seen nor heard of un til spring again. Winter is here but we are atill on i he move. I have just, returned from a pleasant visit to the Hill City. Ii I tsi its proper name. W had a deli-infill time at  lie Women Missionary Association. All the business was carried ou iu perfect order. Mrs. Dill, of Rich mond, was president Miss Daisy Hutson, secretary. Dr. McConnell, of Richmond, gave a welcome ad dress. Dr. Taylor gave us a talk also. All the delegates were given a free ride out to the Randolph Macon Womans College. We en joyed it reaming through the large building. The next meeting will be in Salem, Va. Mr. Melvin aud Alvin Woolridge have returned from a yisit to their uncle, Mr. Garland Woolridge, at Uoncord. Mr. S. A. Garrett and family have, moved to Newport News. They will he sadly missed, hut our good wishes ami prayers attend them wherever they go. Mr. Louis QBrien left for New port News a few days ago. Mr. Maurice OBneu, who has hern visiting his father, Mr. J. H. UBrieii, will leave tojom his re-i- meut in Washington, D. 0., in a few days. The Sahbath School at Chestnut Grove has closed until next spring. May you aud all the readers of vour valuable paper have a merry Christmas and a happy New Year is the wish of your little friend,"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "ride out to the <mark>Randolph</mark> Macon Womans College. We"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "ride out to the <mark>Randolph</mark> Macon Womans College. We"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [294.53, 841.58, 495.16, 1009.5], "bbox_id": "c953182b0d", "file": "TimesVirginian_1981a_0113.pdf", "page": 1, "text": "Winferd Guthrie B K S f m M A former resident of Char- M I k I lotte County, Winferd Guthrie,  tie , J r. graduated from  Randolph Henry High School R mid was immediately employed with Armstrong Furniture. He  has served with the company I for five years.  e ,. He is the son of R. W. wm Guthrie Sr., of Gladys and wrote H. Guthrie A. T giib burg. . ..HHMHs  Winferd is now residing in - E lG fg i the county of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "J r. graduated from  <mark>Randolph</mark> Henry High School R"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "J r. graduated from  <mark>Randolph</mark> Henry High School R"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [132.7, 767.25, 290.64, 944.95], "bbox_id": "0768abce3e", "file": "AppomattoxNewspapers_1912-1915a_0033.pdf", "page": 1, "text": "Winchester.Mrs. Isabelle Burwell Mayo, 72 years old, wife of Peter H. Mayo, the millionaire tobacco mer chant of Richmond, was stricken with paralysis and died at Powhatan, their Clarke county estate near Millwood. Her remains were interred in the graveyard at Old Chapel, near Mill- wood, Sunday afternoon. She was a daughter of the late George H. Bur- well and was born in the mansion on the noted Carter Hall estate. In addi tion to her husband, she leaves fwo daughters, Mrs. Thomas N. Carter, of Richmond, Va., and Mrs. Bennehan Cameron, of Raleigh, N. C. two sis ters, Mrs. T. H. V. Randolph and Mrs. R. Powell Page, and one brother, George H. Burwell, all of Clarke county."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mrs. T. H. V. <mark>Randolph</mark> and Mrs. R. Powell"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mrs. T. H. V. <mark>Randolph</mark> and Mrs. R. Powell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [705.84, 241.55, 969.89, 515.54], "bbox_id": "07e3afaba9", "file": "TimesVirginian_1980a_0327.pdf", "page": 1, "text": "Wilsons Landing in Appom- The Appomattox Senior attox on Oct. 2. Approxima- FHA prepared and served tely 260 FFA members and lunch. Each person present guests attended the event. went on a guided tour of the Richard Jones, Appomat- facilities at Wilsons Land- tox Senior FFA president, ng. A swine judging welcomed all members and contest was then held in the guests. Dr. Mclnnis from sale barn. Thè first, second-, VPI showed a series of slides and third-place teams were, on herd health procedure respectively Randolph Hen- and demonstrated the meth- ry, Staunton River, and ods of vaccinating swine. Greene Co. Top scoring Jonathan Pickett showed a individuals were David filmstrip on castration of Mitchell of Randolph Henry, hogs and then demonstrated Ronald Sanderson of Jeffer- on pigs supplied by Wilsons son Fdrest, 1 and Marshall Landing. Plymall of Staunton River. Bill Jones, with Central Central Fidelity Bank Fidelity Bank presented a supplied all prizes for the talk on record systemsand judging contest and rain management for a commerc- gauges for all present. The ial swine operation, as well FFA thanked all those Who as the future outlook of assisted with this event, and agriculture economics. expressed special thanks to Barney Allen and Frank John Wilson, who allowed Sweet, both VPI Extension use of his facilities for the Agents, then - discussed past four years.."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "herd health procedure respectively <mark>Randolph</mark> Hen- and demonstrated the"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "herd health procedure respectively <mark>Randolph</mark> Hen- and demonstrated the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.48, 1143.54, 1929.55, 1380.82], "bbox_id": "f6537ded3c", "file": "AppomattoxNewspapers_1952-1954a_0528.pdf", "page": 1, "text": "Williamsburg, Va.,- Faced by the greatest turn-out of talent in the his tory of the seven-year-old produc tion, officials of The Common Glory announced today that the last of three preliminary auditions for the eighth season will be held at Lex ington on Saturday, March 20. The Lexington tryouts, which will cover all phases of the drama except dancing, will be conducted in the Troubadour Theatre of Washington and Lee University from 1 to 3 P. M. Dance auditions were completed last Saturday at Randolph - Macon Womans College, Lynchburg. Director Howard Scammon of the Paul Green drama reported today that he and other members of the productions staff were overwhelmed by applications at auditions for drama, choral and orchestral jobs at the University of Virginia last Sat urday."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "completed last Saturday at <mark>Randolph</mark> - Macon Womans College, Lynchburg."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "completed last Saturday at <mark>Randolph</mark> - Macon Womans College, Lynchburg."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1143.36, 575.45, 1300.08, 602.25], "bbox_id": "3a169ded53", "file": "AppomattoxNewspapers_1933-1936a_0335.pdf", "page": 1, "text": "William Randolph Hearst moves residence from California t0 New York on account of heavy taxes."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "William <mark>Randolph</mark> Hearst moves residence from California t0 New York on account of heavy taxes."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "William <mark>Randolph</mark> Hearst moves residence from California t0 New York on account of heavy taxes."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.92, 645.4, 1864.15, 849.04], "bbox_id": "4b8669acaa", "file": "TimesVirginian_1978_0557.pdf", "page": 1, "text": "William Randolph Hearst Foun dation, Tamara was selected first alternate among the top state finalists to appear in Richmond on November 14 for an interview. Although Tamara was not selected as a Virginia delegate, she dem onstrated special qualities worthy of recognition during the inter view on November 14. In the event a delegate becomes ineligible or does not accept the 1,500 Scholarship Award, Tamara w ill become the recipient of the scholarship. This high honor is indicative of Tamaras outstanding achieve- ments and leadership abilities."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "William <mark>Randolph</mark> Hearst Foun dation, Tamara"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "William <mark>Randolph</mark> Hearst Foun dation, Tamara"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1023.34, 1035.17, 1195.99, 1180.27], "bbox_id": "a3d4e6e357", "file": "AppomattoxNewspapers_1943-1947a_0077.pdf", "page": 1, "text": "William Moon, of Randolph- Macon College, Ashland, Va. will spend the we k-end with hm par ents, Mr. and Mrs. W. A. Moon. The B. T. U. of Spout Spring Baptist Church held a very beauti ful and inspiring candle light ser vice Sunday night. They installed -new officers for the next 6 months and were presented their certificate for the completion of a f study I course. Rev. Chas. E. Spain preach- I ed a sermon especially for the joung people."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "William Moon, of <mark>Randolph</mark>- Macon College, Ashland, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "William Moon, of <mark>Randolph</mark>- Macon College, Ashland, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [361.18, 589.27, 522.54, 834.41], "bbox_id": "cb819c2966", "file": "AppomattoxNewspapers_1922-1923a_0521.pdf", "page": 1, "text": "William F. Randolph, Jr., May Die Of Injuries. Berryville Special.William F. Randolph, Jr., formerly of Clarke, now with the Bank of Richmond, at Richmond, was thrown in a hurdle race at the Clarke County horse and colt show and seriously If not fatal ly hurt. In endeavoring to take the third hurdle, just in front of the grand stand, Randolphs mount. True Boy, blundered and fell, throwing young Randolph completely over him. Randolph struck full upon his temple and was rendered uncon scious. He Is In a hosjfital and his condition Is regarded as precarious. In the light-weight hunter class R. M. Peach, of Upperville, riding Aristocrat, was thrown at a hurdle, his mount falling also. He escaped with a few bruises. In the qualified hunters class Edward B. Jacobs, rid ing No Name, fell with hts mount at the first hurdle. His horse fell upon and rolled over him, but Jacobs escaped unhurt and rode the class out."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "William F. <mark>Randolph</mark>, Jr., May Die Of"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "William F. <mark>Randolph</mark>, Jr., May Die Of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1863.11, 973.42, 2351.37, 1338.17], "bbox_id": "5cb67c8cfd", "file": "AppomattoxNewspapers_1905-1912a_0340.pdf", "page": 1, "text": "will spend some time w ith her daughter Miss Sallie Hunter and bro ther, Mr. A. B Hunter, of Charlotte, were the guests of Misses Mazie and Myrtice Caw- thorne last Sunday. Mrs. W ayland Sweeney, of Lynchburg, is visiting her parents, Mr. and Mrs. W ash Childress, near here Mr. J. L. Davis is suffering with erysipelas on his neck. Mr. and Mrs. Randolph Cole man, of Charlottesville, passed through our town today en- route to Hurtsville. Mr. T. W. W right, of Dear born, V a., visited his home Mothers. He read the proc-1 people near here recently, amation that the Governor I Mr. Corbin Hanson, of Rich-j made calling on the people oflmond, spent Sunday w ith rela- V irginia to observe the 2ndtives here. Sunday in May as Mothers! Mr. and Mrs. B. W. Staples,! ay and he said that so far as I of Lynchburg, are visiting his I le knew this was the first time I pareUts here. Governor of Virginia had done this. Dr. Lacy preached I Elam. an able and touching sermon,l Elam is a booming l i t t l e ___ _ _ basing his remarks on th e town, two stores at present be-l    5 ? . wn f"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "neck. Mr. and Mrs. <mark>Randolph</mark> Cole man, of Charlottesville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "neck. Mr. and Mrs. <mark>Randolph</mark> Cole man, of Charlottesville,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [138.25, 1658.22, 302.5, 1738.77], "bbox_id": "c2888f59e6", "file": "AppomattoxNewspapers_1912-1915a_0352.pdf", "page": 1, "text": "Will Spend Honeymoon At the Sum mer White House. I Cornish, N. H.William G. McAdoo, Secretary of the Treasury, and his Bride, who was Miss Eleanor Randolph Wilson, daughter of the President, ar rived here to spend their honeymoon  t Harlakenden, the summer White"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "who was Miss Eleanor <mark>Randolph</mark> Wilson, daughter of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "who was Miss Eleanor <mark>Randolph</mark> Wilson, daughter of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1534.13, 325.66, 1694.13, 1002.75], "bbox_id": "fff46e3f03", "file": "AppomattoxNewspapers_1905-1912a_0434.pdf", "page": 1, "text": "Will Seek Tafts Aid W ith the re-election of Congress man J. Hampton Moore, of Philadel phia, as its president, and the selec tion of New London, Conn., as the meeting place for its convention next September, the Atlantic Deeper W aterways Association finished the business sessions oLlts fourth annual convention here Thursday. A resolution was adopted appoint ing a committee of ten members to urge upon President T aft and Con gress the enactm ent of legislation carrying into effect the recommen dations of the boards of engineers of the United States Army, for the ex tension and improvement of the intra- costal waterways system. Addresses to the convention were made by M. K. King, of Virginia Congressman John H. Small, of North Carolina Isham Randolph, ftf the Chicago Sanitary Commission Logan W. Page, director of public roads, and E. Dana Durand, director of the cen sus. An annual saving of approximately 400,000,000 by improvement oL the main roads in the United States so as to cut the cost of hauling in half , was advdeated by Logan W aller Page, di rector of the office of public roads in the Federal Department of Agricul ture. Mr. Page said that 20 per cent, of the highways carry 90 per cent of the traffic and that 440,000 miles should be improved to accommodate present highway needs. If th e principal highways were al ways passable for heavy-loaded ve hicles, he said, there would not be such, great variations in- rates and freight congestion, railroad and water way equipment could be employed to better advantage, freight handled more cheaply and the farm er enabled, to take advantage of m arket prices. Mr. Page said that many farthing communities import more agricultural products than they export, owing to bad highways. The address of E. Dana Durand, di rector of tbe census, turned on the dominant position maintained by the thirteen original States. Although their territory comprises only one-eighth of the United States area, he said, they contain two-fifths of the population and produce 53 per cent, of the total value of manufac tured products, 46 per cent, of the mineral products and 61 per cent, of the coal. Their exports are 58 per cent, of the countrys total and their imports are 79 per cent. Their railroad mileage is 23 per cent, of the total qf the country and th e ir- proportion of railroad freight and passenger traffic is much larger. The water-borne traffic of the Atlantic and Gulf Coasts, exclusive of foreign trade, amounts to 37 per cent, of the countrys water-borne traffic."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "of North Carolina Isham <mark>Randolph</mark>, ftf the Chicago Sanitary"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "of North Carolina Isham <mark>Randolph</mark>, ftf the Chicago Sanitary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2112.91, 1115.76, 2269.9, 1359.43], "bbox_id": "b8c4de44b5", "file": "TimesVirginian_1976_0442.pdf", "page": 1, "text": "will be developed. We think this first phase will move from the drawing board to construction within the year, and it is possible to have electricity from the Randolph Project by 1982. i.. The steam plant will be built  about two miles west of Phenix, I ! a mile off of Route 40. The j cooling lake will be construct-  ed on Cub Creek, five miles j  south of Phenix. These are , 1 approximate locations. The second phase will j include the construction of j  several pumped storage  contd on page 14 Crumbs for Thought"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "have electricity from the <mark>Randolph</mark> Project by 1982. i.."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "have electricity from the <mark>Randolph</mark> Project by 1982. i.."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [295.45, 998.08, 445.18, 1229.82], "bbox_id": "65a260a50e", "file": "TimesVirginian_1978_0119.pdf", "page": 1, "text": "Wildlife Needs You is the theme of 1978 Wildlife Week March 19-25. Robert Bedford, popular actor and environ mentalist, will serve as national chairman. Indeed, wildlife needs ev-  erybody, says Dr. Franklin Flint of the Robert E. Lee Soil and W ater Conservation  Dis trict, SWCD. Since 1969, 1 Americas Environmental Qua lity Index for wildlife, has continued to decline. The Index covers fo rests, soil, living space, wildlife, minerals, air, and water, he said. Dr. Flint, a profesor of biology at Randolph Macon Womans College, states that in 1966 there were 78 endangered American animals"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "profesor of biology at <mark>Randolph</mark> Macon Womans College, states"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "profesor of biology at <mark>Randolph</mark> Macon Womans College, states"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [590.66, 649.08, 733.43, 798.33], "bbox_id": "6fc0eecf5b", "file": "TimesVirginian_1978_0290.pdf", "page": 1, "text": "White. Honorable Mention - John Caldwell, Kim Crabtree, Sa brina Richardson, D o n n ie Steadman, Sharon Taylor, Dana McGrath, Shavonne John son, Carroll Kanipe, Marvin Johnson. Honorable Metnion - Andrew Fratrick, Paula Hyche, Barbara Baker, Karen Basemore, Sher ry Martin, Janet Neally, Sherry Overton, Marilyn Randolph, LisaWenning. 4"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Neally, Sherry Overton, Marilyn <mark>Randolph</mark>, LisaWenning. 4"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Neally, Sherry Overton, Marilyn <mark>Randolph</mark>, LisaWenning. 4"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [425.77, 837.89, 569.77, 1076.13], "bbox_id": "f2741ee727", "file": "TimesVirginian_1976_0289.pdf", "page": 1, "text": "White and Mr. and Mrs. Phillip Martin. Mr. and Mrs. Robert Morris, Ronnie, Carolyn and Melanie left this morning for Virginia Beach where they plan to spend several days. Miss Eunice Martin, Mrs. Howlette Drinkad, Mr. and Mrs. Herman Moore, Jr., Mr. and Mrs. David Martin and Mr. R. B. Martin, and Mi and Mrs. J. J. Morris visited M r. and Mrs. Randolph Tyree of Stuart Draft Sunday afternoon honor ing Mrs. Tyree on her birthday. Mrs. H. C. Moore was honored on her birthday Sunday at the home of Mr. and Mrs. Tom Schmutz. Mrs. O. W. Martin and brothers and sisters were present."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "M r. and Mrs. <mark>Randolph</mark> Tyree of Stuart Draft"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "M r. and Mrs. <mark>Randolph</mark> Tyree of Stuart Draft"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.38, 1124.76, 1729.33, 1268.86], "bbox_id": "9d5c3c40d8", "file": "AppomattoxNewspapers_1962-1965a_0062.pdf", "page": 1, "text": "while W. D Daulton stuffed in 18 and 10 points respectively on the inside. The Rebels made a game of it for three quarters with Jam es Whitehead and Phillip Lueado doing most of the scoring. White- head pumped in 18 points while Lueado and F arrar hit 14 and 8 respectively. The Rebels held a two point edge going into the last quarter but the taller and more experienced Randolph en- ry quintet came out hungry. The Rebels hung on until 3 minutes"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "taller and more experienced <mark>Randolph</mark> en- ry quintet came"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "taller and more experienced <mark>Randolph</mark> en- ry quintet came"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [692.39, 235.52, 823.9, 502.11], "bbox_id": "fe98f0c2ab", "file": "TimesVirginian_1980a_0077.pdf", "page": 1, "text": "While the teams havent had enough practice yet to give the coach any concrete idea what to cfxpect his season. Archer does expect a lot of good effort, from returning team members as well as new prospects. The first track meet this year, which is scheduled for March 18 at Appomattox against  Randolph Henry, may have to be postponed if the weather does not break soon. I have to get the. track into shape, and itll be pretty hard to do that unless the snow leaves us alone says Archer. Archer adds that the track will have to be marked off differently this year, as Seminole District - schools will be Tunning metric distances this year for the"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "18 at Appomattox against  <mark>Randolph</mark> Henry, may have to"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "18 at Appomattox against  <mark>Randolph</mark> Henry, may have to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [786.7, 997.14, 953.01, 1022.23], "bbox_id": "03695aa7f0", "file": "AppomattoxNewspapers_1939-1943a_0205.pdf", "page": 1, "text": "WHEN THE DALTONS RODE With Randolph Scott  Kay Francis"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "WHEN THE DALTONS RODE With <mark>Randolph</mark> Scott  Kay Francis"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "WHEN THE DALTONS RODE With <mark>Randolph</mark> Scott  Kay Francis"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [887.28, 652.5, 1045.65, 976.64], "bbox_id": "8ceaec1aba", "file": "AppomattoxNewspapers_1939-1943a_0071.pdf", "page": 1, "text": "What makes a GOOD bouse? A good bouse is distinguished by1 tour qualities. 1. It should be efficiently planned, X. It should be attractively com posed, S. It should anticipate the present and future needs of the family that will occupy it, and 4. it should be well built This small housea one story house with two story privacyex emplifies all four qualities. It was designed by Randolph Evans, the well-known small house architect and was selected by the Monthly Small House Club at 227 East 45th Street, New York, as its house of the month. And this is why the Club believes it to he a GOOD house 1. It is efficiently planned. Both bedrooms and bath can be reached from tbe entry without passing through the living room. If neces sary, they can be completely shut off from the rest of the house to provide second story privacy. Every major room has cross ven tilationwindows on two or more walls that flood the house with sunlight and air. 9 2. It is attractively composed. Mr. Eva at has nulled out the living"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "It was designed by <mark>Randolph</mark> Evans, the well-known small"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "It was designed by <mark>Randolph</mark> Evans, the well-known small"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [270.0, 1295.19, 412.1, 1338.59], "bbox_id": "c2300d66ba", "file": "TimesVirginian_1976_0204.pdf", "page": 1, "text": "Wflfiam Randolph Lipford, son of Mr. and Mrs. William Lipford of Concord, has just completed basic training at"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Wflfiam <mark>Randolph</mark> Lipford, son of Mr. and Mrs. William Lipford of Concord, has just completed basic training at"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Wflfiam <mark>Randolph</mark> Lipford, son of Mr. and Mrs. William Lipford of Concord, has just completed basic training at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1894.11, 976.97, 2055.02, 1354.7], "bbox_id": "2cf170255f", "file": "AppomattoxNewspapers_1933-1936a_0021.pdf", "page": 1, "text": "were suspiciotis. Six were ree ommended fo rlu rav at the 5r 6. These cases were referred back to their family physicians for advice and treatment. Some of them will doubtless go to the State sanitorium, but most of them must remain at home. Doctors report that it is easier to get well at a sanatori um because people at home do as they please and not as the doctor advises. The advice of the family doctor, is followed out n the home, is just as ef fective as the advice of a doc tor at a hospital. People with tuberculosis should realize this when they must remain at home with the disease, act sen sibly and obey the doctor. Med icine is not needed. Plenty of rest, good food, and fr-,sh air will work the cure if they be gin soon enough. Dr. Wm. M. Randolph w as the clinician in charge with Miss Elizabeth Bryson as his torian, and Helen F. Johnson, as nurse. Mrs. Ferguson, Mrs. Harvey and Miss Shirey assist ed at the morning clinic with Mozella Price helping in the afternoon."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "enough. Dr. Wm. M. <mark>Randolph</mark> w as the clinician"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "enough. Dr. Wm. M. <mark>Randolph</mark> w as the clinician"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1556.9, 1462.05, 2370.64, 1634.91], "bbox_id": "e31e93e0ba", "file": "AppomattoxNewspapers_1933-1936a_0003.pdf", "page": 1, "text": "well and W. E. Warriner. Ac tive pall-bearers were C. B., W. E., S. J., C. M., and J. L. Evans, Harold and Julian Cole man, Hubert, Herman and Paul Evans, Winfred, Whitney, I Reed and Randolph Evans. T h e ---- -- . ., flower-bearers were Mesdames tailed investigation a n d regid Gordon Minnix, Georia Davis, examination. It tool tnpe be- Lillian Tashner, W. A. Cyrus, cause of the huge number ot Russell Elder, Horace Craft, banks involved and the tho-  W hvs , y ......... ...... .. ....... JV.  ----- IT Havs at A Century of Prog m W. E. Warriner, Wayne Griggs roughness of the work. Mrs. WilTie Beale and three united m marriage. It is need-,days at A entury oi. r     r q two I sons and Ben Megginson visit- ...... less to say he delivered some j Chicagos 1933 Worlds Fajr. ed Mr. and Mrs. J. W. Meg- , able sermons to an apprecia- JJrt  ur tt COmpass of any  r f l  b u i g l M t f c  i l  J  He met"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Whitney, I Reed and <mark>Randolph</mark> Evans. T h e"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Whitney, I Reed and <mark>Randolph</mark> Evans. T h e"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1673.75, 1148.8, 1845.82, 1535.14], "bbox_id": "8980512fb1", "file": "AppomattoxNewspapers_1939-1943a_0496.pdf", "page": 1, "text": "weeks with her parents. Friends are glad to hear that J. D. Morris has returned from the hospital and is improving. Mrs. Beryl Temple and children will return to Kingston, N. C. on Monidaiy after spending two weeks with her parents, Rev. and Mrs. H. Frederick Jones. Mrs. J. K. Hall, of Richmond spent several days last week with Mrs. Joel W. Flood. Misses Constance Fulp and Mar jorie Bingham, of Richmond, are spending some time at their homes here. Born to Mr. and Mrs. Jack Davis .a daughter, Monday, July 27. Mrs. T. Banks Frazier, of Rich mond is visiting her mother, Mrs. W. P. Gills. Mrs. F. C. Dresser, who has been a patient at the Baptist hospital, has returned to her home here.. Miss Cornelia Gills is spending this week at Ocean View. Mrs. Pelham Cooke and son, John Randolph, are spending thè week at East Ridge Farm. Mrs. D. E. Caldwell Jr., who re cently underwent an operation at Stuart Circle hospital, Richmond will return to her home here Sunday. Mrs. John Taylor and son are spending this week at Rice."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Cooke and son, John <mark>Randolph</mark>, are spending thè week"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Cooke and son, John <mark>Randolph</mark>, are spending thè week"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [884.16, 1003.32, 1025.98, 1088.54], "bbox_id": "9ac38f36f6", "file": "TimesVirginian_1978_0231.pdf", "page": 1, "text": "Week June 17 - October. Free Admission Stall Rentals - 3.00. Located at New Randolph Tobacco W arehousé, three miles West qf Farmville on Route 460. Come to Browse, Buy, Sell. __________ 5-25-1TC"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Week June 17 - October. Free Admission Stall Rentals - 3.00. Located at New <mark>Randolph</mark> Tobacco W arehousé, three miles West qf Farmville on Route 460. Come to Browse, Buy, Sell. __________ 5-25-1TC"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Week June 17 - October. Free Admission Stall Rentals - 3.00. Located at New <mark>Randolph</mark> Tobacco W arehousé, three miles West qf Farmville on Route 460. Come to Browse, Buy, Sell. __________ 5-25-1TC"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.29, 994.75, 1215.12, 1225.9], "bbox_id": "d6a18b8714", "file": "AppomattoxNewspapers_1926-1933a_0219.pdf", "page": 1, "text": "week ago last Thursday at his home in Charlotte County. His death was attributed to a di seased heart. Funeral services conducted by the Rev. Mr- White, of Selections which will be! yjn Stratton, colored one fo r Played during the evening are, shooting his wife and the sec. .. - . .. God Bless You, Randolph- ond for carrying concealed f7?P m were _ held at th Jfiac.on  fg, from weapons. An indictments was   d e Chapel Methodist n ercolate into the nockets of Hood, Tell Not of at brought against Nora McCor- P1?1?1 of which Mr. St. John F h T d M M h ? m i c k for shooting her husband.   member for MtJ the drought stricken farmers -1 Now Let Every Tongue Adore! nd one for illal nossession one years. n Ty Tinion Thee, Still, With Thee, A- 0f ardent spirits and an indict- Surviving him are his wife, e doubtful as a means of re- dormaua pp  t Mirror 01 aaent Pirs ana an inaict Mrs-MarvL- St John and four avincr nnpinnlovmpnt for few oornmus i e Lttes Mirror, ment was brought against Jvr., j iVAay, e unemployment tor lew Moonlight On The Lake,, Leonard McCormick on the children besides Mrs. Mann, worth-while farmers can ever An Thru The Night, Lassie j fftter chafse alTo The last Cullen St. John, Mrs- E. W. Cov afford to Quit their farms for Q, Mine, Mosquitoes, Integer L w0 indictments were held ington, Crafton J. St. John and any length of time to engage Vitae and the Bell of St.  er  r theText term of court ------ I in highway construction. Marris  Alonsm Hava and W. V j tne j16, term OI QU  Mr. Horsley urgea tnat raxn T u arry both of Prospect, were er the solution to the problem wjjj sjng jn chorus, lies with the farmers themsel- fbe orchestra, known ves. He added that numerous Reed Battins Jacketeers"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "sec. .. - . .. God Bless You, <mark>Randolph</mark>- ond for carrying concealed"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "sec. .. - . .. God Bless You, <mark>Randolph</mark>- ond for carrying concealed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.64, 743.56, 1881.19, 812.36], "bbox_id": "4efa45cb7b", "file": "AppomattoxNewspapers_1952-1954a_0141.pdf", "page": 1, "text": "We were very pleased to have the  JutviorCljSf 5  of Randolph  Henry High School to present their play for our en.oyment Monday. It was en titled, The Angell Brats. Every one who saw it thoroughly enjoyed it."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "the  JutviorCljSf 5  of <mark>Randolph</mark>  Henry High School to"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "the  JutviorCljSf 5  of <mark>Randolph</mark>  Henry High School to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1320.8, 631.32, 1636.62, 733.71], "bbox_id": "146012a406", "file": "AppomattoxNewspapers_1952-1954a_0475.pdf", "page": 1, "text": "We should choose to use traf- competitive situation as a whetston Jrs. Dora Randolph left yesterday to sharpen our selling ability irjJf a visit with relatives in Charles stead of allowing it to blunt an,Jn West Va. damage it. jS  Quinn said statistics show thaiArs- Wesley Stanley and chU- 1954 has a lot of needs to fill but lp called to see Mrs. Charles M. seems equally true that the big quem Sunday afternoon, tion this year mil not be can peoplMyce stanley apent Saturday peiA t with Mr. and Mrs. Charles"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "a whetston Jrs. Dora <mark>Randolph</mark> left yesterday to sharpen"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "a whetston Jrs. Dora <mark>Randolph</mark> left yesterday to sharpen"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.46, 290.23, 1662.31, 384.48], "bbox_id": "fbc1c5fc3c", "file": "AppomattoxNewspapers_1892-1898a_0229.pdf", "page": 1, "text": "We saw an inter-leaved Bible from the students of Randolph - Macon College, a present to Rev. Geo. H. Wiley, a mark of their high esteem for work recently done in a series of meetings at their College. It is a beautiful gift aud highly appre ciated by the recipient."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "from the students of <mark>Randolph</mark> - Macon College, a present"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "from the students of <mark>Randolph</mark> - Macon College, a present"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [273.34, 1460.21, 431.14, 1579.16], "bbox_id": "da07697ece", "file": "AppomattoxNewspapers_1898-1902a_0302.pdf", "page": 1, "text": "We return thanks to Washington and Lee University for an invitation to be present ou Tuesday next, the 19th instant, at the dedication of the new law building to the memory of Hon. John Randolph Tucker. A fine marble bust of Mr. Tucker, by Mr. Edward V. Valentiue, of Rich mond, will be one of the ornaments of the new building."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "memory of Hon. John <mark>Randolph</mark> Tucker. A fine marble"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "memory of Hon. John <mark>Randolph</mark> Tucker. A fine marble"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [403.2, 282.78, 570.39, 1722.73], "bbox_id": "8fecad2aa1", "file": "AppomattoxNewspapers_1915-1918a_0163.pdf", "page": 1, "text": "We have had some sales of real estate of late that attracted unusual attention. Thirty-four acres ol land near town, bought for farming pur poses and uot for speculation sold for 8,000, Quite 1,00 an acre for arming landi sound guod. And tiro Nursery Plant, of which at one time I had high hope, was sold on the 2nd having been dvided into lots and small farme. The mansion house with twenty acres ad join i,.g was firstsold and bought by Profes sor Lear, of the Normal faculty, for 6 ,000. Just what use he will make of it is not yet known though it bae been suggested that it might be converted into a home for nnmarrird male members of the faculty. An other suggestion that it may bo made a Country Club, though I am not satisfied that Farmvilic is yet big enough to support a venture like that. Lots wero then sold of varying sizes and this was followed by the sale of s nail farms. Tbs sale ag gregated something over 12,000 and the bank authorities are pleased with rosults. It may be that the many owners ot the property will do moro for this section than the one, though 1 til reg.et the failure oi the nursery. Tne owner of the nursery piant, or the  etenubl owner, cuue to ns without money and each ventures require money to make the mare -go. A local branch of the Randolph 11 scon Alumni was organized here recently wRü 8. P. Luke as presi dent, J. M. Crute vice president B. H. Paulette, secretary and A. B. Armstrong treasurer. V. Hatcher met with the body and of coarse gave inspiration to the occasion. 1 witnessed the death of the dis pensary and never looked upon just each scene before. Orowds flocked to the place as bees about a hive And they continued to flock nntil the sun went down when the doors closed and dispensary days in Farm ville ended. Beceipts daring the day were some thing over thirteen hundred dollars. An l then another erowd gathered on Monday morning when it was known that the booze on hand would be given away. Pints and half pints lew thick- and fast and for four hours tne fun wax ed warm. Not being exposed to nahe bite I failed to call for mi A friend of mine, however, c-Jioil hie home in a buggy. D if Farm viile after twelve yeajtvof dispen sary life. Beceipk to the towi were large and sorfe day I will ge the total tu gratify my own onriosi ty and perhaps jurat of others. The king is deadlT ong live the king! The Bklckstone soldiers spent a week amh ns and left behind pleas ant memory. Fine lot of young  fellows manly in bearing and care ful of conduct. If war does couie, and God forbid, sue i soldier may be relied on for faithful and feai- lesB service. A little rain jnst now would be rich in blessing. My friend Mr. W. H. Richardson has the habit of taking just one mint julep a year and on Wednes day, the 3rd, the good wife made the annual delight and ai he drank smacked hie lips and said it was fine. A good prohibition friend by the way was invited to join him in the annual feast but asked that his julep be made stronger than that of the host, O, consistency thon an. a jewel. I read the Leader, the new local paper for Faripvillo, regularly and with interest re I always find in it local news of interest to me. Strange that any man wt o lovss hit- neighbors is wiiling to deny han sels the privilege and may I not adii the pleasure? of reading the local paper. And he should read hi- own paper and not that of his neigh bor. When a Normal girl comes down town without permission she is pun ished by being confined to the -cam- pas for a week. And the imprison ment is irksome. With a dozen owners of small farms near town we are going to learn all boat diversified and in tensified farming. Five acres would be reckoned a large farm in some countries and it remains to be seen what we of Sonthside Virginia will do with them. Dr. Paxton, pastor ot first Pres byterian church, Lynchburg, will be one of the speakers at the approach ing Hampden Sidney commence ment and a rich treat is in store for those who are privileged to hear him. A father went from Farm grille to Hopewell to see his two boys and spent half day finding them. Fjnt took bis stand at the postoffioe"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "local branch of the <mark>Randolph</mark> 11 scon Alumni was"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "local branch of the <mark>Randolph</mark> 11 scon Alumni was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1388.15, 915.05, 1549.41, 1010.29], "bbox_id": "7dd5793b16", "file": "AppomattoxNewspapers_1926-1933a_0080.pdf", "page": 1, "text": "We have had some fine ground hog weather. Mrs. Randolph Caldwell has been quite ill, but is better at this writihg. We regret to hear of Mrs. Willie Giles leaving the neigh borhood. She was a kind good"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "ground hog weather. Mrs. <mark>Randolph</mark> Caldwell has been quite"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "ground hog weather. Mrs. <mark>Randolph</mark> Caldwell has been quite"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.45, 896.66, 1535.2, 1126.76], "bbox_id": "849a0707ce", "file": "AppomattoxNewspapers_1908-1909a_0080.pdf", "page": 1, "text": "We have had Some fine ground hog weather. Mrs. Randolph Caldwell has been quite ill, but is better at j b wished for I this writihg. I Cawthorn, 1 We regret to hear of Mrs- Willie Giles leaving the neigh borhood. She was a kind good th e Werectiou h2i8hbo d I am sure she will Lon its tot on p misseabyall.  I L. Brown is We are glad to hear that Mr. the building I Perce Odr is improving. Rev. Thompson preached a fine sermon at Liberty Church Sunday. . Mr. Robert Hollycross and little son, John Randolph, have been sick, but they are improv ing-"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "ground hog weather. Mrs. <mark>Randolph</mark> Caldwell has been quite"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "ground hog weather. Mrs. <mark>Randolph</mark> Caldwell has been quite"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [815.99, 405.98, 987.56, 445.53], "bbox_id": "d13aa15885", "file": "AppomattoxNewspapers_1960-1962b_0580.pdf", "page": 1, "text": "We extend sympathy to Mrs. Rachel Evana and family  in -the death of her husband, Mr. Randolph Evjans."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "We extend sympathy to Mrs. Rachel Evana and family  in -the death of her husband, Mr. <mark>Randolph</mark> Evjans."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "We extend sympathy to Mrs. Rachel Evana and family  in -the death of her husband, Mr. <mark>Randolph</mark> Evjans."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [970.28, 265.41, 1110.04, 387.96], "bbox_id": "7421583355", "file": "AppomattoxNewspapers_1962-1965a_0189.pdf", "page": 1, "text": "We deeply regret an error in last weeks issue. In the write up on the Appomattox Town Election, Randolph Gilberts name was omitted. Mr. Gilbert was pictured along with the rest of the council men present, but his name and vote count were inadvertently omitted. He begins his third term as councilman in September, having received 256 votes in the June 11 election."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "the Appomattox Town Election, <mark>Randolph</mark> Gilberts name was omitted."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "the Appomattox Town Election, <mark>Randolph</mark> Gilberts name was omitted."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.04, 402.04, 1854.79, 556.49], "bbox_id": "4b1dc619d3", "file": "AppomattoxNewspapers_1954-1955a_0032.pdf", "page": 1, "text": "We are so happy to know little I Brad Wheeler has returned home from the hospital, aftei being there several weeks. So glad he is doing nicely. Mr. Randolph Martin preached at j Bethel and Trinity churches Sun day morning in the absence of the pastor, the Rev. F. J. Wingfield, who is away at school for several weeks. Mr. Martin preached a grand ser mon. He is one of the young men from around here who is attending college. We hope for him much suc cess in his lifes work as a minister."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "is doing nicely. Mr. <mark>Randolph</mark> Martin preached at j"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "is doing nicely. Mr. <mark>Randolph</mark> Martin preached at j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [229.69, 301.84, 398.48, 1791.3], "bbox_id": "27ef829b32", "file": "AppomattoxNewspapers_1922-1923a_0310.pdf", "page": 1, "text": "Watermelons opened at 50 cents apiece, goon dropped to 10 and it looks now as though the bottom would drop out. Canteloupes have not been so in evidence and grapes received a severe shock from the early frost while the local peach crop has been a wide spread fail ure. Some newspaper scribbler wus silly enough to attack the health record of Farmvil le, and never was greater injustice done a place and people. I called but yesterday on a family recently come from Kan sas to make their home with us, and the good wife of the household remarked that she came to Virginia, Southside Virginia, in seaich of health and that she had found it. She had suffered for years from a distressing case of nasal catarrh, which had broken in upon the rest of night ar.d the comfort of day. The old enemy had been vanquish ed and she now enjoys the inesti mable blessings of good health, and all this in a community which scribbler describes as a pest hole. Strange that a man who started out to write falsely should have been bold enough to fly in the face of facts so well established. Now and then the cry sounds out from our jail for the jailor and on repairing to the place Mr. Bliss finds that the prisoners are fighting among themselves. Human punish ment as a corrective is a dead fail ure. The ruling passion losef none of its force behind prison bars. Our lithia water requires no ice anil so is the most economical of summer drinks. Judge Watkins made an irnpres sive speech before the Board of Su pervisors on last Saturday in the interest of our public school system Some of our good people dont yet understand that education costs something, that is that it should cost them something. A farmer in town the other day said his crops were never so good and that he had not had a drop too much of rain. Some farmers never have too much or too little. Prof. Thornton has decided not to accept the position offered him in the University of West Virginia. Miss Snow, of the Normal Facul ty, is the first to return for the work of another session. It looks like yesterday when vacation began. Tiire flies and sessions and vaca- cations fly with it. Some of our merchants are busy taking inventory. All of them have done well during the dull mouths of summer. The extra passenger traiu of the Tidewater  Western is being well patronized. Our people are complainiug of the injury done to the public roads of ihe county by the saw mill ua gone. At a recent meeting of the Board of Supervisors for Priice Edward, a license of 3 was placed on such vehicles. Scraping dirt to the middle of the road beds is a positive nuisance and ought to be prohibited by law. It simply means one prolonged and intensified mud- hole. There are so many premium ba bies in town that a baby show is in order, but woe to the rash mortals who conseut to serve as judges. An officer of a Confederate regi ment during the closing days of the war, called on the late Col. K. A Booker, who was then in charge of the Randolph House, for the use of a horse and left a valuable gold watch as security for its return. The hone was never returned and a daughter of Col. Booker still wears the watch. Within the recent past a letter has been received at the Herald office from a citizen of South Carolina m iking inquiries of the watch. The silence stretching over a period of more than 40 years is more than remarkable. Speaking of war incidents reminds me that Gen. Lee, on the retreat to Appo mattox, s p e n t a n i g h t at the Randolph Home, aud the night following Gen. Graut occupied the same apntmeuts, and the story goes that Gen. Lee left his tooth bru h and that Gen. Grant took possession of it History doesnt say that it was surrendered at Ap pomattox. Work on the new Methodist church is now well under way It will be the handsomest churi h building in Southside Virginia. Sheriff Dickuson went to North P to 1 na to blips lmck another ne-"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "in charge of the <mark>Randolph</mark> House, for the use"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "in charge of the <mark>Randolph</mark> House, for the use"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2114.41, 423.03, 2284.53, 1295.33], "bbox_id": "1828db86f5", "file": "AppomattoxNewspapers_1912-1915a_0250.pdf", "page": 1, "text": "Washington.In two weeks one ot the most interesting events scheduled tor this season will take place, and that is the wedding of the second daughter of the President of the United States. Miss Jessie Wilson will when she becomes the bride of Mr. Frances Bowen Sayre make the thirteenth bride to have been married in the White House. From now on specula tion will he rife as to the gifts, the trousseau, the Met of wedding guests, ana the thousand and one things that concern the young woman, Who fol lows bravely in her fathers footsteps and says Well, thirteen always was my lucky number. Mr. ayre, who is to share with Miss Wilson all the agreeable publicity of v White House wedding, probably cares as little as she that the wedding will be the thirteenth to be celebrated in the romantic old, colonial mansion, dear ito all Americans, and known to all familiarly, as the White Hbuse, in stead of the more stately and1 perhaps dignified name of the Executive Man sion. In itself it Is a romantic old mansion, it even hss a ghost or sev eral, according to the old time colored folk, who claim to have seen the haunts under the big front portico. But if there is a spook, it must be a benefloient old soul, for from this house of dreams the way to happiness has led for at least 12 other couples. A White House wedding ts an event to stir ones blood In Washington. When Miss Alice Roosevelt became the bride of Representative Nicholas Longworth In 1906 pages and pages were written concerning the event for days and even weeks before. It seem ed to be almost the only topic of news of interest to the people. And why should it not be, the White House be ing the house of the people, and its occupants put there by the people? An Historic List. The wedding of Miss Wilson and M t . Sayre, will be the last up to date of a long list of historic weddings which have since 1811 taken place in the White House. The first was that ot Lucy Payne Washington, sister of Mrs. James Madison, the wife of the then President Madison, who was married to D. Judge1 Todd, of Ken tucky. The others who have pledged their troth in the famous old mansion are In 1812, Anna Todd, cousin of Mrs. Madison, who married Representative John G. Jackson, of Virginia. In 1826, John Adams, son of Presi dent Adams, married his cousin, Helen Jackson. . From 1829 to 1837, during the Jack- son administration, there were three weddings. Della Lewis, a friend of President Jacksons, was married to Alphonse Joseph Yver Pageot, an at tache of the French Legation. Mary Easton, niece of President Jackson, was married to Ludem B. Polk, and Emily Martin, a connection of the Jackson family, was married to Lewis Randolph. In 1878, Emily Pratt, niece of Presi dent Hayes, and Gen. Russell Hastings were married. In 1886, President Cleveland and Frances Folsom were married. The daughters of Presidents who have married from the White House were Maria Monroe, who married her cousin, Samuel Gouveneur Elizabeth Tyler, who married William Waller NeWe Grant, who married Algernon Sartoris, and Alice Roosevelt, who married Nicholas Longsworth. Miss Wilson will be the fifth daughter of a president to be married in the White House."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "was married to Lewis <mark>Randolph</mark>. In 1878, Emily Pratt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "was married to Lewis <mark>Randolph</mark>. In 1878, Emily Pratt,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.47, 942.29, 2144.47, 1632.69], "bbox_id": "c444664409", "file": "AppomattoxNewspapers_1912-1915a_0352.pdf", "page": 1, "text": "Washington, D. C., May 8.The wedding of Miss Eleanor Randolph Wilson, youngest daughter of Presi dent Wilson, and William Glbba Mc Adoo, secretary of the treasury, took place Thursday at six oclock p. m., In the blue room of the White House. The wedding procession proceeded from the main stairway Into the cor ridor, through the north door of the bine room, to the platform erected In the south bay window of the room. Miss Sallle MoAdoo led the proces sion, followed by Mrs. Sayre and Miss Margaret Wilson. Miss Nancy Lana directly preceded the bride, who was escorted by the president The groom, with Dr. Cary Travers Grayson, met the wedding party at the altar. Mr McAdoo wore evening clothes and Dr. Grayson wore his uniform. Rev. Syl vester W. Bosch performed the cere mony. After the ceremony the wedding party proceeded to the red room, where they received congratulations and good wishes of the. company. The Marine band furnished the music. Supper was served at small tables In the state dining room. The decora tions of the bine room were lilies and ferns, and the decorations in the din ing-room were pink and white roses. Handsome Wedding Presents. In spite of the small list of invited guests the wedding presents were nu merous. Prominent among them were the beautiful silver tea service, given by the members of the house of rep resentatives, a piece of Jewelry from members of the senate, twelve silver plates and a platter from the cabinet members and their wives, and a hand some gift from the Justices of the Su premo court. From the diplomatic corpe, no member of which was In vited, came flowers and good wishes. The brides bouquet was of orange blossoms, white orchids and lilies of the valley. The flower girls carried white chip hats, hung by ribbons, filled with flowers. Mias Margaret Wilsons gown was of soft blue crape with panniers and waist of bine tulle. The neck was finished with a cream lace ruff and a flowered sash completed the costume. With this costume was worn a blue lace hat, trimmed with pink roses and touches of black. Mrs. Sayres cos tume was exactly like Mlse Wilsons except that the color was pink. The gowns of the little flower girls were white, with blue and pink ribbons. Beautiful Wedding Gown. Tho wedding gown worn by Miss Wilson is made of ivory-white satin and trimmed with real old point lace. The bodice is softly draped with satin, which crosses in front and is brought to a point below the shoulders, front and back. The V-shaped neck is fin ished with folds of soft tulle. The long mousquetalre sleeves are made"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "wedding of Miss Eleanor <mark>Randolph</mark> Wilson, youngest daughter of"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "wedding of Miss Eleanor <mark>Randolph</mark> Wilson, youngest daughter of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [446.17, 414.13, 786.51, 853.27], "bbox_id": "bca6159322", "file": "AppomattoxNewspapers_1943-1947a_0194.pdf", "page": 1, "text": "WASHINGTON.  Americans who took Manila from the Spaniards in 1898 are proud of MacArthurs march, but they recall with pride some of their own achievements in taking the Philippines. First-hand accounts are heavy with heroics, says the Associated Press. Marine Sgt. William Vogt, who pried Spanish shrapnel out of the rigging inches from where Comdr. George Dewey stood and made him self some cuff buttons, recalls We arrived off Luzon on April 30 sighted the Spaniard and right away went in, ignoring rumors of torpedoes. We stood down in col umn at 400-yard intervals and opened fire at 5,000 yards, closing in to 2,000. Deweys old tubs consisted of four protected cruisers, including the flagship Olympia one unprotected cruiser, one gunboat and one armed revenue cutter. Spanish Admiral Montojo had a museum piece battleship, one old wooden steamer which had to be towed, two protected cruisers and three gunboats. Montojo lost 165 killed and 214 wounded out of 1,875 men. One of Deweys deck hands dropped dead  from excitement, and 7 of his 1,748 j men were slightly wounded. Dewey, however, was leery of ceived word last week that their , Spains one modern battleship, said son, Randolph, was made a sc goant at Camp Wheeler, Ga. Donald Roach night with B. T. spent Saturday Almond. Mr. and Mrs. G T Marsh spent Friday night with her sister, Mrs. Floyd Wooldridge, who continues veiy iil."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "modern battleship, said son, <mark>Randolph</mark>, was made a sc"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "modern battleship, said son, <mark>Randolph</mark>, was made a sc"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [318.95, 540.29, 477.05, 581.59], "bbox_id": "23b9b5839f", "file": "AppomattoxNewspapers_1912-1915a_0059.pdf", "page": 1, "text": "Was Chancellor Of Randolph-Macon System Of Colleges. Lynchburg.  Dr. William Waugh Smith, chancellor of the Randolph-"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Was Chancellor Of Randolph-Macon System Of Colleges. Lynchburg.  Dr. William Waugh Smith, chancellor of the <mark>Randolph</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Was Chancellor Of Randolph-Macon System Of Colleges. Lynchburg.  Dr. William Waugh Smith, chancellor of the <mark>Randolph</mark>-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1534.79, 422.34, 1706.89, 798.58], "bbox_id": "8d5604ef0a", "file": "AppomattoxNewspapers_1954-1955a_0123.pdf", "page": 1, "text": "was begun on the building of the Evergreen schooL The house was ready for occupancy by opening of the school term. Miss Emma Smith, daughter of the late Thos. A. Smith was Ever greens first teacher. Evergreens next teacher for the term 1905-06, was Miss Addie Daw son, We have no record or incident of the year she taught. Suffice to say, it was here that Alice Hudson Cheatham Babcock had her start and her intervening fifty years have been spent in a school room. After her graduation from Appomattox High School and Randolph - Macon Womans College in Lynchburg, she took post-graduate work at Colum bia University in New York. She now holds a B. A. and M. A. degree and is assistant principal in one of Columbia, S. C. high schools. At a called meeting of the South- side District School Board held at Appomattox C. H. on August 19 1907, J. C. Jones resigned as clerk and J. R. Hamilton was elected in his place. It is to the late Mr. Hamil ton that we owe our records and most all our information on the early Evergreen school. Mr. Hamil ton has been dead one year. The records of early meetings of the school board are found in his papers. At a re-"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Appomattox High School and <mark>Randolph</mark> - Macon Womans College in"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Appomattox High School and <mark>Randolph</mark> - Macon Womans College in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1571.77, 230.4, 1729.33, 687.0], "bbox_id": "93682a9edd", "file": "AppomattoxNewspapers_1902-1905a_0233.pdf", "page": 1, "text": "was also a dance at Mr. Robert Wooldriges that night-. - Mr. Lance Strickland, of Pittsyl vania, who has been visiting his un cle, Mr. John Cole, returned home last Wednesday. Mr. Ellis Simms, of Roanoke, spent Xmas, at bis fathers, Mr. M. H. Simms. Mr. J. W. Coleman, of Graham, W. Va. Mr. and Mrs. Luther and Mr. Randolph Coleman, of Lynch burg and Mr. Robt Hollycross were among those who helped to make things lively at Mr. T. A. Colemans. Mr. Joel Coleman went to Lynch burg last week with some fine beeves. Miss Mary Louise Wingfield and h-r brother were visiting their rela tives, the family of Mr. George W. Coleman Saturday. Mrs. John Cole has been quite sick for the past week. But little is being done on the farm3 this freezing weather, though some have burned plant land and filled ice-houses. Our girls are very quiet for Leap Year, but young man, have a care! They are only biding their time we have heard them whispering of calls to be made, the valentines they are going to send, etc. Yon know it is always calmest just before a storm, and we expect Leap Year parties will soon be the role. January 8th."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mrs. Luther and Mr. <mark>Randolph</mark> Coleman, of Lynch burg"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mrs. Luther and Mr. <mark>Randolph</mark> Coleman, of Lynch burg"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.4, 1016.17, 513.02, 1151.51], "bbox_id": "ca4ffe5087", "file": "TimesVirginian_1983a_0363.pdf", "page": 1, "text": "warehouses to confirm their booUhg, They may also boric additional tobacco at this time if space is available. If there are any questions, contact the ASCS Office, Extension office or Dark Fired Tobacco Growers Market- ing Association. Hie annual membership, meeting of the Dark Fired Growers Marketing Association is November 4. The place is the New Randolph W arehouse, Farmville at 2 P-. Attention Burley Tobacco Producers"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "place is the New <mark>Randolph</mark> W arehouse, Farmville at"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "place is the New <mark>Randolph</mark> W arehouse, Farmville at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [284.4, 1280.43, 434.89, 1824.9], "bbox_id": "3f463013e7", "file": "TimesVirginian_1976_0306.pdf", "page": 1, "text": "Wanda Mosley, Rebecca Moss, Mary Mullins, Tamara Nash, Sharon Overton, Arlene Pan key, Velma Pankey, Michelle Paris, Juanita Patterson, Pen ny Patterson, Pam Phelps, Susan Phelps, Teresa Powell Room 322  BOYS - Myron McCoy, Clark McGuire, Freddy Mitchell, Jerry MitcheU, Mit chell, Randy Moore, Clifton Mosley. _ GIRLS - Vicky Reed, Rita Reynolds, Gail Ragland, Cindy Roach, Sharon Roach, Melinda Robertson, Melissa Scott, Doris Smith Cafe - Tolley - BOYS - Ronald Mosley, Otis Mosley, Tliunwgi Moslsy, William Mos ley, Larry Mottley, Andy Mullins, Jay Musick, Chuck Padgett, Dennis Page, Tim Page. Donald Parris, Scott Paulette, Andy Poole, Mike Powell GIRLS - Pam Smith, Susan Smith, Vanessa Smith, Pam Taylor, Linda Torrence, Gwen Turner, Michelle Tweedy, Faith Vaughan, Gladys Walker, Jill Walton, Theresa Watts, Lisa White, Brenda West, BmnqrWhmfc, Bonnie Williams. Cafe - Martin - BOYS - Thomas Randolph, Cliff Rho- denizer, Aeil Itree, Charles Rice, Kerry Richardson, Jimmy Roach, Kenneth Robertson, Clarence Robinson, David Robinson, Bud Rosser, Clar ence Rosser, Daniel Rosser, Mike Rowe, Dwayne Scruggs, Greg Scruggs, Charles Smith, Tony Smith, David Stratton, Frankie Tanner, Mark Thomas, David Thompson, Bill Vaughan, Kenneth Walker, Randy Wa terman, Carl Watson, Sammy Webber, Robert West, Dave"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Cafe - Martin - BOYS - Thomas <mark>Randolph</mark>, Cliff Rho- denizer, Aeil"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Cafe - Martin - BOYS - Thomas <mark>Randolph</mark>, Cliff Rho- denizer, Aeil"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [784.79, 357.87, 952.14, 689.47], "bbox_id": "b139f1640e", "file": "AppomattoxNewspapers_1955-1957a_0254.pdf", "page": 1, "text": "Walton Hamlett Pillow, 78, an Appomattox County farmer, died Friday, August 10, at Memorial Hospital, Lynchburg. Born near Brookneal, Campbell County, he was the son of the late John William and Arnette Driskill Pillow. He is survived by his wife, Mrs. Lillie Lee Pillow six sons, Herbert W., of Lynchburg Her man O., of Blackstone Johnnie W., of Norfolk tfflger L., of Spout Spring Harold F., of Madison Heights, and Wise E., U. S. Navy three daughters, Mrs. Keturah Bowles, of Newport News Mrs. Jessie W. Griffin,  of Lynchburg, and Mrs. Charles M. Rush, of Ap pomattox two, brothers, Leonard Pillow, of Brbokneal, and Charlie L. Pillow, of Lynchburg two sis ters, Mrs. Frank Carwile and Mr 9 . George Ramsey, of Brookneal 13 grandchildren and 14 great grand children. Funeral services were held Sum- day at 330 P. M. from Providence Baptist Church. The services were conducted by the Rev. L. P. Brown, assisted by the Rev. Randolph Hite, the Rev. S. A. Dean, and the Rev. Irvin A. Orndoff. Interment was in Falling River Baptist Church Cem- etary, Brookneal."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "assisted by the Rev. <mark>Randolph</mark> Hite, the Rev. S."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "assisted by the Rev. <mark>Randolph</mark> Hite, the Rev. S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1845.58, 320.66, 2133.79, 1145.96], "bbox_id": "bab92fc5d1", "file": "TimesVirginian_1978_0264.pdf", "page": 1, "text": "walking catfish any Of genua  Contact Falling RlV8T Realty Clarisa, dchUd Texas perch , Company, AppomattOXJ Cichlasoma cyanoguttatum or  352-7195. grass carp any of genus Ctenopharyngodon unless a permit therefor is first obtained from the Commission.    CHAPTER 24. Treat Fishing R24-1. Except as otherwise specifically provided in the regulations appearing in this chapter, the open angling season for trout shall be from twelve oclock noon the first Saturday in April through February 15, both dates inclusive. Except for the first day, angling during the season hall he permitted from five a t  until one hour after sunset.    R24-9.1. For the purposes of ! this chapter artificial lure with tingle barbless hook shall mean any single hook lure from which the barb has been removed or rendered inoper able and shall include manufac tured or handmade files, spinners, plugs, spoons and facsimiles of live animals, but hall not be construed to include artificial fish eggs.    CHAPTER 31. Accident and Casualty Reporting. R31-3. In addition to the notification required by R31-2, the operator of a vessel shall submit a written casualty or accident report to the Commis sion when, as a result of an occurence that involved the vessel or its equipment  1  a person dies  2  a person is unable to perform normal or usual activities 3 damage to the vessel and other property damage totals more than two hundred dollars or 4 a person dissapears from the vessel under circumstances that indi cate probable death or injury. A written report required by this regulation must be made I  1  within forty-eight hours of  the occurence if a person dies within twenty-four hours of the ojcriu-ence  2  within forty- 6 f th 8 if a person is unable to perform normal or usual activities or disappears from a vessel and  3  within ten days of the occurrence or death if an earlier report is not required by the foregoing provisions of this regulation. When the operator of a vessel cannot submit the report required by this regulation, the owner shall submit the required report. COMMISSION OF GAME AND INLAND FISHERIES John P. Randolph, Chairman _______ 6 - 8 -lt"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "INLAND FISHERIES John P. <mark>Randolph</mark>, Chairman _______ 6 - 8 -lt"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "INLAND FISHERIES John P. <mark>Randolph</mark>, Chairman _______ 6 - 8 -lt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.71, 978.22, 1548.61, 1447.77], "bbox_id": "9753595731", "file": "AppomattoxNewspapers_1898-1902a_0309.pdf", "page": 1, "text": "W. S. Gilbert, the dramatist, applied in London for an injunction to restrain Miss Jeannette Steer from playing Pygmalion and Galatea. Premier Dunsmulr, of British Columbia, completed the formation of tbe new cabinet. Advices were received of the catastrophe to the steamer Mabel and the three boats she was convoying, which came to grief at Tumatumnri Falls, British Guiana, about half of the passengers losing tbeir lives in the rapids. Herr Martel, a member of the German Reichstag, stated tlmt tho Agrarians had been quietly assured by tbe government Ibat Germanys next war would be with Eng land. President Loubet visited the United States pavilion at tbe Paris Exposition aud wns re ceived by Ambassador Porter. Lady Randolph Churchill announced that she is to be married to Lieuteannt George Cornwallis West in July. CouDt Muravieff, tbe Russian Minister, died suddenly in St. Petersburg. Lord Salisbury, in an address to the Society for tbe Propagation of the Gospel, said that overzealousness of misson sriee was tbe cause of many deaths. American exhibitors of wines at the Paris Exposition are incensed because half of them have been cut off from competition by the French jury. The Nationalist convention, held in Dub lin. adopted a constitution for tbe United Irish League and passed a resolution con demnlng the Boer war. When tbe British steamer William Clio Jelt Colon negotiations were In progress for the surrender of the city of Panama to the revolutionists. Tbe government army is reported to have lost four hundred men and thirty-flreoffleere killed In the battle of Bejuoa Plain by tbe Colombian revolutionist. The Italian pren ier announced to lhe Chamber of Deputies that tbo cabinet bad resigned. Lloyd C. Grisoom, United States charge at Constantinople, presented another Im perative note to the Saltan. A cyclone did considerable damage In Cologne, Germany, and several persons were Injured. The death wns reported In Berlin of Karl Lontag, tbe actor."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "by Ambassador Porter. Lady <mark>Randolph</mark> Churchill announced that she"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "by Ambassador Porter. Lady <mark>Randolph</mark> Churchill announced that she"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [383.99, 1023.2, 541.03, 1140.4], "bbox_id": "cb8cb7eb86", "file": "AppomattoxNewspapers_1915-1918a_0475.pdf", "page": 1, "text": "W. R..Phelps, professor at Randolph- Macon Institute, has been elected ehairman of the Danville Red Cross Chapter, succeeding Miss Celia Brian, who has resigned. Miss Brian, who superintends the Danville hospital, on- panized and developed he chapter vnd supervised the preparation of more Hmn a dozen large boxes of Red Cross supplies. She has resigned, because she expects to be called next spring hr Dr. Stuart McGuire When hie hos pital unit leaves Richmond for Europe."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "W. R..Phelps, professor at <mark>Randolph</mark>- Macon Institute, has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "W. R..Phelps, professor at <mark>Randolph</mark>- Macon Institute, has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1336.1, 1256.16, 1441.28, 1344.71], "bbox_id": "baca6321b2", "file": "AppomattoxNewspapers_1908-1909a_0114.pdf", "page": 1, "text": "w Mrs. Judson Bush, oi  Jtaffl8itiRgMra.Bu6 Randolph Chid- bas been quite ill. rede Hubbard won the l WBe given away at Bonnet Shop during"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "w Mrs. Judson Bush, oi  Jtaffl8itiRgMra.Bu6 <mark>Randolph</mark> Chid- bas been quite ill. rede Hubbard won the l WBe given away at Bonnet Shop during"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "w Mrs. Judson Bush, oi  Jtaffl8itiRgMra.Bu6 <mark>Randolph</mark> Chid- bas been quite ill. rede Hubbard won the l WBe given away at Bonnet Shop during"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1909.45, 576.6, 2051.48, 822.29], "bbox_id": "cd6923a7b3", "file": "AppomattoxNewspapers_1962-1965a_0458.pdf", "page": 1, "text": "W. M. Thompson Sr. William M. Thompson, Sr., 64, of 6910 Horsepen rd., died Sun day. A copy editor a n d former make-up editor for The Rich mond News Leader, he was graduated from Randolph - Macon College, where he was a member of Phi Delta Theta fraternity. He had been on The News Leader Staff for 20 years. He is survived by his wife, Mrs. Virgilia Atwood Thompson a son, William M. Thompson, Jr., of Portsmouth and a sister, Miss Mary O. Thompson, of Kingsport, Tenn. A funeral service was held at 10 a.m. Tuesday at Joseph W. Bliley Funeral Home, with bur ial at 2 p.m. in Springhill Ceme tery, Lynchburg. Mr. Thompson was the son of the late Dr. and Mrs. William Edgar Thompson, a Methodist minister."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "he was graduated from <mark>Randolph</mark> - Macon College, where he"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "he was graduated from <mark>Randolph</mark> - Macon College, where he"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1468.28, 193.7, 1803.93, 294.9], "bbox_id": "c3c759677e", "file": "AppomattoxNewspapers_1912-1915a_0443.pdf", "page": 1, "text": "w m .  MI bs Jollie Abtottt. Vote Tuesday. I This most estimable and E ection D ay  n.t Tuesday.  much loyed Christian lady died Take pit your hat to Jack Frost.  at the home of her nephew, W. Our houeewivee are pleased to J. Abbitt at Randolph,  see sugar coming down  jail m U ewllA I land on O ct 1st were"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "to J. Abbitt at <mark>Randolph</mark>,  see sugar coming down"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "to J. Abbitt at <mark>Randolph</mark>,  see sugar coming down"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [409.9, 263.95, 554.5, 819.93], "bbox_id": "dc06281635", "file": "TimesVirginian_1981a_0360.pdf", "page": 1, "text": "W inners in  the Historic Appomattox Railroad Festival Contest sponsored by Ameri can Federal Savings and Loan have been announced, accord ing to a contest spokesman. In the kindergarten through grade 2 category, first-place winner was Thomas Nolen, second-place winner was Hea ther Martin, third-place winner was Nicole Randolph, and the work of Daphne Jackson and LaTasha Johnson, received honorable mention. In the grade 3 through 5 category, first place went to Mike Whitmer, second place went to Sarah Mitchell, third place to Rodney Thompson, and Angie Thompson and Joe Servis received honorable mention. In the grades 6 through 8 Category, first place went to Cheryl Wooten, second place went to Angie Whitmer, third place went to John Ackerman, and honorable mention went to Paul Sheen and Debbie Hail. In the grades 9 through 12 category first place went to Bruce McClary, second dace went to Teresa Mayberry, third place went to Ron Carter, and honorable mention, went to Rosa , Harvey and- Randy Phelps. , Judges for the event were Jennifer Midgett, Wendy Ric hardson, Emily Burke, and Susan Weatherly. First-place winners received a 25 passbook savings account from American Federal Sav ings and Loan, second-place winners received a 15 pass book, third place winners received a 10 passbook, and those receiving honorable men tion received a 5 passbook. R uritans"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "third-place winner was Nicole <mark>Randolph</mark>, and the work of"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "third-place winner was Nicole <mark>Randolph</mark>, and the work of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.09, 271.41, 1743.98, 1207.14], "bbox_id": "0ff2a250cb", "file": "AppomattoxNewspapers_1915-1918a_0113.pdf", "page": 1, "text": "W ill faka -II th drv bo ie you bring me at 50c per 100. 3r. L . S mith Mr- E. H. Wood, of Amhérst county, is visiting at the home of Mr. J. R. Caldwell near here. Bob Patteson got 60 days on the roadawarded by Justice Jrown last Friday. Miss Odell Wool ridge has pneumonia. She is improving now. A t iegram from Prospect announces the serious illness of Mrs. R K Purdum. 1 hr,ve a pair of heaw young per- cbrTOii marea and tnree young mule co l e on easy teims. L E. S mith 3 t Miss Margurite Coleman, of Crewe, was visiting her uncle Mr. 8. P. Coleman here last week. Correspondents will confer a favor on the paper by having their letters reach us notlater than Tuesday morning. Messrs. W. P Ingram, of Nor folk J. M Osborne, of Lexing ton, Ky., have been visiting at the home of Mr. W. B. Caldwell íere. Mesdames G. A Hancock, W. Caldwell and J. R Atwood attended Henrietta at  he Aca demy in Lynchburg Saturday evening. The remains of Berths, a laughter of Uncle A!ex Bon- durant, col.ved, were brought here from Ohio yesterday and burned. Parson Watson offi ciated. We regret to announce the illaoSB of Mr. W. H. Haycock, at bis home in Washington, D Mr. Haycock is well known by our older citizens and Con federate veterans. Womaiis Missionary Society will meet with MrsG A Han cock February 28th, 2 p. m. Offerings for Foreign Missions and Buchanan Mountain school eoeiyed.  _. Sergeant Higginbotham has 44 convicts on the road at old Courthouse hill. He is doing some good work there, and t  e improvement will be praised by an appreciative public that ravel that important highway Little Elizabeth OBrien yes terday bad the misfortune to burn her back painfully while on a visit to her grandmother Mrs. Randolph Caldwell. She was standing in front of five dressing and her gown became gnited. A scream brought grandma to tbe rescue and the fihmes were quickly extin guised, but not Without blisters to both Mrs. Calda ell and the little one."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "to her grandmother Mrs. <mark>Randolph</mark> Caldwell. She was standing"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "to her grandmother Mrs. <mark>Randolph</mark> Caldwell. She was standing"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1829.48, 1405.16, 1991.52, 1822.16], "bbox_id": "478f201a1c", "file": "AppomattoxNewspapers_1922-1923a_0622.pdf", "page": 1, "text": "W edding A nniversary Cele brated. On Thursday night at the pala tial home Sherwood, of Mr. and Mrs. John Randolph Atwood here from 9 to 12 oclock the anniversary of their marriage 20 years ago was celebrated in royal stle. A large number of invitations had been sent out and a large attendance of old friends of the couple were on hand tto greet them and 1 wish them well. Many cams from a distance. The honse was beautifully decorated with pot ted plants and cut flowers, and in the centre of ths parlor a beautiful marriage bell swung, beneath which Mr. and Mrs. Atwood received their guests, being assisted by her two pretty daughters, Misses Edyth and Virgilia and her father and mother, Mr. and Mrs. J. L. CheriiRnlt At the doorLittle Jacqnelin and Lyn- olee received the guests aud usher ed them into the parlor. The man ner of these pretty maids and the grace with which they performed their functions elicited much com ment. In the spacious hall the ever-popular punch bowl was sta tioned it was presided over by Mrs Robert Freear, of Farmville assisted by Mrs. Clara Harvey of Lynchburg. In the library the handsome"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mr. and Mrs. John <mark>Randolph</mark> Atwood here from 9"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mr. and Mrs. John <mark>Randolph</mark> Atwood here from 9"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.5, 446.59, 2551.32, 603.5], "bbox_id": "405e0392a7", "file": "AppomattoxNewspapers_1892-1898a_0006.pdf", "page": 1, "text": "W ashington , Jan. ld--faATR.---Mr. MoriW, of Vermont, addressed the Sen- te in argument against, the htoGarra ban bill, and in alluding to Hon. John Randolph Tucket- as having mad aad vrtke n-port on the claim, expressed the  ta tb ft tbe rumor tb a t Mr. Tucker would be Mr, Cleveland Attorney Gon- eral would prove to be true, 7, 1 I Avotation was otto, ad Saturday ty Mr  loo,t ,Dfrtfathe Committee on Foreign Resolutions to inquire tuttG happy mixture of both parents. ------ 1 During tbe last illntesf Mrs. Bntier   soma years ago the genera! left I S t s lbe Nloarscua oan. undone to restore her, but fa vain, il fa far her was the most amiable part of hla lift, and her death waa tha orueleet blow he ever reoeived,"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "alluding to Hon. John <mark>Randolph</mark> Tucket- as having mad"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "alluding to Hon. John <mark>Randolph</mark> Tucket- as having mad"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.2, 1477.75, 2349.54, 1525.88], "bbox_id": "7d5bb4ed5e", "file": "AppomattoxNewspapers_1902-1905a_0305.pdf", "page": 1, "text": "W a n t e d - Wood. _____ HOTEL RANDOLPH,"}, "highlight": {"text": {"matched_tokens": ["RANDOLPH"], "snippet": "W a n t e d - Wood. _____ HOTEL <mark>RANDOLPH</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["RANDOLPH"], "snippet": "W a n t e d - Wood. _____ HOTEL <mark>RANDOLPH</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.5, 227.47, 879.68, 296.47], "bbox_id": "887a70e979", "file": "AppomattoxNewspapers_1962-1965a_0544.pdf", "page": 1, "text": "W . T. Mash on Thursday were Mr. and M rs. Olaf Waddill and fam ily, M rs. Omah Spay and iam ly, Mr. and M rs. Randolph Guill and fam ily, Brenda Nash and A .T.C. Ray Layne, of Geor- j gia."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mr. and M rs. <mark>Randolph</mark> Guill and fam ily,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mr. and M rs. <mark>Randolph</mark> Guill and fam ily,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2277.59, 344.6, 2429.01, 708.58], "bbox_id": "ad2479ac3c", "file": "TimesVirginian_1978_0127.pdf", "page": 1, "text": "Visitors in town for Easter were Misses SaUy and Eliza beth Farrar, Randolph Har lan d, Mr. and Mrs. Dick Baldwin, Ann Scott Baldwin, Richard Baldwin, HI, Mr. and Mrs. J- G. Green, Mr. and Mrs. Barry Austin and family, Richmond, Mr. and Mrs. Phillip Lucado and fanuly, of Greens- , boro, N.C. and Miss Enuly j Williams, of Alexandria, Va. Installation of officers of the Eastern Star was held Tues day, March 21st, at the Masonic Temple, W orthy M atron - AUeen Harvey Worthy Patron - Horace Coleman Associate Matron - Yerdella Hamflton Associate Patron - Edward Ranson Treasurer - Florence Ranson Secretary - Virginia Vaughan Conductness - Ruth Patteson Associate Conduct ness - Jean Carson Chaplain - Lucy Garrett MarshaU, Ada Lucado, Organist, Katherine Cunningham, Ada Ruby Inge, Ruth Helen Inge, Esther Christine Ranson Martha - Edith ToUey Electa - Louise Rosser W arder - Russell Carson Sentinel - Jimmy Rosser."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "and Eliza beth Farrar, <mark>Randolph</mark> Har lan d, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "and Eliza beth Farrar, <mark>Randolph</mark> Har lan d, Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [567.86, 185.44, 708.52, 334.63], "bbox_id": "0dcdf75e90", "file": "TimesVirginian_1976_0196.pdf", "page": 1, "text": "Visiting Mr. H. 0. Martin on Sunday were Mr. and Mrs. Winston Martin and Mr. and Mrs. W. C. Story. Mr. and Mrs. Abner Martin spent the week-end  with Mr. and Mrs. Howlett Drinkard, Donald Lee and Miss Eunice Martin. Mr. and Mrs. Randolph Tyree visited on Saturday night. Mr. and Mrs. Charles Martin were dinner guests in this home, guests in this home."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Martin. Mr. and Mrs. <mark>Randolph</mark> Tyree visited on Saturday"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Martin. Mr. and Mrs. <mark>Randolph</mark> Tyree visited on Saturday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1653.86, 604.88, 1781.81, 697.23], "bbox_id": "36474a961a", "file": "TimesVirginian_1980a_0299.pdf", "page": 1, "text": "Visiting Mr. and Mrs. Howlett Drinkard, Donald Lee and Miss Eunice Martin Friday were Mr. and Mrs. R. B. Martin, Mrs. Jutson Morris, Mr. Thomas Martin, Mrs. Randolph Tyree, Mr. and Mrs. Abner Martin and Mrs. S. G. Martin."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mr. Thomas Martin, Mrs. <mark>Randolph</mark> Tyree, Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mr. Thomas Martin, Mrs. <mark>Randolph</mark> Tyree, Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1647.81, 450.84, 1832.75, 619.79], "bbox_id": "81b4c6bf75", "file": "AppomattoxNewspapers_1908-1909a_0094.pdf", "page": 1, "text": "visited Mrs. A. E, day Mr. Royall Ferguson, of Lynch- for t Sunday with his and Mrs. A. B. burg, spent parents, Mr Ferguson. Little John Randolph Holly- cross who has been sick is im proving. We are glad to say that Mr. Joel Coleman is out again. Mr. and Mrs. J. W. Coleman spent Sunday with his mother, Mrs. A. E. Coleman."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Mr Ferguson. Little John <mark>Randolph</mark> Holly- cross who has"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Mr Ferguson. Little John <mark>Randolph</mark> Holly- cross who has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.14, 325.28, 1994.59, 637.23], "bbox_id": "2ff733fc80", "file": "AppomattoxNewspapers_1949-1952a_0541.pdf", "page": 1, "text": "Virginias leading beef cattle producers will meet at VPI March -0 for three days of discussions arid laboratory sessions covering practically every phase of the beef cactle business. The course, second of its  kind in Virginia, is sponsored jointly by thj animal husbandry department at VtT, the Virginia Beef Cattle Producers Association, and the state breed associations. The first day will be devoted to problems of feeding. George Litton, haed of the animal husbandry de partment will lead off with the fun damentals of good feeding. Jack Copenhaver, in charge of the col lege herds, will discuss feeding the breeding herd the year round. A prominent Virginia Angus breeder, B. A. Rucker, of Albemarle, wil. discuss feeding of show cattle. Pro fessor R. E. Hunt, VPI, will trace the history and trends in Virginias beef cattle business and Allan Randolph, Keene, secretary of the State Association,will diseuss Eth ics in thé Cattle Business. The second days program will feature a . report on beef cattle re search, by Dr"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "cattle business and Allan <mark>Randolph</mark>, Keene, secretary of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "cattle business and Allan <mark>Randolph</mark>, Keene, secretary of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [889.65, 365.42, 1047.92, 1570.0], "bbox_id": "33ed8f420f", "file": "AppomattoxNewspapers_1898-1902a_0532.pdf", "page": 1, "text": "Virginians received the following pen sions Andrew J. W agner. National Soldiers Home, Elizabeth City, 12 David P. Baker, Clifton Forge, 8 Thomas Archer, Norfolk. 6 Jacob Gaskins, Portsmouth, 10 Thomas Hal stead. Phoebus, 12 Martha Stallings, Norfolk, 8. The town of Vinton was thrown into a state of great excitement over the ar rest of a negro named Early Ferguson, charged with assaulting Luella Thomas, a 13-year-old girl, daughter of Mr. and Mrs. C. C. Thomas. The assault oc curred near Bonsack. The authorities gave the negro a preliminary hearing and owing to the state of feeling he was hurried to the Salem jail for safe keep ing. There would doubtless have been a lynching if he had been kept at Vinton over night. Fergusons reputation is unsavory, he having just completed an eight months sentence for an attempted assault on Fay M organ, aged 11 years, about a year ago. Stanley Hinton, colored, 30 years old. fireman at the Smithfield Ice Company s plant in Smithfield, met a horrible death. His neck and one arm were broken and his skull was crushed by the startng of the big driving wheel, between the spokes of which he had thrust his head while he was looking after machinery. One of the plants owners said that the creation of a vacuum caused the wheel to make a partial revolution. Champe Braxton Shepherd, a son of Joseph H. Shepherd, until recently a clerk in the office of the Auditor of Pub lic Accounts of Virginia, was picked up on the streets of Chicago a mental wreck and sent to Kankakee Asylum. L ong rest and treatment, it is thought, may restore him. Young Shepherd served with honor in the Philippine Islands and was on his way to his old home in Richmond when attacked. Officer J. H. Madison, brother of the Delegate from Newport district, put two bullets into Henry Hall, a Norfolk negro whom lie was trying to arrest on the steamer Belle Norton. The negro, who will probably die, had wrenched the club ftom the officers hand and split his head open before he could draw his revolver. Three bystanders, who refused to assist the policeman, were arrested and fined. Mr. Frederick Berry and Miss Lucy Conner, both of Stafford County, were married at the Baptist parsonage near Leeland, Rev. T. T. Lynn officiating. Leroy S. Edwards, principal of the Springfield School at Richmond, and son of Rev. John E. Edwards, died after a long illness. The suit of Brightwell vs. Pulliam, in volving the Randolph gold mine prop erty, which has been pending since 1851, has been finally settled in the Circuit Court at Fredericksburg and a decree has been entered ordering the sale of the property. Every lawyer and judge who was first connected with this case is dead. The Rockingham Horse and Colt Show Association has purchased and handsomely equipped new grounds within the town of Harrisonburg.includ- ing a fine race track. The association is to hold its first show on August 28 and 29. Liberal premiums are offered. In Orange county at the home of the bride Mr. Charles Adams and Miss Flor ence Burch were united in marriage by Rev. Mr. Harlow. Miss Julia Mann was maid of honor and Mr. John Adams best man. Extensive improvements arc to lie made at Westover, once owned by W il liam Byrd, founder of Richmond, and recently purchased by Mrs. W . M. Ram  sey, of California. The mansion will he remodeled, but will not be changed in architectural appearance. Floyd and Grayson counties have vot ed an appropriation of 150.000 for build ing the Marion and Rye Valley railroad. A lumber deal in Smytlie and Grayson counties involves 17,000 acres, at a cot of 103,000 to Pennsylvania capitalists. Stearne Fosque, the negro under sen tence of death in Accomac for murder, escaped from the jail there. The Gov ernor had refused to commute the mans sentence to life imprisonment. Robert A. Bibb, a popular conductor on the Virginia and Southwestern Rail way. fell between the cars of his train at Bluff City and was crushed to death. He ayas 45 years of age, and is survived by his widow and four children. T. J. Chambers, general grocer, ol Fredericksburg, has made a voluntary assignment for the benefit of creditors 38 in number, some of whom are Balti more and Richmond firms. Liabi i i.-s abont Iro.ooo assets unknown. During a severe electrical storm ir Warrenton the art studio of Mr. Rich ard N. Brooke avas struck by Fgh nine and set on fire. Prompt attention save it. The damage is small. W . L. Davis planing mill and blind sash and door factory and the boltlinf establishment of the Home Brewing Company, on Lombard street. Peters burg, were destroyed by fire. Total Ibis 18,000 insurance, 6oco. Mr. Robert H. Payne and Miss Carra M. Nottingham were married in Cul peper county at the home of the bride parents, Rev. Carter Page officiating. The Clarke County Colt and Horsi Show Association, which was recently organized, will hold its first annua meeting September 4 and 5 at it grounds near Berryville. Rev. C. C. Edington. a Methodis Episcopal preacher and former presidinj elder at El Paso, Texas, died at his liomi in Ballahack of consumption."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Pulliam, in volving the <mark>Randolph</mark> gold mine prop erty,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Pulliam, in volving the <mark>Randolph</mark> gold mine prop erty,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.64, 262.21, 1806.17, 1265.49], "bbox_id": "f69708d72d", "file": "AppomattoxNewspapers_1902-1905a_0109.pdf", "page": 1, "text": "Virginia pensionsWm. M. Broad water, Soldiers Home, Elizabeth City- county, 14 Edward Hall. Winchester, 12 George Beckley, Ferguson s Wharf,  8  Jesse Lewis, Soldiers Home, Elizabeth City  county, Sia Daniel R. Burrell, St. Elmo, 10 i Sarah Brickhousc, Norfolk, S Geoge 1 Hess, Hampton, 40 widow Rebec.  Hodges, Portsmouth,  8 .  The official program of the final ex ercises of the University of Virginia June 13 to 17, s as follows Sunday, u a. m. Baccalaureate ser mon, unniversity chapel, Rt. Rev. A. M Randolph, of Norfolk, Va. 8 p. m .- Address before the Young Men s Chris tian Association by Bishop Randolph. Monday, 11 a. m. Address before th Literary Society, public hall, Dr. Henry Smith Pritchett, president of the Mas sachusetts Institute of Technology. J p. m. _ Fii-al celebration of the Wash ington and- Jefferson literary socict.c and award of medals. Tuesday o.to a. m.General Alumni Association meets, n a. m.-Alumn address public hall by Judge William Gordon Robertson, of Roanoke. i . y p. m.Alumni banquet in b ayerweathei Gymnasium. 8 p. m. Reception t o t  alumni and guests in rotunda. Presi dent Roosevelt and other distinguishes men will be the guests of the university on this day and wi,il attend the public exercises at 11 a. m and the alumni ban quet at 1.30, Wednesday, June 17, 8 p. m. Closing exercises of the university and award o. diplomas and degrees. In the Circuit Court at Bristol Wil liam Heath, an employe of Dixie lan- nery, was awarded 300 damages ior injuries sustained while at Ins work. The Columbia Fire Company, of Alexandria, is making preparations tc visit Frederick, Md., during the fire mens convention in June. , Eustice Gardner, of Suffolk, 63 years old, has been adjudged insane. He was a brother of a former postmas ter of Suffolk who committed suicide. Confederate Memorial Day was ob served it Suffolk by a parade of veter ans and volunteer militia headed by a band and by prayers in the two ceme teries. The Suffolk Grays fired volleys over a deceased comrade in Cedar Hill. I Despite the protest and resolutions bi the Daughters of the Confederacy ask- I ing that no graves be decorated save those of Civil War veterans, the deco rations were almost as profuse as  usual, though their pledge was kept oy_ 1 nembers of the chapter.  William Roney was before the Unit ed States District Court at Richmond on a charge of-having in his possession a piece of spurious money. It was a  representation of fe 20 gold piece an was so adroitly made that it would fool inybody but an expert. The evidence all tended to show that Roney himself aad been imposed on, and the Uis.nct Attorney entered a nolle prosequi. A meeting of the Jewish residents of Petersburg was held - at fhe Umoti Street Synagogue for the relief of the Kischeneff massacre sufferers. After an address by the rabbi, Rev. Dr. S. Tycr. a committee was appointed to 7ait on the Mayor and request him to I call a mass-meeting of the citizens ot Petersburg in the interest of. the K.is- cheneff sufferers. A committee was also appointed to solicit contributions. The stockholders of the new Staun ton National Bank met and organized, lecting 15 prominent capitalists urec ors B. Estes Vaughan was elected president, William T. McCue, vicc- bresident and G. O. Child pashier. William Ramsay, a North Carolina legro who had his arm cut oft at the Richmond Locomotive Works, recov ered 2,917-50 damages. I The consolidation of the Emport. J Land and Improvement Company ind the Matoaca Manufacturing Com pany was recorded in the office of the secretary of the Commonwealth k Richmond, under tbe name of the Vir ginia Consolidated Milling Company The capital is given at 1.000,000. the officers are August Wright, presides- Charles Hall Davis, secretary L. A Hartley, Petersburg, general manager, reasurer and director George E Fish- jr. director, New York Philip Roper. Virginia director Davis  Davis, Pe tersburg, general counsel. The Alexandria City Council arrang ed the financial system of Alexandria for the fiscal year ending June 3?,  9 ? 4 - bv the passage of the appropriation bill . fhe estimated receipts for the year arc Si-o,oco and the appropriations ii. 200. As under the rew Constitution appropriation bills require two meet ings the business will not be entirely completed until the next meeting, when the Aldermen will concur w  1 to . Council and the new system will be civ"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Rt. Rev. A. M <mark>Randolph</mark>, of Norfolk, Va. 8"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Rt. Rev. A. M <mark>Randolph</mark>, of Norfolk, Va. 8"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1454.14, 296.88, 1643.28, 1698.29], "bbox_id": "1d9f31a21c", "file": "AppomattoxNewspapers_1902-1905a_0105.pdf", "page": 1, "text": "Virginia pensionsJacob Gaskins Portsmouth. 12 Frederick F. Burn ham, Magruder. 10 Annie Lester Christiansbnrg 12 Stewart Jamison Soldiers Home, ISlizibeA City.  Louis J. Howard, Soldiers Home Elizabeth City Coun.v,  8 . The Seaboard Air Line Railway shops, minor offices and warehouse, ot the outskirts of Portsmouth, were prac tically destroyed by fire. As near as cat be estimated the monetary loss will too up 75C cco. Janies Harrel, a machinist who sought to.save his tools, was s badly burned that he may die. No on else was seriously hurt so far as can in learned. William Marks, of Staunton, abort 2  years old. was placed in jail by Officer Fretwcll and Lipscomb, charged _ wit abducting J4-vear-old Ada Dull-  v.a alleged that , he took the girl .  en Monday night and walked to Middle brook a distance of 12 miles, where sh was located at his sister s house, in  was much excitement over a rumor tna Marks had killed the girl and lhrow her body into a cave on Sear s Hub 1  cave was being searched when s.ic via located at Middlebrook. Randolph Spencer, so n o f the Itote. jper.r.r at Monroe, was ncidentaliy kiilec He1fell from a freight train and wa run over near Barovrsville, . Orar.g county. ,  , , Stonewall Jackson Camp of Cor.fed crate Veterans will place on file in tin County Clerks office at Staimton at official record of all soldiers who tool- part in the Civil War. from August- county. Mrs. C. Travis Southall, of Newpor News, had a narrow escape front dealt by poisoning through a drug clerk, mistake, the clerk havirq given het  deadly poison instead of the drug she sent for. , ... . ... Rcanoke College at Saiem vvla ho c its semi-ccntcnnial celebration ana com mencement front June 7 lo it Conductor J. M. Baker, of t.ie R e v  oke Street Railway, was shot at by a t unknown person. The bullet uhistlec by the conductors head. Rev. T. T. Fishburn, president of the City School Board, gave a banquet tc the teachers in the Roanoke paolic schools at Hr tel Roanoke. Veteran officers of th e Second V ir ginia Regiment, United States Volun jeers, heid their annual meeting and banquet at the Eakleton Hotel. Stauntoa The Ettrick Cotton Mills property ha. been sold by Charles Hall Davis and Augustus Wright, of Petersburg, to the Emrcria Land and Investment Company for 100,coo. , r, Col. George C. Cabell, jr., of Danville l as resigned as a representative in the State Legislature, it is reported, to ac- ept a place as attorney for a railroad. A movement has been inaugura ed by -he Ministerial Union of Danville tc raise a fund for the. relief of destitut. md homeless Jews in Kischeneft. Three men were hurt and a fourth had x thrilling escape when the old Chesa peake And Ohio trestle at the foot ol Twelfth street, Richmond, fell with a irash. The four men were 70 feet above ground when the trestle toppled and be gan to crumble beneath them. A. G Melton leaped and caught on a telegraph pole, encircling it with his arms. pole was only about 30 feet nigh and the Injuries he sustained may prove fatal, as -c was going with such force when he grabbed the pole that he was internally injured. N.O. Childress jumped toward hc dock and landed in deep water. He was pulled out, more or less seriously lurt from the force of the fail. A mai. armed Brockwell. who went down in he crash, was slightly hurt, while the fourth man was scarcely injured at alt. Two thousand or more cnthusias.ic Ellis and half as many ladies gathered in the avaint old town to dedicate tne i-ew national home for the agdd and in digent of the order. The visitors repre sented every section of the country, ana included men whose names are house hold words in Elkdom. Mr. Joseph R. Hill. of. BJucmont Loudoun county, hrs sold his large es tate. containing about 310 acres, to Mr Tamils C. Hooe. of Washington, foi 5 l 8 occ. Mr. Hooe is a native of L om - drum. He married the daughter of tni life Nelson Dinglev. and is the business manager and secretary for Ms. Phceo Hearst. of California and Washington The trucks of a tender on a Balti more and Ohio train went awry, causing the tender to leave the traric. six mile from Lexington. Richard Donovan, tlie fireman, jumped, struck a n u p o s t anc received severe injuries. Passenger rr-H mail were carried to Lexington ir vehicles. , , .... A freight tr--- was wre-kc.d on ti e Norfolk  and Western railraad. near Bedford Ciy. A wrecking tmin w sent out from Roanoke, hut betwe-n Ironville and Mrn-vile it was wrecked Traffic was delayed six hours. Robert P. Dupriest. who for 20 vmm ba been chief car inspector at tne Nor folk and Western yards at Roanoke, wa- retired on full pav.and vvilTbe succeed by Capt. R. Frank Taylor. Francis McKenna, shot three week, go by a dr-uikeii negro on a tram neai Radford. ded from his injuries at tlie Ro-noke Hospital. , .. John ShafTer. a trusty from the penitentiary, who was sentenced from Botetourt county for burglary, lias es caped and is wearing the Governor. livery instead of the State, s. ,1 he negre was sent to the executive stables tc carry some leaves for bidding for thr horses. No one was at the stable, and spying the garments oi the Governor s co-chman. the convict quickly made a shift and disappeared. A sharp look- I out is being kept tor him. but as there is nothing particularly distinctive in the livery of the Governor it is re garded as certain that t e negro Will have little trouble in getting away. The work of dredging the Appoinat tox river from Sunken Island to Petcrs- 1 burg, six miles was begun. _ J he dredg ing is being done for the United States- Government by contract. The Roanoke Council has adopted ar  ordinance prohibiting women from en tering saloons. . . While a boiler was being lowered 1 to the hold of the United States dredg General Abbott, being built by the Pet  tersburg Iron Works at Swanns Is l land, the wire cable broke and PUas 1 ant Bonner, colored, one of the woik I men, fell overboard into the river anc I was drowned. I Carrie Bryan, a young white womai I residing in Petersburg, attempted t I"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "via located at Middlebrook. <mark>Randolph</mark> Spencer, so n o"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "via located at Middlebrook. <mark>Randolph</mark> Spencer, so n o"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2190.71, 241.47, 2336.88, 550.02], "bbox_id": "b7901b6326", "file": "AppomattoxNewspapers_1971-1973a_0641.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox County, on the 8th day of February, 1973. Randolph H. Carter, Plaintiff Against Mary Lea Carter Defendant The object of this suit is for the plaintiff to obtain a divorce from the defendant on the grounds that the parties have lived separate and apart without cohabitation and with out interruption for a period of more than two years com mencing on October 15, 1963, to date And it appearing by affidavit filed that Mary Lea Carter is not a resident of the state of Virginia, she is hereby requir ed to appear within ten days after the due publication of this order and do what is necessary to protect her interests."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "day of February, 1973. <mark>Randolph</mark> H. Carter, Plaintiff Against"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "day of February, 1973. <mark>Randolph</mark> H. Carter, Plaintiff Against"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [832.56, 727.64, 1003.81, 967.59], "bbox_id": "546a6314bc", "file": "AppomattoxNewspapers_1960-1962b_0552.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox Qounty, on the 1 st day of February, 1962. BETTY JEAN OOLLENS, FMntiff, Against NORMAN BENJAMIN COLLINS, JR., 940 Randolph Street, N. W. Washington, D. C., Defendant The object of this suit is to ob tain a divorce from the defendant on the grounds of Desertion and abandonment. And it appearing by affidavit fil ed that Nohman Benjamin Collins, Jr. is not a resident of Vir ginia, he is hereby required to ap pear within ten days after the due j.JKcation of this order and do what is necessary to protect his interests. Teste C. W. Smith, Cleric George Abbitt, Jr., p. q. Appomattox, Virginia 2-8.4tc"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLLINS, JR., 940 <mark>Randolph</mark> Street, N. W. Washington,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLLINS, JR., 940 <mark>Randolph</mark> Street, N. W. Washington,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1853.48, 669.65, 2197.91, 1091.84], "bbox_id": "6cce39dfd0", "file": "AppomattoxNewspapers_1960-1962b_0546.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir cuit Court of Appomattox County, on the 1st day of February, 1962. every act of kindness shown me BETTY JEAN COLLINS, Plaintiff, and my family. Against ltp Clifford Pugh NORMAN BENJAMIN COLjLINS, ---------------------------------- ---------- JR., 940 Randolph Street, N. W. CARD OF THANKS Washington, D. C., Defendant I wish to take this metans of The ffbjet of     expressing my sincere appreeiait- tain a divorce from the defendant ion to my relatives andl friends on the grounds of Desertion and who rememibened me in so many abandonment. nice ways during my  recent stay And it appearing by affidavit fil- in the hospital and since my re- ed that Noihman Benjamin Collins, turn home. A special thanks . to j r  nxt a resident of Vir- my neicea and nephews in Lynch- giaia, he is hereby ijequired to aip- burg who were so nice to me. ,pear within ten days after the due ltc L. J. Morris j. .olication of this order and do r.pr rw rptT.Axngs  what is necessary to protect his The family of Q. A. Goodman m 8reftS r w  ... . vishes to take this means to thank  Abbitt  Tr rt   - fnejA .  al..d neighbors for every act of  2 .g_ 4 c  kindness shown him during his re-  m  cent illness, and for the kindness and sympathy shown uis since his VIRGINIA death. Also for food, visits, cards, In the Clerks Office of the Cir- lamd the many beautiful floral de- leuit Court of Appomattox Coun- Bigms. Everything was gneaitiyap- ty, on the 14th day of February, predated.   1962. , ltc Moses Motor Co. and The Bank of Appomattox, Plaintiffs Against A.. M. Prdmtm, Mrs. Guggenheimers, CARD OF THANKS I wish to express sincere appro- Frances Primm, ciatdon to all of those who helped and .United Builders Supply intake the March of Dimes Dance a iCbmpany, 934 Sixth Street, Des a success. _ Mjoines, Iowa, Defendants , O. U. Rothgeb, Chairman The object of this suit is bo sub- ltc ject tlrereal estate o-f A. M. Primm  ---------------------  and  Mrs. Frances Primm to the TRUSTEES SALE OF REAL ES- p a r e n t of their debts, A Gen- eral Creditors suit,"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLjLINS, ---------------------------------- ---------- JR., 940 <mark>Randolph</mark> Street, N. W. CARD"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLjLINS, ---------------------------------- ---------- JR., 940 <mark>Randolph</mark> Street, N. W. CARD"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [880.79, 564.14, 1050.45, 809.39], "bbox_id": "a53b4043bb", "file": "AppomattoxNewspapers_1960-1962b_0539.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Cir. cuit Court of Appomattox County on the 1st day of February, 1962 BETTY JEAN COLLINS, Plaintiff Against NORMAN BENJAMIN COLLINS, JR., 940 Randolph Street, N. W. Washington, D. C., Defendant The object of this suit is to ob tain a divorce from the defendant on tihe grounds of Desertion and abandonment. And it appearing iby affidavit fil ed that Noihman Benjamin Collins, Jr. is not a resident of Vir ginia, he is herelby Required to ap pear within ten days after the due j .plication of this order and do what is necessary to protect his interests. Teste C. W. Smith, Clerk George Abbitt, Jr., p. q. Appomattox, Virginia 2-8-4tc"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLLINS, JR., 940 <mark>Randolph</mark> Street, N. W. Washington,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "BENJAMIN COLLINS, JR., 940 <mark>Randolph</mark> Street, N. W. Washington,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.55, 268.63, 1745.36, 663.83], "bbox_id": "0e0ee3b73f", "file": "AppomattoxNewspapers_1912-1915a_0228.pdf", "page": 1, "text": "Virginia Daughters Meet. The eighteenth annual convention of the Virginia division, United Daugh ters of the Confederacy, was held here. Nearly 500 delegatee assembled at the City Auditorium and were welcomed by Lléot.-Gov. J. Taylor EUyeon, Act ing Mayor W. H. Adams and Mrs. N. V. Randolph for -the Richmond chap ter. A feature of the session was the presentation by the Daughters of a beautiful flag to toe First Virginia Regiment in -memory of its members who died in battle. The presentation speech was made by Mrs. A. A. Camp bell, of Wy-theville, president of the Virginia division, United Daughters of the Confederacy. Major L. T. Price received the flag in behalf of the regi ment. The Daughters of the Con federacy, unanimously passed resolu tions Indorsing those passed at a re cent meeting of the Stonewall Jackson monument corporation, which provide that the Governors of Virginia and the other Southern States be requested to set apart January 21, 1914, as flag day for the Stonewall Jackson monument corporation. The Virginia Daughters are enthusiastic In the work of raising funds tor a monument to Stonewall Jackson and the work of Interesting other State divls-lons will go forward. The report of Mrs. S. A. Riddick, treas urer, showed receipts for the year ol 1,561.69 disbursements, 775.17 bal ance on hand, 776.52. The convention approved a movement, headed by Mrs. N. V. Randolph, to have a State wom ans college erected near the Uni versity of Virginia. The proposition will be presented to the State Legisla ture in January."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "and Mrs. N. V. <mark>Randolph</mark> for -the Richmond chap"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "and Mrs. N. V. <mark>Randolph</mark> for -the Richmond chap"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2072.65, 603.43, 2390.52, 715.88], "bbox_id": "543427238c", "file": "AppomattoxNewspapers_1939-1943a_0079.pdf", "page": 1, "text": "VIRGINIA CITY with Randolph Srott- Alan Hale Humphrey Bogart More Thrills than Dodge C-tyl -High scores last week For men Ed Ramsey 145 Floyd Minter 139 G. Dean 135. For ladies. Neola Smith 109 Katherine Burge 105 Beck Johnson 104 Edna Harvey 102. JAMRRSON BOWLING ALLEY, Appomattox"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "VIRGINIA CITY with <mark>Randolph</mark> Srott- Alan Hale Humphrey"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "VIRGINIA CITY with <mark>Randolph</mark> Srott- Alan Hale Humphrey"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1365.87, 1301.15, 1521.85, 1474.14], "bbox_id": "7b42305cef", "file": "TimesVirginian_1976_0187.pdf", "page": 1, "text": "Vicki Dickerson, daughter of E. W. Dickerson of Pamplto, Va. is among 37 students graduating from Virginia Bap tist Hospital School of Nursing on Sunday, May 30. Commence ment exercises will take place at Smith Auditorium at Randolph Macon Womans 5 College at 4 p.m. Presiding at the activities will be Charles S. Elliott, executive director of the hospital, with Rev. Lee Stocks, hospital chaplain, presenting the invocation."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "at Smith Auditorium at <mark>Randolph</mark> Macon Womans 5 College"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "at Smith Auditorium at <mark>Randolph</mark> Macon Womans 5 College"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.9, 615.49, 1778.52, 625.99], "bbox_id": "7c7ddf7a26", "file": "AppomattoxNewspapers_1949-1952a_0422.pdf", "page": 1, "text": "Vice-president  Randolph Martin"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Vice-president  <mark>Randolph</mark> Martin"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Vice-president  <mark>Randolph</mark> Martin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1648.3, 891.29, 1816.36, 1168.89], "bbox_id": "b9308ed495", "file": "AppomattoxNewspapers_1949-1952a_0556.pdf", "page": 1, "text": "veteran team returning Appomattox High School hopes to have another very good season. The schedule is as follows April 1, Dan River there April 4, Dan River here April 8, Madison Heights there April 12, V. E. S. there April 16, William Campbell High School there April 18, Brookville there April 22,South Bosotn there April 24, Randolph Henry there April 29, Brookville here May 2 William Campbell High School here May 6, South Boston here May 9 Madison Heights here May 14, Har grave Military Academy there, May 15, Randolph Henry High School there May 20, Hargrave Military Academy here May 23, Bedford there tent.. There will be three night games this year plus a twi-light game with Hargrave Military Academy here. Season tickets will be sold at 2.50 for seven home games. The ad- mssion price will be 50 cents for adult and 25 cents for school chil dren for all home games."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Bosotn there April 24, <mark>Randolph</mark> Henry there April 29,"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Bosotn there April 24, <mark>Randolph</mark> Henry there April 29,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2088.25, 399.29, 2251.31, 1276.75], "bbox_id": "b85ac76c6d", "file": "AppomattoxNewspapers_1892-1898a_0126.pdf", "page": 1, "text": "Very Good F or New York, B u t Chicago Takes the Palm . By the way, said the drummer as he took a cigar out of his case and reached for a match, this American nation has lost heaps of money by not knowing a good thing when it was crawling abound in the grass. To what do you refer ? asked the man who had been sharpening his knife on his bootleg. To this cigar case. Latest fad outmade of snakeskin and com bines beauty and wear. We might mve been using that sort of material for the last 200 years, bnt didnt know a good thing. Are yon sure its snakeskin ? Of course. Havent you been in New York lately? No. Place on Gland street where they make em while you ait. Not only that, but you can piok out your own snake. The day I went in they had abont 50 of them in a cage, and I was told to seleot the one I fancied most. I made my choice, and he was taken out, his skin slipped off, and in about 20 minutes I had this Case. Very convenient dont you know, and its a strictly New York idea.  I think we can beat it in Chicago, however, said the other man as he changed his knife to the other boot- leg Anything new there ? You bet I Theres a restaurant on State street where they serve oxtail soup at 10 cents a plate, and they bring in the ox and cat his tail off right before yonr eyes. In that way there can be no deception. They use aliont 1,500 tails per day. ! Must make a big lot of bobtailed oxen out yonr way ? Oh, it does.  And a bobtailed ox is not a thing of beauty. By no means, not until he is fixed. How fixed? Why, as fast- as they leave the restaurant they are taken over to a place on Randolph street and de horned. And then ? And then they are sent east and sold as Jersey cows. Yon get yonr sonp, your horns, yonr fad and yonr Jersey cow. All verysimple and very convenient, yon know, and iff strictly a Chicago idea!  The man with the snakeskin oigar case sat and thought for a while with a very serions expression of counte nance and then suddenly said Ive tried and tried, but its no use, and I might as well give it up. Whats that? Lying! The other fallow is al ways from Chicago and always heats me out of sight!Detroit Free Press."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "to a place on <mark>Randolph</mark> street and de horned."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "to a place on <mark>Randolph</mark> street and de horned."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1913.32, 1255.51, 2074.1, 1565.05], "bbox_id": "e2097750f6", "file": "AppomattoxNewspapers_1892-1898a_0060.pdf", "page": 1, "text": "VERY DESPONDENT. Mr. Marshall had of late years been very despondent. This was due to unsuccessful business ven tures and family afflictions. In 1880 one of his sons, Albert, shot and killed Mmself, Ms act having, it is supposed, been caused by a love affair. About three years ago an other son, James, fell from a horse in Florida and was killed. Mr. Marshall was fifty-eight years of age, was a man of very quiet de meanor and strictly temperate. He leaves a wife and five children, Col onel Thomas R. Marshall, command ant of cadets at the Virginia Mili tary Institute Messrs. William P., Randolph, Robert and Miss Sally Marshall. Mrs. Marshall was in Lexington at the time of her husbands death visiting her son, Colonel Marshall. She was telegraphed for and with Colonel Marshall arrived here Friday Mght."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "Institute Messrs. William P., <mark>Randolph</mark>, Robert and Miss Sally"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "Institute Messrs. William P., <mark>Randolph</mark>, Robert and Miss Sally"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1413.86, 1047.03, 1566.42, 1132.18], "bbox_id": "006af88d8f", "file": "AppomattoxNewspapers_1955-1957a_0106.pdf", "page": 1, "text": "Veek-end visitors in the home of Rev. and Mrs. J. H. Anderson e Mr. and Mrs. H. G. Randolph, and Mrs. P. J. Rich, of Durham, C. ilrs. Smith, of Suffolk is visiting son-in-law and daughter, Mr. 1 Mrs, Bobby Lucado."}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "and Mrs. H. G. <mark>Randolph</mark>, and Mrs. P. J."}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "and Mrs. H. G. <mark>Randolph</mark>, and Mrs. P. J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [743.75, 817.24, 912.89, 986.83], "bbox_id": "4616cfb890", "file": "AppomattoxNewspapers_1955-1957a_0188.pdf", "page": 1, "text": "VALUABLE BUSINESS BUILD ING and Lot in Town of Appomat tox For Sale. Having plans for new Church Building in Appomat tox, The Bible Baptist Church will be glad to entertain offers to pur chase the building and lot now being used by the congregation. Located on the corner of Route 46-0 and Bandana St., on lot approximately 100 feet square, this property was formerly a business site and could be easily adapted to business use. Contact Rev. Randolph Hite, Spout Spring, . or Aubrey F. Johnson, Treasurer., Appomattox, Phone 4602. 5-24-2tc"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "business use. Contact Rev. <mark>Randolph</mark> Hite, Spout Spring, . or"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "business use. Contact Rev. <mark>Randolph</mark> Hite, Spout Spring, . or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [732.92, 494.8, 900.96, 662.49], "bbox_id": "1bf4a750f6", "file": "AppomattoxNewspapers_1955-1957a_0195.pdf", "page": 1, "text": "VALUABLE BUSINESS BUILD ING and Lot in Town of Appomat tox For Sale. Having plans for a new Church Building in Appomat tox, The Bible Baptist Church will be glad to entertain offers to pur chase the building and lot now being used by the congregation. Located on the corner of Route 460 and Bandana St., on lot approximately 100 feet square, this .property was formerly a business site and could be easily adapted to business use. Contact Rev. Randolph Hite, Spout Spring, or Aubrey F. Johnson, Treasurer, Appomattox, Phone 4602. 5-24-2tc"}, "highlight": {"text": {"matched_tokens": ["Randolph"], "snippet": "business use. Contact Rev. <mark>Randolph</mark> Hite, Spout Spring, or"}}, "highlights": [{"field": "text", "matched_tokens": ["Randolph"], "snippet": "business use. Contact Rev. <mark>Randolph</mark> Hite, Spout Spring, or"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
