{"document": {"bbox": [2168.64, 281.0, 2363.55, 330.85], "bbox_id": "d259864b95", "file": "AppomattoxNewspapers_1926-1933a_0415.pdf", "page": 1, "text": "u i? I w s o n overseer oi poor a o Warding overseer of poor b G. Harvey overseer of poor Robert F. Hutcheson judge County Farm Agents-white and colored."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Harvey overseer of poor <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> judge County Farm Agents-white"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Harvey overseer of poor <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> judge County Farm Agents-white"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2341.18, 599.59, 2509.98, 849.34], "bbox_id": "f269a11eb2", "file": "AppomattoxNewspapers_1939-1943a_0069.pdf", "page": 1, "text": "Thic April term of the circuit court of Apipmat1X county will convene here Monday at 1000 A.M. This will be the first term of the local circuit! court presided over by Judge W. Flood, recently appointed by the General Assembly to serve the unexpired term of the. late Judge Robert F. Hutcheson. A large attend ance is expected for the opening sessions Monday. The criminal docket for the term will be fairly light. Indications are that there will be only three In dictments, and that the term can be completed in two days. Judge N. S. turn bail, of Victoria, Tias been de signated 0 preside hi certain chan cery matters in which Judge Flood was an attorney prior to his eleva tion to the bench. He is expected to come here for this purpose Tues day or later Iri the session. Trial Justice L. F. Terguson .will hold court here Saturday to hear a case resulting from a recent auto mobile accident. . . -."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "of the. late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>. A large attend ance"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "of the. late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>. A large attend ance"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2055.57, 547.95, 2223.92, 773.25], "bbox_id": "f515a85811", "file": "AppomattoxNewspapers_1936-1939a_0030.pdf", "page": 1, "text": "The October term of the circuit court of Appomattox county, with Judge Robert F. Hutcheson presid ing, will convene here Monday, at 10 A.M . The probability is that there will be only three indictments, and that the matters to come before the court can be disposed of in two days. Nevertheless the usual large attendance at court sessions here is expected. For the first time in a decade, prisoners confined in the county jail made good an escape last week-end. Three negro prisoners opened a hole in the brick wall opposite their se cond flood cells early Friday morn ing and lowered themselves down a blanket-ladder to freedom. They pried the bricks loose during the night, without awakening a fourth prisoner in the same cell. Saturday afternoon one of the ea-"}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Appomattox county, with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presid ing, will convene"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Appomattox county, with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presid ing, will convene"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1500.07, 931.7, 2404.55, 1261.65], "bbox_id": "fa274dcf24", "file": "AppomattoxNewspapers_1908-1909a_0379.pdf", "page": 1, "text": "Mrs. Martha A. Clark Mrs. M. A. Clark, a lifelong resident of Pamplin, died at her home there Monday after a lingering illhess. She is sur- many pleasant and helpful memories of my fellow-student of former years. G eo . B raxton T aylor . CHORUS GIRLS CAN EAT AGAIN is reported to be I one of two winners in the flag contest of the schools of that city., Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward County, has designate ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of- Frank -W. Gilliam, game warden, on Sun day, April 28_. Pegram will remain in th Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "on her achievement. Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, of the Circuit Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "on her achievement. Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, of the Circuit Court"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.64, 1023.31, 1669.79, 1282.95], "bbox_id": "96536c84bd", "file": "AppomattoxNewspapers_1926-1933a_0379.pdf", "page": 1, "text": "Miss Ann Abbitt, the young daughter of Dr. J. B. Abbitt, of Norfolk, Va., is reported to be one of two winners in the flag contest of the schools of that city. Miss Ann has many young friends here who congratulate her on her achievement. Judge Robert F. Hutcheson, of the Circuit Court of Prince Edward COunty, has designat ed May 30 as a special term of court to try Ernest Pegram, colored, of the county for the alleged murder of. Frank -W. Gilliam, game warden, on Sun day, April 28. Pegram will remain in the Henrico County jail, where he was taken soon after the murder, until the day of his trial."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "on her achievement. Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, of the Circuit Court"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "on her achievement. Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, of the Circuit Court"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.83, 635.57, 1743.31, 816.08], "bbox_id": "d3af3b804a", "file": "AppomattoxNewspapers_1912-1915a_0069.pdf", "page": 1, "text": "Masons Elect Officers. Eureka Mills.At a stated commu nication of St. Johns Masonic Lodge, the following officers were elected for the ensuing year Worshipful Master, Lee W. Morton C. A. Hoy, senior warden Robert F. Hutcheson, junior warden J. C. Carrington, treasurer E. E. Gibbs, secretary Thomas J. Watkins, senior deacon C. M. Hutch eson, junior deacon J. T. Dunnavant, tiler W. P. Ingram, and Gibbs Rice, stewards Revs. Leonard Cox, R. L. McNair, A. B. Sharpe and G. H. Leep- er, chaplains. J. C. Carrington, T. J. Watkins and T. Roy Adams were elected alternates to the Grand Lodge. District Deputy Grand Master W. G. Williams was recommended for reap pointment."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "A. Hoy, senior warden <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, junior warden J. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "A. Hoy, senior warden <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>, junior warden J. C."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1278.5, 630.89, 1854.7, 837.37], "bbox_id": "c2a8335a0d", "file": "AppomattoxNewspapers_1939-1943a_0037.pdf", "page": 1, "text": "Joel W. Flood, Appomattox at torney, was nominated by .a Demo cratic caucus of the Virginia General Assembly Monday afternoon to fill out the unexpired term of the late Robert F . Hutcheson as Judge of the circuit court of the fifth judicial circuit. This nomination will .be confirmed by the legislature next week, and p .   j , .  , t  i _ j u s Harwood went on a trip to  Mr. Flood will qualify as soon as Every Chick w e tell . hatched from Vir.ma State  week. Shortly? friends in his resignation as assistant district fiT d J a te h e r v         S  t e x received a coPy of a ! a tto rn e y fo r the Federal court of the TJ jpfnews sheet, and across the Special prices during January and February. Tho best one front page was a great, this year to start Chicks for Broilers and Fryers. Earljfln that Bob Hubbard hao won save yon money and insure delivery of your Chicks w ip at the race track, and an- wa-nit them. Write or phone today for full information.! tone that Sunny Harwood R ailed a herring for all of S uri Trick of it was that that HHr Miami news sheet fixes Quality Hatchery q"}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "term of the late <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> as Judge of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "term of the late <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> as Judge of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2068.79, 1580.09, 2240.36, 1617.94], "bbox_id": "19397752e3", "file": "AppomattoxNewspapers_1939-1943a_0033.pdf", "page": 1, "text": "j A large number of Appomattox people attended the funeral of the I late Judge Robert F. Hutcheson at Charlotte Court House Saturday."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "j A large number of Appomattox people attended the funeral of the I late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> at Charlotte Court House Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "j A large number of Appomattox people attended the funeral of the I late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> at Charlotte Court House Saturday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [717.89, 399.42, 889.67, 621.82], "bbox_id": "e077e09282", "file": "AppomattoxNewspapers_1939-1943a_0220.pdf", "page": 1, "text": "Ivy Holland and Lewis McDear- man attended Ruritan Club conven tion in Richmond. Farmers National Bank entertains shareholders at dinner. Professor John Smelts signed to succeed Charles A. Hilt, resigned, I on local high school faculty. Rev. O.G. Burnette accepts call to Baptist field of churches in Halt- fax county. Walton S. Tweedy, 63, died Jan uary 10th. Judge Robert F . Hutcheson died January 12th. Dr. J .J . Wicker supplied pulpit at Liberty church. Senator Chas. T . Moses attends sessions of the General Assembly in Richmond."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Jan uary 10th. Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> died January 12th. Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Jan uary 10th. Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> died January 12th. Dr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2402.63, 1006.95, 2584.76, 1272.35], "bbox_id": "78072909b3", "file": "AppomattoxNewspapers_1939-1943a_0033.pdf", "page": 1, "text": "He is survived by hit widow, the former Miss Lucy EgRieoni a son, Robert F . Hutcheson,. ?  , an attor ney, at Emporia two daughters, Mary Ligon, of Fieldale and Fanny Hutcheson  a sister, Mrs. F , C. Campbell, of El Paso, Trims and by four brotherss John RV Hutcheson, director of the State Agricultural Extension Division, Blacksburg T. B. Hutcheson, head.of the V .P .I. Agronomy Departlnent j H , E . Hutch- son, of Gloucester Court House, and Rev. I l Q. Hutcheson -of Mullins, S. C.  v- . 7 s- He was  learned jtalge and en deared himself to the people of his circuit his legal- knowledge being pnuBUPU omv uy iui uciovu  land gentlemanly dlgnJbjii, Guilty and  innocent alike faced. his court with faith in the man who preaided . , on the bench. Attorney and court  attendants learned to love him nd the five houfitiea fee ferved were saddened by his untimely passing. -  -   -- . . v g ... A,. f  . ...S SPOUT SPRING SEMtOR"}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Lucy EgRieoni a son, <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>,. ?  , an attor ney, at"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Lucy EgRieoni a son, <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>,. ?  , an attor ney, at"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2261.74, 460.54, 2438.86, 1116.33], "bbox_id": "e68e313c74", "file": "AppomattoxNewspapers_1939-1943a_0090.pdf", "page": 1, "text": "F. HUTCHESONi R. O. Garrett Esquire presented to the court a copy of the proceedings of a public meetung of the Bar and officers of the court, and oither citi zens being present, held at Cumber land Court House on this 23rd day of April, 1940, relativv to toe death of Judge Robert F . Hutcheson, and on his motio,, and pursuant to the request of said meeting as therein set out, it is ordered mat the said proceedings be spread at large upon the records of this courts wnich was accordingly done as follows Hon. Joel W. Flood was called to the chair and Lewis Crawley ,waa chosen secretary. j At the January Term, 19, -of this court, R. O. Garrett, E . H. Carnage, A. L. Putts, Jr., and Wn. M. smith, were appointed a coni nuttee to draft suitable resolutions m memory of the Jtlon. Robert F. Hutcheson and after meeting of said committee the following resolutions were entered at is appropriate and proper whan a comrade has fallen from our ranks that toe survivors should take notice thereof, and_wi reverence toward our Heavenly Father who givoth and wno taketh .way, to commune together in memorial service and whereas we have now assembled to gether to pay our tribute of affec tion and honor to the name of the late Robert F. Hutcheson, Judge of the Fifth Judicial Circuit of Vir ginia, who died m January, 194Q, and to bear witness to this county of which be was the beloved Judge THEREFORE BE IT REdOLVKD That we declare our profound grief and sorrow teat our cherished friend and worthy judge has been cut off i tiie prime of life. lo his strong natural mind had been added the attainments of liberal education, cultured associations and inteilerent researches, added to a storehouse of knowledge. Be i further resolved tiiat he was fearless, upright, accomplished, just, learned and impartial judge, of the highest sense of integrity. Thaf a copy of these resolutions be sent to the family of Judge Hutch eson, and copies be sent to the press for publication, and a h nrasd upon the records o f the Circuit Court of Cumberland County sad that E . H. Gamag be appointed a committee to present these resolu tions to the Circuit Court of Cum berland, with the request that they be spread Upon the records of the short. Enter- Joel W. Flood, Judge Copy-Teete- Lewis Crawley. Clerk."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "toe death of Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, and on his motio,,"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "toe death of Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, and on his motio,,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2261.27, 458.69, 2439.11, 1115.41], "bbox_id": "49af4ecca2", "file": "AppomattoxNewspapers_1939-1943a_0089.pdf", "page": 1, "text": "F. HUTCHESON R. O. Garrett Esquire presented to the court a copy of the proceedings of a public meeting of the Bar and officers of the court, and other citi zens being present, held at Cumber land Court House on this 23rd day of April, 1940, relativ. to the death of Judge Robert F , Hutcheson, and on his motion and pursuant to the request of said meeting as therein set out, it is ordered tnat the said proceedings be spread at large upon the records of tha court, which was ! accordingly done as follows Hon. Joel W. Flood was called to the chair and Lewis Crawley was chosen secretary. I At the January Term, 1940, of thiB court, R. O. Garrett, E. H, G a mage, A. L. Putts, Jr., and W at M. Smith, were appointed a com mittee to -draft suitable resolutions in memory of the non. Robert F . Hutcheson and after meeting of eaid committee the following resolutions were entered mb ta appropriate and proper when a comrade has fallen from our ranks that too survivors should take notice thereof,- and_ wr reverence toward our Heavenly Father who givoth and who talusth .way, to commune together in memorial service and whereas we have no.w assembled to gether to pay our tribute of affec tion and honor to the namr, of the late Robert F. Hutcheson, Judge of the Fifth Judicial Circuit of Vir ginia, wno died m January, 194Q, and to bear witness to this county of which he was the beloved Judges THEREFORE BE IT REdOLVED That we declare our profound grief and sorrow coat our cherished friend and worthy judge haa been cut off in toe prime of life. Tio his strong natural mind had -been added the attainmems of liberal education, cultured associations and intelligent researches, added to a I storehouse of knowledge. Be i further resolved tost he was fearless, upright, accomplished, Just, learned and impartial judge, of tiie highest sense of integrity, Tha a copy of these resolutions be sent to the family of Judge Hutch eson, and copies be sent to toe press for publication, and a copy be spread upon the records o f the Circuit Court of Cumberland. County and that E . H. G a mega be appointed a committee to present the resolu tions to the Circuit Court of Cum berland, with tha request that they be spread upon the records of the coort. n_ i  i ur JiUiiM iuutei- ouvi n   wU, v  Copy-Teete- Lewis Crawley, Clerk."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark> <mark>F</mark> , <mark>Hutcheson</mark>, and on his motion"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark> <mark>F</mark> , <mark>Hutcheson</mark>, and on his motion"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2181.29, 460.11, 2352.45, 1117.97], "bbox_id": "0e996a2a8a", "file": "AppomattoxNewspapers_1939-1943a_0091.pdf", "page": 1, "text": "F. HUTCHESON R. O. Garrett Esquire presented to the court a copy of the proceedings of a public meeting of the Bar and officers of the court, and cither citi zens being present, held at Cumber land Court House on this 23rd day cf April, 1940, relative, to the death of Judge Robert F . Hutcheson, and on his motio,, and pursuant to the request of said meeting as therein set out, it is ordered that the said proceedings be spread at large upon the records of this courts which was accordingly done as follows Hon. Joel W. Flood was called to the chair and Letwis Crawley was chosen secretary. At the January Term, 1940, of this court, R. O. Garrett, E. H. G a mage, A. L. Putt, Jr., and Wm. M. Smith, were appointed a com mittee to draft suitable resolutions m memory of the Hon. Robert F . Hutcheson and after meeting of said committee the following resolutions were entered xt is appropriate and proper when a comrade has fallen from our tanka that toe survivors should take notice thereof, and_wnn reverence toward our Heavenly Father who givath and wno taketh .way, to commune together in memorial service and whereas we have now assembled to gether to pay our tribute of a.fec- tttn and honor to the name of the late Robert F . Hutcheson, Judge of the Fifth Judicial Circuit of Vir ginia, who died m January, 194Q, and to bear witness to this county of which he was the beloved Judge THEREFORE BE IT REbOLVKD Thai we declare our profound grief and sorrow boat our cherished friend and worthy judge has been cut off in the prime of life. To his strong natural mind had been added the attainmenia of liberal education, cultured associations and intelligent researches, added to a storehouse of knowledge. Be i further resolved that he was fearless, upright, accomplished, just, learned and impartial judge, of i he highest sense of integrity, The a copy of these resolutions be sent to the family of Judge Hutch eson, and copies be sent to the press for publication, and a copy be spread upon the records o f the Circuit Court of Cumberland County aad that E. H. Gamaga be appointed a committee to present these resolu tions to the Circuit Court of Cum berland, with the request that they be spread upon the records of the coort. Enter- Joel W. Flood, Judge Copy-Teste- Lewis Crawley, Clerk."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, and on his motio,,"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, and on his motio,,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [396.26, 579.17, 568.81, 687.74], "bbox_id": "3166219ef7", "file": "AppomattoxNewspapers_1939-1943a_0009.pdf", "page": 1, "text": "Every person in this section of Virginia will be genuinely grieved  4 h. r of the illness of our beloved 1 circuit court Judge, Hori. Robert F. Hutcheson. Possessed of those be- letarng traits so happily associated ir.-ttb a true Virginia gentleman, our ijude is a man whose frienda are Tloeend and hen-rs theexalted office ! i g hoids. We wish for him a speedy j return to complete health.  1  . i . . . n ."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "circuit court Judge, Hori. <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>. Possessed of those be-"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "circuit court Judge, Hori. <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark>. Possessed of those be-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1887.1, 848.09, 2060.64, 1267.29], "bbox_id": "4c7cc5fb9e", "file": "AppomattoxNewspapers_1939-1943a_0033.pdf", "page": 1, "text": "Col , Joel W. Flood, of Appo mattox, has received wide endorse ment for the judicial vacancy caus ed by the death of Judge Robert. F, Hutcheson. A causcus of the Democrats in the General Assembly is scheduled to be held next Tuesday to nominate a candidate to succeed udge Hutcheson. Col. Flood has received the en dorsement and active support of the bar associations o f Appomattox, Buckingham and Cumberland coun ties, and bas been urged to become a candidate for the judgeship by friends from all parts of the State. State Senator Charles T . Moses, who is actively supporting Col. Flood, stated this week that he had been highly gratified at the pledges from mëmberS of the General Assembly to support Col. Flood and that bis nomination for the vacancy on the first ballot was very probable, R . E . Garland, of Farmville, and J . Kent Early, attorneys of Farm villeand Charlotte Court House res pectively, have also been mentioned in connection with the vacancy.Mr. Garland is 40 years of age and has been a member of the Prince Edward bar for 16 years. Mr. Early is a former commonwealths attorney of Charlotte coun and unsuccessful ly opposed State Senator Moaes for the state senate in 1934. Col. Flood has outstanding qual- ftcations fitting him for the circuit bench. He is an alumnus of Wash ington and Lee University and the U, of Virginia, and took a law course at Oxford University, London. He bagan the practice of law in 1917, and was Commonwealths Attorney"}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark>. <mark>F</mark>, <mark>Hutcheson</mark>. A causcus of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "the death of Judge <mark>Robert</mark>. <mark>F</mark>, <mark>Hutcheson</mark>. A causcus of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1717.69, 1107.16, 1887.19, 1311.8], "bbox_id": "25cc477daa", "file": "AppomattoxNewspapers_1936-1939a_0039.pdf", "page": 1, "text": "Circuit Court Judge Robert F . Hutcheson convicted Rev. Joel J. Allen Thursday of last week on charges of dog poisoning and im posed a fine of 50 and. costs, the identical penalty from which the minister appealed in. trial justice court. ffhe Commopewalth sent 49 wit nesses to the stand in support of its contention the minister set out poison to kill dogs which came upon his property. Mr. Allen, who was on the stand nearly an hour, denied that he put out poison although he admitted having killed a few which he said prowled around his home Only three other defense witnesses were called, two pt whom testified that the defendant had re turned their dogs after He had found them on his property."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Circuit Court Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> convicted Rev. Joel J."}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "Circuit Court Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark> convicted Rev. Joel J."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2068.55, 326.2, 2239.51, 424.75], "bbox_id": "8487540daf", "file": "AppomattoxNewspapers_1936-1939a_0038.pdf", "page": 1, "text": "Buckinghamjpt 9.- It was de cided by unanimSto vote of the Buck ingham county board of supervisors last week that a reassessment of real estate in the county was nec essary and that Judge Robert F . Hutcheson, of the circuit court, be asked to appoint land accqssors, j It is expected that this will be done during the current term of the court."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "essary and that Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, of the circuit court,"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "essary and that Judge <mark>Robert</mark> <mark>F</mark> . <mark>Hutcheson</mark>, of the circuit court,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1594.78, 753.03, 1756.21, 1176.35], "bbox_id": "00f538dbce", "file": "AppomattoxNewspapers_1926-1933a_0566.pdf", "page": 1, "text": "Buckingham, March 20,- Special to the Times-Vir- ginianThe criminal docket jf the Circuit Court which con vened last Tuesday with Judge Robert F. Hutcheson presiding, vas one of the smallest in re lent months. Judge Hutche- ion in directing the grand jury 2 ommendod the county upon its law-abidingness. Sweetfield Murphy, who pled not guilty to the charge of stealing and butchering a calf in the town of Dillwyn, drew one year in the state pen al institution in Richmond. W. P. Wood, another defendant in the same action, was an nounced in a Government Hos pital for inebreecy and his case was continued.  The rest of Tuesday w as taken up with civil matters, with the Receiv er of the defunct First Nation al Bank of Dillwyn getting a number of judgements against stockholders of the closed bank. Jn the afternoon Mes srs. Pitts and Boatwright rep resented the plaintiff in t h e suit- in chancery brought by Walter Howard Toney versus Margaret Fountain et als. The defendants were represented by Colonel Aubrey Strode and Julian Martin. The evidence was submitted to t h e court without having the deposi tions read. The court will ren der a decision at a later date."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "last Tuesday with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presiding, vas one of"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "last Tuesday with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presiding, vas one of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1592.87, 729.76, 1753.54, 1152.63], "bbox_id": "58593ffb0b", "file": "AppomattoxNewspapers_1908-1909a_0566.pdf", "page": 1, "text": "Buckingham, March 20- Special to the Times-Vir- ginianThe criminal docket jf the Circuit Court which con vened last Tuesday with Judge Robert F. Hutcheson presiding, vas one of the smallest in re- jent months. Judge Hutch- on in directing the grand jury commended the county upon its law-abidingness. Sweetfield Murphy, who pled not guilty to the charge of stealing and butchering a calf in the town of Dillwyn, drew one year in the state pen al institution in Richmond. W. P. Wood, another defendant in the same action, was an nounced in a Government Hos pital for inebreecy and his case was continued.  The rest of Tuesday w as taken up with civil matters, with the Receiv er of the defunct First Nation al Bank of Dillwyn getting a number of judgements against stockholders of the closed bank. in the afternoon Mes srs. Pitts and Boatwright rep resented the plaintiff in th e suit in chancery brought by Walter Howard Toney Versus Margaret Fountain et als. The defendants wererepresented by Colonel Aubrey Strode and Julian Martin. The evidence was submitted to th e court without having the deposi tions read. The court will ren der a decision at a later date."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "last Tuesday with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presiding, vas one of"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "last Tuesday with Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> presiding, vas one of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2201.75, 827.86, 2369.34, 865.56], "bbox_id": "291ab25cc3", "file": "AppomattoxNewspapers_1939-1943a_0036.pdf", "page": 1, "text": "A large number of Appomattox people attended the funeral of the late Judge Robert F. Hutcheson at Charlotte Court House Saturday."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "A large number of Appomattox people attended the funeral of the late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> at Charlotte Court House Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "A large number of Appomattox people attended the funeral of the late Judge <mark>Robert</mark> <mark>F</mark>. <mark>Hutcheson</mark> at Charlotte Court House Saturday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.91, 893.0, 1975.24, 1182.95], "bbox_id": "16277207f1", "file": "AppomattoxNewspapers_1908-1909a_0488.pdf", "page": 1, "text": "to celebrate the centennial in dersen. She lurtner nas a originai church, those at- good group picture of General tendi are requested to bnng Lee s staff, which is for sale. thejr own iunch or arrange- ments will be made for same to be on sale on.the grounds. I A splendid program is being arranged. J. K-- Megginson, -- ------- , clerk of the association, re- Judge Robert A. Hutcheson  that Dr f . W. Boat- has just entered an order re- wrjght, president of the ,Uni- appointing G. M. Rogers as verjty Gf Richmond, will trial justice f o r Buckingham 8peac Friday, and other prom- county, for a term of four jnen Baptists have been pe- years. P. H. Moss, former cured  present the story ot substitute trial justice, has re- one.hundred years of Baptist signed and the judge has ap- jjjoory in this section and in pointed E. B. Glover of this the state place, as his successor. . I __ Ther Judge has --also fixed j Buckingham court house as the . place for the trial of all cases oefore the Trial Justice court. Heretofore the cases have been heard at Dillwyn on Tuesdays and Buckingham on days of each week."}, "highlight": {"text": {"matched_tokens": ["Robert", "Hutcheson", "f"], "snippet": "the association, re- Judge <mark>Robert</mark> A. <mark>Hutcheson</mark>  that Dr <mark>f</mark> . W. Boat- has just"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "Hutcheson", "f"], "snippet": "the association, re- Judge <mark>Robert</mark> A. <mark>Hutcheson</mark>  that Dr <mark>f</mark> . W. Boat- has just"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2396.87, 666.65, 2576.34, 1003.05], "bbox_id": "a1c3850b66", "file": "AppomattoxNewspapers_1939-1943a_0033.pdf", "page": 1, "text": "Judge Robert Francis Hutcheson, 62, tof the Fifth Judicial Circuit, embracing the counties of Charlotte, Prince Edwhrdv  umbeftand, Buck ingham and Appomattebt, died, last Friday morniingiat Ihis borne at Charlotte Court House, after an Ill ness of one ntonth. Funeral services for th beloved jurist were hold Saturday afternoon at 280 at the Charlotte Court House Presbyterian church, Burial wm in the churchyard. . II  y._ Judge Hutcheson became ill Dec ember 21 during Jhe December tans of court at farmville. After treat ment at the Southaide  hospital at Farmville, he returned to Charlotte Court Houae, IThe esteemed Judge hraa born in 1878, the son of Robert F. and Mary Barkadble Hutcheson. Re gradua ted from Hampden-Sydhey College in 1898. After teaching school for several yean, ha studied law at Washington and Lee University. He began the practice of hit profession at Charlotte Court House, Be sef- , ved as a member of the Houseof Delegatee for one term, j.918-20.He was appointed judge o f the Fifth Judicial Circuit in May, 1-929, by the late Governor E. Lee Trinkle, suc ceeding the late Judge George J . Hundley."}, "highlight": {"text": {"matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "1878, the son of <mark>Robert</mark> <mark>F</mark>. and Mary Barkadble <mark>Hutcheson</mark>. Re gradua ted from"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F", "Hutcheson"], "snippet": "1878, the son of <mark>Robert</mark> <mark>F</mark>. and Mary Barkadble <mark>Hutcheson</mark>. Re gradua ted from"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [467.31, 749.31, 789.95, 1104.44], "bbox_id": "25fe909f59", "file": "AppomattoxNewspapers_1908-1909a_0487.pdf", "page": 1, "text": "Mrs. C. A. Anderson, ofj near Vera, this week kindly brought to the Times-Vir- giniair office several very rare day old papers and booklets, eluded in the group was an manac published in 1803, now . ... ame 129 years old. The almanac ation was held in this same  had a number of notations still church en 1832 and ? sPec. legible. She also had a copy centennial program is being of the Lynchburg Republican, observed this year in connec published by the father of tion with the record of a Carter Glass, the present pub- even century of service. Due to the fact that the as sociation met with the same church two years ago ,and the return this year was in order to celebrate the centennial in the original church those at tending are requested to bring their own lunch or arrange- ments will be made fori same 1 to be on sale on the grounds. 1 . a splendid program is being arranged. J. .K. Megginson, clerk of the association, re- Judge Robert A. Hutcheson te that Dr. F. W. Boat- has just entered an order re- wijght, president of the Jni- appointing G. M. Rogers as versity 0f  Richmond, will trial justice f o r Buckingham 3peak Friday, and other prom county, for a term of four inent Baptists have been pe years. P. H. Moss, former cured to preSent the story o substitute trial justice, has re- pne.hundred years of Baptis signed and the judge has ap- history in this section and n"}, "highlight": {"text": {"matched_tokens": ["Robert", "Hutcheson", "F"], "snippet": "the association, re- Judge <mark>Robert</mark> A. <mark>Hutcheson</mark> te that Dr. <mark>F</mark>. W. Boat- has just"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "Hutcheson", "F"], "snippet": "the association, re- Judge <mark>Robert</mark> A. <mark>Hutcheson</mark> te that Dr. <mark>F</mark>. W. Boat- has just"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1374.25, 565.01, 1646.5, 756.93], "bbox_id": "93a19a3363", "file": "AppomattoxNewspapers_1939-1943a_0093.pdf", "page": 1, "text": "Judge Joel W. Flood, of the Fifth judicial circuit, has entered an ord- of the circuit court of Charlotte co unty, designating Saturday, May 11 ati 11 oclock A. M. as the day and hour on which memorial exercises will be held in memory of the late Judge Robert F. Hutchesoi, who was judge of the said circuit at the 1 time of his death on January 12. j _ ______ ___ The Charlotte County Bar Asso- jelt that his regular cation has charge of the memorial at night have exercises.. Resoluiioin will be pre sented i the court b y J . Kent  Early, of Charlotte C .H .. law part-f- nier of Judio Hutcheson at the time he was elected to the bench, and it is understood that the bar associations of Appomattox, BucL- ingha.m Prince Ed ,varc and Cumb- erand counties, which with Char-"}, "highlight": {"text": {"matched_tokens": ["Robert", "F"], "snippet": "of the late Judge <mark>Robert</mark> <mark>F</mark>. Hutchesoi, who was judge"}}, "highlights": [{"field": "text", "matched_tokens": ["Robert", "F"], "snippet": "of the late Judge <mark>Robert</mark> <mark>F</mark>. Hutchesoi, who was judge"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.8, 378.19, 1986.78, 691.63], "bbox_id": "119edfb997", "file": "AppomattoxNewspapers_1926-1933a_0320.pdf", "page": 1, "text": "Judge Hutcheson will hold an adjourned session of his court here beginning Monday the 16th. The following men have been  summoned as jurymen Civil JuryM. L. Garrett, R. A. Anderson, E. L. Smith, C. J. Harding, E. Larkin Har vey, Clayton T. Drinkard, W. The District B. Y. P. U. Ral-D. Paris, J. L. Burkey and ly will be held at Evergreen Robert L. Gilbert. Baptist Church Sunday, Dec. Criminal Jury  Jesse D. 15, from 2 to 4 p. m. A very Davidson, Rufus J. Burnett, G. interesting program is planned ID. Gordon, E. L. Chick, R. J. Among the speakers are Rev. jPaulett, W. D. Patterson, G. W. M. Thompson, of Appomat-lH. Ranson, M. A. Stratton, C. tox Rev. E. L. Larsen, of Rice R. Banton, H. A. Turnes, R. M. and Rev. T. E. Goad, of Ever-1 Tyree, S. L. Scruggs, Thos. U. green. We hope to have a I Connor, F. T. Cawthorn, J. E. good attendance from all the!Jordan, Ed L. Layne, Rev. R churches present, and to make E. Redding, E. LeRoy Smith, plans for a better Rally nextW. S. Tweedy, H. E. Smith, quarter."}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "Judge <mark>Hutcheson</mark> will hold an adjourned"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "Judge <mark>Hutcheson</mark> will hold an adjourned"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1769.05, 380.56, 1957.79, 1768.19], "bbox_id": "a43e147790", "file": "AppomattoxNewspapers_1926-1933a_0247.pdf", "page": 1, "text": "Drought-stricken V i r g i nia farmers will be aided from an 800,009 balance of an old fund held by the Federal gov ernment, distribution to begin aext week, it was announced by John R. Hutcheson, director of the Virginia Polytechnic In stitute extension division and member of the State Drought Relief Commission. Only farm ers who cannot obtain credit i from local sources will be per mitted to borrow from this fund, he declared. It was not stated how much of the fund would be made , available to Virginia. A heated controversy has a- fisen in Republican circles in Richmond over charges made co Federal officials in Wash ington by R. Houston Brett, Richmond attorney and secre tary of the .Republics1 Club of Virginia, that certain impor tant Republican officeholders at the Virginia capital are vio- 1 lating the civil service rules by undue political activity. Mr. Brett named Joseph P. Brady, veteran clerk of the United States District Court Postmas- er Joseph W. Stewart, Cen sus Supervisor, Cyrus W. Beale and Thomas B. Snead, referee in bankruptcy. These men de- I nied the charges. Governor John Garland Pol lard is proud enough of his Virginia ancestry not to care whether he has any Massachu setts ancestry or not. Mayor Curley, of Boston recently in vited him to attend the tercent- ary celebration next month in the Massachusetts capital, and said he was trying to trace a 1 relationship between Governor Pollard and the Pollards of the Bay State. The Governor may attend the celebration, hut he I wishes it understood that he is I a Virginian first, last and al ways and that his ancestry, Robert Pollard, settled in King William County in 1652. The Richmond Magazine, published by the Richmond Chamber 6 f C o m m e r e e, charges in a copyrighted arti cle in the September issue that the administration in Washing ton has been sending out freight rate reduction propa ganda, while Secretary of Ag riculture, Hyde, has befen mak ing it difficult for the farmers to get the benefit of rate re ductions by issuing complica ted regulations tending to nul lify the Interstate Commerce Commissions order cutting all government red tape. The magazine states that the chambers agricultural i and traffic departments have been deluged with inquiries from farmers and dealers concern ing their inability to obtain the rate reduction announced in dispatches from Washington. Robert B. Vial,. 20-year-old Hanover County farmer, is be ing held in Henrico jail on a charge of murdering Laney Jones, wealthy recluse, on the Jones plantation, Hilly Farm in Hanover County., Vial is said by the authorities to have confessed to the killing of Jones, following an argument over repairs to a farm motor truck. Jones body was found sprawled on the floor of his home by a negro worker on the place. Bucket shops are run all over the State under the guise of stock exchanges, it was charged last week by Charles C. Berkeley, of Newport News, who ran for Attorney-General of Virginia on the Republican- antiSmith coalition ticket in 1929, and was defeated over whelmingly. The charge was made in a letter to Governor Pollard, who made the letter public without comment. Farmers, fruit growers and stockmen of Loudoun County, one of the richest agricultural counties in the State, are esti mated to have lost 3,000,000 as a result of the drought, ac cording to County Agent, J. R. Lightner. This total does not include deflation of prices on beef cattle, curtailment of the apple crop, or decreased milk production. A permanent Marker is ex pected to be placed on the spot in Powhatan County where General Robt. E. Lee pitched his tent for the last time. He was returning from Appomat tox to Richmond following the surrender when he camped one night several miles north of Powhatan Courthouse. The"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "announced by John R. <mark>Hutcheson</mark>, director of the Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "announced by John R. <mark>Hutcheson</mark>, director of the Virginia"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1246.99, 570.19, 1387.75, 1065.74], "bbox_id": "a2b61ad865", "file": "AppomattoxNewspapers_1912-1915a_0524.pdf", "page": 1, "text": "bill be passed because of critic! his department Mr. Koiner went over the wort the department with the board,? the members were much gratified the progress he has made and his reports of the work being do State Veterinarian Ferneyhou combating the foot-and-mouth d Mr. Koiner stated that there very little hog cholera in the and that it is appearing in r few sections. Representatives from the Trucking Exhibitstation apperJ fore the board and said that 1 folk station was doing valuable  It was stated that Bert Hal trucker, sold .last year from a I six acres 12,000 worth of truck, ing how much may be done by sive farming. Virginia grows  cent, of the spinach crop of the 1 States, and it is valued at 1,5 Professor Hutcheson, of Bias manager of the four sub-expo- stations, discussed the work for the coming year, and said it would be made as practical helpful as possible. Inspectors for the ten district! f appointed as follows First dia Isaac B. Clarke, of Tasley district, J. C. Oodd, of Portsu Third district, John A. Lester, Chesterfield Fourth district, U Hatchett, of Lunenburg Fifth dli W. C. Witcher of Pittsylvania district, John E. Withers, of bell Seventh district, G. V. P of Greene Eighth district, Walker, of Culpeper Ninth d J. N. Alexander, of Pulaski, and t district, J. H. Leech, of Rockig Governor Stuart sent to the for confirmation the following-, nations- to the State tural Board Frank fLindsaj,j Portsmouth Robert H. Angell, of, anoke Robert H. Gray, of Le and W. W. Cproul, of Staunton. are for reappointment. The te for four years, dating from Mardj"}, "highlight": {"text": {"matched_tokens": ["Hutcheson"], "snippet": "valued at 1,5 Professor <mark>Hutcheson</mark>, of Bias manager of"}}, "highlights": [{"field": "text", "matched_tokens": ["Hutcheson"], "snippet": "valued at 1,5 Professor <mark>Hutcheson</mark>, of Bias manager of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
