{"document": {"bbox": [692.38, 208.63, 844.3, 957.6], "bbox_id": "404af10ea4", "file": "AppomattoxNewspapers_1974-1975a_0264.pdf", "page": 1, "text": "Guests in the home of Mrs. j Maggie Gardner and Ethel i during the week were Mrs. I Howlett Drinkard. Miss Eunice Martin, Mrs. Lathan Harvey, Miss Birdie Harvey and Mr. and Mrs. Russell Covington. The Young Peoples Class of Trinity Church School, Mr. David Martin teacher, visited Mr. and Mrs. Taylor Coleman Sunday morning. Mr. and Mrs. Tom Moore visited in the home of Mr. and Mrs. Ryland Doss Friday night. Sherry, daughter of Mr. and Mrs. Buddy Wilcox has returned home from the hospital after undergoing a tonsillectomy last week. Sunday dinner guests of Mr. and Mrs. James Martin honoring Mrs. Martin on her birthday were Mr. and Mrs. Marshall Martin, Mr. Harold Martin, Lewis and Hunter, Mr. I and Mrs. Robert Martin,  Roxanne, Robin and Bobby and Mr. and Mrs. Buddy Wilcox, Sherry and Jeffrey. Afternoon guests in the Martin home were Mr. and Mrs. Donnie Moore, Kevin, Audrey and Dana. Mr. and Mrs. O. W. Martin, Jr. have as house guests this week Mrs. Penny Shaw of Fairfax and Mrs. Jimmy Martin and Matt, their daughter-in-law and grandson, of Memphis, Tenn. Their son, Jimmy, and Wes arrived earlier last week. Glad to report Mrs. Ralph Harris is doing much better since the doctor put a cast on her leg last week. Sunday dinner guests of Mr. and Mrs. Tom Moore were Mi. and Mrs. Eddie Moore, Tina, A1 and Darrell, Misses Donna and Wanda Martin and Mr. Hunter Martin. Afternoon visitors in the Moore home were Mr. and Mrs. Roland Smith. Afternoon visitors of Mr. and Mrs. Taylor Coleman on Sunday were Mrs. Molly Rogers, Mrs. William Burcher and Mrs. Alise Drinkard. Also visiting in the Coleman home were Mr. and Mrs. Lincoln Martin, of Madison Heights. Mr. and Mrs. Keith Martin, Cindy and Nith, Mr. and Mrs. Riley Megginson, and Mrs. Ray Page were supper guests of Mr. and Mrs. Marshall Martin Wednesday evening. Mr. and Mrs. Marshall Martin are the proud great grandparents of two new great grand daughters. This makes their 23rd great grandchild."}, "highlight": {"text": {"matched_tokens": ["O", "W"], "snippet": "Dana. Mr. and Mrs. <mark>O</mark>. <mark>W</mark>. Martin, Jr. have as"}}, "highlights": [{"field": "text", "matched_tokens": ["O", "W"], "snippet": "Dana. Mr. and Mrs. <mark>O</mark>. <mark>W</mark>. Martin, Jr. have as"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 18446744073709551615, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
