{"document": {"bbox": [1127.72, 1568.83, 1183.88, 1585.88], "bbox_id": "f40d6dc0d0", "file": "AppomattoxNewspapers_1898-1902a_0708.pdf", "page": 1, "text": "RUCKER."}, "highlight": {"text": {"matched_tokens": ["RUCKER"], "snippet": "<mark>RUCKER</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["RUCKER"], "snippet": "<mark>RUCKER</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1053.12, 1634.19, 1296.54, 1761.23], "bbox_id": "d41f475a94", "file": "AppomattoxNewspapers_1922-1923a_0420.pdf", "page": 1, "text": "Your tobacco is not walked ovi and the heads tramped off s FARMERS, we handle it nicel Cut out our break days and come to U F irst Break. House open day and night ell only at FARMERS. Messrs. Samuel B. Rucker and Walter Bass will sea to the sale of your tobacco. Yours Truly,  yours xru iy."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "FARMERS. Messrs. Samuel B. <mark>Rucker</mark> and Walter Bass will"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "FARMERS. Messrs. Samuel B. <mark>Rucker</mark> and Walter Bass will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [838.54, 743.25, 1001.71, 869.62], "bbox_id": "319fb1951d", "file": "AppomattoxNewspapers_1922-1923a_0385.pdf", "page": 1, "text": "Your tobacco is not walked over and the heads tramped off at FARMERS, we handle it nicely Cutout our break days and come to the First Break. House open day and night. We null only at F A R M E R S . Messrs. Samuel B. Rucker and Walter P llass will see to the sale of your tobacco. Yours Truly,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "S . Messrs. Samuel B. <mark>Rucker</mark> and Walter P llass"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "S . Messrs. Samuel B. <mark>Rucker</mark> and Walter P llass"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1179.85, 899.13, 1319.27, 1027.54], "bbox_id": "b56c7480d3", "file": "AppomattoxNewspapers_1922-1923a_0353.pdf", "page": 1, "text": "Your tobacco is not walked i and the heads tramped FARMERS, we handle it nierf Cut ou t our break days a nd come tel F irst Break. House open day anil niflit sell only at F A R M E R S . Messrs. Samuel B. Rucker and Wild Bass will see to th e sale of your tobeM Yours Truly,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "S . Messrs. Samuel B. <mark>Rucker</mark> and Wild Bass will"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "S . Messrs. Samuel B. <mark>Rucker</mark> and Wild Bass will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1591.26, 1190.61, 1760.43, 1436.26], "bbox_id": "bfe68cdeea", "file": "AppomattoxNewspapers_1949-1952a_0407.pdf", "page": 1, "text": "Your demonstration of leader ship, ability to work under tremen. dous odds as regards shotage of many critical items, such as an in adequate number o f treatment tables, work benches, etc., and hav ing to train your enlisted assistants by on the job method, reflects in you an extraordinary high degree of leadership, a keen knowledge of the problems arising under such cir cumstances and with the unselfish desire to only have the best as the end results, always bearing in mind the patients treatment and com fort comes first. At the present time, the Physical Therapy Branch, through your efforts, is a place that the undersigned takes personal pride as one of the activities at Camp Rucker as reaching the tops in per fection and for this, I wholehearted ly commend you for a duty per formed to the complete satisfaction of all."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the activities at Camp <mark>Rucker</mark> as reaching the tops"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the activities at Camp <mark>Rucker</mark> as reaching the tops"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [504.54, 1144.63, 1043.93, 1216.12], "bbox_id": "edf897fca6", "file": "AppomattoxNewspapers_1936-1939a_0011.pdf", "page": 1, "text": "your choice l  T .JdCCUrk S .  d,y  ith E1Un Mrtin past week. She also visited Mr. and j Misses Kathleen and Lucille Cole- Mrs. William Harvey. , man spent a few days with theii Mrs Geneva Rucker and grand-!aUn1 Mrs Clark Moore last weak daughter, Jacklyn Sanne, of Rich- I Mrs. Harry Lucado, who has been mond, are spending this wsek with ! quite sick, is much better at this Mrs. E. B. Martin. writing."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "with theii Mrs Geneva <mark>Rucker</mark> and grand-!aUn1 Mrs Clark"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "with theii Mrs Geneva <mark>Rucker</mark> and grand-!aUn1 Mrs Clark"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [319.85, 1099.79, 625.15, 1134.26], "bbox_id": "a64d6ae5da", "file": "AppomattoxNewspapers_1898-1902a_0116.pdf", "page": 1, "text": "ynchburg, Va. RUCKER, CL"}, "highlight": {"text": {"matched_tokens": ["RUCKER"], "snippet": "ynchburg, Va. <mark>RUCKER</mark>, CL"}}, "highlights": [{"field": "text", "matched_tokens": ["RUCKER"], "snippet": "ynchburg, Va. <mark>RUCKER</mark>, CL"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1800.98, 915.6, 2118.36, 1006.39], "bbox_id": "5693a9daa1", "file": "AppomattoxNewspapers_1915-1918a_0161.pdf", "page": 1, "text": "y o u r h o u se c l e a n in g . See H. B. Anderson for your Wall Papers. 600 samples to Mrs. Odelle Rucker continue select frotn. f T very weak. All Kinds of Painting and Mr. and Mrs. Charlie Rosser, Paperhanging at lowest prices. H. B. AN D ERSO N"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "samples to Mrs. Odelle <mark>Rucker</mark> continue select frotn. f"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "samples to Mrs. Odelle <mark>Rucker</mark> continue select frotn. f"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2327.28, 199.59, 2464.32, 890.71], "bbox_id": "e50f40a66d", "file": "TimesVirginian_1980a_0097.pdf", "page": 1, "text": "X Maxwell, Mrs. Kenneth Deaner and Mrs. Walker Shqpe. Our hearts were saddened when we learned of the death of Mr. Harry Rucker, of Lynchburg. Our prayers, sympathy, and love are with his love ones.  Mr. and Mrs. Edwin Schantpel arrived last week from Wildwood, Fla., for a visit with relatives and friends. They are guest in the home of Mr. and Mrs. Arnold Childers of Lynch burg. Joining them in this home for Sunday dinner were Mr. and Mrs. Henry Covington, Mrs. W. E. Inge, Mr. Nat Ferguson and Mrs. Elizabeth Gaddy. Mr. and Mrs. Bob Jenkins, of Concord attended preach ing at Hollywood Sunday. Mr. and Mrs. Jim Woodall visited  Mrs. Mary Bagby and Mr. and Mrs. Thomas Woodall and family Sunday. Mr. and Mrs. Scott Sheets returned home last week after visiting their son, Mr. Dean Sheets and family, of Lutz, Fla. Congratulations to Mr. and Mrs. Hank Voelter, of Marietta, Ohio on the arrival of a baby girl, Emily Jane, born March 15, 1980. Mrs. Walker is the granddaugh ter of Mr. Frank O. Covington, of M arietta, Ohio. Mr. and Mrs. Roger Godsey and Mr. Alfred Almond visited Mr. and Mrs. Robert Coleman Sunday. Mr. Calvin Smith and son, Bobby, visited in this home last week. Mr. Coleman plans to enter the Lynch burg General Hospital Sun day,  March 23, for an operation later. Mr. and Mrs. Elliott Torrence, Mrs. Lare Tor rence and Mrs. James Conner spent the week end in Richmond with Mr. and ,  Mrs. Frank Hancock. Mrs. Iva F. Covington returned home last week after spending the winter . months with her son-in-law, and daughter. Rev. and Mrs. Harry Randall, and family of Douglas, Wyoming."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "death of Mr. Harry <mark>Rucker</mark>, of Lynchburg. Our prayers,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "death of Mr. Harry <mark>Rucker</mark>, of Lynchburg. Our prayers,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [355.68, 525.24, 676.0, 718.59], "bbox_id": "58cb846b0e", "file": "AppomattoxNewspapers_1892-1898a_0124.pdf", "page": 1, "text": "Wo, the Executive Committee of the FARMERS ALLIANCE CO-OPERATIVE WARE HOUSE CO., after three years of successful operation at PACES WAREHOUSE, seeing tho necessity for enlarged facilities have caused to be built in Lynchburg by Moorman Bros.  Co. the largest and finest warehouse in Virginia, 34,800 square feet floor space, with a basement of 12,600 feet. This housc.wlth its equipment and appurtenances has been leased by the Alliance for the purpose of saving money to tho planter In marketing his crop. Now look at facts ana figures. Take an average crop of thirty million pounds, sold at an average of six dollars per hundred, cost to the planter for weighing and selling under old charges, commission for selling, fifty-four thousand dollars weighing, forty-five thousand dollars total, ninety-nine thousand dollars. Patronize us and we will save you one-third thirty-three thousand dollars fail to sustain us by your patronage and co-operation and your opportunity for reduction in charges is gone, for our success depends upon the amount handled. Remember our charges are 10 cts. per 100 for weighing and 2 per cent, for selling, which no other house does in this city. We mean what we say. ur warehouse force has been carefully selected, as far as possible retainingour old men, ERIENCED IN THE BUSINESS, iloor Manager, W. H. H. Winston Assistance. T. Ou e x p e ___________________________ _________ . _ m m _________ m T _______ ______ Rucker Weigh master and Clerk, W. I. Canada Auctioneer, D. A. Bodenhamer Bookkeeper and Paymaster, J. M. Pattis m  E. S. Moorman, Treasurer of Campbell County, General Manager, assisted by Major M. N. Moorman. Now friends, to succeed we must all work to that end. We reduced charges 33 percent. __ eturn each Planter must become a drummer for the house  we are paying you for the work one-third in reduction for charges, other houses and commission merchants pay HIRED DRUMMERS by the month and package. Write to General Manager for any information desired. As far as possible, make your packages for shipping at home, though we are pre- lareci and will ship promptly hogsheads and tierces to such as may order. COME and SEE UNBINGS and MANAGEMENT and w . .........................."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "m m _________ m T _______ ______ <mark>Rucker</mark> Weigh master and Clerk,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "m m _________ m T _______ ______ <mark>Rucker</mark> Weigh master and Clerk,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1285.71, 235.37, 1390.31, 312.36], "bbox_id": "1ffcc4562f", "file": "AppomattoxNewspapers_1915-1918a_0376.pdf", "page": 1, "text": "Wm. S h e ltn T i1 Church, Mildred Tri. Vnes, Elizabeth w! 1 flyn Hancock Deannon, Mortie by Rucker, Glady p Virginia Hancock"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Wm. S h e ltn T i1 Church, Mildred Tri. Vnes, Elizabeth w! 1 flyn Hancock Deannon, Mortie by <mark>Rucker</mark>, Glady p Virginia Hancock"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Wm. S h e ltn T i1 Church, Mildred Tri. Vnes, Elizabeth w! 1 flyn Hancock Deannon, Mortie by <mark>Rucker</mark>, Glady p Virginia Hancock"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1506.75, 1072.38, 1810.55, 1323.48], "bbox_id": "706ea8e3c2", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "Wm. M. Cabell vs. Susan Johnsons Admi. j o fl slzes a r r  ..Home at Swmp-Root confirmation o i report of sale, and order to collect. W m. H. A bbltt vs. D. E. Wool ridges Admi final decree. C. 1. Rucker vs. Annie U. North, and Annie ii. North vs. R. A. North, c. coufiruiutiou of uummissiouers report, and order to puy cuminuiafiou fur dower. James M. Uolu vs. Sumuel H. Join rule uwarded. - im sintis ul Appomattox circuit, MuthodUt Lpiocupui Church South confirmation of sale, and final deoiee. A. Ii. Clement vs. kettle Carson and others deed sot aside, uud order to rent land. i. Coleman vs. it. G. Gillispie iu junc tion uissolved. J. i. h. Flesh man vs. J. P. H arvey report of sale codfirmed, and order to pay coats, u. J. IC. Hannah, Ac., vs. C. H. Chilton leave to file answer given to defendant. it. P. Puuiett vs. Willis A. Paulett and oth ers  older for partition. , K. J. Binford vs. L. H. and L. C. Gilliam older confirming commissioners report, aud to distribute funds. ,- usjc C. Nowlin vs. W. B. Nowlin, Jr., Ac. sale confirmed, and order for distribution. II. 1. Flood vs. A. H. Clement order for taking accounts."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "final decree. C. 1. <mark>Rucker</mark> vs. Annie U. North,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "final decree. C. 1. <mark>Rucker</mark> vs. Annie U. North,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [585.05, 246.72, 736.76, 912.89], "bbox_id": "cafbc4e37f", "file": "TimesVirginian_1976_0394.pdf", "page": 1, "text": "With the Vice President Dr. Merwyn Williamson presiding in the absence of the President, Mr. Gilbert Lusk, the Appomat tox County Historical Society held its regular October meeting recently. The resignation of the President, due to a transfer of professional duties to Gettys burg National Park was accepted with regrets. Highlight of the October meeting focused on a seven hundred dollar donatimi for historical research from the Woodmen of the W orld, donation of 1914 news articles and other documents concern ing the late Congressman Henry D. Flood, and the Birth Pangs of Appomattox County depicted in a talk by Mr. Ron Wilson. Mrs. Harry Clark Rucker presented the Flood news articles to the Glory of God and to the members of the society. To her the beauty of any possession is dependent on  the degree to which it is shared i with others. Amy possession to predoifl to share is not worth  having. The thing then becomes j the master of the man. Mrs. Rucker, the former j Helen Nowlin, the great-grand-1 daughter of Lawyer John Woodson whose office is one of ! the restored buildings at J Appomattox National Park, is i the daughter of the late Annie ! Thornhill and Albert Sidney ! Nowlin. Her mother, from the I Hollywood area of the county, and her father, from the! Oakville area, are widely j related throughout the county. The firuest speaker for the evening, Ron Wilson, Historian at Appomattox Court House Rational Historic Park, spoke on th e Birth Pangs of Appomattox County,1845 - 1870. The speech, based on research, one by Dr.  John Moore, Research H istorian, University of Virginia, depicted the February 8,1845 birthing of Appomattox County from the parent counties of Buckingham, Campbell, Prince Edward and"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Wilson. Mrs. Harry Clark <mark>Rucker</mark> presented the Flood news"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Wilson. Mrs. Harry Clark <mark>Rucker</mark> presented the Flood news"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1797.33, 920.85, 1967.23, 1392.19], "bbox_id": "eedcea36ec", "file": "AppomattoxNewspapers_1915-1918a_0171.pdf", "page": 1, "text": "with her Bister, Mrs. Tom Cana- da.  There will be preaching Union. Hill the first Sunday June, by the tegular pastor, i Mr. Sammie Williamson,  made a flying trip to Lynch- burg last Monday, on business, j  -Messrs. Courtney and Tom Williamson and several friends from Lynchburg, motored down and spent the day last Sunday with their father, Mr. J. H. Williamson, near Morris church.  Mr. Clifford Wood from the! Standing Army in S. C., was visiting friends in this neigh -1 borhood last week. I. Mrs. Beulah Harvey, spent the week end in Lynchhurg, with her aunt, Mrs. Frank Johnson. j  Mrs. Odell Rucker, continues j to improve. 1 Mr. Bernard Tibbs was hnnt  ing Dr. Mott Robertson last, Sunday. He has a real sick  baby f Mr. Willie Burton Harvey also have two sick children. j j Mis. Clem Williamson, has been real sick for more than a week. Dr. Chalmers, of Red  House, has been attending on her. She continued no better so Dr Tune, of Brookneal, was called yesterday to consult with  Dr. Chalmers. She is reported of being a littls better now."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Johnson. j  Mrs. Odell <mark>Rucker</mark>, continues j to improve."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Johnson. j  Mrs. Odell <mark>Rucker</mark>, continues j to improve."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [323.05, 887.48, 487.32, 1387.39], "bbox_id": "fc6ebb3338", "file": "AppomattoxNewspapers_1926-1933a_0510.pdf", "page": 1, "text": "Willis hospital. Mrs. Fergu son found her much improved. J. Stanley Moore was well enough to coine to Sunday morning but is still feeling bad ly. Allan Campbell has been confined to hisjbed for several days by sickness, but his condi tion is improving, it is said. There was a reorganisation yf the Sunday school of the Presbyterian church here last Sunday. Elder R. L. Price was ihosen as teacher of the Bible class, Bascomb Pricei, as teach er of the advanced class, Miss Crawley as teacher of thein termediate class, and Mrs. C. A. Allen of the primary class and Mr. Moore, who h a s so faithfully superintended the school for many years was re elected. Edward McCracken, of Win- hester, Ohio, is here on a visit to his grandmother, Mrs. Mc Cracken, and h i s other rela tives in the county. J. P. Richardson, 84, died at his home near Piney Ridge church on last Sunday- O--------------------------------O  SOUTHSIDE  O ------------------------------- O SOUTHSIDE,Mrs. A. A. Gobble visited her sister, Mrs. J- A. Guilly, Sunday. Messrs. Junior Coleman and Sam Rucker,- of Lynchburg were the guests of Mrs. Robert Holycross Monday night. Mr. and Mrs. Will Coleman were visitors of Mrs. Clinton Cawthom Saturday. Miss Nina Jobes is sick. Mrs. W. P- Odor visited Mrs. A. E. Coleman recently."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Junior Coleman and Sam <mark>Rucker</mark>,- of Lynchburg were the"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Junior Coleman and Sam <mark>Rucker</mark>,- of Lynchburg were the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1461.34, 294.65, 1629.32, 419.15], "bbox_id": "0013d117a2", "file": "AppomattoxNewspapers_1905-1912a_0055.pdf", "page": 1, "text": "who has recovery. Misses Jenkins, of Seven Mile Ford, Va Messrs. O. E. Weisen- burg, of Kentucky Hugh Christian, Gary Barker, Jack Appleton. Bob James, Charles Rucker and Newton Carroll, of Lynchburg, were guests at the home of Mr. and Mra. J. R. Atwood recently."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Appleton. Bob James, Charles <mark>Rucker</mark> and Newton Carroll, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Appleton. Bob James, Charles <mark>Rucker</mark> and Newton Carroll, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1771.68, 518.61, 1929.44, 837.06], "bbox_id": "490087de49", "file": "AppomattoxNewspapers_1915-1918a_0474.pdf", "page": 1, "text": "where Mr. Vnod was a valued employee of C. W. Hancock  Son. The details at this time are not obtainable, but it is said Mr. Wood was walking along the R. R. track when struck and his body badly mangled by a train. He was a son of Mr. W. F. W o o d , of Spring Mills, and was a popu lar young man. Quite a company of young people are invited to supper at the New Appomattox this eve ning. We understand it to be Halloween and entirely a so cial affair. Those invited are Miss Madalyne Sears and Fon- nie W oolfolk, Miss Alice Prof fitt and Guy Smith, Mies Kath leen Rucker and Sam Ferguson, jr., Mise Jennie Godwin and Charlie Moses, Miss Virginia V. Ferguson and W illis Inge. Chaperone, Mrs. Geneva Ruck er L. F. Ferguson and Mrs. J. B. Peacock."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Smith, Mies Kath leen <mark>Rucker</mark> and Sam Ferguson, jr.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Smith, Mies Kath leen <mark>Rucker</mark> and Sam Ferguson, jr.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1408.55, 1212.01, 1914.12, 1439.38], "bbox_id": "840df53695", "file": "AppomattoxNewspapers_1908-1909a_0276.pdf", "page": 1, "text": "week-end guest of Miss Cecil Morgan jet her home in Buck ingham. Mr. W. L. Agee, Mr. Bur nett Agee, Miss Geneive Per son and Miss Ann jSurfage, 01 Washington, D. Ci, were tht I week-end guests of Mr. and j Messers. John Heatwell and  Richard Suter, of Harrison- Wec.-cuivi  - --------  i burg, were Sunday guests in Mrs w A. Agee the home of W. R. Reynolde.  To ence is b a d 1 L Mr. J. D. Morris, Mr. R. C. at wprk again after being tou Moore and their families spent or gome time with a sprainec ! Sunday in East Radford, V ir-ankle which resulted from i ginia. I fell at the factory, she alst Little Pauline Franklin was sustained several bruises. hostess .to a number of her Messers Jett Rucker and 1 Lt  hf appreciated.  friends Tuesday evening at a Hilton Tucker, of Lynchburg  Thosc oresent w ere Mr.  birthday party. and Miiss Sarah Bate, were   r8 L p Caldwell and child- Mrs. Richard Smith and the guests of M i   an  eJ  en, Mrs. Pw ks Jennings and daughter, Barbara Mae spent Christine Agee Sunday after h- several days, this week vlaitipg.,,PQ9P ........ ......... TrX ettirargr --------  1 ........M riiiiansrrs-.m -lIrSchan---. v Iffnr, Mrs o"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "of her Messers Jett <mark>Rucker</mark> and 1 Lt  hf"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "of her Messers Jett <mark>Rucker</mark> and 1 Lt  hf"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1007.27, 974.76, 1310.1, 1049.68], "bbox_id": "7d2d194bc2", "file": "AppomattoxNewspapers_1922-1923a_0341.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as-early after tbei ket opens as possible Care your short filling tobacco without smoke, S. B. Rucker, Sr., and W. P. Bass are always on hand. House r day and night. Your friends, . RUCKER CLHRKE TOBACCO."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "without smoke, S. B. <mark>Rucker</mark>, Sr., and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "without smoke, S. B. <mark>Rucker</mark>, Sr., and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1063.73, 1320.55, 1334.64, 1392.96], "bbox_id": "b839c51045", "file": "AppomattoxNewspapers_1922-1923a_0310.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as earlyaf ket opens as possible, Cure your short filling tobacco without S. B, Rucker, Sr , and W. P. Bass are always on hand, day and night. Your friends, RU CKER CUHRKE TOBACCO"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "tobacco without S. B, <mark>Rucker</mark>, Sr , and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "tobacco without S. B, <mark>Rucker</mark>, Sr , and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.58, 970.91, 1316.44, 1042.15], "bbox_id": "47457108c6", "file": "AppomattoxNewspapers_1922-1923a_0345.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as early afterthi iet opens as possible Cure your short filling tobacco withoutsmokfj S. B. Rucker, Sr., and W. P. Bass are always on hand. H ohm j day and night. Yonr friends, RUCKER CUKRKE TOBACCOS-!"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "tobacco withoutsmokfj S. B. <mark>Rucker</mark>, Sr., and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "tobacco withoutsmokfj S. B. <mark>Rucker</mark>, Sr., and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1819.68, 1752.0, 2151.11, 1826.68], "bbox_id": "cbfd21861f", "file": "AppomattoxNewspapers_1922-1923a_0300.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as early after the mar ket opens as possible Cure your short filling tobacco without smoke. S. B. Rucker, Sr., and W. P. Bass are always on hand. House open day and night. Your friends, RUCKER CLKRKS TOBACCO  5 -"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "without smoke. S. B. <mark>Rucker</mark>, Sr., and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "without smoke. S. B. <mark>Rucker</mark>, Sr., and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1842.01, 1736.08, 2172.54, 1808.19], "bbox_id": "ac7b0cad2b", "file": "AppomattoxNewspapers_1922-1923a_0296.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as early after the mar ket opens as possible. Cure your short filling tobacco without smoke. S. B. Itucker, Sr., and W. P. Bass are always on hand. House open day and night. Your friends, RUCKER CUKRKS TOBACCO Q."}, "highlight": {"text": {"matched_tokens": ["RUCKER"], "snippet": "and night. Your friends, <mark>RUCKER</mark> CUKRKS TOBACCO Q."}}, "highlights": [{"field": "text", "matched_tokens": ["RUCKER"], "snippet": "and night. Your friends, <mark>RUCKER</mark> CUKRKS TOBACCO Q."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1001.48, 1319.13, 1322.08, 1394.29], "bbox_id": "91ef43c507", "file": "AppomattoxNewspapers_1922-1923a_0314.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco as early after the mar ket opens as possible, Cure your short filling tobacco w ith o u t smoke. S. B. Rucker, Sr, andW. P. Bass are always on hand. House open day and night. Your friends, RUCK5R CUHRKE TOBACCO s-"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "t smoke. S. B. <mark>Rucker</mark>, Sr, andW. P. Bass"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "t smoke. S. B. <mark>Rucker</mark>, Sr, andW. P. Bass"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1032.94, 1005.58, 1319.67, 1078.99], "bbox_id": "19826042ec", "file": "AppomattoxNewspapers_1922-1923a_0337.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco a earty after Mi ket opens as possibl.. Cure your short filling tobacco without sa S. B. Rucker, S r , and W. P. Bass are always on hands H om J lay and night. , Your friends, R U C K E R C L K R K E TOBACCO i"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "without sa S. B. <mark>Rucker</mark>, S r , and W."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "without sa S. B. <mark>Rucker</mark>, S r , and W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1029.35, 1033.46, 1327.92, 1109.68], "bbox_id": "49f619b665", "file": "AppomattoxNewspapers_1922-1923a_0329.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco a early afterti? ket opens as possibly. Cure your short filling tobaccowithoutsmok S. B. Rucker, Sr , and W. P. Bass are always on hand. Hon Your friends, day and night RUCKER CLHRKS TOBACCO"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "filling tobaccowithoutsmok S. B. <mark>Rucker</mark>, Sr , and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "filling tobaccowithoutsmok S. B. <mark>Rucker</mark>, Sr , and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [998.39, 1008.28, 1317.19, 1082.84], "bbox_id": "f8533d853d", "file": "AppomattoxNewspapers_1922-1923a_0333.pdf", "page": 1, "text": "We would advise our friends to sell their tobacco a early after fie rwr ket opens as possibl . Cure your short filling tobacco without.smoke. S. B.- Rucker, Sr , and W. P. Bass are always on hand. House open day and night. Yonr friends, RUCKER CUHRKE TOBACCO  5 -"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "tobacco without.smoke. S. B.- <mark>Rucker</mark>, Sr , and W. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "tobacco without.smoke. S. B.- <mark>Rucker</mark>, Sr , and W. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [665.52, 1824.7, 987.37, 1989.18], "bbox_id": "bc08d3c66c", "file": "AppomattoxNewspapers_1898-1902a_0540.pdf", "page": 1, "text": "We will move from MARTINS WAREHOUSE October 1st, 1901, 1o tbe FARMERS WAREHOUSE, the fine new warehouse that is hein built by R. C. Stokes, Adams, Chambers .k Co., Hancock, Moorman Tobacco Co., und 5 . K. Smiley. This house will he the best in the State for the hauriling of L eal lobncco. TH E NEW HOUSE will ho located on tbe corner of 13tb and Commerce streets or two squares from the end of MARTINS WAREHOUSE. We promise our friends the best service und the HIGHEST PRICES. When in tbe city come to see us and we will take pleasure in going down to the new house with you and showing you its many advantages. Rucker-Clark Tobacco Co., LYNCHBURG, VA. S . B. RUCKER. w . E. CLARK. - W. K. 5MILEY"}, "highlight": {"text": {"matched_tokens": ["RUCKER"], "snippet": "LYNCHBURG, VA. S . B. <mark>RUCKER</mark>. w . E. CLARK. - W."}}, "highlights": [{"field": "text", "matched_tokens": ["RUCKER"], "snippet": "LYNCHBURG, VA. S . B. <mark>RUCKER</mark>. w . E. CLARK. - W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [323.49, 504.01, 645.39, 707.11], "bbox_id": "f2fce7c1ae", "file": "AppomattoxNewspapers_1892-1898a_0137.pdf", "page": 1, "text": "We, the Executive Committee of the FARMERS ALLIANCE COOPERATI VE WARE HOUSE CO., after three years of successful operation at PACKS WAREHOUSE, geelngrthe necessity for enlarged facilities have caused to foe built in Lynchburg by Moorman Bros.  Co. the largest and finest warehouse in Virginia, 34,800 square feet floor space, with a basement of 12,000 feet. This house, with its equipment and appurtenances has been leased by the Alliance for the purpose of saving money to the planter in marketing his crop. Now look at facts and figures. Take an average crop of thirty million pounds, sold at an average of six dollars per hundred, cost to the planter for weighing and selling under old charges, commission for selling, fir tv-four thousand dollars weighing, forty-five thousand dollars total, ninety-nine thousand dollars. Patronize us and we will save you one-third thirty-three thousand dollars fail to sustain us by your patronage and co-operation and i our opportunity for reduction in charges is gone, for our success depends upon the amount andlea. Remember our charges are 10 cts. per 100 for weighing and 2 per cent, for selling, which no other house does in this city. We mean what we say. Our warehouse force has been carefully selected, as far as possible retainingour old men. EXPERIENCED IN THE BUSINESS. Floor Manager, W. H. II. W inston Assistant,C. T! Rucker W eighmasterand Clerk, W. I. Canada Auctioneer, I. A. Bodenhamer Bookkeeper and Paymaster, J. M. P attison E. 8. Moorman, Treasurer of Campbell County, General Manager, assisted by Major M. N. Moorman. Nour friends, to succeed we must all work to th at end. We reduced charges 3334 percent. In return each Planter must become adrum m er for the house we are paying you for the work one-third in reduction for charges, other houses and commission merchants pay HIRED DRUMMERS by the month and package. W rite to General Manager for any information desired. As far as possible, make your packages for shipping a t home, though we are pre- 8 ared and will ship promptly hogsheads and tierces to such as may order. COME and SEE OUSE, 8URROUNDING8 and MANAGEMENT and we feel confident of your patronage. Adddreos nd Mark to  . g , M O O R M A N ,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "W inston Assistant,C. T! <mark>Rucker</mark> W eighmasterand Clerk, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "W inston Assistant,C. T! <mark>Rucker</mark> W eighmasterand Clerk, W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [347.49, 517.86, 669.41, 736.75], "bbox_id": "007a276e95", "file": "AppomattoxNewspapers_1892-1898a_0143.pdf", "page": 1, "text": "We, the Executive Committee of the FARM HOUSE CO., after three years of successful oper necessity for enlarged facilities Isa ve caused to b the largest and finest warehouse in Virginia, sh . h 12j6ilQ feet. This house, with its equipment and Up for the purpose of saving money to the planter i Now look at facts and figures. Take an avert average o f six dollars per hundred, cost to the j charges, commission for selling, fifty-four thou dollars total, ninety-nine thousand dollars. Pa thirty-three thousand dollars fail to sustain 1 your opportunity for reduction in charges Is gon handled. Remember our charges are 10 cts. per 100 for weighing and 2 per cent, for selling, which no other house does in this city. We mean what we say. O ar warehouse force has been carefully selected, as far as possible retaining our old men, EXPERIENCED IN THE BUSINESS. Floor Manager, W. If. H. W inston A ssistance. T. Rucker Weigbmaster and Clerk. W. L Canada Auctioneer, D. A. Bodenhamer Bookkeeper and Paymaster, J. M. Pattison E. 8. Moorman, Treasurer of Campbell County, General Manager, assisted by Major M. X. Moorman. Now friends, to succeed we must ail work to that end. W e reduced charges 333a p ercen t. in return each Planter must become a drummer for the house  we are paying you for the work one-third in reduction for charges, other houses and commission merchants pay HIRED DRUMMERS by the month and package. W rite to General Manager for any information desired. As far as possible, make your packages for shipping at home, though we are pre pared and will ship promptly hogsheads and tierces to such as may order. COMB and SEE HOUSE, SURROUNDINGS and MANAGEMENT and we feel confident of your patronage. Adddress and Mark to E , g . MOORMAN, General Manager, Moormans Warehouse."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "inston A ssistance. T. <mark>Rucker</mark> Weigbmaster and Clerk. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "inston A ssistance. T. <mark>Rucker</mark> Weigbmaster and Clerk. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [356.89, 516.77, 678.62, 691.9], "bbox_id": "833e319314", "file": "AppomattoxNewspapers_1892-1898a_0120.pdf", "page": 1, "text": "We. the Executive Committee of the FARM ERS A LLIANCE CO-OPERATIVEWABB- HOUSE CO., after three years of successful operation at PAC R h  AKEHOL iE, sceinjr the necessity for enlarged facilities have caused to be built in Lynchburg by Moorman Bros. A Co. the largest and finest warehouse in Virginia, 34,800 square feet floor space, with a bam entof 1 600 feet. This house, with its equipment and appurtenances has been leased by tne Alliance for the mi more of savin money to the planter in marketing his crop. Vow look at facts and figures. Take an average crop of thirty million pounds, sold at an average of six dollars pur hundred, cost to the planter for weighing and selling under old charges, commission for selling, fifty-four thousand dollars weighing, forty-five thouamd dollars total, ninety-nine thousand dollars. Patronize us and we will save you one-third thirty-three thousand dollars fail to sustain us by your patronage and co-operation and your opportunity for reduction in charges is gone, for our success depends upon the amount handled.    j a Remember our charges are 10 cts.per 100 for weighing anu2 t ir cent, for selling fM  J s_ 4L! mk mean what we,say.  ,tlr w.,rphmisp force ha been carefully selected, as far as possible retainingour old men, EXPERIENCED IN THE BUSINESS Floor Manager, W. H. HWinston lssistant,C .T. Rucker  Weiirhmaster and Clerk. W. I. Canada  Auctioneer, I. A. Bodenhamer Bookkeeper anil Paymaster! ! 31 P u ttton  E..S. Moorman, Treasurer of Campbell County, General MiiTiaa-er assisted by Major M. V. MiMirman.  , . _ V rjw friends to succeed we must all work to that end. We reduced charges 33J percent. ill return each Planter must become a drummer for the house  we are paying you for the  -   j ------------ J --------  ----------- ihantspay info"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "H. HWinston lssistant,C .T. <mark>Rucker</mark>  Weiirhmaster and Clerk. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "H. HWinston lssistant,C .T. <mark>Rucker</mark>  Weiirhmaster and Clerk. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1836.26, 1544.15, 2305.45, 1848.44], "bbox_id": "ca98d206bf", "file": "AppomattoxNewspapers_1922-1923a_0304.pdf", "page": 1, "text": "Wc would advise our friends to sell their tobacco as early after tbe mar ket opens as possible Cure your short filling tobacco without smoke. S. Ü. Rucker, Sr., and YY. P. Bass are always on hand. House open day and night. Your friends, RUCKER CLHRKE TOBACCO 3- 1"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "without smoke. S. Ü. <mark>Rucker</mark>, Sr., and YY. P."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "without smoke. S. Ü. <mark>Rucker</mark>, Sr., and YY. P."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.3, 443.38, 1915.57, 1019.23], "bbox_id": "0be32f3f7a", "file": "AppomattoxNewspapers_1912-1915a_0156.pdf", "page": 1, "text": "Washington.  Secretary of State Wiiliam J. Bryan was the central figure in an historic scene Saturday, when he signed the proclamatioii making ef fective the Seventeenth Amendment to the Constitution, an amendment which provides that United States Senators shall be elected by direct vote of the people. , From this day on the States must follow the new constitutional mandate in selecting their Senators or else go unrepresented in the upper branch of Congress. No Senator now holding a seat in that body, however, is affected dicing his current term of office. The ceremony was simple, though necessarily formal. It took place1 In the big reception room of the Secre tarys suite of offices. Surrounding Mr. Bryan were a number of states men who had played a part in the long fight for this reform, department heads and perhaps twos core of corre spondents. Mrs. Bryan There Too. Seated at the Secretarys left w h s Mrs. Bryan. She rejoiced in no less degree than the Secretary himself In the lest act of the gret battle which her husband had led for 20 years. She, as aid all the other witnesses to the signing of the proclamation, realized the appropriateness of Mr. Bryan, the Secretary, putting into effect a reform which Mr. Bryan, the citizen, had urged so long before the country. Uked Four Pens In 8ignlng. Mr. Bryan provided himself with four pens for the occasion. The first was used to sign the word William and then given to Mr. Tucker as a souvenir. With the second the Secre tary signed the word Jennings, then handing the pen to Representative, Rucker. The third was used in writ ing the word Bryan, and this the Secretary kept himself. The date of the proclamation was written with the fourth pen, which Senator Borah re ceived as a memento. As soon .as the signature had been affixed Mr. Bryan expressed gratifica tion over the fact that the duty of officially announcing the ratification of the Seventeenth Amendment had fal len to him as Secretary of State. He remarked that the short time required for the States to act proved. that the sentiment In favor of the reform was practically unanimous throughout the country."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the pen to Representative, <mark>Rucker</mark>. The third was used"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the pen to Representative, <mark>Rucker</mark>. The third was used"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [695.54, 544.81, 843.63, 977.95], "bbox_id": "234707ac0d", "file": "TimesVirginian_1976_0162.pdf", "page": 1, "text": "W pyed.  On Sunday at 3 p.m. at the home of a son-in-law and daughter, M . and M s. Joseph Buims, and other children of Mrs. Esther CaUaham, gave a delightful dinner party honor ing their mothers birthday. M s. Esher M. Callaham was so beautifully dressed for the occasion and had an enjoyable evening with her children, grandchildren and many fri ends. The bountiful amount of food was very appetizing and M s. .Callaham received lovely gifts of items and money. Mrs. Sadie Scott, a relative, baked a four tiered cake and decorated it so beautiful for the occasion. This is so characteristic of Mrs. Scott. On Monday evening at 7 the Bible Institute will meet at the Falling River E le m e n ta ry School. Everyone is invited to please come and give your moral support to make this occasion a success. M . and M s. Charles H. Canada are very sorry to hear of the passing of Mr. George Rucker and extend sympathy to the family of Concord. . After spending a little time at the home for the week end M s. L. M. Canada has returned to her duties in Appomattox. Everyone is so relieved to have had such a refreshing rain."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "passing of Mr. George <mark>Rucker</mark> and extend sympathy to"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "passing of Mr. George <mark>Rucker</mark> and extend sympathy to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [994.82, 446.7, 1298.76, 814.04], "bbox_id": "4fa3573bb6", "file": "AppomattoxNewspapers_1902-1905a_0548.pdf", "page": 1, "text": "W ill stand rough usuage. They ha power, strength, and durability. Lk draft, cuts fast and clean. Will suit hilly country. O u r M o w er Nevd C h o k es. The Johnston Binder, and Disc Cultivai for making Corn and Tobaccoits eqJ not to be found. P e rro w , E v a n s 8 C 1216, 1218 MAIN STREET LYNCHBURC, VIRCINI Rucker, Clark Tobacci COMPANY Ì"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "MAIN STREET LYNCHBURC, VIRCINI <mark>Rucker</mark>, Clark Tobacci COMPANY Ì"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "MAIN STREET LYNCHBURC, VIRCINI <mark>Rucker</mark>, Clark Tobacci COMPANY Ì"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [235.7, 1436.28, 712.36, 1719.12], "bbox_id": "8377389f59", "file": "AppomattoxNewspapers_1902-1905a_0224.pdf", "page": 1, "text": "w ilk er so n  R ey n o ld s . the promise of the remainder, which waat t0 Do MANN w ilk er so n . wa handed in by his brother the There is comfort in the knowledge so _  r , i  , l - j n ii uu I ..  often expressed, that Dr. Kilmers Swamp- O b Wednesday, 16th Inst, U 1 I next morning Root, the great kidney remedy fulfills every B ranch church w. s crowded w ith H r. Charles Clark, of Gladys,Va., wish in curing rheumatism, pain in the , . . . . . i ..... ........ .................................... ........ . back, kidneys, liver, bladder and every part adm iring friends to witness tne who is beginning to study for the 0f the urinary passage. It corrects inability double wedding of Mr. John JHP- ministry, is boarding t the home of o hold water and scalding pain in passing kins Wilkerson to Miss Maggie Mr. J. J. Wood this winter, attend- w C  e r la n d    Reynolds, and Mr. Lemuel J. Mann I jng schi ol under the care of Miss necessity of being compelled to go often ... nv.. , 1 __ , during thjeday, and to get up many times to Miss Leah May Wukersou. I Etta Wood. during five night. The mild and the extra- The decorations of the church jr. Virginia Rucker returned ordinary effect of Swamp-Root is soon were most beautiful and unique, due home Wednesday, after an extended dcrful cures of th? most stressing cas-s. to Misses Carrie Binford and Susie I vjeit to Bluefifcld, W. Va., and Bris- If you need a medicmq you should have the  a j i __ __ of a m host. Sold by druggists in 50c. andl. sizes. Moore, assisted b y a num ber of tol, Tenn. You may have a sample bottle of this voung ladies and gentlemen. The Miss Gertrude.Peet and Mrs, L. wonderful dlscoyery . FlfT r i church was darkened, bnt wax H. Simpson spent last Wednesday  r  M t !   n t i  S S B S tapers in old time brass candletsticks, and Thursday in Lynchburg, shop- absolutely free bv mail. - and shaded lamps shed a soft, mel- piQg for Christmas. lBfnghamon?N. Y. Wien writtogmen- low light upon the wedding party Mr. James French and children tion reading this generous offer in this paper. as they stood around the chancel are spending the winter with her Dont make any mistake, but remember the partly encircling the happy brides mother, Mrs. S. E, Evans. and proud grooms. Promptly at 4 Mrs. W. H. Harvey, who has been oclock the wedding partv entered ill, from fevets is now convalewing. O Clock lUC wcu K F . Migg E tta Wood Jfcfl t0.day for a the church m the foil g n   relatives in Lynchburg. Miss Ennice Davis, who attended"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the church jr. Virginia <mark>Rucker</mark> returned ordinary effect of"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the church jr. Virginia <mark>Rucker</mark> returned ordinary effect of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1000.81, 929.87, 1287.37, 1009.37], "bbox_id": "845f7c150c", "file": "AppomattoxNewspapers_1902-1905a_0548.pdf", "page": 1, "text": "W E S E L L O N LY A T FA R M ER S Are connected in no way with any other house. Your Friends, _ Rucker, Clarke Tobacco C e l"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "other house. Your Friends, _ <mark>Rucker</mark>, Clarke Tobacco C e"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "other house. Your Friends, _ <mark>Rucker</mark>, Clarke Tobacco C e"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2031.82, 1494.71, 2192.59, 1622.96], "bbox_id": "3e845450c3", "file": "AppomattoxNewspapers_1905-1912a_0349.pdf", "page": 1, "text": "W arrenton. In the Democratic prim ary election held here for can didate for the House of Delegates, W. N. Tiffany won the nom ination by a m ajority of 69. Others In the field were M. M. Green, J. L. Brice, W. A. Rucker and A. G. Kelly. A. F. Hamilton was nom inated for sheriff, with a m ajority of more than 300, over G. W. Brown. The only candi date for the S tate Senate was E. L. Fletcher, of Fauquier, who was nominated."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "L. Brice, W. A. <mark>Rucker</mark> and A. G. Kelly."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "L. Brice, W. A. <mark>Rucker</mark> and A. G. Kelly."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [854.11, 1598.77, 1009.64, 1712.17], "bbox_id": "650857893b", "file": "AppomattoxNewspapers_1915-1918a_0178.pdf", "page": 1, "text": "Vote Ends One Of the Bitterest Con tests Ever Waged. Washington  The nomination of Louis D. Brandeis, of Boston,, to the Supreme Court to succeed the late Joseph Rucker Lamar, was confirmed by the Senate by a vote of 47 to 22. The vote, taken without debate, ended one of the bitterest contests ever waged against a Presidential nominee. Mr. Brandeis will be the first Jew to occunv a seat on the Supreme Ranch."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "succeed the late Joseph <mark>Rucker</mark> Lamar, was confirmed by"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "succeed the late Joseph <mark>Rucker</mark> Lamar, was confirmed by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.14, 325.28, 1994.59, 637.23], "bbox_id": "2ff733fc80", "file": "AppomattoxNewspapers_1949-1952a_0541.pdf", "page": 1, "text": "Virginias leading beef cattle producers will meet at VPI March -0 for three days of discussions arid laboratory sessions covering practically every phase of the beef cactle business. The course, second of its  kind in Virginia, is sponsored jointly by thj animal husbandry department at VtT, the Virginia Beef Cattle Producers Association, and the state breed associations. The first day will be devoted to problems of feeding. George Litton, haed of the animal husbandry de partment will lead off with the fun damentals of good feeding. Jack Copenhaver, in charge of the col lege herds, will discuss feeding the breeding herd the year round. A prominent Virginia Angus breeder, B. A. Rucker, of Albemarle, wil. discuss feeding of show cattle. Pro fessor R. E. Hunt, VPI, will trace the history and trends in Virginias beef cattle business and Allan Randolph, Keene, secretary of the State Association,will diseuss Eth ics in thé Cattle Business. The second days program will feature a . report on beef cattle re search, by Dr"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Angus breeder, B. A. <mark>Rucker</mark>, of Albemarle, wil. discuss"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Angus breeder, B. A. <mark>Rucker</mark>, of Albemarle, wil. discuss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.24, 753.35, 2047.42, 945.93], "bbox_id": "7fa84f3725", "file": "AppomattoxNewspapers_1915-1918a_0368.pdf", "page": 1, "text": "urn   w o o S f g L y  - 1 dormitory he so urgently needs N o w l e t everybody inter!1 aPPtates. for our great school, which has 6sted in roads c o m e and I The First Volunteer outgrown its present capacity I have some plan for building p S I t J T a Crawley and the school roads Practin ritv i. !l Proi   Rioe was the first I fa   ft S ta p lM .. 4 26 8w ttbt      v o lu .le e r for . . r T i c . in the of roads. That m atter has been L rmv   On Friday, the 27tb, Miss  8ett,ed The mode of raising I ,een  numKer of atndnt Kathleen Rucker had a  Hen frmds is the first item to Lhe Agricultural S c I wia I h party of 18 girls. The g i r 1 8 H 1 J - f -  a t e the roads  e i i e r  e  w L  were dressed in different co s- and third organize a commis-8ervic0j 80me Qf whom have tumes, and amusements of all onto see that the money goes been acoepted. A m o n a the kinds wre enjoyed. About I on the road8- Now come with num5er are Messrs. Olarenoe 1030 oclock delicious refresh 80 e Pa to Ket the m atter Do88 Dewey Turnes, Jimmie ments were served. Among omfi before another winter I Do88 Aubrey Do88 c p  those present were Misses Fran-1 cmes onus.  tin Quite a number of stu-"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "numKer of atndnt Kathleen <mark>Rucker</mark> had a  Hen frmds"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "numKer of atndnt Kathleen <mark>Rucker</mark> had a  Hen frmds"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1995.85, 723.29, 2163.24, 783.44], "bbox_id": "4dbb7db9d6", "file": "AppomattoxNewspapers_1939-1943a_0504.pdf", "page": 1, "text": "U Sweitzer, princi pal Elizabeth Rucker, Margaret Ramsey, Lucile Dickerson, Mary Rives Black, Cleo Reynolds, Marga ret Ligon, Bessie Gunter, Dorothy Reynolds, and one other to be add ed."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "U Sweitzer, princi pal Elizabeth <mark>Rucker</mark>, Margaret Ramsey, Lucile Dickerson, Mary Rives Black, Cleo Reynolds, Marga ret Ligon, Bessie Gunter, Dorothy Reynolds, and one other to be add ed."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "U Sweitzer, princi pal Elizabeth <mark>Rucker</mark>, Margaret Ramsey, Lucile Dickerson, Mary Rives Black, Cleo Reynolds, Marga ret Ligon, Bessie Gunter, Dorothy Reynolds, and one other to be add ed."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.08, 745.71, 2078.2, 1072.51], "bbox_id": "c4f16a171e", "file": "AppomattoxNewspapers_1915-1918a_0078.pdf", "page": 1, "text": "tt  i tiKiavTd 8 Òn?pptÌ-1 hunting trip to Buckingham. Mr. Bryant Ferguson, who e sides near Vei million, died this __ uiorning. He was about 65 yrs Cornelia Gils, Annie Purdum, of age and had been ill for some jflb BaLcock, Lucile OBrien, t me. -  Gladys Agee, Kathleen Morgan ________ Little- Edward Galliab, while I Nettie Moses, Mary Tayor I 0rganiztiou until 1891, when playing on a pile of lumber last ! dilla, Jamsie Ferguson. the resigned and retired from Friday, caught hiB foot and broke I Six grade Clemmie Gun er,  acjye business. Lee Giles, Angus Feen, Regi ma 1 Stanley. Fifth gradeWilliam Burke, Elmer Smith. Boscoe Burkey, Avis Brow n,. Evelyn Brown, Noia Burkey j Vera Morris, Ruby Walton. Fourth gradeGeòrgie Inge, Jude Hundley held bis regolar I John C aroli Stanly, Charles rm of the Circuit Court here last Robinson, Orote D rinkard... . gerved bu . . sheriff d . m . worn, po.oaice J week. Very little court work was j anet Austin, Julia F e r g u s o n , ! .   that  pacit   sheriff-jotmG.Mtuer, poBwutoej disposed of. A few chancery r-1 Mary Rucker. Bessie Harwood, I tbirty-seven years  He w couuty-w. J. Hutorn. poBtomeejders and decrees were entered. Nannie Carter, Esther 8cheff0 iginally amemberof Marshall m -G . M. Bosera, posfoinee His Honor, George J. Hundley Her. Myrtle Smith. lodge o f,Masons, leaving that ey for tae commonwealth-. w .hHg been de8lgnated by the Gover Third grade-L yle M c D e a r - 1 at tbR time of tbèo ani. noi to nold Court for Judge West. I man, Arthur Robertson, Oto Our Judge will have a t at of thelGodsey, Luther Godsey, Lewis real Hopewell side of the docket. I McDearmon, Nettie Harvey,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "few chancery r-1 Mary <mark>Rucker</mark>. Bessie Harwood, I tbirty-seven"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "few chancery r-1 Mary <mark>Rucker</mark>. Bessie Harwood, I tbirty-seven"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [803.32, 1209.39, 1284.59, 1355.22], "bbox_id": "ebad5d7142", "file": "AppomattoxNewspapers_1926-1933a_0493.pdf", "page": 1, "text": "Tmfi n i   r   . Y bil,e banks and in- Jett Rucker, of Lynchburg, are  dustrial firms are not payimr spendmg the week with Mrs. dividends at this time, it is Addl.e ates. gratifying to notice that both Miss Mary Smith, of Ever- Pr local banks are payimr green, visited Miss Mabelle their usual dividends. Dillwyn, June 30.Thieves robbed and then set fire to I. C. Jones service station, near here, early last Friday morn ing. No arrests have been made yet, but officers claim that they have several sus pects."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "banks and in- Jett <mark>Rucker</mark>, of Lynchburg, are  dustrial"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "banks and in- Jett <mark>Rucker</mark>, of Lynchburg, are  dustrial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.5, 416.11, 1495.16, 506.26], "bbox_id": "c0f1531907", "file": "AppomattoxNewspapers_1939-1943a_0168.pdf", "page": 1, "text": "Those from Pamplin attending the wedding o f Miss Virginia Plunkett, were Mrs L . N . Ligon, Misses Margaret Ligon, Jane Gray Paulette Elizabeth Rucker and Mrs. JT C  Ligon 1 1 c. E L. Paulette, who has ben working ,witth a road contractor fa at nome for the winter, months"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Jane Gray Paulette Elizabeth <mark>Rucker</mark> and Mrs. JT C"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Jane Gray Paulette Elizabeth <mark>Rucker</mark> and Mrs. JT C"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.52, 1284.26, 1605.91, 1475.64], "bbox_id": "91c5a070c4", "file": "AppomattoxNewspapers_1915-1918a_0519.pdf", "page": 1, "text": "Thornton an d R ed Cross Soldiers. J Junior Red Cross will do the public square on ty, Feb. 22, tbe banner  being the winner in the toerehip contest. They will rthe program given below from Atwoods store .! aQd earnestly request aliens of town to lend en- ogement, by their presence. AmericaJr. R C. iares8Herman Bass. figAnna Vries. 2  Kathleen Rucker. ,D8Jr. R. c. W-Mildied Trent. I1 Cross HistoryLill-"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "figAnna Vries. 2  Kathleen <mark>Rucker</mark>. ,D8Jr. R. c. W-Mildied"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "figAnna Vries. 2  Kathleen <mark>Rucker</mark>. ,D8Jr. R. c. W-Mildied"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [326.9, 386.68, 491.39, 506.88], "bbox_id": "2c1a0f4216", "file": "AppomattoxNewspapers_1908-1909a_0145.pdf", "page": 1, "text": "This son of Appomattoxdied at his home in Bluefield, W. Va., on the 16th instant, where he had resided and grew up with the city from a young man. He was 68 years of age and had been agent of the N.  W. Ry., newly all of his life. He Is sur vived by his widow, Rucker Jenkins, a son, Mrs. Wesley"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "vived by his widow, <mark>Rucker</mark> Jenkins, a son, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "vived by his widow, <mark>Rucker</mark> Jenkins, a son, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [391.18, 436.83, 558.06, 751.93], "bbox_id": "4d808558be", "file": "AppomattoxNewspapers_1926-1933a_0145.pdf", "page": 1, "text": "This son of Appomattox died at his home in Bluefield, W. Va., on the 15th instant, where he had resided and grew up with the city from a young man. He was 68 years of age and had been agent of the N.  W. Ry., nearly all of his life. He is sur vived by his widow, Rucker Jenkins, a son, Mrs. Wesley Scott and Miss Mary Jenkins, daughters and Robert S. Jen- ins, a brother, Mrs. Ida Caw- thorn, Mrs. Ella Swan and Mrs. mma Covington, sisters, of this county. Burial at Bluefield. Deceased was prominent in the affairs of his city and was large- y interested in the coal business. A telegram received here yes- terday announced the death of Ars. O. C. Jenkins, who had been ill for a long time. The shock of her husbands death was too much for her weak stitution."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "vived by his widow, <mark>Rucker</mark> Jenkins, a son, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "vived by his widow, <mark>Rucker</mark> Jenkins, a son, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [645.83, 875.1, 816.45, 1639.15], "bbox_id": "ff0291b0af", "file": "AppomattoxNewspapers_1898-1902a_0196.pdf", "page": 1, "text": "them beiug turned inside out Nothing was found upon the person ! of the deceased, save two small  scraps of paper and a collar-button in one of the vest-pockets. This testimony was introduced by the defense for the purpose of showiug that the pistol xvith whicli they had charged that the deceased was armed had been taken from his person, along with his other effects, during the time that the bodv lay unpro tected in the public road after Mr. Peet had left it. The Commonwealth also intro duced Justice Rucker to prove the statement that Harvey made to him just after the shooting. Mr. Rucker stated that Harvey told him thut xv het he and Mayo reached the point at which the shooting occur red, Mayo insisted on being driven hack to Lynchburg at once, and de dined to go further and that he. Harvey, remonstrated with him, at tned to persuade him to go at least as far as Peets store, and-he would send him back from there to Lynch burg early the following morning, At that, Mayo, Harvey said, became greatly enraged, and grabbed the lines out of his Harveys hands, and undertook to turn the buggy in the direction of Lynchburg and ihat he Harvey, feariug that the buggy would be overturned, sprang out, and went to the horses head As soon as he reached the horsei head, Mayo, with a violent oath said,  I will blow your dd brains out and at the sum time he put his right hand on his hip-pocket, afc if to draw his pistol and that he Harvey, believing that Mayo was about to kill him, drew his own pis to, a double-action Smith and Wes son, and fired all five shots as rapid lv as he could. Harvey himself testified to the facts as detailed by Justice Rucker, A number of witnesses were ex amined by both sides as to Mayos reputation as being a desperate and dangerous man when under the in fluence of liquor, those for the Com monwealth saying that they did not know he had st.ch a reputation, and those for the defense stating that his reputation in that respect was well known, and that he was geuer ally regarded as a desperate and datigeroii8 man. Other evidence was introduced hy the defense, which, though not positive in its character, tended to show that the deceased was armed with a pistol at the time the tragedy occurred. The case was given to the jury at 7 oclock Wednesday evening, and they, failing to agree that uight were adjourned over until 8 oclock- on Thursday morning, when they promptly returned a verdict of not guilty.Lynchburg News."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "also intro duced Justice <mark>Rucker</mark> to prove the statement"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "also intro duced Justice <mark>Rucker</mark> to prove the statement"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.71, 188.35, 1902.56, 975.66], "bbox_id": "af93489fe1", "file": "AppomattoxNewspapers_1974-1975a_0418.pdf", "page": 1, "text": "The Rev. J. D. Scruggs and his Mens Chorus of the Rising Sun Baptist Church, Amherst, Va. will render service at the Promise Land Baptist Church this Sunday evening at 3 p-m. j ,11 officers, m em bers and i riends are cordially invited to attend. The service is for the benefit of the annual Hayes Jay program sponsored by the Virginia College. Im pressive services w ere held at the Galilee Baptist Church last Sunday morning. The pastor delivered an inspiring message. Beautiful music was rendered by the senior choir. One individual joined the membership of the church. A few visitors were present. The annual youth day will be leld at the Mount Shiloh laptist Church on the third Sunday evening in this month at 3 p.m. The Pinn Family of Lynchburg, will be the special guest. The annual Homecoming services will be held at the Mount Ohed Baptist Church this Sunday morning at the regular preaching hour. Dinner will be served by the ladies of the church. Tlie public is cordially invited to attend. The regular quarterly meet ing of the Mount Shiloh Baptist Church w ill be held th is Saturday evening at 7 p.m. All officers and members are asked to be present. Business of importance will be discussed. Service was held at the Zion Baptist Church, Pamplin, last Sunday at 1130 a.m. Rev. L. E. Hankins, pastor, delivered an inspiring sermon. His subject was, Come See That Man. Although it was a rainy day a large crowd attended. Mr. and Mrs. Wavely Gray of New York w ere among th e visitors present. Mrs. Julia Terry of Richmond, presented two beau tiful vases to the church. Mrs. Alma Robertson who also made the floral arrangements. Plans have been completed for the ordination service of two young men to the deacon board of the Zion Baptist Church on the first Sunday afternoon in October at 3 p.m. The young men appointed by the church are Messers Claude Ferguson and Sidney Lawson. The Pastors Aid Club plans to meet on Wednesday evening of this week at the home of Mrs. Magnolia Franklin. .w On the sick list in the Pamplin comppnity are Mrs. Beatrice Rucker, Mr. Clarence"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "comppnity are Mrs. Beatrice <mark>Rucker</mark>, Mr. Clarence"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "comppnity are Mrs. Beatrice <mark>Rucker</mark>, Mr. Clarence"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [970.09, 397.41, 1129.9, 1238.26], "bbox_id": "dd70a78fd7", "file": "AppomattoxNewspapers_1898-1902a_0199.pdf", "page": 1, "text": "The report of the Bureau of Navigation shows that the years output of American shipyards has been tbe largest of any year, save one, for a quarter of a century. No credence h given to tbe report that President McKinley has offered the portfolio of Si cretary of War to General Horuce Porter, who declined it. B ports receive by Surgeon General Wyman indicates a satisfactory condition of the plague ship Nip on Maru. The Agricultural Department has been using tbe moving-picture machine to illus trate the growth of plant life, Hanson Brldgefortb, who Intentionally shot himself la Newport News, Va., is dead. The case of George E. Lnlz against J. Goldsmith A Co., in Danville, Va., was settled ty payment of 801 A fire in Woodstock, Va., destroyed the Sbeuandrah House stables and damaged adja lent property. Mrs. O. A. Trannen, of Viaeland, N. J., has been able to flud no trace of her dugb- ter. who disappeared from a Philadelphia hotel. A mutiny is said to have oocurred on tbe cruiser Panther during her voyage from Porto ltico to Philadelphia. Miss Elizatetb L. Chisolm, an heiress, of Atlanta, was married to Walter B. Audrews, of Southampton, L. I. Chicago packing house employes decided not to start a general strike until their union is stronger. Two people were killed and fifteen in jured in a street-car collision in Pittsburg. General Horatio G. Wright, died at Wash ington. t Charles J. Bonaparte, of Baltimore, deliv ered the principal address before the Pbt Beta Kappa Soeiety, of Howard University, in Boston. Mayor James Bslbirnie, of Muskegon, Mich., was shot and killed by a disappointed office-seeker, who afterward committed sui cide, Eugene Zimmerman, vice-president of tho Cincinnati, Hamilton and Dayton Railroad, Rnd Lis associates have bought the Talla dega Iron Furnace, the Birmingham and Atlantia Hallway, running from Talladega to Pell City, 27 miles, and 3,000 acres oI coal and iron lands. The furnace will be in oper ation in 30 days. The deal moans tbe resur rection of excellent properties. The number of men on strike at tbe stock yards, Chicago, is variously estimated at from 509 to 1,500. Strikers assert that a general 6trike of skilled hands will take place this week unless their demands are met. It is announced that Gen. Robert MeCuI- lob, of Cooper county, Mo., will be a candi date for Congress in tbe Eighth district, to succeed the latg Richard P. Bland. General McCulloh is mnjor-general of tho Confeder ate Veterans of Missouri and served in the Civil War as colonel in tbe Second Missouri Confederate Cavalry. Advices from London, Clay county, Ky., are that adult male members of the Baker family are leaving the county since tbe re cent attempt to kill Beverly Baker. Dee Baker remains in London with Mrs. Christo pher Jnoksoo, bis sister. The Board of Regents of the West Virginia Schools for the Drat and Blind at Romney have restored the former salaries of teach ers, which were reduced to 850 from 900 a few years ago, and increased the salary of Principal J. T. Rucker from 1,500 to 1,800. Mr. Ruckers salary had been increased from 1,20 at a previous meeting. General Manager Underwood, of the Bal timore and Ohio Bailroad, has a plan to unify and simplify tbe titles of officials. Several of tbe officers have duties to perform which are not shown by their official desig nation, nnd the following changes bare been made Harvey Middleton, now General Superintendent of Motive Power, will be Mechanical Superintendent in charge of all shops, and tbe construction of and ro airs to locomotives and cars. David Lee, En gineer Maintenance of Way, lines west ol Ohio River, will be Superintendent Main tenance of Way, Traus-Oblo division, and D. A. Williams will bo Superintendent of Stores."}, "highlight": {"text": {"matched_tokens": ["Rucker", "Rucker"], "snippet": "of Principal J. T. <mark>Rucker</mark> from 1,500 to 1,800. Mr. <mark>Rucker</mark>s salary had been increased"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker", "Rucker"], "snippet": "of Principal J. T. <mark>Rucker</mark> from 1,500 to 1,800. Mr. <mark>Rucker</mark>s salary had been increased"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2220.67, 1431.63, 2532.03, 1475.38], "bbox_id": "75ea308d14", "file": "AppomattoxNewspapers_1915-1918a_0318.pdf", "page": 1, "text": "The Pulaski National Bank pur-  CH A R T E R 8 I 88 UED. chased a sit for a lodfn The Peoples Garage, Incorporated, building. Plans and are Bedford. B. A. Rucker, secretary and to be made at once, and It b i Q M t trBBSurer. j . Mott Lindsay, vlce-presl- ed to have the structure ready for . n n u ,lrra, n  f Rndford."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "are Bedford. B. A. <mark>Rucker</mark>, secretary and to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "are Bedford. B. A. <mark>Rucker</mark>, secretary and to be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [292.09, 425.71, 455.49, 545.86], "bbox_id": "23cee26047", "file": "AppomattoxNewspapers_1912-1915a_0280.pdf", "page": 1, "text": "The prize winners were Ten ears white cornNorthern dis trictFirst, H, M. Luttrell, Dela- plane second, B. A. Rucker, Dela- plane third, W. L. Nauser, Haymar- ket. Southwest districtFirst, J. S. Pech- in. Buchanan second, W- F. Coyner, Waynesboro third, W. M. Kirk patrick, Lexington. Southeast districtFirst, Henry Ma- nicke, News Ferry second, G. S. Nick els, Bedford City third, A. H. Moore,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "plane second, B. A. <mark>Rucker</mark>, Dela- plane third, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "plane second, B. A. <mark>Rucker</mark>, Dela- plane third, W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.03, 1301.64, 1562.45, 1978.29], "bbox_id": "59da6fd71e", "file": "AppomattoxNewspapers_1898-1902a_0412.pdf", "page": 1, "text": "The Petersburg merchants say that the trade for the past year has been very good, and will compare most fav orably with the business of 1899. The amount of building done during the past year will foot up over 150,000. The outlook for building during the coming year is also most encourag ing. Near Churchland, Norfolk county, Jim McClinty and Joe Clements, alias Cotton, colored, engaged in a quarrel about a woman, McClintys wife. Words led to blows, and during the struggle Clements drew a pistol and fired. The ball penetrated McClintys left side, near the heart, and he fell dead. Clements escaped. The case of Henry Rucker, admin istrator, and Paul Taylor vs. The Southern Railroad, in which 8000 damages were awarded in the Circuit Court of Campbell, has been compro mised for 7000. The case was argued before the Court of Appeals a few days ago. Rucker was killed and Taylor badly injured by a Southern Railroad train. Another most important enterprise for the city of Lynchburg will be the big shoe factory to be erected by the Ciaddock-Terry Company. A site has been selected directly in touch with the Southern Railroad and conveniently near both the Chesapeake and Ohio and Norfolk and Western Railroads. Judge A. S. Faviile, a brother of Orian Faviile, the first Lieutenant Governor of Iowa, died at Berkley. De ceased was 78 years of age and leaves a widow and three sons, one of whom is Fred F. Faviile, of Storm Lake, Iowa. Judge Faviile was a native of New York State. William Ferguson, a colored boy liv ing near Keswick, was terribly man gled while attempting to board a freight train east of Shadwell. The new government building in Bristol was received by Inspector Holmes, on behalf of the government. An appropriation of 20,000 is to be asked for in order to improve the grounds around the building and build suitable approaches. A young white man named John Vreeland, from Tennessee, was almost instantly killed near Church Road sta tion, on the Norfolk and Western Rail road. by falling from an east-bound freight train, on which he was stealing a ride. It is expected that steps will be taken soon to commence work on the proposed Phoebus-Fox Hill railway, which will be the first link in the road that will one day connect Yorktown, Williamsburg and Newport News. A. L. Parker, a Warwick county dairyman, was held up two miles from Newport News by two negro highway men and robbed of 100. The men came out of the woods and covered Parker with guns. Hughes Dillard and Will Holland, negroes, of Martinsville, quarreled and Dillard shot the other twice. Liquor was the cause of the shooting. Dillard  was arrested after a struggle."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "The case of Henry <mark>Rucker</mark>, admin istrator, and Paul"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "The case of Henry <mark>Rucker</mark>, admin istrator, and Paul"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2174.74, 1483.67, 2336.09, 1696.76], "bbox_id": "da69afc45b", "file": "AppomattoxNewspapers_1933-1936a_0286.pdf", "page": 1, "text": "The personnel of the Virginia Dark Fired Tobacco ssociajtieaa warehouses has been announced for the coming Marketing reason. The iFsrmville association ware house will have the foiling set-up H. H. Hubbard, warehouse man ager T. W. Bruce, bookkeeper W. N. Glenn, clerk J. H. Marshall Jr., clerk L. M. Drinkard, floor man W H. Chappell, asaistentf loor man F. A. Putney, ticket maker J. C. Richardson, auctioneer.  The following will be in charge at the Lynchburg association ware house C. R. Morton, warehouse man ager W. C. Harvey, assistant ware house maiagerllW. M. Puckett, bookkeeper W. C. Bailey, clerk Gregg Roach, clerk Sam s. Rucker floor manager J. A. Bryant, auct ioneer F. D. Jones, ticket marker J. Y. Harvey, weighman."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Roach, clerk Sam s. <mark>Rucker</mark> floor manager J. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Roach, clerk Sam s. <mark>Rucker</mark> floor manager J. A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [918.7, 981.62, 1088.94, 1910.09], "bbox_id": "d404a84f08", "file": "AppomattoxNewspapers_1898-1902a_0153.pdf", "page": 1, "text": "The News of Stonew all. Just about thawed out, and. have gaiued the courage to venture .mi- of-doors again, and to look around ! j to eee whether that much-talk d-i about ground-bug has had the nerve  to put his Dead out of the ground 1 again. Fioni current reports. Air. , Howard Harding has oeen watching a certain groumi-hogs hole, with a  gun iu his hand, ever since the wea- ther has warmed up, vowing to ml! ! the little beast this time, if he even i shows the white of his eye. We j wish hint much success only wi.-ls I he had reached this determination 1 sooner. The farmers here begin to get to  work agaiu, burning plant-beds, and  carrying off the weed. Air. Alonzo i Moore, Howard llarding, Homer j Babcock, Ghauncey Babcock, Wi- ktr Alarrin, aud Joseph Ferguson  carried off loads this week. Prices j were low, but us good as could Oe i ixpected, considering the condition of the market. The roads are iu a beautiful con- ditioucot quite of the consistency to make mud pies, and in that siaie where they say that the smooth and beautiful roads lead to He flowery beds of case. We cau say from the depths of our hearts, as Brutus said to Catuline How long, oh. Appo mattox, must we suffer this most deplorable condition of roads ? The creek s a.id James river ate both on a spreefull and running overpreventing crossing. Mr. Kirby Smith, wife, and chil dren have beeu sick but were glad to hear that they are all rapidly im proving. Mrs. John Grow has been quite sick this week, but at this writing we Lear that she is somewhat better. We have ha! no preaching here for some time, on account of the stormy weather. We are afraid that we will all becoipe heathens, from causes due to nature. Miss Mattie Moss has opened her school at Piny Ridge again. Mr. Robert Moore had a horse badly hurt last week. The animal became frightened and ran away, cutting his side quite badly, but not fatally. Dr. Rucker was called in to render the necessary surgical at tention. We are glad to heai weve a-veteriuary surgeon among ua. Since the weather has opened up, we are looking for the onslaught oi the candidates for office. From the number in the field, we expect to be overrun- by them. Come one at a time, and give us a chance to get oyer one attack before we have an other. Mr. Thomas aylor says he has six dogs which are very fond of calves, and we should not wonder if they give him a widu berth. Well, come along and do your hand-shak- iug, candidates we bid you all God speed. Air, Ben Chinault had a tooth ex tracted one day this week-a saving in the food line. We are iu receipt of Mr. George T. Peerss circular letter. We forgot to say, wlfen speaking of the cold weather, that every one in this neighborhood was caught without fire-wooda cold snap, but uot a soft oue, when we consider the advantages of getting wood in eighteen inches of snow. A great deal of Amherst bacon was roped in during the several days of deep suow, aud, as the author of Jessie says, we dined."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "but not fatally. Dr. <mark>Rucker</mark> was called in to"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "but not fatally. Dr. <mark>Rucker</mark> was called in to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1977.8, 887.63, 2144.35, 1056.44], "bbox_id": "05cbceb89d", "file": "AppomattoxNewspapers_1939-1943a_0281.pdf", "page": 1, "text": "The new officers of the Pamplin S udent Cooperative Association are as follows President, Lawson Pankey. Vice-president, Frances Johnson. Sec- tary, June Clark. Treasurer, William Carson. Reporter, Janie Coleman. Faculty sponsors, Miss Bessie Giuner and Miss Elizabeth Rucker. Shortage of Physicians"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Giuner and Miss Elizabeth <mark>Rucker</mark>. Shortage of Physicians"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Giuner and Miss Elizabeth <mark>Rucker</mark>. Shortage of Physicians"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1011.85, 1435.64, 1302.21, 1540.95], "bbox_id": "7418cbf9a3", "file": "AppomattoxNewspapers_1922-1923a_0416.pdf", "page": 1, "text": "The New Idea Womans Magazine contains over 100 page month of fashions, dressmaking, needlework and household helps Each number is beautifully illustrated and contains nine Ww fashion plates, some in color. , These two publications furnish reading for every member household RUCKER CUARK5 TOBACCO"}, "highlight": {"text": {"matched_tokens": ["RUCKER"], "snippet": "for every member household <mark>RUCKER</mark> CUARK5 TOBACCO"}}, "highlights": [{"field": "text", "matched_tokens": ["RUCKER"], "snippet": "for every member household <mark>RUCKER</mark> CUARK5 TOBACCO"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1603.44, 1532.09, 2248.19, 1719.44], "bbox_id": "c238805510", "file": "AppomattoxNewspapers_1915-1918a_0063.pdf", "page": 1, "text": "The nd Mittie Naah,  id    7 . 1teirB .au ot the m e ,iu g , , and I n h ar bm . ipte P-J to 0 . 1 , NOTICE. I Jim , Dong, and Cartia M artin, P   L. Form er , The Local Board of Review I Charlie Miles, W illie Torrence, M any red-hot epeecnes jWre l ed Dew 8 paper anci Times-Virginian of Assessmente will sit a t Ap-1 David Evans, Schyler and  ma an strong resolutions j together for one year for 1,65. pomattox Court House on Wed- J Dave Marshall, George Rucker. I were adopted. Citizens vied nesday, November 17th, 1915, T i nd j 0hnnv CaidwAii I w ith each other fn offering beginning a t tc n  r tn c t.A for the p r o v e d n c i  D  Anv persons w ho feel aggrieved   ax to r n osier, ioipn M orris I ___ . _ _______ I d e n t is t s at the assessment of the L and land Jim Ford. About 1030 h a,ling an committees ware j M  Appomttox tn nm two on Assessor for 1916 may lay their oclock refreshm ents w erea PPi,lted  gatherxn subenp- complaint before the Board,  8erTed and goon after th e tionB for the P10!6- The town and the Board will take vH crowd departed wishing M is s Iof DiUwyn signified the inten- Morris would invite th e m  on through ite officers, to m ake a large donation for the purpose ot helping to erect the 8s.  in yoat news items proposed new buildings."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "J Dave Marshall, George <mark>Rucker</mark>. I were adopted. Citizens"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "J Dave Marshall, George <mark>Rucker</mark>. I were adopted. Citizens"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1467.34, 724.03, 1619.03, 1154.21], "bbox_id": "aa242aee7c", "file": "AppomattoxNewspapers_1918-1922a_0142.pdf", "page": 1, "text": "The most delightful social event ot the Easter simian was that of the dance FriJej night given by the membejreof the Appomattox Count!y iiub at their club rooms. fUilendtd music was furnished ji Spen cers J.- zz Orchestra, ofLynoh- burg, and a most pioyable tim e was had until ih wee sm a hours . Those piient in eluded Mr. and Mrs. W. B. C.ldwell, Dr. and Mrs. C F. Jabs, Mi. and Mrs. R E. CaldvKl, Mrs R. L. Burke, Mrs J Rfiwood, Mr. aDd Mrs. 8 W. Sn, Mrs. Thos. Jones, Mrs. Jetfalmer, Mrs. L. W. ThrockmoAci, Mrs. C. T. Moses, Mr. Masiif New- bill. Misses Eloise At woe, Vir ginia H ancock, MatgeSears, Eula May Burke, ElyaVIcore, Roanoke Miss Gayn-eGlilies- pie, Bedford City tbleen Rucker, Oallye Babcock Meesrs. Joel Flooi Eddie Moore, Bradley abcofkBrax- toa Hancock, Harold fe n c e r Hunter Moses, W altirScott, W. O. Moss, CookeGrreit, Jack Moore, Ed win L a m s , L. F. Ferguson, J  n J u rtis Caldwell, Ryland Mini Dr D M. TwymaD, Dr L sLiayle, ----- Stewart"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "pie, Bedford City tbleen <mark>Rucker</mark>, Oallye Babcock Meesrs. Joel"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "pie, Bedford City tbleen <mark>Rucker</mark>, Oallye Babcock Meesrs. Joel"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [768.24, 1109.65, 926.24, 1298.32], "bbox_id": "b712f35821", "file": "AppomattoxNewspapers_1898-1902a_0303.pdf", "page": 1, "text": "The Mass-fleeting Last Thursday, There was a large and enthusiastic masi-meeting held here on court day to elect-delegates to the congression al nominating convention, which is to meet in Buena Vista August 1. The meeting was called to order by Chairman S. L. Ferguson. Dr. D. Mott Robertson was then elected permanent chairman, with Dr. Thos. R. Rucker as secretary. The members of the different dis tricts adjourned, on motion, to sepa rate rooms, aud nominated delegates to the convention. A motion was made, aud unaui-"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "with Dr. Thos. R. <mark>Rucker</mark> as secretary. The members"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "with Dr. Thos. R. <mark>Rucker</mark> as secretary. The members"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.68, 826.2, 1823.95, 896.75], "bbox_id": "f808914a08", "file": "AppomattoxNewspapers_1918-1922a_0407.pdf", "page": 1, "text": "The many friends of Miss Kathleen Rucker will be inter ested in tbe announcement of ner marriage to Dr. Barksdale, a student at Medical college, Richmond, Va., last Siturday."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "The many friends of Miss Kathleen <mark>Rucker</mark> will be inter ested in tbe announcement of ner marriage to Dr. Barksdale, a student at Medical college, Richmond, Va., last Siturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "The many friends of Miss Kathleen <mark>Rucker</mark> will be inter ested in tbe announcement of ner marriage to Dr. Barksdale, a student at Medical college, Richmond, Va., last Siturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [997.44, 587.96, 1297.58, 771.46], "bbox_id": "b1af4d7ef5", "file": "AppomattoxNewspapers_1902-1905a_0541.pdf", "page": 1, "text": "The Johnston Binder, an d Disc Cultivât for making Corn and T obaccoits equ not to be found. P errow , E v a n s ê  C 1216 , 1216 MAIN STR EET LYÎtSQHiBIJRC, VIRGINIA Rücker,"}, "highlight": {"text": {"matched_tokens": ["Rücker"], "snippet": "STR EET LYÎtSQHiBIJRC, VIRGINIA <mark>Rücker</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rücker"], "snippet": "STR EET LYÎtSQHiBIJRC, VIRGINIA <mark>Rücker</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [949.28, 1224.07, 1108.85, 1526.39], "bbox_id": "a8fad2369d", "file": "AppomattoxNewspapers_1898-1902a_0327.pdf", "page": 1, "text": "The delegates to Conferenoe were entertained as follows At E. W. TaylorsRevs. W. J. Young, D. D., W. A. Christian, W. E. Edwards, D. D. Messrs. J. B. Winfree, C. V. Winfree, Peter Ains- ley, H. C. Victor, Camiilus Christ ian. At A. H. ClementsRev. J. W. Bledsoe, D. D., James Cannon, Jr. Messrs. John T. Taylor and James Morriss. At Robert IrbysRev. Lloyd T. Williams Messrs. Jno. W. Elam and M. P. Rucker.  t P. R. WooldridgesRev.. W. K. Evans and wife Messrs. J. F. Spencer and Richard Pollard. At J. ii. btiuleysRes. b. Y.. Day aud C. il. Galloway Messrs. W. F. Bell aiid.J. D. Mays. At R. F. Burkes lie vs. J. W. Stiff and B. E. Ledbetter. At J. R. HillsRevs. W. J. Wil liams and Robert O. Payne Mr. W. H. Taylor. At L. T. SeaysRevs. W. A. Tompkins aud B. T. Candler. At J. F. PurdumsRev. T. W. Leitch, Mr. John Cash."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Elam and M. P. <mark>Rucker</mark>.  t P. R. WooldridgesRev.."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Elam and M. P. <mark>Rucker</mark>.  t P. R. WooldridgesRev.."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [863.74, 317.49, 1026.62, 742.18], "bbox_id": "a88b8249ae", "file": "AppomattoxNewspapers_1898-1902a_0265.pdf", "page": 1, "text": "the day ,in tbis Vicinifcy- Farmers J 8 hauling to bacco to the The death of Mrs. Jfrnnia Tanner, which has already been Jntioned, was a shock to this viein. where she had many relatives aud ijttBds, Mr. Robert Furbushhas return  from a trip to Cincinnati. j  Mrs. M. A. Duncau has returned from a pleasant visit to relatives in Lynchburg and Campbell. Mr. Walter Whitaker, after spend ing awhile visiting his parents, Mr. aud Mrs. Wm. Whitaker, returned to his business in West Virginia. Mr. Chris. Whitaker is in business in Farmville. Rev. C. H. Galloway preached hit- last sermon at Salem before confer ence Sunday at 11 a. m. Mr. Ed Dickerson has accepted a position in Mr. Bates store for awhile. Christmas will cause wedding bells to ring in this neighborhood. Dauiel Singleton is much better. Mr. Lee Mason is engaged in business in Lynchburg. Mr. and Mrs. Allen Rucker, Bris tol visited relatives here last week. Miss Ada Whitaker, who has been spending awhile in Crewe, is at home for a short stay with her pa rents. B eattrice ."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Mr. and Mrs. Allen <mark>Rucker</mark>, Bris tol visited relatives"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Mr. and Mrs. Allen <mark>Rucker</mark>, Bris tol visited relatives"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1503.02, 424.15, 1655.95, 685.79], "bbox_id": "dd59ec1de1", "file": "AppomattoxNewspapers_1918-1922a_0484.pdf", "page": 1, "text": "The corn crop is cut to half a crop and the tobacco crop will not be half a crop in the coun ty. Rain is generally needed over the county. Mrs. J. T. Scruggs and dau ghter, Annie, Mr. Qilliam, Mr. Arthur 8cruggs and son, Arthur Jr., have been visiting the home of Mr. A. J. Martin. A raid was made on the home of Robt. Shields, in Campbell county, last week and 27 gal lons of liquor captured. The accused was bailed in the sum of 2,000. Mrs. Geneva Rucker and daughter, Mrs K athleen ----- of Richmond, and Miss Elvie Moore, of Roanoke, are guests at the home of Mrs. H. O. Bab cock."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "of 2,000. Mrs. Geneva <mark>Rucker</mark> and daughter, Mrs K"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "of 2,000. Mrs. Geneva <mark>Rucker</mark> and daughter, Mrs K"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.4, 499.04, 1515.82, 1021.6], "bbox_id": "1c48ca4b87", "file": "TimesVirginian_1978_0283.pdf", "page": 1, "text": "The boxing coaching staff for the Appomattox boxing team agreed that our local fighters invaded the Lynchburg City Armory Saturday night with a huge amount of success, winning five out of six fights. The best fight of the night was between Bill Vaughan and Mike Rucker. Every punch Vaughan threw was considered a power-punch. Vaughans hard punches ended the fight in the second round on a T.K.O. Chief seconds Jack Torbert and Raymond Mullins had nothing but praise for Vaughan who followed instructions and did exactly as they instructed. Heavy weight Clyde Fergu son won an easy first-round knockout over Charles Bennett of North Carolina with a series of hard punches. This fight lasted only 33 seconds. Marc Stone stopped James Blankenship in the second round with an educated left jab followed by a left hook. T.K.O. second round.  Thomas Cheryba had the ! easiest fight of the night. He j won with a Walk Over against jl Howard Bradley. Walk .Over is 1 when the opponent refuses to  enter the ring, j Seven yeair old, 50 pound  Terry Ferguson fought a draw with Frank JackSon bringing ! home a nice trophy. m The only loss of the night was M Tony Cole against Lee Smith, j Tony fought a gutsy fight but. 3 1ackedHhe pHySicarstamina to defeat omith. S t it i"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Bill Vaughan and Mike <mark>Rucker</mark>. Every punch Vaughan threw"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Bill Vaughan and Mike <mark>Rucker</mark>. Every punch Vaughan threw"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1591.72, 576.71, 2073.29, 737.51], "bbox_id": "90fd9e41c1", "file": "AppomattoxNewspapers_1915-1918a_0078.pdf", "page": 1, "text": "the beginning of the war be tween the states Mr. Christian volunteered and left Lynch burg with the Wise troops. He remained in the Confederate ----- - v .j service until two years later, Jessie Paris, UraHarris, irgia l wben be was incapacitated for The Iiadies Aid Society of the I n g e , G l a d y s Patterson, eor I furtber service by the loss of Presbyterian Church wiij meet atlgie W alton, Eugene . 1 two fingen of one hand, which the Manse here next V ednesday I ridge, Mildred Trent, e 1 beceme infected and gave him Robertson, EleieCarson,Harold I t trouble Qr  tongtime Wingfield, Ashby Rucker, ARer tlie w ar Mr Christian Lewis Doss, Virginia Hancoc  I became associated with the Tate Jessie Coleman, Mortie Morgan,  John w MiUei.  Franklin."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Qr  tongtime Wingfield, Ashby <mark>Rucker</mark>, ARer tlie w ar"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Qr  tongtime Wingfield, Ashby <mark>Rucker</mark>, ARer tlie w ar"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [716.65, 220.63, 865.22, 1261.77], "bbox_id": "3a141e31f0", "file": "TimesVirginian_1976_0361.pdf", "page": 1, "text": "The Appomattox County Historical Society recently received 1914 news articles and other documents that will be of interest to county residents. The donor of the articles, Mrs. Harry Rucker of Monroe, is the former Helen Nowlin. She was the daughter of the late Annie Thornhill and A, Sidney Nowlin of Lynchburg. Mr. and Mrs. Nowlin were descendents of Appomattox County residents frqm the Oakville and Tower H É areas of the county. It was from the steps of the John H. Nowlin home, later known as the Owen home, Oakville, that Congressman Hal Flood made his first political speech. Reportedly asked, Didnt your father advocate C-session he answered Yes! and shouldered his musket and went to war.? One of the articles is reprinted below DAY SET FOR FLOOD - PORTNER MARRIAGE. Washington Soc iety Girl to Wed Congressman here on the Eighteenth of April. All rumors concerning the engagement of Miss Anna Portner and Congressman Henry D. Flood of Virginia were set at rest this morning when several hundred Wash ingtonians found in th eir morning mail a card reading Mr. Alvin O. P ortner requests the honor of the presence of  ------- 1 at the marriage of his sister, Anna Valer, to Mr. Henry Delaward Flood, on Saturday, April 18 at 5 oclock, All Souls Church, Washington, D. C. Reception immediately after the ceremony at the Highlands. The engagement of Miss Portner and Congressm an Flood was announced last spring and several dates for the wedding have been set by rumor, but when the time came, there was no wedding. Rumor then declared that the engagement was broken. In the m eantim e Miss Portner spent the summer abroad and since her return in the fall has spent much time between Washington and New York. During her travels she has gathered one of the most elaborate trousseaux that has been seen in Washington for . several seasons. Miss Portner is the daughter of the late R obert P ortner and -.Mrs. Tortner dfMtiaksiVk. She made her debut séHrtsritl Sétóons ago, bút diiringf the list few years had not taken an active part in society on account of mourning for her mother. She is one of five girls, all of whom are famed for their brunette beauty. This season Miss, P ortner and her youngest sister, Miss Hildegarde Port ner, have made their home at  the Highlands. It has been known amqng the most intimate friends of Miss Portner for a fortnight that the wedding was to take place on the 18th, but they were pledged to secrecy. The bridal party has not been entirely selected. Mrs. Lorimer Graham and Miss Hildegarde Portner will attend their sister and Miss Edith Grade, Miss Portners most intimate chum, will also be"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the articles, Mrs. Harry <mark>Rucker</mark> of Monroe, is the"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the articles, Mrs. Harry <mark>Rucker</mark> of Monroe, is the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1585.79, 193.82, 1746.94, 1092.03], "bbox_id": "9eaad2284c", "file": "AppomattoxNewspapers_1974-1975a_0319.pdf", "page": 1, "text": "The annual Mens Day program will be observed at the Mount Shiloh Baptist Church this Sunday evening at 3 p m. The Rev. R. A. McCray, pastor of the Second Mineral Spring Baptist Church will be the guest speaker. Special music will be rendered by the Jordaines.The Retieres Club of Richmond, will be the guest of the local dub. A literary program will be presented by members of the club. The local Mens Clubs will bring greet ings. The general public is invited to attend. The Ladies Society of the Zion Baptist Church held its regular meeting last Sunday at the usual time with the president, Mrs. Gevena Wig gins presiding. The meeting was opened by the chaplain, Mrs. Etta M. Edwards. The m inutes were read and adopted. The regular commit tees made their reports. The bus committee on going to Baltimore reported that the trip will be cancelled due to many conditions beyond their control. At the close of the meeting a delicious repas was served by Mrs. Edwards. The next meeting will be held at the home of the president, Mrs. Gevena Wiggins, Lynchburg, Va. Mrs. Sarah Doudthus visited in Pamplin last week. The following are on the sick list Mr. Harry Jennings, Mr. Billy Jennings, Mrs. Mary Gary, Mrs. Clarence Gray, Mr. Tom Baker and Mrs. Beatrice Rucker. The Zion Baptist Church Usher Board held its 19th anniversary last Sunday eve ning at 3 p.m. A large crowd of members and friends attended. The Rev. Mr. Williams, of Halifax, Va., was the guest speaker. Several local Usher Boards brought greetings. The president of the Usher Board, Mr. Ronald Franklin, introduc ed the guest speaker. The offering which was very good was lifted by visiting ushers A large crowd attended the regular preaching service at the Mount Shiloh Baptist Church last Sunday morning at the 11 a.m. service. The first part of the service was presented by the youth of the church in recognition of the annual Childrens Day. The pastor of the church deliver! special A isrtfritif all p jttiiit tiurii pdriocPi free will rally -Was conducted for the benefit of the church and a special offering was lifted for the graduates of the church. Mrs. Nancy Owens, of New York, is visiting her sister, Mrs. Bessie Bolden, as the guest of Mia Georginia Fleshman. Rev. and Mrs. R. Q. Lawing were the Sunday dinner guest of Mr. and Mrs. Willie Harvey. The Vacation Bible School of the Mount Shiloh Baptist"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Baker and Mrs. Beatrice <mark>Rucker</mark>. The Zion Baptist Church"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Baker and Mrs. Beatrice <mark>Rucker</mark>. The Zion Baptist Church"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1669.71, 253.27, 1820.02, 977.04], "bbox_id": "ba0eb562cd", "file": "TimesVirginian_1976_0029.pdf", "page": 1, "text": "The annual church meeting of the Promiseland Baptist Church will be held this Saturday at 12 P.M. All officers and members are asked to bfe présent. The program of work for the year will be planned. Officers for the new year will be elected. A general review of the past year will be given by the financial secretary and thé treasurer. The general public is cordially invited to attend the regular morning service at the Promise Land Baptist Church this Sunday morning at 11 a.m. At the close of the morning worship the holy communion will be served. A large crowd attended the regular preaching service at thé Galilee Baptist Church last Sunday morning. The pastor delivered a very inspiring sermon. Beautiful music was rendered by the church choirs. All who came out enjoyed the day of fellowship. The officers and members are asked to attend the regular evening service at the Mount Shiloh , Baptist Church this Sunday evening at 7 P.M. The Junior choir will render music. A very impressive service was held at the Zion Baptist Church last Sunday morning. The pastor Rev. L. E. Hankins delivered a special sermon from the subject What Love can do. The Junior choir of the church, with Miss Florence Mathews at the piano rendered beautiful music. The senior ushers served at the door. Several visitors from local churches were present. The offering for the day was very good.  Mrs. Wilsie Smith who is receiving special treatment in the Lynchburg General Mar shall Lodge hospital is improv ing nicely. News has been received here that Mrs. Beatrice Rucker died in the Roanoke hospital. Funeral arrangements are incomplete at. this writing. Mrs. Lizzie Mack is on the sick list. Mrs. Jessie Haskin Davis, a former member of the Mount Pleasant Baptist Church died in the Lynchburg hospital last Sun day. The local community of PampMp extends sympathy to"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "here that Mrs. Beatrice <mark>Rucker</mark> died in the Roanoke"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "here that Mrs. Beatrice <mark>Rucker</mark> died in the Roanoke"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [332.1, 919.97, 494.89, 1675.16], "bbox_id": "d88e071951", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "T-46 Chaplin Whitfield Adams  47 Rodgers Evans Ferguson T-48 Henry Agustar Turner T-49 Glenn Samuel Martin T-50 Henry Marvin Fore T-51 iGeorge Lewis Ferguson T-52 Adelbert Archer Babcock T-53 Herbert Calvin Stephens T-54 Eugene Hudson Stevens 1 Vl-55 Ernest Murphy Womack  T-56 Emmett Mott Perdieu  T-57 Frank Malcolm Thomas T-58 Clarence Stephens T-59 Ernest Duval Esabell   6 0 George Madison Dixon T-61 Willie De.witt Harvey. T-62 Howard Brigthwell Cralle 1T-63 Henry Wilson Marshall T-64 Charlie Harvey Paulette T-65 Wesley Baker Farrar TI-66 Jossie Peyton Harvey  67 Thomrs Jefferson Hodge T-68 Avery Monroe Hodge 11 6 9 Randolph Chapel Mann T-70 Ernest Foster Farrar T-71 Robert Penny Harvey T-72 Ulysess Williams T-73 Ellsworth Palmer Carter T-74 James Braxton Chernault T-75 Joe William Bryant T-76 iTaylor Horsley Coleman T-77 James Burley McFadden T-78 Judson Cornelius McDaniel T-79 Russell Lafayette Roop T-80 Fleming Rucker McCoy ,r-81 Archie A1 xander Legrand T-82 Dallas Hobert McCoy T-83 Samuel Alvin Bell T-84 Zane Wilson Walton T-85 Arthur Thomas Powell V-86 Maury Gibbs Martin T-87 Charles Roland Smith i-88 James Elbert Rogers T-89 Emery Van Austin T-90 Burnette Turner  -91 Havilah McCoy T-92 Elmo Pitzer Banton T-93 Elon Owen Johnson T-94 William Leroy Owen . T-9 5 Sydney Adams Conner T-96 John Clarence Spiggle .-97 Atwill Dewitt Marshall T-98 Lenard Pollard T-99 Willirm Lewis Martin T-100 Clyde Davidson Carson T-101 Everette Roy Ferguson P.-102 J. Otis Hannah T-103 Wilbur Miller T-104 Herbert Lee Turner T-105 Hubert Walker Gallier T-106 Douglass Hunter 107 Paul Jones T-108 Hazel Lee Campbell T-109 Robert Augusta Bell T-110 William Clay Bell T -lll Langhorn Franklin T -ll2 Herbert Horton Moore -113 Jessie Clerlrnd Bogar 114 Bernice Aubry Johnson T -ll5 Charles Thomas Moses T -ll6 Hudson Daniel Dickerson T-117 Robert Ligon 1-118 Samuel Lewis Ferguson T-119 Elbert Benjamin Davis T-120 William Chandlay T-121 Floyd Winston Martin -122 Samuel Hubert Martin T-123 Shatter Cannon Drinkard -124 Richard Howard Grishaw i-125 Thedore Randolph Gilbert T-126 Charlie Lutheg Kidd T-127 Vester Marvin Clifton T-128 Joseph McNeal Cobb"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Lafayette Roop T-80 Fleming <mark>Rucker</mark> McCoy ,r-81 Archie A1"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Lafayette Roop T-80 Fleming <mark>Rucker</mark> McCoy ,r-81 Archie A1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1825.69, 858.13, 1980.48, 1326.06], "bbox_id": "beb16db756", "file": "TimesVirginian_1976_0355.pdf", "page": 1, "text": "t 4 s Appomattox County Historical Society wiB hold its regular October meeting at Appomattox Middle Sfehool in the cafeteria at 730 p.m. on October 11, 1976 with Dr. Herwyn Williamson, Vice-Pre sident, presiding. News articles and other papers giving detailed accounts of the 1914 Wedding qf Miss Ekmnor Partner and Congress man Henry Delaware Mood wiB be presented to the apefety by Mrs. Harvey Clark tracker of Monroe. Mrs. Rucker is the daughter of the late Annie Thornhill Nowlin and Albert Sidney Nowlin, natives of Appomattox County. Guest speaker for the evening will be Ron WBson, Historian at Appomattox Court House National Historical Park. He wiB present a program on community life in Appomattox during mid-nineteenth century. The lecture based on the report of Dr. John Moore, research hiatnrUn, University of Vir ginia, wiB focus on the network of social factors interwoven into community life economic, census, cultural, political, in dustrial, and agricultural. Mr. Wilson moved to Appomattox in 1975. Formerly . he was historian at the Abraham Lincoln Boyhood Park, and Johnstown Flood National Park, Pennsylvania. Mr. Wilson, his wife, PhyBis, contd on page 13"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "tracker of Monroe. Mrs. <mark>Rucker</mark> is the daughter of"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "tracker of Monroe. Mrs. <mark>Rucker</mark> is the daughter of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1811.04, 1491.63, 1973.39, 1803.77], "bbox_id": "b7aef88360", "file": "AppomattoxNewspapers_1892-1898a_0191.pdf", "page": 1, "text": "Swan G. W. Elk Creek. Sixth districtPeter J.Otey Dem ocrat, Lynchburg J. Hampton Hoge Republican, Roanoke O. C, Rucker Populist aud Prohibitionist Bedford City. Seventh districtS. S. Turner Democrat Front Royal R.J. Walk er Republcan, Hawkinstown G. T. Barbee Populist. Eighth districtElishaE.Meredith Democrat, Brentsville P. H. Mc- Caull Republican, Brandy Station. Ninth districtII. S. K. Morrison Democrat Gate City James A. Walker Republican, Wytheville. Tenth districtHenry St. G. Tuck er Democrat, Staunton  Jacob Yost Republican, Staunton Edmund Cocke Populist, Cumberland Court-  house."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Republican, Roanoke O. C, <mark>Rucker</mark> Populist aud Prohibitionist Bedford"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Republican, Roanoke O. C, <mark>Rucker</mark> Populist aud Prohibitionist Bedford"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.46, 1365.81, 1856.25, 1766.38], "bbox_id": "15a054530d", "file": "AppomattoxNewspapers_1892-1898a_0409.pdf", "page": 1, "text": "Stonewall. We have been asLep for some time up here, but thank goodness we have awaken at last and found things still on a boom, and being  anxious to awake Mr. Coaling we will give him a few items to read. We learn that a promising young physician, Dr. Rucker, of Lynch burg, is to locate, in a few days, at Miueral Va. We welcome him to our county and wish him great success. P. L. Stratton  Sons have bought a new seine, but the water being so cool we learn they have had only fishermans luck, but hope for better luck in the future. ll v. L C. Shearer, of Lynchburg, is expected to spend a few days next week at his old home near Stonewall. We are glad to say Mrs. H. D. Le Grands health has greatly im proved and she is anticipating a visit to Lynchburg soon. Mr. and Mrs W- N. Shearer made a flying trip to Lynchburg Saturday. W. B. Taylor  Son will start a I new saw mill in a few days. Par ties wanting first clqss lumber will some bn QuicklyI g p i t to their interest to send their anently cured by De If itt,s I rjer8 0 W. B. Taylor  Son. iPitch Hazel Salve, the great remedy M j B. Drinkard has a very"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "promising young physician, Dr. <mark>Rucker</mark>, of Lynch burg, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "promising young physician, Dr. <mark>Rucker</mark>, of Lynch burg, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1394.6, 558.28, 1545.06, 880.52], "bbox_id": "108b37ae19", "file": "TimesVirginian_1978_0152.pdf", "page": 1, "text": "Stephen Oglesby Goodman, 65, of Rt. 2, Forest, died Thursday at 825 a.m. in a local nursing home. Born in Bedford County, he was the son of the late Benjamin Barnard and Chattie Padgett Goodman. He was a member of Shiloh United Methodist Church and was a retired carpenter. He is survived by his wife, Sallie Phillips Goodman two sons, Billju-ErGoodman of 1 Lynchburg and Bobby S. Goodman of Appomattox one daughter, Mrs. Betty Smith of Forest three sisters, Mrs. Hilda Elliott of Lynchburg and Mrs. Sarah Rucker and Mrs. Evelyn Walkup, both of Forest, and seven grandchildren. Funeral services were con ducted at 1 p.m. Saturday, April 1, 1978, from Shiloh United Methodist Church, Interment was in Virginia Memorial Park. Whitten Timberiake Chapel was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Lynchburg and Mrs. Sarah <mark>Rucker</mark> and Mrs. Evelyn Walkup,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Lynchburg and Mrs. Sarah <mark>Rucker</mark> and Mrs. Evelyn Walkup,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.61, 237.16, 1681.92, 1830.33], "bbox_id": "ee70acbd36", "file": "AppomattoxNewspapers_1922-1923a_0284.pdf", "page": 1, "text": "Stapleton. The Childrens Day service was a perfect success from beginning to end at Bethel chnrch 1 st Sunday. The entire church was beautifully j decorated iu green and white with potted plants sitting around over j the church. On entering the en- trance room the motto Welcome iu large letters met the eye. Passing on into the church one could see a large arch extending across the chancel rail covered with green and white with motto on it Shine fori Jesus in large gilt letters.. The chancel rail was covered wi ih colors of same surrounded by potted plants. Over the pulpit was a mot to Go ye into all the woildandi preach the gospel in green letters, while the back of the pnlpit was decorated with wreathes of ever green and ferns. Promptly at 10 oclock, with Miss Mabel Chick as organist, the exercises began. The following is a pari of the program Recitation, la Gods SightLaw reuce Woodson Recitation, Help SomebodyRuby Chick Recitation GrowingAdrian Carson Recita-1 tion, The Little PleadersJohn Carson Recitation, The Command of ChristRay Zimmerman Reci tation, I Wouldnt FretRuth Drinkard and Claud Chick Recita tion, Little MissionariesLois Moore Recitation, The Best Gift j Ola Alvis Recitation, Little Things I Alva Moore Recitation, In Chry santhemum LandRuth Drinkard j Recitation, A PrayerMinnie Car- son Recitation, Rainbow banners _ Seven girls. The collection was by no means the least interesting feature of the I occasion. Miss Mabel Chick dress ed in Japanese costume, came -from behind the curtains, followed by Ruth Drinkard, Pharnie Woolfork, Ava Woodson and Claude Chick dressed in .like manner, to whom she handed the collection baskets, and as they passed through the congregation she sang a missionary I solo. The collection amounted to  113.13. The children were well trained and reflect a great deal of credit on the ladies who had them in charge. Other churches may have a service as good but none will ever excel it. I My advice to other churches is do I likewise, that others may see their I good works and glorify their father which is in Heaven. Mis. Dr. Rucker, who has been penning the past two weeks with I her father, W. E. Alooit, of Beck ham, returned to her home at Ped lar Mills yesterday. Grover Grow, who was reported quite ill with typhoid fever in Lynchburg, is much better and his mother aud sister returned hutne I Saturday.  iss Annie Drinkard spen-, last week with Migs Allie Booker and took iu the lawn party at Mt. Comfort. Mr. Samuel Grow and family are all sick with malarial fever. Dr. V.. B. Thornhill, of Lynchburg has been called in to see them. The shrill whistle of the thresh er is heard this morn ng at S. R. Martins calling hands together, j We hope all the crops will be threshed bv the time the meeting starts at Trinity next 4th Sunday night. Miss Sal lie Tavlor of Wild way is I visiting her grandfather, Mr. Wm Dr.nkard and other relatives. Dissolution Notice, The copartnership heretofore ex isting between us is this day dissolv ed by mutual consent. Parties in debted to the firm will please come forward and settle with cash or bond as we are anxious to wind up the old copartnership business. J- H. A bbitt , _ .  J. B. A bbitt 2 -wks Hilton  Jennings. At high noon in the presence of a few specially invitad friends, Miss j Iona Scott Jennings of Bristol Teni. became the bride of Mr. Thomas La Fayette Hilton a prominent  merchant and bnsiness man of Roan Mb Tenn. The bride was gowned in white, gloves hat and shoes to match and carried marchielneil roses with maiden-hair ferns, a gift of the groom. The ceremony was performed by Rev. Geo. N. Cowan of Bristol pastor cf the bride. Mr and Mrs. Hilton left Bristol on the 215 train for their future home at Roan Mt. where a reception was tendered them that night. The brides going away gown was of gray suiting which suiU-d her style of beauty admirably. Mr. and Mrs. Hilton expect to travel through California this winter bnt will-visit the brides parents before they go. We wish th m much success and happiness."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "in Heaven. Mis. Dr. <mark>Rucker</mark>, who has been penning"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "in Heaven. Mis. Dr. <mark>Rucker</mark>, who has been penning"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1462.28, 530.83, 1618.52, 552.33], "bbox_id": "1c5e66156c", "file": "AppomattoxNewspapers_1902-1905a_0358.pdf", "page": 1, "text": "Squire Ik, Rucker, of Campbell, was visiting in the village this week."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Squire Ik, <mark>Rucker</mark>, of Campbell, was visiting in the village this week."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Squire Ik, <mark>Rucker</mark>, of Campbell, was visiting in the village this week."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [895.93, 962.62, 1055.47, 1396.4], "bbox_id": "9951411877", "file": "AppomattoxNewspapers_1898-1902a_0216.pdf", "page": 1, "text": "Spring Mills. We bad a delightful shower last Sunday afternoon. Air. and Airs. R. 0. Flestimails infant has been very sick this last week. We are glad to say that it is better at the pieseut time. Miss Ada E. Cheat ham, of ibis place, is this week visiting in the Wesley Chapel neighborhood, and attending the meeting. Aliss Reva Rucker aud Mr. Joe Turner, of Campbell county, visited Alisses Lena and Kaiiuie Moms on last Saturday week. Air. Eddie Dickerson and. sister, Aliss Nannie, of Spout Spring, wa ited near this piace July 22 and 23. Aliss Etta Bloxion is on au ex tended summer visit. Mormon preachers are in. inis lo cality. , AlissCornelia Barksdale is visit ing friends and relatives in. iianlax couiuy. Air. 0. F . Cheatham is very busy hauling switch ties. Mr. S. E . Howerton and family visited Mr. Tom Oder last Snnuuy. Aliss Vara Howerton, accompani ed by her two friends, Alisses Mary and Ethel Robertson, last week , vis ited her grandparents. Air. B. N . iaiiuei killed a mad dog On Wednesday, Juiv 26. The dog had bitten twelve hogs of Mr. 3. E. Howerton, two geese of Air. 3. N. Cheatham, one goose of Air. Jno. Davis, and nearly all the dogs here about so we must now be careful about dogs. With best wishes for the T imes , I am, as ever, B ruma ."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the meeting. Aliss Reva <mark>Rucker</mark> aud Mr. Joe Turner,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the meeting. Aliss Reva <mark>Rucker</mark> aud Mr. Joe Turner,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2377.18, 388.89, 2567.23, 1148.93], "bbox_id": "5d32d620e9", "file": "AppomattoxNewspapers_1922-1923a_0273.pdf", "page": 1, "text": "Spring Mills. Childrens Day in the Sabbatl 1 Schools of the South, was appro! pnatelv observed at the SabbatCll School of New Concord Pres by f  rian church, on Sunday June 3rd  by interesting and entertaining e x ll ercises conducted  by Supt. J- j. Wood and the active corps of dels voted teachers. The ninsical programme waBi highly enjoyable, while the exeri rises by the happy children touch-! ed the soft spot iq every heart.  Childrens Day in the Sabbath! Schools is dedicated to the aid ofi some particular church work, tbd object on this occasion being the Congo Mission 0f the Tresbytj rian ohnrch, located in Central Af._ rica. The contributions of the dayl added sixteen dollars to The Lap.! sley Support Fund of the mission. The occasion Was Entirely success ful and a credit to the school, the enthusiasm of the children being simply delightful, and the eloquent ! address of Ex-Jndge W. H. feeidf which IV published else hese needs no commendation. ProgrammeThe Morning Light is BreakingSong, by the school A Little Boys Mission.Robertson Wood prayerby Mr. O. D. FraiikI m Im Jesus Little LambSolo!! by Carrie Jones chorusby infant lass Spring -TimeSarah Cheat-! ham, Katie Thompson, Ellen and Ruth French The Great Question Joshua  Rucker, Charlie Jones, David Evans, Dyew.ry Booth, Wil- ie Fore, Willie H epp, Allen and Sobertson Wood, Hosanna! be thé Jhildrena Soqjç-rgong by the school Hear PiebnfeHIvan, Pbarr nd Willie wdiitjeorge and Rob Rucker, t1 ran Jci-.j-Stepp, Marvin oothé, Lyle aJ. Hawes Evans, Hoinsr Carral The Wonderful StoryThelma Cheatham Sun light-song, by school His Name-! Josephine Wood, Grace Jones, Thelma Ghetbá. Berta ThomjV son, Carrie Jories, and Lizzie Fore RecitationBertha Evans Sing It aud Rejoice  AlwaySong by! school Three Christian Grace. Grace Jones, Josephine Wood and Eunice Franklin. Address, Our Cougo MissionJudge Wm. H. j Reid Carry the Meg-age, song-ff by school My-DivineLyle Evans."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "The Great Question Joshua  <mark>Rucker</mark>, Charlie Jones, David Evans,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "The Great Question Joshua  <mark>Rucker</mark>, Charlie Jones, David Evans,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1605.1, 742.25, 1771.16, 1270.9], "bbox_id": "7229531355", "file": "AppomattoxNewspapers_1905-1912a_0165.pdf", "page": 1, "text": "Spout Springs. Miss Mamie McCorKle, of Lynch burg, who has been spending some time with her aunt, Mrs. W. fi. Nowlin, lias returned to the Hill City. Mr. A. W. Jones, of Lynchburg, visited his homefolks on Sunday. Mr. M. 0. Caldwell was a visitor in the neighborhood , on Saturday tnd Sunday. Mrs A. N. Gillett and twins, of Emporia, Va,, were visitors at Mr. W. C. Nowlins last week. We had a very heavy rain on Sunday afternoon and Monday that did much damage. Mrs. P. H. Johnson and children, of South Bontim, Va., are visiting the formers sister, Mrs. J. W. Over ton. The lawn party on Saturday evening was quite a success, al though the weather was threaten- ing and the crowd was small we cleared 54.00. Mr, D. J. Hart, of Pamplins, has contracted to paint Salem church. Mrs. Auld, of Chester, S. C., is spending awhile with her .sister, Mrs. J. E. Chick. Mr. and Mrs. A. T. Rucker and children, of Bristol, Tenn., are visit ing relatives in the neighborhood. Mr. E. C. Chamberlayne and family, of Roanoke, are at Mr. C. H. Furbushs. Mrs. A. A. Jones, of Roanoke, was a visitor in town last week. Mr. H. G. Nowlin, formerly of this place, who is now connected with the N.  W. Ry., was a visitor here on Sunday."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "and Mrs. A. T. <mark>Rucker</mark> and children, of Bristol,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "and Mrs. A. T. <mark>Rucker</mark> and children, of Bristol,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1955.99, 737.62, 2123.5, 1070.67], "bbox_id": "fb4e55d8ab", "file": "AppomattoxNewspapers_1955-1957a_0414.pdf", "page": 1, "text": ".Spout Spring, Va.- John Wesley Coleman Jr. died at his home here February 2, after a year illness. Born in Charlotte County Sept. 27, 1886, he was the son of the late John W. and Emma Smith Coleman. A retired carpenters foreman for Norfolk and Western Railway, he was the widower of Martha Wool dridge Coleman, who died in 1955. He was a member of Spout Spring Baptist Church and Reedy Springs Masonic Lodge, No. 203, Concord. Surviving are one daughter, Mrs. J. E. Moms, Spout Spring three brothers, Luther Coleman, Lynch burg Andrew Coleman, Appomat tox, and Benjamin Coleman, Staun ton  a sister, Mrs. W. C. Roach, of Phenix, and by three grandchildren Funeral services were conducted at 2 P. M_ Feb. 4, at the Spout Spring Baptist Church, by the pas tor, the Rev. Colin Godwin. Music was provided by the church choir. Active poill bearers were R. O. Rucker, W. M. Roberts, Billy Bryahit, G. M. Rucker, James Ford and C. R. Thompson. Masonic rites were said at th e grave by Reedy Springs Masonic Lodge No. 203, of Concord. Burial was in Liberty Cemetery, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "bearers were R. O. <mark>Rucker</mark>, W. M. Roberts, Billy"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "bearers were R. O. <mark>Rucker</mark>, W. M. Roberts, Billy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [743.7, 1477.15, 903.08, 2009.84], "bbox_id": "b408a04ca2", "file": "AppomattoxNewspapers_1898-1902a_0111.pdf", "page": 1, "text": "Spout Spring. The scene of a pretty marriage was solemnized at old Concord Church at 4 oclock on the 13th instant. The contracting parties were Miss Mazie Cheatham, the beautiful and accomplished daugh ter Oi. Mr. T. H. A. Olieatham, a prosperous farmer of this county, aud Mr. Cbas. McKinney, a popular youug man, son of the late D. W. McKinney, a prominent business man of this county. The church was beautifully decorated. The ushers preceded the waiters Miss Laura  Rucker with Mr. Herbert Cheatham, Miss Lena Chil ton with Mr. Ed. Collius, Miss Wil lie Hunter with Mr. Ed, Bates, Miss Kate Bates with Mr. Marvin Jones, Mr. H. Winston McKinney with Miss Bessie Shearer. The bride en tered  on the arm of Miss Nannie Dickerson, the groom on the arm of Mr. Clayton Cheatham, brother of the bride, The bride was attired in a garnet travelling dress and the maid of honor wore a similar cos tume. Rev. Mr. Galloway officiated and Miss Sarah Taylor presided at the organ. The ushers were Messrs- John Overton, Chris. Whitaker, Will Collins, Raleigh Chilton. After the wedding a large number of friends returned to the home of the groom where there was quite a re ception. Messrs. Chas. Whitaker and Chas. Dowell made music, aud dancing continued all night The bride received many handsome pres ents. Mr. Nowlins sale was on Friday. They expect to bid adieu to Spout Springs very soon,., much to the re-"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "the waiters Miss Laura  <mark>Rucker</mark> with Mr. Herbert Cheatham,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "the waiters Miss Laura  <mark>Rucker</mark> with Mr. Herbert Cheatham,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [576.24, 875.45, 735.44, 1243.16], "bbox_id": "e5abd9847c", "file": "AppomattoxNewspapers_1898-1902a_0072.pdf", "page": 1, "text": "Spout Spring. The Edgewood Academy school begun Oct. 10 th with good attend ance. All seem to like Miss Emma Smith very much, we wish her much success. M isses Laura and Reva Rucker, ot Campbell are the guest of Mrs. R. O. Rector this week. Rev. J. W. Parrish is conducting meeting at Salem church this week. Miss S. K. Singleton returned home Saturday from a vish to Campbell, Miss Mazie Coleman of Wildway, is spending this week visiting the Misses Garrett Little George Bates is convales cent Some of the farmers, are still busy seeding wheat Mr.,..Cha 8 . Furbush of Concord, expects to moye in our village next week. MissMackie Simms who is teach ing the Bush Forest school was at home Saturday. Mr. R. E. Megginson of Wildway, was in our vicinity Sunday last"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "isses Laura and Reva <mark>Rucker</mark>, ot Campbell are the"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "isses Laura and Reva <mark>Rucker</mark>, ot Campbell are the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [631.9, 287.71, 794.0, 967.2], "bbox_id": "1967c21a35", "file": "AppomattoxNewspapers_1892-1898a_0502.pdf", "page": 1, "text": "Spout Spring. Silence does not always show isdom, so we will not keep silent any longer. How could we when the trees anil flowers and ail sur roundings are telling of welcome spring. Farmers have begun plant ing corn ind preparing for their crops most of the early fruit is killed. Miss Mackie Simms is suffering from au attack of rheumatism. She has the smypathy of many friends. Hope she may soon be well again. Mr. Rufus Bates is again section- master on this section.  Messrs. Hunters, of Lynchburg, visited relatives aud friends here last week. Miss Kate Bates who went to Campbell to spend her easter re turned home Saturday. Mi88 Laura Rucker, of Campbell is again in our midst much to the delight of our young people. Mr. John Robertson had the mis fortune to loose a tine colt some days ago. There was a magic lantern and legerdemain exhibition at Mr. A. J. Harveys on the 9th. All seethed to enjoy it very much. Rev. Mr. Parrish filled hisappoint- meut at Salem Sunday p. m., Sunday school was organized the first Sun day there. Mr. Tilden Drinkard accompanied by his sister, Miss Clev., took a trip to Campbell Easter. There is a young gentleman at Mr. Rectorsarrived Friday a. m., happy papa. Miss Babaria Worley, took a trip to Lynchburg last week. The Misses Spencer entertuiued a number of their friends Monday night at their hospitable home. Mr. Cbas. McKinney has sold a fine horse and mule recently. Mr. Alouza Adkerson, of Lynch burg, visited Mr. Mack Carson Sun day last. May prosperitys blessing attend the T imes and its readers. -  B eatrice . ,"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "home Saturday. Mi88 Laura <mark>Rucker</mark>, of Campbell is again"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "home Saturday. Mi88 Laura <mark>Rucker</mark>, of Campbell is again"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [634.1, 286.98, 795.95, 953.82], "bbox_id": "6a95f28413", "file": "AppomattoxNewspapers_1892-1898a_0498.pdf", "page": 1, "text": "Spout Spring. Silence does not always Bbow risdom, so we will not keep silent anir longer. How could we when the trees ana flowers and all sur roundings are telling of welcome spring. Farmers have began plant ing corn md preparing for their crops most of.the tarly frm t is killed. Miss Mackie Simms is suffering from au attack of rheumatism. She has the smypathy of many friends. Hope she may soon be well again. Mr. Rufus Bates is again section master on this section. Messrs. Hunters, of Lynchburg, visited relatives and friends here last week. N Miss Kate Bates who went to Campbell to spend her easier re turned home Saturday. Miss Laura Rucker, of Campbell is again in our midst much to the delight of our young people. Mr.. John Robertson had the mis fortune to loose a tine colt some days ago. There was a .magic lantern and legerdemain exhibition at Mr. A. J. Harveys on the 9th. All seemed to enjoy it very much. Rev. Mr. Parrish filled his appoint ment at Salem Sunday p. m., Sunday school was organized the first Sun day there. Mr. Tilden Drinkard accompanied by his sister, Miss Clev., took a trip to Campbell Easter. There is a young gentleman at Mr. Rectorsarrived Friday a. m., happy papa. Miss Babaria Worley, took a trip to Lynchburg last week. The Misses Spencer entertained a number of their friends Monday night at their hospitable home. Mr. Chas. McKinney has sold a fine horse and mule recently. Mr. Alouza Adkerson, of Lynch burg, visited Mr. Mack Carson Sun day last. May prosperitys blessing attend the T imes and its readers."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "home Saturday. Miss Laura <mark>Rucker</mark>, of Campbell is again"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "home Saturday. Miss Laura <mark>Rucker</mark>, of Campbell is again"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [703.44, 620.09, 868.53, 1023.19], "bbox_id": "982a1aa11f", "file": "AppomattoxNewspapers_1898-1902a_0013.pdf", "page": 1, "text": "Spout Spring. Our little villogg is alive with vis itors. Mrs. Alonza Adkerson and child ren of Lynchburg, are visiting her mother Mrs. Mathew Carson near here. Mrs. Rucker of Campbell, is visit ing her daughter, Mrs. Rector. Mr. Charlie Watson of Lynchburg visited relatiyes here Monday and Tuesday last. Mr. Luther Pngh of Lynchburg visited his father Mr. R. N. Pngh last week. Mr. Rufus Bates is again having his store house enlarged. Surely some of our people are prospering. One of Mr. Clay Shearers houses occupied by Pharoah Franklin a colored man of this place was burned Sunday morning abont five oclock. All escaped uninjured, but saved none of his possessions. Mrs. Rufus Bates entertained, some friends the 4ib. The condition of Mr. William Robertson is not eo favorable to-day. Mrs. David Bates continues verv sick. She has the sympathy of many friends. Mr. John Overton after some days illness is convalescent. B eatrice ."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Carson near here. Mrs. <mark>Rucker</mark> of Campbell, is visit"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Carson near here. Mrs. <mark>Rucker</mark> of Campbell, is visit"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [701.0, 1224.79, 865.0, 1612.39], "bbox_id": "fe6be6c661", "file": "AppomattoxNewspapers_1898-1902a_0299.pdf", "page": 1, "text": "Spout Spring. Mr. Courtney Thomas had a fine horse killed by a passenger train on Thursday last. Mi-s Anna Rush, of Brookneal, is he guest of her sister, Mrs. C. Inge. Miss Laura Rucker returned home ou Saturday. Misses Mamie McCarcel and- Eu- ie Nowliu are the guests of Mrs. Nowlin. Mr. K. M. Garrett aud his brother George made a flying visit to Lynch burg on Saturday.  Misses A. L. and Susie Whitaker nd Mrs. Rufus Bates last week vis- led Lynchburg. Mr. John Duncan, of Texas, and Mr. Charles Duncan, of Oaky ale, West Virgiuia, are visiting their sis ter, Mrs. Robert Whitaker, who is very ill. Mr. 1. T. Bates is at home suffer ing from malaria. Mrs. Charles Furbush has gone to Covington to visit her daughter. Airs. E. P. Chamberlayne. Mr. Ed Collins visited his parents on Sunday. Mrs. L. E. Sjnith aud her brother, M. Zan. Jones, of your town, visited j relatives here on Sunday. Mr. and Mrs. B. W. Babcock j passed here on Sunday on their way  home from a visit to M. H. C.Bab cock, of West Appomattox. Mr. Ed. Bates is again telegraph operator at this place."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "C. Inge. Miss Laura <mark>Rucker</mark> returned home ou Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "C. Inge. Miss Laura <mark>Rucker</mark> returned home ou Saturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2490.24, 1292.18, 2654.33, 1565.32], "bbox_id": "c6fbef996e", "file": "AppomattoxNewspapers_1926-1933a_0507.pdf", "page": 1, "text": "SPOUT SPRING, -Miss Su sie Bates vibited in Lynchburg last week. Mr. and Mrs. R. K. Lawson spent the week-end in the home of W. E. Dickerson. Mr. and Mrs. D. S. Smith, of Lynchburg, visited relatives herd Sunday. Mr. and Mrs. Jett Rucker, of Lynchburg, spent the week-end with relatives here. Miss Evelyn Roberston is vis iting in Greensboro, N. . Bill and Charlie Goodman, of Portsmouth are spending some time with their father, Mr. A. M. Goodman. Mr. and Mrs. R. F. Burnett visited their daughter, Mrs. S. T. Jennings, Sunday. Miss Margaret Doss was the week-end guest of Mias Viola Reynolds. George Almond fell and cut his head l0.Friday."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Mr. and Mrs. Jett <mark>Rucker</mark>, of Lynchburg, spent the"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Mr. and Mrs. Jett <mark>Rucker</mark>, of Lynchburg, spent the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2480.9, 1274.62, 2643.0, 1452.46], "bbox_id": "70f5be1a36", "file": "AppomattoxNewspapers_1908-1909a_0507.pdf", "page": 1, "text": "SPOUT SPRING, Miss Si Me Bates visited to Lynchb last week.. Mr. and. Mrs. R. K. .Lawson spent the week-end in the home of W. E. Dickerson.  Mr. and Mrs. D.8. Smith, Lynchburg, visited relatives herd Sunday.   Mrand Mrs. Jett Rucker, Of Lynchburg, spent tiie week-end with relatives here.  Mi Evelyn Roberston is vis- p n g in GreMoro, N. .  B ill and Charlie Goodman, of Portsmouth are spending some time with their father, Mr..A."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Sunday.   Mrand Mrs. Jett <mark>Rucker</mark>, Of Lynchburg, spent tiie"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Sunday.   Mrand Mrs. Jett <mark>Rucker</mark>, Of Lynchburg, spent tiie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2231.29, 608.35, 2395.77, 1234.27], "bbox_id": "cddce5ce97", "file": "AppomattoxNewspapers_1908-1909a_0563.pdf", "page": 1, "text": "SPOUT SPRING, Mar. 16- Miss Christine Robertsoij left Tuesday morning for Wes- Point, Miss. Miss EdithRobertson has re turned home after an extender visit to Greensboro, NgC- She also visited in Winston-Salem Chapel Hill, Burlington, Dui ham, High Point and Raleigh Mr. aadrs. HS. Jones and family spent the week-end in Roanoke with relatives. Mrs. C. R. Morton, Miss Nan nie Jones, Misses Lena and Sue Ellen Bates spent Thursday in Victoria as the guests of Mrs. Norman Bates. Mr. and Mrs. Russell Caw- thorn spent Saturday in Lynch- hurg. ...  . Mr. and Mrs. Theodore Car- son are the happy parents of a baby girl. Mis4 Elizabeth Robertson has returned after spending some time with her aunt Mrs. Stratton, of StonewalL.  Miss Frances Smith spent last week in Lynchburg.  Ms. S. H. Collins, of Buri- ingtdn, N. I, is the guest rin the home of R. H. Bates. Mrs., Annie Bates Perkins, of Lynchburg, spent th e week end with her aunt, Mrs. R. H. Bates. Mrs. John Price, Mr. and Mrs. John Williams and Mias Mildred . Williams, of lrnch- burg were,Sunday guests, of Mrs. Orman Jones. .Miss Frances Coleman, who has been in the hospital for treatment, has returned home. Edward Bates, of Brookneal is guest of home folks here. Mrs. Jett Rucker, of Lynch burg, spent last week with her mother, Mrs. Addie Bates. Miss Rachel Dickerson enter tained the Spout Spring bridge club Thursday afternoon. Mrs. ,C. R. Morton won high score Mrs. H. B. Martin won consola tion. !r. .. ... i .... .. ...... o ."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "folks here. Mrs. Jett <mark>Rucker</mark>, of Lynch burg, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "folks here. Mrs. Jett <mark>Rucker</mark>, of Lynch burg, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [766.78, 1135.15, 1245.48, 1296.7], "bbox_id": "e6fd25ab64", "file": "AppomattoxNewspapers_1908-1909a_0493.pdf", "page": 1, "text": "SPOUT SPRING, June 2 9 - Misses Betrtha May Spen- for cer, Lucy May Jeter and Mrs. be Jett Rucker, of Lynchburg, are  dustrial firms are hot payizur spending the week with Mrs. dividends at this time it Aw1-6  ratifying to notice that both Miss Mary Smith, of Ever- local banks are payin green, visited Miss Mabelle their usual dividends. Smith recently-.  w The B. Y. P. U. enjoyed a Paying or not paying divi dends is a matter for the C. Jones service station near rC 1 ÎÎc -ld Court House  4-uvvi j  . a  - c Mmoo. i í S E r t f f t í a H í be here, early last Friday rndrn- mg. No arrests have been t WllUfl Chilton, of vet hut nffinon ni.i _ Lynchburg, spent the week end at her home here."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "and Mrs. be Jett <mark>Rucker</mark>, of Lynchburg, are  dustrial"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "and Mrs. be Jett <mark>Rucker</mark>, of Lynchburg, are  dustrial"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [890.65, 1717.56, 1051.5, 1971.37], "bbox_id": "adb3d418ad", "file": "AppomattoxNewspapers_1898-1902a_0121.pdf", "page": 1, "text": "Spanish Oaks. Tbe matrimonial wave 1 preadln over Stouewali, and everal couplet will have launched their .bark before tbe Cbristmae holiday. Mr. John P. Alvl, an enterprialng young farmer of Stonewall will be married next Tueaday evening at 7 oclock to MU Lucy Woodson, tbe bright and attractive niece of Mr. Geo. D. Routten,a prominent cltlaen of this county, the ceremony will take p lace at Hebron church. Mr. Melvin of the M.  church will officiate. Mr. 8a met Rucker of the Clark-Ruckar Tobacco Co., oi Lynchburg,waa ln the coun ty laat week attending the marriage of hit SOU, Dr. Thomas Rucker. Mias Mahal Moore aud her brother Mr.  Duncan Moore, Beuua Vlsla, alto attended tbe marriage of their cousiu Dr. Rucker. Mr. Lillie Drinkard atsrted Christmas Iasi Friday nigut by giving a party to the youug people, which waa highly enjoyed till a late hour. Dr. A. T. Drlukard moved yesterday the Laughora place on James river. COALING."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "officiate. Mr. 8a met <mark>Rucker</mark> of the Clark-Ruckar Tobacco"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "officiate. Mr. 8a met <mark>Rucker</mark> of the Clark-Ruckar Tobacco"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1431.35, 983.0, 1777.3, 1806.24], "bbox_id": "2084980232", "file": "AppomattoxNewspapers_1918-1922a_0278.pdf", "page": 1, "text": "son, Charles, called from you to at tend the funeral of a relative at her old home in tbe Valley, will not return until after tbe holidays Reports from Rev. J. C. Leps are to the effect that his health is improving in Florida, where he will probably stay No pas tor for the churches served nere by Mr. Leps has been called yet. Dave Martin, keeper of the couoy b as tile, says he has a prisoner whj says he does not desire his freedom when bis time expires, but wants to spend the entire winter in the donjon keepunder Daves re gime. Mr. Thomas J. Gardner re turned Monday from a trip to Roaioke and Bedford City He was a member of tbe great party to welcome the Pretiden tial party to tbe National Elks Home, where the President de livered the annual Memorial address. Major Rittenhouse, Mr. Daniel Rucker, Senators Willis and Byrd, Mr. Fay, Mr Nelson Hundley opened court Page, were guests at the home Iplday and left on the of JUr. Flood last week, and iff train Siturday for were entertained at tea at the phe grand jury indicted home of Mr. S L Ferguson Mjp Owen for selling liquor Thursday evening. Tbe party 0l his plea of guilty was was enjoying a hunt here. days in j qup mePChants here are mak j  a c t i o n to suspend the L pr.parations for holiday I Mfitoce was resisted by Lrade ctim that the priC. HPIuniey  for Common at A.ppemattox will bring more J a efforts of his ohri9tmaB cheer to your homes i srere unavailing. Jail than from any other town.    n no suspensions gee announcemeots of L.    f o te d u p o n hereafter  E Pmitb H M Burge Brown , E P  o r violations by the 1 ft Hnith 0haf F. j ame Common- These reliable firms are well-  1 - I Violfttor8 ot  known to our patrons and de on law will take 8erve yOUr every confidence. Mp. In the meantime I PM  Is the first offender I Attractively decorated with UMr in this couoty to I p a tte rn s and blended colors, sentence. the home of Mr. and Mrs. S L also Ferguson was the scene of a most enjoyable gathering of about 76 of Appomattoxs young ladies and men Friday night, tbe event being a pre birthday party of their daugh ter, Rachel, who became six teen years of age on Sunday, j Decembers. Tbe evening was filled with novel party games j and music, after which refresh ments were heartily enjoyed  by tbe happy participants."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Major Rittenhouse, Mr. Daniel <mark>Rucker</mark>, Senators Willis and Byrd,"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Major Rittenhouse, Mr. Daniel <mark>Rucker</mark>, Senators Willis and Byrd,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1702.29, 691.6, 1871.49, 897.44], "bbox_id": "dd4bc2db22", "file": "AppomattoxNewspapers_1954-1955a_0207.pdf", "page": 1, "text": "Shelby Kessler, daughter of Mr. and Mrs. A. S. Kessler celebrated her sixth birthday Saturday. even ing, Jan. 29, with a party at her home, 1209 Campbell Ave., Lynch burg. The house was decorated in accord with a circus motif, favors were distributed, and a large birth day cake and other refreshments served accented in a ciscus note. Those present were Becky Mar shall, Doris iKatherine Nicolas, Claudia Tuck, Shirley Catlett, Lar ry Ferguson, Tim Doss, Denny Clem ents and Cecil Kay Rucker. Assisting Mrs. Kessler in caring for the young guests were her mother, Mrs. Ethel Cumibie, Mr. Kessler, Mr. and Mrs. Henry Cum- bie Jr. and Mrs. M. Marshall Jr."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "ents and Cecil Kay <mark>Rucker</mark>. Assisting Mrs. Kessler in"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "ents and Cecil Kay <mark>Rucker</mark>. Assisting Mrs. Kessler in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.15, 348.14, 2329.43, 571.79], "bbox_id": "bbbb975281", "file": "AppomattoxNewspapers_1952-1954a_0195.pdf", "page": 1, "text": "Shelby D. Kessler, daughter of Mrs. Gladys Kessler, celebrated her fourth birthday recently with a party at her home, 1209 Campbell Ave. The home was decorated with arrangements of red carnations and white snapdragons. Typical birth day refreshments were served. Con temporaries of the young hostess who were present were Cecil Ray Rucker, Becky Johnson, Barbara, Patricia and Jimmy Tolley, Barbara, Bonnie, Rita and Jimmy Lipscomb. Assisting Mrs. Kessler in caring for her daughters young guests were her mother, Mrs. Ethel Cum- bie Mrs. Jessica Rucker, Mrs. Arthur Lipscomb and Miss Janice Johnson. Also Mr. Jimmy Carwilt and Dick Cilmbie. Out-of-tow guests included Miss Eleanor Wool dridge, of Appomattox, Va."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "present were Cecil Ray <mark>Rucker</mark>, Becky Johnson, Barbara, Patricia"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "present were Cecil Ray <mark>Rucker</mark>, Becky Johnson, Barbara, Patricia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1166.38, 364.08, 1335.43, 611.92], "bbox_id": "130d1e5054", "file": "AppomattoxNewspapers_1952-1954a_0493.pdf", "page": 1, "text": "Shelby A. Kessler celebrated her fifth birthday Saturday evening at her home, 1249 Campbell Ave. in Lynchburg. The home was decorated ,with red and white decorations and balloons. Typical birthday refresh ments were served, games played and there were gifts and favors. Contemporaries of the young hos tess who were present were Ellen Smith, LaVerne Hesel, .Becky John son, Bonnie Sue Dulles, Tim Doss, Cecil Ray Rucker, Glen and Denny Clements. Assisting Mrs. Kessler in caring for her daughters young guests were her mother, Mrs. Ethel Cumbie, Mrs. Jessica Rucker, Mrs. F. S. Doss and Miss Janice John son. Aiso her uncle, Dick Cumbie. Out-of-town guests included Miss Eleanor Wooldridge, of Appomat tox, Va., who also assisted in serv ing the guests."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "Tim Doss, Cecil Ray <mark>Rucker</mark>, Glen and Denny Clements."}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "Tim Doss, Cecil Ray <mark>Rucker</mark>, Glen and Denny Clements."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [718.36, 381.02, 877.69, 769.75], "bbox_id": "55cfbd2892", "file": "AppomattoxNewspapers_1898-1902a_0121.pdf", "page": 1, "text": "sembled to witness the ceremony. Key. P. M. Bell officiated, usiug the beautiful ritual ceremony of the Methodist church! Mrs. Mollie Watts Moore presided at the organ, and as the soft strains of the wed ding march pealed forth the party entered Mr. John C. Moore, J -., with Miss Osie Burge, Mr. Emmett Martin MLs Eva Moore, Mr. T. H. Martin with Miss Mabel Moore, of Beuna Vista Mr. James W. Burge with Miss Mollie Martin. The groom entered upon the arm of Mr. Rolph Horslev, and the bride ou the arm of Miss Bessie LeGrand. After the ceremony the party, with a large number of friends and relations returned to the hospitable home of the brides father, where thev partook of a bountiful supper. The groom is a well known and successful young phvsiciau aud son of Mr. Samuel B. Rucker, proprie tor of Martins warehouse m Lynch burg, while the bride is the hand some and popular daughter of Mr. Wesley C. Moore, a prosperous far mer and merchant at Mineral, near Walkers Ford. M, The T imes extends congratula tions."}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "of Mr. Samuel B. <mark>Rucker</mark>, proprie tor of Martins"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "of Mr. Samuel B. <mark>Rucker</mark>, proprie tor of Martins"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.19, 909.18, 2271.69, 1021.42], "bbox_id": "02e72dfbcf", "file": "AppomattoxNewspapers_1960-1962b_0110.pdf", "page": 1, "text": "Second Lt- Edward J. Giles, 25 son of Mr. and Mra Orson ,T Gilga, of S t 1, Appomattox, re eentiy completed a 16-week officer totary-wing aviator course at The Primjary Helicopter School, Camp Wo Iters, Texas. He is a 1964 guad- ! mate of Appomattox Hgh School and a 1959 graduate of V. P. I. He is stationed now_at Fk. Rucker, Ala. a"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "is stationed now_at Fk. <mark>Rucker</mark>, Ala. a"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "is stationed now_at Fk. <mark>Rucker</mark>, Ala. a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [521.03, 368.44, 665.49, 1064.17], "bbox_id": "f0ce6e9bfa", "file": "AppomattoxNewspapers_1974-1975a_0054.pdf", "page": 1, "text": "SCHOOL Contd from Pagel remainder of the day will be spent in related activities in the schools. This is the second of four such workshops planned to be held during the 1974-75 session. Plans for the morning meeting were made by depart ment chairmen. These plans reflect the concern which teachers and other persons working in the instructional program are demonstrating as they strive to incorporate new methods, techniques, and mat erials into the instructional program. A variety of topics will be discussed with local personnel and consultants serving as resource persons. The following program of meetings has been planned Art, Music, English, Foreign Language - Providing for the Gifted and Talented - Mrs. Isabel Rucker, State Depart ment of Education. Grades K-6 - Social Studies Curriculum - Mrs. Ruth Hamilton Silver Burdett Pub lishers. Guidance - Philosphy of Guidance Department and Testing - Mrs. Bolling Carter, Appomattox Middle School. Library  Cataloging A-V Materials - Mrs. Judy Blanton - Appomattox Elementary School. Mathematics - Development of Department Philosophy and Objectives - Mrs. Mary G. Holland, ACHS. Physical and Health Educa tion - Gymnastics Demonstra tion and Seminar - Dr. Judy Johnson, Longwood College. Science - Plans to be announced. Social Studies - Subject Areas - Mr. George Blanton, ACHS Special Education - Psycho logical Testing - Dr. Thomas Wilson, psychologist Vocational Educatin - Fi nancing Vocational Education and Becoming Aware of Vocational Education at ACHS - Mr. R. B. Carter and All Department Members Title I - This group will visit Nelson County Title I Projects"}, "highlight": {"text": {"matched_tokens": ["Rucker"], "snippet": "and Talented - Mrs. Isabel <mark>Rucker</mark>, State Depart ment of"}}, "highlights": [{"field": "text", "matched_tokens": ["Rucker"], "snippet": "and Talented - Mrs. Isabel <mark>Rucker</mark>, State Depart ment of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
