{"document": {"bbox": [2313.6, 1468.76, 2400.21, 1478.3], "bbox_id": "8ff2870c24", "file": "AppomattoxNewspapers_1933-1936a_0520.pdf", "page": 1, "text": "S. P. COLEMAN"}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>"}], "text_match": 1736172819517538425, "text_match_info": {"best_field_score": "3315704398080", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517538425", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [293.05, 1073.0, 614.95, 1568.43], "bbox_id": "8b7fe22d2e", "file": "AppomattoxNewspapers_1918-1922a_0620.pdf", "page": 1, "text": "Wm. Garrett, labor _ ____ _ __ _ ___ _ _______ 12733 Fred Doodley, labor ___________ __ _ ____ ____ 788 John Ferguson, la b o r _________ ZZZZZZZZZZZ!  i 5fion Hall Bryant, la b o r _________ _ ___________________ lkoo Hubert Gallaher, la b o r _________ _______________ ZZZZZZZZZZZZZZ 5053 T. S. McNally, road foreman, care of team and incidental expensesZZ 783.56 Buck Wells, labor _ ___________________________________ _ 106.01 H. M. Burge, feed, supplies, A c . ________ ZZZZZZZZZZZZZZZZZ 568 79 D. R. Puckett, blacksmith w o rk _________________________ ZZZZZZ 1900 Appomattox Hardware Company, supplies _________________ _ _ _ 126.31 R. F. Burke, Treasurer, for draft for feed...____________________  13200 Jesse T. Jennings, dragging road _ ________________________ Adams Bros.-Paynes Co., culvert p ip e __________ W. H. Jones, lum ber ___ . . . __ _ _____________ ZZZZZZZZZZZZZZZZZ. Earl Harris, la b o r _____________ _______ ZZZZZ A. W. Jones, work on ro ad _ _ ___ ZZZZZZZZZZZZ Buck Doss, labor _ ___ _ _ _ _ __ ______ ZZZZZZZZZZZZZZZZZZZZZ L. E. Smith A Bro., chop and corn _ _ _ ______ C. A. Flowers, blacksmith account __ of Appomattox, for drafts for feed Z __ Z.ZZZZZZZZZZZZZZZZZZ 4w.   E Smith, salary as member Road B o ard ____________________ 183.00 W. Smith, one-third salary as clerk Road Board _______ ____ Z 3334 I . A. sm ith A Co., heater, and pipe for road cam p _____ 440 Lawson Woodson, labor _ _ __ ____ _____ 11 an Wallace Woodson, labor _ __ _ ___________ ZZZZZZZZZZZ 1140 Curtis Martin, labor _ _______________ - 8,n Bill Hollins, la b o r ___ ____ __ _________ ___ ZZZZZZZZZZZZZZZ 7 50 W. T. Nash, boarding road force, c.__ZZZZZZZZZZZZZZZZZZ__Z 20 00 Leslie T. Morris, road w o rk ___ _ ________ __________  _______   533 rs- T. S. McNally, cooking for road fo rc e __________ __ 3250 M. J. Goin, fe e d ________________________ 9Knn F. T. Puckett, work on ro a d ___________________ ZZZZ 12 00 Epps Johnson, labor _ ___ ______ _ ________________ ZZZZZZZZZZZZZ 24.00 J. A. Sears, Frt. on grader blades _________________ Z ZZZZZZZZ 185 Gallon Iron Works, grader b lad es ______________  40 42 Andrew Pillow, labor _ ______________ _ iq  vk Bill Jamerson, labor __________ 1 oKn G. W. Lewis, fe e d _______________ ZZZZZZZZZZ ---------------------------- 11 nn Willie Smith, la b o r __ _ ____ _ ____________ _  j  aa N. W. Jamerson, la b o r __ _______  14a R. S. Wheeler, lum ber _________________ Z __ ZZZZZZZZZZZZZZZZZZZZ 5007 Hunter Harvey, blacksmith w o rk ___ _ ________ ZZZZZZZZZZZZZZZZ 967 S. P. Coleman, Jr., cutting tree out ro a d _________________ _ 1 00 R. A. Anderson, lu m b er ________________  3750 J. L. Driskill, sills for culvert . . . _____ _ ____ qnn Joe Sell, labor _ __ _ _ _ _____ ________ 525 Mr. Brewer, labor . . . __ _ _______ ZZZZZZZZZZ 3nn Emmett Day, labor - __ _ _______ 81 60 Wiley McNally, labor ____________ ZZZZZZZZZZZZZZZZZZZZZ ------ 3525 C. A. Agee, painting w ag o n ____________________ 1700 Times-Virginian, warrant boo k ________________________ Z-ZZZZZZ 1350 Pomona Terra-Cotta Co., sewer p ip e ___________________________ 4605 Appomattox Garage, for Fordson Tractor and repairs ___________ 731.94 Standard Oil Co., for gasoline and oil _ ____________________ 4588 J. W. Crenshaw, la b o r __________________ __ __ 6400 Rector Bros., supplies ____ _______________  . Bq7 O. F. Cheatham, lum ber ________________ZZZZZZZ 3425 Jim Casey, labor __ _ ________ _ ____  97nn R. C. Mann, la b o r ______________ ZZZZZZZZZZZ ZZ 7 00"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "o rk ___ _ ________ ZZZZZZZZZZZZZZZZ 967 <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Jr., cutting tree out"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "o rk ___ _ ________ ZZZZZZZZZZZZZZZZ 967 <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Jr., cutting tree out"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1734.0, 419.83, 1895.4, 799.18], "bbox_id": "6d2a249141", "file": "AppomattoxNewspapers_1892-1898a_0094.pdf", "page": 1, "text": "what party yon belong. Come and we can assure a pleasant and enjoya ble day. It is an opportunity that no one should miss. If you are on the fence, yon may hear somethihg that may decide yon. Be sure to contribute promptly. The committee on edibles will take charge of whatever yon may feel dis posed to give. Let ns all unite in making this day a grand success. . On Saturday Sept. 23rd a mssa meeting was held at this place and after a very harmonious and pleasant discussion the following committees were appointed Committee on EdiblesT. A. Smith, chairman, W. A. Moses, S. P. Coleman, Mrs. J. R. Atwood, Miss Sallie Burke and Miss Kate OCon ner. Finance CommitteeJ. B. Taylor, chairman, J. H. Abbitt, R. F. Burke. Committee, of ArrangementsJ. R. Atwood, chairman, J. M. Miles, W. J. Trent, Miss Anna Jones, Miss Mary Statham, MiasLizzie David son, Mrs. J. W. Flood, Miss Fannie Johns and Miss Lonlie Peers. Committee on SpeakersW. J. Trent, chairman, R. C. Harvy and R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "chairman, W. A. Moses, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Mrs. J. R. Atwood,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "chairman, W. A. Moses, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Mrs. J. R. Atwood,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1959.3, 480.04, 2127.83, 1225.81], "bbox_id": "51b52f56e6", "file": "AppomattoxNewspapers_1902-1905a_0110.pdf", "page": 1, "text": "We heard a good story recently which, we think, the many readers of your newsy paper will enjoy. It is about two pretty girls, a candi date and a pin. Once ripon a time as all good stories should begin two pretty girls attended the Com mencement exercises of the High School of your town. Everyone knows what a crowd there was the last night,almost impossible for late comers to get seats. However, after much contriving and the be stowal of some of their sweetest smiles on one of the good looking ushers, our two girls managed to get possession of a chair in the aisle and the crowd closed in around them. Soon along came a candidate talking politics for all be was worth. So much interested was he that he seemed not to be aware of the exist ence of our two pretty girls and leaned right over them, talking to two men on the opposite side of the aisle. One of the girls whispered, Mercy on ns, whatever shall we do He will sit down on us directly. It was then that the little pin got in its work, and you can just bet your life Mr. Editor that that can didate forgot to talk politics, for rhat evening at least. What be came of the two pretty girls? Oh they were left in undisputed poa session of their chair during t.1 e re mainder of the exercises, and the little pin, ah, that is a secret known only to the candidate. We have had good rains and everything and everybody is much refreshed. Some cf onr farmeri have planted their crop of tobacco while others have uot planted a hill Corn is looking badly. Most eveiv- one is complaining that they will have to almost close plant again. Mrs. J. T. Oawthorn is getting about again, after a severe spell of 1 m - grippe. Her niece  Miss Sadie Coleman, who was witly ljer during her  illnesi, rhttifhed trdffiS on Wednesday. Mrs. Ed N. Woolridge returned home last Wednesday from a pleas ant visit of three weeks with her daughter, Mrs. Albert Staples, of the Hill City. Mrs. T. W. Oder, Mrs. John Cole, Misses Madelieue and Pauline Cole man aud little Pat Coleman were all on the sick list last week. Mr. T. W. Oder and his son. Pierce, went to Lynchburg with tobacco last Monday. We understand that Mr. Walter Haucock has the contract for Mr. M. H. Colemans new house. We will be sorry to lose this pleasant family ami good neighbors from our neighborhood. Master Maynard Fowlkes, of Lunenburg Court House, is spend ing his vacation with his grand parents, Mr. and Mrs. S. P. Coleman."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "parents, Mr. and Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "parents, Mr. and Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [375.86, 402.69, 538.47, 1296.19], "bbox_id": "58a57c4390", "file": "AppomattoxNewspapers_1926-1933a_0463.pdf", "page": 1, "text": "We are having some very very hot days. The rains last Saturday afternoon and night has revived the vegetation anc it is looking good. Mr. Walter Jordan and s friend of his motored from Md and spent Sunday and Sunday night in the home of T. H. Fore recently. Mr. Jordans father brothers and sisters met him there Sunday as he was not off duty long enough to visit in Charlotte county. His wife anc two children who have been spending some time with her parents, accompanied him back home in Md. Mr. and Mrs. W. T. Nash and children visited her sister, Mrs. Beasley, at Hollywood recently. Mr. and Mrs. W. L. Shield and two sons, Wilbur Jr. and Bobbie, of Columbus, Ohio, are spending their vacation in the home of her parents, Mr. and Mrs. R. W. Martin. They in company with Mr. and Mrs. Martin, Miss Bessie Martin and Mrs. Annie Odor have been visitors in the homes of Mrs. B. C. Sims near Ever green, Mrs. M. W. Hunter, of Gladstone and J. A. Martin, also T. H. and W. L. Ford. They leave this week for their home in Ohio. Mr. and Mrs. T. T. Marshall of Portsmouth, Ohio, have been visitors in the home of T. H. Ford, N. D. and E. H. Marshall. Mrs. Loyd Nash of Lynchburg, visited her children Sunday in the home of T. J. Nash. Mr. and Mrs. W. L. Shields, of Ohio, Mr. and Mrs. R. W. Martin, Mrs. M. W. Hunter and Mrs. Annie Odor visited in the home of Nuzz Ford near Lynch burg Monday. Mr. B. C. Simms and family spent last Senday in the home of R. W. Martin. We were sorry to hear of the death of our esteemed citizen S P. Coleman. The family has the sympathy of a lot of friends in their bereavement  and may the Lord be with them. Mrs. M. W. Hunter, of Glad stone, is spending a few days with her parents, Mr. and Mrs. R. W. Martin. Wilber Shields, J r, Bobbie Shields, Miss Bessie Martin and Mrs. Annie Odor attended the lawn party at Wesley Chapel last Saturday night. They were ac companied home by Mr. Hamp ton Hunter, who spent the day Sunday. Mr. and Mrs. Clifton Jones and two children, of Hopewell, have been visiting in the home of Z. M. Jones and other rela tives."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "of our esteemed citizen <mark>S</mark> <mark>P</mark>. <mark>Coleman</mark>. The family has the"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "of our esteemed citizen <mark>S</mark> <mark>P</mark>. <mark>Coleman</mark>. The family has the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2212.73, 653.35, 2375.92, 1288.8], "bbox_id": "35fa9bd0ab", "file": "AppomattoxNewspapers_1905-1912a_0396.pdf", "page": 1, "text": "W e hear of m any cases of fever in different sections of the oounty, but so far this im  m ediate neighborhood has es caped. We are glad to note that Mrs. Oscar Cheatham , from near Reedy Springs, who hur been so very fill w ith typhoid fever, is bettor. Mrs. Dougla Marshall is also ab ut well. Mrs. S P Coleman is spend ing some time with hqr daugh ter, Mrs. Clinton Caw thorn, who is sick. Mr. and Mrs. Ben Cole and little Byron, nd Mr. Oseat Cole left Friday to visit re la  tives in Pittsylvania. Miss Florence Morgan and brother, Tunstall, entertained the Social Club most charm  ingly at their fath ers homt near your town recently. Mrs. Paul W arren and child- r n, of South Norfolk, are visit ing her parents at Mountain View. Miss Elvyn Coleman has also returned homo after quite hn extended visit with her sister in Victoria and South Norfolk. Mr. Obie Mann, of High Bridge, visited his parents, Mr. and Mrs. Wm Mann, recently Messrs. Gilliam and Leslie Mann, who have been sick, are out ajgaiu. L ittle Miss Mabel Plunkett, who has been visiting relatives in the Southside, has returned home. Mr. Geo. Coleman, who has been spending the week at home, returned to his work at Petersburg on yesterday. Mr. Allen Odor, of Pocahon tas, W. V a., visited his uncle, Mr. T. W . Odor last week. Rev. Thomas Fitzgerald, of H untington, W. V a., visited his sister, Mrs. A nna Coleman, last week."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "ab ut well. Mrs. <mark>S</mark> <mark>P</mark> <mark>Coleman</mark> is spend ing some"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "ab ut well. Mrs. <mark>S</mark> <mark>P</mark> <mark>Coleman</mark> is spend ing some"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1328.4, 385.0, 1453.81, 422.36], "bbox_id": "1d8ae3d9e3", "file": "AppomattoxNewspapers_1902-1905a_0016.pdf", "page": 1, "text": "u -ft s p. Coleman. MoM B ,bertson- 1 ruasijrel  ..evenne- 1 - 1  B  Ooramlsior visore-W. h . Litfm l, rB 0ThornhiU and J . 0- .ir.-t., rianesdav after first mo"}, "highlight": {"text": {"matched_tokens": ["s", "p", "Coleman"], "snippet": "u -ft <mark>s</mark> <mark>p</mark>. <mark>Coleman</mark>. MoM B ,bertson- 1 ruasijrel  ..evenne- 1 - 1  B  Ooramlsior visore-W. h . Litfm l, rB 0ThornhiU and J . 0- .ir.-t., rianesdav after first mo"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "p", "Coleman"], "snippet": "u -ft <mark>s</mark> <mark>p</mark>. <mark>Coleman</mark>. MoM B ,bertson- 1 ruasijrel  ..evenne- 1 - 1  B  Ooramlsior visore-W. h . Litfm l, rB 0ThornhiU and J . 0- .ir.-t., rianesdav after first mo"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.54, 859.83, 1778.51, 1248.63], "bbox_id": "42ee6a6a96", "file": "AppomattoxNewspapers_1915-1918a_0529.pdf", "page": 1, "text": "Toe late season and scarci ty of farm labor is retarding the progress of farmers. Our farmers will act wisely if they grow plenty of food for man and beast this year. Thos. J. OBrien, trustee, will sell on next Monday, April 1, at 12 oclock noon, public auction in front of the court house, the Mancha A. Doss traot of land lying near Oak ville. Mr. Saml Coleman, died at the E p i l e p t i c oolony near Lynchburg, Friday. Mr. Cole man bad been an inmate of the institution for years and bis hehlth was generally bad. His remains were brought here and interred in the family cemetery at tbe home of his father, Mr. S P Coleman, south of town on Sunday. Mr W. R. Seay died at his home on Grease Creek, in Buck ingham county Tuesday, 19th, ibscaut in the 6th year of his sge. The deceased was reared in Buckingham, was a good farmer, and a good neighbor. His remains were interred at"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "of his father, Mr. <mark>S</mark> <mark>P</mark> <mark>Coleman</mark>, south of town on"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "of his father, Mr. <mark>S</mark> <mark>P</mark> <mark>Coleman</mark>, south of town on"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [589.45, 274.77, 752.14, 464.32], "bbox_id": "bac33dbc6f", "file": "AppomattoxNewspapers_1926-1933a_0190.pdf", "page": 1, "text": "Thompson of the Baptist church and her remains wetfe interred in the family cemetery near Reedy Springs church on the old Hunter estate.B Deceased is sur vived by the following children Miss Mary Hunter, Benjamin and Coleman Hunter, Mrs. But ler and Mrs. R. H. Cheatham, of Richmond Mrs. Julius Ames, of Winston-Salem, N. C. Mrs. I. D- Hunter and Mrs. D.H. Marshall, of Richmond Mrs. W.B. Brooks, Macon, Ga., and one brother, S. P. Coleman, of this county.   . i O 1"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Ga., and one brother, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, of this county.   . i"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Ga., and one brother, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, of this county.   . i"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [587.03, 254.15, 750.85, 433.9], "bbox_id": "a2424cbb11", "file": "AppomattoxNewspapers_1908-1909a_0190.pdf", "page": 1, "text": "Thompson of the Baptist church and her remains weie interred in the family cemetery near Reedy Springs church on the old Hunter estate.J Deceased is sur vived by the following children Miss Mary Hunter, Benjamin and Coleihan Hunter, Mrs. But ler and Mrs. R. H. Cheatham, of Richmond Mrs. Julius Ames, of Winston-Salem, N- C- Mrs. I. D. Hunter and Mrs. D.H- Marshall, of Richmond Mrs. W.B. Brooks, Macon, Ga., and one brother, S. P. Coleman, of this county."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Ga., and one brother, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, of this county."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Ga., and one brother, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, of this county."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.33, 1418.67, 1855.54, 1536.27], "bbox_id": "30c294c8e6", "file": "AppomattoxNewspapers_1918-1922a_0064.pdf", "page": 1, "text": "This estimable lady passed away at her home near Spout Spring Monday. She had been a great sufferer for many jnths and no doubt death was welcomed by her. Her husband preceded her to the grave two years ago. She was a daughter of ex-Shenff, S. P. Coleman, and was a woman of"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "a daughter of ex-Shenff, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and was a woman"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "a daughter of ex-Shenff, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and was a woman"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [784.84, 1617.19, 942.14, 1870.03], "bbox_id": "4218b3a4c8", "file": "AppomattoxNewspapers_1898-1902a_0238.pdf", "page": 1, "text": "Thirteen deeds were admitted to record since August term. Will of M. A. Wood W. B. Wood was admitted to probate Mrs. 0. B. Wheeler, admx E. P. Sears, R. W. Bristow, aud H. E. Gilliam were ap pointed appraisers of the estatp.   Sheriff S, P, Coleman was appoint ed guardian of Samuel L. Loomis aud Lucinda Loomis, infants. J. W. Wright was appoiuteU over seer of poor for Jlover-Hill district. S. J. Lee qualified as school-trus tee for Soutliside district, vice A. H. Howerton, resigned. S econd D a y  S a t  b  a  . N el sop Mapufaetui-idg C q J against Spott ijice judgment for plaintiffs, J. R, Atwood vs. J. W. Wright continued to 18th iusiant. Rosa Jones selected Saml L. Fer guson as her guardian. Viewers were appointed to report ou proposed change of road to pass through the land of Joseph Graves."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "of the estatp.   Sheriff <mark>S</mark>, <mark>P</mark>, <mark>Coleman</mark> was appoint ed guardian"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "of the estatp.   Sheriff <mark>S</mark>, <mark>P</mark>, <mark>Coleman</mark> was appoint ed guardian"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1426.09, 228.71, 1586.24, 401.96], "bbox_id": "9171ef4d21", "file": "AppomattoxNewspapers_1905-1912a_0563.pdf", "page": 1, "text": "The School Board is in session today. Mr. S. P. Coleman is not so well today. Miss Ida OKeeffe is the guest of MrB. O. A. Hancock. Mr. W. B. Ellett, of Roanoke, was in town Sunday. Mr. and Mrs. L. E. Smith were Visiting in Richmond this week. Mr. Joseph OBrien is still con fined to his bed, though is con sidered better."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "in session today. Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is not so well"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "in session today. Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is not so well"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1495.69, 956.68, 1653.18, 1036.53], "bbox_id": "54bc6dbb0a", "file": "AppomattoxNewspapers_1892-1898a_0221.pdf", "page": 1, "text": "The Sale of the Surrender house Postponed. The sale of the surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. S. P. Coleman. Sheriff."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "The Sale of the Surrender house Postponed. The sale of the surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "The Sale of the Surrender house Postponed. The sale of the surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1667.74, 1257.28, 1825.04, 1337.95], "bbox_id": "ae53f7f09e", "file": "AppomattoxNewspapers_1892-1898a_0223.pdf", "page": 1, "text": "The Sale o fth e Surrender house Postponed. The sale of the - surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. S. P. Coleman. Sheriff."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "The Sale o fth e Surrender house Postponed. The sale of the - surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "The Sale o fth e Surrender house Postponed. The sale of the - surrender house postponed until Saturday the 23rd, day of March 1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1634.89, 821.01, 1801.26, 918.86], "bbox_id": "ea9660d83d", "file": "AppomattoxNewspapers_1912-1915a_0391.pdf", "page": 1, "text": "The new road from Appomattox to the top of the mountain through the farms of S. P. Coleman and A. H. Clement will be opened at once. This road will shorten the distance to town and will give a good grade ail the way to town from Red Honse."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "through the farms of <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and A. H. Clement"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "through the farms of <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and A. H. Clement"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [629.73, 964.87, 786.08, 1023.82], "bbox_id": "b01bb414ba", "file": "AppomattoxNewspapers_1898-1902a_0691.pdf", "page": 1, "text": "The ladies of the Presbyterian church will serve ice cream, cake, and lemonade in the S. P. Coleman storehouse, opposite depot, court day. Remember the piace and the cause."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "The ladies of the Presbyterian church will serve ice cream, cake, and lemonade in the <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> storehouse, opposite depot, court day. Remember the piace and the cause."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "The ladies of the Presbyterian church will serve ice cream, cake, and lemonade in the <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> storehouse, opposite depot, court day. Remember the piace and the cause."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.21, 365.87, 1731.49, 1329.71], "bbox_id": "555ce883e2", "file": "AppomattoxNewspapers_1926-1933a_0079.pdf", "page": 1, "text": "The home of Mr. and Mrs. I Thos. Henry Spencer, of Spout I Spring, was the scene 1 of real old Virginia hospitality I when relatives and friend? from  far and near come to celebrate  with them their golden wedding  anniversary. All but two  I their children were present and 1 quite a number of their graud- I children. The bride and groom I ofifty years ago are enjoying a ll remarkable degree of health and IB heartily welcome to their hospit-IB able board of about seventy-five 1 friends, some of whom were  present fifty years ago at the 11 real wedding. Among this num-ifl ber were Mrs. J. W. Durphy II land Mrs.. Blanch Sweeney, of I Lynchburg, and to speak of a l l half a century ago, Mrs. Durphy I was first waiter, and Mrs.Sween- I ey ast waiter, both position of I honor in the wedding party. I The home was tastefully decorat- 1 ed for the occasion in gold and I white. I A sumptuous dinner, really a I feast was prepared by their twin 1 daughters, Mrs Bates and How-11 erton,- and served under the L skillful hand of Chunk Woody, I of Lynchburg. The wedding, I cake whiph was a work of culi- I nary art was baked by Mrs. I Elizabeth Goodman Smith, of I Ohio, grand-daughter, of Mr. I land Mrs. Spencer. Among the guests present a I were Mr. and Mrs. A. H. How- I erton, Mr. and Mrs. H. S. Whit- laker, Mrs. R. E. Caldwell, Sr., Mrs. W. C. Chilton, Mrs. J. C, Cullop, Mr. and Mrs. B. M. Coleman, Mr. and Mrs. J. E. Dickerson, Mr. and Mrs. W. E- Dickerson, Mr. and Mrs. R. H. Chilton, of Concord, Mr. and Mrs W. T. Spencer, of Lynch burg, Sen. and Mrs. S. L. Fer- Ignson, Mr. and Mrs. I. B- Wheel er, Mr. and Mrs. J. O. Robert son, Mr. R. D. Whitaker, S. W. Alvis. S. P. Coleman, E. P. Car- son, A. W. Jones, M. W. Worley, H. B Marshall, R. W. Smith, I Jr., A. M. Goodman, R. H I Bates, Misses Esther Coleman, Mittie Goodman, Grace Cald well, Rissu Chilton, Ella Jones, Evelyn Cullop,. Catherine Cald well, Lena. Neil, Monk and Lu- cile Bates, Frances Smith. Lu- cile Marshall, Eula Mae Burke, Mrs, W. T. Steele, R. L. Burke, Mr and Mrs. G. E. Cheatham, of Crewe, Mrs. Durphy, Mrs. Sweeney, Mrs. G. M. Bass, M. and Mrs. J. H. Alvis, O. H. Spencer, Miss Bertha Spencer, Dick Darley. Chunk Woody Misses Alberta Terrell, Linda Witt, Mary Mundy, Clarkie and I Hesse Cheatham, Aubrey Cheat- I ham, all of Lynchburg, Mrs. O. I m . Howerton, of Richmond, Mr. and Mrs. W. D. Goodman, of Ohio, Mr. and Mrs. R. S. Spen cer, of Petersburg."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "P"], "snippet": "Whitaker, S. W. Alvis. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, E. <mark>P</mark>. Car- son,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "P"], "snippet": "Whitaker, S. W. Alvis. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, E. <mark>P</mark>. Car- son,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1664.65, 511.46, 1838.25, 924.38], "bbox_id": "ee166836db", "file": "AppomattoxNewspapers_1898-1902a_0144.pdf", "page": 1, "text": "the Democratic primary to J heklouApnl 29,1899 and I ,-e- spectfully ask the support of im countymen.  Very respectfully, J- R. HORSLEY. I respectfully announce myself a candidate for re-election to the ofllce of Sheriff of this county, and I promise if elected to serve the poopfe faithfully as I have tried to do in the past this annnunce- mdnt is subjeet to the action of the Democratic primary. I thank niy friends for their kind support in the past and hope it will be their pleasure to again elect me .sheriff. . Respectfully, S. P, COLEMAN. To the Votert of Appomattox County I horeby announce myself a can didate for re-election as County Clerk -for one more term, and re- epectfully solicit your support at tne primary election to be held on Saturday, April 29th, 1899, where the matter will be determined, submit my past record as the best J guarantee I can offer for a faith ul discharge of the duties of the gmee, jf it shall be your pleasure tofcgaiu.eject me. It will be im possible for me to leave the duties of the office to make a canvass of the county and I, therefore, sub- mit-roy claims to my friends. G eo . T. P i u s ."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me .sheriff. . Respectfully, <mark>S</mark>. <mark>P</mark>, <mark>COLEMAN</mark>. To the Votert of"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me .sheriff. . Respectfully, <mark>S</mark>. <mark>P</mark>, <mark>COLEMAN</mark>. To the Votert of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [249.07, 447.91, 413.06, 1223.26], "bbox_id": "1024d6fe6d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "TH E COUNTY CLERKSHIP. A right pretty political fight is to take place in this county for the clerkship, which is the best-paid office within the gift of our jieople The present clerk holds od for two more years, and then the will be made for an eight-year term Dr. D. Mott Robertson, late county- treasurer, who resigned that office last summer, has announced to sono of his friends that he will stand fo the Democratic nomination for tb clerkship, and that he will, if elect ed, run the office for the fees alone This would be a saving to the tax payers of nearly 600 per annum, or nearly 5,000 for thè term. The election is some distance be fore us, and it is not our purpose to stir up the candidates or the people upon the subject thus early  but we shall fill the field of a newspaper and keep our readers informsd of events as they occur. Among tbi possible candidates we feel warrant ed in mentioning our present sheriff. Mr. S. P. Coleman, who would be u formidable opponent for any aspir ant H. Winston McKinney, the ef ficient deputy clerk, who is perhapi more familiar with the duties of the office, and better qualified for theii discharge, than any other available man. Should he enter the race, he would undoubtedly have the warm support of Mr. George T. Peers, the present clerk  and Mr. Peers would, no doubt, remain in the office for a time to aid him in his work. Mr. J Rolfe Horsley, whom Mr. Peers de feated for the office in 1899, is also likely to be a candidate. Mr. Hors ley last Week resigned the position of private secretary to Congressman Flood, which oarried a salary of 1, 200 per annum paid by Congress and assumed the management of the Southside Virginian. The resigna tion of Mr. Horsley probably caused Dr. Robertsons early announcement of his candidacy. We are satisfied that there will be other candidates. The people are being quietly sounded as to thiB and that man, bat the great majority of them will hardly bind themselves to any one at this stage of the game- none, perhaps, except a few whc be lieve that they ought to be allowed  to shape all the public policies of the connty, and to name all of the officeholders years in advance of the election. We respectfully dissent, and Bhall await developments before we bind ourselves to the tail of any"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "our present sheriff. Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who would be u"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "our present sheriff. Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who would be u"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.8, 387.43, 2350.33, 978.27], "bbox_id": "882effca23", "file": "AppomattoxNewspapers_1922-1923a_0269.pdf", "page": 1, "text": "ter than Governor Swanson, some remarked. Mrs. S. P. Coleman waa called to the bedside of her sister, Mrs. Eliz abeth Wooldridge, whe was paralyzed about ten days ago. We trust this excellent lady will be restored to health and spared to her family many years yet Her sisters, Mrs. Robert Cheatham and Mrs. Kate Cheatham, of Campbell, are with her. Mra. Joseph W. Coleman and chil dren, of Lynchbnrg, are snmmering at their farm here. Mrs. If. L. Coleman and little son are spending the summer here also. Mrs. Lnla Howerton, of Reedy Spring, was the guest of Mrs. T. W. Oder on Sunday. Mr. Paul Warren, of Farmville, waa visiting at Mountain Viacv re cently. Aunt Jnlia Watkins, a most worthy colored woman, is very III. I Miss Clara Caldwell and Mr. May nard Fowlkes were guests at Mrs. J.  Colemana yesterday. Mr. Geo. Coleman, Jr., attended i preaching at Salem Sunday night. He was caught in the rain, arrived home at 216, and on to Appomattox land caught the 316 train for South  Norfolk. We think that at Last one pretty girl in that community  will agree with us that he is indeed a hustler from way back. The carpenters are at work on Mr. J. P. Plunksta.house We are rejoiced to see it going up. Mr. T. W. Oder was in tbe Hill City with tobacco l ist week. Mr. Obir Mann has been called to tke a force of bands near South Norfolk. Onr Appomattox bovg get there every time and we rejoice in their success. Marguerite Coleman is quite ill."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Swanson, some remarked. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> waa called to the"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Swanson, some remarked. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> waa called to the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1934.87, 522.25, 2097.42, 785.0], "bbox_id": "f74774098b", "file": "AppomattoxNewspapers_1905-1912a_0502.pdf", "page": 1, "text": "Soutlisirte. The ground-hog prediction is be n? fulfilled with a vengeance and Did you ever see auoh weather? ar.d No I never did is the com mon form of greeting nowadays. But No lane is po long but has a turning, and soon the bright sun shine and gentle South wud will hauge all this and the sweet spring time will be here again. Much tobacco is being ha led a mai ket nd how one does pity the poor faithful horses for thè roads are almost impassable. Bad colds, th grip, and pneu monia are prevalent and our good doctors are kept busy. What a bleeding it is to be able to alleviate aud relieve pain and suffaring. Messrs. S. P. Coleman and J. F. Purdum, who have been sick w th"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "pain and suffaring. Messrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and J. F. Purdum,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "pain and suffaring. Messrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and J. F. Purdum,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.3, 538.26, 1841.15, 1267.83], "bbox_id": "f2bf09cc10", "file": "AppomattoxNewspapers_1922-1923a_0475.pdf", "page": 1, "text": "Southside, What is more lovely than a day in June, and indeed this old earth  does seem at its best iu this the month of roses. In spite of the cold rains and chilly winds that I seemed to retard the growth of everything, all has worked around alright, on this lovely-lovely morn ing. The air fragrant with the scent of honeyBuckle and roses and the birds singing in the trees, as sures us that the  Good old Sum mer Time  is near once more. Wild strawberries aie plentiful, but not a cherry to be seen, and the small boy will have to look else where for June apples. There was right much tobacco planted last week. Wheat and oats are looking well, corn is late and some are not through planting. There has been right much sick ness around in the last few weeks. Mrs. T. A. Caldwell, who has been confined to her bed for the past five weeks, is able to be up  again. Mrs. J. T. .Cole and Mr. Ben Cole, who have been very sick since our last letter, are about well again. Mr. Williams, who is suffering from goitre, is not much improved. Mr. Geo. W. Coleman, Jr., who  has been at home sick with chills and fever, returned to his work at Bellevue this mo-ning. Mr. G. A. Walton is also at home sick with chills contracted while working near Norfolk. Mrs. Anna Coleman, who went to Lynchburg to consult Dr. Waugh, returned recently after a pleasant visit to her sons in the Hill City. Mr. W. P. Coleman returned from a trip to Lunenburg last week. Mrs. S. P. Coleman and Mr. John S. Plunkett visited relatives near Reedy Springs last week. Mr. and Mrs. Clinton Cawthorn and sisters, Misses Lillie, Alma and Bernice and brother, Mr. Lizy Caw- thorn have returned from a most delightful trip to the Exposition. Mr. Floyd Bush, of Toga, visited relatives here Sunday. His brother, Mr. Joe Bush, who has been living in Appomattox for the past 7 months, has returned to his home in Bnckingham."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "Lunenburg last week. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and Mr. John <mark>S</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "Lunenburg last week. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and Mr. John <mark>S</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2145.56, 525.41, 2321.82, 1172.06], "bbox_id": "c510a9c3e5", "file": "AppomattoxNewspapers_1922-1923a_0379.pdf", "page": 1, "text": "Southside. The sands of time have rolled around again bringing another glad Xmas time and again we send mer-  rj Xmas greeting to the T imes and j its many readers, and may the old glad tidings of Peace on earth good will to men find a responsive echo in each and every heart Getting ice has been the occupa jtionof many this week. Messrs. J. T. Caw thorn anti J, T. Cole are the only ones we know of who have filled their bouses, but tfiey ure always ahead. We trust that all of your corre-f spondents who have been so busy fixing for Xmas will let us hear from them now, How do we know ycu have baim busy fixing for Xmas? Because, a s the old o I ow d said, We were in the same fix. It is hard for ns o get up a newsy let ter when the lives of most of ih ar just moving along tlit- same old way. Mrs. S, P, Coleman, who has! been quite sick is soniethinu hetfe. We are glad to note that Mrs.I Robert Woolridge, who has bven  sick so long is getiing about agiin,  Mr. C. li, Mann has been quite ill. . Mr. T. A Colemans condi iou iej about the same. Moit of his chl  dren returned to the old hme to I spend Xmas, for probably the last lime, as the family expect, to move in their new house as so n as com pleted. Mr, snd Mrs. Conrad Oder, of the Hill City ate guests of Mr. T. W. Oder, Mr. aud Ms. Ellis Oder are visit- .ng relatives near Reedy Springs. Mr, Frank Woolridge, who hse fipen at school in Richmond, is at home for the holidays. There was preaching at Forrest last Sunday p m Mr. Ben Giles bad the misfor tune to love one of his horses re cently."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "same old way. Mrs. <mark>S</mark>, <mark>P</mark>, <mark>Coleman</mark>, who has! been quite"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "same old way. Mrs. <mark>S</mark>, <mark>P</mark>, <mark>Coleman</mark>, who has! been quite"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.86, 534.47, 2179.13, 1293.27], "bbox_id": "7d6f267fb2", "file": "AppomattoxNewspapers_1922-1923a_0493.pdf", "page": 1, "text": "Southside. Our usually quiet community has been enlivened by a number of pleasant visitors during the past week. Mr. Geo. Plunkett, of the Hill City, is the guest of his uncle, Mr. John S. Plunkett. Messrs. Cieve Strickland and Lin- v.ood Goslin, from Pittsylvania, have been visiting their relatives, the family of Mr. J . T . Cole. Mrs. Luther Coleman and bright little son, Thomas, are spending sometime with Mrs, A . E . Coleman. Mr. and Mrs. Wm. Cheadle, of Hurtsville, are the gnests of her mother to-day. M ri Luther Coleman, of Radford, Mr. and Mrs. Geo T. Coleman and little Misses Kathlean Beasley and Elva Coleman, of Lynchburg, are also visiting Mrs. A . E . Coleman. Mrs. John 8. Plunkett and daugh ter, Miss Mary, have returned from a most pleasant visit to the family of Mr. A . Plunkett, of Lynchburg. Mrs. S. P. Coleman is visiting her daughter, Mrs. Ellis Odor, near Reedy Springs. We are grieved to note the death of the little son of Mr. and Mrs. James Paris. We extend our sym pathy to these afflicted parents. The recent frequent showers have been of great benefit and crops though late are looking well. Mr. J . T . Cole has the finest piece of tobacco in theneighborhood, and w doubt if it can be beateD in the county. Farmers are saving their pats anil hay and getting ready for the thrashing machine. Your correspondent received seve ral messages lately, one from a dear friend of your town and one from Toga, saying,  We always read the Southside letter first when we get T h e T im es  please write often. Now we hope that we will not be accused of  loving taffy, as the Hebron correspondent puls it, 1 nt the ftords of appreciation are prized because they are the kindly expres sions of affection and not flattery. Thank you dear friends. We only wish our letters deserved your praise, and we assure you that now when we write it will be with thoughts of many dear friends who are readers of T he T im es , both far and near."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Plunkett, of Lynchburg. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is visiting her daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Plunkett, of Lynchburg. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is visiting her daughter,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1684.83, 613.7, 1850.58, 1193.8], "bbox_id": "091b796cb0", "file": "AppomattoxNewspapers_1915-1918a_0358.pdf", "page": 1, "text": "Soutbslde I Dear EditorIf you will Bi llow us a little space we will I send in a few item? this week. I The weather is getting good  again, and our farmers are I I very busy people, as they are I very much behind in their  work due to so muoh wet I weather, but the good Lord I will give them time yet to plant. We advise them to I plant large food crops, such as I Ipeas, beans, potatoes and .corn. I h gratifying to the friends I p f Mr. S. P. Coleman to know I I that he is out again. I Mr. and Mrs. David Martin,! I of McKees Rooks, Pa., who! I has been visiting their parents  I here, left for their home mon-1 Iday. 1 -I  Miss Marguerite Coleman, of I I Crewe, visited relatives here I I Sunday and Monday. f We are sorry to hear of thel I departure of Mr. Doug Martin  from our midst, we wish him  much success. . 1 J Mr. and Mrs. Henry , Odor -jvisited the formers parents  Saturday and Sunday. II Misses Bessie Coleman Rach-  el Hunter and Mr. Allen Hunt- e r attended the danee at Mr. Turn Fords, one night last  week. j Mr. Ben Abbitt, of Prince Ed-  ward comity, visited bis broth  er, Mr. Cf. N. Abbitt here last  week. We are glad to hear jth at Mr. Abbitt is improving.! I Mr Elliott C h e a t h a m , of  Spout bpring, visited relatives I here last Sunday.  Mr. Derry OBrien will leave I soon for Roanoke, where he ex-  pects to work. j Success to the Times-Virgin  ian, and its readers."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "I p f Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> to know I I"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "I p f Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> to know I I"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1467.85, 173.65, 1642.31, 1258.14], "bbox_id": "fdae28e8a8", "file": "AppomattoxNewspapers_1905-1912a_0059.pdf", "page": 1, "text": "Soul halite. Christmas passed off moBt pie i antly and w,e are well launched on the new year. We know not what is before ns, and it is well that we dont for some of ns would perhaps stand appalled at what this year 1910 may bring. May p ace and prosperity attend the T imes -V ib - ginian ana its readers. The weather has b.en cold and disagrable, bnt how one enjoys these long winter evenings when the curtains are drawn and we gat her around a log fire for reading, lively conversation and merry games. At suck times one does not envy their city cousins their superior recreations. Mrs. Lelia Maun died quite sud denly at her home near here on the 7th inst. She bad been failingfor some time, but was thought better, and her death was quite sudden. She was a good woman, faithful in all things and a mo t devoted mot her. She had been a member of the Baptist Church since early girlhood and we are assured that  it is well with her. 8he leave a husband, Mr. Gilliam Mann, Bevcn children, and other relatives to mouru -their loss. Blessed are the dead who die in the Lord. They rest from their labors and their works do fol- ow them. Mr. Bob Woolridge is seriously ill at his daughters near his old home. Mf. Woolridge has spent his whole life here, and we are sure all M b neighbors are sorry to hear of his illness. Miss Louis Wingfield spent Sat urday and Sunday with neF home people.  Mr. Geo. Coleman, J ., who is re lieving Mr. Tom Crawley, section foreman at Pros pec , spent ftunday with his parents. Messrs. Frank Fieshman, Walter lopkins and Courtney Wo afield, of Charloto , were guests at .louutain View on Sunday. Mr. Ben Maun, of Roanoke, who las been at home for some time, in,8 returned to his work as engineer on he N.  W. Mi8. John Maun is quite sick. Supt. Hannah visited tne school at Bush Forest last week. Leslie Dixon, Cecil Staples, Bessie Wool- idge and Carson Giles were on thej.1 honor roll of the school for the month of December. Mrs. J ia. Plunkett, who has been quite sick, is better. Messrs. Charlie and Geo. Plunkett and Mr. A. Plunkett, of Lynch burg, visited here recently. Mr. S. P. Wingfield, of Charlotte, and his daughter, Mrs. Leslie Thornhill, of the Hill City, are yisit- ing relatives near Charlottesville. Mr-and Mrs. Clinton Cawthorn and Mr. and Mrs. Ellis Odor and little girls, Nellie and Nannie, visit ed Mr. and Mr. S- P. Coleman Sun day.  Mr. Tom Oder made a business trip to Lynchburg last week. Messrs. Robert Hunt and Leslie aud Emmet Whitehead, of Hurts- ville, were guests m the neighbor hood recently. We understand that Mr. J. W. Coleman has bought a fine farm near Gnode on the N.  W. and will soon move his family there."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "ed Mr. and Mr. <mark>S</mark>- <mark>P</mark>. <mark>Coleman</mark> Sun day.  Mr. Tom"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "ed Mr. and Mr. <mark>S</mark>- <mark>P</mark>. <mark>Coleman</mark> Sun day.  Mr. Tom"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [218.66, 836.65, 837.92, 1035.11], "bbox_id": "80e7a9fed4", "file": "AppomattoxNewspapers_1908-1909a_0463.pdf", "page": 1, "text": "Slim Chance Mrs. Lovd Nash of Lynchhnrpr could plead that Abraham was Imiti which was iiiustcan fled before be was circumcised, hi visited her children Sunday in -the home-of T. J. Nash.  Mr. and Mrs.  W. L. Shields, of Ohio, Mr. and Mrs. R. W. Martin, Mrs. M. W. Hunter and Mrs. Annie Odor visited in the home of Nuzz Ford near Lynch burg Monday. Mr. B-C- Simms and family spent last Senday in the home of R. W. Martin. We were sorry to hear of the death of our esteemed citizen S- P. Coleman. The family has"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "of our esteemed citizen <mark>S</mark>- <mark>P</mark>. <mark>Coleman</mark>. The family has"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "of our esteemed citizen <mark>S</mark>- <mark>P</mark>. <mark>Coleman</mark>. The family has"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Plunkett, T. B. Bryant, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Frank W. McKinney and"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Plunkett, T. B. Bryant, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Frank W. McKinney and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1857.1, 696.99, 2016.96, 933.52], "bbox_id": "77e8f5ed8a", "file": "AppomattoxNewspapers_1892-1898a_0238.pdf", "page": 1, "text": "Sheriffs Sale of Land in Appomattox County, Va. I will, on Thursday, the 20th day of June, 1895, sell at public auction, on the premises, in pursuance of an order of the county court of Appo- mottox county entered at he Feb ruary term, 1895, the tract of land belonging to John Mehan, situated near Hixburg, in said county, adjoin ing the lands of L. R. Glenn and others, and which was purchased by said Mehan from Wm D. Hix. This sale is to satisfy an execution in my hands in favor of the said Wm. D. Hix, the amount of said execution being 40.84, with interest on 32.- 40, from 1 st day of January, 1893, and the cost of executing this sale. The sale will take place at 11 oclock, A. M. Terms of sale Ca 3 h. S. P. Coleman, Sheriff of Appomattox Co. 20-4t"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "sale Ca 3 h. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "sale Ca 3 h. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1527.05, 1222.43, 1686.1, 1459.41], "bbox_id": "9177e45b01", "file": "AppomattoxNewspapers_1892-1898a_0242.pdf", "page": 1, "text": "Sheriffs Sale of Land In Appomattox County, Va. I will, oil Thursday, the 20th day of June, 1895, sell at public auction,  on the premises, in pursuance of an order of the county court of Appo- mottox county entered at the Feb ruary term, 1895, the tract of land belonging to John Mehan, situated near Hixburg, in said county, adjoin ing the lands of L. R. Glenn, and others, and which was purchased by said Mehan from Wm D. Hix. Lhis sale is to satisfy an execution in my hands in favor of the said Wm. D. Hix the amount of said execution being 40.84, with interest on 32. 40, from 1st day of January, 189a, and the cost of executing this sale. The sale will take place at 11 o clock, A M. Terms of sale Cash. S. P. Coleman, Sheriff of Appomattox Co. 20-4t"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1356.25, 620.58, 1499.98, 641.4], "bbox_id": "cb38dd96ef", "file": "AppomattoxNewspapers_1892-1898a_0248.pdf", "page": 1, "text": "Sheriff S. P Coleman was iu Lynchburg on business Thursday,"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark> <mark>Coleman</mark> was iu Lynchburg on business Thursday,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark> <mark>Coleman</mark> was iu Lynchburg on business Thursday,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [342.95, 526.75, 467.17, 604.52], "bbox_id": "7a9c7ff0c8", "file": "AppomattoxNewspapers_1892-1898a_0236.pdf", "page": 1, "text": "Sheriff. S. P. COLEMAN. Treasurer. WILLIAM J. TRENT. Commissioner of the Revenue. L. E. SMITH."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "Sheriff. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>. Treasurer. WILLIAM J. TRENT. Commissioner of the Revenue. L. E. SMITH."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "Sheriff. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>. Treasurer. WILLIAM J. TRENT. Commissioner of the Revenue. L. E. SMITH."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [603.33, 339.55, 720.89, 360.84], "bbox_id": "a34a3c633a", "file": "AppomattoxNewspapers_1898-1902a_0380.pdf", "page": 1, "text": "Sheriff S. P. Coleman Richmond Friday."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Richmond Friday."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Richmond Friday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.4, 750.51, 1777.79, 947.25], "bbox_id": "f444b461f5", "file": "AppomattoxNewspapers_1892-1898a_0125.pdf", "page": 1, "text": "Sheriff S. P. Coleman, owing to the negros threat that no one should ever take him alive, organized a posse and went to Hunters house to ar rest him. But when they arrived the bird had flown and up to the present all inquiries have failed to disclose his hiding place. Carters wound is said to have been very painful and even danger ous  but is now slowly improving. We hope that our officers will be diligent in the pursuit of the crimi- by both sides. It is to be hoped that we may be able to abstain, in this I    ndn  aówmaáydayslo election, from the turmoil and hos tility that has so clearly prevailed  I b7hTnd prison bars, contests of a similar nature in other"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, owing to the negros"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, owing to the negros"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1590.5, 1140.23, 1750.65, 1198.03], "bbox_id": "4ce62215ac", "file": "AppomattoxNewspapers_1892-1898a_0049.pdf", "page": 1, "text": "Sheriff S. P. Coleman left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of thiscounty, who has been recently adjudged insane,"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of thiscounty, who has been recently adjudged insane,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of thiscounty, who has been recently adjudged insane,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1588.14, 1154.66, 1748.79, 1212.21], "bbox_id": "591971a5eb", "file": "AppomattoxNewspapers_1892-1898a_0050.pdf", "page": 1, "text": "Sheriff S. P. Coleman left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of this county, who has been recently adjudged insane."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of this county, who has been recently adjudged insane."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> left here last night for the Western Lunatic Asy lum, at Marion, having in charge Peter Davis, of this county, who has been recently adjudged insane."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [461.06, 1449.61, 618.7, 1476.06], "bbox_id": "c9819cad4c", "file": "AppomattoxNewspapers_1898-1902a_0139.pdf", "page": 1, "text": "Sheriff S. P. Coleman announces himself a candidate for re-election. He has served the people faithfully and efficiently for two"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> announces himself a candidate for re-election. He has served the people faithfully and efficiently for two"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> announces himself a candidate for re-election. He has served the people faithfully and efficiently for two"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [284.4, 531.02, 365.05, 553.42], "bbox_id": "4f20785dde", "file": "AppomattoxNewspapers_1892-1898a_0238.pdf", "page": 1, "text": "Sheriff. S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "Sheriff. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "Sheriff. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [413.75, 411.86, 535.8, 461.71], "bbox_id": "1c76d16d81", "file": "AppomattoxNewspapers_1922-1923a_0124.pdf", "page": 1, "text": "sale of personal property H D. Flood for Friday home in S p Coleman is somewhat improved"}, "highlight": {"text": {"matched_tokens": ["S", "p", "Coleman"], "snippet": "sale of personal property H D. Flood for Friday home in <mark>S</mark> <mark>p</mark> <mark>Coleman</mark> is somewhat improved"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "p", "Coleman"], "snippet": "sale of personal property H D. Flood for Friday home in <mark>S</mark> <mark>p</mark> <mark>Coleman</mark> is somewhat improved"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [684.67, 946.66, 846.5, 1164.76], "bbox_id": "035bf7670a", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "S. P. Coleman, sheriff aud admr. of Jas. C. Ford deceased vs. T. J. Nash  from justice courtverdict for plaintiff. Commonwealth vs. Alin Maria Wheeler tor feloniously cutting the throat of, her mothersent to the penitentiary for one year. Commonwealth vs. Moses Wat kins and Cleveland Watkins, grand larceny fined  10 each and sen tenced to two months in county jail.  J. H. Forbes vs. F. S. Lomis, admr. c., continued. D. M. McGhee vs. C. F. Harvey and Albert Davidson vs. J. E. Mc Kinney  continued."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff aud admr. of"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff aud admr. of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [408.0, 420.77, 539.49, 471.23], "bbox_id": "323c1e1038", "file": "AppomattoxNewspapers_1898-1902a_0299.pdf", "page": 1, "text": "-S. P. Coleman. HirerD. Mott Uibertson. j of SupervisorsW. H. Ligon, chair- 5 , Stratton and J. 0. Jones. Board nn Wednesday after first Monday in June, September, and December."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "-<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. HirerD. Mott Uibertson. j of SupervisorsW. H. Ligon, chair- 5 , Stratton and J. 0. Jones. Board nn Wednesday after first Monday in June, September, and December."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "-<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. HirerD. Mott Uibertson. j of SupervisorsW. H. Ligon, chair- 5 , Stratton and J. 0. Jones. Board nn Wednesday after first Monday in June, September, and December."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1738.57, 1031.68, 1895.98, 1050.82], "bbox_id": "cac4de5ddb", "file": "AppomattoxNewspapers_1922-1923a_0548.pdf", "page": 1, "text": "S. P. Coleman Comes Out for tbe Legislature."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Comes Out for tbe Legislature."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Comes Out for tbe Legislature."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1398.73, 752.83, 2116.82, 809.23], "bbox_id": "f16b3c4a2c", "file": "AppomattoxNewspapers_1926-1933a_0462.pdf", "page": 1, "text": "S. P. Coleman 50 Calcium Carbonate 40 Magnesium Carbonate"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> 50 Calcium Carbonate 40 Magnesium Carbonate"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "<mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> 50 Calcium Carbonate 40 Magnesium Carbonate"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1748.34, 1041.86, 1907.09, 1146.1], "bbox_id": "5308d46762", "file": "AppomattoxNewspapers_1922-1923a_0544.pdf", "page": 1, "text": "S. P . Colemau Comes O ut for tMe Leglsla ture. At the urgent request of. many friends, I hereby announce myself a candidate for the House of Delegates for the Appomattox district. Iam a Democrat, but do not en dorse thb plans of the present organization for party management and respectfully sub mit my appeal to my fellow Democrats of the county and ask for their support at the election to be held on November Stb. S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "held on November Stb. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "held on November Stb. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1998.95, 529.02, 2166.59, 1222.54], "bbox_id": "d1073f6e48", "file": "AppomattoxNewspapers_1912-1915a_0401.pdf", "page": 1, "text": "S outhside. The meeting which has been going .on at Central closed Friday night. We understand there was a large attendance and fine preaching. The weather is delightfully cool and pleasantjust the weather to attend protracted meetings and associations. Miss Beatrice Garrison, of Memphis, Tenn , . is visiting her aunt, Mrs. J. T. Cole. Mr. and Mrs. Haga, of Lou don, and litte son are visiting her sister, Mrs. Napoleon Pat- terson. Miss Annie Laurie Marshall, Of Hixburg, is spending some time with her aunt, Mrs. A. R Harwood. Mr. and Mrs. Ed. Kidd, Mr and Mrs. Willie Kidd, of Vic toria, and M eary Kidd, of South Carolina, visited theii sister, Mrs. Neal Harvey, re cently. Miss MajFY Plunkett is spend ing somt time with her aunt Mrs. C. T- Cawthon. Miss Marguerite Coleman is visiting, her brother, G. W. Jr., in Crewe- She will spend some time with hep sisters Mrs, James A. Cory, of Nor folk, and Mrs. Paul Warren, of -shawboro, N. C. Mr. and Mrs. Mace Coleman MA baby, of Lypcbirg, are spending some time with his mother here.  We are glad to note that the little son, of Mrs. Lily Moses, who has been suffering so much with an absoess, is getting bet ter. Mrs. America Harvey is again quite sick. The road machine is opening up the road from Mountain View through by Messrs S. P. Coleman and W. H. Morgans at last. Why not make it a trolley line on to the Red House? We are very sure it would be travelled all right."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "View through by Messrs <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and W. H. Morgans"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "View through by Messrs <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and W. H. Morgans"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1955.14, 524.16, 2121.28, 1315.84], "bbox_id": "9eab0f38ea", "file": "AppomattoxNewspapers_1922-1923a_0395.pdf", "page": 1, "text": "S o u th s id e . How is this for winter? We just fee like saying, I told you s, to the many who have predicted th t we- were not going to have any had Wnther flnd that the beautiful snow would be conspicuous by its absence. We think that every one will be able to fill their ice houses if the weather continues cold a few days. Farmers have been plowing and burning plant hinds, but this cold spell will give them more time to talk of the new railway route proposed by .he N.  W. Your correspondent heard to-day that it is thought it will come by Caldwells mill and strike Evergreen about at Mr. Hudson Ch at hams. To such lengths will peoples imagination carry them, and we expect the hair on many a young head will be white before that comes to pass. We are sorry to le irn of the con tinued illness of Mrs. Alice Wool dridge, at the home of M r. Robt Wooldridge, of your town, We trust that she may soon be well enough to be taken home. The family of Mr. T. A. Coleman moned in their sabstantix new home a6t week. Mr. Coleman is somewhat improved. Mr. and Mrs. Ellis Odor movsd to h is - brothers farm near Reedy Springs last week. We are sorry to lose them from this neighborhood. Ex Sheriff S. P. Coleman and son, J. T. were in Lunenburg on a bu siness trip recently. Rev. George Chockley preached a fine sermon at Reedy Springs 4th Sunday morning. Mr. and Mrs. Robert Holycro. have moved to the old Cbleman homestead. We welcome them to our community. Mrs. S. P. Coleman is still quite unwell. We were sorry to hear of the ill ness of Mr. Ed. Woolridge. Mrs. Lee McCormick, of Lynch burg, who has been on a visit to her parents Mr. ano Mrs. Will,tam Macii, has returned home.  Mr. Early Mann, who s workin near Petersb rg, spent Sunday with bis home people. Several members of Mr. Neal Harveys family have been sick. Mr. Geo. Coleman of Souih N oifo k, and Mr. Maynard Fowlkes attended services at Salem and vis ited relatives near Reedy Springs 3rd Sunday."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "this neighborhood. Ex Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and son, J. T."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "this neighborhood. Ex Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and son, J. T."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1902.46, 540.41, 2168.83, 1063.85], "bbox_id": "f4680de541", "file": "AppomattoxNewspapers_1905-1912a_0571.pdf", "page": 1, "text": "S d tH is id e . Hello! Hovrih-etoWbofiy this lovely morning? We are well and hope these few lines may I find you all tbeuMane and able to eat your lowance. When last we sent a greeting to the T imes readers , March winds were blowing and everytMhgl, was covered with snowtusd iebjr Now the good old stffmnter- time Is here aghin and evfiry-1 one  hustling. Corn is look-, ing well and right much tobac co has been planted. We hear that the wheat crop is not so good. Everybody is enjoying! new vegetables and an abun- danoe of cherries. We arel afraid to say how many bus-l hels our ndw neighbors, the I Beagles, have gathered, can- ned, preserved .and dried. j Mr. 8. P. Coleman Jr., from Inear Reedy Springs, visited hist unole, Mr. S. P. Coleman I Sr. last Sunday. We are sorry, to note that Mr. Colemans condition is not much improv ed. - 1 Mrs. J. T. Cole and M m . Neal Hairvey made a business trip to Lynohhurg recently. I Miss Florence Morgan, a most attractive young lady from Orewe, is spending some-1 time with,her father, M r. W,J H. Morgan, here Mr. O. N. Abbitt and eon,,A l-j freid, who haVO been quite sick, are much better. Mr. Artbqy Flesh man, off Lynchburg, is at home on h m vacation.  I Hollywood."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "visited hist unole, Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> I Sr. last Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "visited hist unole, Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> I Sr. last Sunday."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1063.26, 1146.0, 1225.15, 1452.88], "bbox_id": "6c3b80a957", "file": "AppomattoxNewspapers_1898-1902a_0376.pdf", "page": 1, "text": "S ALE OF VALUABLE Tit ACT.in pursu- anceof decrees of the Circuit Court for Appomattox county, in . V J! mi vs. Win. A. Jones, and l.lti .i.  nu..nittre. VS. Wra. A. Julies eon!04Íditii, c Mil li at a ction on Tff IJitdDA T. tin- ihut Soem ber, HIU. at Appoiaat ti Court ILm. Iu being county court day. tlit vlmhle tract of Land devised by tt iu. A. Jinn, Sr., to hi son, Wm. A. Jones. It lies on Holiday Creek, in ai con. 1 tv. and contains by recent surey acres. The upland is hilly, but he soil in good and there are fine low grounds on tli creek. Th main body of the two story dwelling Ionise was built of heart timber, and is well preserved, but the porches have fallen down. here are many cabins and out houses, but they ure in bad repair. It has been sub-divided into live tractswa acres, 527 acres. 387 acres, 95 acres, and i   acr?s. which are more fully described on hnmi bills. We will sell in sepárate tracts, or 1 In- whole as we may realize the best prices. Mr. Walter B. Forbes, on the Jund. aud Mr. S. P. Coleman, at the Court House, have plats and will show the laud to purchasers. TERMSTen percent, cash, balauce in 1, 2,8 and 4 years, bonds with waiver of home stead, good security, six per cent, interest from day of sale, and title retained till all the purchase money ia jild . r  M HDWAltD 8 . BROWN, Cothniiasiouer. Paid commissioner have riven the required bonds in said suit. GEO. T. PEERS. Clerk. WOOD A CO., 6 0 9 M A I N S T . LYNCH SURC, VA. ------- WHOLKSALE ------ -"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "the Jund. aud Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, at the Court House,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "the Jund. aud Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, at the Court House,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 450.08, 1959.69, 1747.65], "bbox_id": "6d7a6c0bcd", "file": "AppomattoxNewspapers_1915-1918a_0017.pdf", "page": 1, "text": "Platform ot Principles Adopt ed. Party Organization. Much Enthusiasm. Large Attend ance. Pursuant to a call of Dr. D. M. Robertson, Chairman, of the Citizens Party a large and enthusiastic meeting of citi zens assembled in mass meet ing at the Courthouse here Fri day and adopted a platform of principles and practically put a full tioket in the field for all County and District1 officers in opposition to the nominees of the Democratio party. Every seat in the Courthouse was oc cupied and m an were stand ing in the aisles. The crowd was estimated at 200.  Many of these, however, were specta tors, and not in sympathy with the movement. Dr. L. M. Robertson, Chair man, appointedthe following Committee on Resolutions J. W. Cawthorn Jr., R. S. Jen kins, David Alvis, E. F. Col- lips, S. P. Coleman and J. T. jGotas. While the committee was out J. P. L. Fleshman addressed the meeting. Mr. Fleshman has been a Republican for many years his remarks were direct ed against the office-holders of Appqmattox County, particu larly for raising the assessed values and the rate of taxation he referred to a notice posted by the Superintendent of Schools, 1800 for schools and 1700 for incidentals. He wanted the receipts and dis bursements published of the school fund, also the road fund and the Supervisors proceed ings. He wants Appomattox to sell her poor houses and pay her debts, two poor houses and three paupers is too expensive, he deolared. He opposed a bond issue, saying it would make slaves of the people. The Committee on Resolu tions then made its report and the chair requested J.- W. Caw- thon, the Chairman, to ex- lain to the meeting the reso- utions they were unanimously adopted. We, the citizens of Appomat tox County in mass-meeting assembled at the Courthouse of said county on this the 20th day of August, 1915 desirous of promoting our own welfare and that of every other - citizen of our county do make the fol lowing declaration of princi ples and for the support of this declaration we mutually pledge to each other our influence and our votes. We demand a more economi cal administration of our State and county affairs, and that all taxes and licenses be eq a- ized as nearly as possible and that the poll tax be made col lectible as other taxes and abolished as a prequisite to voting. We demand the repeal of the aw appointing the  board of review to do over the work al ready performed by the -con? missioners of the revenue, as this is a useless waste of money and very objectionable to the people. We believe that it is detri mental to the best interests of the people for any county offi cial to bold office for a period of more than two terms, as ex perience has proved that many of them become seif-perpetuat ing political bosses, thus caus ing a detriment to the public welfare. We demand that the expen sive, antiquated system of deeds and mortgages be discon tinned and a modern system be adopted, such as the Torrens system, whioh would be a sav ing to the people of Virginia of a half million to one million dollars a year. We demand that the State publish and distribute its school books at cost, which would mean a large annual saving to our people. We demand that our old sol diers be better provided for in thoir declining years and th at"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "E. F. Col- lips, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and J. T. jGotas."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "E. F. Col- lips, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> and J. T. jGotas."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [332.87, 785.78, 498.88, 1589.41], "bbox_id": "7235aad83b", "file": "AppomattoxNewspapers_1898-1902a_0489.pdf", "page": 1, "text": "permanent ch.iirmau, aud Mr. A. Ii. Clemeut as secretary. On motion of Mr. S. L. teigusou, it was decided that twenty-two dele gates be chosen to cast the eleven O votes to which Appomattox is enti tled, each delegate to cast half a vote. Mr. Ferguson then moved that three persons, one from each magis terial district, be chosen to recom mend- to the meeting twenty-two persons who would be suitable dele gates. auil who would probably be wtlliug to give the time and expense involved in attending the conven tion. A substitute was offered by Uolouel Poore that the old-fashioned method be folllowed of dividing into districts for the purpose of selecting delegates but the original motion prevailed, and Messrs. L. A. Smith, S. C. Stratton, aud E. P. ears were appointed to recommend delegates. Lhese gentlemen, after consultation, reported the following, who were unanimously chosen as delegates Messrs, ii. D. Flood, W. H . Lew is, Dr. E. E. Waiker, J . O. Jones, i . J . Stratton, A, ii. Element, John R. Horsley, J . H. Robinson, Thomas A. Smith, Joseph Button, R. L. Burke, J . W. Oveitou, S. P. Coleman, R. B. Poore, S. L. Ferguson, T. E. Owen, Dr. D. Mott Robertson, T. W. Moses, Dr. J . B. Abbilt, B. C. Childress, Judge D. A. Christian, aud R. W. W horley. A resolution was adopted author izing the delegates to appoint alter nates, and instructing those present to cast the entire vote to which the county is entitled. Upon motion of following resolut-1-  i . anting vote without a  . ,,eeoived, That the delegates se ated by this meeting to the Demo- ratic convention which is to assem ble in Norfolk on August 14 be, and re hereby, instructed to vote for ion. Edward Echols for the nomi nation for Governor as long as his name is before said convention. Upon motion of Mr. J . H. Abbitt, ne following was adopted  Resolved by the Democrats of Appomattox, in mass-meeting assem bled, that the delegates this day elected be instructed to vote for the nomination of Hon. John L. Jeffties, of Culpeper, for the office of Attor- nev-General. Mr. Saml L. Ferguson offered the following, which was adopted  Whereas Hon. J . Taylor Elly son, our present efficient State chairman, has signified his willingness to serve longer in that capacity, aud whereas"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "Burke, J . W. Oveitou, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, R. B. Poore, <mark>S</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "Burke, J . W. Oveitou, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, R. B. Poore, <mark>S</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1082.39, 1364.56, 1239.68, 1565.5], "bbox_id": "f31a63ea51", "file": "AppomattoxNewspapers_1898-1902a_0153.pdf", "page": 1, "text": "p i VACATION OF THE CIRCUIT COURT 1 of A ppom attox county, F ebruary 22d, 1899. The D istrict School Hoard of Stonewall Dis tric t of A ppom attox co u n ty ....... .. Plaintiff. against Sam uel Jones, A lexander Jones, Wm. E. Jones, the last named a convict in the Pen itentiary jof Virginia and S. P. Coleman, sheriff, and Com m ittee o f said Wm. E. Jones, John Jones, Ellen W est. A lbert Jones, Mary F. Jous, widow, and other heirs of A lfred Jones, decd..... Defendants. The object of th issu i. is to secure a con veyanco of real estate sold by A lfred Jones, to th e pi intiff and which was paid for by the plaintiff in the life tim e of said A lfred Jones. And it appearing by affidavit th a t the de fendant Wm. E. Jones is a convict in the P enitentiary of Virginia, and th a t the defen dants John Jones, Ellen W est and A lbert Jones are not residents of this State, and th at the residence t f Frederick Jones is unknown, it is ordered th a t they do appear here w ithin fifteen days a fte r due publication of th is or der once a week for fo u r successive weeks in the A ppom attox and Buckingham T im es , a uewsp per published in this State, and do w hatever is nece?sar to p ro tect th e ir inter est is th is suit. A copyTeste GEO. T. PEEKS. Clerk. H. D. F lood , r_ _ S. L. F erguson , f p 2-23-4w."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "itentiary jof Virginia and <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff, and Com m"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "itentiary jof Virginia and <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff, and Com m"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.91, 583.69, 1926.64, 1376.59], "bbox_id": "e34a7d1b83", "file": "AppomattoxNewspapers_1912-1915a_0260.pdf", "page": 1, "text": "P. Coleman were in the Hill City last Thursday. Mrs. America Harvey and her grand-daughter, Miss Lois Harvey, who have been quite ill, áre out again. Mr. Leonard Blackwell, who has had soarlet fever, is  much bettor. Mr. M arshall Simms, who has been suffering intensely with his lame leg, is somewhat improved,   _ Miss Stellá Wool ridge is teaching the Wesley Chapel School. W e are sorry to note the ill ness of Miss Ella Caldwell and trust she may soon be restored to health.  The children of Mr. J . O OBrien, who have been siok, aie all about again. Miss M arguerite Coleman, who has been on an extended visit to her brother in Crewe, has returned home. Mr. Horaoe Dixon, of Crewe, was a visitor a t Mr. W, H. M organs Sunday. We understand hat the wed ding bells will be ringing all over the Southside before the close of 1918. Mrs. W. H. Morgan spent Thanksgiving a t her old home m Prince Edward. Mrs. Aliee Harwood was the guest of her son, Mr. A. R. Har wood recently. She came to see her new grandson, A. R. Junior. Little Misses Alioe and Eli nor Harwood are spending some time with their grand m other near Hixburg. Miss Grace Cheatham, of the Baptist Orphanage at Salem, V a , was a visitor at the home of her gnardian, Ex-sheriff S. P. Coleman, recently. Mr. and Mrs. Percy Sears and boys, of H ixburg, visited his sister, Mrs. A. R Harwood, last Sunday. Rah! rahl rah! for Henry Al len Odor, the champion eorn grower, not alone of Appomat tox but of Virginia. Now please remember th at he is one of onr Southside boys, and please remember also th at  we told yon so, as the old woman said when the cow swallowed the grindstone."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "of her gnardian, Ex-sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, recently. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "of her gnardian, Ex-sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, recently. Mr. and Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [419.75, 339.09, 573.56, 468.92], "bbox_id": "b1ed839da3", "file": "AppomattoxNewspapers_1898-1902a_0364.pdf", "page": 1, "text": "OUR OFFICERS. judge of Circuit CourtGeo. J. Hundley Court, first day of April and October. judge of County CourtD. A . Christian Courts, Thursday after first Monday, Clerk of Circuit andtounty CourtsGeo. T. Peer.  Atomey for CommonwealthH. D. Flood. S h e riff S. P. Coleman. T re a s u re r D. Mott Rvbertson. Board of SupervisorsW. H. Ligon, chair man  8. C. Stratton and J. C. Jones. Board meets on Wednesday after first Monday in March. June. September, and December. RELIGIOUS appointm ents ."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "s"], "snippet": "S h e riff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. T re a <mark>s</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "s"], "snippet": "S h e riff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. T re a <mark>s</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [389.3, 342.42, 544.93, 458.48], "bbox_id": "a521604c8f", "file": "AppomattoxNewspapers_1898-1902a_0384.pdf", "page": 1, "text": "OUR OFFICERS. judge of Circuit CourtGeo. J . Hundley. Courts, first day of April and October. Judge of County CourtD. A. Christian Courts, Thursday aft  a t Monday. Clerk of Circuit  C  o u n ty Courts Geo. T. 1eer. t  Atorney for CqmhnonwealthH. DFlood. Sheriff S. P. Coleman. TreasurerD. Mott Bwbertson. Buurd of SupervisorsW. H. Ligon, chair man  8. C. Stratton and J. C. Jones. Board meets on Wednesday after first Monday in March. June, September, and December."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "for CqmhnonwealthH. DFlood. Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. TreasurerD. Mott Bwbertson. Buurd"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "for CqmhnonwealthH. DFlood. Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. TreasurerD. Mott Bwbertson. Buurd"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [713.5, 780.42, 872.4, 1782.05], "bbox_id": "1e5ad30de0", "file": "AppomattoxNewspapers_1898-1902a_0555.pdf", "page": 1, "text": "order, delegates were lected for the nomination of a floater candidate for the House of Delegates for the counties of Appo mattox and Campbell. Eleven dele ates were electedthree from each magisterial district and two at large. Those elected by districts were a- follows SouthsideA. II. Clement, S. L. Ferguson, S. P. Coleman. Clover-11111Robert. B. Poore, W. P. Gills, Joe Tweedy. StonewallS. C. Stratton, S. P. Taylor, N. W. Owen. W. II. Ligon, ex-member of tiie House, and J. R. Horsley, the pre- eut member, were elected delegates at large. Mr. W. H. Ligon offered the fol lowing, which was adopted Whereas the next General Assem bly of Virginia will be of especial importance, requiring the best talent of the State and whereas we find in our countyman J. C. Jones, Esq., .ill the qualifications foi this posi tion, having proven himself a brave and faithful Confederate in time of the war which tried mens souls, an honest, industrious fanner, an ener getic and faithful public servant, whom his constituents have delight ed from time to time to honor, and a Democrat in whom there is no Re publican guile, as well as a Christ ian gentleman of the highest type therefore, Resolved, That our delegates be, and are hereby, instructed to cast the vote of this county solidly for -J. C. Jones, Esq., in the joint con vention which meets at Rustburg in Campbell county for the selection of a fioater candidate for the House of Delegates. Colonel R. B. Poore presented the resolution, and in doing so he paid a high tribute to Mr. Jones, who is a one-armed ex-Confederate soldier, a successful man of business, and in every way worthy of the honor con ferred on him. Mr. Jones has for a number of years been a member of the hoard of supervisors of Appo mattox. He has never before been a candidate for any other office. Before the meeting adjourned the party was reorganized by re-electing Mr. S. L. Ferguson chairman of the Executive Committee. All the old committeemen were re-elected, with the exception of Mr. W. J. Trent, whom Mr. W. P. Gills succeeds. The committee is now composed as follows ChairmanSamuel L. Ferguson. Clover-Hill DistrictW. P. Gill, Clover-Hill precinct J. W. Clark. Pamplins W, II. Ligon, Hixbnrg. Stonewall DistrictS. C. Strat ton, Stonewall precinct W. C. Ab bitt, Oakville A. B. Thornhill, for Agees. Southside DistrictJ. C. Jones, West Appomattox  S. J. Lee, Chap B. N. Tanner, Cheaiwood. Under the leadership of Mr. Fer guson, one of the most perfect or . gauizatious has been completed in Apponi ttox of any county in chc State. Mr. Ferguson has diplayed marked ability as an organizer, and has labored with untiring zeal for the success of his party, to which he has ever contributed of his time and his means."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Clement, S. L. Ferguson, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Clover-11111Robert. B. Poore, W."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Clement, S. L. Ferguson, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Clover-11111Robert. B. Poore, W."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [919.48, 1375.49, 1078.3, 1607.64], "bbox_id": "4f910e1c3c", "file": "AppomattoxNewspapers_1898-1902a_0379.pdf", "page": 1, "text": "O A LE OF VALUABLE TRACT.In pursu- O ance of decrees of the Circuit Court for Appomattox county, in Gills  Glenn vs. Win. A. Jones, and Coleman, Committee, vs. Wm. A. Jones consolidated, we will sellat auction on Til V RS DA Y, the 8 th of Novem ber, 1990. at Appomattox Court House, that being county court day, that valuable tract of Land devised by Wm. A. Jones, Sr., to his sou, Wm. A. Jones. It lies on Holiday Creek, in said county, and contains by recent survey 1596 acres. The upland is hilly, but the soil is good and there arc tine, low grounds on the creek. The main body ot the two story dwelling house was built of heart timber, and is well preserved, but the porches have fallen down. There are many cabins and out houses, but they are in bad repair. It has been sub-divided into five tracts392 acres, 527 acres. 3S7 acres, 95 acres, aud 191 acres, which arc more fully described on hand bills. We will sell in separate tracts, or the whole as we may realize the best prices. Mr. W alter B. Forbes, ou the land, and Mr. S. P. Coleman, at the Court House, have plats and will show tlie land to purchasers. TERMSTen per cent, cash, balance in 1, 2,3 and 4 years, bonds with waiver of home stead, good security, six per cent, interest from day of sale, and title retained till all the purchase money is paid, H. D. FLOOD, EAWARD S. BROWN, Commissioners.  aid commissioner have given the required bonds in said suits. GEO. T. PEERS, Ckrk."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "the land, and Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, at the Court House,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "the land, and Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, at the Court House,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1174.3, 1350.52, 1330.52, 1551.7], "bbox_id": "456e8e66b3", "file": "AppomattoxNewspapers_1898-1902a_0149.pdf", "page": 1, "text": "N VACATION OF THE CIKCUI T COUKJ _ of A ppom attox county, February 22d, 1896. . ii. guphens.......................................Plaiutitt. against Samuel Jones, Alexander Jones, W m. E. Jouet the last named a convict in the Penitenti ary of ViigiiDa, and S. P. Coleman, Sherih and Committee of said Wm. E. Jones, Jonn Jones, Ellen West, Albert Jones, Mary F. Jones, widow, and oilier heirs of Aiirec Jones, decd...................................Defendants. The object of this suit is to secure a con veyance of teal estate sold oy Allred Jones to the plaintiff and which was paid for by the plaintiff in the life time of the said Alfred Jones. And it appeuring by affidavit that the de fendant, W m E. Jones, is a convict in the Penitentiary of V irgiuiaand time tin defend ants John Jones, E.len West, aud Albert Joues, are not residents of this State, aud that the residence of Frederick Joues is unknown, it is ordered that they do appear ucie within fifteen days aider due pubiicatiou of this or der once a week for four successive weeks iu the Appomattex aud Lucking am T imes , a newspaper published in this S ate, and do whatever is necessary to protect their inter est in this suit. A copyTeste GEO. T. PEEKS, Clerk. H. D. F lood , i n n a. l . F erguson , i"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "ary of ViigiiDa, and <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sherih and Committee of"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "ary of ViigiiDa, and <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sherih and Committee of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1174.83, 1555.97, 1331.47, 1756.91], "bbox_id": "9346136cbf", "file": "AppomattoxNewspapers_1898-1902a_0149.pdf", "page": 1, "text": "N VACATION OF THE C1KCUIT COUHT _ of Appomattox county. F. bruary 22d, 189. The District School Board of Stonewall Dis trict of Appomattox county ........... Plaintiff. against Samuel Jones, Alexander Jones, Wm. E. Jones, the last named a convict in the Pen itentiary Jof Virginia aud s. P. Coleman, Sheriff, aud Committee of said Wm. E. Jones, John Jones, Ellen West. Albert Jones, Mary F. Jones, widow, aud other heirs of Alfred Jones, decd ...... Defendants. The object of this suk is to secure a con veyance of real estate sold by A tired Jones, to the pi intitf and which was paid for by the plaiatiff in the liie time of said Alfred Jones. And it appearing by auiduwt that the de fendant W m. E. Junes is a convict iu the Penitentiary of Virgiuia, and that 1 he defen dants John Julies, Ellen W eei and Albert Jones are not residents of this state, and that the residence 1 Frederick Jones is unknown, it is ordered that they do appear here within fifteen days alter due publication f this or der once a week for four successive weeks in the Appomattox and Buckingham T imes , a newsp per published in this btate, and do whatever is necersan to protect their inter est is this suii. A copyTeste UKu. T. PEEKS, Clerk. H. D. F lood , S. L. F erguson ,"}, "highlight": {"text": {"matched_tokens": ["s", "P", "Coleman"], "snippet": "itentiary Jof Virginia aud <mark>s</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff, aud Committee of"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "P", "Coleman"], "snippet": "itentiary Jof Virginia aud <mark>s</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff, aud Committee of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1541.01, 896.21, 1706.21, 943.16], "bbox_id": "65d7eebeb6", "file": "AppomattoxNewspapers_1912-1915a_0531.pdf", "page": 1, "text": "Mrs. S. P. Coleman, who soffered a slight stroke of paralysis last week is reported somewhat better this morning"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who soffered a slight stroke of paralysis last week is reported somewhat better this morning"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who soffered a slight stroke of paralysis last week is reported somewhat better this morning"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2204.21, 846.01, 2363.46, 906.91], "bbox_id": "e5657cc5ef", "file": "AppomattoxNewspapers_1905-1912a_0453.pdf", "page": 1, "text": "Mrs. S. P. Coleman is spend ing sometime with her sick brother, Mr. 0. b. Cawthorn, near Evergreen. W. G leman"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is spend ing sometime with her sick brother, Mr. 0. b. Cawthorn, near Evergreen. W. G leman"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is spend ing sometime with her sick brother, Mr. 0. b. Cawthorn, near Evergreen. W. G leman"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.7, 1045.98, 1814.07, 1541.5], "bbox_id": "c5b0a0d542", "file": "AppomattoxNewspapers_1915-1918a_0545.pdf", "page": 1, "text": "Mrs. S. P. Coleman Dead Mrs. S. P. Coleman, sr., died May 15. She was laid to reBt in the home cemetery on May 117. She was born June 11,1849. She is survived by her husband, 8. P. Coleman, sr. five daugh ters and three sonsMrs. J. S Plunkett, Mrs. T. W. Odor, Mrs J E. Odor, Mrs. Clinton ICawthon and Miss Emma Sue Hubard Joel T. and William Pat also one brother and sis terJoel T. Cawthon and Mrs. Kate Cheatham. She was a true wife and faith Iful mother and kind neighbor She tried to treat all alike she was a good Christian woman. I have known her for nearly 48 years she always read her Bi ble and would pray to her God for strength and guidance she spoke ill of no one. She had been in declining health for thelast six years but for the last two years had I grown worse gradually but  not alarmingly so until the day before her death she began to sink about 4 p. m. and died the next morning at about 3 a m. She was a great hand to wait on the sick she never tired,un- til ber health failed she was always ready to any response at the sicks call. She has gone to reap her reword for deeds of love and charity. She,was a member of Liberty Baptist  church. She had been married 50 years."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "S", "P"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Dead Mrs. <mark>S</mark>. <mark>P</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "S", "P"], "snippet": "Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Dead Mrs. <mark>S</mark>. <mark>P</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1593.61, 593.81, 1755.46, 890.35], "bbox_id": "328dca2ca4", "file": "AppomattoxNewspapers_1922-1923a_0562.pdf", "page": 1, "text": "Mrs. Bettie A. Woolridge died at the.home of her son, Mr. W. W Wooldridge near Evergreen Monday the 18th. The deceased was in the 68th year of her age, and was a sister of Mrs. S. P. Coleman, and C. Cawthorn, and was reared in this county. She was twice mar ried, her first husband was the late E. B. Harvey, who was killed in battle at Gettysburg, secoudj the late William P. Wooldridge. Three children survive,herMessrs. Jeter, Moody and Rosser Wooldridge and Mrs. John Pugh, who reside in this county. Mrs. Wooldridge wa9 a woman of fine character and was highly esteemed and widely known Her funeral was preached by her pastor, Rev- Mr. Hubble and her remains were laid to rest in the old Jamily burying ground near Wes ley Chapel Wednesday. The be eav d family have the sympathy of a large circle of friends."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "a sister of Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and C. Cawthorn, and"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "a sister of Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and C. Cawthorn, and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.74, 595.7, 1762.28, 892.26], "bbox_id": "e077c3563b", "file": "AppomattoxNewspapers_1922-1923a_0563.pdf", "page": 1, "text": "Mrs. Bettie A. Woolridge died at the.home of her son, Mr. W.  W Wooldridge near Evergreen Monday the 18th. The deceased was in the 68th year of her age, and was a sister of Mrs. S. P. Coleman, and C. S. Caw thorn, and was reared in this county. She was twice mar ried, her first husband was the late E. B. Harvey, who was killed in battle at Gettysburg, secoudjj the late William P. Wooldridge. Three children survive.herMessrs. Jeter, Moody and Rosser Wooldridge and Mrs. John Pugh, who reside in this county. Mrs. Wooldridge was a woman of fine character and was highly esteemed and widely known Her funeral was preached by her pastor, Rev- Mr. Hubble and her remains were laid to rest in the old family burying ground near Wes ley Chapel Wednesday. The te eavd family have the sympathy of a large circle of friends."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "a sister of Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and C. <mark>S</mark>. Caw"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "a sister of Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, and C. <mark>S</mark>. Caw"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2129.49, 401.21, 2293.44, 546.35], "bbox_id": "c9b73bce92", "file": "AppomattoxNewspapers_1922-1923a_0449.pdf", "page": 1, "text": "Mr. T. W. Odor has been quite sick. Ex-Sheriff S. P. Coleman is in Lunenburg. Mr. J. T. Coleman returned home last week. Mr. and Mrs. Clinton Cawthorn and sweet little girl, Nellie, visited her parents here Sunday. Mr. James Mann is having an addition built to his nice little house near Forest."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "been quite sick. Ex-Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is in Lunenburg. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "been quite sick. Ex-Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is in Lunenburg. Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1656.48, 487.92, 1812.58, 1196.06], "bbox_id": "c2309c30d9", "file": "AppomattoxNewspapers_1915-1918a_0575.pdf", "page": 1, "text": "Mr. Leslie Dixon, of Gamp Lee, spent Sunday w ith home oeople near Appomattox. Mr. W. P. Coleman, of U ni versity, Va., was to see home people last week-end. Mr. Adolphus Plunkett, of Lynchburg, is visiting his brother, Mr. J. 8 . P lunkett, this week. Mr. and Mrs. Clinton Caw- thorn and daughter, Nellie, spent the week end w ith her father, Mr. S. P. Coleman. Mr. E lijah Oawthorn, of Ev ergreen, spent Sunday in this vicinity. Mr. Oscar Cole, of U niversi ty, V a., spent last week-end with his parents, Mr. and Mrs. J. F. Cole. Miss Ethel Miller, of Ever green, was the guest of Mrs. J. F. Cole on Sunday. Mr. and Mrs. J . R. Coleman and fam ily, of C harlottesville, are spending some tim e with Mrs. A nna E Coleman. Mr. Mace Coleman and fam i ly, of W ashington, m otored to his home here and have retu rn  ed to the Capital. Mr. P. P. Plunkett, of Crewe, spent last week w ith home peo ple. Miss M arguerite Coleman, of Crewe, spent the week-end w ith relatives in this neighbor hood. Mr. Pieroe Odor, who had been visiting his home people, returned to Baltim ore on S un day. Miss Mary D. M arshall w as a guest uf Miss Sue Odor last week. Miss E tta Coleman, from Lynchburg, spent Sunday w ith home folks. Mr. W illie Cheadle, of H urts- ville, was a guest recently of her m other, Mrs. A nna Cole m an. Mr. and Mrs. Clem Coleman, of Lynchburg, spent a few days visiting relatives here re cently, Mr. J. W. Coleman and chil dren visited his m other the past week."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "ith her father, Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Mr. E lijah Oawthorn,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "ith her father, Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Mr. E lijah Oawthorn,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [609.85, 1830.46, 768.67, 1963.8], "bbox_id": "b2056fc176", "file": "AppomattoxNewspapers_1898-1902a_0226.pdf", "page": 1, "text": "Mr. J. R.Horgley has appointed the following delegatee to the De- mofiratic convention which meets at Campbell Courthouse on the 30th inataut Messrs. S. P. Coleman, S. L. Ferguson, J B. Abbitt, D. Mott Robertson, A. H. Howerton, H. D. Flood, W, H- Digon, J. W. Wright, R. P, Sears, A. B, Thornhill, S. C, Stratton, M. W. Carson, W. D, Doss, J. S. Phornbill, R. B. Poore."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "the 30th inataut Messrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, <mark>S</mark>. L. Ferguson, J"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman", "S"], "snippet": "the 30th inataut Messrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, <mark>S</mark>. L. Ferguson, J"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1946.9, 1295.19, 2116.07, 1515.19], "bbox_id": "40b01279b3", "file": "AppomattoxNewspapers_1905-1912a_0223.pdf", "page": 1, "text": "Mr. Geo Coleman Jr., who is at work beyond Petersburg, spent  Sunday with his home folks. H- reports a light snow in tnat section Friday night. Mrs. S. P. Coleman is spending I sometime with daughter, Mrs. Ellir l Odo . Little Elva Coleman, who spent the summer with her graudmotbe  here 7 has been very ill with scarlet l fever at her fathers home in the Hill City. We are glad to tepor her condition as much better. Miss L zzie Wingfield returned I to her place of business in Lynch burg on Friday, after a long absence I caused by ill-health."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "section Friday night. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is spending I sometime"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "section Friday night. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is spending I sometime"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.48, 575.4, 1752.37, 1387.53], "bbox_id": "394d66361b", "file": "AppomattoxNewspapers_1902-1905a_0125.pdf", "page": 1, "text": "Mr. A. H. Clement desires it to be understood that he is in the can vass and will endeavor to visit the homes of the people of the county, but that he has been interfered with n some respects by unforeseen cir cumstances. The Baptist ministers of the Ap pomattox Association will meet to day to discuss the needs of the field ind to arrange a tentative program for the Association which meets at Charlotte C. H., August 18. Rev. Hugh Smith attends from this place. Capt. R. S. Echols, who was so badly injured by the wreck between Petersburg and Richmond last Fri day and who was reported to have been killed, is now here on a fair way to permanent recovery. Engi neer Covington and Fireman Cov ington, of the ill-fated train, were killed. All of these gentlemen were well and favorably known in this, county. The following officers qualified on Monday before Judge Christian in the county court, their terms being extended to January 1,1904, under the new Constitutiou S. P. Coleman, sheriff Leon. E. Smith, commissioner of revenue J. W. Paris, superintendent of poor J. R. Horsley, county surveyor W. H. Ligon, J. C. Jones, supervisors. R. F. Burke qualified as treasurer, vice l. Mott Robertson, resigned. It is rumored that T. J. Stratton will stand for road Commissioner in Stonewall, J. F. Dickerson for Gloyer Hill, and Hon. J. C. Jones- and Saml Lee has announced them selves candidates in Southside. No candidate has come out for Super visor for Stonewall, and Hon. W. Hi Ligon has no opposition in Clovef Hill for his old place on the board. Messrs. J. H. Robertson and Ed ward Harvey are candidates for Supervisor from Southside. Quite a surprise was sprung on the village yesterday when Mr. W. D. Cofer, came down from Blue field, W. Va., and secured a license for the marriage of Miss Lizzie Fleshman, which happy event will be celebrated to-day at the home of the brides father in a quiet way. The brides pastor Rev. Hugh C. Smith will officiate. The couple will leave on the evening train for a trip east and will be permanently located in Bluelield, where the groom holds a lucrative position with the N.  W. Ry. Co. The bride is a very charming young lady and de- servingly popular with"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "under the new Constitutiou <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff Leon. E. Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "under the new Constitutiou <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, sheriff Leon. E. Smith,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.59, 346.31, 2122.19, 1749.08], "bbox_id": "d6695d9fe1", "file": "AppomattoxNewspapers_1915-1918a_0017.pdf", "page": 1, "text": "money wasted on useless expen. ditures be added to their now meager pensions. We demand that the State wide prohibition law shall be framed . In such a plain, straightforward form that it cannot be misunderstood by any one, and that it shall carry out the full wishes of the people as expressed in the State-wide election. We demand the strictest economy in the handling of tb county money, and that it shall be expended so as to promote the good of every section of the county. We demand that taxation shall be equal and uniform in the eounty, and that assess ments Of property should be made without favor or dis crimination. . We demand that no more tax shall be levied upon and exact ed, from the people of the county than is absolutely need ed for an econo Aical adminis tration of the affairs of the county. We demand the abolition of every unnecessary office in the oounty and State, and if need be, we favor an amendment of the State Constitution so that this end may be accomplished. We demand the abolition of the office of Road Commission er in the Districts of the oounty We regard it as a useless and unnecessary expense and tax upon the people. We oppose tne duplication of public office We demand that an itemized account of the County and District funds and expenditures shall be published annually in some newspaper of large circu lation in the county. We demand that every ap pointment to office in the county shall be made solely with reference to capacity and fitness, and net as tne reward of favors rendered or expected to be rendered. Wo believe in public educa tion and to make the Public School System of the count efficient and-useful. We de mand that inthe appointment of Superintendent, School True tees and Teaohers there shall ie no consideration other than capaoity and fitness for the duties to be performed, and we demand that the benefits of the School System shall be extended to every section of the oounty, without favor or  iscrimination. We are in lavorof the State Board of iducation . consisting only g members elected, by the people We favor thé election by the teople of Circuit Judgee, Ichool Superintendents and trustees. We are in favor of good public roads and demand ibàt bey be constructed so as to benefit ever section of the county and not speoial sections and certain special people. We oppose any scheme, how. ever, for public road building or improvement which would evy a tax on the people of the oounty without their consent irst obtained in an election for that purpose. We declare that the people of Appomattox are taxed to the point where patience has ceased to be a virtue. In 1899 the State government required 3,675,507.00 whereas in 1914 it extracted from the peoples pockets 7,118,678.00 almost 100 more while the opulation increased only about 10? I d 1899 the population of Ap pomattox Co. was 9,662. In 1914 8,904. The population has decreased nearl 8 while taxes have gone on steadily increasing. We declare that all elections ought to be free, fair and hon est and we demand that the officers Of election at all elec tions shall be appointed solely with the view of arriving at 1 free, fair and honest exprès sion of the peoples will. We demand the repeal of the law pensioning Judges of the Court of Appeals. We demand th at the tax on Rolling Stock of Railroads be given to the localities as under the Nelson Bill. S. P. Coleman then calle upon the meeting to put the resolutions into effect by nomi nating and electing officers for that purpose Dr. Robertson at this point addressed the meeting in an swer to an address issued by the Democratic Executive Com mittee and declared it made personal reference to him. He said  we are called sore heads it is not so we have borne the burden so long oar shonldors"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "under the Nelson Bill. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> then calle upon the"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "under the Nelson Bill. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> then calle upon the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.52, 1412.21, 1542.82, 1508.86], "bbox_id": "943ca87404", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "Messrs. Flood,  Fleshman, Fergu son and Franklin, Counsel for Sher-  iff S. P. Coleman in the case brought  sgainit him for damages in the Cir- i cuit Court of Buckingham by Gillis- pie are all attending Buckingham  Court this week. Mr. Flood of r counsel for the defendant demurred"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Counsel for Sher-  iff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> in the case brought"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Counsel for Sher-  iff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> in the case brought"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2207.73, 687.86, 2369.37, 1468.5], "bbox_id": "563a539da7", "file": "AppomattoxNewspapers_1905-1912a_0395.pdf", "page": 1, "text": "mediate neighborhood has es caped. We are glad to note that Mrs. Osoar Cheatham, from near Reedy Springs, who has been so very ,11 with typhoid fever, is better. Mrs. Dugta Marshall is also abut well. Mrs S P Coleman is spend ing some time with hqr daugh ter, Mrs. Clinton Cawthorn, who is sick. Mr. and Mrs. Ben Cole and little Byron, nd Mr. Osca Cole left Friday to visit rela tives in Pittsylvania. Miss Florence Morgan and brother, Tunstall, entertained the Social Club most charm  ingly at their fathers home near your town recently. Mrs. Paul W arren and child ren, of South Norfolk, are visit ing her parents at Mountain View. Mies Elvyn Coleman has also returned homo after quite hn extended visit with her sister in Victoria and South Norfolk. Mr. Obie Mann, of High Bridge, visited his parents, Mr. and Mrs. Hm Mann, recently Messrs. Gilliam and Leslie Vianij. who have been nick, are out ajgain. Little Miss Mabel Plunkett, who has been visiting relatives in the Southside, has returned home. Mr. Geo. Coleman, who has been spending the week at home, returned to his work at Petersburg on yesterday. Mr. Allen Odor, of Pocahon tas, W. Va., visited his uncle, Mr. T. W. Odor last week. Rev. Thomas Fitzgerald, of Huntington, W. Va., visited his sister, Mrs. Anna Coleman, last week. Protracted meeting is in pro gress at Central Church this week. Mr. and Mrs. J. T. Cawthorn visited relativesthe family of Mr. A. B. Thornhillnear Tower Hill, recently. We have heard a piece of good news recentlyth at is if it is trueand some of us are rejoicing. A school-wagon is to be run from this part of the Southside to our High School. But of course it is 00 good to be true."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "also abut well. Mrs <mark>S</mark> <mark>P</mark> <mark>Coleman</mark> is spend ing some"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "also abut well. Mrs <mark>S</mark> <mark>P</mark> <mark>Coleman</mark> is spend ing some"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1681.46, 383.82, 1833.09, 418.07], "bbox_id": "05d5b5a617", "file": "AppomattoxNewspapers_1898-1902a_0353.pdf", "page": 1, "text": "Master Mainard Fowlkes, of Lu nenburg C. H., is visiting his grand father Mr. S. P. Coleman near hen-."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Master Mainard Fowlkes, of Lu nenburg C. H., is visiting his grand father Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> near hen-."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Master Mainard Fowlkes, of Lu nenburg C. H., is visiting his grand father Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> near hen-."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.65, 1199.35, 1686.16, 1233.85], "bbox_id": "402868d517", "file": "AppomattoxNewspapers_1918-1922a_0024.pdf", "page": 1, "text": "ma Coleman and Mr, S. P Coleman. The will was writ ten in deceaseds own band."}, "highlight": {"text": {"matched_tokens": ["Coleman", "S", "P", "Coleman"], "snippet": "ma <mark>Coleman</mark> and Mr, <mark>S</mark>. <mark>P</mark> <mark>Coleman</mark>. The will was writ ten in deceaseds own band."}}, "highlights": [{"field": "text", "matched_tokens": ["Coleman", "S", "P", "Coleman"], "snippet": "ma <mark>Coleman</mark> and Mr, <mark>S</mark>. <mark>P</mark> <mark>Coleman</mark>. The will was writ ten in deceaseds own band."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.28, 866.67, 2000.02, 1196.11], "bbox_id": "69b5ce9691", "file": "AppomattoxNewspapers_1892-1898a_0240.pdf", "page": 1, "text": "like again, Defool and his Sardauapalus came next. It reminds me of de Reformation of old Like the venerable John Knox tak ing his text. De fool made a terrible blunder, in this, Im told. Maude Mulcher was next on de list De fool played de Judge in dis act He tried to make love to Maude Mulcher But in this he also got hacked. De Speech, Befo de wah, came next De bride and de groom followed soon arter When de fool played de passon, you bet De house shook, de audience split with laughter, Wanteda servent, and Josh soon followed den hands in favor of the b  iu  m. s . . napr8 den H i of de white folks just hollowed being 40.84, with interest on 32, 40, from 1st day of January, 1893, and the cost of executing this sale, The sale will take place at 11 oclock, A. M. Terms of sale Cash. S. P. Coleman, Sheriff of Appomattox Co. 20-4t"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.75, 441.36, 2033.15, 1217.26], "bbox_id": "cfb831b802", "file": "AppomattoxNewspapers_1892-1898a_0067.pdf", "page": 1, "text": "Let Us Have tbe School. E ditor T imbs  I saw an editorial in your excel lent paper some time ago, regarding a graded school at this place. I heartily concur with you about it. It is a good idea, and one that onr citizens shonld take hold of and stop talking of it as an impossibility. Certainly, there is nothing more needed in this vicinity than a good school. Look around here and see what poor advantages onr children have, oompared with the children of other counties. Prince Edward has, within its borders, both a male and female college. Buckingham,through the munificence of Gen. T. M. Lo gan, has a splendid graded school Charlotte and Campbell children both have advantages that are denied ours. If yon will stop a minute yon can see how easy we can get a school here, at a very little coat to any one person. If yon will allow me I will suggest a plan to get it np Suppose some of the leading young men take this m atter in hand and start a subscription to raise funds. We only need abont 500 to start on, and I am certain that the people of old Appomattox can raise it with very little trouble. I wonld Bnggest that Sheriff S. P. Coleman take one of the subscrip tion lists around, as he has proven himself very good at that kind of work and he wonld be particularly interested in this m atter as he has some little ones yet to be educated. Mr. R. F. Burke wonld also make an efficient solicitor, and he is deeply interested in the m atter. There are a number of others I could mention who will do all in their power for the school. I am a great believer in hitting while the iron is hot. - Now, as public opinion is some what aroused on this snbject, let the good people of Appomattox have a mass meeting to put the scheme on foot at once. As yon said in yonr editorial on this snbject, Rome was not bnilt in a day but I never saw a school house as large as the city of Rome, however. It will be remem bered that the founders of Rome went to work and worked hard until it was quite a city, well fortified. We do not wish to build a Rome, bnt a good school. Now let every man p at his shchlder to the wheel, and I am confident a suitable school house will be erected at this place in the nettfrfuture. J. A."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "wonld Bnggest that Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> take one of the"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "wonld Bnggest that Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> take one of the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1956.48, 1473.1, 2117.47, 1769.64], "bbox_id": "e1a3f09ca0", "file": "AppomattoxNewspapers_1905-1912a_0027.pdf", "page": 1, "text": "Landon Cole t-uleilaiued a number of their friends on Ftiday evening. All re ports most delightful time Wt are glad to learn that Mrs William Morgan, who has beeu ill is bett-r. Mr. John Mann and several of his childr-u are sick with lagripp Mrs. Ellis Oder is still improving The death of little Hsmner Caw thon was a great shook to many iu this community. We extend onr sympathy to the b.-reaved ones.  Just be still and know that 1 am G d. Mr. William Younge of Prince Edward, stopped over at Mountain View on Sunday last. He was en route for The Hill City where be has accepted work Ex She iff S. P. Coleman, his sou 8am and daughter Miss Emms and Mr. T. W. Oder visited Mr. Clinton  a vthon on Sunday"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "work Ex She iff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, his sou 8am and"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "work Ex She iff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, his sou 8am and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.59, 681.35, 1415.17, 898.27], "bbox_id": "7c339083dc", "file": "AppomattoxNewspapers_1926-1933a_0048.pdf", "page": 1, "text": "jompson will jHubbell in fmeetings a t  Hat Creek yer meeting ng will be ii Jons- W ke Delicious e at 1.25 . pei time. T. C ole . mattox, Va. r and daugh Malrie am andson, J. W. hmond, motor ithe week-end S. P. Coleman."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "hmond, motor ithe week-end <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "hmond, motor ithe week-end <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2349.83, 1363.41, 2510.53, 1639.32], "bbox_id": "d290ba39a6", "file": "AppomattoxNewspapers_1902-1905a_0505.pdf", "page": 1, "text": "It Pays to M H Us. Satifaction guaran- anteed. Isbell, Bowmah  Co. ___________ Lynchburg. Va. IN THF. CLERKS OFFICB OF APPOMAT TOX CIRCUIT COURT, in vacation, Aprl 6th, 19. Wm. Talbot, Plaintiff against S. P. Coleman, She Iff and Admr of Monroe Walker, deceased Hester Walker, Sidner Walker. William Walker, and the other being at law of said Monroe Walker de- deueused. Defendants. IN CIl 4NOKHY The object of this suit is to subject the real estate of the said Monroe Walker, de ceased, to the paymeutota Judgment la favor of the plaintiff against the estate of said Monroe Waiker. and it appearing by affidavit filed that the defendant. William Walker. Is not a resident of this State, and that due dili gence has been used to ascertain tho residence of the defendant. Hester Walker, and servo process on him, without effect -It is ordered that the said William Walker and Hester Walker do appear hero within nfteen days after duo publication of this order once a week for four successive weeks in the A f - POMATTOX AND IIUCKINGHAM TIMES, a paper published In the Htate, and do what ever may bo necessary to protect their in terest in this suit. Q A Copy-Teste G ko . T. PnB8t Lee  Thompson, p. q."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Wm. Talbot, Plaintiff against <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, She Iff and Admr"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Wm. Talbot, Plaintiff against <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, She Iff and Admr"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1614.25, 381.85, 1754.68, 444.7], "bbox_id": "0f47fc626e", "file": "AppomattoxNewspapers_1898-1902a_0330.pdf", "page": 1, "text": "IS. ney for CommonwealthH. D. Flood. jiff _ s. p, Coleman. gurerD. Mott R.ibertson. i of SupervisorsW. H. Ligon, chair Ijg. C. Stratton and J. C. Jones. Board Ton Wednesday after first Monday in June, September, and December."}, "highlight": {"text": {"matched_tokens": ["s", "p", "Coleman"], "snippet": "CommonwealthH. D. Flood. jiff _ <mark>s</mark>. <mark>p</mark>, <mark>Coleman</mark>. gurerD. Mott R.ibertson. i"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "p", "Coleman"], "snippet": "CommonwealthH. D. Flood. jiff _ <mark>s</mark>. <mark>p</mark>, <mark>Coleman</mark>. gurerD. Mott R.ibertson. i"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2295.35, 1403.2, 2464.24, 1771.76], "bbox_id": "ab1a73b8c8", "file": "AppomattoxNewspapers_1902-1905a_0521.pdf", "page": 1, "text": "IN THE OLEHK8 OFFICE OF APPOMAT I t OX C IBCUIT COUHT. in vocation, Apri 6th, 1935. Wm Talboti plaintiff against s P Coleman, She iff and Admr of Monroe Walker, deceased H e ste r Walker, Sidnei Walker. William Walker, and the other being at law of said Monroe Walker de deceased, Defendants. in chanobuy  The object of this suit is to subject th real estate of the said Monroe Walker, de ceased. to the payment of a Judgment la tavor of the plaintiff against the estate of eW Monroe Walker, and it appearing by affidavit I hied that the defendant. Will lain Walker. Is I not a resident of this Htato, and that due dill- I irence has been used to ascertain tne residence  of the defendant. Hester Walker, and rorvo  process on him, without effect it is ordered  that the said William Walker and lioster  Walker do appear hero within ttfteonuyi I after due publication of this order once   week for four successive weeks in the oai- I POMATTOX AND flITOKINOHAM   2?  paper published in the mate, and do what- I ever may be iieceHsiiry to protect their I teroHt in this suit. PlgRa I A CopyTeste G eo . T. P ejbbs 1 A Copy Uio  Too. mpflon. p. i- EBitBi Clerk. WHITES NOAHS ARK Is the one groat bargain store. They are on the look o u t fo r bargains every day everywhere, ruin o r shine, where the are to be got, ind th ey ve got the oasn to buy  them . Anyone with a champaigno appetit I and a persimmon beer income, can llnd bar-  gains an y tim e ho drops in If he cant come t here Is still a chanceWrite us. I -t at  Shoes Hats. Clothing, Ladles reauy   Dry Goods. Ac. Agents for CygoU-Vito J I and many other well-known brand., or Shoe I WHITES DEPARTMENT 8TOK9. Call- I the sequel will show why. _____ I To U ure a Cold In On D ay I Take Laxative Bromo Quinine Tab- I lets. All druggists refund the 1 money if it fails to cure. E. W . Groves signature in each box. 25e"}, "highlight": {"text": {"matched_tokens": ["s", "P", "Coleman"], "snippet": "Wm Talboti plaintiff against <mark>s</mark> <mark>P</mark> <mark>Coleman</mark>, She iff and Admr"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "P", "Coleman"], "snippet": "Wm Talboti plaintiff against <mark>s</mark> <mark>P</mark> <mark>Coleman</mark>, She iff and Admr"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1967.5, 1396.13, 2451.34, 1693.66], "bbox_id": "fe3b8c0381", "file": "AppomattoxNewspapers_1902-1905a_0513.pdf", "page": 1, "text": "IN THE CLERKS OFFICE OF APPOMA I t OX CIKCU IT COURT, in vacation, A pn 6th, 1936. Wm TallK,ti plaintiff against S. P. Coleman, She, iff and Admr of Monro Walker, deceased H ester Walker, Sidne W alker. William W alker, and the otheff being a t law of said Monroe Walker d deceased. Defendants. in cii vnceky  The objeot of this suit is tc subject tfi real estate of tho said Monroe Walker, do- ceased, to thepaym entofa judgment iafavM of the piaintlff against the estate or sajft . Monroe Walker, and It appearing by amdavt filed th at tho defendant, william walker. 1 not a resident of this State, and that due dlU- irenee has been used to ascertain the resideno of the defendant. Hester Walker, and s e rrj process on him, w ithout effect it is orderea th at the saW William Walker and Heste W alker do appear here within fifteen day after duo publication of this . order once  week for four successive weeas In tne AJ pom attox AND UucKiNGnAMT im es , anew , paper published in the State, and do w hat ever may be necessary to protect their ifiv- tercst In this suit. _ 0_a j A CopyTeste G eo . T. P eeb S. J Loo  Thompson, p. q. w e m m FARMERS! LOOK HERE! T he New York Tribune Farm er  20 pages.illustrated, HI y UIUTUU URU KUwii -v- - -----   W dale Baldwin, who departed this life I every weekthe best paper one year ago today, May 17 , 1904 . for  arm p rice i.oo."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Wm TallK,ti plaintiff against <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, She, iff and Admr"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Wm TallK,ti plaintiff against <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, She, iff and Admr"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1014.52, 521.58, 1486.4, 701.27], "bbox_id": "78cd50020f", "file": "AppomattoxNewspapers_1949-1952a_0059.pdf", "page": 1, "text": "IN MEHORIAM ------ PATTESON In lovimr sv-ed requirements here. Pbone 6B. 0f our mother, Mrs. Ola T P Coleman s Feed  Seed Store. j who left us three years  -------------------------------------------- --- r.uary 25, 1947. SPECIAL FLASH- Just received so lonely here without construct the building according to I n t   UM!! I J  t Ion ,ifes arehitects estimates of the cost. pOOFI G Ge rtf wlule  ot seem the saH lasts. For watterprojiisg  your you went away. NEW HOME or basement use fa-. fmous AQUELLA. Use CAMPS  Though your smile is gone f CESSPOOL  SEPTIC TANK J And your hands we cannot CLEANER, theres no better. F or shall never lose sweet m BUILDNG MATERIALS of all I f  description, see fi. h DeWITT C 551!ANY LYNCHBURG. VA- tM iric"}, "highlight": {"text": {"matched_tokens": ["P", "Coleman", "s"], "snippet": "mother, Mrs. Ola T <mark>P</mark> <mark>Coleman</mark> <mark>s</mark> Feed  Seed Store. j"}}, "highlights": [{"field": "text", "matched_tokens": ["P", "Coleman", "s"], "snippet": "mother, Mrs. Ola T <mark>P</mark> <mark>Coleman</mark> <mark>s</mark> Feed  Seed Store. j"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1359.38, 1061.86, 1515.48, 1660.76], "bbox_id": "56613b160a", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": "In Lim bo. The best piece of detective work hat has been done for some time, in his County, was done by Sheriff S. P. Coleman in the detection and rrest of Hugh Nixon, charged with Stealing an ox from Mr. Powhatan p.Goins, a citizen of this County. t seems that on or about the 20th of September last Mr. Goins lost an px which was his main stay in the preparation of his land for the crops, and Hugh Nixon having been seen Sn the neighborhood, the people began to suspect that he was guilty of the theft. A warrant was sworn out for his arrest and search was made for him but he was no where to be rfoiind. Our sheriff, who is always on the alert in apprehending and bringing before the Court all viola ters of the law, after weeks of labor in that direction, finally traced him to Richmond, and after he had fully satisfied himself as to his where jibouts, telegraphed the chief of Po lice of that City to arrest him, which was done immediately upon receipt of the telegram. Mr.  Coleman jin the discharge of his official duty, took Wade Scates to the Penitentary on Saturday and returning brought Nixon back with him. He is now safely lodged in jail to await his trial at the next term of the County Conrt. Nixon is a desperate character, bay mg been sentenced twice to impris ment in the State Penitentiary once or six years for horse stealing and or sixteen years for attempt at rape overnor McKinney however par ened him before he had served his entire term. If he is convicted this tone he will be sentenced for life, ping au old offender. Too much praise cannot he be stowed upon our Sheriff for the way in which he worked up the case against Nixou."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "was done by Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> in the detection and"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "was done by Sheriff <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> in the detection and"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [927.84, 604.49, 1087.42, 658.89], "bbox_id": "e65f9149b5", "file": "AppomattoxNewspapers_1902-1905a_0116.pdf", "page": 1, "text": "in as j been as j undivided upport. I am, Very respectfully, j S. P COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "in as j been as j undivided upport. I am, Very respectfully, j <mark>S</mark>. <mark>P</mark> <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "in as j been as j undivided upport. I am, Very respectfully, j <mark>S</mark>. <mark>P</mark> <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.73, 1132.06, 1512.62, 1215.08], "bbox_id": "e94bb0e3b3", "file": "AppomattoxNewspapers_1892-1898a_0225.pdf", "page": 1, "text": "I The Sale of th e S u rre n d e r house Postponed. The sale of the Surrender Honse I postponed until Saturday the 23rd, j day of March 1895 at 11 oclock. S. P. Coleman. Sheriff."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "1895 at 11 oclock. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>. Sheriff."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1640.15, 460.76, 1802.65, 598.0], "bbox_id": "43b91c804c", "file": "AppomattoxNewspapers_1898-1902a_0138.pdf", "page": 1, "text": "I respectfully announce myselt a candidate for re-election to the offioe of Sheriff of this county, and 1 promise if elected to serve the people faithfully as I have tried to do in the p a st this announce m ent is snbjeet to the action ot the Democratic prim ary. I thank tny friends for their kind support iu the past and hope it will be th eir pleasure to again elect me sherift. Respectfully, S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sherift. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sherift. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1632.71, 726.01, 1792.42, 864.21], "bbox_id": "692b685365", "file": "AppomattoxNewspapers_1898-1902a_0168.pdf", "page": 1, "text": "I respectfully announce myself a candidate for re-electiou to the offioe of Sheriff of this county, and I promise if elected to serve the people faithfully as I have tried tot uo in the past  this announce ment is subject to the action of the Democratic primary. I thank my friends for their kllid support iu the past and hope it will be tbeir pleasure to again elect me sheriff Respectfully, S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [524.63, 786.44, 684.21, 924.38], "bbox_id": "a5e1357579", "file": "AppomattoxNewspapers_1898-1902a_0149.pdf", "page": 1, "text": "I respectfully announce myself a candidate for re-election to the office of Sheriff of this county, and I promise if elected to serve the people faithfully as I have tried to do in the p ast this announce ment is subjeet to the action oi the Democratic primary. I thank my friends for their kind support in the ast and hope it will be their pleasure to again elect me sheriff. Respectfully, S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [433.89, 774.06, 599.15, 912.5], "bbox_id": "e5ba22568d", "file": "AppomattoxNewspapers_1898-1902a_0153.pdf", "page": 1, "text": "I respectfully announce myself a candidate for re-election to the office of Sheriff of this county, and I promise if elected to serve the l people faithfully as I have tried  to do in the past this arfhounce- ment is subjeet to the action of the Democratic primary. I thank. P ony friends for their kind support in the past and hope it will be rtheir pleasure to again elect me sheriff. Respectfully, S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully, <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [463.89, 472.13, 624.59, 610.28], "bbox_id": "2ada57cdf1", "file": "AppomattoxNewspapers_1898-1902a_0139.pdf", "page": 1, "text": "I respectfully announce myself a candidate for re-election to the office of Sheriff of this comity, and I promise if elected to serve the people faithfully as I Lave tried to do in the p ast this announce ment is subjeet to the action of the Democratic primary. I tbank my friends for their kind support in the past and hope it will be their pleasure to again elect me sheriff. Respectfully. S. P. COLEMAN."}, "highlight": {"text": {"matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "COLEMAN"], "snippet": "elect me sheriff. Respectfully. <mark>S</mark>. <mark>P</mark>. <mark>COLEMAN</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [380.15, 1505.81, 540.8, 1776.9], "bbox_id": "23bb3cfcaf", "file": "AppomattoxNewspapers_1892-1898a_0244.pdf", "page": 1, "text": "Hoods pillls have won high praise for their prompt and efficient, yet easy action. Sheriffs Sale of Land in Appomattox County, Va. I will, on Thursday, tbe 20th day of June, 1895, sell at public auction, on the premises, in pursuance of an order of the connty court of Appo- mottox county entered at the Feb ruary term, 1895, the tract of land belonging to John Mehan, situated near Hixbnrg, in said connty, adjoin ing the lands of L. B. Glenn and others, and which was purchased by said Mehan from Wm D. Hix. This sale is to satisfy an execution in my hands in favor of the said Wm. D. Hix, the amount of said execution being 40.84, with interest on 32.- 40. from 1st day of January, 1893, and tbe cost of executing this sale. The sale will take place at 11 oclock, A. M. Terms of sale Cash. S. P. Coleman, Sheriff of Appomattox Co. 30-4t"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Terms of sale Cash. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Sheriff of Appomattox Co."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1728.46, 229.13, 1895.62, 672.67], "bbox_id": "dca361a53d", "file": "AppomattoxNewspapers_1905-1912a_0601.pdf", "page": 1, "text": "home near Reedy Springs. Mr. Grover Pugh is quite ill with fever at his home near Wesley Chapel. Mr. Jim Lee is repairing P r o m i s e d Land colored Baptist Church. We are glad to note that Mr. S. P. Coleman is getting better. Mr. and Mrs. George W. Coleman, Jr. are spending some time with his parents near your town. Mr. Luther Evans and daugh ter, of Campbell, have been visiting relatives in the South- side. We understand that Harveys Gate school will be moved and a school building built near old Wesley Chapel. Miss Elizabeth Harvey will teach the Rugby school next term and Miss Ma y GoJsey, of Cumberland, Long Creek. Miss Eleanor Coleman, of Lynchburg, is x visiting Mrs. Ben Cole. Mr. and Urs. Conrad Odor and children, of the Hill City, are visiting Mr. and Mrs. T W. Oder. We are glad to note that Mr. Ernest Abbitt is very much improved since his treatment at Memorial Hospital in Rich mond."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "to note that Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is getting better. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "to note that Mr. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> is getting better. Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1929.34, 1333.48, 2091.51, 1559.28], "bbox_id": "e6addfc2e4", "file": "AppomattoxNewspapers_1912-1915a_0141.pdf", "page": 1, "text": "her sister. Mrs. Ben Cole. Harry and Hubbard Plunkett, children of Mr. and Mrs J. S. Plun kett, are quite sick. Mrs. S. P. Coleman, who has been quite sick, is better. We are glad to note that Miss Lonise Wingfield, who is in a hos pital in Lynchburg, and who has been so ill, is improving. Mrs. Wm. Walker colored and her sister, Mazie Cheatham, are both quite ill near here. And now all the talk among the young folks is the commencement of the high school and the canning club. We are sure the latter is a fine thing and trust it may be a sue csss."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "are quite sick. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who has been quite"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "are quite sick. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, who has been quite"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1390.09, 1142.16, 1547.63, 1646.42], "bbox_id": "8b59887136", "file": "AppomattoxNewspapers_1926-1933a_0237.pdf", "page": 1, "text": "he Ladies A id Society ol Presbyterian church gave , Daniel Ford, a recent ide a shower at her home v here, Thursday evening.  affair took the form of a hie supper on the lawn. and M r s. J. E. Hicks, . and Mrs. Carrington nehburn, Mr. and Mrs. J. Johnson, of Lynchburg, ire the guests of their grand- ther, Mrs. Ann R. Durvum day. he W. M. U. of Liberty Bap Jhurch held its regular an il meeting fit the home of  Lou Cawthorn Wednes- A bountiful picnic lunch spread on the lawn and in afternoon an interesting ram was presented. _ _ i. D, Hunter and daugh- s, Misses Willie, Mabel, Eth- and little grandson, J- W- iter, Jr., of Richmond, were 0 !i Saturday and Sunday e home of S. P- Coleman, Reedy Springs. vicee .will be conducted Stonewall Presbyterian ,y Sunday, Sept. 28th, oclock, at wnich time E. Jjbdding, the pastor, reach  from the sixtn r of Matnew, by request feed A ar him. K i r s . M. P. Porter tgreepily surprised Sun- y a visit from Master rtelnd Mr. Cecil Stul- Betersburg. Both young ,re expert machinists at iubize Artificial Silk , ia Ifppewell."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sunday e home of <mark>S</mark>. <mark>P</mark>- <mark>Coleman</mark>, Reedy Springs. vicee .will"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sunday e home of <mark>S</mark>. <mark>P</mark>- <mark>Coleman</mark>, Reedy Springs. vicee .will"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [221.48, 1262.33, 1542.36, 1482.86], "bbox_id": "f3b7f682a5", "file": "AppomattoxNewspapers_1926-1933a_0238.pdf", "page": 1, "text": "have more education at twenty-one than nine-tenths of our school prod ucts.  c sees red thin!-, end the majority of school children dont see and dont think. Jhurch held its regular an il meeting at the home of kfLou Cawthorn Wednes- i  A bountiful picnic lunch I spread on the lawn and in k afternoon an -interesting ram was presented.  b 1. D, Hunter and daugh- 3 , Misses Willie, Mabel, Eth an little grandson, J. W. iter, Jr., of Richmond, were orpjtBaturday and Sunday e home of S. P. Coleman, Recgly Springs. .will be conducted"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Sunday e home of <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Recgly Springs. .will be"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Sunday e home of <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark>, Recgly Springs. .will be"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2224.1, 409.03, 2386.67, 775.18], "bbox_id": "ca1062dd9d", "file": "AppomattoxNewspapers_1922-1923a_0548.pdf", "page": 1, "text": "grapes and acorns. Mrs. Anna Coleman lost a fine cow last week from eating too much green corn. Mr. Robt. Holycroas has moved with his family to his fathers home near Hnrtsville. Miss Mamie Putney, the charm ing and aooomplished teacher of the Rooky Farm sohool, was the guest of her cousin, Miss Elvyn Coleman recently. Miss Mary Louise -Wingfield and Mr. Clyde Jaokson, Mr. aud Mrs. Samuel M. Thornton and Mr, George Wingfield visited relatives at Monntain View last week. Mr. and Mrs. Ellis Oder were visiting relatives in the neighbor hood last week. Mrs. S. P. Coleman who has been quite ill is better. Miss Bessie Coleman and brother returned from Buckingham last Sunday from attending the bnrial of their grand nother, Mrs. Martha Fitzgerald. A good woman and a loving devoted mother has gone to her reward Well done good and faithful servant enter into the joy of thy Lord."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "hood last week. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> who has been quite"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "hood last week. Mrs. <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> who has been quite"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [263.29, 474.95, 427.81, 750.9], "bbox_id": "1c7866af4f", "file": "AppomattoxNewspapers_1908-1909a_0187.pdf", "page": 1, "text": "GrandjuryG. D. Wilkerson, J. W. Durrum, R- Cor. Harvey, J. T. Rogers, C. E. Carson, C. M. Stratton Sr., J.N . Woolridge, E. H. Smith, W. H. Morgan, G. A. Scheffler, R. W. Johnson, Jno- C. Moore, Jr. Civil JuryC. T. Cawthorn, James W. Caldwell, HalF. Clark, Wm. D. Hix Jr., J. Robert Doss, G. 0, Gordon, J. L. Burkey, E. T. Mitchell, S. P. Coleman Jr. For Criminal trials  E. J. Marsh, E. C. Scruggs, Ernest Ferguson, J o e W. Davis, J. Baxter Marshall, H. H. Harvey, 0. R. Tames, M. A. Stratton, W. J. Kidd. J . C. Davidson, Luther E. Martin, W. W. OBrien W. Ti Mayberry, W. S. Bryant, T. A. King, W. Thos. Caldwell, H. G. Harding, Wm. J. Walton, B. L. Wheeler, dLO. Davidson."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Burkey, E. T. Mitchell, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Jr. For Criminal trials"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Burkey, E. T. Mitchell, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Jr. For Criminal trials"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [299.5, 524.67, 464.04, 801.32], "bbox_id": "ace7212052", "file": "AppomattoxNewspapers_1926-1933a_0187.pdf", "page": 1, "text": "GrandjuryG. D. Wilkerson, J. W. Durrum, R- Cor. Harvey, J. T. Rogers, C. E. Carson, C. M. Stratton Sr., J.N . Wooiridge, E. H. Smith, W. H. Morgan, G. A. Scheffler, R. W. Johnson, Jno. C. Moore, Jr. Civil JuryC. T. Cawthorn, James W. Caldwell, Hal F. Clark, Wm. D. Hix Jr., J. Robert Doss, G. 0. Gordon, J. L. Burkey, E, T. Mitchell, S. P. Coleman Jr. For Criminal trials  E. J Marsh, E. C. Scruggs, Ernest Ferguson, J o e W. Davis, J Baxter Marshall, H. H. Harvey O. R. Turnes, M. A. Stratton W. J. Kidd, J. C. Davidson Luther E. Martin, W. W. OBrien W. T. Mayberry, W. S. Bryant T. A. King, W. Thos. Caldwell i. G. Harding, Wm. J. Walton, B. L. Wheeler, J. 0. Davidson."}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "Burkey, E, T. Mitchell, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Jr. For Criminal trials"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "Burkey, E, T. Mitchell, <mark>S</mark>. <mark>P</mark>. <mark>Coleman</mark> Jr. For Criminal trials"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.31, 238.26, 1751.03, 635.19], "bbox_id": "391b1bf0da", "file": "AppomattoxNewspapers_1902-1905a_0535.pdf", "page": 1, "text": "go into his quarters. In a few min lutes the negro returned with his lantern lighted and wanted to know what the trouble was. Mr. Martin I questioned him about coming into Ibi8room and he denied it where- I upon Mr. Martin said he would fix j him and the negro left. The negro l did not leave the place, however. He was caught by Mr, Martin and tied in the stable. He was tempor arily left alone and the negro pro ceeded to take advantage of the chance got looe and left the county. He went to Lyt chburg as is shown I by .he above report from the News. 1 He is now safely behind the bars here and judge Hundley will give him a hearing on the fourth Monday in July, at which time the regular term of our Cii ouit Court will be  held. Souttiaide. There has been quite au influx of visitors in the Soutbside the past mon-h. Ml ses Lucy aud Annie Thornhill of Culpepper, visited their cousin Mrs. S. P- Coleman. Mr. W. Heiman Biightwell, of JFarmville, was visiting friends at Mountain View recently. Mr. and Mrs. Willie Cheadle, of Hurtsville and Mr. Luther Cole-"}, "highlight": {"text": {"matched_tokens": ["S", "P", "Coleman"], "snippet": "visited their cousin Mrs. <mark>S</mark>. <mark>P</mark>- <mark>Coleman</mark>. Mr. W. Heiman Biightwell,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "P", "Coleman"], "snippet": "visited their cousin Mrs. <mark>S</mark>. <mark>P</mark>- <mark>Coleman</mark>. Mr. W. Heiman Biightwell,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
